Repository: python/python-docs-es
Catalog: faq/design.po
Languages: es

source: Python 2.6 adds an :mod:`abc` module that lets you define Abstract Base Classes (ABCs). You can then use :func:`isinstance` and :func:`issubclass` to check whether an instance or a class implements a particular ABC. The :mod:`collections.abc` module defines a set of useful ABCs such as :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container`, and :class:`~collections.abc.MutableMapping`.
es: Python 2.6 agrega un módulo :mod:`abc` que le permite definir clases base abstractas (ABC). Luego puede usar :func:`isinstance` y :func:`issubclass` para verificar si una instancia o una clase implementa un ABC en particular. El módulo :mod:`collections.abc` define un conjunto de ABC útiles como :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` y :class:`~collections.abc.MutableMapping`.

source: For Python, many of the advantages of interface specifications can be obtained by an appropriate test discipline for components.
es: Para Python, muchas de las ventajas de las especificaciones de interfaz se pueden obtener mediante una disciplina de prueba adecuada para los componentes.

source: A good test suite for a module can both provide a regression test and serve as a module interface specification and a set of examples. Many Python modules can be run as a script to provide a simple "self test." Even modules which use complex external interfaces can often be tested in isolation using trivial "stub" emulations of the external interface. The :mod:`doctest` and :mod:`unittest` modules or third-party test frameworks can be used to construct exhaustive test suites that exercise every line of code in a module.
es: Un buen conjunto de pruebas para un módulo puede proporcionar una prueba de regresión y servir como una especificación de interfaz de módulo y un conjunto de ejemplos. Muchos módulos de Python se pueden ejecutar como un script para proporcionar una simple "autocomprobación". Incluso los módulos que usan interfaces externas complejas a menudo se pueden probar de forma aislada utilizando emulaciones triviales de "stub" de la interfaz externa. Los módulos :mod:`doctest` y :mod:`unittest` o marcos de prueba de terceros se pueden utilizar para construir conjuntos de pruebas exhaustivas que ejercitan cada línea de código en un módulo.

source: An appropriate testing discipline can help build large complex applications in Python as well as having interface specifications would. In fact, it can be better because an interface specification cannot test certain properties of a program. For example, the :meth:`!list.append` method is expected to add new elements to the end of some internal list; an interface specification cannot test that your :meth:`!list.append` implementation will actually do this correctly, but it's trivial to check this property in a test suite.
es: Una disciplina de prueba adecuada puede ayudar a construir grandes aplicaciones complejas en Python, así como tener especificaciones de interfaz. De hecho, puede ser mejor porque una especificación de interfaz no puede probar ciertas propiedades de un programa. Por ejemplo, se espera que el método :meth:`!list.append` agregue nuevos elementos al final de alguna lista interna; una especificación de interfaz no puede probar que su implementación :meth:`!list.append` realmente haga esto correctamente, pero es trivial verificar esta propiedad en un conjunto de pruebas.

source: Writing test suites is very helpful, and you might want to design your code to make it easily tested. One increasingly popular technique, test-driven development, calls for writing parts of the test suite first, before you write any of the actual code. Of course Python allows you to be sloppy and not write test cases at all.
es: Escribir conjuntos de pruebas es muy útil, y es posible que desee diseñar su código con miras a que sea fácilmente probado. Una técnica cada vez más popular, el desarrollo dirigido por pruebas, requiere escribir partes del conjunto de pruebas primero, antes de escribir el código real. Por supuesto, Python te permite ser descuidado y no escribir casos de prueba.

source: Why is there no goto?
es: ¿Por qué no hay goto?

source: In the 1970s people realized that unrestricted goto could lead to messy "spaghetti" code that was hard to understand and revise. In a high-level language, it is also unneeded as long as there are ways to branch (in Python, with :keyword:`if` statements and :keyword:`or`, :keyword:`and`, and :keyword:`if`/:keyword:`else` expressions) and loop (with :keyword:`while` and :keyword:`for` statements, possibly containing :keyword:`continue` and :keyword:`break`).
es: En la década de 1970, la gente se dio cuenta de que el goto irrestricto podía generar un código "espagueti" desordenado que era difícil de entender y revisar. En un lenguaje de alto nivel, también es innecesario siempre que haya formas de bifurcar (en Python, con sentencias :keyword:`if` y expresiones :keyword:`or`, :keyword:`and` e :keyword:`if`/:keyword:`else`) y bucle (con sentencia :keyword:`while` y :keyword:`for`, que posiblemente contengan :keyword:`continue` y :keyword:`break`).

source: One can also use exceptions to provide a "structured goto" that works even across function calls. Many feel that exceptions can conveniently emulate all reasonable uses of the ``go`` or ``goto`` constructs of C, Fortran, and other languages. For example::
es: También se pueden utilizar excepciones para proporcionar un "goto estructurado" que funcione incluso a través de llamadas a funciones. Muchos creen que las excepciones pueden emular convenientemente todos los usos razonables de las construcciones ``go`` o ``goto`` de C, Fortran y otros lenguajes. Por ejemplo::

source: This doesn't allow you to jump into the middle of a loop, but that's usually considered an abuse of ``goto`` anyway. Use sparingly.
es: Esto no le permite saltar a la mitad de un bucle, pero eso es generalmente considerado un abuso de ``goto`` de todos modos. Utilizar con moderación.

source: Why can't raw strings (r-strings) end with a backslash?
es: ¿Por qué las cadenas de caracteres sin formato (r-strings) no pueden terminar con una barra diagonal inversa?

source: More precisely, they can't end with an odd number of backslashes: the unpaired backslash at the end escapes the closing quote character, leaving an unterminated string.
es: Más precisamente, no pueden terminar con un número impar de barras invertidas: la barra invertida no emparejada al final escapa el carácter de comillas de cierre, dejando una cadena sin terminar.

source: Raw strings were designed to ease creating input for processors (chiefly regular expression engines) that want to do their own backslash escape processing. Such processors consider an unmatched trailing backslash to be an error anyway, so raw strings disallow that. In return, they allow you to pass on the string quote character by escaping it with a backslash. These rules work well when r-strings are used for their intended purpose.
es: Las cadenas de caracteres sin formato se diseñaron para facilitar la creación de entradas para procesadores (principalmente motores de expresión regular) que desean realizar su propio procesamiento de escape de barra invertida. Tales procesadores consideran que una barra invertida sin par es un error de todos modos, por lo que las cadenas de caracteres sin procesar no lo permiten. A cambio, le permiten pasar el carácter de comillas de cadena escapándolo con una barra invertida. Estas reglas funcionan bien cuando las cadenas de caracteres r (*r-strings*) se usan para el propósito previsto.

source: If you're trying to build Windows pathnames, note that all Windows system calls accept forward slashes too::
es: Si está intentando construir nombres de ruta de Windows, tenga en cuenta que todas las llamadas al sistema de Windows también aceptan barras diagonales:

source: If you're trying to build a pathname for a DOS command, try e.g. one of ::
es: Si está tratando de construir una ruta para un comando de DOS, intente por ejemplo uno de los siguientes::

source: Why doesn't Python have a "with" statement for attribute assignments?
es: ¿Por qué Python no tiene una declaración "with" para las asignaciones de atributos?

source: Python has a :keyword:`with` statement that wraps the execution of a block, calling code on the entrance and exit from the block. Some languages have a construct that looks like this::
es: Python tiene una sentencia :keyword:`with` que envuelve la ejecución de un bloque, llamando al código en la entrada y salida del bloque. Algunos lenguajes tienen una construcción que se ve así::

source: In Python, such a construct would be ambiguous.
es: En Python, tal construcción sería ambigua.

source: Other languages, such as Object Pascal, Delphi, and C++, use static types, so it's possible to know, in an unambiguous way, what member is being assigned to. This is the main point of static typing -- the compiler *always* knows the scope of every variable at compile time.
es: Otros lenguajes, como Object Pascal, Delphi y C ++, utilizan tipos estáticos, por lo que es posible saber, de manera inequívoca, a qué miembro se le está asignando. Este es el punto principal de la escritura estática: el compilador *siempre* conoce el alcance de cada variable en tiempo de compilación.

source: Python uses dynamic types. It is impossible to know in advance which attribute will be referenced at runtime. Member attributes may be added or removed from objects on the fly. This makes it impossible to know, from a simple reading, what attribute is being referenced: a local one, a global one, or a member attribute?
es: Python usa tipos dinámicos. Es imposible saber de antemano a qué atributo se hará referencia en tiempo de ejecución. Los atributos de los miembros pueden agregarse o eliminarse de los objetos sobre la marcha. Esto hace que sea imposible saber, a partir de una simple lectura, a qué atributo se hace referencia: ¿uno local, uno global o un atributo miembro?

source: For instance, take the following incomplete snippet::
es: Por ejemplo, tome el siguiente fragmento incompleto::

source: The snippet assumes that ``a`` must have a member attribute called ``x``. However, there is nothing in Python that tells the interpreter this. What should happen if ``a`` is, let us say, an integer? If there is a global variable named ``x``, will it be used inside the :keyword:`with` block? As you see, the dynamic nature of Python makes such choices much harder.
es: El fragmento supone que ``a`` debe tener un atributo miembro llamado ``x``. Sin embargo, no hay nada en Python que le diga esto al intérprete. ¿Qué debería suceder si ``a`` es, digamos, un número entero? Si hay una variable global llamada ``x``, ¿se usará dentro del bloque :keyword:`with`? Como puede ver, la naturaleza dinámica de Python hace que tales elecciones sean mucho más difíciles.

source: The primary benefit of :keyword:`with` and similar language features (reduction of code volume) can, however, easily be achieved in Python by assignment. Instead of::
es: El principal beneficio de :keyword:`with` y características de lenguaje similares (reducción del volumen del código) puede, sin embargo, lograr fácilmente en Python mediante la asignación. En vez de::

source: write this::
es: escribe esto::

source: This also has the side-effect of increasing execution speed because name bindings are resolved at run-time in Python, and the second version only needs to perform the resolution once.
es: Esto también tiene el efecto secundario de aumentar la velocidad de ejecución porque los enlaces de nombres se resuelven en tiempo de ejecución en Python, y la segunda versión solo necesita realizar la resolución una vez.

source: Similar proposals that would introduce syntax to further reduce code volume, such as using a 'leading dot', have been rejected in favour of explicitness (see https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).
es: Otras propuestas similares que introducían sintaxis para reducir aún más el volumen del código, como el uso de un 'punto inicial', han sido rechazadas en favor de la claridad (véase https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).

source: Why don't generators support the with statement?
es: ¿Por qué los generadores no admiten la declaración with?

source: For technical reasons, a generator used directly as a context manager would not work correctly. When, as is most common, a generator is used as an iterator run to completion, no closing is needed. When it is, wrap it as :func:`contextlib.closing(generator) <contextlib.closing>` in the :keyword:`with` statement.
es: Por razones técnicas, un generador utilizado directamente como gestor de contexto no funcionaría correctamente. Cuando, como es más común, un generador se utiliza como un iterador ejecutado hasta su finalización, no es necesario cerrar. Cuando lo esté, envuélvalo como :func:`contextlib.closing(generator) <contextlib.closing>` en la sentencia :keyword:`with`.

source: Why are colons required for the if/while/def/class statements?
es: ¿Por qué se requieren dos puntos para las declaraciones if/while/def/class?

source: The colon is required primarily to enhance readability (one of the results of the experimental ABC language). Consider this::
es: Los dos puntos se requieren principalmente para mejorar la legibilidad (uno de los resultados del lenguaje ABC experimental). Considera esto::

source: Notice how the second one is slightly easier to read. Notice further how a colon sets off the example in this FAQ answer; it's a standard usage in English.
es: Observe cómo el segundo es un poco más fácil de leer. Observe más a fondo cómo los dos puntos establecen el ejemplo en esta respuesta de preguntas frecuentes; Es un uso estándar en inglés.

source: Another minor reason is that the colon makes it easier for editors with syntax highlighting; they can look for colons to decide when indentation needs to be increased instead of having to do a more elaborate parsing of the program text.
es: Otra razón menor es que los dos puntos facilitan a los editores con resaltado de sintaxis; pueden buscar dos puntos para decidir cuándo se debe aumentar la indentación en lugar de tener que hacer un análisis más elaborado del texto del programa.

source: Why does Python allow commas at the end of lists and tuples?
es: ¿Por qué Python permite comas al final de las listas y tuplas?

source: Python lets you add a trailing comma at the end of lists, tuples, and dictionaries::
es: Python le permite agregar una coma final al final de las listas, tuplas y diccionarios::

source: There are several reasons to allow this.
es: Hay varias razones para permitir esto.

source: When you have a literal value for a list, tuple, or dictionary spread across multiple lines, it's easier to add more elements because you don't have to remember to add a comma to the previous line. The lines can also be reordered without creating a syntax error.
es: Cuando tiene un valor literal para una lista, tupla o diccionario distribuido en varias líneas, es más fácil agregar más elementos porque no tiene que recordar agregar una coma a la línea anterior. Las líneas también se pueden reordenar sin crear un error de sintaxis.

source: Accidentally omitting the comma can lead to errors that are hard to diagnose. For example::
es: La omisión accidental de la coma puede ocasionar errores difíciles de diagnosticar. Por ejemplo::

source: This list looks like it has four elements, but it actually contains three: "fee", "fiefoo" and "fum". Always adding the comma avoids this source of error.
es: Parece que esta lista tiene cuatro elementos, pero en realidad contiene tres: "fee", "fiefoo" y "fum". Agregar siempre la coma evita esta fuente de error.

source: Allowing the trailing comma may also make programmatic code generation easier.
es: Permitir la coma final también puede facilitar la generación de código programático.
