Repository: python/python-docs-es
Catalog: faq/design.po
Languages: es

source: Design and History FAQ
es: Preguntas frecuentes sobre diseño e historia

source: Contents
es: Contenido

source: Why does Python use indentation for grouping of statements?
es: ¿Por qué Python usa indentación para agrupar declaraciones?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
es: Guido van Rossum cree que usar indentación para agrupar es extremadamente elegante y contribuye mucho a la claridad del programa Python promedio. La mayoría de las personas aprenden a amar esta característica después de un tiempo.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
es: Como no hay corchetes de inicio/fin, no puede haber un desacuerdo entre la agrupación percibida por el analizador y el lector humano. Ocasionalmente, los programadores de C encontrarán un fragmento de código como este::

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads many to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering as to why ``y`` is being decremented even for ``x > y``.
es: Solo se ejecuta la instrucción ``x ++`` si la condición es verdadera, pero la indentación lo lleva a creer lo contrario. Incluso los programadores experimentados de C a veces lo miran durante mucho tiempo preguntándose por qué ``y`` se está disminuyendo incluso para ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. After becoming used to reading and writing code using a particular style, it is normal to feel somewhat uneasy when reading (or being required to write) in a different one.
es: Debido a que no hay corchetes de inicio/fin, Python es mucho menos propenso a conflictos de estilo de codificación. En C hay muchas formas diferentes de colocar llaves. Después de acostumbrarse a leer y escribir código usando un estilo en particular, es normal sentirse algo incómodo al leer (o tener que escribir) en uno diferente.

source: Many coding styles place begin/end brackets on a line by themselves. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20--30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
es: Muchos estilos de codificación colocan corchetes de inicio / fin en una línea por sí mismos. Esto hace que los programas sean considerablemente más largos y desperdicia un valioso espacio en la pantalla, lo que dificulta obtener una buena visión general de un programa. Idealmente, una función debería caber en una pantalla (por ejemplo, 20-30 líneas). 20 líneas de Python pueden hacer mucho más trabajo que 20 líneas de C. Esto no se debe únicamente a la falta de corchetes de inicio/fin -- la falta de declaraciones y los tipos de datos de alto nivel también son responsables -- sino también la indentación basada en la sintaxis ciertamente ayuda.

source: Why am I getting strange results with simple arithmetic operations?
es: ¿Por qué obtengo resultados extraños con operaciones aritméticas simples?

source: See the next question.
es: Ver la siguiente pregunta.

source: Why are floating-point calculations so inaccurate?
es: ¿Por qué los cálculos de punto flotante son tan inexactos?

source: Users are often surprised by results like this::
es: Los usuarios a menudo se sorprenden por resultados como este::

source: and think it is a bug in Python. It's not. This has little to do with Python, and much more to do with how the underlying platform handles floating-point numbers.
es: y creo que es un error en Python. No es. Esto tiene poco que ver con Python, y mucho más con la forma en que la plataforma subyacente maneja los números de punto flotante.

source: The :class:`float` type in CPython uses a C ``double`` for storage. A :class:`float` object's value is stored in binary floating-point with a fixed precision (typically 53 bits) and Python uses C operations, which in turn rely on the hardware implementation in the processor, to perform floating-point operations. This means that as far as floating-point operations are concerned, Python behaves like many popular languages including C and Java.
es: El tipo :class:`float` en CPython usa una C ``double`` para el almacenamiento. Un valor del objeto :class:`float` se almacena en coma flotante binaria con una precisión fija (típicamente 53 bits) y Python usa operaciones C, que a su vez dependen de la implementación de hardware en el procesador, para realizar operaciones de coma flotante. Esto significa que, en lo que respecta a las operaciones de punto flotante, Python se comporta como muchos lenguajes populares, incluidos C y Java.

source: Many numbers that can be written easily in decimal notation cannot be expressed exactly in binary floating-point. For example, after::
es: Muchos números que se pueden escribir fácilmente en notación decimal no se pueden expresar exactamente en coma flotante binaria. Por ejemplo, después de::

source: the value stored for ``x`` is a (very good) approximation to the decimal value ``1.2``, but is not exactly equal to it. On a typical machine, the actual stored value is::
es: el valor almacenado para ``x`` es una aproximación (muy buena) al valor decimal ``1.2``, pero no es exactamente igual a él. En una máquina típica, el valor real almacenado es::

source: which is exactly::
es: que es exactamente::

source: The typical precision of 53 bits provides Python floats with 15--16 decimal digits of accuracy.
es: La precisión típica de 53 bits proporciona flotantes Python con 15--16 dígitos decimales de precisión.

source: For a fuller explanation, please see the :ref:`floating point arithmetic <tut-fp-issues>` chapter in the Python tutorial.
es: Para obtener una explicación más completa, consulte el capítulo :ref:`aritmética de coma flotante <tut-fp-issues>` en el tutorial de Python.

source: Why are Python strings immutable?
es: ¿Por qué las cadenas de caracteres de Python son inmutables?

source: There are several advantages.
es: Hay varias ventajas.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
es: Una es el rendimiento: saber que una cadena es inmutable significa que podemos asignarle espacio en el momento de la creación, y los requisitos de almacenamiento son fijos e inmutables. Esta es también una de las razones para la distinción entre tuplas y listas.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
es: Otra ventaja es que las cadenas en Python se consideran tan "elementales" como los números. Ninguna cantidad de actividad cambiará el valor 8 a otra cosa, y en Python, ninguna cantidad de actividad cambiará la cadena "ocho" a otra cosa.

source: Why must 'self' be used explicitly in method definitions and calls?
es: ¿Por qué debe usarse 'self' explícitamente en las definiciones y llamadas de métodos?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
es: La idea fue tomada de Modula-3. Resulta ser muy útil, por una variedad de razones.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
es: Primero, es más obvio que está utilizando un método o atributo de instancia en lugar de una variable local. Leer ``self.x`` o ``self.meth()`` deja absolutamente claro que se usa una variable de instancia o método incluso si no conoce la definición de clase de memoria. En C++, puede darse cuenta de la falta de una declaración de variable local (suponiendo que los globales son raros o fácilmente reconocibles) -- pero en Python, no hay declaraciones de variables locales, por lo que debería buscar la definición de clase para estar seguro. Algunos estándares de codificación de C++ y Java requieren que los atributos de instancia tengan un prefijo ``m_``, porque el ser explícito también es útil en esos lenguajes.

source: Second, it means that no special syntax is necessary if you want to explicitly reference or call the method from a particular class. In C++, if you want to use a method from a base class which is overridden in a derived class, you have to use the ``::`` operator -- in Python you can write ``baseclass.methodname(self, <argument list>)``. This is particularly useful for :meth:`~object.__init__` methods, and in general in cases where a derived class method wants to extend the base class method of the same name and thus has to call the base class method somehow.
es: En segundo lugar, significa que no es necesaria una sintaxis especial si desea hacer referencia explícita o llamar al método desde una clase en particular. En C++, si desea usar un método de una clase base que se anula en una clase derivada, debe usar el operador ``::`` -- en Python puede escribir ``baseclass.methodname(self, <argument list>)``. Esto es particularmente útil para métodos :meth:`~object.__init__`, y en general en los casos en que un método de clase derivada quiere extender el método de clase base del mismo nombre y, por lo tanto, tiene que llamar al método de clase base de alguna manera.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
es: Finalmente, para las variables de instancia se resuelve un problema sintáctico con la asignación: dado que las variables locales en Python son (¡por definición!) Aquellas variables a las que se asigna un valor en un cuerpo de función (y que no se declaran explícitamente como globales), tiene que haber una forma de decirle al intérprete que una asignación estaba destinada a asignar a una variable de instancia en lugar de a una variable local, y que preferiblemente debería ser sintáctica (por razones de eficiencia). C++ hace esto a través de declaraciones, pero Python no tiene declaraciones y sería una pena tener que presentarlas solo para este propósito. Usar el ``self.var`` explícito resuelve esto muy bien. Del mismo modo, para usar variables de instancia, tener que escribir ``self.var`` significa que las referencias a nombres no calificados dentro de un método no tienen que buscar en los directorios de la instancia. Para decirlo de otra manera, las variables locales y las variables de instancia viven en dos espacios de nombres diferentes, y debe decirle a Python qué espacio de nombres usar.

source: Why can't I use an assignment in an expression?
es: ¿Por qué no puedo usar una tarea en una expresión?

source: Starting in Python 3.8, you can!
es: ¡A partir de Python 3.8, se puede!

source: Assignment expressions using the walrus operator ``:=`` assign a variable in an expression::
es: Asignación de expresiones usando el operador walrus ``:=`` asigna una variable en una expresión::

source: See :pep:`572` for more information.
es: Ver :pep:`572` para más información.

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
es: ¿Por qué Python usa métodos para alguna funcionalidad (por ejemplo, list.index()) pero funciones para otra (por ejemplo, len(list))?

source: As Guido said:
es: Como dijo Guido:

source: (a) For some operations, prefix notation just reads better than postfix -- prefix (and infix!) operations have a long tradition in mathematics which likes notations where the visuals help the mathematician thinking about a problem. Compare the easy with which we rewrite a formula like x*(a+b) into x*a + x*b to the clumsiness of doing the same thing using a raw OO notation.
es: (a) Para algunas operaciones, la notación de prefijo solo se lee mejor que postfijo -- las operaciones de prefijo (e ¡infijo!) tienen una larga tradición en matemáticas que le gustan las anotaciones donde las imágenes ayudan al matemático a pensar en un problema. Compare lo fácil con que reescribimos una fórmula como x*(a+b) en x*a + x*b con la torpeza de hacer lo mismo usando una notación OO sin procesar.

source: (b) When I read code that says len(x) I *know* that it is asking for the length of something. This tells me two things: the result is an integer, and the argument is some kind of container. To the contrary, when I read x.len(), I have to already know that x is some kind of container implementing an interface or inheriting from a class that has a standard len(). Witness the confusion we occasionally have when a class that is not implementing a mapping has a get() or keys() method, or something that isn't a file has a write() method.
es: (b) Cuando leo un código que dice len(x), *sé* que está pidiendo la longitud de algo. Esto me dice dos cosas: el resultado es un número entero y el argumento es algún tipo de contenedor. Por el contrario, cuando leo x.len (), ya debo saber que x es algún tipo de contenedor que implementa una interfaz o hereda de una clase que tiene un estándar len(). Sea testigo de la confusión que ocasionalmente tenemos cuando una clase que no está implementando una asignación tiene un método get() o keys(), o algo que no es un archivo tiene un método write().

source: Why is join() a string method instead of a list or tuple method?
es: ¿Por qué join() es un método de cadena de caracteres en lugar de un método de lista o tupla?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
es: Las cadenas de caracteres se volvieron mucho más parecidas a otros tipos estándar a partir de Python 1.6, cuando se agregaron métodos que brindan la misma funcionalidad que siempre ha estado disponible utilizando las funciones del módulo de cadenas. La mayoría de estos nuevos métodos han sido ampliamente aceptados, pero el que parece hacer que algunos programadores se sientan incómodos es:

source: which gives the result::
es: que da el resultado::

source: There are two common arguments against this usage.
es: Hay dos argumentos comunes en contra de este uso.

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
es: El primero corre a lo largo de las líneas de: "Se ve realmente feo el uso de un método de un literal de cadena (constante de cadena)", a lo que la respuesta es que sí, pero un literal de cadena es solo un valor fijo. Si se permiten los métodos en nombres vinculados a cadenas, no hay razón lógica para que no estén disponibles en literales.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
es: La segunda objeción generalmente se presenta como: "Realmente estoy diciéndole a una secuencia que una a sus miembros junto con una constante de cadena". Lamentablemente, no lo estas haciendo. Por alguna razón, parece ser mucho menos difícil tener :meth:`~str.split` como método de cadena, ya que en ese caso es fácil ver que::

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
es: es una instrucción a un literal de cadena para retornar las subcadenas de caracteres delimitadas por el separador dado (o, por defecto, ejecuciones arbitrarias de espacio en blanco).

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
es: :meth:`~str.join` es un método de cadena de caracteres porque al usarlo le está diciendo a la cadena de separación que itere sobre una secuencia de cadenas y se inserte entre elementos adyacentes. Este método se puede usar con cualquier argumento que obedezca las reglas para los objetos de secuencia, incluidas las clases nuevas que pueda definir usted mismo. Existen métodos similares para bytes y objetos bytearray.

source: How fast are exceptions?
es: ¿Qué tan rápido van las excepciones?

source: A :keyword:`try`/:keyword:`except` block is extremely efficient if no exceptions are raised. Actually catching an exception is expensive. In versions of Python prior to 2.0 it was common to use this idiom::
es: Un bloque :keyword:`try`/:keyword:`except` es extremadamente eficiente si no son lanzada excepciones. En realidad, capturar una excepción es costoso. En versiones de Python anteriores a la 2.0, era común usar este modismo::

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
es: Esto solo tenía sentido cuando esperaba que el dict tuviera la clave casi todo el tiempo. Si ese no fuera el caso, lo codificó así:

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
es: Para este caso específico, también podría usar ``value = dict.setdefault(key, getvalue(key))``, pero solo si la llamada ``getvalue()`` es lo suficientemente barata porque se evalúa en todos los casos.

source: Why isn't there a switch or case statement in Python?
es: ¿Por qué no hay un *switch* o una declaración *case* en Python?

source: You can do this easily enough with a sequence of ``if... elif... elif... else``. For literal values, or constants within a namespace, you can also use a ``match ... case`` statement.
es: Puede hacer esto con bastante facilidad con una secuencia de ``if... elif... elif... else``. Para valores literales, o constantes dentro de un espacio de nombres, también puede usar una declaración ``match ... case``.

source: For cases where you need to choose from a very large number of possibilities, you can create a dictionary mapping case values to functions to call. For example::
es: Para los casos en los que necesita elegir entre una gran cantidad de posibilidades, puede crear un diccionario que asigne valores de casos a funciones para llamar. Por ejemplo::

source: For calling methods on objects, you can simplify yet further by using the :func:`getattr` built-in to retrieve methods with a particular name::
es: Para invocar métodos en objetos, puede simplificar aún más utilizando :func:`getattr` incorporado para recuperar métodos con un nombre particular::

source: It's suggested that you use a prefix for the method names, such as ``visit_`` in this example. Without such a prefix, if values are coming from an untrusted source, an attacker would be able to call any method on your object.
es: Se sugiere que utilice un prefijo para los nombres de los métodos, como ``visit_`` en este ejemplo. Sin dicho prefijo, si los valores provienen de una fuente no confiable, un atacante podría invocar cualquier método en su objeto.

source: Can't you emulate threads in the interpreter instead of relying on an OS-specific thread implementation?
es: ¿No puede emular hilos en el intérprete en lugar de confiar en una implementación de hilos específica del sistema operativo?

source: Answer 1: Unfortunately, the interpreter pushes at least one C stack frame for each Python stack frame. Also, extensions can call back into Python at almost random moments. Therefore, a complete threads implementation requires thread support for C.
es: Respuesta 1: Desafortunadamente, el intérprete empuja al menos un marco de pila C para cada marco de pila de Python. Además, las extensiones pueden volver a llamar a Python en momentos casi aleatorios. Por lo tanto, una implementación completa de subprocesos requiere soporte de subprocesos para C.

source: Answer 2: Fortunately, there is `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, which has a completely redesigned interpreter loop that avoids the C stack.
es: Respuesta 2: Afortunadamente, existe `Python sin pila <https://github.com/stackless-dev/stackless/wiki>`_, que tiene un bucle de intérprete completamente rediseñado que evita la pila C.

source: Why can't lambda expressions contain statements?
es: ¿Por qué las expresiones lambda no pueden contener sentencias?

source: Python lambda expressions cannot contain statements because Python's syntactic framework can't handle statements nested inside expressions. However, in Python, this is not a serious problem. Unlike lambda forms in other languages, where they add functionality, Python lambdas are only a shorthand notation if you're too lazy to define a function.
es: Las expresiones lambda de Python no pueden contener declaraciones porque el marco sintáctico de Python no puede manejar declaraciones anidadas dentro de expresiones. Sin embargo, en Python, este no es un problema grave. A diferencia de las formas lambda en otros lenguajes, donde agregan funcionalidad, las lambdas de Python son solo una notación abreviada si eres demasiado vago para definir una función.
