Repository: python/python-docs-es
Catalog: faq/general.po
Languages: es

source: General Python FAQ
es: Preguntas frecuentes generales sobre Python

source: Contents
es: Contenido

source: General Information
es: Información General

source: What is Python?
es: ¿Qué es Python?

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
es: Para saber más, comienza con :ref:`tutorial-index`. La `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ vincula a otros recursos y tutoriales introductorios para aprender Python.

source: What is the Python Software Foundation?
es: ¿Que es la *Python Software Foundation*?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
es: La *Python Software Foundation* es una organización independiente sin fines de lucro que posee los derechos sobre Python desde la versión 2.1 en adelante. La misión de la PSF es hacer avanzar la tecnología *open source* relacionada al lenguaje de programación Python y publicitar su uso. El sitio web de la PSF es https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
es: Las donaciones a la PSF están exentas de impuestos en Estados Unidos. Si usas Python y lo encuentras útil, por favor contribuye a través de la `página de donaciones de la PSF <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
es: ¿Hay restricciones de *copyright* sobre el uso de Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
es: Puedes hacer cualquier cosa que quieras con el código fuente mientras mantengas y muestres los mensajes de *copyrights* en cualquier documentación sobre Python que produzcas. Si respetas las reglas de *copyright*, está permitido usar Python para fines comerciales, vender copias de Python en forma de código fuente o binarios (modificados o no), o vender productos que incorporen Python de alguna manera. De cualquier manera nos gustaría saber de todos los usos comerciales de Python, por supuesto.

source: See `the PSF license page <https://www.python.org/psf/license/>`_ to find further explanations and a link to the full text of the license.
es: Mira la página `PSF license <https://www.python.org/psf/license/>`_ para encontrar explicaciones más detalladas y un vínculo al texto completo de la licencia.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
es: El logo de Python tiene derechos comerciales (*trademarked*) y en ciertos casos se requiere un permiso de uso. Consulta la `Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ para más información.

source: Why was Python created in the first place?
es: ¿Por qué motivos se creó Python?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
es: Aquí hay un *muy* breve resumen sobre qué fue lo que comenzó todo, escrita por Guido van Rossum:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
es: Tenía vasta experiencia implementando un lenguaje interpretado en el grupo ABC en CWI y trabajando con este grupo había aprendido mucho sobre diseño de lenguajes. Este es el origen de muchas características de Python, incluyendo el uso de sangría para el agrupamiento de sentencias y la inclusión de tipos de datos de muy alto nivel (aunque los detalles son todos diferentes en Python).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
es: Tenía algunos resquemores sobre el lenguaje ABC pero también me gustaban muchas de sus características. Era imposible extenderlo (al lenguaje o sus implementaciones) para remediar mis quejas -- de hecho, la ausencia de extensibilidad fue uno de los mayores problemas. Contaba con alguna experiencia usando Modula-2+ y conversé con los diseñadores de Modula-3 y leí su reporte. Modula-3 es el origen de la sintaxis y semántica que usé para las excepciones y otras características de Python.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
es: Estaba trabajando en Grupo del sistema operativo distribuido Amoeba en CWI. Necesitábamos una mejor manera de hacer administración de sistemas que escribir programas en C o *scripts* de *Bourne shell*, ya que Amoeba tenía sus propia interfaz de llamadas a sistema que no era fácilmente accesible desde *Bourne shell*. Mi experiencia con el manejo de errores de Amoeba me hizo muy consciente de la importancia de las excepciones como una característica de los lenguaje de programación.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
es: Se me ocurrió que un lenguaje de scripts con una sintaxis como ABC pero con acceso a las llamadas al sistema Amoeba satisfaría la necesidad. Me di cuenta de que sería una tontería escribir un lenguaje específico para Amoeba, así que decidí que necesitaba un lenguaje que fuera generalmente extensible.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
es: Durante las vacaciones de Navidad de 1989 tenía mucho tiempo libre, así que decidí hacer un intento. Durante el año siguiente, mientras seguía trabajando principalmente en él durante mi propio tiempo, Python se utilizó en el proyecto Amoeba con un éxito creciente, y los comentarios de mis colegas me hicieron agregar muchas mejoras iniciales.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
es: En febrero de 1991, justo después de un año de desarrollo, decidí publicarlo en USENET. El resto está en el archivo ``Misc/HISTORY``.

source: What is Python good for?
es: ¿Para qué es bueno Python?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
es: Python es un lenguaje de programación de propósito general de alto nivel que se puede aplicar a muchas clases diferentes de problemas.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), Internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, CGI programming), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
es: El lenguaje viene con una vasta biblioteca estándar que cubre áreas como el procesamiento de texto (expresiones regulares, unicode, cálculo de diferencias entre archivos), protocolos de Internet (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, programación CGI), ingeniería de software (pruebas unitarias, *logging*, perfilamiento, análisis sintáctico y gramatical de código Python) e interfaces con el sistema operativo (llamadas a sistema, sistemas de archivo, *sockets* TCP/IP). Mira la tabla de contenidos en :ref:`library-index` para tener una idea de qué está disponible. Una amplia variedad de extensiones de terceros también están disponibles. Consulta el `Python Package Index <https://pypi.org>`_ para encontrar paquetes de tu interés.

source: How does the Python version numbering scheme work?
es: ¿Cómo funciona el esquema numérico de versiones de Python?

source: Python versions are numbered A.B.C or A.B. A is the major version number -- it is only incremented for really major changes in the language. B is the minor version number, incremented for less earth-shattering changes. C is the micro-level -- it is incremented for each bugfix release. See :pep:`6` for more information about bugfix releases.
es: La versiones de Python están numeradas A.B.C o A.B. A es el numero de versión más importante -- sólo es incrementado por cambios realmente grandes en el lenguaje. B es el número de versión secundario (o menor), incrementado ante cambios menos traumáticos. C es el nivel micro -- se incrementa en cada lanzamiento de corrección de errores. Mira el :pep:`6` para más información sobre los lanzamientos de corrección de errores.

source: Not all releases are bugfix releases. In the run-up to a new major release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
es: No todos los lanzamientos son de corrección de errores. En el período previo a un lanzamiento importante, una serie de lanzamientos de desarrollo son realizados, denotados como *alpha*, *beta* o *release candidate*. Las versiones *alphas* son lanzamientos tempranos en los que las interfaces no están todavía finalizadas; no es inesperado que una interfaz cambie entre dos lanzamientos *alpha*. Las *betas* son más estables, preservando las interfaces existentes pero posiblemente agregando nuevos módulos. Los *release candidates* están congelados, sin hacer cambios excepto los necesarios para corregir bugs críticos.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
es: También puedes encontrar números de versión con un sufijo "+", por ejemplo "2.2+". Estas son versiones sin lanzar, construidas directamente desde el repositorio de desarrollo de CPython. En la práctica, luego de que un lanzamiento menor se realiza, la versión es incrementada a la siguiente versión menor, que se vuelve "a0", por ejemplo "2.4a0".

source: See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
es: Mira también la documentación para :data:`sys.version`, :data:`sys.hexversion`, y :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
es: ¿Cómo obtengo una copia del código fuente de Python?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
es: El código fuente de la versión más reciente de Python está siempre disponible desde python.org, en https://www.python.org/downloads/. El código fuente en desarrollo más reciente se puede obtener en https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
es: La distribución de fuentes es un archivo tar comprimido con gzip que contiene el código C completo, documentación en formato Sphinx, los módulos de la biblioteca de Python, programas de ejemplo y varias piezas útiles de software libremente distribuibles. El código fuente compilará y se ejecutará sin problemas en la mayoría de las plataformas Unix.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
es: Consulta `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ para más información sobre cómo obtener el código fuente y compilarlo.

source: How do I get documentation on Python?
es: ¿Cómo consigo documentación sobre Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
es: La documentación estándar para la versión estable actual de Python está disponible en https://docs.python.org/3/. También están disponibles versiones en PDF, texto plano y HTML descargable en https://docs.python.org/3/download.html.

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <http://sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
es: La documentación está escrita en reStructuredText y procesada con `la herramienta de documentación Sphinx <http://sphinx-doc.org/>`__. Las fuentes reStructuredText de la documentación son parte de la distribución fuente de Python.

source: I've never programmed before. Is there a Python tutorial?
es: Nunca he programado antes. ¿Hay un tutorial de Python?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
es: Hay numerosos tutoriales y libros disponibles. La documentación estándar incluye :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
es: Consulta `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ para encontrar información para principiantes en Python, incluyendo una lista de tutoriales.

source: Is there a newsgroup or mailing list devoted to Python?
es: ¿Hay un *newsgroup* o una lista de correo dedicada a Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
es: Hay un grupo de noticias, :newsgroup:`comp.lang.python`, y una lista de correo, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. Tanto el grupo de noticias como la lista de correo están interconectadas entre sí -- si puedes leer las noticias no es necesario que te suscribas a la lista de correo. :newsgroup:`comp.lang.python` tiene mucho tráfico, recibiendo cientos de publicaciones cada día. y los lectores de Usenet suelen ser más capaces de hacer frente a este volumen.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.
es: Los anuncios de nuevos lanzamientos de software y eventos se pueden encontrar en comp.lang.python.announce, una lista moderada de bajo tráfico que recibe alrededor de cinco publicaciones por día. Está disponible como la `lista de correos de anuncios de Python <https://mail.python.org/mailman/listinfo/python-announce-list>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
es: Más información sobre listas de correo o grupos de noticias puede hallarse en https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
es: ¿Cómo obtengo una versión de prueba *beta* de Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
es: Las versiones alpha y beta están disponibles desde https://www.python.org/downloads/. Todos los lanzamientos son anunciados en el grupo de noticias comp.lang.python y comp.lang.python.announce, así como también en la página principal de Python en https://www.python.org/; un *feed* RSS está disponible.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
es: También puedes acceder a la versión en desarrollo de Python desde Git. Mira `The Python Developer's Guide <https://devguide.python.org/>`_ para los detalles.

source: How do I submit bug reports and patches for Python?
es: ¿Cómo envío un reporte de *bug* y parches para Python?

source: To report a bug or submit a patch, please use the Roundup installation at https://bugs.python.org/.
es: Para reportar un *bug* o enviar un parche, por favor usa la instalación de Roundup en https://bugs.python.org/.

source: You must have a Roundup account to report bugs; this makes it possible for us to contact you if we have follow-up questions. It will also enable Roundup to send you updates as we act on your bug. If you had previously used SourceForge to report bugs to Python, you can obtain your Roundup password through Roundup's `password reset procedure <https://bugs.python.org/user?@template=forgotten>`_.
es: Debes tener una cuenta de Roundup para reportar *bugs*; esto nos permite contactarte si tenemos más preguntas. También permite que Roundup te envíe actualizaciones cuando haya actualizaciones sobre tu *bug*. Si previamente usaste SourceForge para reportar bugs a Python, puedes obtener tu contraseña de Roundup a través del `procedimiento de reinicio de contraseña de Roundup <https://bugs.python.org/user?@template=forgotten>`_.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
es: Para más información sobre cómo se desarrolla Python, consulta `the Python Developer's Guide <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
es: ¿Hay algún artículo publicado sobre Python que pueda referir?

source: It's probably best to cite your favorite book about Python.
es: Lo más probable es que lo mejor sea citar a tu libro preferido sobre Python.

source: The very first article about Python was written in 1991 and is now quite outdated.
es: El primer artículo publicado sobre Python fue escrito en 1991 y quedó bastante desactualizado.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
es: Guido van Rossum y Jelke de Boer, "*Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (Diembre de 1991), Amsterdam, pp 283--303*.

source: Are there any books on Python?
es: ¿Hay libros sobre Python?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
es: Sí, hay muchos, y hay más siendo publicados. Mira la wiki de python.org en https://wiki.python.org/moin/PythonBooks para ver una lista.

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
es: También puedes buscar "Python" en las librerías online y excluir las que refieran a los Monty Python; o quizás buscar "Python" y "lenguaje".

source: Where in the world is www.python.org located?
es: ¿En qué parte del mundo está ubicado www.python.org?

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <http://infra.psf.io>`__.
es: La infraestructura del proyecto Python está ubicada alrededor de todo el mundo y es gestionada por el *Python Infraestructure Team*. Detalles `aquí <http://infra.psf.io>`__.

source: Why is it called Python?
es: ¿Por qué se llama Python?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
es: Cuando comenzó a implementar Python, Guido van Rossum también estaba leyendo los guiones publicados de `"Monty Python's Flying Circus" <https://es.wikipedia.org/wiki/Monty_Python>`__, una serie de comedia producida por la BBC de los 70'. Van Rossum pensó que necesitaba un nombre que fuera corto, único y ligeramente misterioso, entonces decidió llamar al lenguaje Python.

source: Do I have to like "Monty Python's Flying Circus"?
es: ¿Debe gustarme "Monty Python's Flying Circus"?

source: No, but it helps. :)
es: No, pero ayuda. :)

source: Python in the real world
es: Python en el mundo real

source: How stable is Python?
es: ¿Cuán estable es Python?
