Repository: python/python-docs-es
Catalog: faq/general.po
Languages: es

source: The developers issue "bugfix" releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
es: Los desarrolladores publican lanzamientos de "bugfix" (corrección de errores) para versiones antiguas, así que la estabilidad de las versiones existentes mejora gradualmente. Los lanzamientos de corrección de errores, indicados por el tercer componente del número de versión (e.g 3.5.3, 3.6.2) son gestionados para estabilidad; sólo correcciones de problemas conocidos se incluyen en uno de estos lanzamientos, y está garantizado que las interfaces se mantendrán a lo largo de la misma serie.

source: How many people are using Python?
es: ¿Cuánta gente usa Python?

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
es: Python está disponible gratuitamente para ser descargado por lo que no existen cifras de ventas, a su vez se incluye en muchos sitios diferentes y está empaquetado en muchas distribuciones de Linux, por lo que las estadísticas de descarga tampoco cuentan toda la historia.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
es: El grupo de noticias comp.lang.python es muy activo, pero no todos los usuarios de Python publican allí o incluso lo leen.

source: Have any significant projects been done in Python?
es: ¿Hay proyectos significativos hechos con Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
es: Mira https://www.python.org/about/success para una lista de proyecto que usan Python. Consultar las actas de `conferencias de Python pasadas <https://www.python.org/community/workshops/>`_ revelará contribuciones de diferentes empresas y organizaciones.

source: High-profile Python projects include `the Mailman mailing list manager <http://www.list.org>`_ and `the Zope application server <http://www.zope.org>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
es: Proyectos en Python de alto perfil incluyen el `gestor de listas de correo Mailman <http://www.list.org>`_ y `el servidor de aplicaciones Zope <http://www.zope.org>`_. Muchas distribuciones de Linux, más notoriamente `Red Hat <https://www.redhat.com>`_, han escrito partes de sus instaladores y software de administración en Python. Entre las empresas que usan Python internamente se encuentran Google, Yahoo y Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
es: ¿Qué nuevos desarrollos se esperan para Python en el futuro?

source: See https://www.python.org/dev/peps/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
es: Mira https://www.python.org/dev/peps/ para las *Python Enhancement Proposals* ("Propuestas de mejora de Python", PEPs). Las PEPs son documentos de diseño que describen una nueva funcionalidad sugerida para Python, proveyendo una especificación técnica concisa y una razón fundamental. Busca una PEP titulada "Python X.Y Release Schedule", donde X.Y es una versión que aún no ha sido publicada.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman/listinfo/python-dev/>`_.
es: Los nuevos desarrollos son discutidos en `la lista de correo python-dev <https://mail.python.org/mailman/listinfo/python-dev/>`_.

source: Is it reasonable to propose incompatible changes to Python?
es: ¿Es razonable proponer cambios incompatibles a Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
es: En general no. Ya existen millones de líneas de código Python alrededor del mundo, por lo que cualquier cambio en el lenguaje que invalide más que una fracción muy pequeña de los programas existentes tiene que ser mal visto. Incluso si puedes proporcionar un programa de conversión, todavía existe el problema de actualizar toda la documentación; se han escrito muchos libros sobre Python y no queremos invalidarlos a todos de un plumazo.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
es: Si una funcionalidad se debe cambiar, es necesario proporcionar una ruta de actualización gradual. :pep:`5` describe el procedimiento seguido para introducir cambios incompatibles con versiones anteriores para minimizar disrupciones a los usuarios y usuarias.

source: Is Python a good language for beginning programmers?
es: ¿Python es un buen lenguaje para principiantes?

source: Yes.
es: Sí.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
es: Todavía es común hacer comenzar a estudiantes con lenguajes procedimentales de tipado estático como Pascal, C o un subconjunto de C++ o Java. Los y las estudiantes pueden verse favorecidos si aprenden Python como primer lenguaje. Python tiene una sintaxis simple y consistente y una gran biblioteca estándar. Y, más importante, usar Python en cursos introductorios de programación permite a los estudiantes concentrarse en lo importante de las habilidades de programación como la descomposición de problemas y el diseño de tipos de datos. Con Python los estudiantes pueden ser rápidamente introducidos a conceptos como bucles y procedimientos. Incluso puede trabajar con objetos definidos por el usuario en su primer curso.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
es: Para estudiantes que nunca han programado antes, usar un lenguaje de tipado estático parece antinatural. Presenta complejidades adicionales que deben ser dominadas y ralentizan el ritmo del curso. Quienes están aprendiendo intentan pensar como la computadora, descomponer problemas, diseñar interfaces consistentes y encapsular datos. Si bien aprender a usar un lenguaje de tipado estático es importante en el largo plazo, no es necesariamente el mejor tema a tratar en un primer curso de programación.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
es: Muchos otros aspectos de Python lo vuelven un buen primer lenguaje. Como Java, Python tiene una biblioteca estándar, de manera que los y las estudiantes pueden recibir, de manera temprana, consignas para realizar proyectos de programación que *hagan* algo. Estas consignas no están restringidas a las típicas calculadoras de cuatro operaciones o programas de balances contables. Al usar la biblioteca estándar, pueden ganar la satisfacción de trabajar en aplicaciones realistas mientras aprenden los fundamentos de la programación. Usar la biblioteca estándar también enseña a reusar código. Módulos de terceros, como PyGame, también ayudan a extender los alcances de los y las estudiantes.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
es: El intérprete interactivo de Python les permite probar funcionalidades del lenguaje mientras programan. Pueden tener una ventana con el intérprete corriendo mientras escriben el código de su programa en otra. Si no recuerdan los métodos para una lista, pueden hacer algo así::

source: With the interpreter, documentation is never far from the student as they are programming.
es: Con el intérprete, la documentación nunca está lejos de los o las estudiantes mientras están programando.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. PythonWin is a Windows-specific IDE. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
es: También hay buenas IDEs para Python. IDLE es una IDE multiplataforma para Python que está escrita en Python usando Tkinter. PythonWin es un IDE específico para Windows. Quienes usan Emacs estarán felices de saber que hay un modo para Python muy bueno. Todos estos entornos de programación proveen resaltado de sintaxis, auto-sangrado y acceso al intérprete interactivo mientras se programa. Consulta `la wiki de Python <https://wiki.python.org/moin/PythonEditors>`_ para ver una lista completa de entornos de programación.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
es: Si quieres discutir el uso de Python en la educación, quizás te interese unirte a la `la lista de correo edu-sig <https://www.python.org/community/sigs/current/edu-sig>`_.
