Repository: python/python-docs-es
Catalog: faq/installed.po
Languages: es

source: "Why is Python Installed on my Computer?" FAQ
es: "¿Por qué está Python instalado en mi ordenador?" FAQ

source: What is Python?
es: ¿Qué es Python?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
es: Python es un lenguaje de programación. Se usa para muchas aplicaciones diferentes. Se utiliza en algunas escuelas secundarias y universidades como un lenguaje de programación introductorio porque Python es fácil de aprender, pero también es utilizado por desarrolladores de software profesionales en lugares como Google, NASA, y Lucasfilm Ltd.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
es: Si desea aprender más sobre Python, comience con la `Guía del principiante de Python <https://wiki.python.org/moin/BeginnersGuide>`_.

source: Why is Python installed on my machine?
es: ¿Por qué Python está instalado en mi máquina?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
es: Si encuentras Python instalado en tu sistema pero no recuerdas haberlo instalado, hay varias maneras posibles en las que podría haber llegado ahí.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
es: Tal vez otro usuario de la computadora quiso aprender a programar y la instaló.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
es: Una aplicación de terceros instalada en la máquina podría haber sido escrita en Python e incluir una instalación de Python. Hay muchas aplicaciones de este tipo, desde programas GUI hasta servidores de red y scripts administrativos.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
es: Algunas máquinas Windows también tienen Python instalado. Al momento de escribir este artículo, sabemos que las computadoras de Hewlett-Packard y Compaq incluyen Python. Aparentemente algunas de las herramientas administrativas de HP/Compaq están escritas en Python.

source: Many Unix-compatible operating systems, such as Mac OS X and some Linux distributions, have Python installed by default; it's included in the base installation.
es: Muchos sistemas operativos compatibles con Unix, como Mac OS X y algunas distribuciones de Linux, tienen Python instalado por defecto; está incluido en la instalación base.

source: Can I delete Python?
es: ¿Puedo eliminar Python?

source: That depends on where Python came from.
es: Eso depende de dónde vino Python.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
es: Si alguien lo instaló deliberadamente, puede quitarlo sin dañar nada. En Windows, utilice el icono Agregar o quitar programas en el Panel de control.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
es: Si Python fue instalado por una aplicación de terceros, también puede eliminarlo, pero esa aplicación ya no funcionará. Deberías usar el desinstalador de esa aplicación en lugar de eliminar Python directamente.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
es: Si Python vino con su sistema operativo, no se recomienda quitarlo. Si lo eliminas, las herramientas escritas en Python ya no funcionarán, y algunas de ellas pueden ser importantes para ti. Reinstalar todo el sistema sería entonces necesario para arreglar las cosas de nuevo.
