Repository: python/python-docs-es
Catalog: faq/library.po
Languages: es

source: Library and Extension FAQ
es: Preguntas frecuentes sobre bibliotecas y extensiones

source: Contents
es: Contenidos

source: General Library Questions
es: Cuestiones generales sobre bibliotecas

source: How do I find a module or application to perform task X?
es: ¿Cómo encuentro un módulo o aplicación para ejecutar la tarea X?

source: Check :ref:`the Library Reference <library-index>` to see if there's a relevant standard library module. (Eventually you'll learn what's in the standard library and will be able to skip this step.)
es: Vea la :ref:`referencia de bibliotecas <library-index>` para comprobar si existe un módulo relevante en la biblioteca estándar. (Eventualmente aprenderá lo que hay en la biblioteca estándar y será capaz de saltarse este paso.)

source: For third-party packages, search the `Python Package Index <https://pypi.org>`_ or try `Google <https://www.google.com>`_ or another Web search engine. Searching for "Python" plus a keyword or two for your topic of interest will usually find something helpful.
es: Para los paquetes de terceros, busque en el `Índice de Paquetes de Python <https://pypi.org>`_ o pruebe `Google <https://www.google.com>`_ u otro motor de búsqueda. Buscando por "Python" más una o dos palabras clave del tema de interés, generalmente encontrará algo útil.

source: Where is the math.py (socket.py, regex.py, etc.) source file?
es: ¿Dónde está el fichero fuente *math.py* (*socket.py*, *regex.py*, etc.)?

source: If you can't find a source file for a module it may be a built-in or dynamically loaded module implemented in C, C++ or other compiled language. In this case you may not have the source file or it may be something like :file:`mathmodule.c`, somewhere in a C source directory (not on the Python Path).
es: Si no puede encontrar un fichero fuente para un módulo, puede ser un módulo incorporado o cargado dinámicamente implementado en C, C++ u otro lenguaje compilado. En este caso puede no disponer del fichero fuente o puede ser algo como :file:`mathmodule.c`, en algún lugar de un directorio fuente C (fuera del Python *Path*).

source: There are (at least) three kinds of modules in Python:
es: Hay (al menos) tres tipos de módulos en Python:

source: modules written in Python (.py);
es: módulos escritos en Python (.py);

source: modules written in C and dynamically loaded (.dll, .pyd, .so, .sl, etc);
es: módulos escritos en C y cargados dinámicamente (*.dll, .pyd, .so, .sl*, etc.);

source: modules written in C and linked with the interpreter; to get a list of these, type::
es: módulos escritos en C y enlazados con el intérprete; para obtener una lista de estos, escriba::

source: How do I make a Python script executable on Unix?
es: ¿Cómo hago ejecutable un script Python en Unix?

source: You need to do two things: the script file's mode must be executable and the first line must begin with ``#!`` followed by the path of the Python interpreter.
es: Necesita hacer dos cosas: el modo del fichero del script debe ser ejecutable y la primera línea debe comenzar con ``#!`` seguido de la ruta al intérprete de Python.

source: The first is done by executing ``chmod +x scriptfile`` or perhaps ``chmod 755 scriptfile``.
es: Lo primero se hace ejecutando ``chmod +x scriptfile`` o bien ``chmod 755 scriptfile``.

source: The second can be done in a number of ways. The most straightforward way is to write ::
es: Lo segundo se puede hacer de distintas maneras. La manera más directa es escribir ::

source: as the very first line of your file, using the pathname for where the Python interpreter is installed on your platform.
es: en la primera línea de su fichero, usando la ruta donde está instalado el intérprete de Python en su plataforma.

source: If you would like the script to be independent of where the Python interpreter lives, you can use the :program:`env` program. Almost all Unix variants support the following, assuming the Python interpreter is in a directory on the user's :envvar:`PATH`::
es: Si quiere que el script sea independiente de donde se ubique el intérprete de Python, puede usar el programa :program:`env`. Casi todas las variantes de Unix soportan lo siguiente, asumiendo que el intérprete de Python está en un directorio del :envvar:`PATH` de usuario:

source: *Don't* do this for CGI scripts. The :envvar:`PATH` variable for CGI scripts is often very minimal, so you need to use the actual absolute pathname of the interpreter.
es: *No* haga esto para scripts CGI. La variable :envvar:`PATH` para scripts CGI es mínima, así que necesita usar la ruta real absoluta al intérprete.

source: Occasionally, a user's environment is so full that the :program:`/usr/bin/env` program fails; or there's no env program at all. In that case, you can try the following hack (due to Alex Rezinsky):
es: Ocasionalmente, un entorno de usuario está tan lleno que el programa :program:`/usr/bin/env` falla; o bien no existe el programa env. En ese caso, puede intentar el siguiente truco (gracias a Alex Rezinsky):

source: The minor disadvantage is that this defines the script's __doc__ string. However, you can fix that by adding ::
es: Una pequeña desventaja es que esto define el *__doc__* del script. Sin embargo, puede arreglarlo añadiendo ::

source: Is there a curses/termcap package for Python?
es: ¿Hay un paquete curses/termcap para Python?

source: For Unix variants: The standard Python source distribution comes with a curses module in the :source:`Modules` subdirectory, though it's not compiled by default. (Note that this is not available in the Windows distribution -- there is no curses module for Windows.)
es: Para variantes Unix: La distribución estándar de Python viene con un módulo curses en el subdirectorio :source:`Modules`, aunque no está compilado por defecto. (Nótese que esto no está disponible en la distribución Windows — no hay módulo curses para Windows.)

source: The :mod:`curses` module supports basic curses features as well as many additional functions from ncurses and SYSV curses such as colour, alternative character set support, pads, and mouse support. This means the module isn't compatible with operating systems that only have BSD curses, but there don't seem to be any currently maintained OSes that fall into this category.
es: El módulo :mod:`curses` soporta características básicas de cursores así como muchas funciones adicionales de ncurses y cursores SYSV como color, soporte para conjuntos de caracteres alternativos, pads, y soporte para ratón. Esto significa que el módulo no es compatible con sistemas operativos que sólo tienen cursores BSD, pero no parece que ningún sistema operativo actualmente mantenido caiga dentro de esta categoría.

source: For Windows: use `the consolelib module <http://effbot.org/zone/console-index.htm>`_.
es: Para Windows: use `el módulo consolelib <http://effbot.org/zone/console-index.htm>`_.

source: Is there an equivalent to C's onexit() in Python?
es: ¿Hay un equivalente en Python al onexit() de C?

source: The :mod:`atexit` module provides a register function that is similar to C's :c:func:`onexit`.
es: El módulo :mod:`atexit` proporciona una función de registro que es similar a :c:func:`onexit` de C.

source: Why don't my signal handlers work?
es: ¿Por qué no funcionan mis manejadores de señales?

source: The most common problem is that the signal handler is declared with the wrong argument list. It is called as ::
es: El problema más común es que el manejador de señales esté declarado con la lista incorrecta de argumentos. Se llama como ::

source: Common tasks
es: Tareas comunes

source: How do I test a Python program or component?
es: ¿Cómo pruebo un programa o un componente Python?

source: Python comes with two testing frameworks. The :mod:`doctest` module finds examples in the docstrings for a module and runs them, comparing the output with the expected output given in the docstring.
es: Python viene con dos *frameworks* de *testing*. El módulo :mod:`doctest` encuentra ejemplos en los docstrings para un módulo y los ejecuta, comparando la salida con la salida esperada especificada en la cadena de documentación.

source: The :mod:`unittest` module is a fancier testing framework modelled on Java and Smalltalk testing frameworks.
es: El módulo :mod:`unittest` es un *framework* de *testing* más agradable y modelado sobre los *frameworks* de *testing* de Java y Smalltalk.

source: To make testing easier, you should use good modular design in your program. Your program should have almost all functionality encapsulated in either functions or class methods -- and this sometimes has the surprising and delightful effect of making the program run faster (because local variable accesses are faster than global accesses). Furthermore the program should avoid depending on mutating global variables, since this makes testing much more difficult to do.
es: Para hacer más fácil el *testing*, debería usar un buen diseño modular en su programa. Su programa debería tener casi toda la funcionalidad encapsulada en funciones o en métodos de clases — y esto algunas veces tiene el efecto sorprendente y encantador de que su programa funcione más rápido (porque los accesos a las variables locales son más rápidas que los accesos a las variables globales). Además el programa debería evitar depender de la mutación de variables globales, ya que esto dificulta mucho más hacer el *testing*.

source: The "global main logic" of your program may be as simple as ::
es: La "lógica global principal" de su programa puede ser tan simple como ::

source: at the bottom of the main module of your program.
es: al final del módulo principal de su programa.

source: "Support modules" that are not intended to be the main module of a program may include a self-test of the module. ::
es: Los "módulos de soporte" que no tienen la intención de estar en el módulo principal de un programa pueden incluir un auto *test* del módulo. ::

source: Even programs that interact with complex external interfaces may be tested when the external interfaces are unavailable by using "fake" interfaces implemented in Python.
es: Incluso los programas que interactúan con interfaces externas complejas se pueden comprobar cuando las interfaces externas no están disponibles usando interfaces "simuladas" implementadas en Python.

source: How do I create documentation from doc strings?
es: ¿Cómo creo documentación a partir de los docstrings?

source: The :mod:`pydoc` module can create HTML from the doc strings in your Python source code. An alternative for creating API documentation purely from docstrings is `epydoc <http://epydoc.sourceforge.net/>`_. `Sphinx <http://sphinx-doc.org>`_ can also include docstring content.
es: El módulo :mod:`pydoc` puede crear HTML desde los docstrings existentes en su código fuente Python. Una alternativa para crear documentación API estrictamente desde docstrings es `epydoc <http://epydoc.sourceforge.net/>`_. `Sphinx <http://sphinx-doc.org>`_ también puede incluir contenido docstring.

source: How do I get a single keypress at a time?
es: ¿Cómo consigo presionar una única tecla cada vez?

source: For Unix variants there are several solutions. It's straightforward to do this using curses, but curses is a fairly large module to learn.
es: Para variantes Unix hay varias soluciones. Lo más directo es hacerlo usando cursores, pero curses es un módulo bastante amplio para aprenderlo.

source: Threads
es: Hilos

source: How do I program using threads?
es: ¿Cómo programo usando hilos?

source: Be sure to use the :mod:`threading` module and not the :mod:`_thread` module. The :mod:`threading` module builds convenient abstractions on top of the low-level primitives provided by the :mod:`_thread` module.
es: Asegúrese de usar el módulo :mod:`threading` y no el módulo :mod:`_thread`. El módulo :mod:`threading` construye abstracciones convenientes sobre las primitivas de bajo nivel proporcionadas por el módulo :mod:`_thread`.

source: Aahz has a set of slides from his threading tutorial that are helpful; see http://www.pythoncraft.com/OSCON2001/.
es: Aahz tiene un conjunto de transparencias en su tutorial de hilos que resulta útil: vea http://www.pythoncraft.com/OSCON2001/.

source: None of my threads seem to run: why?
es: Ninguno de mis hilos parece funcionar: ¿por qué?

source: As soon as the main thread exits, all threads are killed. Your main thread is running too quickly, giving the threads no time to do any work.
es: Tan pronto como el hilo principal termine, se matan todos los hilos. Su hilo principal está corriendo demasiado rápido, sin dar tiempo a los hilos para hacer algún trabajo.

source: A simple fix is to add a sleep to the end of the program that's long enough for all the threads to finish::
es: Una solución sencilla es añadir un *sleep* al final del programa que sea suficientemente largo para que todos los hilos terminen::

source: But now (on many platforms) the threads don't run in parallel, but appear to run sequentially, one at a time! The reason is that the OS thread scheduler doesn't start a new thread until the previous thread is blocked.
es: Por ahora (en muchas plataformas) los hilos no corren en paralelo, sino que parece que corren secuencialmente, ¡uno a la vez! La razón es que el planificador de hilos del sistema operativo no inicia un nuevo hilo hasta que el hilo anterior está bloqueado.

source: A simple fix is to add a tiny sleep to the start of the run function::
es: Una solución sencilla es añadir un pequeño *sleep* al comienzo de la función run::

source: Instead of trying to guess a good delay value for :func:`time.sleep`, it's better to use some kind of semaphore mechanism. One idea is to use the :mod:`queue` module to create a queue object, let each thread append a token to the queue when it finishes, and let the main thread read as many tokens from the queue as there are threads.
es: En vez de intentar adivinar un valor de retardo adecuado para :func:`time.sleep`, es mejor usar algún tipo de mecanismo de semáforo. Una idea es usar el módulo :mod:`queue` para crear un objeto cola, permitiendo que cada hilo añada un *token* a la cola cuando termine, y permitiendo al hilo principal leer tantos tokens de la cola como hilos haya.

source: How do I parcel out work among a bunch of worker threads?
es: ¿Cómo puedo dividir trabajo entre un grupo de hilos?

source: Or, if you want fine control over the dispatching algorithm, you can write your own logic manually. Use the :mod:`queue` module to create a queue containing a list of jobs. The :class:`~queue.Queue` class maintains a list of objects and has a ``.put(obj)`` method that adds items to the queue and a ``.get()`` method to return them. The class will take care of the locking necessary to ensure that each job is handed out exactly once.
es: O, si quiere tener un control más preciso sobre el algoritmo de despacho, puede escribir su propia lógica manualmente. Use el módulo :mod:`queue` para crear una cola que contenga una lista de trabajos. La clase :class:`~queue.Queue` mantiene una lista de objetos y tiene un método ``.put(obj)`` que añade elementos a la cola y un método ``.get()`` que los retorna. Esta clase se encargará de los bloqueos necesarios para asegurar que cada trabajo se reparte exactamente una vez.

source: Here's a trivial example::
es: Aquí hay un ejemplo trivial::

source: When run, this will produce the following output:
es: Cuando se ejecute, esto producirá la siguiente salida:

source: Consult the module's documentation for more details; the :class:`~queue.Queue` class provides a featureful interface.
es: Consulte la documentación del módulo para más detalles; la clase :class:`~queue.Queue` proporciona una interfaz llena de características.

source: What kinds of global value mutation are thread-safe?
es: ¿Qué tipos de mutación de valores globales son *thread-safe*?

source: A :term:`global interpreter lock` (GIL) is used internally to ensure that only one thread runs in the Python VM at a time. In general, Python offers to switch among threads only between bytecode instructions; how frequently it switches can be set via :func:`sys.setswitchinterval`. Each bytecode instruction and therefore all the C implementation code reached from each instruction is therefore atomic from the point of view of a Python program.
es: Un :term:`global interpreter lock` (GIL) se usa internamente para asegurar que sólo un hilo corre a la vez en la VM de Python. En general, Python ofrece cambiar entre hilos sólo en instrucciones bytecode; la frecuencia con la que cambia se puede fijar vía :func:`sys.setswitchinterval`. Cada instrucción bytecode y por lo tanto, toda la implementación de código C alcanzada por cada instrucción, es atómica desde el punto de vista de un programa Python.

source: In theory, this means an exact accounting requires an exact understanding of the PVM bytecode implementation. In practice, it means that operations on shared variables of built-in data types (ints, lists, dicts, etc) that "look atomic" really are.
es: En teoría, esto significa que un informe exacto requiere de un conocimiento exacto de la implementación en bytecode de la PVM. En la práctica, esto significa que las operaciones entre variables compartidas de tipos de datos *built-in* (enteros, listas, diccionarios, etc.) que "parecen atómicas" realmente lo son.

source: For example, the following operations are all atomic (L, L1, L2 are lists, D, D1, D2 are dicts, x, y are objects, i, j are ints)::
es: Por ejemplo, las siguientes operaciones son todas atómicas (L, L1, L2 son listas, D, D1, D2 son diccionarios, *x, y* son objetos, *i, j* son enteros)::

source: These aren't::
es: Estas no lo son::

source: Operations that replace other objects may invoke those other objects' :meth:`__del__` method when their reference count reaches zero, and that can affect things. This is especially true for the mass updates to dictionaries and lists. When in doubt, use a mutex!
es: Las operaciones que reemplazan otros objetos pueden invocar el método :meth:`__del__` de esos otros objetos cuando su número de referencias alcance cero, y eso puede afectar a otras cosas. Esto es especialmente cierto para las actualizaciones en masa de diccionarios y listas. Cuando se esté en duda, ¡use un mutex!

source: Can't we get rid of the Global Interpreter Lock?
es: ¿Podemos deshacernos del *Global Interpreter Lock*?

source: The :term:`global interpreter lock` (GIL) is often seen as a hindrance to Python's deployment on high-end multiprocessor server machines, because a multi-threaded Python program effectively only uses one CPU, due to the insistence that (almost) all Python code can only run while the GIL is held.
es: El :term:`global interpreter lock` (GIL) se percibe a menudo como un obstáculo en el despliegue de Python sobre máquinas servidoras finales de múltiples procesadores, porque un programa Python multihilo efectivamente sólo usa una CPU, debido a la exigencia de que (casi) todo el código Python sólo puede correr mientras el GIL esté activado.

source: Back in the days of Python 1.5, Greg Stein actually implemented a comprehensive patch set (the "free threading" patches) that removed the GIL and replaced it with fine-grained locking. Adam Olsen recently did a similar experiment in his `python-safethread <https://code.google.com/archive/p/python-safethread>`_ project. Unfortunately, both experiments exhibited a sharp drop in single-thread performance (at least 30% slower), due to the amount of fine-grained locking necessary to compensate for the removal of the GIL.
es: En los días de Python 1.5, Greg Stein de hecho implementó un conjunto amplio de parches (los parches "libres de hilo") que eliminaba el GIL y lo reemplazaba con un bloqueo de grano fino. Adam Olsen hizo recientemente un experimento similar con su proyecto `python-safethread <https://code.google.com/archive/p/python-safethread>`_. Desafortunadamente, ambos experimentos mostraron una aguda caída en el rendimiento (al menos del 30% o más baja), debido a la cantidad de bloqueos de grano fino necesarios para compensar la eliminación del GIL.

source: This doesn't mean that you can't make good use of Python on multi-CPU machines! You just have to be creative with dividing the work up between multiple *processes* rather than multiple *threads*. The :class:`~concurrent.futures.ProcessPoolExecutor` class in the new :mod:`concurrent.futures` module provides an easy way of doing so; the :mod:`multiprocessing` module provides a lower-level API in case you want more control over dispatching of tasks.
es: ¡Esto no significa que no pueda hacer buen uso de Python en máquinas de múltiples CPU! Usted sólo tiene que ser creativo a la hora de dividir el trabajo entre múltiples *procesos* en vez de entre múltiples *hilos*. La clase :class:`~concurrent.futures.ProcessPoolExecutor` del nuevo módulo :mod:`concurrent.futures` proporciona una manera sencilla de hacer esto; el módulo :mod:`multiprocessing` proporciona una API de bajo nivel en caso de que se quiera tener un mayor control sobre el despacho de las tareas.

source: Judicious use of C extensions will also help; if you use a C extension to perform a time-consuming task, the extension can release the GIL while the thread of execution is in the C code and allow other threads to get some work done. Some standard library modules such as :mod:`zlib` and :mod:`hashlib` already do this.
es: El uso sensato de extensiones C también ayudará; si usa una extensión C para ejecutar una tarea que consume mucho tiempo, la extensión puede liberar al GIL mientras el hilo de ejecución esté en el código C y permite a otros hilos hacer trabajo. Algunos módulos de la biblioteca estándar tales como :mod:`zlib` y :mod:`hashlib` ya lo hacen.

source: It has been suggested that the GIL should be a per-interpreter-state lock rather than truly global; interpreters then wouldn't be able to share objects. Unfortunately, this isn't likely to happen either. It would be a tremendous amount of work, because many object implementations currently have global state. For example, small integers and short strings are cached; these caches would have to be moved to the interpreter state. Other object types have their own free list; these free lists would have to be moved to the interpreter state. And so on.
es: Se ha sugerido que el GIL debería ser un bloqueo por estado de intérprete, en vez de realmente global; luego los intérpretes no serían capaces de compartir objetos. Desafortunadamente, esto tampoco es probable que ocurra. Sería una tremenda cantidad de trabajo, porque muchas implementaciones de objetos actualmente tienen un estado global. Por ejemplo, los enteros pequeños y las cadenas pequeñas están *cacheadas*; estas *caches* se tendrían que mover al estado del intérprete. Otros tipos de objetos tienen su propia lista libre; estas listas libres se tendrían que mover al estado del intérprete. Y así sucesivamente.

source: And I doubt that it can even be done in finite time, because the same problem exists for 3rd party extensions. It is likely that 3rd party extensions are being written at a faster rate than you can convert them to store all their global state in the interpreter state.
es: Y dudo de si se puede hacer en tiempo finito, porque el mismo problema existe para extensiones de terceros. Es probable que las extensiones de terceros se escriban más rápido de lo que se puedan convertir para almacenar todo su estado global en el estado del intérprete.

source: And finally, once you have multiple interpreters not sharing any state, what have you gained over running each interpreter in a separate process?
es: Y finalmente, una vez que tenga múltiples intérpretes sin compartir ningún estado, ¿qué habrá ganado sobre correr cada intérprete en un proceso separado?

source: Input and Output
es: Entrada y Salida
