Repository: python/python-docs-es
Catalog: faq/library.po
Languages: es

source: How do I delete a file? (And other file questions...)
es: ¿Cómo borro un fichero? (Y otras preguntas sobre ficheros...)

source: Use ``os.remove(filename)`` or ``os.unlink(filename)``; for documentation, see the :mod:`os` module. The two functions are identical; :func:`~os.unlink` is simply the name of the Unix system call for this function.
es: Use ``os.remove(filename)`` o ``os.unlink(filename)``; para la documentación, vea el módulo :mod:`os`. Las dos funciones son idénticas; :func:`~os.unlink` es simplemente el nombre de la llamada al sistema UNIX para esta función.

source: To remove a directory, use :func:`os.rmdir`; use :func:`os.mkdir` to create one. ``os.makedirs(path)`` will create any intermediate directories in ``path`` that don't exist. ``os.removedirs(path)`` will remove intermediate directories as long as they're empty; if you want to delete an entire directory tree and its contents, use :func:`shutil.rmtree`.
es: Para borrar un directorio, use :func:`os.rmdir`; use :func:`os.mkdir` para crear uno. ``os.makedirs(path)`` creará cualquier directorio intermedio que no exista en ``path``. ``os.removedirs(path)`` borrará los directorios intermedios siempre y cuando estén vacíos; si quiere borrar un árbol de directorios completo y sus contenidos, use :func:`shutil.rmtree`.

source: To rename a file, use ``os.rename(old_path, new_path)``.
es: Para renombrar un fichero, use ``os.rename(old_path, new_path)``.

source: To truncate a file, open it using ``f = open(filename, "rb+")``, and use ``f.truncate(offset)``; offset defaults to the current seek position. There's also ``os.ftruncate(fd, offset)`` for files opened with :func:`os.open`, where *fd* is the file descriptor (a small integer).
es: Para truncar un fichero, ábralo usando ``f = open(filename, "rb+")``, y use ``f.truncate(offset)``; el desplazamiento toma por defecto la posición actual de búsqueda. También existe ``os.ftruncate(fd, offset)`` para ficheros abiertos con :func:`os.open`, donde *fd* es el descriptor del fichero (un entero pequeño).

source: The :mod:`shutil` module also contains a number of functions to work on files including :func:`~shutil.copyfile`, :func:`~shutil.copytree`, and :func:`~shutil.rmtree`.
es: El módulo :mod:`shutil` también contiene distintas funciones para trabajar con ficheros incluyendo :func:`~shutil.copyfile`, :func:`~shutil.copytree` y :func:`~shutil.rmtree`.

source: How do I copy a file?
es: ¿Cómo copio un fichero?

source: How do I read (or write) binary data?
es: ¿Cómo leo (o escribo) datos binarios?

source: To read or write complex binary data formats, it's best to use the :mod:`struct` module. It allows you to take a string containing binary data (usually numbers) and convert it to Python objects; and vice versa.
es: Para leer o escribir formatos binarios de datos complejos, es mejor usar el módulo :mod:`struct`. Esto le permite tomar una cadena de texto que contiene datos binarios (normalmente números) y convertirla a objetos de Python; y viceversa.

source: For example, the following code reads two 2-byte integers and one 4-byte integer in big-endian format from a file::
es: Por ejemplo, el siguiente código lee de un fichero dos enteros de 2-bytes y uno de 4-bytes en formato *big-endian*::

source: The '>' in the format string forces big-endian data; the letter 'h' reads one "short integer" (2 bytes), and 'l' reads one "long integer" (4 bytes) from the string.
es: El '>' en la cadena de formato fuerza los datos a *big-endian*; la letra 'h' lee un "entero corto" (2 bytes), y 'l' lee un "entero largo" (4 bytes) desde la cadena de texto.

source: For data that is more regular (e.g. a homogeneous list of ints or floats), you can also use the :mod:`array` module.
es: Para datos que son más regulares (por ejemplo una lista homogénea de enteros o flotantes), puede también usar el módulo :mod:`array`.

source: To read and write binary data, it is mandatory to open the file in binary mode (here, passing ``"rb"`` to :func:`open`). If you use ``"r"`` instead (the default), the file will be open in text mode and ``f.read()`` will return :class:`str` objects rather than :class:`bytes` objects.
es: Para leer y escribir datos binarios, es obligatorio abrir el fichero en modo binario (aquí, pasando ``"rb"`` a :func:`open`). Si, en cambio, usa ``"r"`` (por defecto), el fichero se abrirá en modo texto y ``f.read()`` retornará objetos :class:`str` en vez de objetos :class:`bytes`.

source: I can't seem to use os.read() on a pipe created with os.popen(); why?
es: No consigo usar os.read() en un *pipe* creado con os.popen(); ¿por qué?

source: :func:`os.read` is a low-level function which takes a file descriptor, a small integer representing the opened file. :func:`os.popen` creates a high-level file object, the same type returned by the built-in :func:`open` function. Thus, to read *n* bytes from a pipe *p* created with :func:`os.popen`, you need to use ``p.read(n)``.
es: :func:`os.read` es una función de bajo nivel que recibe un descriptor de fichero, un entero pequeño representando el fichero abierto. :func:`os.popen` crea un objeto fichero de alto nivel, el mismo tipo que retorna la función *built-in* :func:`open`. Así, para leer *n* bytes de un *pipe* *p* creado con :func:`os.popen`, necesita usar ``p.read(n)``.

source: How do I access the serial (RS232) port?
es: ¿Cómo accedo al puerto serial (RS232)?

source: For Win32, POSIX (Linux, BSD, etc.), Jython:
es: Para *Win32*, POSIX (Linux, BSD, etc.), Jython:

source: For Unix, see a Usenet post by Mitch Chapman:
es: Para Unix, vea una publicación Usenet de Mitch Chapman:

source: Why doesn't closing sys.stdout (stdin, stderr) really close it?
es: ¿Por qué al cerrar sys.stdout (stdin, stderr) realmente no se cierran?

source: Python :term:`file objects <file object>` are a high-level layer of abstraction on low-level C file descriptors.
es: Los :term:`objetos de tipo fichero <file object>` en Python son una capa de abstracción de alto nivel sobre los descriptores de ficheros de bajo nivel de C.

source: For most file objects you create in Python via the built-in :func:`open` function, ``f.close()`` marks the Python file object as being closed from Python's point of view, and also arranges to close the underlying C file descriptor. This also happens automatically in ``f``'s destructor, when ``f`` becomes garbage.
es: Para la mayoría de objetos de tipo fichero que cree en Python vía la función *built-in* :func:`open`, ``f.close()`` marca el objeto de tipo fichero Python como ya cerrado desde el punto de vista de Python, y también ordena el cierre del descriptor de fichero subyacente en C. Esto además ocurre automáticamente en el destructor de ``f``, cuando ``f`` se convierte en basura.

source: But stdin, stdout and stderr are treated specially by Python, because of the special status also given to them by C. Running ``sys.stdout.close()`` marks the Python-level file object as being closed, but does *not* close the associated C file descriptor.
es: Pero *stdin*, *stdout* y *stderr* se tratan de manera especial en Python, debido a un estatus especial que también tienen en C. Ejecutando ``sys.stdout.close()`` marca el objeto fichero de nivel Python para ser cerrado, pero *no* cierra el descriptor de fichero asociado en C.

source: To close the underlying C file descriptor for one of these three, you should first be sure that's what you really want to do (e.g., you may confuse extension modules trying to do I/O). If it is, use :func:`os.close`::
es: Para cerrar el descriptor de fichero subyacente en C para uno de estos tres casos, debería primero asegurarse de que eso es realmente lo que quiere hacer (por ejemplo, puede confundir módulos de extensión intentado hacer *I/O*). Si es así, use :func:`os.close`::

source: Or you can use the numeric constants 0, 1 and 2, respectively.
es: O puede usar las constantes numéricas 0, 1 y 2, respectivamente.

source: Network/Internet Programming
es: Programación de Redes/Internet

source: What WWW tools are there for Python?
es: ¿Qué herramientas de Python existen para WWW?

source: See the chapters titled :ref:`internet` and :ref:`netdata` in the Library Reference Manual. Python has many modules that will help you build server-side and client-side web systems.
es: Vea los capítulos titulados :ref:`internet` y :ref:`netdata` en el manual de referencia de bibliotecas. Python tiene muchos módulos que le ayudarán a construir sistemas web del lado del servidor y del lado del cliente.

source: A summary of available frameworks is maintained by Paul Boddie at https://wiki.python.org/moin/WebProgramming\ .
es: Paul Boddie mantiene un resumen de los *frameworks* disponibles en https://wiki.python.org/moin/WebProgramming\ .

source: Cameron Laird maintains a useful set of pages about Python web technologies at http://phaseit.net/claird/comp.lang.python/web_python.
es: Cameron Laird mantiene un conjunto útil de páginas sobre tecnologías web Python en http://phaseit.net/claird/comp.lang.python/web_python.

source: How can I mimic CGI form submission (METHOD=POST)?
es: ¿Cómo puedo imitar un envío de formulario CGI (*METHOD=POST*)?

source: I would like to retrieve web pages that are the result of POSTing a form. Is there existing code that would let me do this easily?
es: Me gustaría recuperar páginas web que son resultado del envío de un formulario. ¿Existe algún código que me permita hacer esto fácilmente?

source: Note that in general for percent-encoded POST operations, query strings must be quoted using :func:`urllib.parse.urlencode`. For example, to send ``name=Guy Steele, Jr.``::
es: Nótese que para operaciones POST de tipo *percent-encoded*, las cadenas de consulta tienen que estar entrecomilladas usando :func:`urllib.parse.urlencode`. Por ejemplo, para enviar ``name=Guy Steele, Jr.``::

source: :ref:`urllib-howto` for extensive examples.
es: :ref:`urllib-howto` para ejemplos más detallados.

source: What module should I use to help with generating HTML?
es: ¿Qué modulo debería usar para generación de HTML?

source: You can find a collection of useful links on the `Web Programming wiki page <https://wiki.python.org/moin/WebProgramming>`_.
es: Puede encontrar una colección de enlaces útiles en la `página wiki de programación web <https://wiki.python.org/moin/WebProgramming>`_.

source: How do I send mail from a Python script?
es: ¿Cómo envío correo desde un script Python?

source: Use the standard library module :mod:`smtplib`.
es: Use el módulo :mod:`smtplib` de la biblioteca estándar.

source: Here's a very simple interactive mail sender that uses it. This method will work on any host that supports an SMTP listener. ::
es: Aquí hay un remitente simple interactivo que lo usa. Este método trabajará en cualquier máquina que soporte un *listener SMTP*. ::

source: A Unix-only alternative uses sendmail. The location of the sendmail program varies between systems; sometimes it is ``/usr/lib/sendmail``, sometimes ``/usr/sbin/sendmail``. The sendmail manual page will help you out. Here's some sample code::
es: Una alternativa sólo para UNIX es usar *sendmail*. La ubicación del programa *sendmail* varía entre sistemas; algunas veces está en ``/usr/lib/sendmail``, otras veces en ``/usr/sbin/sendmail``. El manual de *sendmail* le ayudará. Aquí hay un ejemplo de código::

source: How do I avoid blocking in the connect() method of a socket?
es: ¿Cómo evito el bloqueo en el método *connect()* de un *socket*?

source: The :mod:`select` module is commonly used to help with asynchronous I/O on sockets.
es: El módulo :mod:`select` es mayoritariamente usado para ayudar con entrada/salida de sockets.

source: Databases
es: Bases de datos

source: Are there any interfaces to database packages in Python?
es: ¿Hay paquetes para interfaces a bases de datos en Python?

source: Yes.
es: Sí.

source: Interfaces to disk-based hashes such as :mod:`DBM <dbm.ndbm>` and :mod:`GDBM <dbm.gnu>` are also included with standard Python. There is also the :mod:`sqlite3` module, which provides a lightweight disk-based relational database.
es: Interfaces a *hashes* basados en disco tales como :mod:`DBM <dbm.ndbm>` y :mod:`GDBM <dbm.gnu>` están también incluidas en Python estándar. También hay un módulo :mod:`sqlite3`, que proporciona una base de datos relacional ligera basada en disco.

source: Support for most relational databases is available. See the `DatabaseProgramming wiki page <https://wiki.python.org/moin/DatabaseProgramming>`_ for details.
es: Está disponible el soporte para la mayoría de bases de datos relacionales. Vea la `página wiki de Programación de Bases de datos <https://wiki.python.org/moin/DatabaseProgramming>`_ para más detalles.

source: How do you implement persistent objects in Python?
es: ¿Cómo implementar objetos persistentes en Python?

source: The :mod:`pickle` library module solves this in a very general way (though you still can't store things like open files, sockets or windows), and the :mod:`shelve` library module uses pickle and (g)dbm to create persistent mappings containing arbitrary Python objects.
es: El módulo de biblioteca :mod:`pickle` soluciona esto de una forma muy general (aunque todavía no puede almacenar cosas como ficheros abiertos, sockets o ventanas), y el módulo de biblioteca :mod:`shelve` usa *pickle* y *(g)dbm* para crear mapeos persistentes que contienen objetos arbitrarios Python.

source: Mathematics and Numerics
es: Matemáticas y Numérica

source: How do I generate random numbers in Python?
es: ¿Cómo genero números aleatorios en Python?

source: The standard module :mod:`random` implements a random number generator. Usage is simple::
es: El módulo estándar :mod:`random` implementa un generador de números aleatorios. El uso es simple::

source: This returns a random floating point number in the range [0, 1).
es: Esto retorna un número flotante aleatorio en el rango [0, 1).

source: There are also many other specialized generators in this module, such as:
es: Hay también muchos otros generadores especializados en este módulo, tales como:

source: ``randrange(a, b)`` chooses an integer in the range [a, b).
es: ``randrange(a, b)`` selecciona un entero en el rango [a, b).

source: ``uniform(a, b)`` chooses a floating point number in the range [a, b).
es: ``uniform(a, b)`` selecciona un número flotante en el rango [a, b).

source: ``normalvariate(mean, sdev)`` samples the normal (Gaussian) distribution.
es: ``normalvariate(mean, sdev)`` muestrea una distribución normal (*Gausiana*).

source: Some higher-level functions operate on sequences directly, such as:
es: Algunas funciones de alto nivel operan directamente sobre secuencias, tales como:

source: There's also a ``Random`` class you can instantiate to create independent multiple random number generators.
es: También hay una clase ``Random`` que usted puede instanciar para crear múltiples generadores independientes de valores aleatorios.
