Repository: python/python-docs-es
Catalog: faq/programming.po
Languages: es

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
es: Recopila los argumentos usando los especificadores ``*`` y ``**`` en la lista de parámetros de la función; esto te proporciona los argumentos posicionales como una tupla y los argumentos con palabras clave como un diccionario. Puedes, entonces, pasar estos argumentos cuando invoques a otra función usando ``*`` y ``**``::

source: What is the difference between arguments and parameters?
es: ¿Cuál es la diferencia entre argumentos y parámetros?

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
es: *foo*, *bar* y *kwargs* son parámetros de ``func``. Sin embargo, cuando invocamos a ``func``, por ejemplo::

source: the values ``42``, ``314``, and ``somevar`` are arguments.
es: los valores ``42``, ``314`` y ``somevar`` son argumentos.

source: Why did changing list 'y' also change list 'x'?
es: ¿Por qué cambiando la lista 'y' cambia, también, la lista 'x'?

source: If you wrote code like::
es: Si escribes código como::

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
es: te estarás preguntando porque añadir un elemento a ``y`` ha cambiado también a ``x``.

source: There are two factors that produce this result:
es: Hay dos factores que provocan este resultado:

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
es: Las variables son simplemente nombres que referencian a objetos. Haciendo ``y = x`` no crea una copia de la lista -- crea una nueva variable ``y`` que referencia al mismo objeto al que referencia ``x`` . Esto significa que solo existe un objeto (la lista) y tanto ``x`` como ``y`` hacen referencia al mismo.

source: Lists are :term:`mutable`, which means that you can change their content.
es: Las listas son :term:`mutable`, lo que significa que puedes cambiar su contenido.

source: If we instead assign an immutable object to ``x``::
es: Si, por otra parte, asignamos un objeto inmutable a ``x``::

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
es: podemos ver que ``x`` e ``y`` ya no son iguales. Esto es debido a que los enteros son :term:`immutable`, y cuando hacemos ``x = x + 1`` no estamos mutando el entero ``5`` incrementando su valor; en su lugar, estamos creando un nuevo objeto (el entero ``6``) y se lo asignamos a ``x`` (esto es, cambiando el objeto al cual referencia ``x``). Después de esta asignación tenemos dos objetos (los enteros ``6`` y ``5``) y dos variables que referencian a ellos (``x`` ahora referencia a ``6`` pero ``y`` todavía referencia a ``5``).

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
es: Sin embargo, existe una clase de operaciones en las cuales la misma operación tiene, a veces, distintos comportamientos con diferentes tipos: los operadores de asignación aumentada. Por ejemplo, ``+=`` muta listas pero no tuplas o enteros (``a_list += [1, 2, 3]`` es equivalente a ``a_list.extend([1, 2, 3])`` y muta ``a_list``, mientras que ``some_tuple += (1, 2, 3)`` y ``some_int += 1`` crea nuevos objetos).

source: In other words:
es: En otras palabras:

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
es: Si tenemos un objeto mutable (:class:`list`, :class:`dict`, :class:`set`, etc.), podemos usar algunas operaciones específicas para mutarlo y todas las variables que referencian al mismo verán el cambio reflejado.

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
es: Si tenemos un objeto inmutable (:class:`str`, :class:`int`, :class:`tuple`, etc.), todas las variables que referencian al mismo verán siempre el mismo valor pero las operaciones que transforman ese valor en un nuevo valor siempre retornan un nuevo objeto.

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
es: Si deseas saber si dos variables referencian o no al mismo objeto puedes usar el operador :keyword:`is` o la función incorporada :func:`id`.

source: How do I write a function with output parameters (call by reference)?
es: ¿Cómo puedo escribir una función sin parámetros (invocación mediante referencia)?

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
es: Recuerda que los argumentos son pasados mediante asignación en Python. Ya que las asignaciones simplemente crean referencias a objetos, no hay alias entre el nombre de un argumento en el invocador y el invocado y, por tanto, no hay invocación por referencia per se. Puedes obtener el mismo efecto deseado de formas distintas.

source: By returning a tuple of the results::
es: Mediante el retorno de una tupla de resultados::

source: This is almost always the clearest solution.
es: Esta es, casi siempre, la solución más clara.

source: By using global variables. This isn't thread-safe, and is not recommended.
es: Mediante el uso de variables globales. No es thread-safe y no se recomienda.

source: By passing a mutable (changeable in-place) object::
es: Pasando un objeto mutable (intercambiable en el mismo sitio)::

source: By passing in a dictionary that gets mutated::
es: Pasando un diccionario que muta::

source: Or bundle up values in a class instance::
es: O empaquetar valores en una instancia de clase::

source: There's almost never a good reason to get this complicated.
es: Casi nunca existe una buena razón para hacer esto tan complicado.

source: Your best choice is to return a tuple containing the multiple results.
es: Tu mejor opción es retornar una tupla que contenga los múltiples resultados.

source: How do you make a higher order function in Python?
es: ¿Cómo se puede hacer una función de orden superior en Python?

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
es: Tienes dos opciones: puedes usar ámbitos de aplicación anidados o puedes usar objetos invocables. Por ejemplo, supón que querías definir ``linear(a,b)`` que devuelve una función ``f(x)`` que calcula el valor ``a*x+b``. Usar ámbitos de aplicación anidados::

source: Or using a callable object::
es: O usar un objeto invocable::

source: In both cases, ::
es: En ambos casos, ::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
es: nos da un objeto invocable donde ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
es: El enfoque del objeto invocable tiene la desventaja que es un ligeramente más lento y el resultado es un código levemente más largo. Sin embargo, destacar que una colección de invocables pueden compartir su firma vía herencia::

source: Object can encapsulate state for several methods::
es: Los objetos pueden encapsular el estado de varios métodos::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
es: Aquí ``inc()``, ``dec()`` y ``reset()`` se comportan como funciones las cuales comparten la misma variable de conteo.

source: How do I copy an object in Python?
es: ¿Cómo copio un objeto en Python?

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
es: En general, prueba :func:`copy.copy` o :func:`copy.deepcopy` para el caso general. No todos los objetos se pueden copiar pero la mayoría sí que pueden copiarse.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
es: Algunas objetos se pueden copiar de forma más sencilla. Los diccionarios disponen de un método :meth:`~dict.copy`::

source: Sequences can be copied by slicing::
es: Las secuencias se pueden copiar usando un rebanado::

source: How can I find the methods or attributes of an object?
es: ¿Cómo puedo encontrar los métodos o atributos de un objeto?

source: How can my code discover the name of an object?
es: ¿Cómo puede mi código descubrir el nombre de un objeto?

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
es: Hablando de forma general no podrían puesto que los objetos no disponen, realmente, de un nombre. Esencialmente, las asignaciones relacionan un nombre con su valor; Lo mismo se cumple con las declaraciones ``def`` y ``class`` pero, en este caso, el valor es un invocable. Considera el siguiente código::

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
es: En términos generales, no debería ser necesario que tu código "conozca los nombres" de determinados valores. A menos que estés escribiendo deliberadamente programas introspectivos, esto suele ser una indicación de que un cambio de enfoque podría ser beneficioso.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
es: En comp.lang.python, Fredrik Lundh proporcionó una vez una excelente analogía en respuesta a esta pregunta:

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
es: De la misma forma que obtienes el nombre de ese gato que te has encontrado en tu porche el propio gato (objeto) no te puede indicar su nombre y, realmente, no importa -- por tanto, la única forma de encontrar cómo se llama sería preguntando a todos los vecinos (espacios de nombres) si es su gato (objeto)...

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
es: ...y no te sorprendas si encuentras que se le conoce mediante diferentes nombres o ¡nadie conoce su nombre!

source: What's up with the comma operator's precedence?
es: ¿Qué ocurre con la precedencia del operador coma?

source: Comma is not an operator in Python. Consider this session::
es: La coma no es un operador en Python. Considera la sesión::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
es: Debido a que la coma no es un operador sino un separador entre expresiones lo anterior se evalúe como se ha introducido::

source: not::
es: no::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
es: Lo mismo sucede con varios operadores de asignación (``=``, ``+=``, etc). No son realmente operadores sino delimitadores sintácticos en declaraciones de asignación.

source: Is there an equivalent of C's "?:" ternary operator?
es: ¿Existe un equivalente al operador ternario de C "?:"?

source: Yes, there is. The syntax is as follows::
es: Sí, existe. La sintaxis es como sigue::

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
es: Antes de que esta sintaxis se introdujera en Python 2.5 una expresión común fue el uso de operadores lógicos::

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
es: Sin embargo, esa expresión no es segura ya que puede retornar valores erróneos cuando *on_true* tiene un valor booleano falso. Por tanto, siempre es mejor usar la forma ``... if ... else ...``.

source: Is it possible to write obfuscated one-liners in Python?
es: ¿Es posible escribir expresiones en una línea de forma ofuscada en Python?

source: Don't try this at home, kids!
es: ¡No probéis esto en casa, personitas!

source: What does the slash(/) in the parameter list of a function mean?
es: ¿Qué hace la barra (/) en medio de la lista de parámetros de una función?

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
es: El *slash* al final de la lista de parámetros indica que los tres parámetros son únicamente posicionales. Por tanto, invocar a :func:`pow` con argumentos con palabra clave podría derivar en un error::

source: Numbers and strings
es: Números y cadenas

source: How do I specify hexadecimal and octal integers?
es: ¿Cómo puedo especificar enteros hexadecimales y octales?

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
es: Para especificar un dígito octal, prefija el valor octal con un cero y una "o" en minúscula o mayúscula. Por ejemplo, para definir la variable "a" con el valor octal "10" (8 en decimal), escribe::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
es: Un hexadecimal es igual de simple. Simplemente añade un cero y una "x", en minúscula o mayúscula, antes del número hexadecimal . Los dígitos hexadecimales se pueden especificar en minúsculas o mayúsculas. Por ejemplo, en el intérprete de Python::

source: Why does -22 // 10 return -3?
es: ¿Por qué -22 // 10 devuelve -3?

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
es: Es debido, principalmente al deseo que ``i % j`` tenga el mismo signo que ``j``. Si quieres eso y, además, quieres::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
es: entonces la división entera a la baja debe retornar el valor base más bajo. C también requiere que esa identidad se mantenga de tal forma que cuando los compiladores truncan ``i // j`` necesitan que ``i % j`` tenga el mismo signo que ``i``.

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
es: Existen unos pocos casos para ``i % j`` cuando ``j`` es negativo. Cuando ``j`` es positivo, existen muchos casos y, virtualmente, en todos ellos es más útil para ``i % j`` que sea ``>= 0``. Si el reloj dice que ahora son las 10, ¿qué dijo hace 200 horas? ``-190 % 12 == 2`` es útil; ``-190 % 12 == -10`` es un error listo para morderte.

source: How do I get int literal attribute instead of SyntaxError?
es: ¿Cómo puedo obtener un atributo int literal en lugar de SyntaxError?

source: The solution is to separate the literal from the period with either a space or parentheses.
es: La solución es separar el literal del punto con un espacio o un paréntesis.

source: How do I convert a string to a number?
es: ¿Cómo convierto una cadena a un número?

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to floating-point, e.g. ``float('144') == 144.0``.
es: Para enteros puedes usar la función incorporada constructor de tipos :func:`int`, por ejemplo ``int('144') == 144``. De forma similar, :func:`float` convierte a un número de coma flotante, por ejemplo ``float('144') == 144.0``.

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` holds true, and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int( '0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
es: Por defecto, estas interpretan el número como decimal de tal forma que ``int('0144') == 144`` y ``int('0x144')`` lanzará :exc:`ValueError`. ``int(string, base)`` toma la base para convertirlo desde un segundo parámetro opcional, por tanto ``int('0x144', 16) == 324``. Si la base se especifica como 0, el número se interpreta usando las reglas de Python's rules: un prefijo '0o' indica octal y un prefijo '0x' indica un número hexadecimal.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
es: No uses la función incorporada :func:`eval` si todo lo que necesitas es convertir cadenas a números. :func:`eval` será considerablemente más lento y presenta riesgos de seguridad: cualquiera podría introducir una expresión Python que presentara efectos indeseados. Por ejemplo, alguien podría pasar ``__import__('os').system("rm -rf $HOME")`` lo cual borraría el directorio home al completo.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
es: :func:`eval` también tiene el efecto de interpretar números como expresiones Python , de tal forma que, por ejemplo, ``eval('09')`` dará un error de sintaxis porque Python no permite un '0' inicial en un número decimal (excepto '0').

source: How do I convert a number to a string?
es: ¿Cómo puedo convertir un número a una cadena?

source: How do I modify a string in place?
es: ¿Cómo puedo modificar una cadena in situ?

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
es: No puedes debido a que las cadenas son inmutables. En la mayoría de situaciones solo deberías crear una nueva cadena a partir de varias partes que quieras usar para crearla. Sin embargo, si necesitas un objeto con la habilidad de modificar en el mismo lugar datos unicode prueba usando el objeto :class:`io.StringIO` o el módulo :mod:`array`::

source: How do I use strings to call functions/methods?
es: ¿Cómo puedo usar cadenas para invocar funciones/métodos?

source: There are various techniques.
es: Existen varias técnicas.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
es: Lo mejor sería usar un diccionario que mapee cadenas a funciones. La principal ventaja de esta técnica es que las cadenas no necesitan ser iguales que los nombres de las funciones. Esta es también la principal técnica que se usa para emular un constructo *case*::

source: Use the built-in function :func:`getattr`::
es: Usa la función incorporada :func:`getattr`::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
es: Nótese que :func:`getattr` funciona en cualquier objeto, incluido clases, instancias de clases, módulos, etc.

source: This is used in several places in the standard library, like this::
es: Esto se usa en varios lugares de la biblioteca estándar, como esto::

source: Use :func:`locals` to resolve the function name::
es: Use :func:`locals` para resolver el nombre de la función::

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
es: ¿Existe un equivalente a chomp() en Perl para eliminar nuevas líneas al final de las cadenas?

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
es: Puedes usar ``S.rstrip("\r\n")`` para eliminar todas las ocurrencias de cualquier terminación de línea desde el final de la cadena ``S`` sin eliminar el resto de espacios en blanco que le siguen. Si la cadena ``S`` representa más de una línea con varias líneas vacías al final, las terminaciones de línea para todas las líneas vacías se eliminarán::

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
es: Ya que esto solo sería deseable, típicamente, cuando lees texto línea a línea, usar ``S.rstrip()`` de esta forma funcionaría bien.

source: Is there a scanf() or sscanf() equivalent?
es: ¿Existe un equivalente a scanf() o a sscanf() ?

source: Not as such.
es: No de la misma forma.

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
es: ¿Qué significa 'UnicodeDecodeError' o 'UnicodeEncodeError'?

source: See the :ref:`unicode-howto`.
es: Ver :ref:`unicode-howto`.

source: Performance
es: Rendimiento

source: My program is too slow. How do I speed it up?
es: Mi programa es muy lento. ¿Cómo puedo acelerarlo?

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
es: Esa es una pregunta difícil, en general. Primero, aquí tienes una lista de cosas a recordar antes de ir más allá:
