Repository: python/python-docs-es
Catalog: faq/programming.po
Languages: es

source: How can I organize my code to make it easier to change the base class?
es: ¿Cómo puedo organizar mi código para hacer que sea más sencillo modificar la clase base?

source: You could assign the base class to an alias and derive from the alias. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
es: Puede asignar la clase base a un alias y derivar del alias. Entonces todo lo que tiene que cambiar es el valor asignado al alias. Por cierto, este truco también es útil si desea decidir dinámicamente (por ejemplo, dependiendo de la disponibilidad de recursos) qué clase base usar. Ejemplo::

source: How do I create static class data and static class methods?
es: ¿Cómo puedo crear datos estáticos de clase y métodos estáticos de clase?

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
es: Tanto los datos estáticos como los métodos estáticos (en el sentido de C++ o Java) están permitidos en Python.

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
es: Para datos estáticos simplemente define un atributo de clase. Para asignar un nuevo valor al atributo debes usar de forma explícita el nombre de la clase en la asignación::

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
es: ``c.count`` también se refiere a ``C.count`` para cualquier ``c`` de tal forma que se cumpla ``isinstance(c, C)``, a no ser que ``c`` sea sobreescrita por si misma o por alguna clase contenida en la búsqueda de clases base desde ``c.__class__`` hasta ``C``.

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
es: Debes tener cuidado: dentro de un método de C, una asignación como ``self.count = 42`` creará una nueva instancia sin relación con la original que se llamará "count" en el propio diccionario de ``self``. El reunificar el nombre de datos estáticos de una clase debería llevar, siempre, a especificar la clase tanto si se produce desde dentro de un método como si no::

source: Static methods are possible::
es: Los métodos estáticos son posibles::

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
es: Sin embargo, una forma más directa de obtener el efecto de un método estático sería mediante una simple función a nivel de módulo::

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
es: Si has estructurado tu código para definir una clase única (o una jerarquía de clases altamente relacionadas) por módulo, esto proporcionará la encapsulación deseada.

source: How can I overload constructors (or methods) in Python?
es: ¿Como puedo sobrecargar constructores (o métodos) en Python?

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
es: Esta respuesta es aplicable, en realidad, a todos los métodos pero la pregunta suele surgir primero en el contexto de los constructores.

source: In C++ you'd write
es: En C++ deberías escribir

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
es: En Python solo debes escribir un único constructor que tenga en cuenta todos los casos usando los argumentos por defecto. Por ejemplo::

source: This is not entirely equivalent, but close enough in practice.
es: Esto no es totalmente equivalente pero, en la práctica, es muy similar.

source: You could also try a variable-length argument list, e.g. ::
es: Podrías intentar, también una lista de argumentos de longitud variable, por ejemplo ::

source: The same approach works for all method definitions.
es: El mismo enfoque funciona para todas las definiciones de métodos.

source: I try to use __spam and I get an error about _SomeClassName__spam.
es: Intento usar __spam y obtengo un error sobre _SomeClassName__spam.

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
es: Nombres de variable con doble guión prefijado se convierten, con una modificación de nombres, para proporcionar una forma simple pero efectiva de definir variables de clase privadas. Cualquier identificador de la forma ``__spam`` (como mínimo dos guiones bajos como prefijo, como máximo un guión bajo como sufijo) se reemplaza con ``_classname__spam``, donde ``classname`` es el nombre de la clase eliminando cualquier guión bajo prefijado.

source: This doesn't guarantee privacy: an outside user can still deliberately access the "_classname__spam" attribute, and private values are visible in the object's ``__dict__``. Many Python programmers never bother to use private variable names at all.
es: Esto no garantiza la privacidad: un usuario externo puede acceder, de forma deliberada y si así lo desea, al atributo "_classname__spam", y los valores privados son visibles en el ``__dict__`` del objeto. Muchos programadores Python no se suelen molestar en usar nombres privados de variables.

source: My class defines __del__ but it is not called when I delete the object.
es: Mi clase define __del__ pero no se le invoca cuando borro el objeto.

source: There are several possible reasons for this.
es: Existen varias razones posibles para que suceda así.

source: Another way to avoid cyclical references is to use the :mod:`weakref` module, which allows you to point to objects without incrementing their reference count. Tree data structures, for instance, should use weak references for their parent and sibling references (if they need them!).
es: Otra forma de evitar referencias cíclicas sería usando el módulo :mod:`weakref`, que permite apuntar hacia objetos sin incrementar su conteo de referencias. Las estructuras de datos en árbol, por ejemplo, deberían usar referencias débiles para las referencias del padre y hermanos (¡si es que las necesitan!).

source: How do I get a list of all instances of a given class?
es: ¿Cómo puedo obtener una lista de todas las instancias de una clase dada?

source: Python does not keep track of all instances of a class (or of a built-in type). You can program the class's constructor to keep track of all instances by keeping a list of weak references to each instance.
es: Python no hace seguimiento de todas las instancias de una clase (o de los tipos incorporados). Puedes programar el constructor de una clase para que haga seguimiento de todas sus instancias manteniendo una lista de referencias débiles a cada instancia.

source: Why does the result of ``id()`` appear to be not unique?
es: ¿Por qué el resultado de ``id()`` no parece ser único?

source: The :func:`id` builtin returns an integer that is guaranteed to be unique during the lifetime of the object. Since in CPython, this is the object's memory address, it happens frequently that after an object is deleted from memory, the next freshly created object is allocated at the same position in memory. This is illustrated by this example:
es: La función incorporada :func:`id` devuelve un entero que se garantiza que sea único durante la vida del objeto. Debido a que en CPython esta es la dirección en memoria del objeto, sucede que, frecuentemente, después de que un objeto se elimina de la memoria el siguiente objeto recién creado se localiza en la misma posición en memoria. Esto se puede ver ilustrado en este ejemplo:

source: The two ids belong to different integer objects that are created before, and deleted immediately after execution of the ``id()`` call. To be sure that objects whose id you want to examine are still alive, create another reference to the object:
es: Las dos ids pertenecen a dos objetos 'entero' diferentes que se crean antes y se eliminan inmediatamente después de la ejecución de la invocación a ``id()``. Para estar seguro que los objetos cuya id quieres examinar siguen vivos crea otra referencia al objeto:

source: When can I rely on identity tests with the *is* operator?
es: ¿Cuándo puedo fiarme de pruebas de identidad con el operador *is*?

source: The ``is`` operator tests for object identity. The test ``a is b`` is equivalent to ``id(a) == id(b)``.
es: El operador ``is`` verifica la identidad de un objeto. La prueba ``a is b`` es equivalente a ``id(a) == id(b)``.

source: The most important property of an identity test is that an object is always identical to itself, ``a is a`` always returns ``True``. Identity tests are usually faster than equality tests. And unlike equality tests, identity tests are guaranteed to return a boolean ``True`` or ``False``.
es: La propiedad más importante de una prueba de identidad es que un objeto siempre es idéntico a si mismo, ``a is a`` siempre devuelve ``True``. Las pruebas de identidad suelen ser más rápidas que pruebas de igualdad. Y a diferencia de las pruebas de igualdad, las pruebas de identidad están garantizadas de devolver un booleano ``True`` o ``False``.

source: However, identity tests can *only* be substituted for equality tests when object identity is assured. Generally, there are three circumstances where identity is guaranteed:
es: Sin embargo, las pruebas de identidad *solo* pueden ser sustituidas por pruebas de igualdad cuando la identidad de objeto está asegurada. Generalmente hay tres circunstancias en las que la identidad está garantizada:

source: 1) Assignments create new names but do not change object identity. After the assignment ``new = old``, it is guaranteed that ``new is old``.
es: 1) Las asignaciones crean nuevos nombres pero no cambian la identidad del objeto. Luego de la asignación ``new = old``, está garantizado que ``new is old``.

source: 2) Putting an object in a container that stores object references does not change object identity. After the list assignment ``s[0] = x``, it is guaranteed that ``s[0] is x``.
es: 2) Poner un objeto en un contenedor que guarda referencias de objeto no cambia la identidad del objeto. Luego de la asignación de lista ``s[0] = x``, está garantizado que ``s[0] is x``.

source: 3) If an object is a singleton, it means that only one instance of that object can exist. After the assignments ``a = None`` and ``b = None``, it is guaranteed that ``a is b`` because ``None`` is a singleton.
es: 3) Si un objeto es un singleton, significa que solo una instancia de ese objeto puede existir. Después de las asignaciones ``a = None`` y ``b = None``, está garantizado que ``a is b`` porque ``None`` es un singleton.

source: In most other circumstances, identity tests are inadvisable and equality tests are preferred. In particular, identity tests should not be used to check constants such as :class:`int` and :class:`str` which aren't guaranteed to be singletons::
es: En la mayoría de las demás circunstancias, no se recomiendan las pruebas de identidad y las pruebas de igualdad son preferidas. En particular, las pruebas de identidad no deben ser usadas para verificar constantes como :class:`int` y :class:`str` que no están garantizadas a ser singletons::

source: Likewise, new instances of mutable containers are never identical::
es: De la misma manera, nuevas instancias de contenedores mutables nunca son idénticas::

source: In the standard library code, you will see several common patterns for correctly using identity tests:
es: En la librería estándar de código, verás varios patrones comunes para usar correctamente pruebas de identidad:

source: 1) As recommended by :pep:`8`, an identity test is the preferred way to check for ``None``. This reads like plain English in code and avoids confusion with other objects that may have boolean values that evaluate to false.
es: 1) Como es recomendado por :pep:`8`, una prueba de identidad es el método preferido para verificar si es ``None``. Esto se lee como lenguaje normal en el código y evita confusión con otros objetos que puedan tener valores booleanos que se evalúen como falsos.

source: 3) Container implementations sometimes need to augment equality tests with identity tests. This prevents the code from being confused by objects such as ``float('NaN')`` that are not equal to themselves.
es: 3) Las implementaciones de contenedor a veces necesitan aumentar pruebas de igualdad con pruebas de identidad. Esto previene que el código sea confundido con objetos como ``float('NaN')`` que no son iguales que si mismos.

source: How can a subclass control what data is stored in an immutable instance?
es: ¿Cómo puede una subclase controlar qué datos se almacenan en una instancia inmutable?

source: All of these immutable classes have a different signature than their parent class:
es: Todas estas clases inmutables tienen una firma distinta que su clase padre:

source: The classes can be used like this:
es: Las clases pueden ser utilizadas así:

source: How do I cache method calls?
es: ¿Cómo cacheo llamadas de método?

source: The two principal tools for caching methods are :func:`functools.cached_property` and :func:`functools.lru_cache`. The former stores results at the instance level and the latter at the class level.
es: Las dos herramientas principales para cachear métodos son :func:`functools.cached_property` y :func:`functools.lru_cache`. El primero guarda resultados a nivel de instancia y el último a nivel de clase.

source: The *cached_property* approach only works with methods that do not take any arguments. It does not create a reference to the instance. The cached method result will be kept only as long as the instance is alive.
es: La función *cached_property* sólo funciona con métodos que no acepten argumentos. No crea una referencia a la instancia. El resultado del método cacheado se mantendrá solo mientras que la instancia esté activa.

source: The advantage of the least recently used algorithm is that the cache is bounded by the specified *maxsize*. The disadvantage is that instances are kept alive until they age out of the cache or until the cache is cleared.
es: La ventaja del algoritmo usado menos recientemente es que el cache está limitado por el *maxsize* especificado. La desventaja es que las instancias se mantienen activas hasta que sean eliminadas del cache por edad o que el cache sea borrado.

source: This example shows the various techniques::
es: Este ejemplo muestra las diversas técnicas::

source: The above example assumes that the *station_id* never changes. If the relevant instance attributes are mutable, the *cached_property* approach can't be made to work because it cannot detect changes to the attributes.
es: El ejemplo anterior asume que la *station_id* nunca cambia. Si los atributos de la instancia relevante son mutables, el método de *cached_property* no puede funcionar porque no puede detectar cambios en los atributos.

source: Modules
es: Módulos

source: How do I create a .pyc file?
es: ¿Cómo creo un fichero .pyc?

source: When a module is imported for the first time (or when the source file has changed since the current compiled file was created) a ``.pyc`` file containing the compiled code should be created in a ``__pycache__`` subdirectory of the directory containing the ``.py`` file. The ``.pyc`` file will have a filename that starts with the same name as the ``.py`` file, and ends with ``.pyc``, with a middle component that depends on the particular ``python`` binary that created it. (See :pep:`3147` for details.)
es: Cuando se importa un módulo por primera vez (o cuando el código fuente ha cambiado desde que el fichero compilado se creó) un fichero ``.pyc`` que contiene el código compilado se debería crear en la subcarpeta ``__pycache__`` del directorio que contiene al fichero ``.py``. El fichero ``.pyc`` tendrá un nombre que empezará con el mismo nombre que el del fichero ``.py`` y terminará con ``.pyc``, con un componente intermedio que dependerá del binario ``python`` en particular que lo creó. (Ver :pep:`3147` para detalles.)

source: One reason that a ``.pyc`` file may not be created is a permissions problem with the directory containing the source file, meaning that the ``__pycache__`` subdirectory cannot be created. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server.
es: Una razón por la que no se cree un fichero ``.pyc`` podría ser debido a un problema de permisos del directorio que contiene al fichero fuente, lo que significa que el subdirectorio ``__pycache__`` no se puede crear. Esto puede suceder, por ejemplo, si desarrollas como un usuario pero lo ejecutas como otro, como si estuvieras probando en un servidor web.

source: Unless the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable is set, creation of a .pyc file is automatic if you're importing a module and Python has the ability (permissions, free space, etc...) to create a ``__pycache__`` subdirectory and write the compiled module to that subdirectory.
es: Hasta que no definas la variable de entorno :envvar:`PYTHONDONTWRITEBYTECODE`, la creación de un fichero .pyc se hará automáticamente si importas un módulo y Python dispone de la habilidad (permisos, espacio libre, etc...) para crear un subdirectorio ``__pycache__`` y escribir un módulo compilado en ese subdirectorio.

source: Running Python on a top level script is not considered an import and no ``.pyc`` will be created. For example, if you have a top-level module ``foo.py`` that imports another module ``xyz.py``, when you run ``foo`` (by typing ``python foo.py`` as a shell command), a ``.pyc`` will be created for ``xyz`` because ``xyz`` is imported, but no ``.pyc`` file will be created for ``foo`` since ``foo.py`` isn't being imported.
es: La ejecución de un script principal Python no se considera una importación y no se crea el fichero ``.pyc``. Por ejemplo, Si tienes un módulo principal ``foo.py`` que importa a otro módulo ``xyz.py``, cuando ejecutas ``foo`` (mediante un comando de la shell ``python foo.py``), se creará un fichero ``.pyc`` para ``xyz`` porque ``xyz`` ha sido importado, pero no se creará un fichero ``.pyc`` para ``foo`` ya que ``foo.py`` no ha sido importado.

source: If you need to create a ``.pyc`` file for ``foo`` -- that is, to create a ``.pyc`` file for a module that is not imported -- you can, using the :mod:`py_compile` and :mod:`compileall` modules.
es: Si necesitas crear un fichero ``.pyc`` también para ``foo`` -- es decir, crear un fichero ``.pyc`` para un módulo que no ha sido importado -- puedes usar los módulos :mod:`py_compile` y :mod:`compileall`.

source: The :mod:`py_compile` module can manually compile any module. One way is to use the ``compile()`` function in that module interactively::
es: El módulo :mod:`py_compile` puede compilar manualmente cualquier módulo. Una forma sería usando la función ``compile()`` de ese módulo de forma interactiva::

source: This will write the ``.pyc`` to a ``__pycache__`` subdirectory in the same location as ``foo.py`` (or you can override that with the optional parameter ``cfile``).
es: Esto escribirá ``.pyc`` en el subdirectorio ``__pycache__`` en la misma localización en la que se encuentre ``foo.py`` (o, puedes sobreescribir ese comportamiento con el parámetro opcional ``cfile``).

source: You can also automatically compile all files in a directory or directories using the :mod:`compileall` module. You can do it from the shell prompt by running ``compileall.py`` and providing the path of a directory containing Python files to compile::
es: Puedes compilar automáticamente todos los ficheros en un directorio o directorios usando el módulo :mod:`compileall`. Lo puedes hacer desde la línea de comandos ejecutando ``compileall.py`` y proporcionando una ruta al directorio que contiene los ficheros Python a compilar::

source: How do I find the current module name?
es: ¿Cómo puedo encontrar el nombre del módulo en uso?

source: A module can find out its own module name by looking at the predefined global variable ``__name__``. If this has the value ``'__main__'``, the program is running as a script. Many modules that are usually used by importing them also provide a command-line interface or a self-test, and only execute this code after checking ``__name__``::
es: Un módulo puede encontrar su propio nombre mirando en la variable global predeterminada ``__name__``. Si tiene el valor ``'__main__'``, el programa se está ejecutando como un script. Muchos módulos que se usan, generalmente, importados en otro script proporcionan, además, una interfaz para la línea de comandos o para probarse a si mismos y solo ejecutan código después de comprobar ``__name__``::

source: How can I have modules that mutually import each other?
es: ¿Cómo podría tener módulos que se importan mutuamente entre ellos?

source: Suppose you have the following modules:
es: Supón que tienes los siguientes módulos:

source: The problem is that the interpreter will perform the following steps:
es: El problema es que el intérprete realizará los siguientes pasos:

source: main imports ``foo``
es: main importa a ``foo``

source: Empty globals for ``foo`` are created
es: Se crean *globals* vacíos para foo

source: ``foo`` is compiled and starts executing
es: ``foo`` se compila y se comienza a ejecutar

source: ``foo`` imports ``bar``
es: ``foo`` importa a ``bar``

source: Empty globals for ``bar`` are created
es: Se crean *globals* vacíos para ``bar``

source: ``bar`` is compiled and starts executing
es: ``bar`` se compila y se comienza a ejecutar

source: ``bar`` imports ``foo`` (which is a no-op since there already is a module named ``foo``)
es: ``bar`` importa a ``foo`` (lo cual es un no-op ya que ya hay un módulo que se llama ``foo``)

source: The import mechanism tries to read ``foo_var`` from ``foo`` globals, to set ``bar.foo_var = foo.foo_var``
es: El mecanismo de importado intenta leer ``foo_var`` de globales de ``foo``, para establecer ``bar.foo_var = foo.foo_var``

source: The last step fails, because Python isn't done with interpreting ``foo`` yet and the global symbol dictionary for ``foo`` is still empty.
es: El último paso falla debido a que Python todavía no ha terminado de interpretar a ``foo`` y el diccionario de símbolos global para ``foo`` todavía se encuentra vacío.

source: The same thing happens when you use ``import foo``, and then try to access ``foo.foo_var`` in global code.
es: Lo mismo ocurre cuando usas ``import foo`` y luego tratas de acceder a ``foo.foo_var`` en un código global.

source: There are (at least) three possible workarounds for this problem.
es: Existen (al menos) tres posibles soluciones para este problema.
