Repository: python/python-docs-es
Catalog: faq/programming.po
Languages: es

source: Guido van Rossum recommends avoiding all uses of ``from <module> import ...``, and placing all code inside functions. Initializations of global variables and class variables should use constants or built-in functions only. This means everything from an imported module is referenced as ``<module>.<name>``.
es: Guido van Rossum recomienda evitar todos los usos de ``from <module> import ...``, y colocar todo el código dentro de funciones. La inicialización de variables globales y variables de clase debería usar únicamente constantes o funciones incorporadas . Esto significa que todo se referenciará como ``<module>.<name>`` desde un módulo importado.

source: Jim Roskind suggests performing steps in the following order in each module:
es: Jim Roskind sugiere realizar los siguientes pasos en el siguiente orden en cada módulo:

source: exports (globals, functions, and classes that don't need imported base classes)
es: exportar (*globals*, funciones y clases que no necesitan clases bases importadas)

source: ``import`` statements
es: ``import`` declaraciones

source: active code (including globals that are initialized from imported values).
es: código activo (incluyendo *globals* que han sido inicializados desde valores importados).

source: Matthias Urlichs recommends restructuring your code so that the recursive import is not necessary in the first place.
es: Matthias Urlichs recomienda reestructurar tu código de tal forma que un import recursivo no sea necesario.

source: These solutions are not mutually exclusive.
es: Estas soluciones no son mutuamente excluyentes.

source: __import__('x.y.z') returns <module 'x'>; how do I get z?
es: __import__('x.y.z') devuelve <module 'x'>; ¿cómo puedo obtener z?

source: Consider using the convenience function :func:`~importlib.import_module` from :mod:`importlib` instead::
es: Considera, en su lugar, usa la función de conveniencia :func:`~importlib.import_module` de :mod:`importlib`::

source: When I edit an imported module and reimport it, the changes don't show up. Why does this happen?
es: Cuando edito un módulo importado y lo reimporto los cambios no tienen efecto. ¿Por qué sucede esto?

source: For reasons of efficiency as well as consistency, Python only reads the module file on the first time a module is imported. If it didn't, in a program consisting of many modules where each one imports the same basic module, the basic module would be parsed and re-parsed many times. To force re-reading of a changed module, do this::
es: Por razones de eficiencia además de por consistencia, Python solo lee el fichero del módulo la primera vez que el módulo se importa. Si no lo hiciera así, un programa escrito en muchos módulos donde cada módulo importa al mismo módulo básico estaría analizando sintácticamente el mismo módulo básico muchas veces. Para forzar una relectura de un módulo que ha sido modificado haz lo siguiente::

source: Warning: this technique is not 100% fool-proof. In particular, modules containing statements like ::
es: Alerta: esta técnica no es 100% segura. En particular, los módulos que contienen declaraciones como ::

source: will continue to work with the old version of the imported objects. If the module contains class definitions, existing class instances will *not* be updated to use the new class definition. This can result in the following paradoxical behaviour::
es: continuarán funcionando con la versión antigua de los objetos importados. Si el módulo contiene definiciones de clase, instancias de clase ya existentes *no* se actualizarán para usar la nueva definición de la clase. Esto podría resultar en el comportamiento paradójico siguiente::

source: The nature of the problem is made clear if you print out the "identity" of the class objects::
es: La naturaleza del problema se hace evidente si muestras la "identity" de los objetos clase::
