Repository: python/python-docs-es
Catalog: faq/programming.po
Languages: es

source: Programming FAQ
es: Preguntas frecuentes de programación

source: Contents
es: Contenido

source: General Questions
es: Preguntas generales

source: Is there a source code level debugger with breakpoints, single-stepping, etc.?
es: ¿Existe un depurador a nivel de código fuente con puntos de interrupción, depuración paso a paso, etc?

source: Yes.
es: Sí.

source: Several debuggers for Python are described below, and the built-in function :func:`breakpoint` allows you to drop into any of them.
es: Debajo se describen algunos depuradores para Python y la función integrada :func:`breakpoint` te permite ejecutar alguno de ellos.

source: The pdb module is a simple but adequate console-mode debugger for Python. It is part of the standard Python library, and is :mod:`documented in the Library Reference Manual <pdb>`. You can also write your own debugger by using the code for pdb as an example.
es: El módulo pdb es en depurador en modo consola simple pero conveniente para Python. Es parte de la biblioteca estándar de Python y está :mod:`documentado en el manual de referencia de la biblioteca <pdb>`. Puedes escribir tu propio depurador usando el código de pdb como ejemplo.

source: PythonWin is a Python IDE that includes a GUI debugger based on pdb. The PythonWin debugger colors breakpoints and has quite a few cool features such as debugging non-PythonWin programs. PythonWin is available as part of `pywin32 <https://github.com/mhammond/pywin32>`_ project and as a part of the `ActivePython <https://www.activestate.com/products/python/>`_ distribution.
es: PythonWin es un IDE Python que incluye un depurador con GUI basado en pdb. El depurador PythonWin colorea los puntos de interrupción y dispone de características geniales como la depuración de programas no modificados mediante PythonWin. PythonWin está disponible como parte del proyecto `Las extensiones de Python para Windows <https://sourceforge.net/ projects/pywin32/>`_ y como parte de la distribución `ActivePython <https://www.activestate.com/activepython>`_.

source: `trepan3k <https://github.com/rocky/python3-trepan/>`_ is a gdb-like debugger.
es: `trepan3k <https://github.com/rocky/python3-trepan/>`_ es un depurador similar a `gdb`.

source: `Visual Studio Code <https://code.visualstudio.com/>`_ is an IDE with debugging tools that integrates with version-control software.
es: `Visual Studio Code <https://code.visualstudio.com/>`_ es un IDE con herramientas de depuración que se integra con software de control de versiones.

source: There are a number of commercial Python IDEs that include graphical debuggers. They include:
es: Existen varios IDEs comerciales para Python que incluyen depuradores gráficos. Entre ellos tenemos:

source: `Wing IDE <https://wingware.com/>`_
es: `IDE Wing <https://wingware.com/>`_

source: `Komodo IDE <https://www.activestate.com/products/komodo-ide/>`_
es: `IDE Komodo <https://www.activestate.com/products/komodo-ide/>`_

source: Are there tools to help find bugs or perform static analysis?
es: ¿Existe alguna herramienta que ayude a encontrar errores o realizar análisis estático?

source: How can I create a stand-alone binary from a Python script?
es: ¿Cómo puedo crear un binario independiente a partir de un programa Python?

source: You don't need the ability to compile Python to C code if all you want is a stand-alone program that users can download and run without having to install the Python distribution first. There are a number of tools that determine the set of modules required by a program and bind these modules together with a Python binary to produce a single executable.
es: No necesitas tener la habilidad de compilar Python a código C si lo único que necesitas es un programa independiente que los usuarios puedan descargar y ejecutar sin necesidad de instalar primero una distribución Python. Existe una serie de herramientas que determinan el conjunto de módulos que necesita un programa y une estos módulos conjuntamente con un binario Python para generar un único ejecutable.

source: It works by scanning your source recursively for import statements (in both forms) and looking for the modules in the standard Python path as well as in the source directory (for built-in modules). It then turns the bytecode for modules written in Python into C code (array initializers that can be turned into code objects using the marshal module) and creates a custom-made config file that only contains those built-in modules which are actually used in the program. It then compiles the generated C code and links it with the rest of the Python interpreter to form a self-contained binary which acts exactly like your script.
es: Funciona escaneando su fuente de forma recursiva en busca de declaraciones de importación (en ambas formas) y buscando los módulos en la ruta estándar de Python, así como en el directorio de la fuente (para los módulos incorporados). Luego convierte el *bytecode* de los módulos escritos en Python en código C (inicializadores de arrays que pueden ser convertidos en objetos de código usando el módulo marshal) y crea un archivo de configuración a medida que sólo contiene aquellos módulos incorporados que se usan realmente en el programa. A continuación, compila el código C generado y lo enlaza con el resto del intérprete de Python para formar un binario autónomo que actúa exactamente igual que su script.

source: The following packages can help with the creation of console and GUI executables:
es: Los siguientes paquetes pueden ayudar con la creación de ejecutables de consola y GUI:

source: `Nuitka <https://nuitka.net/>`_ (Cross-platform)
es: `Nuitka <https://nuitka.net/>`_ (Multiplataforma)

source: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Cross-platform)
es: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Multiplataforma)

source: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Cross-platform)
es: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Multiplataforma)

source: `py2app <https://github.com/ronaldoussoren/py2app>`_ (macOS only)
es: `py2app <https://github.com/ronaldoussoren/py2app>`_ (macOS solamente)

source: Are there coding standards or a style guide for Python programs?
es: ¿Existen estándares de código o una guía de estilo para programas Python?

source: Yes. The coding style required for standard library modules is documented as :pep:`8`.
es: Sí. El estilo de código requerido para los módulos de la biblioteca estándar se encuentra documentado como :pep:`8`.

source: Core Language
es: Núcleo del lenguaje

source: Why am I getting an UnboundLocalError when the variable has a value?
es: ¿Por qué obtengo un *UnboundLocalError* cuando la variable tiene un valor?

source: This code:
es: Este código:

source: works, but this code:
es: funciona, pero este código:

source: This is because when you make an assignment to a variable in a scope, that variable becomes local to that scope and shadows any similarly named variable in the outer scope. Since the last statement in foo assigns a new value to ``x``, the compiler recognizes it as a local variable. Consequently when the earlier ``print(x)`` attempts to print the uninitialized local variable and an error results.
es: Esto es debido a que cuando realizas una asignación a una variable en un ámbito de aplicación, esa variable se convierte en local y enmascara cualquier variable llamada de forma similar en un ámbito de aplicación exterior. Desde la última declaración en foo asigna un nuevo valor a ``x``, el compilador la reconoce como una variable local. Consecuentemente, cuando el ``print(x)`` más próximo intenta mostrar la variable local no inicializada se muestra un error.

source: In the example above you can access the outer scope variable by declaring it global:
es: En el ejemplo anterior puedes acceder al ámbito de aplicación exterior a la variable declarándola como global:

source: This explicit declaration is required in order to remind you that (unlike the superficially analogous situation with class and instance variables) you are actually modifying the value of the variable in the outer scope:
es: Esta declaración explícita es necesaria de cara a recordarte que (a diferencia de la situación superficialmente análoga con las variables de clase e instancia) estás modificando el valor de la variable en un ámbito de aplicación más externo:

source: You can do a similar thing in a nested scope using the :keyword:`nonlocal` keyword:
es: Puedes hacer algo similar en un ámbito de aplicación anidado usando la palabra clave :keyword:`nonlocal`:

source: What are the rules for local and global variables in Python?
es: ¿Cuáles son las reglas para las variables locales y globales en Python?

source: In Python, variables that are only referenced inside a function are implicitly global. If a variable is assigned a value anywhere within the function's body, it's assumed to be a local unless explicitly declared as global.
es: En Python, las variables que solo se encuentran referenciadas dentro de una función son globales implícitamente. Si a una variable se le asigna un valor en cualquier lugar dentro del cuerpo de una función, se asumirá que es local a no ser que explícitamente se la declare como global.

source: Though a bit surprising at first, a moment's consideration explains this. On one hand, requiring :keyword:`global` for assigned variables provides a bar against unintended side-effects. On the other hand, if ``global`` was required for all global references, you'd be using ``global`` all the time. You'd have to declare as global every reference to a built-in function or to a component of an imported module. This clutter would defeat the usefulness of the ``global`` declaration for identifying side-effects.
es: Aunque, inicialmente, puede parecer sorprendente, un momento de consideración permite explicar esto. Por una parte, requerir :keyword:`global` para variables asignadas proporciona una barrera frente a efectos secundarios indeseados. Por otra parte, si ``global`` es requerido para todas las referencias globales, deberás usar ``global`` en todo momento. Deberías declarar como global cualquier referencia a una función integrada o a un componente de un módulo importado. Este embrollo arruinaría la utilidad de la declaración "global" para identificar los efectos secundarios.

source: Why do lambdas defined in a loop with different values all return the same result?
es: ¿Por qué las funciones lambda definidas en un bucle con diferentes valores devuelven todas el mismo resultado?

source: Assume you use a for loop to define a few different lambdas (or even plain functions), e.g.::
es: Considera que usas un bucle *for* para crear unas pocas funciones lambda (o, incluso, funciones normales), por ejemplo.::

source: This gives you a list that contains 5 lambdas that calculate ``x**2``. You might expect that, when called, they would return, respectively, ``0``, ``1``, ``4``, ``9``, and ``16``. However, when you actually try you will see that they all return ``16``::
es: Lo siguiente proporciona una lista que contiene 5 funciones lambda que calculan ``x**2``. Esperarías que, cuando se les invoca, retornaran, respectivamente, ``0``, ``1``, ``4``, ``9`` y ``16``. Sin embargo, cuando lo ejecutes verás que todas devuelven ``16``::

source: This happens because ``x`` is not local to the lambdas, but is defined in the outer scope, and it is accessed when the lambda is called --- not when it is defined. At the end of the loop, the value of ``x`` is ``4``, so all the functions now return ``4**2``, i.e. ``16``. You can also verify this by changing the value of ``x`` and see how the results of the lambdas change::
es: Esto sucede porque ``x`` no es una función lambda local pero se encuentra definida en un ámbito de aplicación externo y se accede cuando la lambda es invocada --- no cuando ha sido definida. Al final del bucle, el valor de ``x`` es ``4``, por tanto, ahora todas las funciones devuelven ``4**2``, i.e. ``16``. También puedes verificar esto mediante el cambio del valor de ``x`` y ver como los resultados de las lambdas cambian::

source: In order to avoid this, you need to save the values in variables local to the lambdas, so that they don't rely on the value of the global ``x``::
es: De cara a evitar esto necesitas guardar los valores en variables locales a las funciones lambda de tal forma que no dependan del valor de la ``x`` global::

source: Here, ``n=x`` creates a new variable ``n`` local to the lambda and computed when the lambda is defined so that it has the same value that ``x`` had at that point in the loop. This means that the value of ``n`` will be ``0`` in the first lambda, ``1`` in the second, ``2`` in the third, and so on. Therefore each lambda will now return the correct result::
es: Aquí, ``n=x`` crea una nueva variable ``n`` local a la función lambda y ejecutada cuando la función lambda se define de tal forma que tiene el mismo valor que tenía ``x`` en ese punto en el bucle. Esto significa que el valor de ``n`` será ``0`` en la primera función lambda, ``1`` en la segunda, ``2`` en la tercera y así sucesivamente. Por tanto, ahora cada lambda retornará el resultado correcto::

source: Note that this behaviour is not peculiar to lambdas, but applies to regular functions too.
es: Es de destacar que este comportamiento no es peculiar de las funciones lambda sino que aplica también a las funciones regulares.

source: How do I share global variables across modules?
es: ¿Cómo puedo compartir variables globales entre módulos?

source: The canonical way to share information across modules within a single program is to create a special module (often called config or cfg). Just import the config module in all modules of your application; the module then becomes available as a global name. Because there is only one instance of each module, any changes made to the module object get reflected everywhere. For example:
es: La forma canónica de compartir información entre módulos dentro de un mismo programa sería creando un módulo especial (a menudo llamado config o cfg). Simplemente importa el módulo config en todos los módulos de tu aplicación; el módulo estará disponible como un nombre global. Debido a que solo hay una instancia de cada módulo, cualquier cambio hecho en el objeto módulo se reflejará en todos los sitios. Por ejemplo:

source: What are the "best practices" for using import in a module?
es: ¿Cuáles son las "buenas prácticas" para usar import en un módulo?

source: In general, don't use ``from modulename import *``. Doing so clutters the importer's namespace, and makes it much harder for linters to detect undefined names.
es: En general, no uses ``from modulename import *``. Haciendo eso embarulla el espacio de nombres del importador y hace que sea más difícil para los *linters* el detectar los nombres sin definir.

source: Import modules at the top of a file. Doing so makes it clear what other modules your code requires and avoids questions of whether the module name is in scope. Using one import per line makes it easy to add and delete module imports, but using multiple imports per line uses less screen space.
es: Importar los módulos en la parte inicial del fichero. Haciéndolo así deja claro los módulos que son necesarios para tu código y evita preguntas sobre si el nombre del módulo se encuentra en el ámbito de la aplicación. Usar una importación por línea hace que sea sencillo añadir y eliminar módulos importados pero usar múltiples importaciones por línea usa menos espacio de pantalla.

source: It's good practice if you import modules in the following order:
es: Es una buena práctica si importas los módulos en el orden siguiente:

source: It is sometimes necessary to move imports to a function or class to avoid problems with circular imports. Gordon McMillan says:
es: Hay veces en que es necesario mover las importaciones a una función o clase para evitar problemas de importaciones circulares. Gordon McMillan dice:

source: Circular imports are fine where both modules use the "import <module>" form of import. They fail when the 2nd module wants to grab a name out of the first ("from module import name") and the import is at the top level. That's because names in the 1st are not yet available, because the first module is busy importing the 2nd.
es: No hay problema con las importaciones circulares cuando ambos módulos usan la forma de importación "import <module>". Fallará cuando el segundo módulo quiera coger un nombre del primer módulo ("from module import name") y la importación se encuentre en el nivel superior. Esto sucede porque los nombres en el primero todavía no se encuentran disponibles debido a que el primer módulo se encuentra ocupado importando al segundo.

source: In this case, if the second module is only used in one function, then the import can easily be moved into that function. By the time the import is called, the first module will have finished initializing, and the second module can do its import.
es: En este caso, si el segundo módulo se usa solamente desde una función, la importación se puede mover de forma sencilla dentro de la función. En el momento en que se invoca a la importación el primer módulo habrá terminado de inicializarse y el segundo módulo podrá hacer la importación.

source: It may also be necessary to move imports out of the top level of code if some of the modules are platform-specific. In that case, it may not even be possible to import all of the modules at the top of the file. In this case, importing the correct modules in the corresponding platform-specific code is a good option.
es: También podría ser necesario mover importaciones fuera del nivel superior del código si alguno de loa módulos son específicos a la plataforma. En ese caso podría, incluso, no ser posible importar todos los módulos en la parte superior del fichero. Para esos casos, la importación correcta de los módulos en el código correspondiente específico de la plataforma es una buena opción.

source: Only move imports into a local scope, such as inside a function definition, if it's necessary to solve a problem such as avoiding a circular import or are trying to reduce the initialization time of a module. This technique is especially helpful if many of the imports are unnecessary depending on how the program executes. You may also want to move imports into a function if the modules are only ever used in that function. Note that loading a module the first time may be expensive because of the one time initialization of the module, but loading a module multiple times is virtually free, costing only a couple of dictionary lookups. Even if the module name has gone out of scope, the module is probably available in :data:`sys.modules`.
es: Solo debes mover importaciones a un ámbito de aplicación local, como dentro de la definición de una función, si es necesario resolver problemas como una importación circular o al intentar reducir el tiempo de inicialización de un módulo. Esta técnica es especialmente útil si muchas de las importaciones no son necesarias dependiendo de cómo se ejecute el programa. También podrías mover importaciones a una función si los módulos solo se usan dentro de esa función. Nótese que la primera carga de un módulo puede ser costosa debido al tiempo necesario para la inicialización del módulo,pero la carga de un módulo múltiples veces está prácticamente libre de coste ya que solo es necesario hacer búsquedas en un diccionario. Incluso si el nombre del módulo ha salido del ámbito de aplicación el módulo se encuentre, probablemente, en :data:`sys.modules`.

source: Why are default values shared between objects?
es: ¿Por qué los valores por defecto se comparten entre objetos?

source: This type of bug commonly bites neophyte programmers. Consider this function::
es: Este tipo de error golpea a menudo a programadores novatos. Considera esta función::

source: The first time you call this function, ``mydict`` contains a single item. The second time, ``mydict`` contains two items because when ``foo()`` begins executing, ``mydict`` starts out with an item already in it.
es: La primera vez que llamas a esta función, ``mydict`` solamente contiene un único elemento. La segunda vez, ``mydict`` contiene dos elementos debido a que cuando comienza la ejecución de ``foo()``, ``mydict`` comienza conteniendo un elemento de partida.

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
es: A menudo se esperaría que una invocación a una función cree nuevos objetos para valores por defecto. Eso no es lo que realmente sucede. Los valores por defecto se crean exactamente una sola vez, cuando se define la función. Se se cambia el objeto, como el diccionario en este ejemplo, posteriores invocaciones a la función estarán referidas al objeto cambiado.

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
es: Por definición, los objetos inmutables como números, cadenas, tuplas y ``None`` están asegurados frente al cambio. Cambios en objetos mutables como diccionarios, listas e instancias de clase pueden llevar a confusión.

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
es: Debido a esta característica es una buena práctica de programación el no usar valores mutables como valores por defecto. En su lugar usa ``None`` como valor por defecto dentro de la función, comprueba si el parámetro es ``None`` y crea una nueva lista/un nuevo diccionario/cualquier otras cosa que necesites. Por ejemplo, no escribas::

source: but::
es: pero::

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
es: Esta característica puede ser útil. Cuando tienes una función que es muy costosa de ejecutar, una técnica común es *cachear* sus parámetros y el valor resultante de cada invocación a la función y retornar el valor *cacheado* si se solicita nuevamente el mismo valor. A esto se le llama "memoizing" y se puede implementar de la siguiente forma::

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
es: Podrías usar una variable global conteniendo un diccionario en lugar de un valor por defecto; es una cuestión de gustos.

source: How can I pass optional or keyword parameters from one function to another?
es: ¿Cómo puedo pasar parámetros por palabra clave u opcionales de una función a otra?
