Repository: python/python-docs-es
Catalog: faq/programming.po
Languages: es

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
es: Las características del rendimiento varían entre las distintas implementaciones de Python. Estas preguntas frecuentes se enfocan en :term:`CPython`.

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
es: El comportamiento puede variar entre distintos sistemas operativos, especialmente cuando se habla de tareas I/O o multi-tarea.

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
es: Siempre deberías encontrar las partes importantes en tu programa *antes* de intentar optimizar el código (ver el módulo :mod:`profile`).

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
es: Escribir programas de comparación del rendimiento te permitirá iterar rápidamente cuando te encuentres buscando mejoras (ver el módulo :mod:`timeit`).

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
es: Es altamente recomendable disponer de una buena cobertura de código (a partir de pruebas unitarias o cualquier otra técnica) antes de introducir potenciales regresiones ocultas en sofisticadas optimizaciones.

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
es: Dicho lo anterior, existen muchos trucos para acelerar código Python. Aquí tienes algunos principios generales que te permitirán llegar a alcanzar niveles de rendimiento aceptables:

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
es: El hacer más rápido tu algoritmo (o cambiarlo por alguno más rápido) puede provocar mayores beneficios que intentar unos pocos trucos de micro-optimización a través de todo tu código.

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
es: Utiliza las estructuras de datos correctas. Estudia la documentación para los :ref:`bltin-types` y el módulo :mod:`collections`.

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
es: Cuando la biblioteca estándar proporciona una primitiva de hacer algo, esta supuestamente será (aunque no se garantiza) más rápida que cualquier otra alternativa que se te ocurra. Esto es doblemente cierto si las primitivas han sido escritas en C, como los *builtins* y algunos tipos extendidos. Por ejemplo, asegúrate de usar el método integrado :meth:`list.sort` o la función relacionada :func:`sorted` para ordenar (y ver :ref:`sortinghowto` para ver ejemplos de uso moderadamente avanzados).

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
es: Las abstracciones tienden a crear rodeos y fuerzan al intérprete a trabajar más. Si el nivel de rodeos sobrepasa el trabajo útil realizado tu programa podría ser más lento. Deberías evitar abstracciones excesivas, especialmente, en forma de pequeñas funciones o métodos (que también va en detrimento de la legibilidad).

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
es: La página de la wiki dedicada a `trucos de rendimiento <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.

source: What is the most efficient way to concatenate many strings together?
es: ¿Cuál es la forma más eficiente de concatenar muchas cadenas conjuntamente?

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
es: Los objetos :class:`str` y :class:`bytes` son inmutables, por tanto, concatenar muchas cadenas en una sola es ineficiente debido a que cada concatenación crea un nuevo objeto. En el caso más general, el coste total en tiempo de ejecución es cuadrático en relación a la longitud de la cadena final.

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
es: Para acumular muchos objetos :class:`str`, la forma recomendada sería colocarlos en una lista y llamar al método :meth:`str.join` al final::

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
es: (otra forma que sería razonable en términos de eficiencia sería usar :class:`io.StringIO`)

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
es: Para acumular muchos objetos :class:`bytes`, la forma recomendada sería extender un objeto :class:`bytearray` usando el operador de concatenación in situ (el operador ``+=``)::

source: Sequences (Tuples/Lists)
es: Secuencias (Tuplas/Listas)

source: How do I convert between tuples and lists?
es: ¿Cómo convertir entre tuplas y listas?

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
es: El constructor ``tuple(seq)`` convierte cualquier secuencia (en realidad, cualquier iterable) en una tupla con los mismos elementos y en el mismo orden.

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
es: Por ejemplo, ``tuple([1, 2, 3])`` lo convierte en ``(1, 2, 3)`` y ``tuple('abc')`` lo convierte en ``('a', 'b', 'c')``. Si el argumento es una tupla no creará una nueva copia y retornará el mismo objeto, por tanto, llamar a :func:`tuple` no tendrá mucho coste si no estás seguro si un objeto ya es una tupla.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
es: El constructor ``list(seq)`` convierte cualquier secuencia o iterable en una lista con los mismos elementos y en el mismo orden. Por ejemplo, ``list((1, 2, 3))`` lo convierte a ``[1, 2, 3]`` y ``list('abc')`` lo convierte a ``['a', 'b', 'c']``. Si el argumento es una lista, hará una copia como lo haría ``seq[:]``.

source: What's a negative index?
es: ¿Qué es un índice negativo?

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
es: Las secuencias en Python están indexadas con números positivos y negativos. Para los números positivos el 0 será el primer índice, el 1 el segundo y así en adelante. Para los índices negativos el -1 el último índice, el -2 el penúltimo, etc. Piensa en ``seq[-n]`` como si fuera ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
es: El uso de índices negativos puede ser muy conveniente. Por ejemplo ``S[:-1]`` se usa para todo la cadena excepto para su último carácter, lo cual es útil para eliminar el salto de línea final de una cadena.

source: How do I iterate over a sequence in reverse order?
es: ¿Cómo puedo iterar sobre una secuencia en orden inverso?

source: Use the :func:`reversed` built-in function::
es: Usa la función incorporada :func:`reversed`::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
es: Esto no transformará la secuencia original sino que creará una nueva copia en orden inverso por la que se puede iterar.

source: How do you remove duplicates from a list?
es: ¿Cómo eliminar duplicados de una lista?

source: See the Python Cookbook for a long discussion of many ways to do this:
es: Puedes echar un vistazo al recetario de Python para ver una gran discusión mostrando muchas formas de hacer esto:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
es: Si no te preocupa que la lista se reordene la puedes ordenar y, después, y después escanearla desde el final borrando duplicados a medida que avanzas::

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
es: Si todos los elementos de la lista pueden ser usados como claves (por ejemplo son todos :term:`hashable`) esto será, en general, más rápido ::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
es: Esto convierte la lista en un conjunto eliminando, por tanto, los duplicados y, posteriormente, puedes volver a una lista.

source: How do you remove multiple items from a list
es: Cómo eliminar duplicados de una lista

source: As with removing duplicates, explicitly iterating in reverse with a delete condition is one possibility. However, it is easier and faster to use slice replacement with an implicit or explicit forward iteration. Here are three variations.::
es: Al igual que con la eliminación de duplicados, una posibilidad es iterar explícitamente a la inversa con una condición de eliminación. Sin embargo, es más fácil y rápido utilizar el reemplazo de sectores con una iteración directa implícita o explícita. Aquí hay tres variaciones.::

source: The list comprehension may be fastest.
es: Esta comprensión de lista puede ser la más rápida.

source: How do you make an array in Python?
es: ¿Cómo se puede hacer un array en Python?

source: Use a list::
es: Usa una lista::

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
es: Las listas son equivalentes en complejidad temporal a arrays en C o Pascal; La principal diferencia es que una lista en Python puede contener objetos de diferentes tipos.

source: How do I create a multidimensional list?
es: ¿Cómo puedo crear una lista multidimensional?

source: You probably tried to make a multidimensional array like this::
es: Seguramente hayas intentado crear un array multidimensional de la siguiente forma::

source: This looks correct if you print it:
es: Esto parece correcto si lo muestras en pantalla:

source: But when you assign a value, it shows up in multiple places:
es: Pero cuando asignas un valor, se muestra en múltiples sitios:

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
es: La razón es que replicar una lista con ``*`` no crea copias, solo crea referencias a los objetos existentes. El ``*3`` crea una lista conteniendo 3 referencias a la misma lista de longitud dos. Cambios a una fila se mostrarán en todas las filas, lo cual, seguramente, no es lo que deseas.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
es: El enfoque recomendado sería crear, primero, una lista de la longitud deseada y, después, rellenar cada elemento con una lista creada en ese momento::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
es: Esto genera una lista conteniendo 3 listas distintas de longitud dos. También puedes usar una comprensión de lista::

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
es: ¿Por qué hacer lo siguiente, ``a_tuple[i] += ['item']``, lanza una excepción cuando la suma funciona?

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
es: Esto es debido a la combinación del hecho de que un operador de asignación aumentada es un operador de *asignación* y a la diferencia entre objetos mutables e inmutable en Python.

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
es: Esta discusión aplica, en general, cuando los operadores de asignación aumentada se aplican a elementos de una tupla que apuntan a objetos mutables. Pero vamos a usar una ``lista`` y ``+=`` para el ejemplo.

source: If you wrote::
es: Si escribes::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
es: La razón por la que se produce la excepción debería ser evidente: ``1`` se añade al objeto ``a_tuple[0]`` que apunta a (``1``), creando el objeto resultante, ``2``, pero cuando intentamos asignar el resultado del cálculo, ``2``, al elemento ``0`` de la tupla, obtenemos un error debido a que no podemos cambiar el elemento al que apunta la tupla.

source: Under the covers, what this augmented assignment statement is doing is approximately this::
es: En realidad, lo que esta declaración de asignación aumentada está haciendo es, aproximadamente, lo siguiente::

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
es: Es la parte de asignación de la operación la que provoca el error, debido a que una tupla es inmutable.

source: When you write something like::
es: Cuando escribes algo como lo siguiente::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
es: La excepción es un poco más sorprendente e, incluso, más sorprendente es el hecho que aunque hubo un error, la agregación funcionó::

source: This is equivalent to::
es: Esto es equivalente a ::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
es: El objeto al que apunta a_list ha mutado y el puntero al objeto mutado es asignado de vuelta a ``a_list``. El resultado final de la asignación no es opción debido a que es un puntero al mismo objeto al que estaba apuntando ``a_list`` pero la asignación sí que ocurre.

source: Thus, in our tuple example what is happening is equivalent to::
es: Por tanto, en nuestro ejemplo con tupla lo que está pasando es equivalente a::

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
es: Quiero hacer una ordenación compleja: ¿Puedes hacer una transformada Schwartziana (Schwartzian Transform) en Python?

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
es: La técnica, atribuida a Randal Schwartz, miembro de la comunidad Perl, ordena los elementos de una lista mediante una métrica que mapea cada elemento a su "valor orden". En Python, usa el argumento ``key`` par el método :meth:`list.sort`::

source: How can I sort one list by values from another list?
es: ¿Cómo puedo ordenar una lista a partir de valores de otra lista?

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
es: Las puedes unir en un iterador de tuplas, ordena la lista resultando y después extrae el elemento que deseas. ::

source: Objects
es: Objetos

source: What is a class?
es: ¿Qué es una clase?

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
es: Una clase es un tipo de objeto particular creado mediante la ejecución de la declaración class. Los objetos class se usan como plantillas para crear instancias de objetos que son tanto los datos (atributos) como el código (métodos) específicos para un tipo de dato.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
es: Una clase puede estar basada en una o más clases diferentes, llamadas su(s) clase(s). Hereda los atributos y métodos de sus clases base. Esto permite que se pueda refinar un objeto modelo de forma sucesiva mediante herencia. Puedes tener una clase genérica ``Mailbox`` que proporciona métodos de acceso básico para un buzón de correo y subclases como ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` que gestionan distintos formatos específicos de buzón de correos.

source: What is a method?
es: ¿Qué es un método?

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
es: Un método es una función de un objeto ``x`` que puedes llamar, normalmente, de la forma ``x.name(arguments...)``. Los métodos se definen como funciones dentro de la definición de la clase::

source: What is self?
es: ¿Qué es self?

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
es: Self es, básicamente, un nombre que se usa de forma convencional como primer argumento de un método. Un método definido como ``meth(self, a, b, c)`` se le llama como ``x.meth(a, b, c)`` para una instancia ``x`` de la clase es que se definió; el método invocado pensará que se le ha invocado como ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
es: Ver también :ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
es: ¿Cómo puedo comprobar si un objeto es una instancia de una clase dada o de una subclase de la misma?

source: Note that :func:`isinstance` also checks for virtual inheritance from an :term:`abstract base class`. So, the test will return ``True`` for a registered class even if hasn't directly or indirectly inherited from it. To test for "true inheritance", scan the :term:`MRO` of the class:
es: Note que :func:`isinstance` también verifica la herencia virtual de una :term:`abstract base class`. Entonces, la prueba retorna `True` para una clase registrada incluso si no ha heredado directa o indirectamente de ella. Para verificar "herencia verdadera", escanea el :term:`MRO` de la clase:

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
es: Destacar que muchos programas no necesitan usar :func:`isinstance` de forma frecuente en clases definidas por el usuario. Si estás desarrollando clases un mejor estilo orientado a objetos sería el de definir los métodos en las clases que encapsulan un comportamiento en particular en lugar de ir comprobando la clase del objeto e ir haciendo cosas en base a la clase que es. Por ejemplo, si tienes una función que hace lo siguiente::

source: A better approach is to define a ``search()`` method on all the classes and just call it::
es: Un enfoque más adecuado sería definir un método ``search()`` en todas las clases e invocarlo::

source: What is delegation?
es: ¿Qué es la delegación?

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
es: La delegación es una técnica orientada a objetos (también llamado un patrón de diseño). Digamos que tienes un objeto ``x`` y deseas cambiar el comportamiento de solo uno de sus métodos. Puedes crear una nueva clase que proporciona una nueva implementación del método que te interesa cambiar y delega el resto de métodos al método correspondiente de ``x``.

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
es: Los programadores Python pueden implementar la delegación de forma muy sencilla. Por ejemplo, la siguiente clase implementa una clase que se comporta como un fichero pero convierte todos los datos escritos a mayúsculas::

source: How do I call a method defined in a base class from a derived class that extends it?
es: ¿Cómo invoco a un método definido en una clase base desde una clase derivada que la extiende?

source: Use the built-in :func:`super` function::
es: Usa la función incorporada :func:`super`::

source: In the example, :func:`super` will automatically determine the instance from which it was called (the ``self`` value), look up the :term:`method resolution order` (MRO) with ``type(self).__mro__``, and return the next in line after ``Derived`` in the MRO: ``Base``.
es: En el ejemplo, :func:`super` automáticamente determinará la instancia desde la cual ha sido llamada (el valor ``self```), busca el :term:`method resolution order` (MRO) con ``type(self).__mro__``, y devuelve el siguiente en línea después de ``Derived`` en el MRO: ``Base``.
