Repository: python/python-docs-es
Catalog: faq/windows.po
Languages: es_ar

source: Python on Windows FAQ
es_ar: Preguntas frecuentes sobre Python en Windows

source: Contents
es_ar: Contenidos

source: How do I run a Python program under Windows?
es_ar: ¿Cómo ejecutar un programa Python en Windows?

source: This is not necessarily a straightforward question. If you are already familiar with running programs from the Windows command line then everything will seem obvious; otherwise, you might need a little more guidance.
es_ar: No es necesariamente una pregunta simple. Si ya está familiarizado con el lanzamiento de programas desde la línea de comandos de Windows, todo parecerá obvio; de lo contrario, es posible que necesite un poco más de orientación.

source: Unless you use some sort of integrated development environment, you will end up *typing* Windows commands into what is referred to as a "Command prompt window". Usually you can create such a window from your search bar by searching for ``cmd``. You should be able to recognize when you have started such a window because you will see a Windows "command prompt", which usually looks like this:
es_ar: A menos que esté utilizando algún tipo de entorno de desarrollo, terminará escribiendo comandos de Windows en lo que se denomina "DOS" o "símbolo del sistema de Windows". En general, puede abrir dicha ventana desde su barra de búsqueda buscando *cmd*. Debería poder reconocer cuándo inició dicha ventana porque verá un símbolo del sistema de Windows, que en general se ve así:

source: The letter may be different, and there might be other things after it, so you might just as easily see something like:
es_ar: La letra puede ser diferente y puede haber otras cosas seguidas, por lo que también puede verse así:

source: depending on how your computer has been set up and what else you have recently done with it. Once you have started such a window, you are well on the way to running Python programs.
es_ar: dependiendo de la configuración de su computadora y de lo que haya hecho recientemente con ella. Una vez que haya abierto esta ventana, está en camino de iniciar los programas de Python.

source: You need to realize that your Python scripts have to be processed by another program called the Python *interpreter*. The interpreter reads your script, compiles it into bytecodes, and then executes the bytecodes to run your program. So, how do you arrange for the interpreter to handle your Python?
es_ar: Tenga en cuenta que sus scripts de Python deben ser procesados por otro programa llamado "intérprete" de Python. El intérprete lee su script, lo compila en *bytecode* y ejecuta el *bytecode* para ejecutar su programa. Entonces, ¿cómo le das tu código Python al intérprete?

source: First, you need to make sure that your command window recognises the word "py" as an instruction to start the interpreter. If you have opened a command window, you should try entering the command ``py`` and hitting return:
es_ar: Primero, debe asegurarse de que la ventana del símbolo del sistema reconoce la palabra "python" como una instrucción para iniciar el intérprete. Si abrió un símbolo del sistema, escriba el comando ``py`` y luego presione la tecla Enter:

source: You should then see something like:
es_ar: Debería ver algo como esto:

source: You have started the interpreter in "interactive mode". That means you can enter Python statements or expressions interactively and have them executed or evaluated while you wait. This is one of Python's strongest features. Check it by entering a few expressions of your choice and seeing the results:
es_ar: Has comenzado el intérprete en su "modo interactivo". Esto significa que puede ingresar declaraciones o expresiones de Python de forma interactiva para ejecutarlas. Esta es una de las características más poderosas de Python. Puede verificar esto ingresando algunos comandos de su elección y ver los resultado:

source: Many people use the interactive mode as a convenient yet highly programmable calculator. When you want to end your interactive Python session, call the :func:`exit` function or hold the :kbd:`Ctrl` key down while you enter a :kbd:`Z`, then hit the ":kbd:`Enter`" key to get back to your Windows command prompt.
es_ar: Muchas personas usan el modo interactivo como una calculadora práctica pero altamente programable. Cuando desee finalizar su sesión interactiva de Python, llame a la función :func:`exit` o mantenga presionada la tecla :kbd:`Ctrl` mientras ingresa una :kbd:`Z`, luego presione la tecla ":kbd:`Enter`" para regresar a su símbolo del sistema de Windows.

source: You may also find that you have a Start-menu entry such as :menuselection:`Start --> Programs --> Python 3.x --> Python (command line)` that results in you seeing the ``>>>`` prompt in a new window. If so, the window will disappear after you call the :func:`exit` function or enter the :kbd:`Ctrl-Z` character; Windows is running a single "python" command in the window, and closes it when you terminate the interpreter.
es_ar: Es posible que haya notado una nueva entrada en su menú Inicio, como :menuselection:`Inicio --> Programas --> Python 3.x --> Python (línea de comando)` que hace que vea el mensaje ``>>>`` en una nueva ventana. Si es así, la ventana desaparecerá cuando llame a la función :func:`exit` o presione la combinación :kbd:`Ctrl-Z`; Windows ejecuta un comando "python" en la ventana y lo cierra cuando cierra el intérprete.

source: Now that we know the ``py`` command is recognized, you can give your Python script to it. You'll have to give either an absolute or a relative path to the Python script. Let's say your Python script is located in your desktop and is named ``hello.py``, and your command prompt is nicely opened in your home directory so you're seeing something similar to::
es_ar: Ahora que sabemos que se reconoce el comando ``py``, puede darle su script Python. Debe proporcionar la ruta absoluta o relativa de la secuencia de comandos de Python. Digamos que su script Python se encuentra en su escritorio y se llama ``hello.py``, y su símbolo del sistema está abierto en su directorio de inicio, por lo que verá algo como::

source: So now you'll ask the ``py`` command to give your script to Python by typing ``py`` followed by your script path::
es_ar: Entonces, le pedirá al comando ``py`` que le dé su script a Python escribiendo ``py`` seguido de la ruta de su script::

source: How do I make Python scripts executable?
es_ar: ¿Cómo hacer que los scripts de Python sean ejecutables?

source: On Windows, the standard Python installer already associates the .py extension with a file type (Python.File) and gives that file type an open command that runs the interpreter (``D:\Program Files\Python\python.exe "%1" %*``). This is enough to make scripts executable from the command prompt as 'foo.py'. If you'd rather be able to execute the script by simple typing 'foo' with no extension you need to add .py to the PATHEXT environment variable.
es_ar: En Windows, el instalador de Python asocia la extensión *.py* con un tipo de archivo *(Python.File)* y un comando que inicia el intérprete (``D:\Archivos de programa\Python\python.exe "%1" %*``) . Esto es suficiente para poder ejecutar scripts de Python desde la línea de comandos ingresando 'foo.py'. Si desea poder ejecutar los scripts simplemente escribiendo 'foo' sin la extensión, debe agregar .py a la variable del entorno PATHEXT.

source: Why does Python sometimes take so long to start?
es_ar: ¿Por qué Python tarda en comenzar?

source: Usually Python starts very quickly on Windows, but occasionally there are bug reports that Python suddenly begins to take a long time to start up. This is made even more puzzling because Python will work fine on other Windows systems which appear to be configured identically.
es_ar: Normalmente en Windows, Python se inicia muy rápidamente, pero a veces los informes de error indican que Python de repente comienza a tardar mucho tiempo en iniciarse. Es aún más desconcertante porque Python funcionará correctamente con otros Windows configurados de manera idéntica.

source: The problem may be caused by a misconfiguration of virus checking software on the problem machine. Some virus scanners have been known to introduce startup overhead of two orders of magnitude when the scanner is configured to monitor all reads from the filesystem. Try checking the configuration of virus scanning software on your systems to ensure that they are indeed configured identically. McAfee, when configured to scan all file system read activity, is a particular offender.
es_ar: El problema puede provenir de un antivirus mal configurado. Se sabe que algunos antivirus duplican el tiempo de arranque cuando se configuran para verificar todas las lecturas del sistema de archivos. Intente verificar si los antivirus de las dos máquinas están configurados correctamente de manera idéntica. *McAfee* es especialmente problemático cuando se configura para verificar todas las lecturas del sistema de archivos.

source: How do I make an executable from a Python script?
es_ar: ¿Cómo hacer un ejecutable a partir de un script de Python?

source: See :ref:`faq-create-standalone-binary` for a list of tools that can be used to make executables.
es_ar: Vea :ref:`faq-create-standalone-binary` para una lista de herramientas que pueden ser usadas para crear ejecutables.

source: Is a ``*.pyd`` file the same as a DLL?
es_ar: ¿Es un archivo ``*.pyd`` lo mismo que una DLL?

source: Yes, .pyd files are dll's, but there are a few differences. If you have a DLL named ``foo.pyd``, then it must have a function ``PyInit_foo()``. You can then write Python "import foo", and Python will search for foo.pyd (as well as foo.py, foo.pyc) and if it finds it, will attempt to call ``PyInit_foo()`` to initialize it. You do not link your .exe with foo.lib, as that would cause Windows to require the DLL to be present.
es_ar: Sí, los archivos *.pyd* son archivos dll, pero hay algunas diferencias. Si tiene una DLL llamada ``foo.pyd``, debe tener una función ``PyInit_foo()``. Luego puede escribir en Python "import foo" y Python buscará el archivo *foo.pyd* (así como *foo.py* y *foo.pyc*); si lo encuentra, intentará llamar a ``PyInit_foo()`` para inicializarlo. No vincules tu .exe con *foo.lib* porque en este caso Windows necesitará la DLL.

source: Note that the search path for foo.pyd is PYTHONPATH, not the same as the path that Windows uses to search for foo.dll. Also, foo.pyd need not be present to run your program, whereas if you linked your program with a dll, the dll is required. Of course, foo.pyd is required if you want to say ``import foo``. In a DLL, linkage is declared in the source code with ``__declspec(dllexport)``. In a .pyd, linkage is defined in a list of available functions.
es_ar: Tenga en cuenta que la ruta de búsqueda para *foo.pyd* es PYTHONPATH, es diferente de la que usa Windows para buscar *foo.dll*. Además, *foo.pyd* no necesita estar presente para que su programa se ejecute, mientras que si ha vinculado su programa con una dll, esto es necesario. Por supuesto, *foo.pyd* es necesario si escribes ``import foo``. En una DLL, el enlace se declara en el código fuente con ``__declspec(dllexport)``. En un *.pyd*, la conexión se define en una lista de funciones disponibles.

source: How can I embed Python into a Windows application?
es_ar: ¿Cómo puedo integrar Python en una aplicación de Windows?

source: Embedding the Python interpreter in a Windows app can be summarized as follows:
es_ar: La integración del intérprete de Python en una aplicación de Windows se puede resumir de la siguiente manera:

source: You can link to Python in two different ways. Load-time linking means linking against :file:`python{NN}.lib`, while run-time linking means linking against :file:`python{NN}.dll`. (General note: :file:`python{NN}.lib` is the so-called "import lib" corresponding to :file:`python{NN}.dll`. It merely defines symbols for the linker.)
es_ar: Puede vincular a Python de dos maneras diferentes. Un enlace en tiempo de carga significa apuntar al archivo :file:`python{NN}.lib`, mientras que un enlace en tiempo de ejecución significa apuntar al archivo :file:`python{NN}.dll`. (Nota general: el archivo :file:`python{NN}.lib` es la llamada "lib de importación" correspondiente para el archivo :file:`python{NN}.dll`. Simplemente define enlaces simbólicos para el enlazador).

source: Run-time linking greatly simplifies link options; everything happens at run time. Your code must load :file:`python{NN}.dll` using the Windows ``LoadLibraryEx()`` routine. The code must also use access routines and data in :file:`python{NN}.dll` (that is, Python's C API's) using pointers obtained by the Windows ``GetProcAddress()`` routine. Macros can make using these pointers transparent to any C code that calls routines in Python's C API.
es_ar: El enlace en tiempo real simplifica enormemente las opciones de enlace; Todo sucede en el momento de la ejecución. Su código debe cargar el archivo :file:`python{NN}.dll` utilizando la rutina de Windows ``LoadLibraryEx()``. El código también debe usar rutinas de acceso y datos en el archivo :file:`python{NN}.dll` (es decir, las API C de Python) usando punteros obtenidos por la rutina de Windows ``GetProcAddress()``. Las macros pueden hacer que el uso de estos punteros sea transparente para cualquier código C que llame a rutinas en la API C de Python.

source: SWIG will create an init function (a C function) whose name depends on the name of the extension module. For example, if the name of the module is leo, the init function will be called initleo(). If you use SWIG shadow classes, as you should, the init function will be called initleoc(). This initializes a mostly hidden helper class used by the shadow class.
es_ar: *SWIG* creará una función de inicialización (función en C) cuyo nombre depende del nombre del complemento. Por ejemplo, si el nombre del módulo es leo, la función *init* se llamará *initleo()*. Si está utilizando clases *shadow SWIG*, como debería, la función *init* se llamará *initleoc()*. Esto inicializa una clase auxiliar invisible utilizada por la clase *shadow*.

source: The reason you can link the C code in step 2 into your .exe file is that calling the initialization function is equivalent to importing the module into Python! (This is the second key undocumented fact.)
es_ar: ¡La razón por la que puede vincular el código C en el paso 2 en su archivo .exe es que llamar a la función de inicialización es equivalente a importar el módulo a Python! (Este es el segundo hecho clave indocumentado).

source: In short, you can use the following code to initialize the Python interpreter with your extension module.
es_ar: En resumen, puede usar el siguiente código para inicializar el intérprete de Python con su complemento.

source: There are two problems with Python's C API which will become apparent if you use a compiler other than MSVC, the compiler used to build pythonNN.dll.
es_ar: Hay dos problemas con la API de Python C que aparecerán si utiliza un compilador que no sea *MSVC*, el compilador utilizado para construir *pythonNN.dll*.

source: Problem 2: SWIG generates the following code when generating wrappers to void functions:
es_ar: Problema 2: *SWIG* genera el siguiente código al generar contenedores para cancelar las funciones:

source: Alas, Py_None is a macro that expands to a reference to a complex data structure called _Py_NoneStruct inside pythonNN.dll. Again, this code will fail in a mult-compiler environment. Replace such code by:
es_ar: Por desgracia, *Py_None* es una macro que se desarrolla con referencia a una estructura de datos compleja llamada *_Py_NoneStruct* dentro de *pythonNN.dll*. Nuevamente, este código fallará en un entorno de múltiples compiladores. Reemplace este código con:

source: It may be possible to use SWIG's ``%typemap`` command to make the change automatically, though I have not been able to get this to work (I'm a complete SWIG newbie).
es_ar: Es posible utilizar el comando *SWIG* ``%typemap`` para realizar el cambio automáticamente, aunque no he logrado que funcione (soy un principiante con *SWIG*).

source: Using a Python shell script to put up a Python interpreter window from inside your Windows app is not a good idea; the resulting window will be independent of your app's windowing system. Rather, you (or the wxPythonWindow class) should create a "native" interpreter window. It is easy to connect that window to the Python interpreter. You can redirect Python's i/o to _any_ object that supports read and write, so all you need is a Python object (defined in your extension module) that contains read() and write() methods.
es_ar: Usar una secuencia de comandos de shell Python para crear una ventana de intérprete de Python desde su aplicación de Windows no es una buena idea; la ventana resultante será independiente del sistema de ventanas de su aplicación. Usted (o la clase *wxPythonWindow*) debería crear una ventana de intérprete "nativa". Es fácil conectar esta ventana al intérprete de Python. Puede redirigir la entrada/salida de Python a cualquier objeto que admita lectura y escritura, por lo que todo lo que necesita es un objeto de Python (definido en su complemento) que contenga los métodos de *read()* y *write()*.

source: How do I keep editors from inserting tabs into my Python source?
es_ar: ¿Cómo puedo evitar que mi editor inserte pestañas en mi archivo fuente de Python?

source: The FAQ does not recommend using tabs, and the Python style guide, :pep:`8`, recommends 4 spaces for distributed Python code; this is also the Emacs python-mode default.
es_ar: Las preguntas frecuentes no recomiendan el uso de pestañas y la guía de estilo de Python, :pep:`8`, recomienda el uso de 4 espacios para distribuir el código de Python. Este es también el modo predeterminado de Emacs con Python.

source: Under any editor, mixing tabs and spaces is a bad idea. MSVC is no different in this respect, and is easily configured to use spaces: Take :menuselection:`Tools --> Options --> Tabs`, and for file type "Default" set "Tab size" and "Indent size" to 4, and select the "Insert spaces" radio button.
es_ar: Sea cual sea su editor, mezclar pestañas y espacios es una mala idea. *MSVC* no es diferente en este aspecto, y se puede configurar fácilmente para usar espacios: vaya a :menuselection:`Tools --> Options --> Tabs`, y para el tipo de archivo "Default", debe establecer "Tab size" and "Indent size" en 4, luego seleccione Insertar espacios.

source: Python raises :exc:`IndentationError` or :exc:`TabError` if mixed tabs and spaces are causing problems in leading whitespace. You may also run the :mod:`tabnanny` module to check a directory tree in batch mode.
es_ar: Python lanzará los errores :exc:`IndentationError` o :exc:`TabError` si una combinación de tabulación y sangría es problemática al comienzo de la línea. También puede usar el módulo :mod:`tabnanny` para detectar estos errores.

source: How do I check for a keypress without blocking?
es_ar: ¿Cómo verifico una pulsación de tecla sin bloquearla?

source: Use the :mod:`msvcrt` module. This is a standard Windows-specific extension module. It defines a function ``kbhit()`` which checks whether a keyboard hit is present, and ``getch()`` which gets one character without echoing it.
es_ar: Use el módulo :mod:`msvcrt`. Es una extensión estándar específica de Windows, que define una función ``kbhit()`` que verifica si se ha presionado una tecla, y ``getch()`` que recupera el carácter sin mostrarlo.

source: How do I solve the missing api-ms-win-crt-runtime-l1-1-0.dll error?
es_ar: ¿Cómo resuelvo el error de api-ms-win-crt-runtime-l1-1-0.dll no encontrado?

source: This can occur on Python 3.5 and later when using Windows 8.1 or earlier without all updates having been installed. First ensure your operating system is supported and is up to date, and if that does not resolve the issue, visit the `Microsoft support page <https://support.microsoft.com/en-us/help/3118401/>`_ for guidance on manually installing the C Runtime update.
es_ar: Esto puede ocurrir en Python 3.5 y posteriores usando Windows 8.1 o anteriores sin que todas las actualizaciones hayan sido instaladas. Primero asegúrese que su sistema operativo sea compatible y esté actualizado, y si eso no resuelve el problema, visite la `Página de soporte de Microsoft <https://support.microsoft.com/en-us/help/3118401/>`_ para obtener orientación sobre como instalar manualmente la actualización de C Runtime.
