Repository: python/python-docs-es
Catalog: whatsnew/2.0.po
Languages: es

source: :mod:`atexit`: For registering functions to be called before the Python interpreter exits. Code that currently sets ``sys.exitfunc`` directly should be changed to use the :mod:`atexit` module instead, importing :mod:`atexit` and calling :func:`atexit.register` with the function to be called on exit. (Contributed by Skip Montanaro.)
es: :mod:`atexit`: Para registrar las funciones que serán llamadas antes de que el intérprete de Python salga. El código que actualmente establece ``sys.exitfunc`` directamente debe cambiarse para usar el módulo :mod:`atexit` en su lugar, importando :mod:`atexit` y llamando a :func:`atexit.register` con la función a llamar al salir. (Contribución de Skip Montanaro)

source: :mod:`codecs`, :mod:`encodings`, :mod:`unicodedata`: Added as part of the new Unicode support.
es: :mod:`codecs`, :mod:`encodings`, :mod:`unicodedata`: Añadidos como parte del nuevo soporte de Unicode.

source: :mod:`filecmp`: Supersedes the old :mod:`cmp`, :mod:`cmpcache` and :mod:`dircmp` modules, which have now become deprecated. (Contributed by Gordon MacMillan and Moshe Zadka.)
es: :mod:`filecmp`: Sustituye a los antiguos módulos :mod:`cmp`, :mod:`cmpcache` y :mod:`dircmp`, que han quedado obsoletos. (Contribución de Gordon MacMillan y Moshe Zadka)

source: :mod:`gettext`: This module provides internationalization (I18N) and localization (L10N) support for Python programs by providing an interface to the GNU gettext message catalog library. (Integrated by Barry Warsaw, from separate contributions by Martin von Löwis, Peter Funk, and James Henstridge.)
es: :mod:`gettext`: Este módulo proporciona soporte de internacionalización (I18N) y localización (L10N) para los programas de Python, proporcionando una interfaz a la biblioteca de catálogo de mensajes GNU gettext. (Integrado por Barry Warsaw, a partir de contribuciones separadas de Martin von Löwis, Peter Funk y James Henstridge)

source: :mod:`linuxaudiodev`: Support for the :file:`/dev/audio` device on Linux, a twin to the existing :mod:`sunaudiodev` module. (Contributed by Peter Bosch, with fixes by Jeremy Hylton.)
es: :mod:`linuxaudiodev`: Soporte para el dispositivo :file:`/dev/audio` en Linux, un gemelo del módulo existente :mod:`sunaudiodev`. (Contribuido por Peter Bosch, con correcciones de Jeremy Hylton)

source: :mod:`mmap`: An interface to memory-mapped files on both Windows and Unix. A file's contents can be mapped directly into memory, at which point it behaves like a mutable string, so its contents can be read and modified. They can even be passed to functions that expect ordinary strings, such as the :mod:`re` module. (Contributed by Sam Rushing, with some extensions by A.M. Kuchling.)
es: :mod:`mmap`: Una interfaz para archivos mapeados en memoria tanto en Windows como en Unix. El contenido de un fichero puede ser mapeado directamente en memoria, en cuyo momento se comporta como una cadena mutable, por lo que su contenido puede ser leído y modificado. Incluso pueden pasarse a funciones que esperan cadenas ordinarias, como el módulo :mod:`re`. (Contribución de Sam Rushing, con algunas extensiones de A.M. Kuchling)

source: :mod:`pyexpat`: An interface to the Expat XML parser. (Contributed by Paul Prescod.)
es: :mod:`pyexpat`: Una interfaz para el analizador XML de Expat. (Contribuido por Paul Prescod.)

source: :mod:`robotparser`: Parse a :file:`robots.txt` file, which is used for writing web spiders that politely avoid certain areas of a web site. The parser accepts the contents of a :file:`robots.txt` file, builds a set of rules from it, and can then answer questions about the fetchability of a given URL. (Contributed by Skip Montanaro.)
es: :mod:`robotparser`: Analiza un archivo :file:`robots.txt`, que se utiliza para escribir arañas web que evitan amablemente ciertas áreas de un sitio web. El analizador acepta el contenido de un archivo :file:`robots.txt`, construye un conjunto de reglas a partir de él y puede responder a preguntas sobre la capacidad de búsqueda de una URL determinada. (Contribución de Skip Montanaro)

source: :mod:`tabnanny`: A module/script to check Python source code for ambiguous indentation. (Contributed by Tim Peters.)
es: :mod:`tabnanny`: Un módulo/script para comprobar el código fuente de Python en busca de sangrías ambiguas. (Contribuido por Tim Peters.)

source: :mod:`UserString`: A base class useful for deriving objects that behave like strings.
es: :mod:`UserString`: Una clase base útil para derivar objetos que se comportan como cadenas.

source: :mod:`webbrowser`: A module that provides a platform independent way to launch a web browser on a specific URL. For each platform, various browsers are tried in a specific order. The user can alter which browser is launched by setting the *BROWSER* environment variable. (Originally inspired by Eric S. Raymond's patch to :mod:`urllib` which added similar functionality, but the final module comes from code originally implemented by Fred Drake as :file:`Tools/idle/BrowserControl.py`, and adapted for the standard library by Fred.)
es: :mod:`webbrowser`: Un módulo que proporciona una forma independiente de la plataforma para lanzar un navegador web en una URL específica. Para cada plataforma, se prueban varios navegadores en un orden específico. El usuario puede modificar el navegador que se lanza estableciendo la variable de entorno *BROWSER*. (Originalmente inspirado por el parche de Eric S. Raymond a :mod:`urllib` que añadía una funcionalidad similar, pero el módulo final proviene de un código originalmente implementado por Fred Drake como :file:`Tools/idle/BrowserControl.py`, y adaptado para la biblioteca estándar por Fred)

source: :mod:`_winreg`: An interface to the Windows registry. :mod:`_winreg` is an adaptation of functions that have been part of PythonWin since 1995, but has now been added to the core distribution, and enhanced to support Unicode. :mod:`_winreg` was written by Bill Tutt and Mark Hammond.
es: :mod:`_winreg`: Una interfaz para el registro de Windows. :mod:`_winreg` es una adaptación de las funciones que han formado parte de PythonWin desde 1995, pero ahora se ha añadido a la distribución principal, y se ha mejorado para soportar Unicode. :mod:`_winreg` fue escrito por Bill Tutt y Mark Hammond.

source: :mod:`zipfile`: A module for reading and writing ZIP-format archives. These are archives produced by :program:`PKZIP` on DOS/Windows or :program:`zip` on Unix, not to be confused with :program:`gzip`\ -format files (which are supported by the :mod:`gzip` module) (Contributed by James C. Ahlstrom.)
es: :mod:`zipfile`: Un módulo para leer y escribir archivos con formato ZIP. Se trata de archivos producidos por :program:`PKZIP` en DOS/Windows o :program:`zip` en Unix, que no deben confundirse con los archivos con formato :program:`gzip` (que son compatibles con el módulo :mod:`gzip`) (Contribución de James C. Ahlstrom.)

source: :mod:`imputil`: A module that provides a simpler way for writing customized import hooks, in comparison to the existing :mod:`ihooks` module. (Implemented by Greg Stein, with much discussion on python-dev along the way.)
es: :mod:`imputil`: Un módulo que proporciona una forma más sencilla de escribir ganchos de importación personalizados, en comparación con el módulo :mod:`ihooks` existente. (Implementado por Greg Stein, con mucha discusión en python-dev a lo largo del camino)

source: IDLE Improvements
es: Mejoras en IDLE

source: IDLE is the official Python cross-platform IDE, written using Tkinter. Python 2.0 includes IDLE 0.6, which adds a number of new features and improvements. A partial list:
es: IDLE es el IDE oficial de Python multiplataforma, escrito con Tkinter. Python 2.0 incluye IDLE 0.6, que añade una serie de nuevas características y mejoras. Una lista parcial:

source: UI improvements and optimizations, especially in the area of syntax highlighting and auto-indentation.
es: Mejoras y optimizaciones de la interfaz de usuario, especialmente en el área de resaltado de sintaxis y auto-indentación.

source: The class browser now shows more information, such as the top level functions in a module.
es: El navegador de clases muestra ahora más información, como las funciones de nivel superior de un módulo.

source: Tab width is now a user settable option. When opening an existing Python file, IDLE automatically detects the indentation conventions, and adapts.
es: El ancho del tabulador es ahora una opción configurable por el usuario. Al abrir un archivo Python existente, IDLE detecta automáticamente las convenciones de sangría y se adapta.

source: There is now support for calling browsers on various platforms, used to open the Python documentation in a browser.
es: Ahora hay soporte para llamar a los navegadores en varias plataformas, utilizado para abrir la documentación de Python en un navegador.

source: IDLE now has a command line, which is largely similar to the vanilla Python interpreter.
es: IDLE ahora tiene una línea de comandos, que es en gran medida similar al intérprete de Python vainilla.

source: Call tips were added in many places.
es: Se añadieron consejos de llamada en muchos lugares.

source: IDLE can now be installed as a package.
es: Ahora IDLE puede instalarse como un paquete.

source: In the editor window, there is now a line/column bar at the bottom.
es: En la ventana del editor, ahora hay una barra de líneas/columnas en la parte inferior.

source: Three new keystroke commands: Check module (:kbd:`Alt-F5`), Import module (:kbd:`F5`) and Run script (:kbd:`Ctrl-F5`).
es: Tres nuevos comandos de teclado: Comprobar módulo (:kbd:`Alt-F5`), Importar módulo (:kbd:`F5`) y Ejecutar script (:kbd:`Ctrl-F5`).

source: Deleted and Deprecated Modules
es: Módulos eliminados y obsoletos

source: A few modules have been dropped because they're obsolete, or because there are now better ways to do the same thing. The :mod:`stdwin` module is gone; it was for a platform-independent windowing toolkit that's no longer developed.
es: Se han eliminado algunos módulos porque son obsoletos, o porque ahora hay mejores formas de hacer lo mismo. El módulo :mod:`stdwin` ha desaparecido; era para un conjunto de herramientas de ventanas independientes de la plataforma que ya no se desarrolla.

source: A number of modules have been moved to the :file:`lib-old` subdirectory: :mod:`cmp`, :mod:`cmpcache`, :mod:`dircmp`, :mod:`dump`, :mod:`find`, :mod:`grep`, :mod:`packmail`, :mod:`poly`, :mod:`util`, :mod:`whatsound`, :mod:`zmod`. If you have code which relies on a module that's been moved to :file:`lib-old`, you can simply add that directory to ``sys.path`` to get them back, but you're encouraged to update any code that uses these modules.
es: Varios módulos han sido trasladados al subdirectorio :file:`lib-old`: :mod:`cmp`, :mod:`cmpcache`, :mod:`dircmp`, :mod:`dump`, :mod:`find`, :mod:`grep`, :mod:`packmail`, :mod:`poly`, :mod:`util`, :mod:`whatsound`, :mod:`zmod`. Si tiene código que depende de un módulo que ha sido movido a :file:`lib-old`, puede simplemente añadir ese directorio a ``sys.path`` para recuperarlo, pero se recomienda actualizar cualquier código que utilice estos módulos.

source: Acknowledgements
es: Agradecimientos

source: The authors would like to thank the following people for offering suggestions on various drafts of this article: David Bolen, Mark Hammond, Gregg Hauser, Jeremy Hylton, Fredrik Lundh, Detlef Lannert, Aahz Maruch, Skip Montanaro, Vladimir Marangozov, Tobias Polzin, Guido van Rossum, Neil Schemenauer, and Russ Schmidt.
es: Los autores desean agradecer a las siguientes personas sus sugerencias sobre varios borradores de este artículo: David Bolen, Mark Hammond, Gregg Hauser, Jeremy Hylton, Fredrik Lundh, Detlef Lannert, Aahz Maruch, Skip Montanaro, Vladimir Marangozov, Tobias Polzin, Guido van Rossum, Neil Schemenauer y Russ Schmidt.
