Repository: python/python-docs-es
Catalog: whatsnew/2.0.po
Languages: es

source: The :file:`Python/importdl.c` file, which was a mass of #ifdefs to support dynamic loading on many different platforms, was cleaned up and reorganised by Greg Stein. :file:`importdl.c` is now quite small, and platform-specific code has been moved into a bunch of :file:`Python/dynload_\*.c` files. Another cleanup: there were also a number of :file:`my\*.h` files in the Include/ directory that held various portability hacks; they've been merged into a single file, :file:`Include/pyport.h`.
es: El archivo :file:`Python/importdl.c`, que era una masa de #ifdefs para soportar la carga dinámica en muchas plataformas diferentes, fue limpiado y reorganizado por Greg Stein. :file:`importdl.c` es ahora bastante pequeño, y el código específico de la plataforma se ha movido a un montón de archivos :file:`Python/dynload_\*.c`. Otra limpieza: también había una serie de archivos :file:`my\*.h` en el directorio Include/ que contenían varios hacks de portabilidad; se han fusionado en un único archivo, :file:`Include/pyport.h`.

source: Recent versions of the GUSI development environment for MacOS support POSIX threads. Therefore, Python's POSIX threading support now works on the Macintosh. Threading support using the user-space GNU ``pth`` library was also contributed.
es: Las versiones recientes del entorno de desarrollo GUSI para MacOS soportan hilos POSIX. Por lo tanto, el soporte de hilos POSIX de Python ahora funciona en Macintosh. También se ha contribuido al soporte de hilos utilizando la biblioteca GNU ``pth`` del espacio de usuario.

source: Threading support on Windows was enhanced, too. Windows supports thread locks that use kernel objects only in case of contention; in the common case when there's no contention, they use simpler functions which are an order of magnitude faster. A threaded version of Python 1.5.2 on NT is twice as slow as an unthreaded version; with the 2.0 changes, the difference is only 10%. These improvements were contributed by Yakov Markovitch.
es: También se ha mejorado el soporte de hilos en Windows. Windows soporta bloqueos de hilos que utilizan objetos del núcleo sólo en caso de contención; en el caso común cuando no hay contención, utilizan funciones más simples que son un orden de magnitud más rápido. Una versión con hilos de Python 1.5.2 en NT es dos veces más lenta que una versión sin hilos; con los cambios de la 2.0, la diferencia es sólo del 10%. Estas mejoras fueron aportadas por Yakov Markovitch.

source: Python 2.0's source now uses only ANSI C prototypes, so compiling Python now requires an ANSI C compiler, and can no longer be done using a compiler that only supports K&R C.
es: El código fuente de Python 2.0 ahora sólo utiliza prototipos ANSI C, por lo que la compilación de Python ahora requiere un compilador ANSI C, y ya no puede hacerse utilizando un compilador que sólo soporte K&R C.

source: Previously the Python virtual machine used 16-bit numbers in its bytecode, limiting the size of source files. In particular, this affected the maximum size of literal lists and dictionaries in Python source; occasionally people who are generating Python code would run into this limit. A patch by Charles G. Waldman raises the limit from ``2**16`` to ``2**32``.
es: Anteriormente, la máquina virtual de Python utilizaba números de 16 bits en su bytecode, lo que limitaba el tamaño de los archivos fuente. En particular, esto afectaba al tamaño máximo de las listas literales y los diccionarios en el código fuente de Python; ocasionalmente, las personas que generan código Python se encontraban con este límite. Un parche de Charles G. Waldman eleva el límite de ``2^16`` a ``2^{32}``.

source: Distutils: Making Modules Easy to Install
es: Distutils: Facilitando la instalación de módulos

source: Before Python 2.0, installing modules was a tedious affair -- there was no way to figure out automatically where Python is installed, or what compiler options to use for extension modules. Software authors had to go through an arduous ritual of editing Makefiles and configuration files, which only really work on Unix and leave Windows and MacOS unsupported. Python users faced wildly differing installation instructions which varied between different extension packages, which made administering a Python installation something of a chore.
es: Antes de Python 2.0, la instalación de módulos era un asunto tedioso -- no había forma de averiguar automáticamente dónde se instalaba Python, o qué opciones del compilador se debían usar para los módulos de extensión. Los autores de software tenían que pasar por un arduo ritual de edición de Makefiles y archivos de configuración, que sólo funcionaban realmente en Unix y dejaban sin soporte a Windows y MacOS. Los usuarios de Python se enfrentaban a instrucciones de instalación muy diferentes que variaban entre los distintos paquetes de extensión, lo que hacía que la administración de una instalación de Python fuera una tarea ardua.

source: In order to use the Distutils, you need to write a :file:`setup.py` script. For the simple case, when the software contains only .py files, a minimal :file:`setup.py` can be just a few lines long::
es: Para usar las Distutils, necesitas escribir un script :file:`setup.py`. Para el caso simple, cuando el software contiene sólo archivos .py, un :file:`setup.py` mínimo puede tener sólo unas pocas líneas::

source: The :file:`setup.py` file isn't much more complicated if the software consists of a few packages::
es: El archivo :file:`setup.py` no es mucho más complicado si el software consta de unos pocos paquetes::

source: A C extension can be the most complicated case; here's an example taken from the PyXML package::
es: Una extensión en C puede ser el caso más complicado; he aquí un ejemplo tomado del paquete PyXML::

source: The Distutils can also take care of creating source and binary distributions. The "sdist" command, run by "``python setup.py sdist``', builds a source distribution such as :file:`foo-1.0.tar.gz`. Adding new commands isn't difficult, "bdist_rpm" and "bdist_wininst" commands have already been contributed to create an RPM distribution and a Windows installer for the software, respectively. Commands to create other distribution formats such as Debian packages and Solaris :file:`.pkg` files are in various stages of development.
es: Las Distutils también pueden encargarse de crear distribuciones fuente y binarias. El comando "sdist", ejecutado por "``python setup.py sdist``, construye una distribución fuente como :file:`foo-1.0.tar.gz`. Añadir nuevos comandos no es difícil, ya se han aportado los comandos "bdist_rpm" y "bdist_wininst" para crear una distribución RPM y un instalador de Windows para el software, respectivamente. Los comandos para crear otros formatos de distribución, como los paquetes de Debian y los archivos :file:`.pkg` de Solaris, se encuentran en diversas etapas de desarrollo.

source: All this is documented in a new manual, *Distributing Python Modules*, that joins the basic set of Python documentation.
es: Todo esto está documentado en un nuevo manual, *Distribución de módulos de Python*, que se une al conjunto básico de documentación de Python.

source: XML Modules
es: Módulos XML

source: Python 1.5.2 included a simple XML parser in the form of the :mod:`xmllib` module, contributed by Sjoerd Mullender. Since 1.5.2's release, two different interfaces for processing XML have become common: SAX2 (version 2 of the Simple API for XML) provides an event-driven interface with some similarities to :mod:`xmllib`, and the DOM (Document Object Model) provides a tree-based interface, transforming an XML document into a tree of nodes that can be traversed and modified. Python 2.0 includes a SAX2 interface and a stripped-down DOM interface as part of the :mod:`xml` package. Here we will give a brief overview of these new interfaces; consult the Python documentation or the source code for complete details. The Python XML SIG is also working on improved documentation.
es: La versión 1.5.2 de Python incluía un sencillo analizador XML en forma de módulo :mod:`xmllib`, aportado por Sjoerd Mullender. Desde el lanzamiento de la versión 1.5.2, se han generalizado dos interfaces diferentes para el procesamiento de XML: SAX2 (versión 2 de la API Simple para XML) proporciona una interfaz basada en eventos con algunas similitudes con :mod:`xmllib`, y el DOM (Modelo de Objetos de Documento) proporciona una interfaz basada en un árbol, transformando un documento XML en un árbol de nodos que puede ser atravesado y modificado. Python 2.0 incluye una interfaz SAX2 y una interfaz DOM reducida como parte del paquete :mod:`xml`. Aquí daremos una breve descripción de estas nuevas interfaces; consulte la documentación de Python o el código fuente para obtener detalles completos. El SIG XML de Python también está trabajando en la mejora de la documentación.

source: SAX2 Support
es: Soporte de SAX2

source: SAX defines an event-driven interface for parsing XML. To use SAX, you must write a SAX handler class. Handler classes inherit from various classes provided by SAX, and override various methods that will then be called by the XML parser. For example, the :meth:`startElement` and :meth:`endElement` methods are called for every starting and end tag encountered by the parser, the :meth:`characters` method is called for every chunk of character data, and so forth.
es: SAX define una interfaz basada en eventos para analizar XML. Para usar SAX, debes escribir una clase manejadora de SAX. Las clases manejadoras heredan de varias clases proporcionadas por SAX, y sobrescriben varios métodos que luego serán llamados por el analizador XML. Por ejemplo, los métodos :meth:`startElement` y :meth:`endElement` son llamados para cada etiqueta inicial y final encontrada por el analizador, el método :meth:`characters` es llamado para cada trozo de datos de caracteres, etc.

source: The advantage of the event-driven approach is that the whole document doesn't have to be resident in memory at any one time, which matters if you are processing really huge documents. However, writing the SAX handler class can get very complicated if you're trying to modify the document structure in some elaborate way.
es: La ventaja del enfoque basado en eventos es que todo el documento no tiene que residir en la memoria en un momento dado, lo cual es importante si estás procesando documentos realmente enormes. Sin embargo, escribir la clase manejadora de SAX puede ser muy complicado si se intenta modificar la estructura del documento de alguna manera elaborada.

source: For example, this little example program defines a handler that prints a message for every starting and ending tag, and then parses the file :file:`hamlet.xml` using it::
es: Por ejemplo, este pequeño programa de ejemplo define un manejador que imprime un mensaje para cada etiqueta inicial y final, y luego analiza el archivo :file:`hamlet.xml` usándolo::

source: DOM Support
es: Soporte DOM

source: The Document Object Model is a tree-based representation for an XML document. A top-level :class:`Document` instance is the root of the tree, and has a single child which is the top-level :class:`Element` instance. This :class:`Element` has children nodes representing character data and any sub-elements, which may have further children of their own, and so forth. Using the DOM you can traverse the resulting tree any way you like, access element and attribute values, insert and delete nodes, and convert the tree back into XML.
es: El Modelo de Objetos del Documento es una representación basada en un árbol para un documento XML. Una instancia de :class:`Document` de nivel superior es la raíz del árbol, y tiene un único hijo que es la instancia de :class:`Element` de nivel superior. Este :class:`Element` tiene nodos hijos que representan los datos de los caracteres y cualquier subelemento, que puede tener otros hijos propios, y así sucesivamente. Utilizando el DOM puedes recorrer el árbol resultante como quieras, acceder a los valores de los elementos y atributos, insertar y eliminar nodos y volver a convertir el árbol en XML.

source: The DOM is useful for modifying XML documents, because you can create a DOM tree, modify it by adding new nodes or rearranging subtrees, and then produce a new XML document as output. You can also construct a DOM tree manually and convert it to XML, which can be a more flexible way of producing XML output than simply writing ``<tag1>``...\ ``</tag1>`` to a file.
es: El DOM es útil para modificar documentos XML, porque se puede crear un árbol DOM, modificarlo añadiendo nuevos nodos o reordenando subárboles, y luego producir un nuevo documento XML como salida. También se puede construir un árbol DOM manualmente y convertirlo en XML, lo que puede ser una forma más flexible de producir una salida XML que simplemente escribir ``<tag1>``...\ ``</tag1>`` un archivo.

source: The DOM implementation included with Python lives in the :mod:`xml.dom.minidom` module. It's a lightweight implementation of the Level 1 DOM with support for XML namespaces. The :func:`parse` and :func:`parseString` convenience functions are provided for generating a DOM tree::
es: La implementación del DOM incluida en Python se encuentra en el módulo :mod:`xml.dom.minidom`. Es una implementación ligera del DOM de nivel 1 con soporte para espacios de nombres XML. Las funciones :func:`parse` y :func:`parseString` se proporcionan para generar un árbol DOM::

source: ``doc`` is a :class:`Document` instance. :class:`Document`, like all the other DOM classes such as :class:`Element` and :class:`Text`, is a subclass of the :class:`Node` base class. All the nodes in a DOM tree therefore support certain common methods, such as :meth:`toxml` which returns a string containing the XML representation of the node and its children. Each class also has special methods of its own; for example, :class:`Element` and :class:`Document` instances have a method to find all child elements with a given tag name. Continuing from the previous 2-line example::
es: ``doc`` es una instancia de :class:`Document`. El :class:`Document`, al igual que el resto de clases del DOM como el :class:`Element` y el :class:`Text`, es una subclase de la clase base :class:`Node`. Por lo tanto, todos los nodos de un árbol DOM soportan ciertos métodos comunes, como :meth:`toxml` que retorna una cadena que contiene la representación XML del nodo y sus hijos. Cada clase también tiene métodos especiales propios; por ejemplo, las instancias :class:`Element` y :class:`Document` tienen un método para encontrar todos los elementos hijos con un nombre de etiqueta dado. Continuando con el ejemplo anterior de 2 líneas::

source: For the *Hamlet* XML file, the above few lines output::
es: Para el archivo XML *Hamlet*, las líneas anteriores dan como resultado::

source: The root element of the document is available as ``doc.documentElement``, and its children can be easily modified by deleting, adding, or removing nodes::
es: El elemento raíz del documento está disponible como ``doc.documentElement``, y sus hijos pueden modificarse fácilmente borrando, añadiendo o eliminando nodos::

source: Again, I will refer you to the Python documentation for a complete listing of the different :class:`Node` classes and their various methods.
es: Una vez más, te remito a la documentación de Python para obtener una lista completa de las diferentes clases :class:`Node` y sus diversos métodos.

source: Relationship to PyXML
es: Relación con PyXML

source: The XML Special Interest Group has been working on XML-related Python code for a while. Its code distribution, called PyXML, is available from the SIG's web pages at https://www.python.org/community/sigs/current/xml-sig. The PyXML distribution also used the package name ``xml``. If you've written programs that used PyXML, you're probably wondering about its compatibility with the 2.0 :mod:`xml` package.
es: El Grupo de Interés Especial XML lleva un tiempo trabajando en código Python relacionado con XML. Su distribución de código, llamada PyXML, está disponible en las páginas web del SIG en https://www.python.org/community/sigs/current/xml-sig. La distribución de PyXML también utiliza el nombre de paquete ``xml``. Si has escrito programas que utilizan PyXML, probablemente te preguntes sobre su compatibilidad con el paquete 2.0 :mod:`xml`.

source: The answer is that Python 2.0's :mod:`xml` package isn't compatible with PyXML, but can be made compatible by installing a recent version PyXML. Many applications can get by with the XML support that is included with Python 2.0, but more complicated applications will require that the full PyXML package will be installed. When installed, PyXML versions 0.6.0 or greater will replace the :mod:`xml` package shipped with Python, and will be a strict superset of the standard package, adding a bunch of additional features. Some of the additional features in PyXML include:
es: La respuesta es que el paquete :mod:`xml` de Python 2.0 no es compatible con PyXML, pero puede hacerse compatible instalando una versión reciente de PyXML. Muchas aplicaciones pueden arreglárselas con el soporte XML que se incluye en Python 2.0, pero las aplicaciones más complicadas requerirán que se instale el paquete PyXML completo. Cuando se instala, las versiones 0.6.0 o superiores de PyXML sustituyen al paquete :mod:`xml` que se entrega con Python, y son un estricto superconjunto del paquete estándar, añadiendo un montón de características adicionales. Algunas de las características adicionales de PyXML incluyen:

source: 4DOM, a full DOM implementation from FourThought, Inc.
es: 4DOM, una implementación completa de DOM de FourThought, Inc.

source: The xmlproc validating parser, written by Lars Marius Garshol.
es: El parser de validación xmlproc, escrito por Lars Marius Garshol.

source: The :mod:`sgmlop` parser accelerator module, written by Fredrik Lundh.
es: El módulo acelerador del parser :mod:`sgmlop`, escrito por Fredrik Lundh.

source: Module changes
es: Cambios en los módulos

source: Lots of improvements and bugfixes were made to Python's extensive standard library; some of the affected modules include :mod:`readline`, :mod:`ConfigParser`, :mod:`cgi`, :mod:`calendar`, :mod:`posix`, :mod:`readline`, :mod:`xmllib`, :mod:`aifc`, :mod:`chunk, wave`, :mod:`random`, :mod:`shelve`, and :mod:`nntplib`. Consult the CVS logs for the exact patch-by-patch details.
es: Se han realizado muchas mejoras y correcciones de errores en la extensa biblioteca estándar de Python; algunos de los módulos afectados son :mod:`readline`, :mod:`ConfigParser`, :mod:`cgi`, :mod:`calendar`, :mod:`posix`, :mod:`readline`, :mod:`xmllib`, :mod:`aifc`, :mod:`chunk, wave`, :mod:`random`, :mod:`shelve`, y :mod:`nntplib`. Consulte los registros de CVS para conocer los detalles exactos parche por parche.

source: Brian Gallew contributed OpenSSL support for the :mod:`socket` module. OpenSSL is an implementation of the Secure Socket Layer, which encrypts the data being sent over a socket. When compiling Python, you can edit :file:`Modules/Setup` to include SSL support, which adds an additional function to the :mod:`socket` module: ``socket.ssl(socket, keyfile, certfile)``, which takes a socket object and returns an SSL socket. The :mod:`httplib` and :mod:`urllib` modules were also changed to support ``https://`` URLs, though no one has implemented FTP or SMTP over SSL.
es: Brian Gallew ha contribuido al soporte de OpenSSL para el módulo :mod:`socket`. OpenSSL es una implementación de Secure Socket Layer, que encripta los datos que se envían a través de un socket. Al compilar Python, puedes editar :file:`Modules/Setup` para incluir el soporte de SSL, que añade una función adicional al módulo :mod:`socket`: ``socket.ssl(socket, keyfile, certfile)``, que toma un objeto socket y retorna un socket SSL. Los módulos :mod:`httplib` y :mod:`urllib` también han sido modificados para soportar URLs ``https://``, aunque nadie ha implementado FTP o SMTP sobre SSL.

source: The :mod:`httplib` module has been rewritten by Greg Stein to support HTTP/1.1. Backward compatibility with the 1.5 version of :mod:`httplib` is provided, though using HTTP/1.1 features such as pipelining will require rewriting code to use a different set of interfaces.
es: El módulo :mod:`httplib` ha sido reescrito por Greg Stein para soportar HTTP/1.1. Se proporciona compatibilidad con la versión 1.5 de :mod:`httplib`, aunque el uso de las características de HTTP/1.1, como el pipelining, requerirá reescribir el código para utilizar un conjunto diferente de interfaces.

source: The :mod:`Tkinter` module now supports Tcl/Tk version 8.1, 8.2, or 8.3, and support for the older 7.x versions has been dropped. The Tkinter module now supports displaying Unicode strings in Tk widgets. Also, Fredrik Lundh contributed an optimization which makes operations like ``create_line`` and ``create_polygon`` much faster, especially when using lots of coordinates.
es: El módulo :mod:`Tkinter` soporta ahora la versión 8.1, 8.2 o 8.3 de Tcl/Tk, y se ha eliminado el soporte para las versiones 7.x más antiguas. El módulo Tkinter ahora soporta la visualización de cadenas Unicode en los widgets Tk. Además, Fredrik Lundh ha contribuido con una optimización que hace que operaciones como ``create_line`` y ``create_polygon`` sean mucho más rápidas, especialmente cuando se utilizan muchas coordenadas.

source: The :mod:`curses` module has been greatly extended, starting from Oliver Andrich's enhanced version, to provide many additional functions from ncurses and SYSV curses, such as colour, alternative character set support, pads, and mouse support. This means the module is no longer compatible with operating systems that only have BSD curses, but there don't seem to be any currently maintained OSes that fall into this category.
es: El módulo :mod:`curses` ha sido ampliado en gran medida, a partir de la versión mejorada de Oliver Andrich, para proporcionar muchas funciones adicionales de los curses ncurses y SYSV, como el color, el soporte de conjuntos de caracteres alternativos, los pads y el soporte de ratón. Esto significa que el módulo ya no es compatible con los sistemas operativos que sólo tienen curses BSD, pero no parece haber ningún sistema operativo actualmente mantenido que caiga en esta categoría.

source: As mentioned in the earlier discussion of 2.0's Unicode support, the underlying implementation of the regular expressions provided by the :mod:`re` module has been changed. SRE, a new regular expression engine written by Fredrik Lundh and partially funded by Hewlett Packard, supports matching against both 8-bit strings and Unicode strings.
es: Como se mencionó en la discusión anterior sobre el soporte Unicode de la 2.0, la implementación subyacente de las expresiones regulares proporcionadas por el módulo :mod:`re` ha sido cambiada. SRE, un nuevo motor de expresiones regulares escrito por Fredrik Lundh y parcialmente financiado por Hewlett Packard, soporta la comparación con cadenas de 8 bits y cadenas Unicode.

source: New modules
es: Nuevos módulos

source: A number of new modules were added. We'll simply list them with brief descriptions; consult the 2.0 documentation for the details of a particular module.
es: Se han añadido varios módulos nuevos. Nos limitaremos a enumerarlos con breves descripciones; consulte la documentación de la versión 2.0 para conocer los detalles de un módulo concreto.
