Repository: python/python-docs-es
Catalog: whatsnew/2.0.po
Languages: es

source: Modules can now be renamed on importing them, using the syntax ``import module as name`` or ``from module import name as othername``. The patch was submitted by Thomas Wouters.
es: Ahora se puede cambiar el nombre de los módulos al importarlos, utilizando la sintaxis ``import module as name`` o ``from module import name as othername``. El parche fue enviado por Thomas Wouters.

source: A new format style is available when using the ``%`` operator; '%r' will insert the :func:`repr` of its argument. This was also added from symmetry considerations, this time for symmetry with the existing '%s' format style, which inserts the :func:`str` of its argument. For example, ``'%r %s' % ('abc', 'abc')`` returns a string containing ``'abc' abc``.
es: Un nuevo estilo de formato está disponible cuando se utiliza el operador ``%``; '%r' insertará el :func:`repr` de su argumento. Esto también se añadió por consideraciones de simetría, esta vez por simetría con el estilo de formato existente '%s', que inserta el :func:`str` de su argumento. Por ejemplo, ``'%r %s' % ('abc', 'abc')`` retorna una cadena que contiene ``'abc' abc``.

source: Previously there was no way to implement a class that overrode Python's built-in :keyword:`in` operator and implemented a custom version. ``obj in seq`` returns true if *obj* is present in the sequence *seq*; Python computes this by simply trying every index of the sequence until either *obj* is found or an :exc:`IndexError` is encountered. Moshe Zadka contributed a patch which adds a :meth:`__contains__` magic method for providing a custom implementation for :keyword:`!in`. Additionally, new built-in objects written in C can define what :keyword:`!in` means for them via a new slot in the sequence protocol.
es: Anteriormente no había forma de implementar una clase que sobrepasara el operador incorporado de Python :keyword:`in` e implementara una versión personalizada.``obj in seq`` retorna verdadero si *obj* está presente en la secuencia *seq*; Python lo calcula simplemente probando cada índice de la secuencia hasta que se encuentra *obj* o se encuentra un :exc:`IndexError`. Moshe Zadka ha contribuido con un parche que añade un método mágico :meth:`__contains__` para proporcionar una implementación personalizada para :keyword:`!in`. Además, los nuevos objetos incorporados escritos en C pueden definir lo que :keyword:`!in` significa para ellos a través de una nueva ranura en el protocolo de secuencia.

source: Earlier versions of Python used a recursive algorithm for deleting objects. Deeply nested data structures could cause the interpreter to fill up the C stack and crash; Christian Tismer rewrote the deletion logic to fix this problem. On a related note, comparing recursive objects recursed infinitely and crashed; Jeremy Hylton rewrote the code to no longer crash, producing a useful result instead. For example, after this code::
es: Las versiones anteriores de Python utilizaban un algoritmo recursivo para borrar objetos. Las estructuras de datos muy anidadas podían hacer que el intérprete llenara la pila de C y se bloqueara; Christian Tismer reescribió la lógica de borrado para solucionar este problema. En una nota relacionada, la comparación de objetos recursivos se repite infinitamente y se bloquea; Jeremy Hylton reescribió el código para que no se bloquee, produciendo un resultado útil. Por ejemplo, después de este código::

source: The comparison ``a==b`` returns true, because the two recursive data structures are isomorphic. See the thread "trashcan and PR#7" in the April 2000 archives of the python-dev mailing list for the discussion leading up to this implementation, and some useful relevant links. Note that comparisons can now also raise exceptions. In earlier versions of Python, a comparison operation such as ``cmp(a,b)`` would always produce an answer, even if a user-defined :meth:`__cmp__` method encountered an error, since the resulting exception would simply be silently swallowed.
es: La comparación ``a==b`` retorna verdadero, porque las dos estructuras de datos recursivas son isomorfas. Véase el hilo "trashcan and PR#7" en los archivos de abril de 2000 de la lista de correo de python-dev para la discusión que condujo a esta implementación, y algunos enlaces relevantes útiles. Tenga en cuenta que las comparaciones ahora también pueden generar excepciones. En versiones anteriores de Python, una operación de comparación como ``cmp(a,b)`` siempre producía una respuesta, incluso si un método :meth:`__cmp__` definido por el usuario encontraba un error, ya que la excepción resultante simplemente se tragaba en silencio.

source: Work has been done on porting Python to 64-bit Windows on the Itanium processor, mostly by Trent Mick of ActiveState. (Confusingly, ``sys.platform`` is still ``'win32'`` on Win64 because it seems that for ease of porting, MS Visual C++ treats code as 32 bit on Itanium.) PythonWin also supports Windows CE; see the Python CE page at https://pythonce.sourceforge.net/ for more information.
es: Se ha trabajado en la migración de Python a Windows de 64 bits en el procesador Itanium, principalmente por Trent Mick de ActiveState. (Confusamente, ``sys.platform`` sigue siendo ``'win32'`` en Win64 porque parece que, para facilitar la migración, MS Visual C++ trata el código como de 32 bits en Itanium). PythonWin también es compatible con Windows CE; consulte la página de Python CE en https://pythonce.sourceforge.net/ para obtener más información.

source: Another new platform is Darwin/MacOS X; initial support for it is in Python 2.0. Dynamic loading works, if you specify "configure --with-dyld --with-suffix=.x". Consult the README in the Python source distribution for more instructions.
es: Otra plataforma nueva es Darwin/MacOS X; el soporte inicial para ella está en Python 2.0. La carga dinámica funciona, si se especifica "configure --with-dyld --with-suffix=.x". Consulte el README de la distribución de fuentes de Python para obtener más instrucciones.

source: An attempt has been made to alleviate one of Python's warts, the often-confusing :exc:`NameError` exception when code refers to a local variable before the variable has been assigned a value. For example, the following code raises an exception on the ``print`` statement in both 1.5.2 and 2.0; in 1.5.2 a :exc:`NameError` exception is raised, while 2.0 raises a new :exc:`UnboundLocalError` exception. :exc:`UnboundLocalError` is a subclass of :exc:`NameError`, so any existing code that expects :exc:`NameError` to be raised should still work. ::
es: Se ha intentado aliviar uno de los defectos de Python, la a menudo confusa excepción :exc:`NameError` cuando el código hace referencia a una variable local antes de que se le haya asignado un valor. Por ejemplo, el siguiente código lanza una excepción en la sentencia ``print`` tanto en 1.5.2 como en 2.0; en 1.5.2 se lanza una excepción :exc:`NameError`, mientras que en 2.0 se lanza una nueva excepción :exc:`UnboundLocalError`. :exc:`UnboundLocalError` es una subclase de :exc:`NameError`, así que cualquier código existente que espere que se lance :exc:`NameError` debería seguir funcionando. ::

source: Two new exceptions, :exc:`TabError` and :exc:`IndentationError`, have been introduced. They're both subclasses of :exc:`SyntaxError`, and are raised when Python code is found to be improperly indented.
es: Se han introducido dos nuevas excepciones, :exc:`TabError` y :exc:`IndentationError`. Ambas son subclases de :exc:`SyntaxError`, y se lanzan cuando el código Python se encuentra con una sangría incorrecta.

source: Changes to Built-in Functions
es: Cambios en las funciones incorporadas

source: A new built-in, ``zip(seq1, seq2, ...)``, has been added. :func:`zip` returns a list of tuples where each tuple contains the i-th element from each of the argument sequences. The difference between :func:`zip` and ``map(None, seq1, seq2)`` is that :func:`map` pads the sequences with ``None`` if the sequences aren't all of the same length, while :func:`zip` truncates the returned list to the length of the shortest argument sequence.
es: Se ha añadido un nuevo built-in, ``zip(seq1, seq2, ...)``. :func:`zip` retorna una lista de tuplas donde cada tupla contiene el i-ésimo elemento de cada una de las secuencias del argumento. La diferencia entre :func:`zip` y ``map(None, seq1, seq2)`` es que :func:`map` rellena las secuencias con ``None`` si las secuencias no tienen la misma longitud, mientras que :func:`zip` trunca la lista retornada a la longitud de la secuencia argumental más corta.

source: The :func:`int` and :func:`long` functions now accept an optional "base" parameter when the first argument is a string. ``int('123', 10)`` returns 123, while ``int('123', 16)`` returns 291. ``int(123, 16)`` raises a :exc:`TypeError` exception with the message "can't convert non-string with explicit base".
es: Las funciones :func:`int` y :func:`long` aceptan ahora un parámetro "base" opcional cuando el primer argumento es una cadena. ``int('123', 10)`` retorna 123, mientras que ``int('123', 16)`` retorna 291. ``int(123, 16)`` lanza una excepción :exc:`TypeError` con el mensaje "no se puede convertir una cadena con base explícita".

source: A new variable holding more detailed version information has been added to the :mod:`sys` module. ``sys.version_info`` is a tuple ``(major, minor, micro, level, serial)`` For example, in a hypothetical 2.0.1beta1, ``sys.version_info`` would be ``(2, 0, 1, 'beta', 1)``. *level* is a string such as ``"alpha"``, ``"beta"``, or ``"final"`` for a final release.
es: Se ha añadido al módulo :mod:`sys` una nueva variable que contiene información más detallada sobre la versión. ``sys.version_info`` es una tupla ``(major, minor, micro, level, serial)`` Por ejemplo, en una hipotética 2.0.1beta1, ``sys.version_info`` sería ``(2, 0, 1, 'beta', 1)``. *level* es una cadena como ``"alpha"``, ``"beta"``, o ``"final"`` para una versión final.

source: Dictionaries have an odd new method, ``setdefault(key, default)``, which behaves similarly to the existing :meth:`get` method. However, if the key is missing, :meth:`setdefault` both returns the value of *default* as :meth:`get` would do, and also inserts it into the dictionary as the value for *key*. Thus, the following lines of code::
es: Los diccionarios tienen un nuevo y extraño método, ``setdefault(key, default)``, que se comporta de forma similar al método :meth:`get` existente. Sin embargo, si falta la clave, :meth:`setdefault` retorna el valor de *default* como haría :meth:`get`, y también lo inserta en el diccionario como valor de *key*. Así, las siguientes líneas de código::

source: can be reduced to a single ``return dict.setdefault(key, [])`` statement.
es: puede reducirse a una única sentencia ``return dict.setdefault(key, [])``.

source: The interpreter sets a maximum recursion depth in order to catch runaway recursion before filling the C stack and causing a core dump or GPF.. Previously this limit was fixed when you compiled Python, but in 2.0 the maximum recursion depth can be read and modified using :func:`sys.getrecursionlimit` and :func:`sys.setrecursionlimit`. The default value is 1000, and a rough maximum value for a given platform can be found by running a new script, :file:`Misc/find_recursionlimit.py`.
es: El intérprete establece una profundidad de recursión máxima para atrapar la recursión desbocada antes de llenar la pila de C y causar un volcado del núcleo o GPF. Anteriormente este límite se fijaba cuando se compilaba Python, pero en la versión 2.0 la profundidad máxima de recursión puede leerse y modificarse usando :func:`sys.getrecursionlimit` y :func:`sys.setrecursionlimit`. El valor por defecto es 1000, y se puede encontrar un valor máximo aproximado para una plataforma determinada ejecutando un nuevo script, :file:`Misc/find_recursionlimit.py`.

source: Porting to 2.0
es: Adaptación a la versión 2.0

source: New Python releases try hard to be compatible with previous releases, and the record has been pretty good. However, some changes are considered useful enough, usually because they fix initial design decisions that turned out to be actively mistaken, that breaking backward compatibility can't always be avoided. This section lists the changes in Python 2.0 that may cause old Python code to break.
es: Las nuevas versiones de Python se esfuerzan por ser compatibles con las anteriores, y el historial ha sido bastante bueno. Sin embargo, algunos cambios se consideran lo suficientemente útiles, normalmente porque corrigen decisiones de diseño iniciales que resultaron ser activamente erróneas, que no siempre se puede evitar romper la compatibilidad hacia atrás. Esta sección enumera los cambios en Python 2.0 que pueden hacer que el código Python antiguo se rompa.

source: The change which will probably break the most code is tightening up the arguments accepted by some methods. Some methods would take multiple arguments and treat them as a tuple, particularly various list methods such as :meth:`append` and :meth:`insert`. In earlier versions of Python, if ``L`` is a list, ``L.append( 1,2 )`` appends the tuple ``(1,2)`` to the list. In Python 2.0 this causes a :exc:`TypeError` exception to be raised, with the message: 'append requires exactly 1 argument; 2 given'. The fix is to simply add an extra set of parentheses to pass both values as a tuple: ``L.append( (1,2) )``.
es: El cambio que probablemente romperá la mayor parte del código es el endurecimiento de los argumentos aceptados por algunos métodos. Algunos métodos tomaban múltiples argumentos y los trataban como una tupla, particularmente varios métodos de lista como :meth:`append` y :meth:`insert`. En versiones anteriores de Python, si ``L`` es una lista, ``L.append( 1,2 )`` añade la tupla ``(1,2)`` a la lista. En Python 2.0 esto provoca una excepción :exc:`TypeError` con el mensaje 'append requiere exactamente 1 argumento; se han dado 2'. La solución es simplemente añadir un conjunto extra de paréntesis para pasar ambos valores como una tupla: ``L.append( (1,2) )``.

source: Some of the functions in the :mod:`socket` module are still forgiving in this way. For example, :func:`socket.connect( ('hostname', 25) )` is the correct form, passing a tuple representing an IP address, but :func:`socket.connect( 'hostname', 25 )` also works. :func:`socket.connect_ex` and :func:`socket.bind` are similarly easy-going. 2.0alpha1 tightened these functions up, but because the documentation actually used the erroneous multiple argument form, many people wrote code which would break with the stricter checking. GvR backed out the changes in the face of public reaction, so for the :mod:`socket` module, the documentation was fixed and the multiple argument form is simply marked as deprecated; it *will* be tightened up again in a future Python version.
es: Algunas de las funciones del módulo :mod:`socket` siguen siendo indulgentes en este sentido. Por ejemplo, :func:`socket.connect( ('hostname', 25) )` es la forma correcta, pasando una tupla que representa una dirección IP, pero :func:`socket.connect( 'hostname', 25 )` también funciona. :func:`socket.connect_ex` y :func:`socket.bind` son igualmente fáciles de usar. 2.0alpha1 endureció estas funciones, pero como la documentación utilizaba la forma errónea de argumentos múltiples, mucha gente escribió código que se rompería con la comprobación más estricta. GvR se echó atrás en los cambios ante la reacción del público, así que para el módulo :mod:`socket`, la documentación se arregló y la forma de argumento múltiple simplemente se marcó como obsoleta; se *reforzará* de nuevo en una futura versión de Python.

source: The ``\x`` escape in string literals now takes exactly 2 hex digits. Previously it would consume all the hex digits following the 'x' and take the lowest 8 bits of the result, so ``\x123456`` was equivalent to ``\x56``.
es: El escape ``\x`` en los literales de cadena ahora toma exactamente 2 dígitos hexadecimales. Antes consumía todos los dígitos hexadecimales que seguían a la 'x' y tomaba los 8 bits más bajos del resultado, por lo que ``\x123456`` era equivalente a ``\x56``.

source: The :exc:`AttributeError` and :exc:`NameError` exceptions have a more friendly error message, whose text will be something like ``'Spam' instance has no attribute 'eggs'`` or ``name 'eggs' is not defined``. Previously the error message was just the missing attribute name ``eggs``, and code written to take advantage of this fact will break in 2.0.
es: Las excepciones :exc:`AttributeError` y :exc:`NameError` tienen un mensaje de error más amigable, cuyo texto será algo así como ``'Spam' instance has no attribute 'eggs'`` o ``name 'eggs' is not defined``. Anteriormente, el mensaje de error era simplemente la falta del nombre del atributo ``eggs``, y el código escrito para aprovechar este hecho se romperá en la versión 2.0.

source: Some work has been done to make integers and long integers a bit more interchangeable. In 1.5.2, large-file support was added for Solaris, to allow reading files larger than 2 GiB; this made the :meth:`tell` method of file objects return a long integer instead of a regular integer. Some code would subtract two file offsets and attempt to use the result to multiply a sequence or slice a string, but this raised a :exc:`TypeError`. In 2.0, long integers can be used to multiply or slice a sequence, and it'll behave as you'd intuitively expect it to; ``3L * 'abc'`` produces 'abcabcabc', and ``(0,1,2,3)[2L:4L]`` produces (2,3). Long integers can also be used in various contexts where previously only integers were accepted, such as in the :meth:`seek` method of file objects, and in the formats supported by the ``%`` operator (``%d``, ``%i``, ``%x``, etc.). For example, ``"%d" % 2L**64`` will produce the string ``18446744073709551616``.
es: Se ha trabajado para que los enteros y los enteros largos sean un poco más intercambiables. En la versión 1.5.2, se añadió soporte para archivos grandes en Solaris, para permitir la lectura de archivos de más de 2 GiB; esto hizo que el método :meth:`tell` de los objetos de archivo retornara un entero largo en lugar de un entero normal. Algunos códigos restaban dos desplazamientos de archivos e intentaban utilizar el resultado para multiplicar una secuencia o cortar una cadena, pero esto generaba un :exc:`TypeError`. En la versión 2.0, los enteros largos pueden utilizarse para multiplicar o cortar una secuencia, y se comportarán como se espera intuitivamente; ``3L * 'abc'`` produce 'abcabcabc', y ``(0,1,2,3)[2L:4L]`` produce (2,3). Los enteros largos también pueden utilizarse en varios contextos en los que antes sólo se aceptaban enteros, como en el método :meth:`seek` de los objetos de archivo, y en los formatos soportados por el operador ``%`` (``%d``, ``%i``, ``%x``, etc.). Por ejemplo, ``"%d" % 2L**64`` producirá la cadena ``18446744073709551616``.

source: The subtlest long integer change of all is that the :func:`str` of a long integer no longer has a trailing 'L' character, though :func:`repr` still includes it. The 'L' annoyed many people who wanted to print long integers that looked just like regular integers, since they had to go out of their way to chop off the character. This is no longer a problem in 2.0, but code which does ``str(longval)[:-1]`` and assumes the 'L' is there, will now lose the final digit.
es: El cambio más sutil de los enteros largos es que el :func:`str` de un entero largo ya no tiene un carácter 'L' al final, aunque :func:`repr` todavía lo incluye. La 'L' molestaba a muchas personas que querían imprimir enteros largos con el mismo aspecto que los enteros normales, ya que tenían que esforzarse por cortar el carácter. Esto ya no es un problema en 2.0, pero el código que hace ``str(longval)[:-1]`` y asume que la 'L' está ahí, ahora perderá el dígito final.

source: Taking the :func:`repr` of a float now uses a different formatting precision than :func:`str`. :func:`repr` uses ``%.17g`` format string for C's :func:`sprintf`, while :func:`str` uses ``%.12g`` as before. The effect is that :func:`repr` may occasionally show more decimal places than :func:`str`, for certain numbers. For example, the number 8.1 can't be represented exactly in binary, so ``repr(8.1)`` is ``'8.0999999999999996'``, while str(8.1) is ``'8.1'``.
es: Tomar el :func:`repr` de un flotador utiliza ahora una precisión de formato diferente a la de :func:`str`. :func:`repr` utiliza la cadena de formato ``%.17g`` para el :func:`sprintf` de C, mientras que :func:`str` utiliza ``%.12g`` como antes. El efecto es que :func:`repr` puede mostrar ocasionalmente más decimales que :func:`str`, para ciertos números. Por ejemplo, el número 8,1 no puede representarse exactamente en binario, por lo que ``repr(8,1)`` es ``'8,09999999999996'``, mientras que str(8,1) es ``'8,1'``.

source: The ``-X`` command-line option, which turned all standard exceptions into strings instead of classes, has been removed; the standard exceptions will now always be classes. The :mod:`exceptions` module containing the standard exceptions was translated from Python to a built-in C module, written by Barry Warsaw and Fredrik Lundh.
es: La opción de línea de comandos ``-X``, que convertía todas las excepciones estándar en cadenas en lugar de clases, ha sido eliminada; las excepciones estándar serán ahora siempre clases. El módulo :mod:`exceptions` que contiene las excepciones estándar ha sido traducido de Python a un módulo C integrado, escrito por Barry Warsaw y Fredrik Lundh.

source: Extending/Embedding Changes
es: Extensión/Incorporación de cambios

source: Some of the changes are under the covers, and will only be apparent to people writing C extension modules or embedding a Python interpreter in a larger application. If you aren't dealing with Python's C API, you can safely skip this section.
es: Algunos de los cambios están bajo la cubierta, y sólo serán evidentes para la gente que escribe módulos de extensión de C o que incrusta un intérprete de Python en una aplicación más grande. Si no estás tratando con la API de C de Python, puedes saltarte esta sección.

source: The version number of the Python C API was incremented, so C extensions compiled for 1.5.2 must be recompiled in order to work with 2.0. On Windows, it's not possible for Python 2.0 to import a third party extension built for Python 1.5.x due to how Windows DLLs work, so Python will raise an exception and the import will fail.
es: El número de versión de la API C de Python se incrementó, por lo que las extensiones C compiladas para 1.5.2 deben ser recompiladas para que funcionen con 2.0. En Windows, no es posible que Python 2.0 importe una extensión de terceros construida para Python 1.5.x debido a cómo funcionan las DLL de Windows, por lo que Python lanzará una excepción y la importación fallará.

source: Users of Jim Fulton's ExtensionClass module will be pleased to find out that hooks have been added so that ExtensionClasses are now supported by :func:`isinstance` and :func:`issubclass`. This means you no longer have to remember to write code such as ``if type(obj) == myExtensionClass``, but can use the more natural ``if isinstance(obj, myExtensionClass)``.
es: Los usuarios del módulo ExtensionClass de Jim Fulton estarán encantados de saber que se han añadido ganchos para que las ExtensionClasses sean ahora compatibles con :func:`isinstance` y :func:`issubclass`. Esto significa que ya no tiene que recordar escribir código como ``if type(obj) == myExtensionClass``, sino que puede utilizar el más natural ``if isinstance(obj, myExtensionClass)``.
