Repository: python/python-docs-es
Catalog: whatsnew/2.1.po
Languages: es

source: Two different modules for unit testing were added to the standard library. The :mod:`doctest` module, contributed by Tim Peters, provides a testing framework based on running embedded examples in docstrings and comparing the results against the expected output. PyUnit, contributed by Steve Purcell, is a unit testing framework inspired by JUnit, which was in turn an adaptation of Kent Beck's Smalltalk testing framework. See http://pyunit.sourceforge.net/ for more information about PyUnit.
es: Se han añadido a la biblioteca estándar dos módulos diferentes para realizar pruebas unitarias. El módulo :mod:`doctest`, aportado por Tim Peters, proporciona un marco de pruebas basado en la ejecución de ejemplos incrustados en docstrings y la comparación de los resultados con la salida esperadaPyUnit, contribuido por Steve Purcell, es un marco de pruebas unitarias inspirado en JUnit, que a su vez fue una adaptación del marco de pruebas Smalltalk de Kent BeckConsulte http://pyunit.sourceforge.net/ para obtener más información sobre PyUnit.

source: The :mod:`difflib` module contains a class, :class:`SequenceMatcher`, which compares two sequences and computes the changes required to transform one sequence into the other. For example, this module can be used to write a tool similar to the Unix :program:`diff` program, and in fact the sample program :file:`Tools/scripts/ndiff.py` demonstrates how to write such a script.
es: El módulo :mod:`difflib` contiene una clase, :class:`SequenceMatcher`, que compara dos secuencias y calcula los cambios necesarios para transformar una secuencia en la otra. Por ejemplo, este módulo puede utilizarse para escribir una herramienta similar al programa :program:`diff` de Unix, y de hecho el programa de ejemplo :file:`Tools/scripts/ndiff.py` demuestra cómo escribir un script de este tipo.

source: :mod:`curses.panel`, a wrapper for the panel library, part of ncurses and of SYSV curses, was contributed by Thomas Gellekum. The panel library provides windows with the additional feature of depth. Windows can be moved higher or lower in the depth ordering, and the panel library figures out where panels overlap and which sections are visible.
es: :mod:`curses.panel`, una envoltura para la biblioteca de paneles, parte de ncurses y de curses SYSV, fue contribuida por Thomas Gellekum. La biblioteca de paneles proporciona ventanas con la característica adicional de la profundidad. Las ventanas pueden ser movidas más arriba o más abajo en el ordenamiento de la profundidad, y la librería de paneles calcula dónde se superponen los paneles y qué secciones son visibles.

source: The PyXML package has gone through a few releases since Python 2.0, and Python 2.1 includes an updated version of the :mod:`xml` package. Some of the noteworthy changes include support for Expat 1.2 and later versions, the ability for Expat parsers to handle files in any encoding supported by Python, and various bugfixes for SAX, DOM, and the :mod:`minidom` module.
es: El paquete PyXML ha pasado por varias versiones desde Python 2.0, y Python 2.1 incluye una versión actualizada del paquete :mod:`xml`. Algunos de los cambios notables incluyen soporte para Expat 1.2 y versiones posteriores, la capacidad de los analizadores Expat para manejar archivos en cualquier codificación soportada por Python, y varias correcciones de errores para SAX, DOM, y el módulo :mod:`minidom`.

source: Ping also contributed another hook for handling uncaught exceptions. :func:`sys.excepthook` can be set to a callable object. When an exception isn't caught by any :keyword:`try`...\ :keyword:`except` blocks, the exception will be passed to :func:`sys.excepthook`, which can then do whatever it likes. At the Ninth Python Conference, Ping demonstrated an application for this hook: printing an extended traceback that not only lists the stack frames, but also lists the function arguments and the local variables for each frame.
es: Ping también contribuyó con otro gancho para manejar excepciones no detectadas. :func:`sys.excepthook` se puede configurar como un objeto invocable. Cuando una excepción no es detectada por ningún bloque :keyword:`try`...\ :keyword:`except`, la excepción se pasará a :func:`sys.excepthook`, que puede hacer lo que quiera. En la Novena Conferencia de Python, Ping demostró una aplicación para este gancho: imprimir un rastreo extendido que no solo enumera los marcos de la pila, sino que también enumera los argumentos de la función y las variables locales para cada marco.

source: Various functions in the :mod:`time` module, such as :func:`asctime` and :func:`localtime`, require a floating point argument containing the time in seconds since the epoch. The most common use of these functions is to work with the current time, so the floating point argument has been made optional; when a value isn't provided, the current time will be used. For example, log file entries usually need a string containing the current time; in Python 2.1, ``time.asctime()`` can be used, instead of the lengthier ``time.asctime(time.localtime(time.time()))`` that was previously required.
es: Varias funciones del módulo :mod:`time`, como :func:`asctime` y :func:`localtime`, requieren un argumento de punto flotante que contiene el tiempo en segundos desde la época. El uso más común de estas funciones es trabajar con la hora actual, por lo que el argumento de punto flotante se ha hecho opcional; cuando no se proporciona un valor, se utilizará la hora actual. Por ejemplo, las entradas de archivos de registro suelen necesitar una cadena que contenga la hora actual; en Python 2.1, se puede utilizar ``time.asctime()``, en lugar del más largo ``time.asctime(time.localtime(time.time()))`` que se requería anteriormente.

source: This change was proposed and implemented by Thomas Wouters.
es: Este cambio fue propuesto y aplicado por Thomas Wouters.

source: The :mod:`ftplib` module now defaults to retrieving files in passive mode, because passive mode is more likely to work from behind a firewall. This request came from the Debian bug tracking system, since other Debian packages use :mod:`ftplib` to retrieve files and then don't work from behind a firewall. It's deemed unlikely that this will cause problems for anyone, because Netscape defaults to passive mode and few people complain, but if passive mode is unsuitable for your application or network setup, call ``set_pasv(0)`` on FTP objects to disable passive mode.
es: El módulo :mod:`ftplib` ahora recupera por defecto los ficheros en modo pasivo, porque es más probable que el modo pasivo funcione desde detrás de un cortafuegos. Esta petición vino del sistema de seguimiento de errores de Debian, ya que otros paquetes de Debian utilizan :mod:`ftplib` para recuperar archivos y entonces no funcionan desde detrás de un cortafuegos. Se considera poco probable que esto cause problemas a nadie, porque Netscape utiliza por defecto el modo pasivo y poca gente se queja, pero si el modo pasivo no es adecuado para su aplicación o configuración de red, llame a ``set_pasv(0)`` en los objetos FTP para desactivar el modo pasivo.

source: Support for raw socket access has been added to the :mod:`socket` module, contributed by Grant Edwards.
es: Se ha añadido soporte para el acceso a sockets sin procesar en el módulo :mod:`socket`, aportado por Grant Edwards.

source: The :mod:`pstats` module now contains a simple interactive statistics browser for displaying timing profiles for Python programs, invoked when the module is run as a script. Contributed by Eric S. Raymond.
es: El módulo :mod:`pstats` contiene ahora un sencillo navegador de estadísticas interactivo para mostrar los perfiles de tiempo de los programas de Python, invocado cuando el módulo se ejecuta como un script. Contribuido por Eric S. Raymond.

source: A new implementation-dependent function, ``sys._getframe([depth])``, has been added to return a given frame object from the current call stack. :func:`sys._getframe` returns the frame at the top of the call stack; if the optional integer argument *depth* is supplied, the function returns the frame that is *depth* calls below the top of the stack. For example, ``sys._getframe(1)`` returns the caller's frame object.
es: Se ha agregado una nueva función dependiente de la implementación, ``sys._getframe([depth])``, para devolver un objeto de marco determinado de la pila de llamadas actual. :func:`sys._getframe` devuelve el marco en la parte superior de la pila de llamadas; si el argumento de entero opcional *depth* is supplied, the function returns the frame that is *depth* llama debajo de la parte superior de la pila. Por ejemplo, ``sys._getframe(1)`` devuelve el objeto de trama de la persona que llama.

source: This function is only present in CPython, not in Jython or the .NET implementation. Use it for debugging, and resist the temptation to put it into production code.
es: Esta función sólo está presente en CPython, no en Jython ni en la implementación de .NET. Utilízala para depurar, y resiste la tentación de ponerla en el código de producción.

source: Other Changes and Fixes
es: Otros cambios y correcciones

source: There were relatively few smaller changes made in Python 2.1 due to the shorter release cycle. A search through the CVS change logs turns up 117 patches applied, and 136 bugs fixed; both figures are likely to be underestimates. Some of the more notable changes are:
es: En Python 2.1 se hicieron relativamente pocos cambios pequeños debido al ciclo de publicación más corto. Una búsqueda en los registros de cambios de CVS muestra 117 parches aplicados y 136 errores corregidos; es probable que ambas cifras estén subestimadas. Algunos de los cambios más notables son:

source: A specialized object allocator is now optionally available, that should be faster than the system :func:`malloc` and have less memory overhead. The allocator uses C's :func:`malloc` function to get large pools of memory, and then fulfills smaller memory requests from these pools. It can be enabled by providing the :option:`!--with-pymalloc` option to the :program:`configure` script; see :file:`Objects/obmalloc.c` for the implementation details.
es: Ahora está disponible opcionalmente un asignador de objetos especializado, que debería ser más rápido que el sistema :func:`malloc` y tener menos sobrecarga de memoria. El asignador utiliza la función :func:`malloc` de C para obtener grandes reservas de memoria, y luego satisface las peticiones de memoria más pequeñas de estas reservas. Puede activarse proporcionando la opción :option:`!--with-pymalloc` al script :program:`configure`; véase :file:`Objects/obmalloc.c` para los detalles de la implementación.

source: Authors of C extension modules should test their code with the object allocator enabled, because some incorrect code may break, causing core dumps at runtime. There are a bunch of memory allocation functions in Python's C API that have previously been just aliases for the C library's :func:`malloc` and :func:`free`, meaning that if you accidentally called mismatched functions, the error wouldn't be noticeable. When the object allocator is enabled, these functions aren't aliases of :func:`malloc` and :func:`free` any more, and calling the wrong function to free memory will get you a core dump. For example, if memory was allocated using :func:`PyMem_New`, it has to be freed using :func:`PyMem_Del`, not :func:`free`. A few modules included with Python fell afoul of this and had to be fixed; doubtless there are more third-party modules that will have the same problem.
es: Los autores de los módulos de extensión de C deberían probar su código con el asignador de objetos activado, porque algún código incorrecto puede romperse, causando volcados del núcleo en tiempo de ejecución. Hay un montón de funciones de asignación de memoria en la API de C de Python que anteriormente eran sólo alias de :func:`malloc` y :func:`free` de la biblioteca de C, lo que significa que si accidentalmente llamabas a funciones que no coincidían, el error no se notaba. Cuando el asignador de objetos está habilitado, estas funciones ya no son alias de :func:`malloc` y :func:`free`, y llamar a la función incorrecta para liberar memoria te hará un volcado del núcleo. Por ejemplo, si la memoria fue asignada usando :func:`PyMem_New`, tiene que ser liberada usando :func:`PyMem_Del`, no :func:`free`. Unos cuantos módulos incluidos en Python han caído en la trampa y han tenido que ser corregidos; sin duda hay más módulos de terceros que tendrán el mismo problema.

source: The object allocator was contributed by Vladimir Marangozov.
es: El asignador de objetos fue aportado por Vladimir Marangozov.

source: The speed of line-oriented file I/O has been improved because people often complain about its lack of speed, and because it's often been used as a naïve benchmark. The :meth:`readline` method of file objects has therefore been rewritten to be much faster. The exact amount of the speedup will vary from platform to platform depending on how slow the C library's :func:`getc` was, but is around 66%, and potentially much faster on some particular operating systems. Tim Peters did much of the benchmarking and coding for this change, motivated by a discussion in comp.lang.python.
es: La velocidad de la E/S de archivos orientada a líneas se ha mejorado porque la gente suele quejarse de su falta de velocidad, y porque a menudo se ha utilizado como referencia ingenua. El método :meth:`readline` de los objetos de archivo ha sido reescrito para ser mucho más rápido. La cantidad exacta de la aceleración variará de una plataforma a otra dependiendo de la lentitud del método :func:`getc` de la biblioteca C, pero es alrededor del 66%, y potencialmente mucho más rápido en algunos sistemas operativos concretos. Tim Peters hizo gran parte de la evaluación comparativa y la codificación de este cambio, motivado por una discusión en comp.lang.python.

source: A new module and method for file objects was also added, contributed by Jeff Epler. The new method, :meth:`xreadlines`, is similar to the existing :func:`xrange` built-in. :func:`xreadlines` returns an opaque sequence object that only supports being iterated over, reading a line on every iteration but not reading the entire file into memory as the existing :meth:`readlines` method does. You'd use it like this::
es: También se ha añadido un nuevo módulo y método para objetos de archivo, aportado por Jeff Epler. El nuevo método, :meth:`xreadlines`, es similar al ya existente :func:`xrange` incorporado. :func:`xreadlines` retorna un objeto de secuencia opaco que sólo admite ser iterado, leyendo una línea en cada iteración pero no leyendo todo el archivo en memoria como hace el método :meth:`readlines` existente. Se usaría así::

source: For a fuller discussion of the line I/O changes, see the python-dev summary for January 1--15, 2001 at https://mail.python.org/pipermail/python-dev/2001-January/.
es: Para una discusión más completa de los cambios en la línea de E/S, véase el resumen de python-dev del 1 al 15 de enero de 2001 en https://mail.python.org/pipermail/python-dev/2001-January/.

source: A new method, :meth:`popitem`, was added to dictionaries to enable destructively iterating through the contents of a dictionary; this can be faster for large dictionaries because there's no need to construct a list containing all the keys or values. ``D.popitem()`` removes a random ``(key, value)`` pair from the dictionary ``D`` and returns it as a 2-tuple. This was implemented mostly by Tim Peters and Guido van Rossum, after a suggestion and preliminary patch by Moshe Zadka.
es: Se ha añadido un nuevo método, :meth:`popitem`, a los diccionarios para permitir la iteración destructiva a través del contenido de un diccionario; esto puede ser más rápido para diccionarios grandes porque no hay necesidad de construir una lista que contenga todas las claves o valores. ``D.popitem()`` elimina un par aleatorio ``(key, value)`` del diccionario ``D`` y lo retorna como una 2-tupla. Esto fue implementado principalmente por Tim Peters y Guido van Rossum, después de una sugerencia y un parche preliminar de Moshe Zadka.

source: Modules can now control which names are imported when ``from module import *`` is used, by defining an ``__all__`` attribute containing a list of names that will be imported. One common complaint is that if the module imports other modules such as :mod:`sys` or :mod:`string`, ``from module import *`` will add them to the importing module's namespace. To fix this, simply list the public names in ``__all__``::
es: Ahora los módulos pueden controlar qué nombres se importan cuando se utiliza ``from module import *``, definiendo un atributo ``__all__`` que contiene una lista de nombres que se importarán. Una queja común es que si el módulo importa otros módulos como :mod:`sys` o :mod:`string`, ``from module import *`` los añadirá al espacio de nombres del módulo importador. Para arreglar esto, simplemente liste los nombres públicos en ``__all__``:

source: A stricter version of this patch was first suggested and implemented by Ben Wolfson, but after some python-dev discussion, a weaker final version was checked in.
es: Una versión más estricta de este parche fue primero sugerida e implementada por Ben Wolfson, pero después de algunas discusiones de python-dev, una versión final más débil fue revisada.

source: Applying :func:`repr` to strings previously used octal escapes for non-printable characters; for example, a newline was ``'\012'``. This was a vestigial trace of Python's C ancestry, but today octal is of very little practical use. Ka-Ping Yee suggested using hex escapes instead of octal ones, and using the ``\n``, ``\t``, ``\r`` escapes for the appropriate characters, and implemented this new formatting.
es: Al aplicar :func:`repr` a las cadenas, antes se utilizaban escapes octales para los caracteres no imprimibles; por ejemplo, una nueva línea era ``'\012'``. Esto era un vestigio de la ascendencia de Python en C, pero hoy en día el octal tiene muy poco uso práctico. Ka-Ping Yee sugirió usar escapes hexadecimales en lugar de octales, y usar los escapes ``\n``, ``\t``, ``\r`` para los caracteres apropiados, e implementó este nuevo formato.

source: Syntax errors detected at compile-time can now raise exceptions containing the filename and line number of the error, a pleasant side effect of the compiler reorganization done by Jeremy Hylton.
es: Los errores de sintaxis detectados en tiempo de compilación pueden ahora lanzar excepciones que contienen el nombre del archivo y el número de línea del error, un agradable efecto secundario de la reorganización del compilador realizada por Jeremy Hylton.

source: C extensions which import other modules have been changed to use :func:`PyImport_ImportModule`, which means that they will use any import hooks that have been installed. This is also encouraged for third-party extensions that need to import some other module from C code.
es: Las extensiones C que importan otros módulos han sido cambiadas para usar :func:`PyImport_ImportModule`, lo que significa que usarán cualquier gancho de importación que haya sido instalado. Esto también se fomenta para las extensiones de terceros que necesitan importar algún otro módulo desde el código C.

source: The size of the Unicode character database was shrunk by another 340K thanks to Fredrik Lundh.
es: El tamaño de la base de datos de caracteres Unicode se redujo en otros 340K gracias a Fredrik Lundh.

source: Some new ports were contributed: MacOS X (by Steven Majewski), Cygwin (by Jason Tishler); RISCOS (by Dietmar Schwertberger); Unixware 7 (by Billy G. Allie).
es: Se han aportado algunos puertos nuevos: MacOS X (por Steven Majewski), Cygwin (por Jason Tishler); RISCOS (por Dietmar Schwertberger); Unixware 7 (por Billy G. Allie).

source: And there's the usual list of minor bugfixes, minor memory leaks, docstring edits, and other tweaks, too lengthy to be worth itemizing; see the CVS logs for the full details if you want them.
es: Y hay la lista habitual de correcciones de errores menores, fugas de memoria menores, ediciones de docstrings, y otros ajustes, demasiado largos para que valga la pena detallarlos; vea los registros de CVS para los detalles completos si los quiere.

source: Acknowledgements
es: Agradecimientos

source: The author would like to thank the following people for offering suggestions on various drafts of this article: Graeme Cross, David Goodger, Jay Graves, Michael Hudson, Marc-André Lemburg, Fredrik Lundh, Neil Schemenauer, Thomas Wouters.
es: El autor desea agradecer a las siguientes personas sus sugerencias sobre varios borradores de este artículo: Graeme Cross, David Goodger, Jay Graves, Michael Hudson, Marc-André Lemburg, Fredrik Lundh, Neil Schemenauer, Thomas Wouters.
