Repository: python/python-docs-es
Catalog: whatsnew/2.1.po
Languages: es

source: Written by Paul Prescod, to specify procedures to be followed when removing old features from Python. The policy described in this PEP hasn't been officially adopted, but the eventual policy probably won't be too different from Prescod's proposal.
es: Escrito por Paul Prescod, para especificar los procedimientos a seguir cuando se eliminan características antiguas de PythonLa política descrita en este PEP no ha sido adoptada oficialmente, pero la política final probablemente no será muy diferente de la propuesta de Prescod.

source: :pep:`230` - Warning Framework
es: :pep:`230` - Marco de advertencia

source: Written and implemented by Guido van Rossum.
es: Escrito y ejecutado por Guido van Rossum.

source: PEP 229: New Build System
es: PEP 229: Sistema de construcción nuevo

source: When compiling Python, the user had to go in and edit the :file:`Modules/Setup` file in order to enable various additional modules; the default set is relatively small and limited to modules that compile on most Unix platforms. This means that on Unix platforms with many more features, most notably Linux, Python installations often don't contain all useful modules they could.
es: Al compilar Python, el usuario tenía que entrar y editar el archivo :file:`Modules/Setup` para habilitar varios módulos adicionales; el conjunto por defecto es relativamente pequeño y se limita a los módulos que se compilan en la mayoría de las plataformas Unix. Esto significa que en plataformas Unix con muchas más características, sobre todo Linux, las instalaciones de Python no suelen contener todos los módulos útiles que podrían.

source: Python 2.0 added the Distutils, a set of modules for distributing and installing extensions. In Python 2.1, the Distutils are used to compile much of the standard library of extension modules, autodetecting which ones are supported on the current machine. It's hoped that this will make Python installations easier and more featureful.
es: Python 2.0 añadió los Distutils, un conjunto de módulos para distribuir e instalar extensiones. En Python 2.1, los Distutils se utilizan para compilar gran parte de la biblioteca estándar de módulos de extensión, autodetectando cuáles son compatibles con la máquina actual Se espera que esto haga que las instalaciones de Python sean más fáciles y tengan más funciones.

source: Instead of having to edit the :file:`Modules/Setup` file in order to enable modules, a :file:`setup.py` script in the top directory of the Python source distribution is run at build time, and attempts to discover which modules can be enabled by examining the modules and header files on the system. If a module is configured in :file:`Modules/Setup`, the :file:`setup.py` script won't attempt to compile that module and will defer to the :file:`Modules/Setup` file's contents. This provides a way to specific any strange command-line flags or libraries that are required for a specific platform.
es: En lugar de tener que editar el archivo :file:`Modules/Setup` para habilitar los módulos, un script :file:`setup.py` en el directorio superior de la distribución de fuentes de Python se ejecuta en el momento de la compilación, e intenta descubrir qué módulos pueden ser habilitados examinando los módulos y archivos de cabecera en el sistema. Si un módulo está configurado en :file:`Modules/Setup`, el script :file:`setup.py` no intentará compilar ese módulo y se remitirá al contenido del archivo :file:`Modules/Setup`. Esto proporciona una manera de especificar cualquier flag de línea de comandos extraña o bibliotecas que se requieren para una plataforma específica.

source: In another far-reaching change to the build mechanism, Neil Schemenauer restructured things so Python now uses a single makefile that isn't recursive, instead of makefiles in the top directory and in each of the :file:`Python/`, :file:`Parser/`, :file:`Objects/`, and :file:`Modules/` subdirectories. This makes building Python faster and also makes hacking the Makefiles clearer and simpler.
es: En otro cambio de gran alcance en el mecanismo de construcción, Neil Schemenauer reestructuró las cosas para que Python ahora utilice un único makefile que no es recursivo, en lugar de makefiles en el directorio superior y en cada uno de los subdirectorios :file:`Python/`, :file:`Parser/`, :file:`Objects/`, y :file:`Modules/`. Esto hace que la construcción de Python sea más rápida y también hace que el hackeo de los Makefiles sea más claro y sencillo.

source: :pep:`229` - Using Distutils to Build Python
es: :pep:`229` - Uso de Distutils para construir Python

source: Written and implemented by A.M. Kuchling.
es: Escrito y ejecutado por A.M. Kuchling.

source: PEP 205: Weak References
es: PEP 205: Referencias débiles

source: Weak references, available through the :mod:`weakref` module, are a minor but useful new data type in the Python programmer's toolbox.
es: Las referencias débiles, disponibles a través del módulo :mod:`weakref`, son un nuevo tipo de datos menor pero útil en la caja de herramientas del programador de Python.

source: Storing a reference to an object (say, in a dictionary or a list) has the side effect of keeping that object alive forever. There are a few specific cases where this behaviour is undesirable, object caches being the most common one, and another being circular references in data structures such as trees.
es: Almacenar una referencia a un objeto (por ejemplo, en un diccionario o una lista) tiene el efecto secundario de mantener ese objeto vivo para siempre. Hay algunos casos específicos en los que este comportamiento es indeseable, siendo las cachés de objetos el más común, y otro son las referencias circulares en estructuras de datos como los árboles.

source: For example, consider a memoizing function that caches the results of another function ``f(x)`` by storing the function's argument and its result in a dictionary::
es: Por ejemplo, considere una función de memoización que almacena en caché los resultados de otra función ``f(x)`` almacenando el argumento de la función y su resultado en un diccionario::

source: This version works for simple things such as integers, but it has a side effect; the ``_cache`` dictionary holds a reference to the return values, so they'll never be deallocated until the Python process exits and cleans up. This isn't very noticeable for integers, but if :func:`f` returns an object, or a data structure that takes up a lot of memory, this can be a problem.
es: Esta versión funciona para cosas simples como los enteros, pero tiene un efecto secundario; el diccionario ``_cache`` mantiene una referencia a los valores retornados, por lo que nunca serán desocupados hasta que el proceso de Python salga y se limpie. Esto no es muy notable para los enteros, pero si :func:`f` retorna un objeto, o una estructura de datos que ocupa mucha memoria, esto puede ser un problema.

source: Weak references provide a way to implement a cache that won't keep objects alive beyond their time. If an object is only accessible through weak references, the object will be deallocated and the weak references will now indicate that the object it referred to no longer exists. A weak reference to an object *obj* is created by calling ``wr = weakref.ref(obj)``. The object being referred to is returned by calling the weak reference as if it were a function: ``wr()``. It will return the referenced object, or ``None`` if the object no longer exists.
es: Las referencias débiles proporcionan una forma de implementar una caché que no mantendrá los objetos vivos más allá de su tiempo. Si un objeto sólo es accesible a través de referencias débiles, el objeto será desasignado y las referencias débiles indicarán ahora que el objeto al que se refería ya no existe. Una referencia débil a un objeto *obj* se crea llamando ``wr = weakref.ref(obj)``. El objeto al que se hace referencia se retorna llamando a la referencia débil como si fuera una función: ``wr()`` retornará el objeto referenciado, o ``None`` si el objeto ya no existe.

source: This makes it possible to write a :func:`memoize` function whose cache doesn't keep objects alive, by storing weak references in the cache. ::
es: Esto hace posible escribir una función :func:`memoize` cuya caché no mantenga objetos vivos, almacenando referencias débiles en la caché. ::

source: The :mod:`weakref` module also allows creating proxy objects which behave like weak references --- an object referenced only by proxy objects is deallocated -- but instead of requiring an explicit call to retrieve the object, the proxy transparently forwards all operations to the object as long as the object still exists. If the object is deallocated, attempting to use a proxy will cause a :exc:`weakref.ReferenceError` exception to be raised. ::
es: El módulo :mod:`weakref` también permite crear objetos proxy que se comportan como referencias débiles --- un objeto referenciado sólo por objetos proxy es desasignado - pero en lugar de requerir una llamada explícita para recuperar el objeto, el proxy reenvía de forma transparente todas las operaciones al objeto mientras éste siga existiendo. Si el objeto es desocupado, el intento de usar un proxy causará una excepción :exc:`weakref.ReferenceError`. ::

source: :pep:`205` - Weak References
es: :pep:`205` - Referencias débiles

source: Written and implemented by Fred L. Drake, Jr.
es: Escrito e implementado por Fred L. Drake, Jr.

source: PEP 232: Function Attributes
es: PEP 232: Atributos de la función

source: In Python 2.1, functions can now have arbitrary information attached to them. People were often using docstrings to hold information about functions and methods, because the ``__doc__`` attribute was the only way of attaching any information to a function. For example, in the Zope web application server, functions are marked as safe for public access by having a docstring, and in John Aycock's SPARK parsing framework, docstrings hold parts of the BNF grammar to be parsed. This overloading is unfortunate, since docstrings are really intended to hold a function's documentation; for example, it means you can't properly document functions intended for private use in Zope.
es: En Python 2.1, las funciones ahora pueden tener información arbitraria adjunta a ellas. La gente solía utilizar docstrings para mantener la información sobre las funciones y los métodos, porque el atributo ``__doc__`` era la única manera de adjuntar cualquier información a una función. Por ejemplo, en el servidor de aplicaciones web Zope, las funciones se marcan como seguras para el acceso público teniendo un docstring, y en el marco de análisis SPARK de John Aycock, los docstrings contienen partes de la gramática BNF para ser analizada. Esta sobrecarga es desafortunada, ya que los docstrings están realmente pensados para contener la documentación de una función; por ejemplo, significa que no puedes documentar adecuadamente las funciones destinadas al uso privado en Zope.

source: Arbitrary attributes can now be set and retrieved on functions using the regular Python syntax::
es: Ahora se pueden establecer y recuperar atributos arbitrarios en las funciones utilizando la sintaxis normal de Python::

source: The dictionary containing attributes can be accessed as the function's :attr:`~object.__dict__`. Unlike the :attr:`~object.__dict__` attribute of class instances, in functions you can actually assign a new dictionary to :attr:`~object.__dict__`, though the new value is restricted to a regular Python dictionary; you *can't* be tricky and set it to a :class:`UserDict` instance, or any other random object that behaves like a mapping.
es: Se puede acceder al diccionario que contiene los atributos como :attr:`~objeto.__dict__` de la función. A diferencia del atributo :attr:`~objeto.__dict__` de las instancias de clase, en las funciones se puede asignar un nuevo diccionario a :attr:`~objeto.__dict__`, aunque el nuevo valor está restringido a un diccionario normal de Python; no se puede ser complicado y establecerlo como una instancia de :class:`UserDict`, o cualquier otro objeto aleatorio que se comporte como un mapeo.

source: :pep:`232` - Function Attributes
es: :pep:`232` - Atributos de la función

source: Written and implemented by Barry Warsaw.
es: Escrito y ejecutado por Barry Warsaw.

source: PEP 235: Importing Modules on Case-Insensitive Platforms
es: PEP 235: Importación de módulos en plataformas que no distinguen entre mayúsculas y minúsculas

source: Some operating systems have filesystems that are case-insensitive, MacOS and Windows being the primary examples; on these systems, it's impossible to distinguish the filenames ``FILE.PY`` and ``file.py``, even though they do store the file's name in its original case (they're case-preserving, too).
es: Algunos sistemas operativos tienen sistemas de archivos que no distinguen entre mayúsculas y minúsculas, siendo MacOS y Windows los principales ejemplos; en estos sistemas, es imposible distinguir los nombres de archivo ``FILE.PY`` y ``file.py``, aunque almacenan el nombre del archivo en su caso original (también preservan las mayúsculas).

source: In Python 2.1, the :keyword:`import` statement will work to simulate case-sensitivity on case-insensitive platforms. Python will now search for the first case-sensitive match by default, raising an :exc:`ImportError` if no such file is found, so ``import file`` will not import a module named ``FILE.PY``. Case-insensitive matching can be requested by setting the :envvar:`PYTHONCASEOK` environment variable before starting the Python interpreter.
es: En Python 2.1, la sentencia :keyword:`import` funcionará para simular la distinción entre mayúsculas y minúsculas en plataformas que no las distinguen. Python buscará ahora la primera coincidencia entre mayúsculas y minúsculas por defecto, lanzando un :exc:`ImportError` si no se encuentra dicho fichero, por lo que ``import file`` no importará un módulo llamado ``FILE.PY``. La coincidencia insensible a mayúsculas y minúsculas puede solicitarse estableciendo la variable de entorno :envvar:`PYTHONCASEOK` antes de iniciar el intérprete de Python.

source: PEP 217: Interactive Display Hook
es: PEP 217: Gancho de pantalla interactivo

source: When using the Python interpreter interactively, the output of commands is displayed using the built-in :func:`repr` function. In Python 2.1, the variable :func:`sys.displayhook` can be set to a callable object which will be called instead of :func:`repr`. For example, you can set it to a special pretty-printing function::
es: Cuando se utiliza el intérprete de Python de forma interactiva, la salida de los comandos se muestra utilizando la función incorporada :func:`repr`. En Python 2.1, la variable :func:`sys.displayhook` puede establecerse a un objeto invocable que será llamado en lugar de :func:`repr`. Por ejemplo, puede establecerla a una función especial de impresión bonita::

source: :pep:`217` - Display Hook for Interactive Use
es: :pep:`217` - Gancho de visualización para uso interactivo

source: Written and implemented by Moshe Zadka.
es: Escrito y ejecutado por Moshe Zadka.

source: PEP 208: New Coercion Model
es: PEP 208: Nuevo modelo de coerción

source: How numeric coercion is done at the C level was significantly modified. This will only affect the authors of C extensions to Python, allowing them more flexibility in writing extension types that support numeric operations.
es: Se ha modificado significativamente la forma en que se realiza la coerción numérica a nivel de C. Esto sólo afectará a los autores de las extensiones de C a Python, permitiéndoles más flexibilidad a la hora de escribir tipos de extensión que soporten operaciones numéricas.

source: Extension types can now set the type flag ``Py_TPFLAGS_CHECKTYPES`` in their ``PyTypeObject`` structure to indicate that they support the new coercion model. In such extension types, the numeric slot functions can no longer assume that they'll be passed two arguments of the same type; instead they may be passed two arguments of differing types, and can then perform their own internal coercion. If the slot function is passed a type it can't handle, it can indicate the failure by returning a reference to the ``Py_NotImplemented`` singleton value. The numeric functions of the other type will then be tried, and perhaps they can handle the operation; if the other type also returns ``Py_NotImplemented``, then a :exc:`TypeError` will be raised. Numeric methods written in Python can also return ``Py_NotImplemented``, causing the interpreter to act as if the method did not exist (perhaps raising a :exc:`TypeError`, perhaps trying another object's numeric methods).
es: Los tipos de extensión pueden ahora establecer el indicador de tipo ``Py_TPFLAGS_CHECKTYPES`` en su estructura ``PyTypeObject`` para indicar que soportan el nuevo modelo de coerción. En tales tipos de extensión, las funciones numéricas de ranura ya no pueden asumir que se les pasarán dos argumentos del mismo tipo; en su lugar, se les pueden pasar dos argumentos de tipos diferentes, y entonces pueden realizar su propia coerción interna. Si a la función de ranura se le pasa un tipo que no puede manejar, puede indicar el fallo retornando una referencia al valor singleton ``Py_NotImplemented``. Las funciones numéricas del otro tipo serán entonces probadas, y quizás puedan manejar la operación; si el otro tipo también retorna ``Py_NotImplemented``, entonces se levantará un :exc:`TypeError`Los métodos numéricos escritos en Python también pueden retornar ``Py_NotImplemented``, haciendo que el intérprete actúe como si el método no existiera (tal vez lanzando un :exc:`TypeError`, tal vez probando los métodos numéricos de otro objeto).

source: :pep:`208` - Reworking the Coercion Model
es: :pep:`208` - Reformulación del modelo de coerción

source: Written and implemented by Neil Schemenauer, heavily based upon earlier work by Marc-André Lemburg. Read this to understand the fine points of how numeric operations will now be processed at the C level.
es: Escrito e implementado por Neil Schemenauer, basado en gran medida en el trabajo anterior de Marc-André Lemburg. Léalo para entender los puntos finos de cómo las operaciones numéricas serán ahora procesadas en el nivel C.

source: PEP 241: Metadata in Python Packages
es: PEP 241: Metadatos en paquetes de Python

source: A common complaint from Python users is that there's no single catalog of all the Python modules in existence. T. Middleton's Vaults of Parnassus at ``www.vex.net/parnassus/`` (retired in February 2009, `available in the Internet Archive Wayback Machine <https://web.archive.org/web/20090130140102/http://www.vex.net/parnassus/>`_) was the largest catalog of Python modules, but registering software at the Vaults is optional, and many people did not bother.
es: Una queja común de los usuarios de Python es que no existe un solo catálogo de todos los módulos de Python existentes. T. Middleton's Vault of Parnassus en ``www.vex.net/parnassus/`` (borrado en febrero de 2009, `disponible en Internet Archive Wayback Machine <https://web.archive.org/web/20090130140102/http://www.vex.net/parnassus/>`_) fue uno de los mayores catálogos de módulos de Python, pero registrar software en los archivos es opcional, y a mucha gente no le importó.

source: As a first small step toward fixing the problem, Python software packaged using the Distutils :command:`sdist` command will include a file named :file:`PKG-INFO` containing information about the package such as its name, version, and author (metadata, in cataloguing terminology). :pep:`241` contains the full list of fields that can be present in the :file:`PKG-INFO` file. As people began to package their software using Python 2.1, more and more packages will include metadata, making it possible to build automated cataloguing systems and experiment with them. With the result experience, perhaps it'll be possible to design a really good catalog and then build support for it into Python 2.2. For example, the Distutils :command:`sdist` and :command:`bdist_\*` commands could support an ``upload`` option that would automatically upload your package to a catalog server.
es: Como primer pequeño paso para solucionar el problema, el software de Python empaquetado con el comando :command:`sdist` de Distutils incluirá un archivo llamado :file:`PKG-INFO` que contiene información sobre el paquete, como su nombre, versión y autor (metadatos, en terminología de catalogación). :pep:`241` contiene la lista completa de campos que pueden estar presentes en el archivo :file:`PKG-INFO`A medida que la gente empiece a empaquetar su software usando Python 2.1, más y más paquetes incluirán metadatos, haciendo posible construir sistemas de catalogación automatizados y experimentar con ellosCon la experiencia resultante, tal vez sea posible diseñar un catálogo realmente bueno y luego construir soporte para él en Python 2.2. Por ejemplo, los comandos Distutils :command:`sdist` y :command:`bdist_\*` podrían soportar una opción ``upload`` que subiera automáticamente tu paquete a un servidor de catálogos.

source: You can start creating packages containing :file:`PKG-INFO` even if you're not using Python 2.1, since a new release of the Distutils will be made for users of earlier Python versions. Version 1.0.2 of the Distutils includes the changes described in :pep:`241`, as well as various bugfixes and enhancements. It will be available from the Distutils SIG at https://www.python.org/community/sigs/current/distutils-sig/.
es: Puedes empezar a crear paquetes que contengan :file:`PKG-INFO` incluso si no estás usando Python 2.1, ya que se hará una nueva versión de las Distutils para los usuarios de versiones anteriores de PythonLa versión 1.0.2 de las Distutils incluye los cambios descritos en :pep:`241`, así como varias correcciones de errores y mejoras. Estará disponible en el SIG de Distutils en https://www.python.org/community/sigs/current/distutils-sig/.

source: :pep:`241` - Metadata for Python Software Packages
es: :pep:`241` - Metadatos para paquetes de software de Python

source: :pep:`243` - Module Repository Upload Mechanism
es: :pep:`243` - Mecanismo de carga del repositorio de módulos

source: Written by Sean Reifschneider, this draft PEP describes a proposed mechanism for uploading Python packages to a central server.
es: Escrito por Sean Reifschneider, este borrador de PEP describe un mecanismo propuesto para subir paquetes de Python a un servidor central.

source: New and Improved Modules
es: Módulos nuevos y mejorados

source: Ka-Ping Yee contributed two new modules: :mod:`inspect.py`, a module for getting information about live Python code, and :mod:`pydoc.py`, a module for interactively converting docstrings to HTML or text. As a bonus, :file:`Tools/scripts/pydoc`, which is now automatically installed, uses :mod:`pydoc.py` to display documentation given a Python module, package, or class name. For example, ``pydoc xml.dom`` displays the following::
es: Ka-Ping Yee ha contribuido con dos nuevos módulos: :mod:`inspect.py`, un módulo para obtener información sobre código Python en vivo, y :mod:`pydoc.py`, un módulo para convertir interactivamente docstrings a HTML o texto. Además, :file:`Tools/scripts/pydoc`, que se instala automáticamente, utiliza :mod:`pydoc.py` para mostrar la documentación de un módulo, paquete o clase de Python. Por ejemplo, ``pydoc xml.dom`` muestra lo siguiente::

source: :file:`pydoc` also includes a Tk-based interactive help browser. :file:`pydoc` quickly becomes addictive; try it out!
es: :file:`pydoc` también incluye un navegador de ayuda interactiva basado en Tk. :file:`pydoc` se vuelve rápidamente adictivo; ¡pruébalo!
