Repository: python/python-docs-es
Catalog: whatsnew/2.1.po
Languages: es

source: What's New in Python 2.1
es: Qué hay de nuevo en Python 2.1

source: Author
es: Autor

source: Introduction
es: Introducción

source: This article explains the new features in Python 2.1. While there aren't as many changes in 2.1 as there were in Python 2.0, there are still some pleasant surprises in store. 2.1 is the first release to be steered through the use of Python Enhancement Proposals, or PEPs, so most of the sizable changes have accompanying PEPs that provide more complete documentation and a design rationale for the change. This article doesn't attempt to document the new features completely, but simply provides an overview of the new features for Python programmers. Refer to the Python 2.1 documentation, or to the specific PEP, for more details about any new feature that particularly interests you.
es: Este artículo explica las nuevas características de Python 2.1. Aunque no hay tantos cambios en 2.1 como en Python 2.0, todavía hay algunas sorpresas agradables. La versión 2.1 es la primera que se dirige mediante el uso de Propuestas de Mejora de Python, o PEPs, por lo que la mayoría de los cambios importantes tienen PEPs adjuntos que proporcionan una documentación más completa y una justificación de diseño para el cambio. Este artículo no intenta documentar las nuevas características por completo, sino que simplemente proporciona una visión general de las nuevas características para los programadores de Python. Consulta la documentación de Python 2.1, o el PEP específico, para obtener más detalles sobre cualquier nueva característica que te interese particularmente.

source: One recent goal of the Python development team has been to accelerate the pace of new releases, with a new release coming every 6 to 9 months. 2.1 is the first release to come out at this faster pace, with the first alpha appearing in January, 3 months after the final version of 2.0 was released.
es: Un objetivo reciente del equipo de desarrollo de Python ha sido acelerar el ritmo de las nuevas versiones, con una nueva versión cada 6 a 9 meses. La versión 2.1 es la primera que sale a este ritmo más rápido, con la primera alfa que apareció en enero, 3 meses después de que se publicara la versión final de la 2.0.

source: The final release of Python 2.1 was made on April 17, 2001.
es: La versión final de Python 2.1 se realizó el 17 de abril de 2001.

source: PEP 227: Nested Scopes
es: PEP 227: Ámbitos anidados

source: The largest change in Python 2.1 is to Python's scoping rules. In Python 2.0, at any given time there are at most three namespaces used to look up variable names: local, module-level, and the built-in namespace. This often surprised people because it didn't match their intuitive expectations. For example, a nested recursive function definition doesn't work::
es: El mayor cambio en Python 2.1 es el de las reglas de alcance de Python. En Python 2.0, en cualquier momento hay como máximo tres espacios de nombres utilizados para buscar nombres de variables: local, a nivel de módulo y el espacio de nombres incorporado. Esto a menudo sorprendía a la gente porque no coincidía con sus expectativas intuitivas. Por ejemplo, una definición de función recursiva anidada no funciona::

source: The function :func:`g` will always raise a :exc:`NameError` exception, because the binding of the name ``g`` isn't in either its local namespace or in the module-level namespace. This isn't much of a problem in practice (how often do you recursively define interior functions like this?), but this also made using the :keyword:`lambda` expression clumsier, and this was a problem in practice. In code which uses :keyword:`lambda` you can often find local variables being copied by passing them as the default values of arguments. ::
es: La función :func:`g` siempre lanzará una excepción :exc:`NameError`, porque el enlace del nombre ``g`` no está ni en su espacio de nombres local ni en el espacio de nombres a nivel de módulo. Esto no es un gran problema en la práctica (¿con qué frecuencia se definen recursivamente funciones interiores como ésta?), pero esto también hacía más torpe el uso de la expresión :keyword:`lambda`, y esto era un problema en la práctica. En el código que utiliza :keyword:`lambda` a menudo se pueden encontrar variables locales que se copian al pasarlas como valores por defecto de los argumentos. ::

source: The readability of Python code written in a strongly functional style suffers greatly as a result.
es: La legibilidad del código Python escrito en un estilo fuertemente funcional sufre mucho como resultado.

source: The most significant change to Python 2.1 is that static scoping has been added to the language to fix this problem. As a first effect, the ``name=name`` default argument is now unnecessary in the above example. Put simply, when a given variable name is not assigned a value within a function (by an assignment, or the :keyword:`def`, :keyword:`class`, or :keyword:`import` statements), references to the variable will be looked up in the local namespace of the enclosing scope. A more detailed explanation of the rules, and a dissection of the implementation, can be found in the PEP.
es: El cambio más significativo de Python 2.1 es que se ha añadido al lenguaje el ámbito estático para solucionar este problema. Como primer efecto, el argumento por defecto ``name=name`` es ahora innecesario en el ejemplo anterior. En pocas palabras, cuando a un nombre de variable dado no se le asigna un valor dentro de una función (mediante una asignación, o las sentencias :keyword:`def`, :keyword:`class`, o :keyword:`import`), las referencias a la variable se buscarán en el espacio de nombres local del ámbito que la rodea. Puede encontrar una explicación más detallada de las reglas y una disección de la implementación en el PEP.

source: This change may cause some compatibility problems for code where the same variable name is used both at the module level and as a local variable within a function that contains further function definitions. This seems rather unlikely though, since such code would have been pretty confusing to read in the first place.
es: Este cambio puede causar algunos problemas de compatibilidad para el código en el que el mismo nombre de variable se utiliza tanto a nivel de módulo como de variable local dentro de una función que contiene otras definiciones de función. Sin embargo, esto parece bastante improbable, ya que dicho código habría sido bastante confuso de leer en primer lugar.

source: One side effect of the change is that the ``from module import *`` and ``exec`` statements have been made illegal inside a function scope under certain conditions. The Python reference manual has said all along that ``from module import *`` is only legal at the top level of a module, but the CPython interpreter has never enforced this before. As part of the implementation of nested scopes, the compiler which turns Python source into bytecodes has to generate different code to access variables in a containing scope. ``from module import *`` and ``exec`` make it impossible for the compiler to figure this out, because they add names to the local namespace that are unknowable at compile time. Therefore, if a function contains function definitions or :keyword:`lambda` expressions with free variables, the compiler will flag this by raising a :exc:`SyntaxError` exception.
es: Un efecto secundario del cambio es que las sentencias ``from module import *`` y ``exec`` se han hecho ilegales dentro del ámbito de una función bajo ciertas condiciones. El manual de referencia de Python ha dicho todo el tiempo que ``from module import *`` sólo es legal en el nivel superior de un módulo, pero el intérprete de CPython nunca ha aplicado esto antes. Como parte de la implementación de los ámbitos anidados, el compilador que convierte el código fuente de Python en bytecodes tiene que generar un código diferente para acceder a las variables de un ámbito contenedor. Los códigos ``from module import *`` y ``exec`` hacen que el compilador no pueda averiguar esto, porque añaden nombres al espacio de nombres local que son desconocidos en tiempo de compilación. Por lo tanto, si una función contiene definiciones de funciones o expresiones :keyword:`lambda` con variables libres, el compilador lo señalará lanzando una excepción :exc:`SyntaxError`.

source: To make the preceding explanation a bit clearer, here's an example::
es: Para que la explicación anterior quede un poco más clara, he aquí un ejemplo::

source: Line 4 containing the ``exec`` statement is a syntax error, since ``exec`` would define a new local variable named ``x`` whose value should be accessed by :func:`g`.
es: La línea 4 que contiene la sentencia ``exec`` es un error de sintaxis, ya que ``exec`` definiría una nueva variable local llamada ``x`` cuyo valor debería ser accedido por :func:`g`.

source: This shouldn't be much of a limitation, since ``exec`` is rarely used in most Python code (and when it is used, it's often a sign of a poor design anyway).
es: Esto no debería ser una gran limitación, ya que ``exec`` rara vez se utiliza en la mayoría del código de Python (y cuando se utiliza, a menudo es un signo de un mal diseño de todos modos).

source: Compatibility concerns have led to nested scopes being introduced gradually; in Python 2.1, they aren't enabled by default, but can be turned on within a module by using a future statement as described in :pep:`236`. (See the following section for further discussion of :pep:`236`.) In Python 2.2, nested scopes will become the default and there will be no way to turn them off, but users will have had all of 2.1's lifetime to fix any breakage resulting from their introduction.
es: Los problemas de compatibilidad han llevado a que los ámbitos anidados se introduzcan gradualmente; en Python 2.1, no están habilitados por defecto, pero pueden activarse dentro de un módulo utilizando una sentencia future como se describe en :pep:`236`. (En Python 2.2, los ámbitos anidados se convertirán en el valor por defecto y no habrá forma de desactivarlos, pero los usuarios habrán tenido toda la vida de la versión 2.1 para arreglar cualquier rotura resultante de su introducción.

source: :pep:`227` - Statically Nested Scopes
es: :pep:`227` - Ámbitos anidados estáticamente

source: Written and implemented by Jeremy Hylton.
es: Escrito e implementado por Jeremy Hylton.

source: PEP 236: __future__ Directives
es: PEP 236: Directivas __future__

source: The reaction to nested scopes was widespread concern about the dangers of breaking code with the 2.1 release, and it was strong enough to make the Pythoneers take a more conservative approach. This approach consists of introducing a convention for enabling optional functionality in release N that will become compulsory in release N+1.
es: La reacción a los ámbitos anidados fue una preocupación generalizada sobre los peligros de romper el código con la versión 2.1, y fue lo suficientemente fuerte como para que los Pythonistas adoptaran un enfoque más conservador. Este enfoque consiste en introducir una convención para habilitar una funcionalidad opcional en la versión N que se convertirá en obligatoria en la versión N+1.

source: The syntax uses a ``from...import`` statement using the reserved module name :mod:`__future__`. Nested scopes can be enabled by the following statement::
es: La sintaxis utiliza una sentencia ``from...import`` utilizando el nombre de módulo reservado :mod:`__future__`. Los ámbitos anidados pueden habilitarse mediante la siguiente sentencia::

source: While it looks like a normal :keyword:`import` statement, it's not; there are strict rules on where such a future statement can be put. They can only be at the top of a module, and must precede any Python code or regular :keyword:`!import` statements. This is because such statements can affect how the Python bytecode compiler parses code and generates bytecode, so they must precede any statement that will result in bytecodes being produced.
es: Aunque parece una sentencia :keyword:`import` normal, no lo es; hay reglas estrictas sobre dónde se puede poner una sentencia future. Sólo pueden estar en la parte superior de un módulo, y deben preceder a cualquier código Python o a las sentencias :keyword:`!import` normales. Esto se debe a que tales declaraciones pueden afectar a la forma en que el compilador de código de bytes de Python analiza el código y genera el código de bytes, por lo que deben preceder a cualquier declaración que dé lugar a la producción de códigos de bytes.

source: :pep:`236` - Back to the :mod:`__future__`
es: :pep:`236` - De vuelta al :mod:`__future__`

source: Written by Tim Peters, and primarily implemented by Jeremy Hylton.
es: Escrito por Tim Peters, y ejecutado principalmente por Jeremy Hylton.

source: PEP 207: Rich Comparisons
es: PEP 207: Comparaciones Enriquecidas

source: In earlier versions, Python's support for implementing comparisons on user-defined classes and extension types was quite simple. Classes could implement a :meth:`__cmp__` method that was given two instances of a class, and could only return 0 if they were equal or +1 or -1 if they weren't; the method couldn't raise an exception or return anything other than a Boolean value. Users of Numeric Python often found this model too weak and restrictive, because in the number-crunching programs that numeric Python is used for, it would be more useful to be able to perform elementwise comparisons of two matrices, returning a matrix containing the results of a given comparison for each element. If the two matrices are of different sizes, then the compare has to be able to raise an exception to signal the error.
es: En versiones anteriores, el soporte de Python para implementar comparaciones en clases definidas por el usuario y tipos de extensión era bastante simple. Las clases podían implementar un método :meth:`__cmp__` al que se le daban dos instancias de una clase, y sólo podía retornar 0 si eran iguales o +1 o -1 si no lo eran; el método no podía lanzar una excepción ni retornar nada más que un valor booleano. Los usuarios de Python Numérico a menudo encontraban este modelo demasiado débil y restrictivo, porque en los programas de cálculo de números para los que se utiliza Numeric Python, sería más útil poder realizar comparaciones por elementos de dos matrices, retornando una matriz que contenga los resultados de una comparación dada para cada elemento. Si las dos matrices son de diferente tamaño, entonces el comparador tiene que ser capaz de lanzar una excepción para señalar el error.

source: In Python 2.1, rich comparisons were added in order to support this need. Python classes can now individually overload each of the ``<``, ``<=``, ``>``, ``>=``, ``==``, and ``!=`` operations. The new magic method names are:
es: En Python 2.1, se añadieron comparaciones enriquecidas para dar soporte a esta necesidad. Las clases de Python pueden ahora sobrecargar individualmente cada una de las operaciones ``<``, ``<=``, ``>``, ``>=``, ``==`` y ``!=``. Los nuevos nombres de métodos mágicos son:

source: Operation
es: Operación

source: Method name
es: Nombre del método

source: (The magic methods are named after the corresponding Fortran operators ``.LT.``. ``.LE.``, &c. Numeric programmers are almost certainly quite familiar with these names and will find them easy to remember.)
es: (Los métodos mágicos se denominan como los correspondientes operadores de Fortran ``.LT.``. ``.LE.``, &c. Los programadores numéricos están casi seguramente bastante familiarizados con estos nombres y los encontrarán fáciles de recordar.)

source: Each of these magic methods is of the form ``method(self, other)``, where ``self`` will be the object on the left-hand side of the operator, while ``other`` will be the object on the right-hand side. For example, the expression ``A < B`` will cause ``A.__lt__(B)`` to be called.
es: Cada uno de estos métodos mágicos tiene la forma ``method(self, other)``, donde ``self`` será el objeto que se encuentre en el lado izquierdo del operador, mientras que ``other`` será el objeto que se encuentre en el lado derecho. Por ejemplo, la expresión ``A < B`` hará que se llame a ``A.__lt__(B)``.

source: Each of these magic methods can return anything at all: a Boolean, a matrix, a list, or any other Python object. Alternatively they can raise an exception if the comparison is impossible, inconsistent, or otherwise meaningless.
es: Cada uno de estos métodos mágicos puede retornar cualquier cosa: un booleano, una matriz, una lista o cualquier otro objeto de Python. También pueden lanzar una excepción si la comparación es imposible, inconsistente o no tiene sentido.

source: The built-in ``cmp(A,B)`` function can use the rich comparison machinery, and now accepts an optional argument specifying which comparison operation to use; this is given as one of the strings ``"<"``, ``"<="``, ``">"``, ``">="``, ``"=="``, or ``"!="``. If called without the optional third argument, :func:`cmp` will only return -1, 0, or +1 as in previous versions of Python; otherwise it will call the appropriate method and can return any Python object.
es: La función incorporada ``cmp(A,B)`` puede utilizar la comparación enriquecida, y ahora acepta un argumento opcional que especifica la operación de comparación a utilizar; esto se da como una de las cadenas ``"<"``, ``"<="``, ``">"``, ``">="``, ``"=="``, o ``"!="``. Si se llama sin el tercer argumento opcional, :func:`cmp` sólo retornará -1, 0 o +1 como en versiones anteriores de Python; en caso contrario, llamará al método apropiado y puede retornar cualquier objeto de Python.

source: There are also corresponding changes of interest to C programmers; there's a new slot ``tp_richcmp`` in type objects and an API for performing a given rich comparison. I won't cover the C API here, but will refer you to :pep:`207`, or to 2.1's C API documentation, for the full list of related functions.
es: También hay cambios correspondientes de interés para los programadores de C; hay una nueva ranura ``tp_richcmp`` en los objetos de tipo y una API para realizar una comparación rica determinada. No cubrirá la API de C aquí, sino que le remitiré a :pep:`207`, o a la documentación de la API de C de 2.1, para la lista completa de funciones relacionadas.

source: :pep:`207` - Rich Comparisons
es: :pep:`207` - Comparaciones enriquecidas

source: Written by Guido van Rossum, heavily based on earlier work by David Ascher, and implemented by Guido van Rossum.
es: Escrito por Guido van Rossum, basado en gran medida en un trabajo anterior de David Ascher, e implementado por Guido van Rossum.

source: PEP 230: Warning Framework
es: PEP 230: Marco de advertencia

source: Over its 10 years of existence, Python has accumulated a certain number of obsolete modules and features along the way. It's difficult to know when a feature is safe to remove, since there's no way of knowing how much code uses it --- perhaps no programs depend on the feature, or perhaps many do. To enable removing old features in a more structured way, a warning framework was added. When the Python developers want to get rid of a feature, it will first trigger a warning in the next version of Python. The following Python version can then drop the feature, and users will have had a full release cycle to remove uses of the old feature.
es: A lo largo de sus 10 años de existencia, Python ha acumulado un cierto número de módulos y características obsoletas en el camino. Es difícil saber cuándo es seguro eliminar una característica, ya que no hay manera de saber cuánto código la utiliza --- tal vez ningún programa depende de la característica, o tal vez muchos lo hacen. Para permitir la eliminación de características antiguas de una manera más estructurada, se añadió un marco de advertencia. Cuando los desarrolladores de Python quieran deshacerse de una característica, primero se activará una advertencia en la siguiente versión de Python. La siguiente versión de Python puede entonces eliminar la característica, y los usuarios habrán tenido un ciclo de lanzamiento completo para eliminar los usos de la antigua característica.

source: Python 2.1 adds the warning framework to be used in this scheme. It adds a :mod:`warnings` module that provide functions to issue warnings, and to filter out warnings that you don't want to be displayed. Third-party modules can also use this framework to deprecate old features that they no longer wish to support.
es: Python 2.1 añade el marco de trabajo de las advertencias para ser utilizado en este esquema. Añade un módulo :mod:`warnings` que proporciona funciones para emitir advertencias, y para filtrar las advertencias que no se quieren mostrar. Los módulos de terceros también pueden utilizar este marco de trabajo para dejar de lado funciones antiguas que ya no desean soportar.

source: For example, in Python 2.1 the :mod:`regex` module is deprecated, so importing it causes a warning to be printed::
es: Por ejemplo, en Python 2.1 el módulo :mod:`regex` está obsoleto, por lo que al importarlo se imprime una advertencia::

source: Warnings can be issued by calling the :func:`warnings.warn` function::
es: Las advertencias se pueden emitir llamando a la función :func:`warnings.warn`::

source: The first parameter is the warning message; an additional optional parameters can be used to specify a particular warning category.
es: El primer parámetro es el mensaje de advertencia; se pueden utilizar otros parámetros opcionales para especificar una categoría de advertencia concreta.

source: Filters can be added to disable certain warnings; a regular expression pattern can be applied to the message or to the module name in order to suppress a warning. For example, you may have a program that uses the :mod:`regex` module and not want to spare the time to convert it to use the :mod:`re` module right now. The warning can be suppressed by calling ::
es: Se pueden añadir filtros para desactivar ciertas advertencias; se puede aplicar un patrón de expresión regular al mensaje o al nombre del módulo para suprimir una advertencia. Por ejemplo, puede tener un programa que utilice el módulo :mod:`regex` y no querer dedicar tiempo a convertirlo para que utilice el módulo :mod:`re` en este momento. La advertencia puede suprimirse llamando a ::

source: This adds a filter that will apply only to warnings of the class :class:`DeprecationWarning` triggered in the :mod:`__main__` module, and applies a regular expression to only match the message about the :mod:`regex` module being deprecated, and will cause such warnings to be ignored. Warnings can also be printed only once, printed every time the offending code is executed, or turned into exceptions that will cause the program to stop (unless the exceptions are caught in the usual way, of course).
es: Esto añade un filtro que se aplicará sólo a las advertencias de la clase :class:`DeprecationWarning` lanzadas en el módulo :mod:`__main__`, y aplica una expresión regular para que sólo coincida con el mensaje sobre el módulo :mod:`regex` que está obsoleto, y hará que tales advertencias sean ignoradas. Las advertencias también pueden imprimirse sólo una vez, imprimirse cada vez que se ejecute el código infractor, o convertirse en excepciones que harán que el programa se detenga (a menos que las excepciones se atrapen de la forma habitual, por supuesto).

source: Functions were also added to Python's C API for issuing warnings; refer to PEP 230 or to Python's API documentation for the details.
es: También se agregaron funciones a la API de C de Python para emitir advertencias; consulte el PEP 230 o la documentación de la API de Python para conocer los detalles.

source: :pep:`5` - Guidelines for Language Evolution
es: :pep:`5` - Directrices para la evolución del lenguaje
