Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: What's New in Python 2.3
es: Qué hay de nuevo en Python 2.3

source: Author
es: Autor

source: This article explains the new features in Python 2.3. Python 2.3 was released on July 29, 2003.
es: Este artículo explica las nuevas características de Python 2.3. Python 2.3 se publicó el 29 de julio de 2003.

source: The main themes for Python 2.3 are polishing some of the features added in 2.2, adding various small but useful enhancements to the core language, and expanding the standard library. The new object model introduced in the previous version has benefited from 18 months of bugfixes and from optimization efforts that have improved the performance of new-style classes. A few new built-in functions have been added such as :func:`sum` and :func:`enumerate`. The :keyword:`in` operator can now be used for substring searches (e.g. ``"ab" in "abc"`` returns :const:`True`).
es: Los temas principales de Python 2.3 son el pulido de algunas de las características añadidas en la 2.2, la adición de varias mejoras pequeñas pero útiles al núcleo del lenguaje y la ampliación de la biblioteca estándar. El nuevo modelo de objetos introducido en la versión anterior se ha beneficiado de 18 meses de correcciones de errores y de esfuerzos de optimización que han mejorado el rendimiento de las clases de nuevo estilo. Se han añadido algunas funciones incorporadas, como :func:`sum` y :func:`enumerate`. El operador :keyword:`in` puede utilizarse ahora para búsquedas de subcadenas (por ejemplo, ``"ab" en "abc"`` retorna :const:`True`).

source: Some of the many new library features include Boolean, set, heap, and date/time data types, the ability to import modules from ZIP-format archives, metadata support for the long-awaited Python catalog, an updated version of IDLE, and modules for logging messages, wrapping text, parsing CSV files, processing command-line options, using BerkeleyDB databases... the list of new and enhanced modules is lengthy.
es: Algunas de las nuevas características de la biblioteca son los tipos de datos booleanos, de conjunto, de montón y de fecha/hora, la posibilidad de importar módulos desde archivos con formato ZIP, el soporte de metadatos para el tan esperado catálogo de Python, una versión actualizada de IDLE y módulos para registrar mensajes, envolver texto, analizar archivos CSV, procesar opciones de línea de comandos, utilizar bases de datos BerkeleyDB... la lista de módulos nuevos y mejorados es larga.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.3, such as the Python Library Reference and the Python Reference Manual. If you want to understand the complete implementation and design rationale, refer to the PEP for a particular new feature.
es: Este artículo no pretende proporcionar una especificación completa de las nuevas características, sino que proporciona una visión general conveniente. Para obtener todos los detalles, debes consultar la documentación de Python 2.3, como la Referencia de la Biblioteca de Python y el Manual de Referencia de Python. Si quieres entender la implementación completa y los fundamentos del diseño, consulta el PEP de una nueva característica en particular.

source: PEP 218: A Standard Set Datatype
es: PEP 218: Un tipo de datos de conjunto estándar

source: The new :mod:`sets` module contains an implementation of a set datatype. The :class:`Set` class is for mutable sets, sets that can have members added and removed. The :class:`ImmutableSet` class is for sets that can't be modified, and instances of :class:`ImmutableSet` can therefore be used as dictionary keys. Sets are built on top of dictionaries, so the elements within a set must be hashable.
es: El nuevo módulo :mod:`sets` contiene una implementación de un tipo de datos de conjuntos. La clase :class:`Set` es para conjuntos mutables, conjuntos a los que se les pueden añadir y eliminar miembros. La clase :class:`ImmutableSet` es para los conjuntos que no pueden ser modificados, y las instancias de :class:`ImmutableSet` pueden por lo tanto ser utilizadas como claves de diccionario. Los conjuntos se construyen sobre diccionarios, por lo que los elementos de un conjunto deben ser hashables.

source: Here's a simple example::
es: Aquí hay un ejemplo simple::

source: The union and intersection of sets can be computed with the :meth:`union` and :meth:`intersection` methods; an alternative notation uses the bitwise operators ``&`` and ``|``. Mutable sets also have in-place versions of these methods, :meth:`union_update` and :meth:`intersection_update`. ::
es: La unión y la intersección de los conjuntos pueden calcularse con los métodos :meth:`union` y :meth:`intersection`; una notación alternativa utiliza los operadores bitácora ``&`` y ``|``. Los conjuntos mutables también tienen versiones in situ de estos métodos, :meth:`union_update` y :meth:`intersection_update`. ::

source: It's also possible to take the symmetric difference of two sets. This is the set of all elements in the union that aren't in the intersection. Another way of putting it is that the symmetric difference contains all elements that are in exactly one set. Again, there's an alternative notation (``^``), and an in-place version with the ungainly name :meth:`symmetric_difference_update`. ::
es: También es posible tomar la diferencia simétrica de dos conjuntos. Este es el conjunto de todos los elementos de la unión que no están en la intersección. Otra forma de decirlo es que la diferencia simétrica contiene todos los elementos que están exactamente en un conjunto. De nuevo, existe una notación alternativa (``^``), y una versión in-place con el poco agraciado nombre :meth:`symmetric_difference_update`. ::

source: There are also :meth:`issubset` and :meth:`issuperset` methods for checking whether one set is a subset or superset of another::
es: También hay métodos :meth:`issubset` y :meth:`issuperset` para comprobar si un conjunto es subconjunto o superconjunto de otro::

source: :pep:`218` - Adding a Built-In Set Object Type
es: :pep:`218` - Añadiendo un tipo de objeto de conjunto incorporado

source: PEP written by Greg V. Wilson. Implemented by Greg V. Wilson, Alex Martelli, and GvR.
es: PEP escrito por Greg V. Wilson. Implementado por Greg V. Wilson, Alex Martelli y GvR.

source: PEP 255: Simple Generators
es: PEP 255: Generadores simples

source: In Python 2.2, generators were added as an optional feature, to be enabled by a ``from __future__ import generators`` directive. In 2.3 generators no longer need to be specially enabled, and are now always present; this means that :keyword:`yield` is now always a keyword. The rest of this section is a copy of the description of generators from the "What's New in Python 2.2" document; if you read it back when Python 2.2 came out, you can skip the rest of this section.
es: En Python 2.2, los generadores se añadieron como una característica opcional, que se activaba mediante una directiva ``from __future__ import generators``. En 2.3 los generadores ya no necesitan ser habilitados especialmente, y ahora están siempre presentes; esto significa que :keyword:`yield` es ahora siempre una palabra clave. El resto de esta sección es una copia de la descripción de los generadores del documento "What's New in Python 2.2"; si lo leíste cuando salió Python 2.2, puedes saltarte el resto de esta sección.

source: You're doubtless familiar with how function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a :keyword:`return` statement, the local variables are destroyed and the resulting value is returned to the caller. A later call to the same function will get a fresh new set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
es: Sin duda estás familiarizado con cómo funcionan las llamadas a funciones en Python o C. Cuando llamas a una función, ésta obtiene un espacio de nombres privado donde se crean sus variables locales. Cuando la función llega a una declaración :keyword:`return`, las variables locales se destruyen y el valor resultante se retorna a quien la llamó. Una llamada posterior a la misma función obtendrá un nuevo conjunto de variables locales. Pero, ¿qué pasaría si las variables locales no se tiraran al salir de una función? ¿Qué pasaría si pudieras reanudar la función donde la dejaste? Esto es lo que proporcionan los generadores; se puede pensar en ellos como funciones reanudables.

source: Here's the simplest example of a generator function::
es: Este es el ejemplo más sencillo de una función generadora::

source: A new keyword, :keyword:`yield`, was introduced for generators. Any function containing a :keyword:`!yield` statement is a generator function; this is detected by Python's bytecode compiler which compiles the function specially as a result.
es: Se ha introducido una nueva palabra clave, :keyword:`yield`, para los generadores. Cualquier función que contenga una declaración :keyword:`!yield` es una función generadora; esto es detectado por el compilador de código de bits de Python que compila la función especialmente como resultado.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the :keyword:`yield` statement, the generator outputs the value of ``i``, similar to a :keyword:`return` statement. The big difference between :keyword:`!yield` and a :keyword:`!return` statement is that on reaching a :keyword:`!yield` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's ``.next()`` method, the function will resume executing immediately after the :keyword:`!yield` statement. (For complicated reasons, the :keyword:`!yield` statement isn't allowed inside the :keyword:`try` block of a :keyword:`!try`...\ :keyword:`!finally` statement; read :pep:`255` for a full explanation of the interaction between :keyword:`!yield` and exceptions.)
es: Cuando se llama a una función generadora, ésta no retorna un único valor, sino que retorna un objeto generador que soporta el protocolo de los iteradores. Al ejecutar la sentencia :keyword:`yield`, el generador retorna el valor de ``i``, de forma similar a una sentencia :keyword:`return`. La gran diferencia entre :keyword:`!yield` y una sentencia :keyword:`!return` es que al llegar a una sentencia :keyword:`!yield` se suspende el estado de ejecución del generador y se conservan las variables locales. En la siguiente llamada al método ``.next()`` del generador, la función se reanudará la ejecución inmediatamente después de la sentencia :keyword:`!yield`. (Por razones complicadas, la sentencia :keyword:`!yield` no está permitida dentro del bloque :keyword:`try` de una sentencia :keyword:`!try`...`; lea :pep:`255` para una explicación completa de la interacción entre :keyword:`!yield` y las excepciones)

source: Here's a sample usage of the :func:`generate_ints` generator::
es: Este es un ejemplo de uso del generador :func:`generate_ints`::

source: You could equally write ``for i in generate_ints(5)``, or ``a,b,c = generate_ints(3)``.
es: También podrías escribir ``for i in generate_ints(5)``, o ``a,b,c = generate_ints(3)``.

source: Inside a generator function, the :keyword:`return` statement can only be used without a value, and signals the end of the procession of values; afterwards the generator cannot return any further values. :keyword:`!return` with a value, such as ``return 5``, is a syntax error inside a generator function. The end of the generator's results can also be indicated by raising :exc:`StopIteration` manually, or by just letting the flow of execution fall off the bottom of the function.
es: Dentro de una función generadora, la expresión :keyword:`return` sólo puede usarse sin un valor, y señala el final de la procesión de valores; después el generador no puede retornar más valores. :keyword:`!return` con un valor, como ``return 5``, es un error de sintaxis dentro de una función generadora. El final de los resultados del generador también puede indicarse levantando manualmente :exc:`StopIteration`, o simplemente dejando que el flujo de ejecución caiga en el fondo de la función.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`next` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class would be much messier. :file:`Lib/test/test_generators.py` contains a number of more interesting examples. The simplest one implements an in-order traversal of a tree using generators recursively. ::
es: Puedes conseguir el efecto de los generadores manualmente escribiendo tu propia clase y almacenando todas las variables locales del generador como variables de instancia. Por ejemplo, la devolución de una lista de enteros podría hacerse estableciendo ``self.count`` a 0, y haciendo que el método :meth:`next` incremente ``self.count`` y lo retorne. Sin embargo, para un generador medianamente complicado, escribir la clase correspondiente sería mucho más complicado. :file:`Lib/test/test_generators.py` contiene varios ejemplos más interesantes. El más sencillo implementa un recorrido en orden de un árbol utilizando generadores de forma recursiva ::

source: Two other examples in :file:`Lib/test/test_generators.py` produce solutions for the N-Queens problem (placing $N$ queens on an $NxN$ chess board so that no queen threatens another) and the Knight's Tour (a route that takes a knight to every square of an $NxN$ chessboard without visiting any square twice).
es: Otros dos ejemplos en :file:`Lib/test/test_generators.py` producen soluciones para el problema de las N reinas (colocar $N$ reinas en un tablero de ajedrez $NxN$ de forma que ninguna reina amenace a otra) y el recorrido del caballero (una ruta que lleva a un caballo a cada casilla de un tablero de ajedrez $NxN$ sin visitar ninguna casilla dos veces).

source: The idea of generators comes from other programming languages, especially Icon (https://www2.cs.arizona.edu/icon/), where the idea of generators is central. In Icon, every expression and function call behaves like a generator. One example from "An Overview of the Icon Programming Language" at https://www2.cs.arizona.edu/icon/docs/ipd266.htm gives an idea of what this looks like::
es: La idea de los generadores proviene de otros lenguajes de programación, especialmente de Icon (https://www2.cs.arizona.edu/icon/), donde la idea de los generadores es fundamental. En Icon, cada expresión y llamada a una función se comporta como un generador. Un ejemplo de "*An Overview of the Icon Programming Language*" en https://www2.cs.arizona.edu/icon/docs/ipd266.htm da una idea de cómo es esto::

source: In Icon the :func:`find` function returns the indexes at which the substring "or" is found: 3, 23, 33. In the :keyword:`if` statement, ``i`` is first assigned a value of 3, but 3 is less than 5, so the comparison fails, and Icon retries it with the second value of 23. 23 is greater than 5, so the comparison now succeeds, and the code prints the value 23 to the screen.
es: En Icon la función :func:`find` retorna los índices en los que se encuentra la subcadena "o": 3, 23, 33. En la expresión :keyword:`if`, a ``i`` se le asigna primero un valor de 3, pero 3 es menor que 5, por lo que la comparación falla, e Icon la reintenta con el segundo valor de 23. 23 es mayor que 5, por lo que la comparación ahora tiene éxito, y el código imprime el valor 23 en la pantalla.

source: Python doesn't go nearly as far as Icon in adopting generators as a central concept. Generators are considered part of the core Python language, but learning or using them isn't compulsory; if they don't solve any problems that you have, feel free to ignore them. One novel feature of Python's interface as compared to Icon's is that a generator's state is represented as a concrete object (the iterator) that can be passed around to other functions or stored in a data structure.
es: Python no va tan lejos como Icon en la adopción de generadores como concepto central. Los generadores se consideran parte del núcleo del lenguaje Python, pero aprenderlos o utilizarlos no es obligatorio; si no resuelven ningún problema que tengas, siéntete libre de ignorarlos. Una característica novedosa de la interfaz de Python en comparación con la de Icon es que el estado de un generador se representa como un objeto concreto (el iterador) que puede pasarse a otras funciones o almacenarse en una estructura de datos.

source: :pep:`255` - Simple Generators
es: :pep:`255` - Generadores simples

source: Written by Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implemented mostly by Neil Schemenauer and Tim Peters, with other fixes from the Python Labs crew.
es: Escrito por Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implementado principalmente por Neil Schemenauer y Tim Peters, con otras correcciones del equipo de Python Labs.

source: PEP 263: Source Code Encodings
es: PEP 263: Codificación del código fuente

source: Python source files can now be declared as being in different character set encodings. Encodings are declared by including a specially formatted comment in the first or second line of the source file. For example, a UTF-8 file can be declared with::
es: Los archivos fuente de Python ahora pueden declararse con diferentes codificaciones de conjuntos de caracteres. Las codificaciones se declaran incluyendo un comentario con formato especial en la primera o segunda línea del archivo fuente. Por ejemplo, un archivo UTF-8 puede declararse con::

source: Without such an encoding declaration, the default encoding used is 7-bit ASCII. Executing or importing modules that contain string literals with 8-bit characters and have no encoding declaration will result in a :exc:`DeprecationWarning` being signalled by Python 2.3; in 2.4 this will be a syntax error.
es: Sin esta declaración de codificación, la codificación por defecto utilizada es ASCII de 7 bits. Ejecutar o importar módulos que contengan literales de cadena con caracteres de 8 bits y que no tengan una declaración de codificación dará lugar a un :exc:`DeprecationWarning` señalado por Python 2.3; en 2.4 será un error de sintaxis.

source: The encoding declaration only affects Unicode string literals, which will be converted to Unicode using the specified encoding. Note that Python identifiers are still restricted to ASCII characters, so you can't have variable names that use characters outside of the usual alphanumerics.
es: La declaración de codificación sólo afecta a los literales de cadena Unicode, que se convertirán a Unicode utilizando la codificación especificada. Ten en cuenta que los identificadores de Python siguen restringidos a caracteres ASCII, por lo que no puedes tener nombres de variables que utilicen caracteres fuera de los alfanuméricos habituales.

source: :pep:`263` - Defining Python Source Code Encodings
es: :pep:`263` - Definición de las codificaciones del código fuente de Python

source: Written by Marc-André Lemburg and Martin von Löwis; implemented by Suzuki Hisao and Martin von Löwis.
es: Escrito por Marc-André Lemburg y Martin von Löwis; realizado por Suzuki Hisao y Martin von Löwis.

source: PEP 273: Importing Modules from ZIP Archives
es: PEP 273: Importar módulos desde archivos ZIP

source: The new :mod:`zipimport` module adds support for importing modules from a ZIP-format archive. You don't need to import the module explicitly; it will be automatically imported if a ZIP archive's filename is added to ``sys.path``. For example:
es: El nuevo módulo :mod:`zipimport` añade soporte para importar módulos desde un archivo en formato ZIP. No es necesario importar el módulo explícitamente; se importará automáticamente si se añade el nombre de un archivo ZIP a ``sys.path``. Por ejemplo:

source: An entry in ``sys.path`` can now be the filename of a ZIP archive. The ZIP archive can contain any kind of files, but only files named :file:`\*.py`, :file:`\*.pyc`, or :file:`\*.pyo` can be imported. If an archive only contains :file:`\*.py` files, Python will not attempt to modify the archive by adding the corresponding :file:`\*.pyc` file, meaning that if a ZIP archive doesn't contain :file:`\*.pyc` files, importing may be rather slow.
es: Una entrada en ``sys.path`` puede ser ahora el nombre de un archivo ZIP. El archivo ZIP puede contener cualquier tipo de ficheros, pero sólo se pueden importar los ficheros llamados :file:`\*.py`, :file:`\*.pyc`, o :file:`\*.pyo`. Si un archivo sólo contiene ficheros :file:`\*.py`, Python no intentará modificar el archivo añadiendo el correspondiente fichero :file:`\*.pyc`, lo que significa que si un archivo ZIP no contiene ficheros :file:`\*.pyc`, la importación puede ser bastante lenta.

source: A path within the archive can also be specified to only import from a subdirectory; for example, the path :file:`/tmp/example.zip/lib/` would only import from the :file:`lib/` subdirectory within the archive.
es: También se puede especificar una ruta dentro del archivo para importar sólo de un subdirectorio; por ejemplo, la ruta :file:`/tmp/example.zip/lib/` sólo importaría del subdirectorio :file:`lib/` dentro del archivo.

source: :pep:`273` - Import Modules from Zip Archives
es: :pep:`273` - Importación de módulos desde archivos Zip

source: Written by James C. Ahlstrom, who also provided an implementation. Python 2.3 follows the specification in :pep:`273`, but uses an implementation written by Just van Rossum that uses the import hooks described in :pep:`302`. See section :ref:`section-pep302` for a description of the new import hooks.
es: Escrito por James C. Ahlstrom, que también proporcionó una implementación. Python 2.3 sigue la especificación en :pep:`273`, pero utiliza una implementación escrita por Just van Rossum que utiliza los ganchos de importación descritos en :pep:`302`. Vea la sección :ref:`section-pep302` para una descripción de los nuevos ganchos de importación.

source: PEP 277: Unicode file name support for Windows NT
es: PEP 277: Soporte de nombres de archivo Unicode para Windows NT

source: On Windows NT, 2000, and XP, the system stores file names as Unicode strings. Traditionally, Python has represented file names as byte strings, which is inadequate because it renders some file names inaccessible.
es: En Windows NT, 2000 y XP, el sistema almacena los nombres de archivo como cadenas Unicode. Tradicionalmente, Python ha representado los nombres de archivo como cadenas de bytes, lo cual es inadecuado porque hace que algunos nombres de archivo sean inaccesibles.
