Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: Support for a port to IBM's OS/2 using the EMX runtime environment was merged into the main Python source tree. EMX is a POSIX emulation layer over the OS/2 system APIs. The Python port for EMX tries to support all the POSIX-like capability exposed by the EMX runtime, and mostly succeeds; :func:`fork` and :func:`fcntl` are restricted by the limitations of the underlying emulation layer. The standard OS/2 port, which uses IBM's Visual Age compiler, also gained support for case-sensitive import semantics as part of the integration of the EMX port into CVS. (Contributed by Andrew MacIntyre.)
es: El soporte para un puerto para OS / 2 de IBM utilizando el entorno de ejecución EMX se fusionó en el árbol de fuentes principal de Python. EMX es una capa de emulación POSIX sobre las API del sistema OS / 2. El puerto de Python para EMX intenta admitir toda la capacidad similar a POSIX expuesta por el tiempo de ejecución de EMX y, en su mayoría, tiene éxito; :func:`fork` y :func:`fcntl` están restringidos por las limitaciones de la capa de emulación subyacente. El puerto estándar OS / 2, que utiliza el compilador Visual Age de IBM, también obtuvo soporte para la semántica de importación que distingue entre mayúsculas y minúsculas como parte de la integración del puerto EMX en CVS. (Contribuido por Andrew MacIntyre.)

source: On MacOS, most toolbox modules have been weaklinked to improve backward compatibility. This means that modules will no longer fail to load if a single routine is missing on the current OS version. Instead calling the missing routine will raise an exception. (Contributed by Jack Jansen.)
es: En MacOS, la mayoría de los módulos de la caja de herramientas tienen vínculos débiles para mejorar la compatibilidad con versiones anteriores. Esto significa que los módulos ya no dejarán de cargarse si falta una rutina en la versión actual del sistema operativo. En su lugar, llamar a la rutina que falta lanzará una excepción. (Contribuido por Jack Jansen.)

source: The RPM spec files, found in the :file:`Misc/RPM/` directory in the Python source distribution, were updated for 2.3. (Contributed by Sean Reifschneider.)
es: Los archivos de especificaciones de RPM, que se encuentran en el directorio :file:`Misc/RPM/` en la distribución fuente de Python, se actualizaron para la versión 2.3. (Contribución de Sean Reifschneider.)

source: Other new platforms now supported by Python include AtheOS (http://www.atheos.cx/), GNU/Hurd, and OpenVMS.
es: Otras plataformas nuevas ahora compatibles con Python incluyen AtheOS (http://www.atheos.cx/), GNU / Hurd y OpenVMS.

source: Other Changes and Fixes
es: Otros cambios y correcciones

source: As usual, there were a bunch of other improvements and bugfixes scattered throughout the source tree. A search through the CVS change logs finds there were 523 patches applied and 514 bugs fixed between Python 2.2 and 2.3. Both figures are likely to be underestimates.
es: Como de costumbre, hubo un montón de otras mejoras y correcciones de errores esparcidas por todo el árbol de fuentes. Una búsqueda en los registros de cambios de CVS encuentra que se aplicaron 523 parches y se corrigieron 514 errores entre Python 2.2 y 2.3. Es probable que ambas cifras estén subestimadas.

source: Some of the more notable changes are:
es: Algunos de los cambios más notables son:

source: If the :envvar:`PYTHONINSPECT` environment variable is set, the Python interpreter will enter the interactive prompt after running a Python program, as if Python had been invoked with the :option:`-i` option. The environment variable can be set before running the Python interpreter, or it can be set by the Python program as part of its execution.
es: Si se establece la variable de entorno :envvar:`PYTHONINSPECT`, el intérprete de Python ingresará al indicador interactivo después de ejecutar un programa de Python, como si Python hubiera sido invocado con la opción :option:`-i`. La variable de entorno se puede configurar antes de ejecutar el intérprete de Python, o el programa Python puede configurarla como parte de su ejecución.

source: The :file:`regrtest.py` script now provides a way to allow "all resources except *foo*." A resource name passed to the :option:`!-u` option can now be prefixed with a hyphen (``'-'``) to mean "remove this resource." For example, the option '``-uall,-bsddb``' could be used to enable the use of all resources except ``bsddb``.
es: El script :file:`regrtest.py` ahora proporciona una forma de permitir "todos los recursos excepto *foo*". Un nombre de recurso pasado a la opción :option:`!-u` ahora se puede prefijar con un guión (``'-'``) para significar "eliminar este recurso". Por ejemplo, la opción '``-uall,-bsddb``' podría usarse para habilitar el uso de todos los recursos excepto ``bsddb``.

source: The tools used to build the documentation now work under Cygwin as well as Unix.
es: Las herramientas utilizadas para crear la documentación ahora funcionan tanto en Cygwin como en Unix.

source: The ``SET_LINENO`` opcode has been removed. Back in the mists of time, this opcode was needed to produce line numbers in tracebacks and support trace functions (for, e.g., :mod:`pdb`). Since Python 1.5, the line numbers in tracebacks have been computed using a different mechanism that works with "python -O". For Python 2.3 Michael Hudson implemented a similar scheme to determine when to call the trace function, removing the need for ``SET_LINENO`` entirely.
es: Se ha eliminado el código de operación ``SET_LINENO``. En la noche de los tiempos, este código de operación era necesario para producir números de línea en rastreos y admitir funciones de rastreo (para, por ejemplo, :mod:`pdb`). Desde Python 1.5, los números de línea en los rastreos se han calculado utilizando un mecanismo diferente que funciona con "python -O". Para Python 2.3, Michael Hudson implementó un esquema similar para determinar cuándo llamar a la función de seguimiento, eliminando por completo la necesidad de ``SET_LINENO``.

source: It would be difficult to detect any resulting difference from Python code, apart from a slight speed up when Python is run without :option:`-O`.
es: Sería difícil detectar cualquier diferencia resultante del código Python, aparte de una ligera aceleración cuando Python se ejecuta sin :option:`-O`.

source: C extensions that access the :attr:`f_lineno` field of frame objects should instead call ``PyCode_Addr2Line(f->f_code, f->f_lasti)``. This will have the added effect of making the code work as desired under "python -O" in earlier versions of Python.
es: Las extensiones C que acceden al campo :attr:`f_lineno` de objetos de marco deben llamar a ``PyCode_Addr2Line(f->f_code, f->f_lasti)``. Esto tendrá el efecto adicional de hacer que el código funcione como se desea en "python -O" en versiones anteriores de Python.

source: A nifty new feature is that trace functions can now assign to the :attr:`f_lineno` attribute of frame objects, changing the line that will be executed next. A ``jump`` command has been added to the :mod:`pdb` debugger taking advantage of this new feature. (Implemented by Richie Hindle.)
es: Una característica nueva e ingeniosa es que las funciones de seguimiento ahora se pueden asignar al atributo :attr:`f_lineno` de los objetos de marco, cambiando la línea que se ejecutará a continuación. Se ha agregado un comando ``jump`` al depurador :mod:`pdb` aprovechando esta nueva característica. (Implementado por Richie Hindle.)

source: Porting to Python 2.3
es: Portar a Python 2.3

source: This section lists previously described changes that may require changes to your code:
es: Esta sección enumera los cambios descritos anteriormente que pueden requerir cambios en su código:

source: :keyword:`yield` is now always a keyword; if it's used as a variable name in your code, a different name must be chosen.
es: :keyword:`yield` ahora es siempre una palabra clave; si se usa como nombre de variable en su código, se debe elegir un nombre diferente.

source: For strings *X* and *Y*, ``X in Y`` now works if *X* is more than one character long.
es: Para cadenas, *X* and *Y*, ASDF00 now works if *X* tiene más de un carácter.

source: The :func:`int` type constructor will now return a long integer instead of raising an :exc:`OverflowError` when a string or floating-point number is too large to fit into an integer.
es: El constructor de tipo :func:`int` ahora retornará un entero largo en lugar de lanzar un :exc:`OverflowError` cuando una cadena o un número de punto flotante es demasiado grande para caber en un entero. Esto puede llevar al resultado paradójico de que ``isinstance(int(expresión), int)`` sea falso, pero parece poco probable que cause problemas en la práctica.

source: If you have Unicode strings that contain 8-bit characters, you must declare the file's encoding (UTF-8, Latin-1, or whatever) by adding a comment to the top of the file. See section :ref:`section-encodings` for more information.
es: Si tiene cadenas Unicode que contienen caracteres de 8 bits, debe declarar la codificación del archivo (UTF-8, Latin-1 o lo que sea) agregando un comentario en la parte superior del archivo. Consulte la sección :ref:`section-encodings` para obtener más información.

source: Calling Tcl methods through :mod:`_tkinter` no longer returns only strings. Instead, if Tcl returns other objects those objects are converted to their Python equivalent, if one exists, or wrapped with a :class:`_tkinter.Tcl_Obj` object if no Python equivalent exists.
es: Llamar a métodos Tcl a través del objeto :mod:`_tkinter` ya no retornan solo cadenas de caracteres.En vez, si Tcl retorna otros objetos esos objetos son convertidos a su equivalente en Python, si uno existe, o está envuelto con un :class:`_tkinter.Tcl_Obj` si no existe un equivalente de Python.

source: Large octal and hex literals such as ``0xffffffff`` now trigger a :exc:`FutureWarning`. Currently they're stored as 32-bit numbers and result in a negative value, but in Python 2.4 they'll become positive long integers.
es: Grandes literales octales y hexadecimales como ``0xffffffff`` ahora activan un :exc:`FutureWarning`. Actualmente se almacenan como números de 32 bits y dan como resultado un valor negativo, pero en Python 2.4 se convertirán en enteros largos positivos.

source: There are a few ways to fix this warning. If you really need a positive number, just add an ``L`` to the end of the literal. If you're trying to get a 32-bit integer with low bits set and have previously used an expression such as ``~(1 << 31)``, it's probably clearest to start with all bits set and clear the desired upper bits. For example, to clear just the top bit (bit 31), you could write ``0xffffffffL &~(1L<<31)``.
es: Hay varias formas de corregir esta advertencia. Si realmente necesita un número positivo, simplemente agregue un ``L`` al final del literal. Si está tratando de obtener un entero de 32 bits con bits bajos establecidos y ha usado previamente una expresión como ``~(1 << 31)``, probablemente sea más claro comenzar con todos los bits establecidos y borrar los bits superiores deseados. Por ejemplo, para borrar solo el bit superior (bit 31), puede escribir ``0xffffffffL &~(1L<<31)``.

source: You can no longer disable assertions by assigning to ``__debug__``.
es: Ya no puede deshabilitar las aserciones asignando a ``__debug__``.

source: The Distutils :func:`setup` function has gained various new keyword arguments such as *depends*. Old versions of the Distutils will abort if passed unknown keywords. A solution is to check for the presence of the new :func:`get_distutil_options` function in your :file:`setup.py` and only uses the new keywords with a version of the Distutils that supports them::
es: La función Distutils :func:`setup` ha ganado varios argumentos de palabras clave nuevas, como *depends*. Las versiones antiguas de Distutils se abortarán si se pasan palabras clave desconocidas. Una solución es verificar la presencia de la nueva función :func:`get_distutil_options` en su :file:`setup.py` y solo usa las nuevas palabras clave con una versión de Distutils que las admita:

source: Using ``None`` as a variable name will now result in a :exc:`SyntaxWarning` warning.
es: El uso de ``None`` como nombre de una variable ahora resultará en una advertencia :exc:`SyntaxWarning`. En una futura versión de Python, ``None`` podría convertirse en una palabra clave.

source: Names of extension types defined by the modules included with Python now contain the module and a ``'.'`` in front of the type name.
es: Los nombres de los tipos de extensión definidos por los módulos incluidos con Python ahora contienen el módulo y un ``'.'`` delante del nombre del tipo.

source: Acknowledgements
es: Agradecimientos

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Jeff Bauer, Simon Brunning, Brett Cannon, Michael Chermside, Andrew Dalke, Scott David Daniels, Fred L. Drake, Jr., David Fraser, Kelly Gerber, Raymond Hettinger, Michael Hudson, Chris Lambert, Detlef Lannert, Martin von Löwis, Andrew MacIntyre, Lalo Martins, Chad Netzer, Gustavo Niemeyer, Neal Norwitz, Hans Nowak, Chris Reedy, Francesco Ricciardi, Vinay Sajip, Neil Schemenauer, Roman Suzi, Jason Tishler, Just van Rossum.
es: El autor desea agradecer a las siguientes personas por ofrecer sugerencias, correcciones y ayuda con varios borradores de este artículo: Jeff Bauer, Simon Brunning, Brett Cannon, Michael Chermside, Andrew Dalke, Scott David Daniels, Fred L. Drake, Jr., David Fraser, Kelly Gerber, Raymond Hettinger, Michael Hudson, Chris Lambert, Detlef Lannert, Martin von Löwis, Andrew MacIntyre, Lalo Martins, Chad Netzer, Gustavo Niemeyer, Neal Norwitz, Hans Nowak, Chris Reedy, Francesco Ricciardi, Vinay Sajip, Neil Schemenauer, Roman Suzi, Jason Tishler, Just van Rossum.

source: universal newlines
es: saltos de línea universal

source: What's new
es: Qué hay de nuevo
