Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: Two new functions in the :mod:`math` module, ``degrees(rads)`` and ``radians(degs)``, convert between radians and degrees. Other functions in the :mod:`math` module such as :func:`math.sin` and :func:`math.cos` have always required input values measured in radians. Also, an optional *base* argument was added to :func:`math.log` to make it easier to compute logarithms for bases other than ``e`` and ``10``. (Contributed by Raymond Hettinger.)
es: Dos nuevas funciones en el módulo :mod:`math`, ``degrees(rads)`` y ``radians(degs)``, convierten entre radianes y grados. Otras funciones del módulo :mod:`math`, como :func:`math.sin` y :func:`math.cos`, siempre han requerido valores de entrada medidos en radianes. Además, se agregó un argumento opcional *base* a :func:`math.log` para facilitar el cálculo de logaritmos para bases distintas de ``e`` y ``10``. (Contribuido por Raymond Hettinger.)

source: Several new POSIX functions (:func:`getpgid`, :func:`killpg`, :func:`lchown`, :func:`loadavg`, :func:`major`, :func:`makedev`, :func:`minor`, and :func:`mknod`) were added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by Gustavo Niemeyer, Geert Jansen, and Denis S. Otkidach.)
es: Se agregaron varias funciones POSIX nuevas (:func:`getpgid`, :func:`killpg`, :func:`lchown`, :func:`loadavg`, :func:`major`, :func:`makedev`, :func:`minor` y :func:`mknod`) al módulo :mod:`posix` que subyace al módulo :mod:`os`. (Contribuido por Gustavo Niemeyer, Geert Jansen y Denis S. Otkidach.)

source: In the :mod:`os` module, the :func:`\*stat` family of functions can now report fractions of a second in a timestamp. Such time stamps are represented as floats, similar to the value returned by :func:`time.time`.
es: En el módulo :mod:`os`, la familia de funciones :func:`\*stat` ahora puede informar fracciones de segundo en una marca de tiempo. Estas marcas de tiempo se representan como flotantes, similar al valor devuelto por :func:`time.time`.

source: During testing, it was found that some applications will break if time stamps are floats. For compatibility, when using the tuple interface of the :class:`stat_result` time stamps will be represented as integers. When using named fields (a feature first introduced in Python 2.2), time stamps are still represented as integers, unless :func:`os.stat_float_times` is invoked to enable float return values::
es: Durante las pruebas, se descubrió que algunas aplicaciones se romperán si las marcas de tiempo son flotantes. Por compatibilidad, cuando se utiliza la interfaz de tupla de las marcas de tiempo :class:`stat_result` se representarán como números enteros. Cuando se utilizan campos con nombre (una característica introducida por primera vez en Python 2.2), las marcas de tiempo todavía se representan como números enteros, a menos que se invoque :func:`os.stat_float_times` para habilitar los valores de retorno flotantes:

source: In Python 2.4, the default will change to always returning floats.
es: En Python 2.4, el valor predeterminado cambiará para devolver siempre flotantes.

source: Application developers should enable this feature only if all their libraries work properly when confronted with floating point time stamps, or if they use the tuple API. If used, the feature should be activated on an application level instead of trying to enable it on a per-use basis.
es: Los desarrolladores de aplicaciones deben habilitar esta función solo si todas sus bibliotecas funcionan correctamente cuando se enfrentan a marcas de tiempo de punto flotante o si utilizan la API de tuplas. Si se usa, la función debe activarse a nivel de aplicación en lugar de intentar habilitarla por uso.

source: The :mod:`optparse` module contains a new parser for command-line arguments that can convert option values to a particular Python type and will automatically generate a usage message. See the following section for more details.
es: El módulo :mod:`optparse` contiene un nuevo analizador para argumentos de línea de comandos que puede convertir valores de opción a un tipo de Python en particular y generará automáticamente un mensaje de uso. Consulte la siguiente sección para obtener más detalles.

source: The old and never-documented :mod:`linuxaudiodev` module has been deprecated, and a new version named :mod:`ossaudiodev` has been added. The module was renamed because the OSS sound drivers can be used on platforms other than Linux, and the interface has also been tidied and brought up to date in various ways. (Contributed by Greg Ward and Nicholas FitzRoy-Dale.)
es: El módulo :mod:`linuxaudiodev` antiguo y nunca documentado ha quedado obsoleto y se ha agregado una nueva versión denominada :mod:`ossaudiodev`. Se cambió el nombre del módulo porque los controladores de sonido OSS se pueden usar en plataformas distintas de Linux, y la interfaz también se ha arreglado y actualizado de varias maneras. (Contribuido por Greg Ward y Nicholas FitzRoy-Dale.)

source: The new :mod:`platform` module contains a number of functions that try to determine various properties of the platform you're running on. There are functions for getting the architecture, CPU type, the Windows OS version, and even the Linux distribution version. (Contributed by Marc-André Lemburg.)
es: El nuevo módulo :mod:`platform` contiene una serie de funciones que intentan determinar varias propiedades de la plataforma en la que se está ejecutando. Hay funciones para obtener la arquitectura, el tipo de CPU, la versión del sistema operativo Windows e incluso la versión de distribución de Linux. (Contribución de Marc-André Lemburg.)

source: The parser objects provided by the :mod:`pyexpat` module can now optionally buffer character data, resulting in fewer calls to your character data handler and therefore faster performance. Setting the parser object's :attr:`buffer_text` attribute to :const:`True` will enable buffering.
es: Los objetos del analizador proporcionados por el módulo :mod:`pyexpat` ahora pueden almacenar opcionalmente datos de caracteres, lo que resulta en menos llamadas al controlador de datos de caracteres y, por lo tanto, un rendimiento más rápido. La configuración del atributo :attr:`buffer_text` del objeto del analizador en :const:`True` habilitará el almacenamiento en búfer.

source: The ``sample(population, k)`` function was added to the :mod:`random` module. *population* is a sequence or :class:`xrange` object containing the elements of a population, and :func:`sample` chooses *k* elements from the population without replacing chosen elements. *k* can be any value up to ``len(population)``. For example::
es: La función ``sample(population, k)`` se agregó al módulo :mod:`random`. *population* es una secuencia o un objeto :class:`xrange` que contiene los elementos de la población, and :func:`sample` elije *k* elementos de la población sin reemplazar los elementos escogidos. *k* puede tener cualquier valor hasta ``len(population)``. Por ejemplo::

source: The :mod:`random` module now uses a new algorithm, the Mersenne Twister, implemented in C. It's faster and more extensively studied than the previous algorithm.
es: El módulo :mod:`random` ahora usa un nuevo algoritmo, el Mersenne Twister, implementado en C. Es más rápido y más estudiado que el algoritmo anterior.

source: (All changes contributed by Raymond Hettinger.)
es: (Parches aportados por Raymond Hettinger)

source: The :mod:`readline` module also gained a number of new functions: :func:`get_history_item`, :func:`get_current_history_length`, and :func:`redisplay`.
es: El módulo :mod:`readline` también obtuvo varias funciones nuevas: :func:`get_history_item`, :func:`get_current_history_length` y :func:`redisplay`.

source: The :mod:`rexec` and :mod:`Bastion` modules have been declared dead, and attempts to import them will fail with a :exc:`RuntimeError`. New-style classes provide new ways to break out of the restricted execution environment provided by :mod:`rexec`, and no one has interest in fixing them or time to do so. If you have applications using :mod:`rexec`, rewrite them to use something else.
es: Los módulos :mod:`rexec` y :mod:`Bastion` se han declarado muertos y los intentos de importarlos fallarán con un :exc:`RuntimeError`. Las clases de nuevo estilo brindan nuevas formas de salir del entorno de ejecución restringido proporcionado por :mod:`rexec`, y nadie tiene interés en arreglarlas o el tiempo para hacerlo. Si tiene aplicaciones que usan :mod:`rexec`, vuelva a escribirlas para usar otra cosa.

source: (Sticking with Python 2.2 or 2.1 will not make your applications any safer because there are known bugs in the :mod:`rexec` module in those versions. To repeat: if you're using :mod:`rexec`, stop using it immediately.)
es: (Seguir con Python 2.2 o 2.1 no hará que sus aplicaciones sean más seguras porque hay errores conocidos en el módulo :mod:`rexec` en esas versiones. Para repetir: si está usando :mod:`rexec`, deje de usarlo inmediatamente).

source: The :mod:`rotor` module has been deprecated because the algorithm it uses for encryption is not believed to be secure. If you need encryption, use one of the several AES Python modules that are available separately.
es: El módulo :mod:`rotor` ha quedado obsoleto porque no se cree que el algoritmo que utiliza para el cifrado sea seguro. Si necesita cifrado, use uno de los varios módulos AES Python que están disponibles por separado.

source: The :mod:`shutil` module gained a ``move(src, dest)`` function that recursively moves a file or directory to a new location.
es: El módulo :mod:`shutil` obtuvo una función ``move(src, dest)`` que mueve recursivamente un archivo o directorio a una nueva ubicación.

source: Support for more advanced POSIX signal handling was added to the :mod:`signal` but then removed again as it proved impossible to make it work reliably across platforms.
es: Se agregó soporte para un manejo de señal POSIX más avanzado al :mod:`signal`, pero luego se eliminó nuevamente, ya que resultó imposible hacerlo funcionar de manera confiable en todas las plataformas.

source: The :mod:`socket` module now supports timeouts. You can call the ``settimeout(t)`` method on a socket object to set a timeout of *t* seconds. Subsequent socket operations that take longer than *t* seconds to complete will abort and raise a :exc:`socket.timeout` exception.
es: El módulo :mod:`socket` ahora admite tiempos de espera. Puede llamar al método ``settimeout(t)`` en un objeto de socket para establecer un tiempo de espera de *t* seconds. Subsequent socket operations that take longer than *t* segundos para completar, abortará y lanzará una excepción :exc:`socket.timeout`.

source: The original timeout implementation was by Tim O'Malley. Michael Gilfix integrated it into the Python :mod:`socket` module and shepherded it through a lengthy review. After the code was checked in, Guido van Rossum rewrote parts of it. (This is a good example of a collaborative development process in action.)
es: La implementación del tiempo de espera original fue realizada por Tim O'Malley. Michael Gilfix lo integró en el módulo Python :mod:`socket` y lo guió a través de una extensa revisión. Después de que se registró el código, Guido van Rossum reescribió partes del mismo. (Este es un buen ejemplo de un proceso de desarrollo colaborativo en acción).

source: On Windows, the :mod:`socket` module now ships with Secure Sockets Layer (SSL) support.
es: En Windows, el módulo :mod:`socket` ahora se envía con compatibilidad con Secure Sockets Layer (SSL).

source: The value of the C :c:macro:`PYTHON_API_VERSION` macro is now exposed at the Python level as ``sys.api_version``. The current exception can be cleared by calling the new :func:`sys.exc_clear` function.
es: El valor de la macro C :c:macro:`PYTHON_API_VERSION` ahora se expone en el nivel de Python como ``sys.api_version``. La excepción actual se puede borrar llamando a la nueva función :func:`sys.exc_clear`.

source: The new :mod:`tarfile` module allows reading from and writing to :program:`tar`\ -format archive files. (Contributed by Lars Gustäbel.)
es: El nuevo módulo :mod:`tarfile` permite leer y escribir en: programa: `tar` \ -format archivos de almacenamiento. (Contribución de Lars Gustäbel.)

source: The new :mod:`textwrap` module contains functions for wrapping strings containing paragraphs of text. The ``wrap(text, width)`` function takes a string and returns a list containing the text split into lines of no more than the chosen width. The ``fill(text, width)`` function returns a single string, reformatted to fit into lines no longer than the chosen width. (As you can guess, :func:`fill` is built on top of :func:`wrap`. For example::
es: El nuevo módulo :mod:`textwrap` contiene funciones para envolver cadenas que contienen párrafos de texto. La función ``wrap(text, width)`` toma una cadena y devuelve una lista que contiene el texto dividido en líneas de no más del ancho elegido. La función ``fill(text, width)`` devuelve una sola cadena, reformateada para que quepa en líneas que no superen el ancho elegido. (Como puede adivinar, :func:`fill` está construido sobre :func:`wrap`. Por ejemplo:

source: The module also contains a :class:`TextWrapper` class that actually implements the text wrapping strategy. Both the :class:`TextWrapper` class and the :func:`wrap` and :func:`fill` functions support a number of additional keyword arguments for fine-tuning the formatting; consult the module's documentation for details. (Contributed by Greg Ward.)
es: El módulo también contiene una clase :class:`TextWrapper` que realmente implementa la estrategia de envoltura de texto. Tanto la clase :class:`TextWrapper` como las funciones :func:`wrap` y :func:`fill` admiten varios argumentos de palabras clave adicionales para ajustar el formato; consulte la documentación del módulo para obtener más detalles. (Contribuido por Greg Ward.)

source: The :mod:`thread` and :mod:`threading` modules now have companion modules, :mod:`dummy_thread` and :mod:`dummy_threading`, that provide a do-nothing implementation of the :mod:`thread` module's interface for platforms where threads are not supported. The intention is to simplify thread-aware modules (ones that *don't* rely on threads to run) by putting the following code at the top::
es: Los módulos :mod:`thread` y :mod:`threading` ahora tienen módulos complementarios, :mod:`dummy_thread` y :mod:`dummy_threading`, que proporcionan una implementación sin acción de la interfaz del módulo :mod:`thread` para plataformas donde no se admiten subprocesos. La intención es simplificar los módulos compatibles con subprocesos (aquellos en los que *don't* depende de los subprocesos para ejecutarse) colocando el siguiente código en la parte superior:

source: In this example, :mod:`_threading` is used as the module name to make it clear that the module being used is not necessarily the actual :mod:`threading` module. Code can call functions and use classes in :mod:`_threading` whether or not threads are supported, avoiding an :keyword:`if` statement and making the code slightly clearer. This module will not magically make multithreaded code run without threads; code that waits for another thread to return or to do something will simply hang forever.
es: En este ejemplo, :mod:`_threading` se usa como el nombre del módulo para dejar en claro que el módulo que se está usando no es necesariamente el módulo :mod:`threading`. El código puede llamar funciones y usar clases en :mod:`_threading`, ya sea que se admitan subprocesos o no, evitando una declaración :keyword:`if` y haciendo que el código sea un poco más claro. Este módulo no hará mágicamente que el código multiproceso se ejecute sin subprocesos; el código que espera a que vuelva otro hilo o que haga algo simplemente se colgará para siempre.

source: The :mod:`time` module's :func:`strptime` function has long been an annoyance because it uses the platform C library's :func:`strptime` implementation, and different platforms sometimes have odd bugs. Brett Cannon contributed a portable implementation that's written in pure Python and should behave identically on all platforms.
es: La función :func:`strptime` del módulo :mod:`time` ha sido durante mucho tiempo una molestia porque utiliza la implementación :func:`strptime` de la biblioteca de la plataforma C, y las diferentes plataformas a veces tienen errores extraños. Brett Cannon contribuyó con una implementación portátil que está escrita en Python puro y debería comportarse de manera idéntica en todas las plataformas.

source: The new :mod:`timeit` module helps measure how long snippets of Python code take to execute. The :file:`timeit.py` file can be run directly from the command line, or the module's :class:`Timer` class can be imported and used directly. Here's a short example that figures out whether it's faster to convert an 8-bit string to Unicode by appending an empty Unicode string to it or by using the :func:`unicode` function::
es: El nuevo módulo :mod:`timeit` ayuda a medir cuánto tardan en ejecutarse los fragmentos de código Python. El archivo :file:`timeit.py` se puede ejecutar directamente desde la línea de comando, o la clase :class:`Timer` del módulo se puede importar y usar directamente. Aquí hay un breve ejemplo que determina si es más rápido convertir una cadena de 8 bits a Unicode agregando una cadena Unicode vacía o usando la función :func:`unicode`:

source: The :mod:`Tix` module has received various bug fixes and updates for the current version of the Tix package.
es: El módulo :mod:`Tix` ha recibido varias correcciones de errores y actualizaciones para la versión actual del paquete Tix.

source: The :mod:`Tkinter` module now works with a thread-enabled version of Tcl. Tcl's threading model requires that widgets only be accessed from the thread in which they're created; accesses from another thread can cause Tcl to panic. For certain Tcl interfaces, :mod:`Tkinter` will now automatically avoid this when a widget is accessed from a different thread by marshalling a command, passing it to the correct thread, and waiting for the results. Other interfaces can't be handled automatically but :mod:`Tkinter` will now raise an exception on such an access so that you can at least find out about the problem. See https://mail.python.org/pipermail/python-dev/2002-December/031107.html for a more detailed explanation of this change. (Implemented by Martin von Löwis.)
es: El módulo :mod:`Tkinter` ahora funciona con una versión de Tcl habilitada para subprocesos. El modelo de subprocesos de Tcl requiere que solo se acceda a los widgets desde el subproceso en el que se crearon; los accesos desde otro hilo pueden hacer que Tcl entre en pánico. Para ciertas interfaces Tcl, :mod:`Tkinter` ahora evitará esto automáticamente cuando se acceda a un widget desde un subproceso diferente al ordenar un comando, pasarlo al subproceso correcto y esperar los resultados. Otras interfaces no se pueden manejar automáticamente, pero :mod:`Tkinter` ahora lanzará una excepción en dicho acceso para que al menos pueda averiguar sobre el problema. Consulte https://mail.python.org/pipermail/python-dev/2002-December/031107.html para obtener una explicación más detallada de este cambio. (Implementado por Martin von Löwis.)

source: Calling Tcl methods through :mod:`_tkinter` no longer returns only strings. Instead, if Tcl returns other objects those objects are converted to their Python equivalent, if one exists, or wrapped with a :class:`_tkinter.Tcl_Obj` object if no Python equivalent exists. This behavior can be controlled through the :meth:`wantobjects` method of :class:`tkapp` objects.
es: Llamar a métodos Tcl a través del objeto :mod:`_tkinter` ya no retorna solo cadena de caracteres.En vez, si Tcl retorna otros objetos esos objetos son convertidos a su equivalente en Python,si uno existe, o envueltos en una clase :class:`_tkinter. Tcl_Obj` si no existe un equivalente de Python. Este comportamiento se puede controlar mediante el método :meth:`wantobjects` de objetos :class:`tkapp`.

source: When using :mod:`_tkinter` through the :mod:`Tkinter` module (as most Tkinter applications will), this feature is always activated. It should not cause compatibility problems, since Tkinter would always convert string results to Python types where possible.
es: Cuando se usa :mod:`_tkinter` a través del módulo :mod:`Tkinter` (como lo harán la mayoría de las aplicaciones de Tkinter), esta función siempre está activada. No debería causar problemas de compatibilidad, ya que Tkinter siempre convertiría los resultados de cadenas a tipos de Python cuando fuera posible.

source: If any incompatibilities are found, the old behavior can be restored by setting the :attr:`wantobjects` variable in the :mod:`Tkinter` module to false before creating the first :class:`tkapp` object. ::
es: Si se encuentran incompatibilidades, se puede restaurar el comportamiento anterior estableciendo la variable :attr:`wantobjects` en el módulo :mod:`Tkinter` en falso antes de crear el primer objeto :class:`tkapp`. ::

source: Any breakage caused by this change should be reported as a bug.
es: Cualquier rotura causada por este cambio debe notificarse como un error.

source: The :mod:`UserDict` module has a new :class:`DictMixin` class which defines all dictionary methods for classes that already have a minimum mapping interface. This greatly simplifies writing classes that need to be substitutable for dictionaries, such as the classes in the :mod:`shelve` module.
es: El módulo :mod:`UserDict` tiene una nueva clase :class:`DictMixin` que define todos los métodos de diccionario para las clases que ya tienen una interfaz de mapeo mínima. Esto simplifica enormemente las clases de escritura que deben ser sustituibles por diccionarios, como las clases del módulo :mod:`shelve`.

source: Adding the mix-in as a superclass provides the full dictionary interface whenever the class defines :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__`, and :meth:`keys`. For example::
es: Agregar la combinación como una superclase proporciona la interfaz de diccionario completa siempre que la clase define :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__` y :meth:`keys`. Por ejemplo::

source: (Contributed by Raymond Hettinger.)
es: (Parches aportados por Raymond Hettinger)

source: The DOM implementation in :mod:`xml.dom.minidom` can now generate XML output in a particular encoding by providing an optional encoding argument to the :meth:`toxml` and :meth:`toprettyxml` methods of DOM nodes.
es: La implementación DOM en :mod:`xml.dom.minidom` ahora puede generar salida XML en una codificación particular proporcionando un argumento de codificación opcional a los métodos :meth:`toxml` y :meth:`toprettyxml` de los nodos DOM.

source: The :mod:`xmlrpclib` module now supports an XML-RPC extension for handling nil data values such as Python's ``None``. Nil values are always supported on unmarshalling an XML-RPC response. To generate requests containing ``None``, you must supply a true value for the *allow_none* parameter when creating a :class:`Marshaller` instance.
es: El módulo :mod:`xmlrpclib` ahora admite una extensión XML-RPC para manejar valores de datos nulos como ``None`` de Python. Los valores nulos siempre se admiten al desagrupar una respuesta XML-RPC. Para generar solicitudes que contengan ``None``, debe proporcionar un valor verdadero para el parámetro *allow_none* al crear una instancia :class:`Marshaller`.
