Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: The new :mod:`DocXMLRPCServer` module allows writing self-documenting XML-RPC servers. Run it in demo mode (as a program) to see it in action. Pointing the web browser to the RPC server produces pydoc-style documentation; pointing xmlrpclib to the server allows invoking the actual methods. (Contributed by Brian Quinlan.)
es: El nuevo módulo :mod:`DocXMLRPCServer` permite escribir servidores XML-RPC autodocumentados. Ejecútelo en modo de demostración (como un programa) para verlo en acción. Al apuntar el navegador web al servidor RPC se produce una documentación de estilo pydoc; apuntar xmlrpclib al servidor permite invocar los métodos reales. (Contribuido por Brian Quinlan.)

source: Support for internationalized domain names (RFCs 3454, 3490, 3491, and 3492) has been added. The "idna" encoding can be used to convert between a Unicode domain name and the ASCII-compatible encoding (ACE) of that name. ::
es: Se ha agregado soporte para nombres de dominio internacionalizados (RFCs 3454, 3490, 3491 y 3492). La codificación "idna" se puede utilizar para convertir entre un nombre de dominio Unicode y la codificación compatible con ASCII (ACE) de ese nombre. ::

source: The :mod:`socket` module has also been extended to transparently convert Unicode hostnames to the ACE version before passing them to the C library. Modules that deal with hostnames such as :mod:`httplib` and :mod:`ftplib`) also support Unicode host names; :mod:`httplib` also sends HTTP ``Host`` headers using the ACE version of the domain name. :mod:`urllib` supports Unicode URLs with non-ASCII host names as long as the ``path`` part of the URL is ASCII only.
es: El módulo :mod:`socket` también se ha ampliado para convertir de forma transparente los nombres de host Unicode a la versión ACE antes de pasarlos a la biblioteca C. Los módulos que tratan con nombres de host como :mod:`httplib` y :mod:`ftplib`) también admiten nombres de host Unicode; :mod:`httplib` también envía encabezados HTTP ``Host`` utilizando la versión ACE del nombre de dominio. :mod:`urllib` admite URL Unicode con nombres de host que no sean ASCII siempre que la parte ``path`` de la URL sea solo ASCII.

source: To implement this change, the :mod:`stringprep` module, the ``mkstringprep`` tool and the ``punycode`` encoding have been added.
es: Para implementar este cambio, se han agregado el módulo :mod:`stringprep`, la herramienta ``mkstringprep`` y la codificación ``punycode``.

source: Date/Time Type
es: Tipo de fecha / hora

source: Date and time types suitable for expressing timestamps were added as the :mod:`datetime` module. The types don't support different calendars or many fancy features, and just stick to the basics of representing time.
es: Se agregaron tipos de fecha y hora adecuados para expresar marcas de tiempo como módulo :mod:`datetime`. Los tipos no admiten diferentes calendarios ni muchas funciones sofisticadas, y solo se ciñen a los conceptos básicos de la representación del tiempo.

source: The three primary types are: :class:`date`, representing a day, month, and year; :class:`~datetime.time`, consisting of hour, minute, and second; and :class:`~datetime.datetime`, which contains all the attributes of both :class:`date` and :class:`~datetime.time`. There's also a :class:`timedelta` class representing differences between two points in time, and time zone logic is implemented by classes inheriting from the abstract :class:`tzinfo` class.
es: Los tres tipos principales son: :class:`date`, que representa un día, mes y año; :class:`~datetime.time`, que consta de hora, minuto y segundo; y :class:`~datetime.datetime`, que contiene todos los atributos de :class:`date` y :class:`~datetime.time`. También hay una clase :class:`timedelta` que representa las diferencias entre dos puntos en el tiempo, y la lógica de la zona horaria se implementa mediante clases que heredan de la clase :class:`tzinfo` abstracta.

source: You can create instances of :class:`date` and :class:`~datetime.time` by either supplying keyword arguments to the appropriate constructor, e.g. ``datetime.date(year=1972, month=10, day=15)``, or by using one of a number of class methods. For example, the :meth:`date.today` class method returns the current local date.
es: Puede crear instancias de :class:`date` y :class:`~datetime.time` proporcionando argumentos de palabras clave al constructor apropiado, p. Ej. ``datetime.date(year=1972, month=10, day=15)``, o utilizando uno de varios métodos de clase. Por ejemplo, el método de clase :meth:`date.today` devuelve la fecha local actual.

source: Once created, instances of the date/time classes are all immutable. There are a number of methods for producing formatted strings from objects::
es: Una vez creadas, las instancias de las clases de fecha / hora son inmutables. Hay varios métodos para producir cadenas formateadas a partir de objetos:

source: The :meth:`replace` method allows modifying one or more fields of a :class:`date` or :class:`~datetime.datetime` instance, returning a new instance::
es: El método :meth:`replace` permite modificar uno o más campos de una instancia :class:`date` o :class:`~datetime.datetime`, devolviendo una nueva instancia:

source: Instances can be compared, hashed, and converted to strings (the result is the same as that of :meth:`isoformat`). :class:`date` and :class:`~datetime.datetime` instances can be subtracted from each other, and added to :class:`timedelta` instances. The largest missing feature is that there's no standard library support for parsing strings and getting back a :class:`date` or :class:`~datetime.datetime`.
es: Las instancias se pueden comparar, aplicar hash y convertir en cadenas (el resultado es el mismo que el de :meth:`isoformat`). Las instancias de :class:`date` y :class:`~datetime.datetime` se pueden restar entre sí y agregarse a las instancias de :class:`timedelta`. La mayor característica que falta es que no hay soporte de biblioteca estándar para analizar cadenas y recuperar un :class:`date` o :class:`~datetime.datetime`.

source: For more information, refer to the module's reference documentation. (Contributed by Tim Peters.)
es: Para obtener más información, consulte la documentación de referencia del módulo. (Contribuido por Tim Peters.)

source: The optparse Module
es: El módulo optparse

source: The :mod:`getopt` module provides simple parsing of command-line arguments. The new :mod:`optparse` module (originally named Optik) provides more elaborate command-line parsing that follows the Unix conventions, automatically creates the output for :option:`!--help`, and can perform different actions for different options.
es: El módulo :mod:`getopt` proporciona un análisis sencillo de los argumentos de la línea de comandos. El nuevo módulo :mod:`optparse` (originalmente llamado Optik) proporciona un análisis de línea de comandos más elaborado que sigue las convenciones de Unix, crea automáticamente la salida para :option:`!--help` y puede realizar diferentes acciones para diferentes opciones.

source: You start by creating an instance of :class:`OptionParser` and telling it what your program's options are. ::
es: Empiece creando una instancia de :class:`OptionParser` y diciéndole cuáles son las opciones de su programa. ::

source: Parsing a command line is then done by calling the :meth:`parse_args` method. ::
es: Luego, el análisis de una línea de comando se realiza llamando al método :meth:`parse_args`. ::

source: This returns an object containing all of the option values, and a list of strings containing the remaining arguments.
es: Esto devuelve un objeto que contiene todos los valores de las opciones y una lista de cadenas que contienen los argumentos restantes.

source: Invoking the script with the various arguments now works as you'd expect it to. Note that the length argument is automatically converted to an integer.
es: Invocar el script con los distintos argumentos ahora funciona como era de esperar. Tenga en cuenta que el argumento de longitud se convierte automáticamente en un número entero.

source: The help message is automatically generated for you:
es: El mensaje de ayuda se genera automáticamente para usted:

source: See the module's documentation for more details.
es: Consulte la documentación del módulo para obtener más detalles.

source: Optik was written by Greg Ward, with suggestions from the readers of the Getopt SIG.
es: Optik fue escrito por Greg Ward, con sugerencias de los lectores de Getopt SIG.

source: Pymalloc: A Specialized Object Allocator
es: Pymalloc: un asignador de objetos especializado

source: Pymalloc, a specialized object allocator written by Vladimir Marangozov, was a feature added to Python 2.1. Pymalloc is intended to be faster than the system :c:func:`malloc` and to have less memory overhead for allocation patterns typical of Python programs. The allocator uses C's :c:func:`malloc` function to get large pools of memory and then fulfills smaller memory requests from these pools.
es: Pymalloc, un asignador de objetos especializado escrito por Vladimir Marangozov, fue una característica agregada a Python 2.1. Pymalloc está diseñado para ser más rápido que el sistema :c:func:`malloc` y tener menos sobrecarga de memoria para los patrones de asignación típicos de los programas Python. El asignador utiliza la función :c:func:`malloc` de C para obtener grandes grupos de memoria y luego satisface las solicitudes de memoria más pequeñas de estos grupos.

source: In 2.1 and 2.2, pymalloc was an experimental feature and wasn't enabled by default; you had to explicitly enable it when compiling Python by providing the :option:`!--with-pymalloc` option to the :program:`configure` script. In 2.3, pymalloc has had further enhancements and is now enabled by default; you'll have to supply :option:`!--without-pymalloc` to disable it.
es: En 2.1 y 2.2, pymalloc era una función experimental y no estaba habilitada de forma predeterminada; tenía que habilitarlo explícitamente al compilar Python proporcionando la opción :option:`!--with-pymalloc` al script: program: `configure`. En 2.3, pymalloc ha tenido más mejoras y ahora está habilitado de forma predeterminada; tendrá que suministrar :option:`!--without-pymalloc` para deshabilitarlo.

source: This change is transparent to code written in Python; however, pymalloc may expose bugs in C extensions. Authors of C extension modules should test their code with pymalloc enabled, because some incorrect code may cause core dumps at runtime.
es: Este cambio es transparente para el código escrito en Python; sin embargo, pymalloc puede exponer errores en las extensiones C. Los autores de los módulos de extensión C deben probar su código con pymalloc habilitado, ya que algunos códigos incorrectos pueden causar volcados de núcleo en tiempo de ejecución.

source: There's one particularly common error that causes problems. There are a number of memory allocation functions in Python's C API that have previously just been aliases for the C library's :c:func:`malloc` and :c:func:`free`, meaning that if you accidentally called mismatched functions the error wouldn't be noticeable. When the object allocator is enabled, these functions aren't aliases of :c:func:`malloc` and :c:func:`free` any more, and calling the wrong function to free memory may get you a core dump. For example, if memory was allocated using :c:func:`PyObject_Malloc`, it has to be freed using :c:func:`PyObject_Free`, not :c:func:`free`. A few modules included with Python fell afoul of this and had to be fixed; doubtless there are more third-party modules that will have the same problem.
es: Hay un error particularmente común que causa problemas. Hay una serie de funciones de asignación de memoria en la API C de Python que anteriormente solo eran alias para :c:func:`malloc` y :c:func:`free` de la biblioteca C, lo que significa que si llama accidentalmente a funciones que no coinciden, el error no se notará. Cuando el asignador de objetos está habilitado, estas funciones ya no son alias de :c:func:`malloc` y :c:func:`free`, y llamar a la función incorrecta para liberar memoria puede generar un volcado de memoria. Por ejemplo, si la memoria se asignó utilizando :c:func:`PyObject_Malloc`, debe liberarse utilizando :c:func:`PyObject_Free`, no :c:func:`free`. Algunos módulos incluidos con Python entraron en conflicto con esto y tuvieron que ser reparados; sin duda hay más módulos de terceros que tendrán el mismo problema.

source: As part of this change, the confusing multiple interfaces for allocating memory have been consolidated down into two API families. Memory allocated with one family must not be manipulated with functions from the other family. There is one family for allocating chunks of memory and another family of functions specifically for allocating Python objects.
es: Como parte de este cambio, las confusas interfaces múltiples para asignar memoria se han consolidado en dos familias de API. La memoria asignada a una familia no debe manipularse con funciones de la otra familia. Hay una familia para asignar fragmentos de memoria y otra familia de funciones específicamente para asignar objetos Python.

source: To allocate and free an undistinguished chunk of memory use the "raw memory" family: :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc`, and :c:func:`PyMem_Free`.
es: Para asignar y liberar una porción de memoria no distinguida, use la familia de "memoria sin procesar": :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` y :c:func:`PyMem_Free`.

source: The "object memory" family is the interface to the pymalloc facility described above and is biased towards a large number of "small" allocations: :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc`, and :c:func:`PyObject_Free`.
es: La familia de "memoria de objetos" es la interfaz para la instalación de pymalloc descrita anteriormente y está sesgada hacia un gran número de asignaciones "pequeñas": :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` y :c:func:`PyObject_Free`.

source: To allocate and free Python objects, use the "object" family :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, and :c:func:`PyObject_Del`.
es: Para asignar y liberar objetos de Python, utilice la familia de "objetos" :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` y :c:func:`PyObject_Del`.

source: Thanks to lots of work by Tim Peters, pymalloc in 2.3 also provides debugging features to catch memory overwrites and doubled frees in both extension modules and in the interpreter itself. To enable this support, compile a debugging version of the Python interpreter by running :program:`configure` with :option:`!--with-pydebug`.
es: Gracias al gran trabajo de Tim Peters, pymalloc en 2.3 también proporciona funciones de depuración para detectar sobrescrituras de memoria y liberaciones duplicadas en ambos módulos de extensión y en el propio intérprete. Para habilitar este soporte, compile una versión de depuración del intérprete de Python ejecutando: programa: `configure` con :option:`!--with-pydebug`.

source: To aid extension writers, a header file :file:`Misc/pymemcompat.h` is distributed with the source to Python 2.3 that allows Python extensions to use the 2.3 interfaces to memory allocation while compiling against any version of Python since 1.5.2. You would copy the file from Python's source distribution and bundle it with the source of your extension.
es: Para ayudar a los escritores de extensiones, se distribuye un archivo de encabezado :file:`Misc/pymemcompat.h` con la fuente a Python 2.3 que permite que las extensiones de Python usen las interfaces 2.3 para la asignación de memoria mientras se compila con cualquier versión de Python desde la 1.5.2. Debería copiar el archivo de la distribución fuente de Python y empaquetarlo con la fuente de su extensión.

source: For the full details of the pymalloc implementation, see the comments at the top of the file :file:`Objects/obmalloc.c` in the Python source code. The above link points to the file within the python.org SVN browser.
es: Para obtener todos los detalles de la implementación de pymalloc, consulte los comentarios en la parte superior del archivo :file:`Objects/obmalloc.c` en el código fuente de Python. El enlace anterior apunta al archivo dentro del navegador SVN de python.org.

source: Build and C API Changes
es: Cambios en la API de Build y C

source: Changes to Python's build process and to the C API include:
es: Los cambios en el proceso de compilación de Python y en la API de C incluyen:

source: The cycle detection implementation used by the garbage collection has proven to be stable, so it's now been made mandatory. You can no longer compile Python without it, and the :option:`!--with-cycle-gc` switch to :program:`configure` has been removed.
es: La implementación de detección de ciclos utilizada por la recolección de basura ha demostrado ser estable, por lo que ahora se ha hecho obligatoria. Ya no puede compilar Python sin él, y el cambio :option:`!--with-cycle-gc` a: program: `configure` ha sido eliminado.

source: Python can now optionally be built as a shared library (:file:`libpython2.3.so`) by supplying :option:`!--enable-shared` when running Python's :program:`configure` script. (Contributed by Ondrej Palkovsky.)
es: Python ahora se puede construir opcionalmente como una biblioteca compartida (:file:`libpython2.3.so`) proporcionando :option:`!--enable-shared` cuando se ejecuta el script Python: program: `configure`. (Contribuido por Ondrej Palkovsky.)

source: The :c:macro:`!DL_EXPORT` and :c:macro:`!DL_IMPORT` macros are now deprecated. Initialization functions for Python extension modules should now be declared using the new macro :c:macro:`PyMODINIT_FUNC`, while the Python core will generally use the :c:macro:`!PyAPI_FUNC` and :c:macro:`!PyAPI_DATA` macros.
es: Las macros :c:macro:`!DL_EXPORT` y :c:macro:`!DL_IMPORT` ahora están en desuso. Las funciones de inicialización para los módulos de extensión de Python ahora deben declararse usando la nueva macro :c:macro:`PyMODINIT_FUNC`, mientras que el núcleo de Python generalmente usará las macros :c:macro:`!PyAPI_FUNC` y :c:macro:`!PyAPI_DATA`.

source: The interpreter can be compiled without any docstrings for the built-in functions and modules by supplying :option:`!--without-doc-strings` to the :program:`configure` script. This makes the Python executable about 10% smaller, but will also mean that you can't get help for Python's built-ins. (Contributed by Gustavo Niemeyer.)
es: El intérprete se puede compilar sin ninguna cadena de documentación para las funciones y módulos incorporados proporcionando :option:`!--without-doc-strings` al script: program: `configure`. Esto hace que el ejecutable de Python sea un 10% más pequeño, pero también significa que no puede obtener ayuda para las funciones integradas de Python. (Contribución de Gustavo Niemeyer.)

source: The :c:func:`!PyArg_NoArgs` macro is now deprecated, and code that uses it should be changed. For Python 2.2 and later, the method definition table can specify the :c:macro:`METH_NOARGS` flag, signalling that there are no arguments, and the argument checking can then be removed. If compatibility with pre-2.2 versions of Python is important, the code could use ``PyArg_ParseTuple(args, "")`` instead, but this will be slower than using :c:macro:`METH_NOARGS`.
es: La macro :c:func:`!PyArg_NoArgs` ahora está en desuso y el código que la usa debe cambiarse. Para Python 2.2 y versiones posteriores, la tabla de definición de métodos puede especificar la marca :c:macro:`METH_NOARGS`, lo que indica que no hay argumentos, y luego se puede eliminar la verificación de argumentos. Si la compatibilidad con las versiones anteriores a la 2.2 de Python es importante, el código podría usar ``PyArg_ParseTuple(args, "")`` en su lugar, pero esto será más lento que usar :c:macro:`METH_NOARGS`.

source: :c:func:`PyArg_ParseTuple` accepts new format characters for various sizes of unsigned integers: ``B`` for :c:expr:`unsigned char`, ``H`` for :c:expr:`unsigned short int`, ``I`` for :c:expr:`unsigned int`, and ``K`` for :c:expr:`unsigned long long`.
es: :c:func:`PyArg_ParseTuple` acepta caracteres de nuevo formato para varios tamaños de enteros sin signo: ``B`` para :c:expr:`unsigned char`, ``H`` para :c:expr:`unsigned short int`, ``I`` para :c:expr:`unsigned int`, y ``K`` para :c:expr:`unsigned long long`.

source: A new function, ``PyObject_DelItemString(mapping, char *key)`` was added as shorthand for ``PyObject_DelItem(mapping, PyString_New(key))``.
es: Se agregó una nueva función, ``PyObject_DelItemString(mapping, char *key)``, como abreviatura de ``PyObject_DelItem(mapping, PyString_New(key))``.

source: File objects now manage their internal string buffer differently, increasing it exponentially when needed. This results in the benchmark tests in :file:`Lib/test/test_bufio.py` speeding up considerably (from 57 seconds to 1.7 seconds, according to one measurement).
es: Los objetos de archivo ahora administran su búfer de cadena interno de manera diferente, incrementándolo exponencialmente cuando es necesario. Esto da como resultado que las pruebas de referencia en :file:`Lib/test/test_bufio.py` se aceleren considerablemente (de 57 segundos a 1,7 segundos, según una medición).

source: It's now possible to define class and static methods for a C extension type by setting either the :c:macro:`METH_CLASS` or :c:macro:`METH_STATIC` flags in a method's :c:type:`PyMethodDef` structure.
es: Ahora es posible definir métodos estáticos y de clase para un tipo de extensión C configurando los indicadores :c:macro:`METH_CLASS` o :c:macro:`METH_STATIC` en la estructura :c:type:`PyMethodDef` de un método.

source: Python now includes a copy of the Expat XML parser's source code, removing any dependence on a system version or local installation of Expat.
es: Python ahora incluye una copia del código fuente del analizador XML de Expat, eliminando cualquier dependencia de una versión del sistema o instalación local de Expat.

source: If you dynamically allocate type objects in your extension, you should be aware of a change in the rules relating to the :attr:`__module__` and :attr:`~definition.__name__` attributes. In summary, you will want to ensure the type's dictionary contains a ``'__module__'`` key; making the module name the part of the type name leading up to the final period will no longer have the desired effect. For more detail, read the API reference documentation or the source.
es: Si asigna dinámicamente objetos de tipo en su extensión, debe tener en cuenta un cambio en las reglas relacionadas con los atributos :attr:`__module__` y :attr:`~definition.__name__`. En resumen, querrá asegurarse de que el diccionario del tipo contenga una clave ``'__module__'``; hacer que el nombre del módulo sea la parte del nombre del tipo que conduce al período final ya no tendrá el efecto deseado. Para obtener más detalles, lea la documentación de referencia de la API o la fuente.

source: Port-Specific Changes
es: Cambios específicos del puerto
