Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: Python now allows using arbitrary Unicode strings (within the limitations of the file system) for all functions that expect file names, most notably the :func:`open` built-in function. If a Unicode string is passed to :func:`os.listdir`, Python now returns a list of Unicode strings. A new function, :func:`os.getcwdu`, returns the current directory as a Unicode string.
es: Python permite ahora utilizar cadenas Unicode arbitrarias (dentro de las limitaciones del sistema de archivos) para todas las funciones que esperan nombres de archivos, sobre todo la función incorporada :func:`open`. Si se pasa una cadena Unicode a :func:`os.listdir`, Python retorna ahora una lista de cadenas Unicode. Una nueva función, :func:`os.getcwdu`, retorna el directorio actual como una cadena Unicode.

source: Byte strings still work as file names, and on Windows Python will transparently convert them to Unicode using the ``mbcs`` encoding.
es: Las cadenas de bytes siguen funcionando como nombres de archivo, y en Windows Python las convertirá de forma transparente a Unicode utilizando la codificación ``mbcs``.

source: Other systems also allow Unicode strings as file names but convert them to byte strings before passing them to the system, which can cause a :exc:`UnicodeError` to be raised. Applications can test whether arbitrary Unicode strings are supported as file names by checking :attr:`os.path.supports_unicode_filenames`, a Boolean value.
es: Otros sistemas también permiten cadenas Unicode como nombres de archivo, pero las convierten en cadenas de bytes antes de pasarlas al sistema, lo que puede provocar un :exc:`UnicodeError`. Las aplicaciones pueden comprobar si se admiten cadenas Unicode arbitrarias como nombres de archivo comprobando :attr:`os.path.supports_unicode_filenames`, un valor booleano.

source: Under MacOS, :func:`os.listdir` may now return Unicode filenames.
es: En MacOS, :func:`os.listdir` ahora puede retornar nombres de archivo Unicode.

source: :pep:`277` - Unicode file name support for Windows NT
es: :pep:`277` - Soporte de nombres de archivo Unicode para Windows NT

source: Written by Neil Hodgson; implemented by Neil Hodgson, Martin von Löwis, and Mark Hammond.
es: Escrito por Neil Hodgson; realizado por Neil Hodgson, Martin von Löwis y Mark Hammond.

source: PEP 278: Universal Newline Support
es: PEP 278: Soporte universal de nuevas líneas

source: The three major operating systems used today are Microsoft Windows, Apple's Macintosh OS, and the various Unix derivatives. A minor irritation of cross-platform work is that these three platforms all use different characters to mark the ends of lines in text files. Unix uses the linefeed (ASCII character 10), MacOS uses the carriage return (ASCII character 13), and Windows uses a two-character sequence of a carriage return plus a newline.
es: Los tres principales sistemas operativos que se utilizan hoy en día son Microsoft Windows, el sistema operativo Macintosh de Apple y los diversos derivados de Unix. Una pequeña molestia del trabajo entre plataformas es que estas tres plataformas utilizan diferentes caracteres para marcar el final de las líneas en los archivos de texto. Unix utiliza el salto de línea (carácter ASCII 10), MacOS utiliza el retorno de carro (carácter ASCII 13), y Windows utiliza una secuencia de dos caracteres de un retorno de carro más una nueva línea.

source: Python's file objects can now support end of line conventions other than the one followed by the platform on which Python is running. Opening a file with the mode ``'U'`` or ``'rU'`` will open a file for reading in :term:`universal newlines` mode. All three line ending conventions will be translated to a ``'\n'`` in the strings returned by the various file methods such as :meth:`read` and :meth:`readline`.
es: Los objetos de archivo de Python pueden ahora soportar convenciones de fin de línea distintas de la que sigue la plataforma en la que se ejecuta Python. Al abrir un archivo con el modo ``'U`` o ``'rU`` se abrirá un archivo para su lectura en modo :term:`universal newlines`. Las tres convenciones de final de línea se traducirán a un ``'\n'`` en las cadenas retornadas por los distintos métodos de archivo como :meth:`read` y :meth:`readline`.

source: Universal newline support is also used when importing modules and when executing a file with the :func:`execfile` function. This means that Python modules can be shared between all three operating systems without needing to convert the line-endings.
es: El soporte universal de nuevas líneas también se utiliza al importar módulos y al ejecutar un archivo con la función :func:`execfile`. Esto significa que los módulos de Python pueden ser compartidos entre los tres sistemas operativos sin necesidad de convertir los finales de línea.

source: This feature can be disabled when compiling Python by specifying the :option:`!--without-universal-newlines` switch when running Python's :program:`configure` script.
es: Esta función puede desactivarse al compilar Python especificando la opción :option:`!--without-universal-newlines` al ejecutar el script :program:`configure` de Python.

source: :pep:`278` - Universal Newline Support
es: :pep:`278` - Soporte universal de nuevas líneas

source: Written and implemented by Jack Jansen.
es: Escrito y ejecutado por Jack Jansen.

source: A new built-in function, :func:`enumerate`, will make certain loops a bit clearer. ``enumerate(thing)``, where *thing* is either an iterator or a sequence, returns an iterator that will return ``(0, thing[0])``, ``(1, thing[1])``, ``(2, thing[2])``, and so forth.
es: Una nueva función incorporada, :func:`enumerate`, hará que ciertos bucles sean un poco más claros. ``enumerate(cosa)``, donde *cosa* es un iterador o una secuencia, retorna un iterador que retornará ``(0, cosa[0])``, ``(1, cosa[1])``, ``(2, cosa[2])``, y así sucesivamente.

source: A common idiom to change every element of a list looks like this::
es: Un modismo común para cambiar cada elemento de una lista tiene el siguiente aspecto::

source: This can be rewritten using :func:`enumerate` as::
es: Esto se puede reescribir usando :func:`enumerate` como::

source: :pep:`279` - The enumerate() built-in function
es: :pep:`279` - La función incorporada enumerate()

source: Written and implemented by Raymond D. Hettinger.
es: Escrito y ejecutado por Raymond D. Hettinger.

source: PEP 282: The logging Package
es: PEP 282: El paquete de registro

source: A standard package for writing logs, :mod:`logging`, has been added to Python 2.3. It provides a powerful and flexible mechanism for generating logging output which can then be filtered and processed in various ways. A configuration file written in a standard format can be used to control the logging behavior of a program. Python includes handlers that will write log records to standard error or to a file or socket, send them to the system log, or even e-mail them to a particular address; of course, it's also possible to write your own handler classes.
es: Se ha añadido a Python 2.3 un paquete estándar para escribir registros, :mod:`logging`. Proporciona un mecanismo potente y flexible para generar salidas de registro que pueden ser filtradas y procesadas de varias maneras. Se puede utilizar un archivo de configuración escrito en un formato estándar para controlar el comportamiento de registro de un programa. Python incluye manejadores que escribirán los registros en el error estándar o en un archivo o socket, los enviarán al registro del sistema, o incluso los enviarán por correo electrónico a una dirección particular; por supuesto, también es posible escribir tus propias clases de manejadores.

source: The :class:`Logger` class is the primary class. Most application code will deal with one or more :class:`Logger` objects, each one used by a particular subsystem of the application. Each :class:`Logger` is identified by a name, and names are organized into a hierarchy using ``.`` as the component separator. For example, you might have :class:`Logger` instances named ``server``, ``server.auth`` and ``server.network``. The latter two instances are below ``server`` in the hierarchy. This means that if you turn up the verbosity for ``server`` or direct ``server`` messages to a different handler, the changes will also apply to records logged to ``server.auth`` and ``server.network``. There's also a root :class:`Logger` that's the parent of all other loggers.
es: La clase :class:`Logger` es la clase principal. La mayoría del código de la aplicación tratará con uno o más objetos :class:`Logger`, cada uno utilizado por un subsistema particular de la aplicación. Cada :class:`Logger` se identifica con un nombre, y los nombres se organizan en una jerarquía utilizando ``.`` como separador de componentes. Por ejemplo, puedes tener instancias de :class:`Logger` llamadas ``servidor``, ``servidor.auth`` y ``servidor.network``. Estas dos últimas instancias están por debajo de ``servidor`` en la jerarquía. Esto significa que si aumentas la verbosidad de ``servidor`` o diriges los mensajes de ``servidor`` a un gestor diferente, los cambios también se aplicarán a los registros de ``servidor.auth`` y ``servidor.network``. También hay un :class:`Logger` raíz que es el padre de todos los demás loggers.

source: For simple uses, the :mod:`logging` package contains some convenience functions that always use the root log::
es: Para usos sencillos, el paquete :mod:`logging` contiene algunas funciones de conveniencia que siempre utilizan la raíz log::

source: This produces the following output::
es: Esto produce la siguiente salida::

source: In the default configuration, informational and debugging messages are suppressed and the output is sent to standard error. You can enable the display of informational and debugging messages by calling the :meth:`setLevel` method on the root logger.
es: En la configuración por defecto, los mensajes informativos y de depuración se suprimen y la salida se envía al error estándar. Puede habilitar la visualización de mensajes informativos y de depuración llamando al método :meth:`setLevel` del registrador raíz.

source: Notice the :func:`warning` call's use of string formatting operators; all of the functions for logging messages take the arguments ``(msg, arg1, arg2, ...)`` and log the string resulting from ``msg % (arg1, arg2, ...)``.
es: Observe que la llamada :func:`warning` utiliza operadores de formato de cadena; todas las funciones para el registro de mensajes toman los argumentos ``(msg, arg1, arg2, ...)`` y registran la cadena resultante de ``msg % (arg1, arg2, ...)``.

source: There's also an :func:`exception` function that records the most recent traceback. Any of the other functions will also record the traceback if you specify a true value for the keyword argument *exc_info*. ::
es: También hay una función :func:`exception` que registra el rastro más reciente. Cualquiera de las otras funciones también registrará el rastro si se especifica un valor verdadero para el argumento de la palabra clave *exc_info*. ::

source: Slightly more advanced programs will use a logger other than the root logger. The ``getLogger(name)`` function is used to get a particular log, creating it if it doesn't exist yet. ``getLogger(None)`` returns the root logger. ::
es: Los programas un poco más avanzados utilizarán un logger distinto del logger raíz. La función ``getLogger(nombre)`` se utiliza para obtener un registro en particular, creándolo si aún no existe. ``getLogger(None)`` retorna el logger raíz. ::

source: Log records are usually propagated up the hierarchy, so a message logged to ``server.auth`` is also seen by ``server`` and ``root``, but a :class:`Logger` can prevent this by setting its :attr:`propagate` attribute to :const:`False`.
es: Los registros se suelen propagar hacia arriba en la jerarquía, por lo que un mensaje registrado en ``servidor.auth`` también es visto por ``servidor`` y ``root``, pero un :class:`Logger` puede evitar esto estableciendo su atributo :attr:`propagate` a :const:`False`.

source: There are more classes provided by the :mod:`logging` package that can be customized. When a :class:`Logger` instance is told to log a message, it creates a :class:`LogRecord` instance that is sent to any number of different :class:`Handler` instances. Loggers and handlers can also have an attached list of filters, and each filter can cause the :class:`LogRecord` to be ignored or can modify the record before passing it along. When they're finally output, :class:`LogRecord` instances are converted to text by a :class:`Formatter` class. All of these classes can be replaced by your own specially written classes.
es: Hay más clases proporcionadas por el paquete :mod:`logging` que se pueden personalizar. Cuando se le indica a una instancia :class:`Logger` que registre un mensaje, crea una instancia :class:`LogRecord` que se envía a cualquier cantidad de instancias :class:`Handler` diferentes. Los registradores y los controladores también pueden tener una lista adjunta de filtros, y cada filtro puede hacer que se ignore el :class:`LogRecord` o puede modificar el registro antes de pasarlo. Cuando finalmente se emiten, las instancias :class:`LogRecord` se convierten en texto mediante una clase :class:`Formatter`. Todas estas clases pueden ser reemplazadas por sus propias clases especialmente escritas.

source: With all of these features the :mod:`logging` package should provide enough flexibility for even the most complicated applications. This is only an incomplete overview of its features, so please see the package's reference documentation for all of the details. Reading :pep:`282` will also be helpful.
es: Con todas estas características, el paquete :mod:`logging` debería proporcionar suficiente flexibilidad incluso para las aplicaciones más complicadas. Esto es sólo un resumen incompleto de sus características, así que por favor consulte la documentación de referencia del paquete para todos los detalles. La lectura de :pep:`282` también será útil.

source: :pep:`282` - A Logging System
es: :pep:`282` - Un sistema de registro

source: Written by Vinay Sajip and Trent Mick; implemented by Vinay Sajip.
es: Escrito por Vinay Sajip y Trent Mick; implementado por Vinay Sajip.

source: PEP 285: A Boolean Type
es: PEP 285: Un tipo booleano

source: A Boolean type was added to Python 2.3. Two new constants were added to the :mod:`__builtin__` module, :const:`True` and :const:`False`. (:const:`True` and :const:`False` constants were added to the built-ins in Python 2.2.1, but the 2.2.1 versions are simply set to integer values of 1 and 0 and aren't a different type.)
es: Se ha añadido un tipo booleano a Python 2.3. Se añadieron dos nuevas constantes al módulo :mod:`__builtin__`, :const:`True` y :const:`False`. (Las constantes :const:`True` y :const:`False` se añadieron a los módulos incorporados en Python 2.2.1, pero las versiones de 2.2.1 se ajustan simplemente a valores enteros de 1 y 0 y no son un tipo diferente)

source: The type object for this new type is named :class:`bool`; the constructor for it takes any Python value and converts it to :const:`True` or :const:`False`. ::
es: El objeto de tipo para este nuevo tipo se denomina :class:`bool`; su constructor toma cualquier valor de Python y lo convierte en :const:`True` o :const:`False`. ::

source: Most of the standard library modules and built-in functions have been changed to return Booleans. ::
es: La mayoría de los módulos de la biblioteca estándar y las funciones incorporadas se han modificado para retornar booleanos. ::

source: Python's Booleans were added with the primary goal of making code clearer. For example, if you're reading a function and encounter the statement ``return 1``, you might wonder whether the ``1`` represents a Boolean truth value, an index, or a coefficient that multiplies some other quantity. If the statement is ``return True``, however, the meaning of the return value is quite clear.
es: Los booleanos de Python se añadieron con el objetivo principal de hacer el código más claro. Por ejemplo, si estás leyendo una función y te encuentras con la sentencia ``return 1``, podrías preguntarte si el ``1`` representa un valor de verdad booleano, un índice o un coeficiente que multiplica alguna otra cantidad. Sin embargo, si la sentencia es ``return True``, el significado del valor de retorno es bastante claro.

source: Python's Booleans were *not* added for the sake of strict type-checking. A very strict language such as Pascal would also prevent you performing arithmetic with Booleans, and would require that the expression in an :keyword:`if` statement always evaluate to a Boolean result. Python is not this strict and never will be, as :pep:`285` explicitly says. This means you can still use any expression in an :keyword:`!if` statement, even ones that evaluate to a list or tuple or some random object. The Boolean type is a subclass of the :class:`int` class so that arithmetic using a Boolean still works. ::
es: Los booleanos de Python *no* se añadieron en aras de una comprobación de tipos estricta. Un lenguaje muy estricto como Pascal también le impediría realizar aritmética con booleanos, y requeriría que la expresión en una declaración :keyword:`if` siempre se evaluara a un resultado booleano. Python no es tan estricto y nunca lo será, como dice explícitamente :pep:`285`. Esto significa que puede utilizar cualquier expresión en una sentencia :keyword:`!if`, incluso las que se evalúan a una lista o tupla o algún objeto aleatorio. El tipo Booleano es una subclase de la clase :class:`int` por lo que la aritmética que utiliza un Booleano sigue funcionando. ::

source: To sum up :const:`True` and :const:`False` in a sentence: they're alternative ways to spell the integer values 1 and 0, with the single difference that :func:`str` and :func:`repr` return the strings ``'True'`` and ``'False'`` instead of ``'1'`` and ``'0'``.
es: Para resumir :const:`True` and :const:`False` en una frase: son formas alternativas de deletrear los valores enteros 1 y 0, con la única diferencia de que :func:`str` y :func:`repr` retornan las cadenas ``Verdadero`` y ``Falso`` en lugar de ``1`` y ``0``.

source: :pep:`285` - Adding a bool type
es: :pep:`285` - Añadir un tipo booleano

source: Written and implemented by GvR.
es: Escrito y ejecutado por GvR.

source: PEP 293: Codec Error Handling Callbacks
es: PEP 293: Llamadas de retorno para el manejo de errores del códec

source: When encoding a Unicode string into a byte string, unencodable characters may be encountered. So far, Python has allowed specifying the error processing as either "strict" (raising :exc:`UnicodeError`), "ignore" (skipping the character), or "replace" (using a question mark in the output string), with "strict" being the default behavior. It may be desirable to specify alternative processing of such errors, such as inserting an XML character reference or HTML entity reference into the converted string.
es: Al codificar una cadena Unicode en una cadena de bytes, pueden encontrarse caracteres no codificables. Hasta ahora, Python ha permitido especificar el procesamiento del error como "estricto" (lanzando :exc:`UnicodeError`), "ignorar" (saltando el carácter), o "reemplazar" (usando un signo de interrogación en la cadena de salida), siendo "estricto" el comportamiento por defecto. Puede ser deseable especificar un procesamiento alternativo de tales errores, como insertar una referencia de carácter XML o una referencia de entidad HTML en la cadena convertida.

source: Python now has a flexible framework to add different processing strategies. New error handlers can be added with :func:`codecs.register_error`, and codecs then can access the error handler with :func:`codecs.lookup_error`. An equivalent C API has been added for codecs written in C. The error handler gets the necessary state information such as the string being converted, the position in the string where the error was detected, and the target encoding. The handler can then either raise an exception or return a replacement string.
es: Python tiene ahora un marco flexible para añadir diferentes estrategias de procesamiento. Se pueden añadir nuevos manejadores de errores con :func:`codecs.register_error`, y los códecs pueden acceder al manejador de errores con :func:`codecs.lookup_error`. Se ha añadido una API en C equivalente para los códecs escritos en C. El gestor de errores obtiene la información de estado necesaria, como la cadena que se está convirtiendo, la posición en la cadena donde se ha detectado el error y la codificación de destino. El controlador puede entonces lanzar una excepción o retornar una cadena de reemplazo.

source: Two additional error handlers have been implemented using this framework: "backslashreplace" uses Python backslash quoting to represent unencodable characters and "xmlcharrefreplace" emits XML character references.
es: Se han implementado dos manejadores de error adicionales utilizando este marco: "backslashreplace" utiliza las comillas de barra invertida de Python para representar los caracteres no codificables y "xmlcharrefreplace" emite referencias de caracteres XML.

source: :pep:`293` - Codec Error Handling Callbacks
es: :pep:`293` - Retrollamadas de manejo de errores del códec

source: Written and implemented by Walter Dörwald.
es: Escrito y ejecutado por Walter Dörwald.

source: PEP 301: Package Index and Metadata for Distutils
es: PEP 301: Índice de paquetes y metadatos para Distutils

source: Support for the long-requested Python catalog makes its first appearance in 2.3.
es: La compatibilidad con el catálogo de Python, largamente solicitada, hace su primera aparición en 2.3.

source: The heart of the catalog is the new Distutils :command:`register` command. Running ``python setup.py register`` will collect the metadata describing a package, such as its name, version, maintainer, description, &c., and send it to a central catalog server. The resulting catalog is available from https://pypi.org.
es: El corazón del catálogo es el nuevo comando :command:`register` de Distutils. Ejecutando ``python setup.py register`` se recogen los metadatos que describen un paquete, como su nombre, versión, mantenedor, descripción, etc., y se envían a un servidor de catálogo central. El catálogo resultante está disponible en https://pypi.org.

source: To make the catalog a bit more useful, a new optional *classifiers* keyword argument has been added to the Distutils :func:`setup` function. A list of `Trove <http://catb.org/~esr/trove/>`_-style strings can be supplied to help classify the software.
es: Para hacer el catálogo un poco más útil, se ha añadido un nuevo argumento opcional de palabra clave *clasificadores* a la función Distutils :func:`setup`. Se puede suministrar una lista de cadenas de estilo `Trove <http://catb.org/~esr/trove/>`_ para ayudar a clasificar el software.

source: Here's an example :file:`setup.py` with classifiers, written to be compatible with older versions of the Distutils::
es: Aquí hay un ejemplo :file:`setup.py` con clasificadores, escrito para que sea compatible con las versiones más antiguas de Distutils::

source: The full list of classifiers can be obtained by running ``python setup.py register --list-classifiers``.
es: La lista completa de clasificadores se puede obtener ejecutando ``python setup.py register --list-classifiers``.

source: :pep:`301` - Package Index and Metadata for Distutils
es: :pep:`301` - Índice de paquetes y metadatos para Distutils

source: Written and implemented by Richard Jones.
es: Escrito y ejecutado por Richard Jones.

source: PEP 302: New Import Hooks
es: PEP 302: Nuevos ganchos de importación
