Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: While it's been possible to write custom import hooks ever since the :mod:`ihooks` module was introduced in Python 1.3, no one has ever been really happy with it because writing new import hooks is difficult and messy. There have been various proposed alternatives such as the :mod:`imputil` and :mod:`iu` modules, but none of them has ever gained much acceptance, and none of them were easily usable from C code.
es: Aunque ha sido posible escribir ganchos de importación personalizados desde que se introdujo el módulo :mod:`ihooks` en Python 1.3, nadie ha estado nunca realmente contento con él porque escribir nuevos ganchos de importación es difícil y complicado. Se han propuesto varias alternativas, como los módulos :mod:`imputil` y :mod:`iu`, pero ninguno de ellos ha tenido mucha aceptación, y ninguno era fácilmente utilizable desde el código C.

source: :pep:`302` borrows ideas from its predecessors, especially from Gordon McMillan's :mod:`iu` module. Three new items are added to the :mod:`sys` module:
es: :pep:`302` toma prestadas ideas de sus predecesores, especialmente del módulo :mod:`iu` de Gordon McMillan. Se añaden tres nuevos elementos al módulo :mod:`sys`:

source: ``sys.path_hooks`` is a list of callable objects; most often they'll be classes. Each callable takes a string containing a path and either returns an importer object that will handle imports from this path or raises an :exc:`ImportError` exception if it can't handle this path.
es: ``sys.path_hooks`` es una lista de objetos invocables; la mayoría de las veces serán clases. Cada llamada toma una cadena que contiene una ruta y retorna un objeto importador que manejará las importaciones desde esta ruta o lanza una excepción :exc:`ImportError` si no puede manejar esta ruta.

source: ``sys.path_importer_cache`` caches importer objects for each path, so ``sys.path_hooks`` will only need to be traversed once for each path.
es: ``sys.path_importer_cache`` almacena en caché los objetos del importador para cada ruta, por lo que ``sys.path_hooks`` sólo tendrá que ser recorrido una vez para cada ruta.

source: ``sys.meta_path`` is a list of importer objects that will be traversed before ``sys.path`` is checked. This list is initially empty, but user code can add objects to it. Additional built-in and frozen modules can be imported by an object added to this list.
es: ``sys.meta_path`` es una lista de objetos importadores que se recorrerán antes de comprobar ``sys.path``. Esta lista está inicialmente vacía, pero el código de usuario puede añadir objetos a ella. Los módulos adicionales incorporados y congelados pueden ser importados por un objeto añadido a esta lista.

source: Importer objects must have a single method, ``find_module(fullname, path=None)``. *fullname* will be a module or package name, e.g. ``string`` or ``distutils.core``. :meth:`!find_module` must return a loader object that has a single method, ``load_module(fullname)``, that creates and returns the corresponding module object.
es: Los objetos importadores deben tener un único método, ``find_module(fullname, path=None)``. *fullname* será un nombre de módulo o paquete, por ejemplo ``string`` o ``distutils.core``. :meth:`!find_module` debe retornar un objeto cargador que tenga un único método, ``load_module(fullname)``, que cree y retorne el objeto módulo correspondiente.

source: Pseudo-code for Python's new import logic, therefore, looks something like this (simplified a bit; see :pep:`302` for the full details)::
es: Por lo tanto, el pseudocódigo de la nueva lógica de importación de Python es algo así (simplificado un poco; véase :pep:`302` para los detalles completos)::

source: :pep:`302` - New Import Hooks
es: :pep:`302` - Nuevos ganchos de importación

source: Written by Just van Rossum and Paul Moore. Implemented by Just van Rossum.
es: Escrito por Just van Rossum y Paul Moore. Implementado por Just van Rossum.

source: PEP 305: Comma-separated Files
es: PEP 305: Archivos separados por comas

source: Comma-separated files are a format frequently used for exporting data from databases and spreadsheets. Python 2.3 adds a parser for comma-separated files.
es: Los archivos separados por comas son un formato frecuentemente utilizado para exportar datos de bases de datos y hojas de cálculo. Python 2.3 añade un analizador de archivos separados por comas.

source: Comma-separated format is deceptively simple at first glance::
es: El formato separado por comas es engañosamente sencillo a primera vista::

source: Read a line and call ``line.split(',')``: what could be simpler? But toss in string data that can contain commas, and things get more complicated::
es: Leer una línea y llamar a ``line.split(',')``: ¿qué puede ser más sencillo? Pero si se añaden datos de cadena que pueden contener comas, las cosas se complican::

source: A big ugly regular expression can parse this, but using the new :mod:`csv` package is much simpler::
es: Una expresión regular grande y fea puede analizar esto, pero usar el nuevo paquete :mod:`csv` es mucho más sencillo::

source: The :func:`reader` function takes a number of different options. The field separator isn't limited to the comma and can be changed to any character, and so can the quoting and line-ending characters.
es: La función :func:`reader` admite varias opciones. El separador de campos no se limita a la coma y puede cambiarse por cualquier carácter, al igual que las comillas y el final de línea.

source: Different dialects of comma-separated files can be defined and registered; currently there are two dialects, both used by Microsoft Excel. A separate :class:`csv.writer` class will generate comma-separated files from a succession of tuples or lists, quoting strings that contain the delimiter.
es: Se pueden definir y registrar diferentes dialectos de archivos separados por comas; actualmente hay dos dialectos, ambos utilizados por Microsoft Excel. Una clase :class:`csv.writer` independiente generará archivos separados por comas a partir de una sucesión de tuplas o listas, citando cadenas que contengan el delimitador.

source: :pep:`305` - CSV File API
es: :pep:`305` - API de archivos CSV

source: Written and implemented by Kevin Altis, Dave Cole, Andrew McNamara, Skip Montanaro, Cliff Wells.
es: Escrito y realizado por Kevin Altis, Dave Cole, Andrew McNamara, Skip Montanaro, Cliff Wells.

source: PEP 307: Pickle Enhancements
es: PEP 307: Mejoras en Pickle

source: The :mod:`pickle` and :mod:`cPickle` modules received some attention during the 2.3 development cycle. In 2.2, new-style classes could be pickled without difficulty, but they weren't pickled very compactly; :pep:`307` quotes a trivial example where a new-style class results in a pickled string three times longer than that for a classic class.
es: Los módulos :mod:`pickle` y :mod:`cPickle` recibieron cierta atención durante el ciclo de desarrollo de la 2.3. En 2.2, las clases de estilo nuevo podían ser desempaquetadas sin dificultad, pero no se desempaquetaba de forma muy compacta; :pep:`307` cita un ejemplo trivial en el que una clase de estilo nuevo da lugar a una cadena desempaquetada tres veces más larga que la de una clase clásica.

source: The solution was to invent a new pickle protocol. The :func:`pickle.dumps` function has supported a text-or-binary flag for a long time. In 2.3, this flag is redefined from a Boolean to an integer: 0 is the old text-mode pickle format, 1 is the old binary format, and now 2 is a new 2.3-specific format. A new constant, :const:`pickle.HIGHEST_PROTOCOL`, can be used to select the fanciest protocol available.
es: La solución fue inventar un nuevo protocolo pickle. La función :func:`pickle.dumps` soporta desde hace tiempo una bandera de texto o binario. En la versión 2.3, esta bandera se ha redefinido, pasando de ser un booleano a un entero: 0 es el antiguo formato pickle en modo texto, 1 es el antiguo formato binario, y ahora 2 es un nuevo formato específico de 2.3. Una nueva constante, :const:`pickle.HIGHEST_PROTOCOL`, puede utilizarse para seleccionar el protocolo más elegante disponible.

source: Unpickling is no longer considered a safe operation. 2.2's :mod:`pickle` provided hooks for trying to prevent unsafe classes from being unpickled (specifically, a :attr:`__safe_for_unpickling__` attribute), but none of this code was ever audited and therefore it's all been ripped out in 2.3. You should not unpickle untrusted data in any version of Python.
es: El unpickling ya no se considera una operación segura. El :mod:`pickle` de la versión 2.2 proporcionaba ganchos para tratar de evitar que las clases no seguras fueran deserializadas (específicamente, un atributo :attr:`__safe_for_unpickling__`), pero nada de este código fue nunca auditado y por lo tanto todo ha sido eliminado en la versión 2.3. No se debe deserializar datos no confiables en ninguna versión de Python.

source: To reduce the pickling overhead for new-style classes, a new interface for customizing pickling was added using three special methods: :meth:`__getstate__`, :meth:`__setstate__`, and :meth:`__getnewargs__`. Consult :pep:`307` for the full semantics of these methods.
es: Para reducir la sobrecarga de pickling de las clases de estilo nuevo, se ha añadido una nueva interfaz para personalizar el pickling mediante tres métodos especiales: :meth:`__getstate__`, :meth:`__setstate__`, y :meth:`__getnewargs__`. Consulte :pep:`307` para conocer la semántica completa de estos métodos.

source: As a way to compress pickles yet further, it's now possible to use integer codes instead of long strings to identify pickled classes. The Python Software Foundation will maintain a list of standardized codes; there's also a range of codes for private use. Currently no codes have been specified.
es: Como forma de comprimir aún más los pickles, ahora es posible utilizar códigos enteros en lugar de cadenas largas para identificar las clases serializadas. La Python Software Foundation mantendrá una lista de códigos estandarizados; también hay una gama de códigos para uso privado. Actualmente no se ha especificado ningún código.

source: :pep:`307` - Extensions to the pickle protocol
es: :pep:`307` - Extensiones del protocolo pickle

source: Written and implemented by Guido van Rossum and Tim Peters.
es: Escrito y ejecutado por Guido van Rossum y Tim Peters.

source: Extended Slices
es: Rebanadas ampliadas

source: Ever since Python 1.4, the slicing syntax has supported an optional third "step" or "stride" argument. For example, these are all legal Python syntax: ``L[1:10:2]``, ``L[:-1:1]``, ``L[::-1]``. This was added to Python at the request of the developers of Numerical Python, which uses the third argument extensively. However, Python's built-in list, tuple, and string sequence types have never supported this feature, raising a :exc:`TypeError` if you tried it. Michael Hudson contributed a patch to fix this shortcoming.
es: Desde la versión 1.4 de Python, la sintaxis de corte admite un tercer argumento opcional "paso" o "zancada". Por ejemplo, estas son todas las sintaxis legales de Python: ``L[1:10:2]``, ``L[:-1:1]``, ``L[::-1]``. Esto se añadió a Python a petición de los desarrolladores de Numerical Python, que utiliza ampliamente el tercer argumento. Sin embargo, los tipos de secuencias de listas, tuplas y cadenas incorporados en Python nunca han soportado esta característica, y lanzan un :exc:`TypeError` si lo intentas. Michael Hudson ha contribuido con un parche para solucionar este problema.

source: For example, you can now easily extract the elements of a list that have even indexes::
es: Por ejemplo, ahora puede extraer fácilmente los elementos de una lista que tengan índices pares::

source: Negative values also work to make a copy of the same list in reverse order::
es: Los valores negativos también sirven para hacer una copia de la misma lista en orden inverso::

source: This also works for tuples, arrays, and strings::
es: Esto también funciona para tuplas, arrays y cadenas::

source: If you have a mutable sequence such as a list or an array you can assign to or delete an extended slice, but there are some differences between assignment to extended and regular slices. Assignment to a regular slice can be used to change the length of the sequence::
es: Si tienes una secuencia mutable, como una lista o un array, puedes asignar o eliminar una rebanada extendida, pero hay algunas diferencias entre la asignación a rebanadas extendidas y regulares. La asignación a una rebanada regular se puede utilizar para cambiar la longitud de la secuencia::

source: Extended slices aren't this flexible. When assigning to an extended slice, the list on the right hand side of the statement must contain the same number of items as the slice it is replacing::
es: Las rebanadas extendidas no son tan flexibles. Cuando se asigna a una rebanada extendida, la lista a la derecha de la declaración debe contener el mismo número de elementos que la rebanada que está reemplazando::

source: Deletion is more straightforward::
es: La eliminación es más sencilla::

source: One can also now pass slice objects to the :meth:`__getitem__` methods of the built-in sequences::
es: Ahora también se pueden pasar objetos slice a los métodos :meth:`__getitem__` de las secuencias incorporadas::

source: Or use slice objects directly in subscripts::
es: O utilizar los objetos de corte directamente en los subíndices::

source: To simplify implementing sequences that support extended slicing, slice objects now have a method ``indices(length)`` which, given the length of a sequence, returns a ``(start, stop, step)`` tuple that can be passed directly to :func:`range`. :meth:`indices` handles omitted and out-of-bounds indices in a manner consistent with regular slices (and this innocuous phrase hides a welter of confusing details!). The method is intended to be used like this::
es: Para simplificar la implementación de secuencias que soportan el corte extendido, los objetos slice tienen ahora un método ``indices(length)`` que, dada la longitud de una secuencia, retorna una tupla ``(start, stop, step)`` que puede pasarse directamente a :func:`range`. :meth:`indices` maneja los índices omitidos y los que están fuera de los límites de una manera consistente con los slices regulares (¡y esta frase inocua esconde un montón de detalles confusos!). El método está pensado para ser utilizado así::

source: From this example you can also see that the built-in :class:`slice` object is now the type object for the slice type, and is no longer a function. This is consistent with Python 2.2, where :class:`int`, :class:`str`, etc., underwent the same change.
es: En este ejemplo también se puede ver que el objeto incorporado :class:`slice` es ahora el objeto tipo para el tipo slice, y ya no es una función. Esto es consistente con Python 2.2, donde :class:`int`, :class:`str`, etc., sufrieron el mismo cambio.

source: Other Language Changes
es: Otros cambios en el lenguaje

source: Here are all of the changes that Python 2.3 makes to the core Python language.
es: Estos son todos los cambios que Python 2.3 introduce en el núcleo del lenguaje Python.

source: The :keyword:`yield` statement is now always a keyword, as described in section :ref:`section-generators` of this document.
es: La expresión :keyword:`yield` es ahora siempre una palabra clave, como se describe en la sección :ref:`section-generators` de este documento.

source: A new built-in function :func:`enumerate` was added, as described in section :ref:`section-enumerate` of this document.
es: Se ha añadido una nueva función incorporada :func:`enumerate`, como se describe en la sección :ref:`section-enumerate` de este documento.

source: Two new constants, :const:`True` and :const:`False` were added along with the built-in :class:`bool` type, as described in section :ref:`section-bool` of this document.
es: Se han añadido dos nuevas constantes, :const:`True` y :const:`False` junto con el tipo incorporado :class:`bool`, como se describe en la sección :ref:`section-bool` de este documento.

source: The :func:`int` type constructor will now return a long integer instead of raising an :exc:`OverflowError` when a string or floating-point number is too large to fit into an integer. This can lead to the paradoxical result that ``isinstance(int(expression), int)`` is false, but that seems unlikely to cause problems in practice.
es: El constructor de tipo :func:`int` ahora retornará un entero largo en lugar de lanzar un :exc:`OverflowError` cuando una cadena o un número de punto flotante es demasiado grande para caber en un entero. Esto puede llevar al resultado paradójico de que ``isinstance(int(expresión), int)`` sea falso, pero parece poco probable que cause problemas en la práctica.

source: Built-in types now support the extended slicing syntax, as described in section :ref:`section-slices` of this document.
es: Los tipos incorporados ahora soportan la sintaxis de rebanado extendida, como se describe en la sección :ref:`section-slices` de este documento.

source: A new built-in function, ``sum(iterable, start=0)``, adds up the numeric items in the iterable object and returns their sum. :func:`sum` only accepts numbers, meaning that you can't use it to concatenate a bunch of strings. (Contributed by Alex Martelli.)
es: Una nueva función incorporada, ``suma(iterable, start=0)``, suma los elementos numéricos en el objeto iterable y retorna su suma. :func:`suma` sólo acepta números, lo que significa que no se puede utilizar para concatenar un montón de cadenas. (Contribución de Alex Martelli)

source: ``list.insert(pos, value)`` used to insert *value* at the front of the list when *pos* was negative. The behaviour has now been changed to be consistent with slice indexing, so when *pos* is -1 the value will be inserted before the last element, and so forth.
es: ``list.insert(pos, valor)`` solía insertar *valor* al principio de la lista cuando *pos* era negativo. El comportamiento ha sido cambiado para ser consistente con la indexación de las rebanadas, así que cuando *pos* es -1 el valor será insertado antes del último elemento, y así sucesivamente.

source: ``list.index(value)``, which searches for *value* within the list and returns its index, now takes optional *start* and *stop* arguments to limit the search to only part of the list.
es: ``list.index(value)``, que busca *valor* dentro de la lista y retorna su índice, ahora toma los argumentos opcionales *start* y *stop* para limitar la búsqueda sólo a una parte de la lista.

source: Dictionaries have a new method, ``pop(key[, *default*])``, that returns the value corresponding to *key* and removes that key/value pair from the dictionary. If the requested key isn't present in the dictionary, *default* is returned if it's specified and :exc:`KeyError` raised if it isn't. ::
es: Los diccionarios tienen un nuevo método, ``pop(key[, *default*])``, que retorna el valor correspondiente a *key* y elimina ese par clave/valor del diccionario. Si la clave solicitada no está presente en el diccionario, se retorna *default* si está especificada y se lanza :exc:`KeyError` si no lo está:

source: There's also a new class method, ``dict.fromkeys(iterable, value)``, that creates a dictionary with keys taken from the supplied iterator *iterable* and all values set to *value*, defaulting to ``None``.
es: También hay un nuevo método de clase, ``dict.fromkeys(iterable, value)``, que crea un diccionario con claves tomadas del iterador *iterable* suministrado y todos los valores establecidos a *value*, por defecto a ``None``.

source: (Patches contributed by Raymond Hettinger.)
es: (Parches aportados por Raymond Hettinger)

source: Also, the :func:`dict` constructor now accepts keyword arguments to simplify creating small dictionaries::
es: Además, el constructor :func:`dict` ahora acepta argumentos de palabras clave para simplificar la creación de pequeños diccionarios::

source: (Contributed by Just van Rossum.)
es: (Contribución de Just van Rossum.)

source: The :keyword:`assert` statement no longer checks the ``__debug__`` flag, so you can no longer disable assertions by assigning to ``__debug__``. Running Python with the :option:`-O` switch will still generate code that doesn't execute any assertions.
es: La expresión :keyword:`assert` ya no comprueba la bandera ``debug__``, por lo que ya no se pueden desactivar las aserciones asignando a ``__debug__``. Ejecutar Python con la opción :option:`-O` seguirá generando código que no ejecute ninguna aserción.

source: Most type objects are now callable, so you can use them to create new objects such as functions, classes, and modules. (This means that the :mod:`new` module can be deprecated in a future Python version, because you can now use the type objects available in the :mod:`types` module.) For example, you can create a new module object with the following code:
es: La mayoría de los objetos de tipo son ahora invocables, por lo que puedes usarlos para crear nuevos objetos como funciones, clases y módulos. (Esto significa que el módulo :mod:`new` puede quedar obsoleto en una futura versión de Python, porque ahora puedes utilizar los objetos de tipo disponibles en el módulo :mod:`types`) Por ejemplo, puede crear un nuevo objeto de módulo con el siguiente código:

source: A new warning, :exc:`PendingDeprecationWarning` was added to indicate features which are in the process of being deprecated. The warning will *not* be printed by default. To check for use of features that will be deprecated in the future, supply :option:`-Walways::PendingDeprecationWarning:: <-W>` on the command line or use :func:`warnings.filterwarnings`.
es: Se ha añadido una nueva advertencia, :exc:`PendingDeprecationWarning` para indicar las características que están en proceso de ser obsoletas. La advertencia no se imprimirá por defecto. Para comprobar el uso de funciones que quedarán obsoletas en el futuro, proporcione :option:`-Walways::PendingDeprecationWarning:: <-W>` en la línea de comandos o utilice :func:`warnings.filterwarnings`.

source: The process of deprecating string-based exceptions, as in ``raise "Error occurred"``, has begun. Raising a string will now trigger :exc:`PendingDeprecationWarning`.
es: Ha comenzado el proceso de desaprobación de las excepciones basadas en cadenas, como en ``lanzamiento de "Error ocurred”``. Al lanzar una cadena, ahora se activará :exc:`PendingDeprecationWarning`.

source: Using ``None`` as a variable name will now result in a :exc:`SyntaxWarning` warning. In a future version of Python, ``None`` may finally become a keyword.
es: El uso de ``None`` como nombre de una variable ahora resultará en una advertencia :exc:`SyntaxWarning`. En una futura versión de Python, ``None`` podría convertirse en una palabra clave.
