Repository: python/python-docs-es
Catalog: whatsnew/2.3.po
Languages: es

source: The :meth:`xreadlines` method of file objects, introduced in Python 2.1, is no longer necessary because files now behave as their own iterator. :meth:`xreadlines` was originally introduced as a faster way to loop over all the lines in a file, but now you can simply write ``for line in file_obj``. File objects also have a new read-only :attr:`encoding` attribute that gives the encoding used by the file; Unicode strings written to the file will be automatically converted to bytes using the given encoding.
es: El método :meth:`xreadlines` de los objetos archivo, introducido en Python 2.1, ya no es necesario porque los archivos se comportan ahora como su propio iterador. :meth:`xreadlines` se introdujo originalmente como una forma más rápida de recorrer todas las líneas de un archivo, pero ahora se puede escribir simplemente ``for line in file_obj``. Los objetos archivo también tienen un nuevo atributo :attr:`encoding` de sólo lectura que proporciona la codificación utilizada por el archivo; las cadenas Unicode escritas en el archivo se convertirán automáticamente a bytes utilizando la codificación dada.

source: The method resolution order used by new-style classes has changed, though you'll only notice the difference if you have a really complicated inheritance hierarchy. Classic classes are unaffected by this change. Python 2.2 originally used a topological sort of a class's ancestors, but 2.3 now uses the C3 algorithm as described in the paper `"A Monotonic Superclass Linearization for Dylan" <https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.3910>`_. To understand the motivation for this change, read Michele Simionato's article `"Python 2.3 Method Resolution Order" <http://www.phyast.pitt.edu/~micheles/mro.html>`_, or read the thread on python-dev starting with the message at https://mail.python.org/pipermail/python-dev/2002-October/029035.html. Samuele Pedroni first pointed out the problem and also implemented the fix by coding the C3 algorithm.
es: El orden de resolución de métodos utilizado por las clases de estilo nuevo ha cambiado, aunque solo notará la diferencia si tiene una jerarquía de herencia realmente complicada. Las clases clásicas no se ven afectadas por este cambio. Python 2.2 originalmente usó un tipo topológico de los ancestros de una clase, pero 2.3 ahora usa el algoritmo C3 como se describe en el documento `"A Monotonic Superclass Linearization for Dylan" <https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.19.3910>`_. Para comprender la motivación de este cambio, lea el artículo `"Python 2.3 Method Resolution Order" <http://www.phyast.pitt.edu/~micheles/mro.html>`_ de Michele Simionato, o lea el hilo en python-dev que comienza con el mensaje en https://mail.python.org/pipermail/python-dev/2002-October/029035.html . Samuele Pedroni fue el primero en señalar el problema y también implementó la solución codificando el algoritmo C3.

source: Python runs multithreaded programs by switching between threads after executing N bytecodes. The default value for N has been increased from 10 to 100 bytecodes, speeding up single-threaded applications by reducing the switching overhead. Some multithreaded applications may suffer slower response time, but that's easily fixed by setting the limit back to a lower number using ``sys.setcheckinterval(N)``. The limit can be retrieved with the new :func:`sys.getcheckinterval` function.
es: Python ejecuta programas multihilo cambiando entre hilos después de ejecutar N bytecodes. El valor por defecto de N se ha incrementado de 10 a 100 bytecodes, acelerando las aplicaciones de un solo hilo al reducir la sobrecarga de cambio. Algunas aplicaciones multihilo pueden sufrir un tiempo de respuesta más lento, pero eso se arregla fácilmente estableciendo el límite a un número menor usando ``sys.setcheckinterval(N)``. El límite puede recuperarse con la nueva función :func:`sys.getcheckinterval`.

source: One minor but far-reaching change is that the names of extension types defined by the modules included with Python now contain the module and a ``'.'`` in front of the type name. For example, in Python 2.2, if you created a socket and printed its :attr:`__class__`, you'd get this output::
es: Un cambio menor pero de gran alcance es que los nombres de los tipos de extensión definidos por los módulos incluidos con Python ahora contienen el módulo y un ``.'`` delante del nombre del tipo. Por ejemplo, en Python 2.2, si creabas un socket e imprimías su :attr:`__class__`, obtendrías esta salida::

source: In 2.3, you get this::
es: En 2.3, se obtiene esto::

source: One of the noted incompatibilities between old- and new-style classes has been removed: you can now assign to the :attr:`~definition.__name__` and :attr:`~class.__bases__` attributes of new-style classes. There are some restrictions on what can be assigned to :attr:`~class.__bases__` along the lines of those relating to assigning to an instance's :attr:`~instance.__class__` attribute.
es: Se ha eliminado una de las incompatibilidades señaladas entre las clases de estilo antiguo y las de estilo nuevo: ahora se pueden asignar a los atributos :attr:`~definición.__name__` y :attr:`~clase.__bases__` de las clases de estilo nuevo. Hay algunas restricciones sobre lo que se puede asignar a :attr:`~class.__bases__` en la línea de las relacionadas con la asignación al atributo :attr:`~instance.__class__` de una instancia.

source: String Changes
es: Cambios en las cadenas de texto

source: The :keyword:`in` operator now works differently for strings. Previously, when evaluating ``X in Y`` where *X* and *Y* are strings, *X* could only be a single character. That's now changed; *X* can be a string of any length, and ``X in Y`` will return :const:`True` if *X* is a substring of *Y*. If *X* is the empty string, the result is always :const:`True`. ::
es: El operador :keyword:`in` ahora funciona de forma diferente para las cadenas. Antes, cuando se evaluaba ``X en Y`` donde *X* y *Y* eran cadenas, *X* sólo podía ser un único carácter. Esto ha cambiado; *X* puede ser una cadena de cualquier longitud, y ``X en Y`` retornará :const:`True` si *X* es una subcadena de *Y*. Si *X* es una cadena vacía, el resultado es siempre :const:`True`. ::

source: Note that this doesn't tell you where the substring starts; if you need that information, use the :meth:`find` string method.
es: Tenga en cuenta que esto no le dice dónde empieza la subcadena; si necesita esa información, utilice el método :meth:`find` string.

source: The :meth:`strip`, :meth:`lstrip`, and :meth:`rstrip` string methods now have an optional argument for specifying the characters to strip. The default is still to remove all whitespace characters::
es: Los métodos de cadena :meth:`strip`, :meth:`lstrip` y :meth:`rstrip` tienen ahora un argumento opcional para especificar los caracteres a eliminar. El valor por defecto sigue siendo eliminar todos los caracteres de espacio en blanco::

source: (Suggested by Simon Brunning and implemented by Walter Dörwald.)
es: (Sugerido por Simon Brunning y aplicado por Walter Dörwald)

source: The :meth:`startswith` and :meth:`endswith` string methods now accept negative numbers for the *start* and *end* parameters.
es: Los métodos de cadena :meth:`startswith` y :meth:`endswith` ahora aceptan números negativos para los parámetros *start* y *end*.

source: Another new string method is :meth:`zfill`, originally a function in the :mod:`string` module. :meth:`zfill` pads a numeric string with zeros on the left until it's the specified width. Note that the ``%`` operator is still more flexible and powerful than :meth:`zfill`. ::
es: Otro nuevo método de cadena es :meth:`zfill`, originalmente una función del módulo :mod:`string`. :meth:`zfill` rellena una cadena numérica con ceros a la izquierda hasta que tenga el ancho especificado. Tenga en cuenta que el operador ``%`` sigue siendo más flexible y potente que :meth:`zfill`. ::

source: (Contributed by Walter Dörwald.)
es: (Contribución de Walter Dörwald.)

source: A new type object, :class:`basestring`, has been added. Both 8-bit strings and Unicode strings inherit from this type, so ``isinstance(obj, basestring)`` will return :const:`True` for either kind of string. It's a completely abstract type, so you can't create :class:`basestring` instances.
es: Se ha añadido un nuevo tipo de objeto, :class:`basestring`. Tanto las cadenas de 8 bits como las cadenas Unicode heredan de este tipo, por lo que ``isinstance(obj, basestring)`` retornará :const:`True` para cualquier tipo de cadena. Es un tipo completamente abstracto, por lo que no se pueden crear instancias de :class:`basestring`.

source: Interned strings are no longer immortal and will now be garbage-collected in the usual way when the only reference to them is from the internal dictionary of interned strings. (Implemented by Oren Tirosh.)
es: Las cadenas internas ya no son inmortales y ahora serán recolectadas de la forma habitual cuando la única referencia a ellas sea desde el diccionario interno de cadenas internas. (Implementado por Oren Tirosh)

source: Optimizations
es: Optimizaciones

source: The creation of new-style class instances has been made much faster; they're now faster than classic classes!
es: La creación de instancias de clases de estilo nuevo se ha hecho mucho más rápida; ¡ahora son más rápidas que las clases clásicas!

source: The :meth:`sort` method of list objects has been extensively rewritten by Tim Peters, and the implementation is significantly faster.
es: El método :meth:`sort` de los objetos de la lista ha sido ampliamente reescrito por Tim Peters, y la implementación es significativamente más rápida.

source: Multiplication of large long integers is now much faster thanks to an implementation of Karatsuba multiplication, an algorithm that scales better than the O(n\*n) required for the grade-school multiplication algorithm. (Original patch by Christopher A. Craig, and significantly reworked by Tim Peters.)
es: La multiplicación de enteros largos es ahora mucho más rápida gracias a una implementación de la multiplicación Karatsuba, un algoritmo que escala mejor que el O(n\*n) requerido para el algoritmo de multiplicación de la escuela primaria. (Parche original de Christopher A. Craig, y reelaborado significativamente por Tim Peters)

source: The ``SET_LINENO`` opcode is now gone. This may provide a small speed increase, depending on your compiler's idiosyncrasies. See section :ref:`23section-other` for a longer explanation. (Removed by Michael Hudson.)
es: El opcode ``SET_LINENO`` ha desaparecido. Esto puede proporcionar un pequeño aumento de velocidad, dependiendo de la idiosincrasia de su compilador. Vea la sección :ref:`23section-other` para una explicación más larga. (Eliminado por Michael Hudson)

source: :func:`xrange` objects now have their own iterator, making ``for i in xrange(n)`` slightly faster than ``for i in range(n)``. (Patch by Raymond Hettinger.)
es: Los objetos :func:`xrange` tienen ahora su propio iterador, haciendo que ``for i in xrange(n)`` sea ligeramente más rápido que ``for i in range(n)``. (Parche de Raymond Hettinger)

source: A number of small rearrangements have been made in various hotspots to improve performance, such as inlining a function or removing some code. (Implemented mostly by GvR, but lots of people have contributed single changes.)
es: Se han realizado una serie de pequeños reajustes en varios puntos conflictivos para mejorar el rendimiento, como por ejemplo alinear una función o eliminar algo de código. (Implementado principalmente por GvR, pero mucha gente ha contribuido con cambios individuales)

source: The net result of the 2.3 optimizations is that Python 2.3 runs the pystone benchmark around 25% faster than Python 2.2.
es: El resultado neto de las optimizaciones de la versión 2.3 es que Python 2.3 ejecuta el benchmark pystone alrededor de un 25% f más rápido que Python 2.2.

source: New, Improved, and Deprecated Modules
es: Módulos nuevos, mejorados y obsoletos

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
es: Como es habitual, la biblioteca estándar de Python ha recibido una serie de mejoras y correcciones de errores. Aquí hay una lista parcial de los cambios más notables, ordenados alfabéticamente por nombre de módulo. Consulte el archivo :file:`Misc/NEWS` en el árbol de fuentes para obtener una lista más completa de los cambios, o busque en los registros de CVS para obtener todos los detalles.

source: The :mod:`array` module now supports arrays of Unicode characters using the ``'u'`` format character. Arrays also now support using the ``+=`` assignment operator to add another array's contents, and the ``*=`` assignment operator to repeat an array. (Contributed by Jason Orendorff.)
es: El módulo :mod:`array` soporta ahora matrices de caracteres Unicode que utilizan el carácter de formato ``'u``. Las matrices también soportan ahora el uso del operador de asignación ``+=`` para añadir el contenido de otra matriz, y el operador de asignación ``*=`` para repetir una matriz. (Contribución de Jason Orendorff)

source: The :mod:`bsddb` module has been replaced by version 4.1.6 of the `PyBSDDB <https://pybsddb.sourceforge.net>`_ package, providing a more complete interface to the transactional features of the BerkeleyDB library.
es: El módulo :mod:`bsddb` ha sido reemplazado por la versión 4.1.6 del paquete `PyBSDDB <https://pybsddb.sourceforge.net>`_, lo que proporciona una interfaz más completa para las funciones transaccionales de la biblioteca BerkeleyDB.

source: The old version of the module has been renamed to :mod:`bsddb185` and is no longer built automatically; you'll have to edit :file:`Modules/Setup` to enable it. Note that the new :mod:`bsddb` package is intended to be compatible with the old module, so be sure to file bugs if you discover any incompatibilities. When upgrading to Python 2.3, if the new interpreter is compiled with a new version of the underlying BerkeleyDB library, you will almost certainly have to convert your database files to the new version. You can do this fairly easily with the new scripts :file:`db2pickle.py` and :file:`pickle2db.py` which you will find in the distribution's :file:`Tools/scripts` directory. If you've already been using the PyBSDDB package and importing it as :mod:`bsddb3`, you will have to change your ``import`` statements to import it as :mod:`bsddb`.
es: La antigua versión del módulo ha sido renombrada como :mod:`bsddb185` y ya no se construye automáticamente; tendrás que editar :file:`Modules/Setup` para activarlo. Ten en cuenta que el nuevo paquete :mod:`bsddb` está pensado para ser compatible con el módulo antiguo, así que asegúrate de enviar errores si descubres alguna incompatibilidad. Al actualizar a Python 2.3, si el nuevo intérprete se compila con una nueva versión de la biblioteca BerkeleyDB subyacente, es casi seguro que tendrá que convertir sus archivos de base de datos a la nueva versión. Puede hacerlo fácilmente con los nuevos scripts :file:`db2pickle.py` y :file:`pickle2db.py` que encontrará en el directorio :file:`Tools/scripts` de la distribución. Si ya ha estado utilizando el paquete PyBSDDB e importándolo como :mod:`bsddb3`, tendrá que cambiar sus sentencias ``import`` para importarlo como :mod:`bsddb`.

source: The new :mod:`bz2` module is an interface to the bz2 data compression library. bz2-compressed data is usually smaller than corresponding :mod:`zlib`\ -compressed data. (Contributed by Gustavo Niemeyer.)
es: El nuevo módulo :mod:`bz2` es una interfaz para la biblioteca de compresión de datos bz2. Los datos comprimidos con bz2 suelen ser más pequeños que los correspondientes datos comprimidos con :mod:`zlib`. (Contribución de Gustavo Niemeyer)

source: A set of standard date/time types has been added in the new :mod:`datetime` module. See the following section for more details.
es: Se ha añadido un conjunto de tipos de fecha/hora estándar en el nuevo módulo :mod:`datetime`. Consulte la siguiente sección para obtener más detalles.

source: The Distutils :class:`Extension` class now supports an extra constructor argument named *depends* for listing additional source files that an extension depends on. This lets Distutils recompile the module if any of the dependency files are modified. For example, if :file:`sampmodule.c` includes the header file :file:`sample.h`, you would create the :class:`Extension` object like this::
es: La clase Distutils :class:`Extension` soporta ahora un argumento constructor extra llamado *depends* para listar archivos fuente adicionales de los que depende una extensión. Esto permite a Distutils recompilar el módulo si se modifica alguno de los archivos de dependencia. Por ejemplo, si :file:`sampmodule.c` incluye el fichero de cabecera :file:`sample.h`, se crearía el objeto :class:`Extension` así::

source: Modifying :file:`sample.h` would then cause the module to be recompiled. (Contributed by Jeremy Hylton.)
es: La modificación de :file:`sample.h` haría que el módulo se recompilara. (Contribución de Jeremy Hylton)

source: Other minor changes to Distutils: it now checks for the :envvar:`CC`, :envvar:`CFLAGS`, :envvar:`CPP`, :envvar:`LDFLAGS`, and :envvar:`CPPFLAGS` environment variables, using them to override the settings in Python's configuration (contributed by Robert Weber).
es: Otros cambios menores en Distutils: ahora comprueba las variables de entorno :envvar:`CC`, :envvar:`CFLAGS`, :envvar:`CPP`, :envvar:`LDFLAGS` y :envvar:`CPPFLAGS`, utilizándolas para anular los ajustes de la configuración de Python (contribución de Robert Weber).

source: Previously the :mod:`doctest` module would only search the docstrings of public methods and functions for test cases, but it now also examines private ones as well. The :func:`DocTestSuite` function creates a :class:`unittest.TestSuite` object from a set of :mod:`doctest` tests.
es: Anteriormente el módulo :mod:`doctest` sólo buscaba casos de prueba en los docstrings de los métodos y funciones públicos, pero ahora también examina los privados. La función :func:`DocTestSuite` crea un objeto :class:`unittest.TestSuite` a partir de un conjunto de pruebas :mod:`doctest`.

source: The new ``gc.get_referents(object)`` function returns a list of all the objects referenced by *object*.
es: La nueva función ``gc.get_referents(object)`` retorna una lista de todos los objetos referenciados por *object*.

source: The :mod:`getopt` module gained a new function, :func:`gnu_getopt`, that supports the same arguments as the existing :func:`getopt` function but uses GNU-style scanning mode. The existing :func:`getopt` stops processing options as soon as a non-option argument is encountered, but in GNU-style mode processing continues, meaning that options and arguments can be mixed. For example::
es: El módulo :mod:`getopt` ha ganado una nueva función, :func:`gnu_getopt`, que admite los mismos argumentos que la función :func:`getopt` existente, pero utiliza el modo de exploración al estilo GNU. La función :func:`getopt` existente deja de procesar las opciones tan pronto como se encuentra un argumento que no es una opción, pero en el modo GNU el procesamiento continúa, lo que significa que las opciones y los argumentos pueden mezclarse. Por ejemplo::

source: (Contributed by Peter Åstrand.)
es: (Contribución de Peter Åstrand.)

source: The :mod:`grp`, :mod:`pwd`, and :mod:`resource` modules now return enhanced tuples::
es: Los módulos :mod:`grp`, :mod:`pwd` y :mod:`resource` retornan ahora tuplas mejoradas::

source: The :mod:`gzip` module can now handle files exceeding 2 GiB.
es: El módulo :mod:`gzip` ahora puede manejar archivos de más de 2 GiB.

source: The new :mod:`heapq` module contains an implementation of a heap queue algorithm. A heap is an array-like data structure that keeps items in a partially sorted order such that, for every index *k*, ``heap[k] <= heap[2*k+1]`` and ``heap[k] <= heap[2*k+2]``. This makes it quick to remove the smallest item, and inserting a new item while maintaining the heap property is O(lg n). (See https://xlinux.nist.gov/dads//HTML/priorityque.html for more information about the priority queue data structure.)
es: El nuevo módulo :mod:`heapq` contiene una implementación de un algoritmo de colas de montón. Un montón es una estructura de datos similar a un array que mantiene los elementos en un orden parcialmente ordenado de forma que, para cada índice *k*, ``heap[k] <= heap[2*k+1]`` y ``heap[k] <= heap[2*k+2]``. Esto hace que sea rápido eliminar el elemento más pequeño, y la inserción de un nuevo elemento manteniendo la propiedad del montón es *O(lg n)*. (Véase https://xlinux.nist.gov/dads//HTML/priorityque.html para más información sobre la estructura de datos de la cola de prioridad)

source: The :mod:`heapq` module provides :func:`heappush` and :func:`heappop` functions for adding and removing items while maintaining the heap property on top of some other mutable Python sequence type. Here's an example that uses a Python list::
es: El módulo :mod:`heapq` proporciona las funciones :func:`heappush` y :func:`heappop` para añadir y eliminar elementos manteniendo la propiedad del montón sobre algún otro tipo de secuencia mutable de Python. Aquí hay un ejemplo que utiliza una lista de Python::

source: (Contributed by Kevin O'Connor.)
es: (Contribución de Kevin O'Connor.)

source: The IDLE integrated development environment has been updated using the code from the IDLEfork project (https://idlefork.sourceforge.net). The most notable feature is that the code being developed is now executed in a subprocess, meaning that there's no longer any need for manual ``reload()`` operations. IDLE's core code has been incorporated into the standard library as the :mod:`idlelib` package.
es: El entorno de desarrollo integrado IDLE ha sido actualizado utilizando el código del proyecto IDLEfork (http://idlefork.sourceforge.net). La característica más notable es que el código que se está desarrollando se ejecuta ahora en un subproceso, lo que significa que ya no es necesario realizar operaciones manuales de ``reload()``. El código central de IDLE ha sido incorporado a la biblioteca estándar como el paquete :mod:`idlelib`.

source: The :mod:`imaplib` module now supports IMAP over SSL. (Contributed by Piers Lauder and Tino Lange.)
es: El módulo :mod:`imaplib` ahora admite IMAP sobre SSL. (Contribuido por Piers Lauder y Tino Lange.)

source: The :mod:`itertools` contains a number of useful functions for use with iterators, inspired by various functions provided by the ML and Haskell languages. For example, ``itertools.ifilter(predicate, iterator)`` returns all elements in the iterator for which the function :func:`predicate` returns :const:`True`, and ``itertools.repeat(obj, N)`` returns ``obj`` *N* times. There are a number of other functions in the module; see the package's reference documentation for details. (Contributed by Raymond Hettinger.)
es: El :mod:`itertools` contiene una serie de funciones útiles para usar con iteradores, inspiradas en varias funciones proporcionadas por los lenguajes ML y Haskell. Por ejemplo, ``itertools.ifilter(predicate, iterator)`` devuelve todos los elementos del iterador para los que la función :func:`predicate` devuelve :const:`True` y ``itertools.repeat(obj, N)`` devuelve ``obj`` *N* veces. Hay una serie de otras funciones en el módulo; consulte la documentación de referencia del paquete para obtener más detalles. (Contribuido por Raymond Hettinger.)
