Repository: python/python-docs-es
Catalog: whatsnew/2.4.po
Languages: es

source: The new :class:`DocTestFinder` class extracts the tests from a given object's docstrings::
es: La nueva clase :class:`DocTestFinder` extrae las pruebas de las cadenas de documentos de un objeto dado:

source: The new :class:`DocTestRunner` class then runs individual tests and can produce a summary of the results::
es: La nueva clase :class:`DocTestRunner` luego ejecuta pruebas individuales y puede producir un resumen de los resultados:

source: The above example produces the following output::
es: El ejemplo anterior produce la siguiente salida:

source: :class:`DocTestRunner` uses an instance of the :class:`OutputChecker` class to compare the expected output with the actual output. This class takes a number of different flags that customize its behaviour; ambitious users can also write a completely new subclass of :class:`OutputChecker`.
es: :class:`DocTestRunner` usa una instancia de la clase :class:`OutputChecker` para comparar la salida esperada con la salida real. Esta clase toma varios indicadores diferentes que personalizan su comportamiento; Los usuarios ambiciosos también pueden escribir una subclase completamente nueva de :class:`OutputChecker`.

source: The default output checker provides a number of handy features. For example, with the :const:`doctest.ELLIPSIS` option flag, an ellipsis (``...``) in the expected output matches any substring, making it easier to accommodate outputs that vary in minor ways::
es: El comprobador de salida predeterminado proporciona una serie de funciones útiles. Por ejemplo, con el indicador de opción :const:`doctest.ELLIPSIS`, una elipsis (``...``) en la salida esperada coincide con cualquier subcadena, lo que facilita la adaptación de salidas que varían en formas menores:

source: Another special string, ``<BLANKLINE>``, matches a blank line::
es: Otra cadena especial, ``<BLANKLINE>``, coincide con una línea en blanco:

source: Another new capability is producing a diff-style display of the output by specifying the :const:`doctest.REPORT_UDIFF` (unified diffs), :const:`doctest.REPORT_CDIFF` (context diffs), or :const:`doctest.REPORT_NDIFF` (delta-style) option flags. For example::
es: Otra nueva capacidad es producir una visualización de estilo diff de la salida especificando :const:`doctest.REPORT_UDIFF` (diferencias unificadas), :const:`doctest.REPORT_CDIFF` (diferencias de contexto), o :const:`doctest.REPORT_NDIFF` Indicadores de opción (estilo delta). Por ejemplo::

source: Running the above function's tests with :const:`doctest.REPORT_UDIFF` specified, you get the following output:
es: Al ejecutar las pruebas de la función anterior con :const:`doctest.REPORT_UDIFF` especificado, obtiene el siguiente resultado:

source: Build and C API Changes
es: Cambios en la API de Build y C

source: Some of the changes to Python's build process and to the C API are:
es: Algunos de los cambios en el proceso de compilación de Python y en la API de C son:

source: Three new convenience macros were added for common return values from extension functions: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE`, and :c:macro:`Py_RETURN_FALSE`. (Contributed by Brett Cannon.)
es: Se agregaron tres nuevas macros de conveniencia para valores de retorno comunes de funciones de extensión: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE`, y :c:macro:`Py_RETURN_FALSE`. (Contribuido por Brett Cannon.)

source: Another new macro, :c:macro:`Py_CLEAR`, decreases the reference count of *obj* and sets *obj* to the null pointer. (Contributed by Jim Fulton.)
es: Otra macro nueva, :c:macro:`Py_CLEAR`, reduce el recuento de referencias de *obj* y establece *obj* en el puntero nulo. (Aportado por Jim Fulton.)

source: A new function, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, constructs tuples from a variable length argument list of Python objects. (Contributed by Raymond Hettinger.)
es: Una nueva función, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, construye tuplas a partir de una lista de argumentos de longitud variable de objetos Python. (Contribuido por Raymond Hettinger.)

source: A new function, ``PyDict_Contains(d, k)``, implements fast dictionary lookups without masking exceptions raised during the look-up process. (Contributed by Raymond Hettinger.)
es: Una nueva función, ``PyDict_Contains(d, k)``, implementa búsquedas rápidas de diccionarios sin enmascarar las excepciones que surgen durante el proceso de búsqueda. (Contribuido por Raymond Hettinger.)

source: The :c:expr:`Py_IS_NAN(X)` macro returns 1 if its float or double argument *X* is a NaN. (Contributed by Tim Peters.)
es: La macro :c:expr:`Py_IS_NAN(X)` retorna 1 si su argumento flotante o doble *X* es un NaN. (Aportado por Tim Peters.)

source: C code can avoid unnecessary locking by using the new :c:func:`!PyEval_ThreadsInitialized` function to tell if any thread operations have been performed. If this function returns false, no lock operations are needed. (Contributed by Nick Coghlan.)
es: El código C puede evitar el bloqueo innecesario mediante el uso de la nueva función :c:func:`!PyEval_ThreadsInitialized` para saber si se ha realizado alguna operación de subproceso. Si esta función devuelve falso, no se necesitan operaciones de bloqueo. (Contribuido por Nick Coghlan.)

source: A new function, :c:func:`PyArg_VaParseTupleAndKeywords`, is the same as :c:func:`PyArg_ParseTupleAndKeywords` but takes a :c:type:`va_list` instead of a number of arguments. (Contributed by Greg Chapman.)
es: Una nueva función, :c:func:`PyArg_VaParseTupleAndKeywords`, es la misma que :c:func:`PyArg_ParseTupleAndKeywords` pero toma un :c:type:`va_list` en lugar de varios argumentos. (Contribuido por Greg Chapman.)

source: A new method flag, :c:macro:`METH_COEXIST`, allows a function defined in slots to co-exist with a :c:type:`PyCFunction` having the same name. This can halve the access time for a method such as :meth:`set.__contains__`. (Contributed by Raymond Hettinger.)
es: Un nuevo indicador de método, :c:macro:`METH_COEXISTS`, permite que una función definida en ranuras coexista con un :c:type:`PyCFunction` que tiene el mismo nombre. Esto puede reducir a la mitad el tiempo de acceso para un método como :meth:`set.__contains__`. (Contribuido por Raymond Hettinger.)

source: Python can now be built with additional profiling for the interpreter itself, intended as an aid to people developing the Python core. Providing :option:`!--enable-profiling` to the :program:`configure` script will let you profile the interpreter with :program:`gprof`, and providing the :option:`!--with-tsc` switch enables profiling using the Pentium's Time-Stamp-Counter register. Note that the :option:`!--with-tsc` switch is slightly misnamed, because the profiling feature also works on the PowerPC platform, though that processor architecture doesn't call that register "the TSC register". (Contributed by Jeremy Hylton.)
es: Python ahora se puede construir con perfiles adicionales para el intérprete en sí, con la intención de ayudar a las personas que desarrollan el núcleo de Python. Proporcionar :option:`! - enable-profiling` al :program:`configure` script le permitirá perfilar el intérprete con :program:`gprof`, y proporcionar el :option:`! - with-tsc` switch permite la creación de perfiles utilizando el registro de contador de marcas de tiempo del Pentium. Tenga en cuenta que el conmutador :option:`! - with-tsc` tiene un nombre ligeramente incorrecto, porque la función de creación de perfiles también funciona en la plataforma PowerPC, aunque la arquitectura del procesador no llama a ese registro" el registro TSC ". (Contribuido por Jeremy Hylton.)

source: The :c:type:`!tracebackobject` type has been renamed to :c:type:`PyTracebackObject`.
es: El tipo :c:type:`!tracebackobject` ha sido renombrado a :c:type:`PyTracebackObject`.

source: Port-Specific Changes
es: Cambios específicos del puerto

source: The Windows port now builds under MSVC++ 7.1 as well as version 6. (Contributed by Martin von Löwis.)
es: El puerto de Windows ahora se construye bajo MSVC ++ 7.1 y también con la versión 6. (Contribuido por Martin von Löwis).

source: Porting to Python 2.4
es: Portar a Python 2.4

source: This section lists previously described changes that may require changes to your code:
es: Esta sección enumera los cambios descritos anteriormente que pueden requerir cambios en su código:

source: Left shifts and hexadecimal/octal constants that are too large no longer trigger a :exc:`FutureWarning` and return a value limited to 32 or 64 bits; instead they return a long integer.
es: Los desplazamientos a la izquierda y las constantes hexadecimales / octales que son demasiado grandes ya no activan un :exc:`FutureWarning` y devuelven un valor limitado a 32 o 64 bits; en su lugar, devuelven un entero largo.

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list instead of raising a :exc:`TypeError` exception if called with no arguments.
es: La función de conjunto integrado :func:`zip` y la :func:`itertools.izip` ahora retornan una lista hacia en vez de lanzar una excepción de tipo :exc:`TypeError` si son llamados sin argumentos.

source: You can no longer compare the :class:`date` and :class:`~datetime.datetime` instances provided by the :mod:`datetime` module. Two instances of different classes will now always be unequal, and relative comparisons (``<``, ``>``) will raise a :exc:`TypeError`.
es: Ya no puede comparar las instancias :class:`date` y :class:`~datetime.datetime` proporcionadas por el módulo :mod:`datetime`. Dos instancias de clases diferentes ahora siempre serán desiguales, y las comparaciones relativas (``<``, ``>``) lanzarán un :exc:`TypeError`.

source: :func:`dircache.listdir` now passes exceptions to the caller instead of returning empty lists.
es: :func:`dircache.listdir` ahora pasa excepciones a la persona que llama en lugar de devolver listas vacías.

source: :func:`LexicalHandler.startDTD` used to receive the public and system IDs in the wrong order. This has been corrected; applications relying on the wrong order need to be fixed.
es: :func:`LexicalHandler.startDTD` solía recibir los identificadores públicos y del sistema en el orden incorrecto. Esto ha sido corregido; las aplicaciones que se basan en el orden incorrecto deben corregirse.

source: :func:`fcntl.ioctl` now warns if the *mutate* argument is omitted and relevant.
es: :func:`fcntl.ioctl` ahora advierte si el argumento *mutate* se omite y es relevante.

source: The :mod:`tarfile` module now generates GNU-format tar files by default.
es: El módulo :mod:`tarfile` ahora genera archivos de GNU tar-formato por defecto.

source: Encountering a failure while importing a module no longer leaves a partially initialized module object in ``sys.modules``.
es: Encontrar un error al importar un módulo ya no deja un objeto de módulo parcialmente inicializado en ``sys.modules``.

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error.
es: :const:`None` ahora es una constante; El código que une un nuevo valor al nombre ``None`` ahora es un error de sintaxis.

source: The :func:`signals.signal` function now raises a :exc:`RuntimeError` exception for certain illegal values; previously these errors would pass silently. For example, you can no longer set a handler on the :const:`SIGKILL` signal.
es: La función :func:`signals.signal` ahora genera una excepción :exc:`RuntimeError` para ciertos valores ilegales; anteriormente estos errores pasaban silenciosamente. Por ejemplo, ya no puede configurar un controlador en la señal :const:`SIGKILL`.

source: Acknowledgements
es: Agradecimientos

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.
es: El autor desea agradecer a las siguientes personas por ofrecer sugerencias, correcciones y ayuda con varios borradores de este artículo: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.

source: universal newlines
es: nuevas líneas universales

source: What's new
es: Qué hay de nuevo
