Repository: python/python-docs-es
Catalog: whatsnew/2.4.po
Languages: es

source: The :mod:`email` package was updated to version 3.0, which dropped various deprecated APIs and removes support for Python versions earlier than 2.3. The 3.0 version of the package uses a new incremental parser for MIME messages, available in the :mod:`email.FeedParser` module. The new parser doesn't require reading the entire message into memory, and doesn't raise exceptions if a message is malformed; instead it records any problems in the :attr:`defect` attribute of the message. (Developed by Anthony Baxter, Barry Warsaw, Thomas Wouters, and others.)
es: El paquete :mod:`email` se actualizó a la versión 3.0, que eliminó varias API obsoletas y elimina la compatibilidad con versiones de Python anteriores a la 2.3. La versión 3.0 del paquete usa un nuevo analizador incremental para mensajes MIME, disponible en el módulo :mod:`email.FeedParser`. El nuevo analizador no requiere leer todo el mensaje en la memoria y no genera excepciones si un mensaje tiene un formato incorrecto; en su lugar, registra cualquier problema en el atributo :attr:`defect` del mensaje. (Desarrollado por Anthony Baxter, Barry Warsaw, Thomas Wouters y otros).

source: The :mod:`heapq` module has been converted to C. The resulting tenfold improvement in speed makes the module suitable for handling high volumes of data. In addition, the module has two new functions :func:`nlargest` and :func:`nsmallest` that use heaps to find the N largest or smallest values in a dataset without the expense of a full sort. (Contributed by Raymond Hettinger.)
es: El módulo :mod:`heapq` se ha convertido a C. La mejora de diez veces resultante en la velocidad hace que el módulo sea adecuado para manejar grandes volúmenes de datos. Además, el módulo tiene dos funciones nuevas :func:`nlargest` y :func:`nsmallest` que usan montones para encontrar los N valores más grandes o más pequeños en un conjunto de datos sin el gasto de una clasificación completa. (Contribuido por Raymond Hettinger.)

source: The :mod:`httplib` module now contains constants for HTTP status codes defined in various HTTP-related RFC documents. Constants have names such as :const:`OK`, :const:`CREATED`, :const:`CONTINUE`, and :const:`MOVED_PERMANENTLY`; use pydoc to get a full list. (Contributed by Andrew Eland.)
es: El módulo :mod:`httplib` ahora contiene constantes para códigos de estado HTTP definidos en varios documentos RFC relacionados con HTTP. Las constantes tienen nombres como :const:`OK`, :const:`CREATED`, :const:`CONTINUE`, y :const:`MOVED_PERMANENTLY`; use pydoc para obtener una lista completa. (Contribuido por Andrew Eland.)

source: The :mod:`imaplib` module now supports IMAP's THREAD command (contributed by Yves Dionne) and new :meth:`deleteacl` and :meth:`myrights` methods (contributed by Arnaud Mazin).
es: El módulo :mod:`imaplib` ahora es compatible con el comando THREAD de IMAP (aportado por Yves Dionne) y los nuevos métodos :meth:`deleteacl` y :meth:`myrights` (aportado por Arnaud Mazin).

source: The :mod:`itertools` module gained a ``groupby(iterable[, *func*])`` function. *iterable* is something that can be iterated over to return a stream of elements, and the optional *func* parameter is a function that takes an element and returns a key value; if omitted, the key is simply the element itself. :func:`groupby` then groups the elements into subsequences which have matching values of the key, and returns a series of 2-tuples containing the key value and an iterator over the subsequence.
es: El módulo :mod:`itertools` ganó una función ``groupby(iterable[, *func*])``. El parámetro *iterable* is something that can be iterated over to return a stream of elements, and the optional *func* es una función que toma un elemento y devuelve un valor clave; si se omite, la clave es simplemente el elemento en sí. :func:`groupby` luego agrupa los elementos en subsecuencias que tienen valores coincidentes de la clave y devuelve una serie de 2 tuplas que contienen el valor de la clave y un iterador sobre la subsecuencia.

source: Here's an example to make this clearer. The *key* function simply returns whether a number is even or odd, so the result of :func:`groupby` is to return consecutive runs of odd or even numbers. ::
es: Aquí hay un ejemplo para aclarar esto. La función *key* simplemente devuelve si un número es par o impar, por lo que el resultado de :func:`groupby` es devolver series consecutivas de números pares o impares. ::

source: :func:`groupby` is typically used with sorted input. The logic for :func:`groupby` is similar to the Unix ``uniq`` filter which makes it handy for eliminating, counting, or identifying duplicate elements::
es: :func:`groupby` se utiliza normalmente con entrada ordenada. La lógica para :func:`groupby` es similar al filtro Unix ``uniq``, lo que lo hace útil para eliminar, contar o identificar elementos duplicados:

source: (Contributed by Hye-Shik Chang.)
es: (Contribuido por Hye-Shik Chang.)

source: :mod:`itertools` also gained a function named ``tee(iterator, N)`` that returns *N* independent iterators that replicate *iterator*. If *N* is omitted, the default is 2. ::
es: :mod:`itertools` también obtuvo una función denominada ``tee(iterator, N)`` que devuelve *N* independent iterators that replicate *iterator*. If *N* se omite, el valor predeterminado es 2. ::

source: Note that :func:`tee` has to keep copies of the values returned by the iterator; in the worst case, it may need to keep all of them. This should therefore be used carefully if the leading iterator can run far ahead of the trailing iterator in a long stream of inputs. If the separation is large, then you might as well use :func:`list` instead. When the iterators track closely with one another, :func:`tee` is ideal. Possible applications include bookmarking, windowing, or lookahead iterators. (Contributed by Raymond Hettinger.)
es: Tenga en cuenta que :func:`tee` debe mantener copias de los valores devueltos por el iterador; en el peor de los casos, es posible que deba conservarlos todos. Por lo tanto, esto debe usarse con cuidado si el iterador principal puede ejecutarse muy por delante del iterador final en un flujo largo de entradas. Si la separación es grande, entonces también podría usar :func:`list` en su lugar. Cuando los iteradores se siguen de cerca entre sí, :func:`tee` es ideal. Las posibles aplicaciones incluyen marcadores, ventanas o iteradores de anticipación. (Contribuido por Raymond Hettinger.)

source: A number of functions were added to the :mod:`locale` module, such as :func:`bind_textdomain_codeset` to specify a particular encoding and a family of :func:`l\*gettext` functions that return messages in the chosen encoding. (Contributed by Gustavo Niemeyer.)
es: Se agregaron varias funciones al módulo :mod:`locale`, como :func:`bind_textdomain_codeset` para especificar una codificación particular y una familia de funciones :func:`l\*gettext` que devuelven mensajes en la codificación elegida. (Contribución de Gustavo Niemeyer.)

source: Some keyword arguments were added to the :mod:`logging` package's :func:`basicConfig` function to simplify log configuration. The default behavior is to log messages to standard error, but various keyword arguments can be specified to log to a particular file, change the logging format, or set the logging level. For example::
es: Se agregaron algunos argumentos de palabras clave a la función :func:`basicConfig` del paquete :mod:`logging` para simplificar la configuración del registro. El comportamiento predeterminado es registrar mensajes con error estándar, pero se pueden especificar varios argumentos de palabras clave para registrar en un archivo en particular, cambiar el formato de registro o establecer el nivel de registro. Por ejemplo::

source: Other additions to the :mod:`logging` package include a ``log(level, msg)`` convenience method, as well as a :class:`TimedRotatingFileHandler` class that rotates its log files at a timed interval. The module already had :class:`RotatingFileHandler`, which rotated logs once the file exceeded a certain size. Both classes derive from a new :class:`BaseRotatingHandler` class that can be used to implement other rotating handlers.
es: Otras adiciones al paquete :mod:`logging` incluyen un método de conveniencia ``log(level, msg)``, así como una clase :class:`TimedRotatingFileHandler` que rota sus archivos de registro en un intervalo cronometrado. El módulo ya tenía :class:`RotatingFileHandler`, que rotaba los registros una vez que el archivo excedía un cierto tamaño. Ambas clases derivan de una nueva clase :class:`BaseRotatingHandler` que se puede utilizar para implementar otros controladores rotativos.

source: (Changes implemented by Vinay Sajip.)
es: (Cambios implementados por Vinay Sajip.)

source: The :mod:`marshal` module now shares interned strings on unpacking a data structure. This may shrink the size of certain pickle strings, but the primary effect is to make :file:`.pyc` files significantly smaller. (Contributed by Martin von Löwis.)
es: El módulo :mod:`marshal` ahora comparte cadenas internas al desempaquetar una estructura de datos. Esto puede reducir el tamaño de ciertas cadenas de pickle, pero el efecto principal es hacer que los archivos :file:`.pyc` sean significativamente más pequeños. (Contribución de Martin von Löwis.)

source: The :mod:`nntplib` module's :class:`NNTP` class gained :meth:`description` and :meth:`descriptions` methods to retrieve newsgroup descriptions for a single group or for a range of groups. (Contributed by Jürgen A. Erhard.)
es: La clase :class:`NNTP` del módulo :mod:`nntplib` obtuvo los métodos :meth:`description` y :meth:`descriptions` para recuperar descripciones de grupos de noticias para un solo grupo o para un rango de grupos. (Contribución de Jürgen A. Erhard.)

source: Two new functions were added to the :mod:`operator` module, ``attrgetter(attr)`` and ``itemgetter(index)``. Both functions return callables that take a single argument and return the corresponding attribute or item; these callables make excellent data extractors when used with :func:`map` or :func:`sorted`. For example::
es: Se agregaron dos nuevas funciones al módulo :mod:`operator`, ``attrgetter(attr)`` y ``itemgetter(index)``. Ambas funciones devuelven invocables que toman un solo argumento y devuelven el atributo o elemento correspondiente; estos llamables son excelentes extractores de datos cuando se utilizan con :func:`map` o :func:`sorted`. Por ejemplo::

source: The :mod:`optparse` module was updated in various ways. The module now passes its messages through :func:`gettext.gettext`, making it possible to internationalize Optik's help and error messages. Help messages for options can now include the string ``'%default'``, which will be replaced by the option's default value. (Contributed by Greg Ward.)
es: El módulo :mod:`optparse` se actualizó de varias formas. El módulo ahora pasa sus mensajes a través de :func:`gettext.gettext`, lo que permite internacionalizar los mensajes de error y ayuda de Optik. Los mensajes de ayuda para las opciones ahora pueden incluir la cadena ``'%default'``, que será reemplazada por el valor predeterminado de la opción. (Contribuido por Greg Ward.)

source: The long-term plan is to deprecate the :mod:`rfc822` module in some future Python release in favor of the :mod:`email` package. To this end, the :func:`email.Utils.formatdate` function has been changed to make it usable as a replacement for :func:`rfc822.formatdate`. You may want to write new e-mail processing code with this in mind. (Change implemented by Anthony Baxter.)
es: El plan a largo plazo es desaprobar el módulo :mod:`rfc822` en alguna versión futura de Python a favor del paquete :mod:`email`. Con este fin, la función :func:`email.Utils.formatdate` se ha modificado para que pueda utilizarse como reemplazo de :func:`rfc822.formatdate`. Es posible que desee escribir un nuevo código de procesamiento de correo electrónico con esto en mente. (Cambio implementado por Anthony Baxter).

source: A new ``urandom(n)`` function was added to the :mod:`os` module, returning a string containing *n* bytes of random data. This function provides access to platform-specific sources of randomness such as :file:`/dev/urandom` on Linux or the Windows CryptoAPI. (Contributed by Trevor Perrin.)
es: Se agregó una nueva función ``urandom(n)`` al módulo :mod:`os`, que devuelve una cadena que contiene *n* bytes de datos aleatorios. Esta función proporciona acceso a fuentes de aleatoriedad específicas de la plataforma, como :file:`/dev/urandom` en Linux o Windows CryptoAPI. (Contribuido por Trevor Perrin.)

source: Another new function: ``os.path.lexists(path)`` returns true if the file specified by *path* exists, whether or not it's a symbolic link. This differs from the existing ``os.path.exists(path)`` function, which returns false if *path* is a symlink that points to a destination that doesn't exist. (Contributed by Beni Cherniavsky.)
es: Otra función nueva: ``os.path.lexists(path)`` devuelve verdadero si el archivo especificado por *path* exists, whether or not it's a symbolic link. This differs from the existing ASDF01 function, which returns false if *path* es un enlace simbólico que apunta a un destino que no existe. (Contribuido por Beni Cherniavsky.)

source: A new :func:`getsid` function was added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by J. Raynor.)
es: Se agregó una nueva función :func:`getsid` al módulo :mod:`posix` que subyace al módulo :mod:`os`. (Contribuido por J. Raynor.)

source: The :mod:`poplib` module now supports POP over SSL. (Contributed by Hector Urtubia.)
es: El módulo :mod:`poplib` ahora admite POP sobre SSL. (Contribuido por Héctor Urtubia.)

source: The :mod:`profile` module can now profile C extension functions. (Contributed by Nick Bastin.)
es: El módulo :mod:`profile` ahora puede perfilar funciones de extensión C. (Contribuido por Nick Bastin.)

source: The :mod:`random` module has a new method called ``getrandbits(N)`` that returns a long integer *N* bits in length. The existing :meth:`randrange` method now uses :meth:`getrandbits` where appropriate, making generation of arbitrarily large random numbers more efficient. (Contributed by Raymond Hettinger.)
es: El módulo :mod:`random` tiene un nuevo método llamado ``getrandbits(N)`` que devuelve un entero largo *N* bits de longitud. El método :meth:`randrange` existente ahora usa :meth:`getrandbits` cuando corresponde, lo que hace que la generación de números aleatorios arbitrariamente grandes sea más eficiente. (Contribuido por Raymond Hettinger.)

source: The regular expression language accepted by the :mod:`re` module was extended with simple conditional expressions, written as ``(?(group)A|B)``. *group* is either a numeric group ID or a group name defined with ``(?P<group>...)`` earlier in the expression. If the specified group matched, the regular expression pattern *A* will be tested against the string; if the group didn't match, the pattern *B* will be used instead. (Contributed by Gustavo Niemeyer.)
es: El lenguaje de expresiones regulares aceptado por el módulo :mod:`re` se amplió con expresiones condicionales simples, escritas como ``(?(group)A|B)``. En su lugar, se utilizará *group* is either a numeric group ID or a group name defined with ASDF02 earlier in the expression. If the specified group matched, the regular expression pattern *A* will be tested against the string; if the group didn't match, the pattern *B*. (Contribución de Gustavo Niemeyer.)

source: The :mod:`re` module is also no longer recursive, thanks to a massive amount of work by Gustavo Niemeyer. In a recursive regular expression engine, certain patterns result in a large amount of C stack space being consumed, and it was possible to overflow the stack. For example, if you matched a 30000-byte string of ``a`` characters against the expression ``(a|b)+``, one stack frame was consumed per character. Python 2.3 tried to check for stack overflow and raise a :exc:`RuntimeError` exception, but certain patterns could sidestep the checking and if you were unlucky Python could segfault. Python 2.4's regular expression engine can match this pattern without problems.
es: El módulo :mod:`re` ya no es recursivo, gracias a la enorme cantidad de trabajo de Gustavo Niemeyer. En un motor de expresión regular recursivo, ciertos patrones dan como resultado que se consuma una gran cantidad de espacio de pila de C y es posible desbordar la pila. Por ejemplo, si comparó una cadena de 30000 bytes de caracteres ``a`` con la expresión ``(a|b)+``, se consumió un marco de pila por carácter. Python 2.3 intentó verificar el desbordamiento de la pila y generar una excepción :exc:`RuntimeError`, pero ciertos patrones podrían eludir la verificación y, si no tuvo suerte, Python podría segregar. El motor de expresiones regulares de Python 2.4 puede coincidir con este patrón sin problemas.

source: The :mod:`signal` module now performs tighter error-checking on the parameters to the :func:`signal.signal` function. For example, you can't set a handler on the :const:`SIGKILL` signal; previous versions of Python would quietly accept this, but 2.4 will raise a :exc:`RuntimeError` exception.
es: El módulo :mod:`signal` ahora realiza una verificación de errores más estricta en los parámetros de la función :func:`signal.signal`. Por ejemplo, no puede establecer un controlador en la señal :const:`SIGKILL`; las versiones anteriores de Python aceptarían silenciosamente esto, pero 2.4 lanzará una excepción :exc:`RuntimeError`.

source: Two new functions were added to the :mod:`socket` module. :func:`socketpair` returns a pair of connected sockets and ``getservbyport(port)`` looks up the service name for a given port number. (Contributed by Dave Cole and Barry Warsaw.)
es: Se agregaron dos nuevas funciones al módulo :mod:`socket`. :func:`socketpair` devuelve un par de sockets conectados y ``getservbyport(port)`` busca el nombre del servicio para un número de puerto determinado. (Contribuido por Dave Cole y Barry Warsaw.)

source: The :func:`sys.exitfunc` function has been deprecated. Code should be using the existing :mod:`atexit` module, which correctly handles calling multiple exit functions. Eventually :func:`sys.exitfunc` will become a purely internal interface, accessed only by :mod:`atexit`.
es: La función :func:`sys.exitfunc` ha quedado obsoleta. El código debe usar el módulo :mod:`atexit` existente, que maneja correctamente la llamada a múltiples funciones de salida. Finalmente, :func:`sys.exitfunc` se convertirá en una interfaz puramente interna, a la que solo accederá :mod:`atexit`.

source: The :mod:`tarfile` module now generates GNU-format tar files by default. (Contributed by Lars Gustäbel.)
es: El módulo :mod:`tarfile` ahora genera archivos tar en formato GNU de forma predeterminada. (Contribución de Lars Gustäbel.)

source: The :mod:`threading` module now has an elegantly simple way to support thread-local data. The module contains a :class:`local` class whose attribute values are local to different threads. ::
es: El módulo :mod:`threading` ahora tiene una forma elegante y sencilla de admitir datos locales de subprocesos. El módulo contiene una clase :class:`local` cuyos valores de atributo son locales para diferentes subprocesos. ::

source: Other threads can assign and retrieve their own values for the :attr:`number` and :attr:`url` attributes. You can subclass :class:`local` to initialize attributes or to add methods. (Contributed by Jim Fulton.)
es: Otros subprocesos pueden asignar y recuperar sus propios valores para los atributos :attr:`number` y :attr:`url`. Puede crear una subclase de :class:`local` para inicializar atributos o agregar métodos. (Contribuido por Jim Fulton.)

source: The :mod:`timeit` module now automatically disables periodic garbage collection during the timing loop. This change makes consecutive timings more comparable. (Contributed by Raymond Hettinger.)
es: El módulo :mod:`timeit` ahora deshabilita automáticamente la recolección de basura periódica durante el ciclo de temporización. Este cambio hace que los tiempos consecutivos sean más comparables. (Contribuido por Raymond Hettinger.)

source: The :mod:`weakref` module now supports a wider variety of objects including Python functions, class instances, sets, frozensets, deques, arrays, files, sockets, and regular expression pattern objects. (Contributed by Raymond Hettinger.)
es: El módulo :mod:`weakref` ahora admite una variedad más amplia de objetos, incluidas funciones de Python, instancias de clases, conjuntos, frozensets, deques, matrices, archivos, sockets y objetos de patrones de expresión regular. (Contribuido por Raymond Hettinger.)

source: The :mod:`xmlrpclib` module now supports a multi-call extension for transmitting multiple XML-RPC calls in a single HTTP operation. (Contributed by Brian Quinlan.)
es: El módulo :mod:`xmlrpclib` ahora admite una extensión de múltiples llamadas para transmitir múltiples llamadas XML-RPC en una sola operación HTTP. (Contribuido por Brian Quinlan.)

source: The :mod:`mpz`, :mod:`rotor`, and :mod:`xreadlines` modules have been removed.
es: Se han eliminado los módulos :mod:`mpz`, :mod:`rotor` y :mod:`xreadlines`.

source: The :mod:`cookielib` library supports client-side handling for HTTP cookies, mirroring the :mod:`Cookie` module's server-side cookie support. Cookies are stored in cookie jars; the library transparently stores cookies offered by the web server in the cookie jar, and fetches the cookie from the jar when connecting to the server. As in web browsers, policy objects control whether cookies are accepted or not.
es: La biblioteca :mod:`cookielib` admite el manejo del lado del cliente para las cookies HTTP, reflejando el soporte de cookies del lado del servidor del módulo :mod:`Cookie`. Las cookies se almacenan en frascos de galletas; la biblioteca almacena de forma transparente las cookies ofrecidas por el servidor web en el tarro de cookies y recupera la cookie del tarro cuando se conecta al servidor. Al igual que en los navegadores web, los objetos de política controlan si las cookies se aceptan o no.

source: In order to store cookies across sessions, two implementations of cookie jars are provided: one that stores cookies in the Netscape format so applications can use the Mozilla or Lynx cookie files, and one that stores cookies in the same format as the Perl libwww library.
es: Para almacenar cookies entre sesiones, se proporcionan dos implementaciones de tarros de cookies: una que almacena cookies en formato Netscape para que las aplicaciones puedan usar los archivos de cookies de Mozilla o Lynx, y otra que almacena cookies en el mismo formato que la biblioteca libwww de Perl.

source: :mod:`urllib2` has been changed to interact with :mod:`cookielib`: :class:`HTTPCookieProcessor` manages a cookie jar that is used when accessing URLs.
es: :mod:`urllib2` se ha cambiado para interactuar con :mod:`cookielib`: :class:`HTTPCookieProcessor` administra un tarro de cookies que se utiliza al acceder a las URL.

source: This module was contributed by John J. Lee.
es: Este módulo fue una contribución de John J. Lee.

source: The :mod:`doctest` module underwent considerable refactoring thanks to Edward Loper and Tim Peters. Testing can still be as simple as running :func:`doctest.testmod`, but the refactorings allow customizing the module's operation in various ways
es: El módulo :mod:`doctest` se sometió a una refactorización considerable gracias a Edward Loper y Tim Peters. Las pruebas pueden ser tan simples como ejecutar :func:`doctest.testmod`, pero las refactorizaciones permiten personalizar el funcionamiento del módulo de varias formas.
