Repository: python/python-docs-es
Catalog: whatsnew/2.4.po
Languages: es

source: What's New in Python 2.4
es: Qué hay de nuevo en Python 2.4

source: Author
es: Autor

source: This article explains the new features in Python 2.4.1, released on March 30, 2005.
es: Este artículo explica las nuevas funcionalidades en Python 2.4.1 lanzadas el 30 de marzo de 2005.

source: Python 2.4 is a medium-sized release. It doesn't introduce as many changes as the radical Python 2.2, but introduces more features than the conservative 2.3 release. The most significant new language features are function decorators and generator expressions; most other changes are to the standard library.
es: Python 2.4 es un lanzamiento de término medio. Esto significa que no se han introducido grandes cambios como en la versión 2.2 de Python pero si son más significativas que la versión 2.3. Lo más relevante de estas nuevas funcionalidades son los decoradores y generadores de expresiones, la mayor parte del resto de los cambios son a la librería estándar.

source: According to the CVS change logs, there were 481 patches applied and 502 bugs fixed between Python 2.3 and 2.4. Both figures are likely to be underestimates.
es: De acuerdo al registro de cambios CVS , han sido aplicados 481 parches y 502 bugs han sido corregidos entre las versiones 2.3 y 2.4 de Python. Es posible que ambas cifras no concuerden con la realidad, podrían estar subestimadas.

source: This article doesn't attempt to provide a complete specification of every single new feature, but instead provides a brief introduction to each feature. For full details, you should refer to the documentation for Python 2.4, such as the Python Library Reference and the Python Reference Manual. Often you will be referred to the PEP for a particular new feature for explanations of the implementation and design rationale.
es: Este artículo no pretende proveer una especificación completa y detallada de cada funcionalidad nueva, en vez de esto, se provee una breve descripción de las nuevas características. Para obtener más información se debe consultar la documentación oficial de Python 2.4, tal como la librería de referencia de Python y el manual de referencia de Python. Otra fuente de información es PEP (guía de estilo-mejoras de python) para buscar información sobre la implementación y fundamentación del diseño.

source: PEP 218: Built-In Set Objects
es: PEP 218: Objetos conjunto integrados

source: Python 2.3 introduced the :mod:`sets` module. C implementations of set data types have now been added to the Python core as two new built-in types, ``set(iterable)`` and ``frozenset(iterable)``. They provide high speed operations for membership testing, for eliminating duplicates from sequences, and for mathematical operations like unions, intersections, differences, and symmetric differences. ::
es: Python 2.3 introdujo el módulo :mod:`sets` , implementaciones del lenguaje C de tipos de datos han sido agregados al core de Python como dos nuevos tipos integrados. ``set (iterable)`` y ``frozenset (iterable)`` . Ellos proveen operaciones de alto rendimiento para pruebas de pertenencia, eliminar datos duplicados de una secuencia y operaciones matemáticas como: uniones, intersecciones, diferencias y diferencias simétricas. ::

source: The :func:`frozenset` type is an immutable version of :func:`set`. Since it is immutable and hashable, it may be used as a dictionary key or as a member of another set.
es: La función de conjuntos integrados :func:`frozenset` es una versión inmutable de :func:`set`. Como es inmutable y hashable (su valor no cambia), se puede usar como una llave de diccionario o como parte de otro set.

source: The :mod:`sets` module remains in the standard library, and may be useful if you wish to subclass the :class:`Set` or :class:`ImmutableSet` classes. There are currently no plans to deprecate the module.
es: El módulo set :mod:`sets` se encuentra en la librería estándar y puede ser útil si se desea usar una subclase de :class:`Set` o :class:`ImmutableSet` No existen planes de deprecación del módulo.

source: :pep:`218` - Adding a Built-In Set Object Type
es: :pep:`218` - Agregando tipo de objeto integrado set

source: Originally proposed by Greg Wilson and ultimately implemented by Raymond Hettinger.
es: Originalmente propuesto por Greg Wilson e implementado finalmente por Raymond Hettinger.

source: PEP 237: Unifying Long Integers and Integers
es: PEP 237: Unificando enteros largos y enteros

source: The lengthy transition process for this PEP, begun in Python 2.2, takes another step forward in Python 2.4. In 2.3, certain integer operations that would behave differently after int/long unification triggered :exc:`FutureWarning` warnings and returned values limited to 32 or 64 bits (depending on your platform). In 2.4, these expressions no longer produce a warning and instead produce a different result that's usually a long integer.
es: El prolongado proceso de transición para este PEP que comenzó en Python 2.2 ha dado un paso más adelante en Python 2.4. En la versión 2.3 ciertas operaciones de enteros podían comportarse diferente después de lanzar la unificación del tipo de dato int-long entregando alertas :exc:`FutureWarning` y retornando valores limitados a 32 o 64 bits dependiendo de su plataforma. En la versión 2.4 estas expresiones ya no producen alertas y en vez de eso entrega un resultado diferente que suele ser un entero largo.

source: The problematic expressions are primarily left shifts and lengthy hexadecimal and octal constants. For example, ``2 << 32`` results in a warning in 2.3, evaluating to 0 on 32-bit platforms. In Python 2.4, this expression now returns the correct answer, 8589934592.
es: Las expresiones problemáticas son principalmente desplazamientos a la izquierda y constantes largas de hexadecimales y octales. Por ejemplo, ``2 << 32`` entrega una alerta en la versión 2.3 y evalúa 0 en plataformas 32-bit. Ahora en Python 2.4 la expresión retorna la respuesta correcta, 8589934592.

source: :pep:`237` - Unifying Long Integers and Integers
es: :pep:`237` - Unificando enteros largos y enteros

source: Original PEP written by Moshe Zadka and GvR. The changes for 2.4 were implemented by Kalle Svensson.
es: PEP original escrito por Moshe Zadka y GvR. Los cambios a la versión 2.4 fueron implementados por Kalle Svensson.

source: PEP 289: Generator Expressions
es: PEP 289: Expresiones generadoras

source: The iterator feature introduced in Python 2.2 and the :mod:`itertools` module make it easier to write programs that loop through large data sets without having the entire data set in memory at one time. List comprehensions don't fit into this picture very well because they produce a Python list object containing all of the items. This unavoidably pulls all of the objects into memory, which can be a problem if your data set is very large. When trying to write a functionally styled program, it would be natural to write something like::
es: La función de iterador introducida en Python 2.2 y el módulo :mod:`itertools` facilitan la escritura de programas que recorren grandes conjuntos de datos sin tener todo el conjunto de datos en la memoria al mismo tiempo. Las listas de comprensión no encajan muy bien en esta imagen porque producen un objeto de lista de Python que contiene todos los elementos. Esto inevitablemente lleva todos los objetos a la memoria, lo que puede ser un problema si su conjunto de datos es muy grande. Al tratar de escribir un programa de estilo funcional, sería natural escribir algo como:

source: instead of ::
es: en vez de ::

source: The first form is more concise and perhaps more readable, but if you're dealing with a large number of link objects you'd have to write the second form to avoid having all link objects in memory at the same time.
es: La primera forma es mas concisa y quizás mas legible pero en caso de trabajar con un gran número largo de objetos podría ser necesario el escribir una segunda línea para evitar tener los objetos enlazados en memoria al mismo tiempo.

source: Generator expressions work similarly to list comprehensions but don't materialize the entire list; instead they create a generator that will return elements one by one. The above example could be written as::
es: Las expresiones generadoras trabajan de forma similar a las listas por comprensión pero no materializan la lista completa, en vez de eso se crea un generador que retornará los elementos uno a uno. El siguiente ejemplo podría ser escrito como:

source: Generator expressions always have to be written inside parentheses, as in the above example. The parentheses signalling a function call also count, so if you want to create an iterator that will be immediately passed to a function you could write::
es: Los generadores de expresiones siempre tienen que ser escritos dentro de paréntesis como en el ejemplo descrito arriba. Los paréntesis señalan una llamada a la función que también se puede contar, entonces si se necesita crear un iterador que inmediatamente pasara a una función se podría escribir::

source: Generator expressions differ from list comprehensions in various small ways. Most notably, the loop variable (*obj* in the above example) is not accessible outside of the generator expression. List comprehensions leave the variable assigned to its last value; future versions of Python will change this, making list comprehensions match generator expressions in this respect.
es: Las expresiones generadoras difieren de las listas de comprensión por pequeñas diferencias. La mas notable es que la variable del loop (*obj* en el ejemplo de arriba) no es accesible fuera de la expresión generadora. Las listas de comprensión dejan la variable asignada a su último valor, en versiones futuras de Python esto será cambiado en lo que respecta a hacer que las listas de comprensión coincidan con las expresiones de los generadores.

source: :pep:`289` - Generator Expressions
es: :pep:`289` - Expresiones generadoras

source: Proposed by Raymond Hettinger and implemented by Jiwon Seo with early efforts steered by Hye-Shik Chang.
es: Propuesto por Raymond Hettinger e implementada por Jiwon Seo con los primeros esfuerzos dirigidos por Hye-Shik Chang.

source: PEP 292: Simpler String Substitutions
es: PEP 292: Sustituciones simples de cadenas de caracteres

source: Some new classes in the standard library provide an alternative mechanism for substituting variables into strings; this style of substitution may be better for applications where untrained users need to edit templates.
es: Algunas nuevas clases en la librería estándar proveen un mecanismo alternativo para sustituir variables dentro de cadenas de caracteres, este estilo de sustituciones puede ser mejor por aplicaciones donde usuarios sin experiencia necesitan editar plantillas.

source: The usual way of substituting variables by name is the ``%`` operator::
es: La manera usual de sustituir variables por el nombre es con el operador ``%`` :

source: When writing the template string, it can be easy to forget the ``i`` or ``s`` after the closing parenthesis. This isn't a big problem if the template is in a Python module, because you run the code, get an "Unsupported format character" :exc:`ValueError`, and fix the problem. However, consider an application such as Mailman where template strings or translations are being edited by users who aren't aware of the Python language. The format string's syntax is complicated to explain to such users, and if they make a mistake, it's difficult to provide helpful feedback to them.
es: Cuando se escriben plantillas con cadenas de caracteres puede ser muy fácil olvidar el uso de ``i`` or ``s`` después de cerrar paréntesis. Esto no es un problema grande si se está dentro de un módulo de Python pues al correr el código se lanza el siguiente mensaje de error "Unsupported format character" :exc:`ValueError` y el problema se resuelve. Sin embargo, tengamos en cuenta una aplicación como Mailman donde una plantilla de caracteres o traducciones son editadas por usuarios que no están familiarizados con Python. La sintaxis de como formatear las cadenas de caracteres es complicada de explicar para ciertos usuarios y si ellos cometen un error es una dificultad el entregar retroalimentación y ayuda.

source: PEP 292 adds a :class:`Template` class to the :mod:`string` module that uses ``$`` to indicate a substitution::
es: PEP 292 agrega una clase :class:`Template` al módulo :mod:`string` al módulo que usa ``$`` para indicar una sustitución::

source: If a key is missing from the dictionary, the :meth:`substitute` method will raise a :exc:`KeyError`. There's also a :meth:`safe_substitute` method that ignores missing keys::
es: Si una llave falta en el diccionario, el método :meth:`substitute` lanzará una :exc:`KeyError`. También el método :meth:`safe_substitute` que ignora las llaves faltantes::

source: :pep:`292` - Simpler String Substitutions
es: :pep:`292` - Sustituciones simples de cadenas de caracteres

source: Written and implemented by Barry Warsaw.
es: Escrito e implementado por Barry Warsaw.

source: PEP 318: Decorators for Functions and Methods
es: PEP 318: Decoradores para funciones y métodos

source: Python 2.2 extended Python's object model by adding static methods and class methods, but it didn't extend Python's syntax to provide any new way of defining static or class methods. Instead, you had to write a :keyword:`def` statement in the usual way, and pass the resulting method to a :func:`staticmethod` or :func:`classmethod` function that would wrap up the function as a method of the new type. Your code would look like this::
es: Python 2.2 extendió el modelo de objeto de Python añadiendo métodos estáticos y métodos de clase pero no se extendió la sintaxis de Python para proveer alguna nueva forma de definir métodos estáticos o de clase. En vez de eso se tenía que escribir la palabra clave :keyword:`def` de manera usual y pasar el método resultante a la :func:`staticmethod` o a la :func:`classmethod` que podía agrupar la función como método de un nuevo tipo. El código podría verse como esto:

source: If the method was very long, it would be easy to miss or forget the :func:`classmethod` invocation after the function body.
es: Si el método era muy largo, era muy probable el perder o olvidar la invocación :func:`classmethod` dentro del cuerpo de la función.

source: The intention was always to add some syntax to make such definitions more readable, but at the time of 2.2's release a good syntax was not obvious. Today a good syntax *still* isn't obvious but users are asking for easier access to the feature; a new syntactic feature has been added to meet this need.
es: La intención era siempre agregar alguna sintaxis que hicieran las definiciones mas entendibles pero al tiempo del lanzamiento de la versión 2.2 una buena sintaxis no era clara. Al día de hoy una buena sintaxis aun no es clara pero los usuarios están preguntando por formas más fáciles de acceder a las características, entonces una nueva funcionalidad sintáctica ha sido añadida para satisfacer esta necesidad.

source: The new feature is called "function decorators". The name comes from the idea that :func:`classmethod`, :func:`staticmethod`, and friends are storing additional information on a function object; they're *decorating* functions with more details.
es: La nueva característica es llamada decoradores de funciones. El nombre proviene de la idea de que :func:`classmethod`, :func:`staticmethod` son amigos y guardan información adicional en un objeto de una función. ellos están decorando funciones con mas detalles.

source: The notation borrows from Java and uses the ``'@'`` character as an indicator. Using the new syntax, the example above would be written::
es: La notación proviene de Java y usa el ``'@'`` símbolo arroba como un indicador. Usando la nueva sintaxis el ejemplo descrito arriba podría ser escrito de la siguiente forma:

source: The ``@classmethod`` is shorthand for the ``meth=classmethod(meth)`` assignment. More generally, if you have the following::
es: El ``@classmethod`` es un atajo para ``meth=classmethod(meth)``. De forma general si se tiene lo siguiente:

source: It's equivalent to the following pre-decorator code::
es: Es el equivalente para el siguiente código de pre decorador::

source: Decorators must come on the line before a function definition, one decorator per line, and can't be on the same line as the def statement, meaning that ``@A def f(): ...`` is illegal. You can only decorate function definitions, either at the module level or inside a class; you can't decorate class definitions.
es: Los decoradores deben agregarse en una línea antes de la definición de la función, un decorador por línea y no puede estar en la misma línea donde se usa la palabra def para comenzar una función, por ejemplo ``@A def f(): ...`` es incorrecto. Solo se puede decorar una definición de función tanto al nivel de módulo o dentro de una clase pero no puedes decorar definiciones de clase.

source: A decorator is just a function that takes the function to be decorated as an argument and returns either the same function or some new object. The return value of the decorator need not be callable (though it typically is), unless further decorators will be applied to the result. It's easy to write your own decorators. The following simple example just sets an attribute on the function object::
es: Un decorador es simplemente una función que toma la función a ser decorada como un argumento y retorna tanto la misma función o un nuevo objeto. El valor de retorno del decorador no necesita ser llamado (como típicamente se cree) si no que los decoradores podrán ser aplicados al resultado. Es fácil escribir sus propios decoradores. El siguiente ejemplo agrega un atributo a la función objetiva::

source: As a slightly more realistic example, the following decorator checks that the supplied argument is an integer::
es: Como un ejemplo un poco mas realista, el siguiente decorador revisa si el argumento entregado es un entero::

source: An example in :pep:`318` contains a fancier version of this idea that lets you both specify the required type and check the returned type.
es: Un ejemplo en :pep:`318` contiene una versión mas elegante de esta idea donde deja que usted elija específicamente el tipo y revisa el tipo de retorno.

source: Decorator functions can take arguments. If arguments are supplied, your decorator function is called with only those arguments and must return a new decorator function; this function must take a single function and return a function, as previously described. In other words, ``@A @B @C(args)`` becomes::
es: Los decoradores de funciones pueden tomar argumentos. Si los argumentos son provistos, el decorador de la función es llamado con solo esos argumentos y retorna un nuevo decorador de función, esta función debe tomar una función sola y retorna una función como previamente se ha descrito. En otras palabras ``@A @B @C(args)`` comienza:

source: Getting this right can be slightly brain-bending, but it's not too difficult.
es: Conseguir que esto resulte correcto puede ser un acertijo pero tampoco es muy dificultoso.

source: A small related change makes the :attr:`func_name` attribute of functions writable. This attribute is used to display function names in tracebacks, so decorators should change the name of any new function that's constructed and returned.
es: Un pequeño cambio relacionado hace el atributo :attr:`func_name` de la función modificable. Este atributo es usado para desplegar nombres de funciones en el rastreo, entonces los decoradores cambia el nombre de cualquier nueva función que es construida y retornada.

source: :pep:`318` - Decorators for Functions, Methods and Classes
es: :pep:`318` Decoradores para funciones, métodos y clases

source: Written by Kevin D. Smith, Jim Jewett, and Skip Montanaro. Several people wrote patches implementing function decorators, but the one that was actually checked in was patch #979728, written by Mark Russell.
es: Escrito por Kevin D.Smith, Jim Jewett y Skip Montanaro. Varias personas escribieron parches sobre la implementación de los decoradores de funciones, pero el único que fue chequeado fue #979728 por Mark Russell.

source: This Wiki page contains several examples of decorators.
es: Esta pagina de wiki contiene múltiples ejemplos de decoradores.

source: PEP 322: Reverse Iteration
es: PEP 322: Iteración inversa

source: A new built-in function, ``reversed(seq)``, takes a sequence and returns an iterator that loops over the elements of the sequence in reverse order. ::
es: Una nueva función de conjuntos integrados, ``reversed(seq)`` toma una secuencia y retorna un iterador que recorre los elementos de la secuencia en orden inverso.:

source: Compared to extended slicing, such as ``range(1,4)[::-1]``, :func:`reversed` is easier to read, runs faster, and uses substantially less memory.
es: Comparado con el uso tradicional de la segmentación tal como ``range(1,4)[::-1]`` la función :func:`reversed` es fácil de leer, se ejecuta mas rápido y usa sustancialmente menos memoria.

source: Note that :func:`reversed` only accepts sequences, not arbitrary iterators. If you want to reverse an iterator, first convert it to a list with :func:`list`. ::
es: Señalar que la función :func:`reversed` solo acepta secuencias, no iteradores arbitrarios. Si se quiere revertir un iterador, primero se debe convertir a una lista usando la función :func:`list`.:

source: :pep:`322` - Reverse Iteration
es: :pep:`322` - Iteración inversa

source: Written and implemented by Raymond Hettinger.
es: Escrita e implementada por Raymond Hettinger.

source: PEP 324: New subprocess Module
es: PEP 324: Nuevo módulo de subproceso

source: The standard library provides a number of ways to execute a subprocess, offering different features and different levels of complexity. ``os.system(command)`` is easy to use, but slow (it runs a shell process which executes the command) and dangerous (you have to be careful about escaping the shell's metacharacters). The :mod:`popen2` module offers classes that can capture standard output and standard error from the subprocess, but the naming is confusing. The :mod:`subprocess` module cleans this up, providing a unified interface that offers all the features you might need.
es: La librería estándar provee un cierto número de formas de ejecutar un subproceso, ofreciendo diferentes funcionalidades y diferentes niveles de complejidad. ``os.system(command)`` es fácil de usar pero lento (esto corre un proceso a nivel de interprete de comandos)y peligroso (se tiene que ser cuidadoso con no considerar los metacaracteres usados en el intérprete) El módulo :mod:`popen2` ofrece clases que pueden capturar la salida estándar y el error estándar del subproceso, pero el nombre puede ser confuso. El módulo :mod:`subprocess` deja esto mas claro proveyendo una interface unificada que ofrece todas las funcionalidades que usted necesita.

source: Instead of :mod:`popen2`'s collection of classes, :mod:`subprocess` contains a single class called :class:`Popen` whose constructor supports a number of different keyword arguments. ::
es: En vez de :mod:`popen2` que es una colección de clases el :mod:`subprocess` contiene una sola clase llamada :class:`Popen` cuyo constructor soporta un número de diferentes argumentos de palabra clave:
