Repository: python/python-docs-es
Catalog: whatsnew/2.4.po
Languages: es

source: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` converts a :c:expr:`double` to an ASCII string.
es: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` convierte un :c:expr:`double` en una cadena ASCII.

source: The code for these functions came from the GLib library (https://developer-old.gnome.org/glib/2.26/), whose developers kindly relicensed the relevant functions and donated them to the Python Software Foundation. The :mod:`locale` module can now change the numeric locale, letting extensions such as GTK+ produce the correct results.
es: El código para estas funciones proviene desde la librería GLib (https://developer-old.gnome.org/glib/2.26/) cuyos desarrolladores amablemente han residenciado las funciones relevantes y las han donado a la fundación de software Python. El módulo :mod:`locale` ahora puede cambiar la configuración local, dejando que las extensiones como GTK+ produzcan los resultados correctos.

source: :pep:`331` - Locale-Independent Float/String Conversions
es: :pep:`331` Conversiones Local-Independiente flotante/cadena de texto

source: Written by Christian R. Reis, and implemented by Gustavo Carneiro.
es: Escrito por Christian R. Reis, e implementado por Gustavo Carneiro.

source: Other Language Changes
es: Otros cambios en el lenguaje

source: Here are all of the changes that Python 2.4 makes to the core Python language.
es: Aquí están todos los cambios que Python 2.4 ha hecho al core del lenguaje Python.

source: Decorators for functions and methods were added (:pep:`318`).
es: Fueron añadidos decoraciones para funciones (:pep:`318`).

source: Built-in :func:`set` and :func:`frozenset` types were added (:pep:`218`). Other new built-ins include the ``reversed(seq)`` function (:pep:`322`).
es: Funciones de conjuntos integrados :func:`set` y :func:`frozenset` fueron añadidas (:pep:`218`). Otras nuevas funciones de conjuntos integrados incluyen la función ``reversed(seq)`` (:pep:`322`).

source: Generator expressions were added (:pep:`289`).
es: Generador de expresiones fueron añadidas (:pep:`289`).

source: Certain numeric expressions no longer return values restricted to 32 or 64 bits (:pep:`237`).
es: Algunas expresiones numéricas ya no retornan valores restringidos a 32 o 64 bits (:pep:`237`).

source: You can now put parentheses around the list of names in a ``from module import names`` statement (:pep:`328`).
es: Se puede poner entre paréntesis una lista de nombres en la declaración ``from module import names`` (:pep:`328`).

source: The :meth:`dict.update` method now accepts the same argument forms as the :class:`dict` constructor. This includes any mapping, any iterable of key/value pairs, and keyword arguments. (Contributed by Raymond Hettinger.)
es: El método :meth:`dict.update` ahora acepta el mismo argumento que el constructor de la :class:`dict`. Esto incluye cualquier tipo de mapeo, iterable pares de clave/valor y argumentos de palabra clave. (Contribución de Raymond Hettinger)

source: The string methods :meth:`ljust`, :meth:`rjust`, and :meth:`center` now take an optional argument for specifying a fill character other than a space. (Contributed by Raymond Hettinger.)
es: Los métodos de cadena de caracteres :meth:`ljust`, :meth:`rjust` y :meth:`center` ahora toman un argumento de tipo opcional para especificar un carácter de relleno que no sea un espacio. (Contribución de Raymond Hettinger).

source: Strings also gained an :meth:`rsplit` method that works like the :meth:`split` method but splits from the end of the string. (Contributed by Sean Reifschneider.) ::
es: Cadenas de caracteres también han ganado un método :meth:`rsplit` que funciona como el método :meth:`split` pero divide desde el final de la cadena de caracteres. (Contribución de Sean Reifschneider)

source: Three keyword parameters, *cmp*, *key*, and *reverse*, were added to the :meth:`sort` method of lists. These parameters make some common usages of :meth:`sort` simpler. All of these parameters are optional.
es: Tres parámetros de argumentos de palabra clave *cmp*, *key* y *reverse* fueron añadidos al método de listas :meth:`sort`. Estos parámetros hacen algunos usos comunes del método :meth:`sort` mas simple. Todos estos parámetros son opcionales.

source: For the *cmp* parameter, the value should be a comparison function that takes two parameters and returns -1, 0, or +1 depending on how the parameters compare. This function will then be used to sort the list. Previously this was the only parameter that could be provided to :meth:`sort`.
es: Para el parámetro *cmp* el valor debe ser una función comparativa que toma dos parámetros y retorna -1, 0 o + 1 dependiendo de como compare los parámetros. Esta función será usada para ordenar la lista. Previamente esto era el único parámetro que podía ser entregado al :meth:`sort`.

source: *key* should be a single-parameter function that takes a list element and returns a comparison key for the element. The list is then sorted using the comparison keys. The following example sorts a list case-insensitively::
es: *key* debe ser una función con un solo parámetro que toma un elemento de la lista y retorna una llave de comparación para el elemento. Entonces la lista es ordenado usando las claves de comparación. El siguiente ejemplo ordena una lista sin distinción de mayúsculas ni minúsculas::

source: The last example, which uses the *cmp* parameter, is the old way to perform a case-insensitive sort. It works but is slower than using a *key* parameter. Using *key* calls :meth:`lower` method once for each element in the list while using *cmp* will call it twice for each comparison, so using *key* saves on invocations of the :meth:`lower` method.
es: El ultimo ejemplo el cual usa el parámetro *cmp* es la antigua forma de ejecutar el orden sin distinción de mayúsculas y minúsculas. Funciona pero es mas lento en vez de usar el parámetro *key*. El uso de *key* llama al método :meth:`lower` una vez para cada elemento de la lista mientras el uso de *cmp* lo llamara dos veces para cada comparación, entonces al usar * key * se guardan las llamadas del método :meth:`lower`.

source: For simple key functions and comparison functions, it is often possible to avoid a :keyword:`lambda` expression by using an unbound method instead. For example, the above case-insensitive sort is best written as::
es: Para funciones de clave sencillas y comparativas es a menudo posible el obviar la palabra clave :keyword:`lambda` usando un método sin ligar en reemplazo. El siguiente ejemplo de orden sin importar mayúsculas ni minúsculas es mejor escrito como se muestra::

source: Finally, the *reverse* parameter takes a Boolean value. If the value is true, the list will be sorted into reverse order. Instead of ``L.sort(); L.reverse()``, you can now write ``L.sort(reverse=True)``.
es: Finalmente el parámetro *reverse* toma un valor de tipo booleano. Si el valor es verdadero la lista será ordenada de forma inversa. En vez de ``L.sort(); L.reverse()`` ahora se puede escribir ``L.sort(reverse=True)``.

source: The results of sorting are now guaranteed to be stable. This means that two entries with equal keys will be returned in the same order as they were input. For example, you can sort a list of people by name, and then sort the list by age, resulting in a list sorted by age where people with the same age are in name-sorted order.
es: Los resultados del ordenamiento ahora están garantizados que son estables. Esto significa que dos entradas con iguales claves serán retiradas en el mismo orden en que fueron ingresadas. Por ejemplo se puede ordenar una lista de personas por el nombre y entonces ordenarla por edad, resultando en una lista ordenada donde las personas con la misma edad están en el mismo orden por nombre.

source: (All changes to :meth:`sort` contributed by Raymond Hettinger.)
es: (Todos los cambios al método :meth:`sort` fueron realizados por Raymond Hettinger.)

source: There is a new built-in function ``sorted(iterable)`` that works like the in-place :meth:`list.sort` method but can be used in expressions. The differences are:
es: Se tiene una nueva función incorporada ``sorted(iterable)`` que trabaja como el método in situ :meth:`list.sort` que se puede usar en expresiones. Las diferencias son:

source: the input may be any iterable;
es: el dato de entrada puede ser algún iterable;

source: a newly formed copy is sorted, leaving the original intact; and
es: se ordena una copia recién formada, manteniendo el original intacto y

source: the expression returns the new sorted copy
es: la expresión retorna una nueva copia ordenada

source: (Contributed by Raymond Hettinger.)
es: (Contribución de Raymond Hettinger.)

source: Integer operations will no longer trigger an :exc:`OverflowWarning`. The :exc:`OverflowWarning` warning will disappear in Python 2.5.
es: Operaciones de números enteros no lanzaran una excepción :exc:`OverflowWarning`. La advertencia sobre :exc:`OverflowWarning` desaparecerá en Python 2.5.

source: The interpreter gained a new switch, :option:`-m`, that takes a name, searches for the corresponding module on ``sys.path``, and runs the module as a script. For example, you can now run the Python profiler with ``python -m profile``. (Contributed by Nick Coghlan.)
es: Se añadió al interprete una nueva opción de cambio :option:`-m` la cual toma un nombre, busca el módulo correspondiente en ``sys.path`` y corre el módulo como script. Ahora por ejemplo se puede correr el perfilador de Python con ``python -m profile``. (Contribución de Nick Coghlan)

source: The ``eval(expr, globals, locals)`` and ``execfile(filename, globals, locals)`` functions and the ``exec`` statement now accept any mapping type for the *locals* parameter. Previously this had to be a regular Python dictionary. (Contributed by Raymond Hettinger.)
es: La expresión ``eval(expr, globals, locals)`` la función ``execfile(filename, globals, locals)`` y la sentencia ``exec`` ahora aceptan cualquier tipo de mapeo para parámetros locales. Previamente esto era parte de un diccionario de Python. (Contribución de Raymond Hettinger.)

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list if called with no arguments. Previously they raised a :exc:`TypeError` exception. This makes them more suitable for use with variable length argument lists::
es: La función incorporada :func:`zip` y la función :func:`itertools.izip` ahora retornan una lista hacia si se llama sin argumentos. Previamente estos lanzaban una excepción de tipo :exc:`TypeError`. Esto lo hace mas apropiado de usar con listas de argumentos de longitud variable:

source: Encountering a failure while importing a module no longer leaves a partially initialized module object in ``sys.modules``. The incomplete module object left behind would fool further imports of the same module into succeeding, leading to confusing errors. (Fixed by Tim Peters.)
es: Encontrar un error al importar un módulo ya no deja un objeto de módulo parcialmente inicializado en ``sys.modules``. El objeto de módulo incompleto que se deja atrás engañaría a las importaciones posteriores del mismo módulo para que tuvieran éxito, lo que generaría errores confusos. (Reparado por Tim Peters.)

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error. (Contributed by Raymond Hettinger.)
es: :const:`None`es ahora una constante, el código que une un nuevo valor con el nombre :const:`None` es ahora un error de sintaxis (Contribución de Raymond Hettinger)

source: Optimizations
es: Optimizaciones

source: The inner loops for list and tuple slicing were optimized and now run about one-third faster. The inner loops for dictionaries were also optimized, resulting in performance boosts for :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues`, and :meth:`iteritems`. (Contributed by Raymond Hettinger.)
es: Los bucles internos para separar listas y tuplas fueron optimizados y ahora corren un tercio mas rápido. Los bucles internos para diccionarios también fueron optimizados resultando en una mejora en el rendimiento para :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues`, y :meth:`iteritems`. (Contribución de Raymond Hettinger)

source: The machinery for growing and shrinking lists was optimized for speed and for space efficiency. Appending and popping from lists now runs faster due to more efficient code paths and less frequent use of the underlying system :c:func:`realloc`. List comprehensions also benefit. :meth:`list.extend` was also optimized and no longer converts its argument into a temporary list before extending the base list. (Contributed by Raymond Hettinger.)
es: El mecanismo para mejorar y contraer listas fue optimizada para efectos de velocidad y eficiencia en la utilización de recursos. Anexar y quitar elementos de una lista es ahora mas rápido debido al código mas eficiente y al menos frecuente uso de la función subyacente :c:func:`realloc`. Las listas por comprensión también son beneficiadas, el método :meth:`list.extend` fue también optimizado y ya no convierte mas el argumento en una lista temporal antes de extender la lista base. (Contribución de Raymond Hettinger)

source: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter`, and :func:`zip` now run several times faster with non-sequence arguments that supply a :meth:`__len__` method. (Contributed by Raymond Hettinger.)
es: Las funciones :func:`list`, :func:`tuple`, :func:`map`, :func:`filter` y :func:`zip` ahora corren mucho mas rápido con argumentos no secuenciales que ahora suministra el método :meth:`__len__`. (Contribución Raymond Hettinger.)

source: The methods :meth:`list.__getitem__`, :meth:`dict.__getitem__`, and :meth:`dict.__contains__` are now implemented as :class:`method_descriptor` objects rather than :class:`wrapper_descriptor` objects. This form of access doubles their performance and makes them more suitable for use as arguments to functionals: ``map(mydict.__getitem__, keylist)``. (Contributed by Raymond Hettinger.)
es: Los métodos :meth:`list.__getitem__`, :meth:`dict.__getitem__` y :meth:`dict.__contains__` ahora son implementados como objetos de la clase :class:`method_descriptor` en vez de los objetos de la clase :class:`wrapper_descriptor` . Este acceso dobla el rendimiento y hace que sea mas apropiado para ser usado como argumentos de:``map(mydict.__getitem__, keylist)``. (Contribución de Raymond Hettinger)

source: Added a new opcode, ``LIST_APPEND``, that simplifies the generated bytecode for list comprehensions and speeds them up by about a third. (Contributed by Raymond Hettinger.)
es: Adicionalmente se ha agregado a un nuevo código de operación ``LIST_APPEND`` esto simplifica la generación de código a nivel de byte para las listas por comprensión y las agiliza en aproximadamente un tercio.

source: The peephole bytecode optimizer has been improved to produce shorter, faster bytecode; remarkably, the resulting bytecode is more readable. (Enhanced by Raymond Hettinger.)
es: El optimizador de código a nivel de byte ha sido mejorado para producir código a nivel de byte mas corto y rápido. Esto resulta en código mas legible. (Contribución de Raymond Hettinger)

source: String concatenations in statements of the form ``s = s + "abc"`` and ``s += "abc"`` are now performed more efficiently in certain circumstances. This optimization won't be present in other Python implementations such as Jython, so you shouldn't rely on it; using the :meth:`join` method of strings is still recommended when you want to efficiently glue a large number of strings together. (Contributed by Armin Rigo.)
es: La concatenación de cadenas de texto en la declaración de ``s = s + "abc"`` and ``s += "abc"`` ahora son ejecutadas de forma mas eficiente en ciertas circunstancias. Esta optimizaciones no serán mostradas en otras implementaciones de Python tales como Python, entonces no se debe utilizar, es mejor seguir utilizando el método :meth:`join` de cadenas de caracteres si se quiere mantener la eficiencia de concatenar un largo número de cadenas de caracteres. (Contribución de Armin Rigo.)

source: The net result of the 2.4 optimizations is that Python 2.4 runs the pystone benchmark around 5% faster than Python 2.3 and 35% faster than Python 2.2. (pystone is not a particularly good benchmark, but it's the most commonly used measurement of Python's performance. Your own applications may show greater or smaller benefits from Python 2.4.)
es: El resultado de las optimizaciones de la versión 2.4 es que tomando Python 2.4 como punto de referencia corre alrededor de un 5% mas rápido que Python 2.3 y un 35% mas rápido que Python 2.2 (pystone no es particularmente un buen punto de referencia pero es el mas usado para medir rendimiento en Python. Sus propias aplicaciones pueden mostrar beneficios mas grandes o mínimos desde Python 2.4)

source: New, Improved, and Deprecated Modules
es: Módulos nuevos, mejorados y obsoletos

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
es: Como es usual, la librería estándar de Python recibió un número de mejoras y corrección de errores. Aquí hay una lista parcial de los cambios mas notables, ordenados alfabéticamente por nombre de módulo. Consulte el archivo :file:`Misc/NEWS` en la estructura del directorio para una completa lista de los cambios o se puede buscar a través del registro CVS para obtener todos los detalles.

source: The :mod:`asyncore` module's :func:`loop` function now has a *count* parameter that lets you perform a limited number of passes through the polling loop. The default is still to loop forever.
es: El módulo :mod:`asyncore` y la función :func:`loop` ahora tiene un parámetro *count* que permite ejecutar un limitado número de pases mediante el bucle. El valor predeterminado sigue siendo el bucle para siempre.

source: The :mod:`base64` module now has more complete :rfc:`3548` support for Base64, Base32, and Base16 encoding and decoding, including optional case folding and optional alternative alphabets. (Contributed by Barry Warsaw.)
es: El módulo :mod:`base64` ahora tiene un soporte mas completo :rfc:`3548` para Base64, Base32 y Base16 para codificación y descodificación, incluyendo procesos de convertir caracteres a minúsculas y alfabetos alternativos. (Contribución de Barry Warsaw)

source: The :mod:`bisect` module now has an underlying C implementation for improved performance. (Contributed by Dmitry Vasiliev.)
es: El módulo :mod:`bisect` ahora tiene una implementación C subyacente para mejorar el rendimiento. (Contribuido por Dmitry Vasiliev.)

source: The CJKCodecs collections of East Asian codecs, maintained by Hye-Shik Chang, was integrated into 2.4. The new encodings are:
es: Las colecciones CJKCodecs de códecs de Asia oriental, mantenidas por Hye-Shik Chang, se integraron en 2.4. Las nuevas codificaciones son:

source: Chinese (PRC): gb2312, gbk, gb18030, big5hkscs, hz
es: Chino (PRC): gb2312, gbk, gb18030, big5hkscs, hz

source: Chinese (ROC): big5, cp950
es: Chino (República de China): big5, cp950

source: Japanese: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,
es: Japonés: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,

source: Korean: cp949, euc-kr, johab, iso-2022-kr
es: Coreano: cp949, euc-kr, johab, iso-2022-kr

source: Some other new encodings were added: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154, and TIS-620.
es: Se agregaron algunas otras codificaciones nuevas: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154 y TIS-620.

source: The UTF-8 and UTF-16 codecs now cope better with receiving partial input. Previously the :class:`StreamReader` class would try to read more data, making it impossible to resume decoding from the stream. The :meth:`read` method will now return as much data as it can and future calls will resume decoding where previous ones left off. (Implemented by Walter Dörwald.)
es: Los códecs UTF-8 y UTF-16 ahora se adaptan mejor a la recepción de entradas parciales. Anteriormente, la clase :class:`StreamReader` intentaba leer más datos, lo que hacía imposible reanudar la decodificación desde el flujo. El método :meth:`read` ahora devolverá tantos datos como pueda y las llamadas futuras reanudarán la decodificación donde lo dejaron las anteriores. (Implementado por Walter Dörwald.)

source: There is a new :mod:`collections` module for various specialized collection datatypes. Currently it contains just one type, :class:`deque`, a double-ended queue that supports efficiently adding and removing elements from either end::
es: Hay un nuevo módulo :mod:`collections` para varios tipos de datos de recopilación especializados. Actualmente contiene solo un tipo, :class:`deque`, una cola de dos extremos que admite la adición y eliminación de elementos de manera eficiente desde cualquier extremo:

source: Several modules, such as the :mod:`Queue` and :mod:`threading` modules, now take advantage of :class:`collections.deque` for improved performance. (Contributed by Raymond Hettinger.)
es: Varios módulos, como los módulos :mod:`Queue` y :mod:`threading`, ahora aprovechan :class:`collections.deque` para mejorar el rendimiento. (Contribuido por Raymond Hettinger.)

source: The :mod:`ConfigParser` classes have been enhanced slightly. The :meth:`read` method now returns a list of the files that were successfully parsed, and the :meth:`set` method raises :exc:`TypeError` if passed a *value* argument that isn't a string. (Contributed by John Belmonte and David Goodger.)
es: Las clases de :mod:`ConfigParser` se han mejorado ligeramente. El método :meth:`read` ahora devuelve una lista de los archivos que se analizaron correctamente y el método :meth:`set` lanza :exc:`TypeError` si se pasa un argumento *value* que no es una cadena. (Contribuido por John Belmonte y David Goodger.)

source: The :mod:`curses` module now supports the ncurses extension :func:`use_default_colors`. On platforms where the terminal supports transparency, this makes it possible to use a transparent background. (Contributed by Jörg Lehmann.)
es: El módulo :mod:`curses` ahora admite la extensión ncurses :func:`use_default_colors`. En plataformas donde el terminal admite transparencia, esto permite utilizar un fondo transparente. (Contribución de Jörg Lehmann.)

source: The :mod:`difflib` module now includes an :class:`HtmlDiff` class that creates an HTML table showing a side by side comparison of two versions of a text. (Contributed by Dan Gass.)
es: El módulo :mod:`difflib` ahora incluye una clase :class:`HtmlDiff` que crea una tabla HTML que muestra una comparación lado a lado de dos versiones de un texto. (Contribuido por Dan Gass.)
