Repository: python/python-docs-es
Catalog: whatsnew/2.4.po
Languages: es

source: *args* is commonly a sequence of strings that will be the arguments to the program executed as the subprocess. (If the *shell* argument is true, *args* can be a string which will then be passed on to the shell for interpretation, just as :func:`os.system` does.)
es: *args* es comúnmente una secuencia de cadenas de caracteres que podrán ser los argumentos del programa ejecutado como un subproceso. (Si el argumento *shell* es verdadero, *args* puede ser una cadena de caracteres que serán pasados directamente a la shell para su interpretación, tal como :func:`os.system` lo hace.)

source: *stdin*, *stdout*, and *stderr* specify what the subprocess's input, output, and error streams will be. You can provide a file object or a file descriptor, or you can use the constant ``subprocess.PIPE`` to create a pipe between the subprocess and the parent.
es: *stdin*, *stdout*, y *stderr* especifican que flujos de entrada, salida y error serán utilizados. Se puede proceder un objeto de archivo o un archivo de descripción o se puede usar la constante ``subprocess.PIPE`` para crear un enlace entre el subproceso y el proceso principal.

source: The constructor has a number of handy options:
es: El constructor tiene un número de opciones útiles:

source: *close_fds* requests that all file descriptors be closed before running the subprocess.
es: *close_fds* requiere que todos los descriptores de archivos sean cerrados antes de correr el subproceso.

source: *cwd* specifies the working directory in which the subprocess will be executed (defaulting to whatever the parent's working directory is).
es: *cwd* especifica el directorio operativo donde el subproceso será ejecutado (por defecto, cualquiera que sea el directorio principal)

source: *env* is a dictionary specifying environment variables.
es: *env* es un diccionario donde se especifican las variables de entorno.

source: *preexec_fn* is a function that gets called before the child is started.
es: *preexec_fn* es una función que es llamada antes de que el proceso hijo sea llamado.

source: *universal_newlines* opens the child's input and output using Python's :term:`universal newlines` feature.
es: *universal_newlines* abre el flujo de entrada y salida del hijo usando la característica de Python :term:`universal newlines` .

source: Once you've created the :class:`Popen` instance, you can call its :meth:`wait` method to pause until the subprocess has exited, :meth:`poll` to check if it's exited without pausing, or ``communicate(data)`` to send the string *data* to the subprocess's standard input. ``communicate(data)`` then reads any data that the subprocess has sent to its standard output or standard error, returning a tuple ``(stdout_data, stderr_data)``.
es: Una vez que se ha creado la instancia de la :class:`Popen` se puede llamar al método :meth:`wait` para poner en pausa hasta que el subproceso ha terminado, el método :meth:`poll` comprueba si se ha salido sin pausar o el uso de ``communicate(data)`` envía la cadena de caracteres *data* a la entrada estándar del subproceso. Y el uso de ``communicate(data)`` que lee cualquier dato que el subproceso ha enviado a la salida estándar, retornando una tupla ``(stdout_data, stderr_data)``.

source: :func:`call` is a shortcut that passes its arguments along to the :class:`Popen` constructor, waits for the command to complete, and returns the status code of the subprocess. It can serve as a safer analog to :func:`os.system`::
es: :func:`call` es un atajo que pasa estos argumentos a lo largo del constructor de la clase :class:`Popen`, espera por el comando para completar la secuencia y retorna el código de estatus del subproceso. Esto puede servir como un análogo mas seguro de :func:`os.system`:

source: The command is invoked without use of the shell. If you really do want to use the shell, you can add ``shell=True`` as a keyword argument and provide a string instead of a sequence::
es: El comando es invocado sin el uso del interprete de comandos. Si se desea usar el intérprete se puede agregar ``shell=True`` como un argumento de palabra clave y proveer una cadena de caracteres en vez de una secuencia:

source: The PEP takes various examples of shell and Python code and shows how they'd be translated into Python code that uses :mod:`subprocess`. Reading this section of the PEP is highly recommended.
es: La guía de estilo de Python toma varios ejemplos de línea de comandos y código python y muestra como estos son traducidos en el código python :mod:`subprocess`. Leer esta sección de la guía de estilo es altamente recomendado.

source: :pep:`324` - subprocess - New process module
es: :pep:`324` - subprocess - Nuevo módulo de procesos

source: Written and implemented by Peter Åstrand, with assistance from Fredrik Lundh and others.
es: Escrito e implementado por Peter Åstrand, con asistencia de Frederik Lundh y otros.

source: PEP 327: Decimal Data Type
es: PEP 327: Tipo de dato decimal

source: Python has always supported floating-point (FP) numbers, based on the underlying C :c:expr:`double` type, as a data type. However, while most programming languages provide a floating-point type, many people (even programmers) are unaware that floating-point numbers don't represent certain decimal fractions accurately. The new :class:`Decimal` type can represent these fractions accurately, up to a user-specified precision limit.
es: Python siempre ha soportado números de punto flotante (FP), basados ​​en el tipo subyacente C :c:expr:`double`, como un tipo de datos. Sin embargo, aunque la mayoría de los lenguajes de programación proporcionan un tipo de punto flotante, muchas personas (incluso los programadores) no saben que los números de punto flotante no representan ciertas fracciones decimales con precisión. El nuevo tipo :class:`Decimal` puede representar estas fracciones con precisión, hasta un límite de precisión especificado por el usuario.

source: Why is Decimal needed?
es: ¿Por qué se necesita Decimal?

source: The limitations arise from the representation used for floating-point numbers. FP numbers are made up of three components:
es: Las limitaciones surgen de la representación usada para los números de punto flotante. Los números de punto flotante están hechos de tres componentes:

source: The sign, which is positive or negative.
es: El signo, el cual es positivo o negativo.

source: The mantissa, which is a single-digit binary number followed by a fractional part. For example, ``1.01`` in base-2 notation is ``1 + 0/2 + 1/4``, or 1.25 in decimal notation.
es: El significando o mantisa el cual es el un dígito binario seguido de su parte fraccional. Por ejemplo, ``1.01`` en notación base 2 es ``1 + 0/2 + 1/4`` o 1.25 en notación decimal.

source: The exponent, which tells where the decimal point is located in the number represented.
es: El exponente, que indica dónde se encuentra el punto decimal en el número representado.

source: For example, the number 1.25 has positive sign, a mantissa value of 1.01 (in binary), and an exponent of 0 (the decimal point doesn't need to be shifted). The number 5 has the same sign and mantissa, but the exponent is 2 because the mantissa is multiplied by 4 (2 to the power of the exponent 2); 1.25 \* 4 equals 5.
es: Por ejemplo, el número 1.25 tiene un signo positivo, una mantisa de valor 1.01 (en binario) y un exponente de 0 (el punto decimal no necesita ser desplazado. El números 5 tiene el mismo signo y significando pero, el exponente es 2 porque el significando es multiplicado por 4 (2 elevado a la potencia del exponente 2), 1.25 \* 4 es igual a 5.

source: Modern systems usually provide floating-point support that conforms to a standard called IEEE 754. C's :c:expr:`double` type is usually implemented as a 64-bit IEEE 754 number, which uses 52 bits of space for the mantissa. This means that numbers can only be specified to 52 bits of precision. If you're trying to represent numbers whose expansion repeats endlessly, the expansion is cut off after 52 bits. Unfortunately, most software needs to produce output in base 10, and common fractions in base 10 are often repeating decimals in binary. For example, 1.1 decimal is binary ``1.0001100110011 ...``; .1 = 1/16 + 1/32 + 1/256 plus an infinite number of additional terms. IEEE 754 has to chop off that infinitely repeated decimal after 52 digits, so the representation is slightly inaccurate.
es: Los sistemas modernos generalmente brindan soporte de coma flotante que se ajusta a un estándar llamado IEEE 754. El tipo :c:expr:`double` de C generalmente se implementa como un número IEEE 754 de 64 bits, que usa 52 bits de espacio para la mantisa. Esto significa que los números solo se pueden especificar con 52 bits de precisión. Si está tratando de representar números cuya expansión se repite sin cesar, la expansión se corta después de 52 bits. Desafortunadamente, la mayoría del software necesita producir resultados en base 10, y las fracciones comunes en base 10 a menudo son decimales repetidos en binario. Por ejemplo, 1.1 decimal es binario ``1.0001100110011 ...``; .1 = 1/16 + 1/32 + 1/256 más un número infinito de términos adicionales. IEEE 754 tiene que cortar ese decimal repetido infinitamente después de 52 dígitos, por lo que la representación es un poco inexacta.

source: Sometimes you can see this inaccuracy when the number is printed::
es: Algunas veces se puede ver esta inexactitud cuando el número es impreso por pantalla:

source: The inaccuracy isn't always visible when you print the number because the FP-to-decimal-string conversion is provided by the C library, and most C libraries try to produce sensible output. Even if it's not displayed, however, the inaccuracy is still there and subsequent operations can magnify the error.
es: La inexactitud no siempre es visible cuando se imprime el número porque el punto flotante a decimal y conversión a cadena de texto es entregada por la librería C y la mayoría de las librerías C tratan de producir una salida sensible. Incluso si no es mostrado, la inexactitud sigue ahí y las operaciones subsecuentes pueden agrandar el error.

source: For many applications this doesn't matter. If I'm plotting points and displaying them on my monitor, the difference between 1.1 and 1.1000000000000001 is too small to be visible. Reports often limit output to a certain number of decimal places, and if you round the number to two or three or even eight decimal places, the error is never apparent. However, for applications where it does matter, it's a lot of work to implement your own custom arithmetic routines.
es: Para muchas aplicaciones esto no importa. Si estoy trazando puntos y mostrándolos en el monitor la diferencia entre 1.1 y 1.1000000000000001 es muy pequeña para ser visible. Los reportes a menudo limitan la salida de un cierto número de decimales y si se redondea el número a dos o tres e incluso a 8 decimales, el error nunca aparece. Sin embargo, para las aplicaciones donde esto importa, es una cantidad de trabajo importante el personalizar los cálculos aritméticos.

source: Hence, the :class:`Decimal` type was created.
es: Es por eso que el tipo de clase :class:`Decimal` fue creada.

source: The :class:`Decimal` type
es: El tipo de clase :class:`Decimal`

source: A new module, :mod:`decimal`, was added to Python's standard library. It contains two classes, :class:`Decimal` and :class:`Context`. :class:`Decimal` instances represent numbers, and :class:`Context` instances are used to wrap up various settings such as the precision and default rounding mode.
es: Un nuevo módulo, :mod:`decimal`, fue añadido a la librería estándar de Python. Esta contiene dos clases, :class:`Decimal` y :class:`Context`. Las instancias de la clase decimal :class:`Decimal` representan números y la instancia de la :class:`Context` son usadas para condensar varios ajustes como la precisión y el modo de redondeo por defecto.

source: :class:`Decimal` instances are immutable, like regular Python integers and FP numbers; once it's been created, you can't change the value an instance represents. :class:`Decimal` instances can be created from integers or strings::
es: Las instancias de la clase :class:`Decimal` son inmutables como los números enteros y números de punto flotante en Python, una vez han sido creadas no se puede cambiar el valor de lo que la instancia representa. Las instancias de la :class:`Decimal` pueden ser creados desde números enteros o cadenas de texto:

source: You can also provide tuples containing the sign, the mantissa represented as a tuple of decimal digits, and the exponent::
es: También se pueden proveer tuplas que contentan el signo, la mantisa representada como una tupla de números decimales y el exponente:

source: Cautionary note: the sign bit is a Boolean value, so 0 is positive and 1 is negative.
es: Precaución: El signo bit es un valor booleano entonces 0 es positivo y 1 es negativo.

source: Converting from floating-point numbers poses a bit of a problem: should the FP number representing 1.1 turn into the decimal number for exactly 1.1, or for 1.1 plus whatever inaccuracies are introduced? The decision was to dodge the issue and leave such a conversion out of the API. Instead, you should convert the floating-point number into a string using the desired precision and pass the string to the :class:`Decimal` constructor::
es: Convertir desde números de punto flotante posee un pequeño problema, el punto flotante representa 1.1 y se convierte en número decimal como 1.1 o por 1.1 mas cualquier inexactitud que se introduzca? La decisión fue evitar el problema y dejar tal conversión fuera de la API. En su lugar se debe convertir el número de punto flotante en una cadena con la precisión deseada y pasar la cadena al constructor :class:`Decimal` :

source: Once you have :class:`Decimal` instances, you can perform the usual mathematical operations on them. One limitation: exponentiation requires an integer exponent::
es: Una vez que se tiene la instancia de la clase :class:`Decimal` se pueden realizar las operaciones matemáticas de rigor. Una limitación, la exponenciación requiere un exponente expresado en tipo de dato entero:

source: You can combine :class:`Decimal` instances with integers, but not with floating-point numbers::
es: Se puede combinar la instancia de la clase :class:`Decimal` con enteros pero no con números de punto flotante:

source: :class:`Decimal` numbers can be used with the :mod:`math` and :mod:`cmath` modules, but note that they'll be immediately converted to floating-point numbers before the operation is performed, resulting in a possible loss of precision and accuracy. You'll also get back a regular floating-point number and not a :class:`Decimal`. ::
es: Los números en la clase :class:`Decimal` pueden ser usados con los módulos :mod:`math` y :mod:`cmath` pero es preciso aclarar que ellos serán inmediatamente convertidos a números de punto flotante antes de realizar la operación, resultando en una posible perdida de precisión y exactitud. También obtendrá un número de punto flotante y no una clase :class:`Decimal`:

source: :class:`Decimal` instances have a :meth:`sqrt` method that returns a :class:`Decimal`, but if you need other things such as trigonometric functions you'll have to implement them. ::
es: Las instancias de la clase :class:`Decimal` poseen un método :meth:`sqrt` que retorna una clase :class:`Decimal` pero si se necesita otro tipo de cosas como funciones trigonométricas se tendrían que implementar:

source: The :class:`Context` type
es: El tipo de clase :class:`Context`

source: Instances of the :class:`Context` class encapsulate several settings for decimal operations:
es: Las instancias de la :class:`Context` encapsulan varios ajustes para operaciones con decimales:

source: :attr:`prec` is the precision, the number of decimal places.
es: atributo :attr:`prec` es la precisión del número de decimales.

source: :attr:`rounding` specifies the rounding mode. The :mod:`decimal` module has constants for the various possibilities: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN`, and various others.
es: El atributo :attr:`rounding` especifica el modo de redondeo. El módulo :mod:`decimal` tiene constantes para varias posibilidades, :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN` y varias otras.

source: :attr:`traps` is a dictionary specifying what happens on encountering certain error conditions: either an exception is raised or a value is returned. Some examples of error conditions are division by zero, loss of precision, and overflow.
es: El atributo :attr:`traps` es un diccionario que especifica lo que sucede al encontrar ciertas condiciones de error: Ya sea una excepción lanzada o un valor es retornado. algunos ejemplos de errores son las divisiones por cero, perdida de precisión o desbordamiento.

source: There's a thread-local default context available by calling :func:`getcontext`; you can change the properties of this context to alter the default precision, rounding, or trap handling. The following example shows the effect of changing the precision of the default context::
es: Hay un contexto predeterminado local de subprocesos disponible llamando a la función :func:`getcontext`, se puede cambiar las propiedades de este contexto para alterar la precisión por defecto, redondear o manejar trampas. el siguiente ejemplo muestra el efecto de cambiar la precisión del contexto por defecto:

source: The default action for error conditions is selectable; the module can either return a special value such as infinity or not-a-number, or exceptions can be raised::
es: Las acciones por defecto para condiciones de error se puede seleccionar, ya sea que el módulo pueda retornar un valor especial como un infinito o un valor no numérico NaN o se pueden lanzar excepciones:

source: The :class:`Context` instance also has various methods for formatting numbers such as :meth:`to_eng_string` and :meth:`to_sci_string`.
es: La instancia de la clase :class:`Context` también tiene varios métodos para formatear números tales como :meth:`to_eng_string` y :meth:`to_sci_string`.

source: For more information, see the documentation for the :mod:`decimal` module, which includes a quick-start tutorial and a reference.
es: Para mas información, revisar la documentación para el módulo :mod:`decimal` el cual incluye un tutoría de inicio rápido y una referencia.

source: :pep:`327` - Decimal Data Type
es: :pep:`327` - Tipo de dato decimal

source: Written by Facundo Batista and implemented by Facundo Batista, Eric Price, Raymond Hettinger, Aahz, and Tim Peters.
es: Escrito por Facundo Batista e implementado por Facundo Batista, Eric Price, Raymond Hettinger, Aahz y Tim Peters.

source: The article uses Fortran code to illustrate many of the problems that floating-point inaccuracy can cause.
es: El articulo usa código Fortran para ilustrar varios de los problemas que la inexactitud de los puntos flotantes pueden causar.

source: A description of a decimal-based representation. This representation is being proposed as a standard, and underlies the new Python decimal type. Much of this material was written by Mike Cowlishaw, designer of the Rexx language.
es: Una descripción de una representación basada en decimales. Esta representación ha sido propuesta como un estándar y subyace al nuevo tipo de dato decimal en Python. La mayor parte de este material fue escrita por Mike Cowlishaw, diseñador del lenguaje Rexx.

source: PEP 328: Multi-line Imports
es: PEP 328: Importaciones multilínea

source: One language change is a small syntactic tweak aimed at making it easier to import many names from a module. In a ``from module import names`` statement, *names* is a sequence of names separated by commas. If the sequence is very long, you can either write multiple imports from the same module, or you can use backslashes to escape the line endings like this::
es: Un pequeño cambio en el lenguaje ha sido una modificación a una sintaxis confusa que ha sido cambiada para hacer mas fácil el agregar varios nombres en un módulo. En una declaración ``from module import names``, *names* es una secuencia de nombres separados por comas. Si la sentencia es muy larga, se puede ya sea escribir múltiples sentencias import desde el mismo módulo o se pueden usar barras invertidas para escapar de los términos de línea como esto:

source: The syntactic change in Python 2.4 simply allows putting the names within parentheses. Python ignores newlines within a parenthesized expression, so the backslashes are no longer needed::
es: La sintaxis cambió en Python 2.4 y es simplemente el permitir poner los nombres dentro de paréntesis. Python ignora nuevas líneas dentro de una expresión entre paréntesis por lo que las barras invertidas ya no se necesitan:

source: The PEP also proposes that all :keyword:`import` statements be absolute imports, with a leading ``.`` character to indicate a relative import. This part of the PEP was not implemented for Python 2.4, but was completed for Python 2.5.
es: La convención de estilo también propone que todas las declaraciones usando :keyword:`import` son importaciones absolutas, con el siguiente carácter ``.`` indica una importación relativa. Esta parte de la convención de estilo no fue implementada para Python 2.4 pero fue completada para la versión 2.5.

source: :pep:`328` - Imports: Multi-Line and Absolute/Relative
es: :pep:`328` - Importaciones multi línea y absolutas/relativas

source: Written by Aahz. Multi-line imports were implemented by Dima Dorfman.
es: Escrita por Aahz. Importaciones multi línea fueron implementadas por Dima Dorfman.

source: PEP 331: Locale-Independent Float/String Conversions
es: PEP 331: Conversiones locales-independientes números flotantes/cadenas de texto

source: The :mod:`locale` modules lets Python software select various conversions and display conventions that are localized to a particular country or language. However, the module was careful to not change the numeric locale because various functions in Python's implementation required that the numeric locale remain set to the ``'C'`` locale. Often this was because the code was using the C library's :c:func:`atof` function.
es: Los módulos :mod:`locale` deja que el software de Python seleccione varias conversiones y despliegue convenciones que están localizadas en un país particular o lenguaje. Sin embargo, el módulo es cuidadoso en no cambiar el local numérico porque la implementación de Python requería que la configuración regional numérica permaneciera establecida en la configuración regional ``'C'`` . A menudo, esto se debía a que el código utilizaba la función :c:func:`atof` de la biblioteca C.

source: Not setting the numeric locale caused trouble for extensions that used third-party C libraries, however, because they wouldn't have the correct locale set. The motivating example was GTK+, whose user interface widgets weren't displaying numbers in the current locale.
es: No configurar la configuración regional numérica causaba problemas para las extensiones que usaban librerías externas de C, sin embargo, porque no configuraban la correcta configuración. El ejemplo mas patente fue GTK+, cuya interfaz de usuario no mostraba números en la ubicación actual.

source: The solution described in the PEP is to add three new functions to the Python API that perform ASCII-only conversions, ignoring the locale setting:
es: La solución descrita en la convención de estilo es añadir tres nuevas funciones a la API de python que ejecuta solo conversiones a ASCII, ignorando las configuraciones locales:

source: ``PyOS_ascii_strtod(str, ptr)`` and ``PyOS_ascii_atof(str, ptr)`` both convert a string to a C :c:expr:`double`.
es: ``PyOS_ascii_strtod(str, ptr)`` y ``PyOS_ascii_atof(str, ptr)`` convierten una cadena en C :c:expr:`double`.
