Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: Also, the :mod:`pstats` module for analyzing the data measured by the profiler now supports directing the output to any file object by supplying a *stream* argument to the :class:`Stats` constructor. (Contributed by Skip Montanaro.)
es: Además, el módulo :mod:`pstats` para analizar los datos medidos por el perfilador ahora soporta dirigir la salida a cualquier objeto archivo suministrando un argumento *stream* al constructor :class:`Stats`. (Contribución de Skip Montanaro)

source: The :mod:`csv` module, which parses files in comma-separated value format, received several enhancements and a number of bugfixes. You can now set the maximum size in bytes of a field by calling the ``csv.field_size_limit(new_limit)`` function; omitting the *new_limit* argument will return the currently set limit. The :class:`reader` class now has a :attr:`line_num` attribute that counts the number of physical lines read from the source; records can span multiple physical lines, so :attr:`line_num` is not the same as the number of records read.
es: El módulo :mod:`csv`, que analiza archivos en formato de valores separados por comas, recibió varias mejoras y varias correcciones de errores. Ahora puede establecer el tamaño máximo en bytes de un campo llamando a la función ``csv.field_size_limit(new_limit)``; omitir el argumento *new_limit* devolverá el límite establecido actualmente. La clase :class:`reader` ahora tiene un atributo :attr:`line_num` que cuenta la cantidad de líneas físicas leídas de la fuente; los registros pueden abarcar varias líneas físicas, por lo que :attr:`line_num` no es lo mismo que el número de registros leídos.

source: The CSV parser is now stricter about multi-line quoted fields. Previously, if a line ended within a quoted field without a terminating newline character, a newline would be inserted into the returned field. This behavior caused problems when reading files that contained carriage return characters within fields, so the code was changed to return the field without inserting newlines. As a consequence, if newlines embedded within fields are important, the input should be split into lines in a manner that preserves the newline characters.
es: El analizador CSV es ahora más estricto con los campos entrecomillados de varias líneas. Anteriormente, si una línea terminaba dentro de un campo entre comillas sin un carácter de nueva línea final, se insertaba una nueva línea en el campo devuelto. Este comportamiento causaba problemas cuando se leían archivos que contenían caracteres de retorno de carro dentro de los campos, por lo que se cambió el código para devolver el campo sin insertar nuevas líneas. Como consecuencia, si las nuevas líneas incrustadas dentro de los campos son importantes, la entrada debe dividirse en líneas de manera que se conserven los caracteres de nueva línea.

source: (Contributed by Skip Montanaro and Andrew McNamara.)
es: (Contribución de Skip Montanaro y Andrew McNamara)

source: The :class:`~datetime.datetime` class in the :mod:`datetime` module now has a ``strptime(string, format)`` method for parsing date strings, contributed by Josh Spoerri. It uses the same format characters as :func:`time.strptime` and :func:`time.strftime`::
es: La clase :class:`~datetime.datetime` del módulo :mod:`datetime` tiene ahora un método ``strptime(string, format)`` para analizar cadenas de fechas, aportado por Josh Spoerri. Utiliza los mismos caracteres de formato que :func:`time.strptime` y :func:`time.strftime`::

source: The :meth:`SequenceMatcher.get_matching_blocks` method in the :mod:`difflib` module now guarantees to return a minimal list of blocks describing matching subsequences. Previously, the algorithm would occasionally break a block of matching elements into two list entries. (Enhancement by Tim Peters.)
es: El método :meth:`SequenceMatcher.get_matching_blocks` del módulo :mod:`difflib` garantiza ahora la devolución de una lista mínima de bloques que describen subsecuencias coincidentes. Anteriormente, el algoritmo rompía ocasionalmente un bloque de elementos coincidentes en dos entradas de la lista. (Mejora realizada por Tim Peters)

source: The :mod:`doctest` module gained a ``SKIP`` option that keeps an example from being executed at all. This is intended for code snippets that are usage examples intended for the reader and aren't actually test cases.
es: El módulo :mod:`doctest` ha ganado una opción ``SKIP`` que impide que un ejemplo se ejecute en absoluto. Esto está pensado para los fragmentos de código que son ejemplos de uso destinados al lector y que no son realmente casos de prueba.

source: An *encoding* parameter was added to the :func:`testfile` function and the :class:`DocFileSuite` class to specify the file's encoding. This makes it easier to use non-ASCII characters in tests contained within a docstring. (Contributed by Bjorn Tillenius.)
es: Se ha añadido un parámetro *encoding* a la función :func:`testfile` y a la clase :class:`DocFileSuite` para especificar la codificación del archivo. Esto facilita el uso de caracteres no ASCII en las pruebas contenidas en un docstring. (Contribución de Bjorn Tillenius)

source: The :mod:`email` package has been updated to version 4.0. (Contributed by Barry Warsaw.)
es: El paquete :mod:`email` ha sido actualizado a la versión 4.0. (Contribución de Barry Warsaw.)

source: The :mod:`fileinput` module was made more flexible. Unicode filenames are now supported, and a *mode* parameter that defaults to ``"r"`` was added to the :func:`input` function to allow opening files in binary or :term:`universal newlines` mode. Another new parameter, *openhook*, lets you use a function other than :func:`open` to open the input files. Once you're iterating over the set of files, the :class:`FileInput` object's new :meth:`fileno` returns the file descriptor for the currently opened file. (Contributed by Georg Brandl.)
es: El módulo :mod:`fileinput` se ha hecho más flexible. Ahora se soportan los nombres de archivo Unicode, y se ha añadido un parámetro *mode* que por defecto es ``"r"`` a la función :func:`input` para permitir la apertura de archivos en modo binario o :term:`universal newlines`. Otro nuevo parámetro, *openhook*, permite utilizar una función distinta de :func:`open` para abrir los ficheros de entrada. Una vez que se itera sobre el conjunto de archivos, el nuevo :meth:`fileno` del objeto :class:`FileInput` devuelve el descriptor de archivo del archivo actualmente abierto. (Contribuido por Georg Brandl.)

source: In the :mod:`gc` module, the new :func:`get_count` function returns a 3-tuple containing the current collection counts for the three GC generations. This is accounting information for the garbage collector; when these counts reach a specified threshold, a garbage collection sweep will be made. The existing :func:`gc.collect` function now takes an optional *generation* argument of 0, 1, or 2 to specify which generation to collect. (Contributed by Barry Warsaw.)
es: En el módulo :mod:`gc`, la nueva función :func:`get_count` devuelve una 3-tupla que contiene los recuentos de recolección actuales para las tres generaciones de GC. Se trata de información contable para el recolector de basura; cuando estos recuentos alcanzan un umbral especificado, se realiza un barrido de recolección de basura. La función :func:`gc.collect` existente ahora toma un argumento opcional *generación* de 0, 1 o 2 para especificar qué generación recoger. (Contribución de Barry Warsaw)

source: The :func:`nsmallest` and :func:`nlargest` functions in the :mod:`heapq` module now support a ``key`` keyword parameter similar to the one provided by the :func:`min`/:func:`max` functions and the :meth:`sort` methods. For example::
es: Las funciones :func:`nsmallest` y :func:`nlargest` del módulo :mod:`heapq` soportan ahora un parámetro de palabra clave ``key`` similar al proporcionado por las funciones :func:`min`/:func:`max` y los métodos :meth:`sort`. Por ejemplo::

source: (Contributed by Raymond Hettinger.)
es: (Contribución de Raymond Hettinger.)

source: The :func:`itertools.islice` function now accepts ``None`` for the start and step arguments. This makes it more compatible with the attributes of slice objects, so that you can now write the following::
es: La función :func:`itertools.islice` ahora acepta ``None`` para los argumentos de inicio y paso. Esto la hace más compatible con los atributos de los objetos slice, por lo que ahora se puede escribir lo siguiente::

source: The :func:`format` function in the :mod:`locale` module has been modified and two new functions were added, :func:`format_string` and :func:`currency`.
es: Se ha modificado la función :func:`format` del módulo :mod:`locale` y se han añadido dos nuevas funciones, :func:`format_string` y :func:`currency`.

source: The :func:`format` function's *val* parameter could previously be a string as long as no more than one %char specifier appeared; now the parameter must be exactly one %char specifier with no surrounding text. An optional *monetary* parameter was also added which, if ``True``, will use the locale's rules for formatting currency in placing a separator between groups of three digits.
es: El parámetro *val* de la función :func:`format` podía ser antes una cadena siempre que no apareciera más de un especificador %char; ahora el parámetro debe ser exactamente un especificador %char sin texto alrededor. También se ha añadido un parámetro opcional *monetario* que, si es ``Verdadero``, utilizará las reglas de la configuración regional para formatear la moneda al colocar un separador entre grupos de tres dígitos.

source: To format strings with multiple %char specifiers, use the new :func:`format_string` function that works like :func:`format` but also supports mixing %char specifiers with arbitrary text.
es: Para formatear cadenas con múltiples especificadores %char, utilice la nueva función :func:`format_string` que funciona como :func:`format` pero que también permite mezclar especificadores %char con texto arbitrario.

source: A new :func:`currency` function was also added that formats a number according to the current locale's settings.
es: También se ha añadido una nueva función :func:`currency` que formatea un número de acuerdo con la configuración local actual.

source: (Contributed by Georg Brandl.)
es: (Contribución de Georg Brandl.)

source: The :mod:`mailbox` module underwent a massive rewrite to add the capability to modify mailboxes in addition to reading them. A new set of classes that include :class:`mbox`, :class:`MH`, and :class:`Maildir` are used to read mailboxes, and have an ``add(message)`` method to add messages, ``remove(key)`` to remove messages, and :meth:`lock`/:meth:`unlock` to lock/unlock the mailbox. The following example converts a maildir-format mailbox into an mbox-format one::
es: El módulo :mod:`mailbox` ha sido reestructurado de forma masiva para añadir la capacidad de modificar los buzones además de leerlos. Un nuevo conjunto de clases que incluyen :class:`mbox`, :class:`MH`, y :class:`Maildir` se utilizan para leer buzones, y tienen un método ``add(message)`` para añadir mensajes, ``remove(key)`` para eliminar mensajes, y :meth:`lock`/:meth:`unlock` para bloquear/desbloquear el buzón. El siguiente ejemplo convierte un buzón con formato maildir en uno con formato mbox::

source: (Contributed by Gregory K. Johnson. Funding was provided by Google's 2005 Summer of Code.)
es: (Contribución de Gregory K. Johnson. La financiación fue proporcionada por el Summer of Code 2005 de Google)

source: New module: the :mod:`msilib` module allows creating Microsoft Installer :file:`.msi` files and CAB files. Some support for reading the :file:`.msi` database is also included. (Contributed by Martin von Löwis.)
es: Nuevo módulo: el módulo :mod:`msilib` permite crear archivos :file:`.msi` de Microsoft Installer y archivos CAB. También se incluye soporte para la lectura de la base de datos :file:`.msi`. (Contribución de Martin von Löwis)

source: The :mod:`nis` module now supports accessing domains other than the system default domain by supplying a *domain* argument to the :func:`nis.match` and :func:`nis.maps` functions. (Contributed by Ben Bell.)
es: El módulo :mod:`nis` soporta ahora el acceso a dominios distintos del dominio por defecto del sistema proporcionando un argumento *dominio* a las funciones :func:`nis.match` y :func:`nis.maps`. (Contribución de Ben Bell)

source: The :mod:`operator` module's :func:`itemgetter` and :func:`attrgetter` functions now support multiple fields. A call such as ``operator.attrgetter('a', 'b')`` will return a function that retrieves the :attr:`a` and :attr:`b` attributes. Combining this new feature with the :meth:`sort` method's ``key`` parameter lets you easily sort lists using multiple fields. (Contributed by Raymond Hettinger.)
es: Las funciones :mod:`operator` del módulo :func:`itemgetter` y :func:`attrgetter` ahora soportan múltiples campos. Una llamada como ``operator.attrgetter('a', 'b')`` devolverá una función que recupera los atributos :attr:`a` y :attr:`b`. La combinación de esta nueva función con el parámetro ``key`` del método :meth:`sort` permite ordenar fácilmente las listas utilizando varios campos. (Contribución de Raymond Hettinger)

source: The :mod:`optparse` module was updated to version 1.5.1 of the Optik library. The :class:`OptionParser` class gained an :attr:`epilog` attribute, a string that will be printed after the help message, and a :meth:`destroy` method to break reference cycles created by the object. (Contributed by Greg Ward.)
es: El módulo :mod:`optparse` se ha actualizado a la versión 1.5.1 de la biblioteca Optik. La clase :class:`OptionParser` obtuvo un atributo :attr:`epilog`, una cadena que se imprimirá después del mensaje de ayuda, y un método :meth:`destroy` para romper los ciclos de referencia creados por el objeto. (Contribuido por Greg Ward.)

source: The :mod:`os` module underwent several changes. The :attr:`stat_float_times` variable now defaults to true, meaning that :func:`os.stat` will now return time values as floats. (This doesn't necessarily mean that :func:`os.stat` will return times that are precise to fractions of a second; not all systems support such precision.)
es: El módulo :mod:`os` ha sufrido varios cambios. La variable :attr:`stat_float_times` ahora está predeterminada a true, lo que significa que :func:`os.stat` ahora devolverá los valores de tiempo como flotantes. (Esto no significa necesariamente que :func:`os.stat` devolverá tiempos con una precisión de fracciones de segundo; no todos los sistemas soportan dicha precisión)

source: Constants named :const:`os.SEEK_SET`, :const:`os.SEEK_CUR`, and :const:`os.SEEK_END` have been added; these are the parameters to the :func:`os.lseek` function. Two new constants for locking are :const:`os.O_SHLOCK` and :const:`os.O_EXLOCK`.
es: Se han añadido las constantes :const:`os.SEEK_SET`, :const:`os.SEEK_CUR` y :const:`os.SEEK_END`, que son los parámetros de la función :func:`os.lseek`. Dos nuevas constantes para el bloqueo son :const:`os.O_SHLOCK` y :const:`os.O_EXLOCK`.

source: Two new functions, :func:`wait3` and :func:`wait4`, were added. They're similar the :func:`waitpid` function which waits for a child process to exit and returns a tuple of the process ID and its exit status, but :func:`wait3` and :func:`wait4` return additional information. :func:`wait3` doesn't take a process ID as input, so it waits for any child process to exit and returns a 3-tuple of *process-id*, *exit-status*, *resource-usage* as returned from the :func:`resource.getrusage` function. ``wait4(pid)`` does take a process ID. (Contributed by Chad J. Schroeder.)
es: Se han añadido dos nuevas funciones, :func:`wait3` y :func:`wait4`. Son similares a la función :func:`waitpid` que espera la salida de un proceso hijo y devuelve una tupla con el ID del proceso y su estado de salida, pero :func:`wait3` y :func:`wait4` devuelven información adicional. :func:`wait3` no toma un ID de proceso como entrada, por lo que espera a que cualquier proceso hijo salga y devuelve una tupla de *id de proceso*, *estado de salida*, *uso de recursos* tal y como se devuelve desde la función :func:`resource.getrusage`. ``wait4(pid)`` toma un ID de proceso. (Contribuido por Chad J. Schroeder.)

source: On FreeBSD, the :func:`os.stat` function now returns times with nanosecond resolution, and the returned object now has :attr:`st_gen` and :attr:`st_birthtime`. The :attr:`st_flags` attribute is also available, if the platform supports it. (Contributed by Antti Louko and Diego Pettenò.)
es: En FreeBSD, la función :func:`os.stat` devuelve ahora tiempos con resolución de nanosegundos, y el objeto devuelto tiene ahora :attr:`st_gen` y :attr:`st_birthtime`. El atributo :attr:`st_flags` también está disponible, si la plataforma lo soporta. (Contribución de Antti Louko y Diego Pettenò)

source: The Python debugger provided by the :mod:`pdb` module can now store lists of commands to execute when a breakpoint is reached and execution stops. Once breakpoint #1 has been created, enter ``commands 1`` and enter a series of commands to be executed, finishing the list with ``end``. The command list can include commands that resume execution, such as ``continue`` or ``next``. (Contributed by Grégoire Dooms.)
es: El depurador de Python proporcionado por el módulo :mod:`pdb` puede ahora almacenar listas de comandos a ejecutar cuando se alcanza un punto de ruptura y se detiene la ejecución. Una vez creado el punto de interrupción nº 1, introduzca ``comandos 1`` e introduzca una serie de comandos a ejecutar, terminando la lista con ``end``. La lista de comandos puede incluir comandos que reanuden la ejecución, como ``continue`` o ``next``. (Contribución de Grégoire Dooms.)

source: The :mod:`pickle` and :mod:`cPickle` modules no longer accept a return value of ``None`` from the :meth:`__reduce__` method; the method must return a tuple of arguments instead. The ability to return ``None`` was deprecated in Python 2.4, so this completes the removal of the feature.
es: Los módulos :mod:`pickle` y :mod:`cPickle` ya no aceptan un valor de retorno de ``None`` del método :meth:`__reduce__`; el método debe devolver una tupla de argumentos. La capacidad de devolver ``None`` fue obsoleta en Python 2.4, así que esto completa la eliminación de la función.

source: The :mod:`pkgutil` module, containing various utility functions for finding packages, was enhanced to support :pep:`302`'s import hooks and now also works for packages stored in ZIP-format archives. (Contributed by Phillip J. Eby.)
es: El módulo :mod:`pkgutil`, que contiene varias funciones de utilidad para encontrar paquetes, fue mejorado para soportar los ganchos de importación de :pep:`302` y ahora también funciona para paquetes almacenados en archivos con formato ZIP. (Contribución de Phillip J. Eby)

source: The pybench benchmark suite by Marc-André Lemburg is now included in the :file:`Tools/pybench` directory. The pybench suite is an improvement on the commonly used :file:`pystone.py` program because pybench provides a more detailed measurement of the interpreter's speed. It times particular operations such as function calls, tuple slicing, method lookups, and numeric operations, instead of performing many different operations and reducing the result to a single number as :file:`pystone.py` does.
es: El conjunto de pruebas pybench de Marc-André Lemburg se incluye ahora en el directorio :file:`Tools/pybench`. El conjunto de pruebas pybench es una mejora del programa :file:`pystone.py` de uso común, ya que pybench proporciona una medición más detallada de la velocidad del intérprete. Calcula el tiempo de determinadas operaciones como las llamadas a funciones, el corte de tuplas, las búsquedas de métodos y las operaciones numéricas, en lugar de realizar muchas operaciones diferentes y reducir el resultado a un único número como hace :file:`pystone.py`.

source: The :mod:`pyexpat` module now uses version 2.0 of the Expat parser. (Contributed by Trent Mick.)
es: El módulo :mod:`pyexpat` utiliza ahora la versión 2.0 del analizador sintáctico Expat. (Contribución de Trent Mick)

source: The :class:`~queue.Queue` class provided by the :mod:`Queue` module gained two new methods. :meth:`join` blocks until all items in the queue have been retrieved and all processing work on the items have been completed. Worker threads call the other new method, :meth:`task_done`, to signal that processing for an item has been completed. (Contributed by Raymond Hettinger.)
es: La clase :class:`~queue.Queue` proporcionada por el módulo :mod:`Queue` ha ganado dos nuevos métodos. :meth:`join` bloquea hasta que todos los elementos de la cola han sido recuperados y todo el trabajo de procesamiento de los elementos ha sido completado. Los hilos de trabajo llaman al otro método nuevo, :meth:`task_done`, para indicar que el procesamiento de un elemento ha finalizado. (Contribución de Raymond Hettinger)

source: The old :mod:`regex` and :mod:`regsub` modules, which have been deprecated ever since Python 2.0, have finally been deleted. Other deleted modules: :mod:`statcache`, :mod:`tzparse`, :mod:`whrandom`.
es: Los antiguos módulos :mod:`regex` y :mod:`regsub`, obsoletos desde Python 2.0, han sido finalmente eliminados. Otros módulos eliminados: :mod:`statcache`, :mod:`tzparse`, :mod:`whrandom`.

source: Also deleted: the :file:`lib-old` directory, which includes ancient modules such as :mod:`dircmp` and :mod:`ni`, was removed. :file:`lib-old` wasn't on the default ``sys.path``, so unless your programs explicitly added the directory to ``sys.path``, this removal shouldn't affect your code.
es: También se ha eliminado el directorio :file:`lib-old`, que incluye módulos antiguos como :mod:`dircmp` y :mod:`ni`. :file:`lib-old` no estaba en el directorio por defecto ``sys.path``, así que a menos que tus programas añadan explícitamente el directorio a ``sys.path``, esta eliminación no debería afectar a tu código.

source: The :mod:`rlcompleter` module is no longer dependent on importing the :mod:`readline` module and therefore now works on non-Unix platforms. (Patch from Robert Kiendl.)
es: El módulo :mod:`rlcompleter` ya no depende de la importación del módulo :mod:`readline` y, por lo tanto, ahora funciona en plataformas no Unix. (Parche de Robert Kiendl.)

source: The :mod:`SimpleXMLRPCServer` and :mod:`DocXMLRPCServer` classes now have a :attr:`rpc_paths` attribute that constrains XML-RPC operations to a limited set of URL paths; the default is to allow only ``'/'`` and ``'/RPC2'``. Setting :attr:`rpc_paths` to ``None`` or an empty tuple disables this path checking.
es: Las clases :mod:`SimpleXMLRPCServer` y :mod:`DocXMLRPCServer` tienen ahora un atributo :attr:`rpc_paths` que restringe las operaciones XML-RPC a un conjunto limitado de rutas URL; por defecto sólo se permiten ``'/'`` y ``'/RPC2'``. Establecer :attr:`rpc_paths` como ``None`` o una tupla vacía desactiva esta comprobación de rutas.
