Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: To generate XML output, you should call the :meth:`ElementTree.write` method. Like :func:`parse`, it can take either a string or a file-like object::
es: Para generar una salida XML, debes llamar al método :meth:`ElementTree.write`. Al igual que :func:`parse`, puede tomar una cadena o un objeto tipo archivo::

source: (Caution: the default encoding used for output is ASCII. For general XML work, where an element's name may contain arbitrary Unicode characters, ASCII isn't a very useful encoding because it will raise an exception if an element's name contains any characters with values greater than 127. Therefore, it's best to specify a different encoding such as UTF-8 that can handle any Unicode character.)
es: (Atención: la codificación por defecto utilizada para la salida es ASCII. Para el trabajo general de XML, donde el nombre de un elemento puede contener caracteres Unicode arbitrarios, ASCII no es una codificación muy útil porque lanzará una excepción si el nombre de un elemento contiene cualquier carácter con valores superiores a 127. Por lo tanto, es mejor especificar una codificación diferente, como UTF-8, que puede manejar cualquier carácter Unicode)

source: This section is only a partial description of the ElementTree interfaces. Please read the package's official documentation for more details.
es: Esta sección es sólo una descripción parcial de las interfaces de ElementTree. Por favor, lee la documentación oficial del paquete para más detalles.

source: Official documentation for ElementTree.
es: Documentación oficial de ElementTree.

source: The hashlib package
es: El paquete hashlib

source: A new :mod:`hashlib` module, written by Gregory P. Smith, has been added to replace the :mod:`md5` and :mod:`sha` modules. :mod:`hashlib` adds support for additional secure hashes (SHA-224, SHA-256, SHA-384, and SHA-512). When available, the module uses OpenSSL for fast platform optimized implementations of algorithms.
es: Se ha añadido un nuevo módulo :mod:`hashlib`, escrito por Gregory P. Smith, para sustituir a los módulos :mod:`md5` y :mod:`sha`. :mod:`hashlib` añade soporte para hashes seguros adicionales (SHA-224, SHA-256, SHA-384 y SHA-512). Cuando está disponible, el módulo utiliza OpenSSL para implementaciones rápidas de algoritmos optimizados para la plataforma.

source: The old :mod:`md5` and :mod:`sha` modules still exist as wrappers around hashlib to preserve backwards compatibility. The new module's interface is very close to that of the old modules, but not identical. The most significant difference is that the constructor functions for creating new hashing objects are named differently. ::
es: Los antiguos módulos :mod:`md5` y :mod:`sha` siguen existiendo como envoltorios de hashlib para preservar la compatibilidad hacia atrás. La interfaz del nuevo módulo es muy parecida a la de los módulos antiguos, pero no es idéntica. La diferencia más significativa es que las funciones constructoras para crear nuevos objetos hashing tienen un nombre diferente ::

source: Once a hash object has been created, its methods are the same as before: ``update(string)`` hashes the specified string into the current digest state, :meth:`digest` and :meth:`hexdigest` return the digest value as a binary string or a string of hex digits, and :meth:`copy` returns a new hashing object with the same digest state.
es: Una vez que se ha creado un objeto hash, sus métodos son los mismos que antes: ``actualizar(cadena)`` convierte la cadena especificada en el estado de resumen actual, :meth:`digest` y :meth:`hexdigest` devuelven el valor de resumen como una cadena binaria o una cadena de dígitos hexadecimales, y :meth:`copiar` devuelve un nuevo objeto hash con el mismo estado de resumen.

source: The documentation for the :mod:`hashlib` module.
es: La documentación del módulo :mod:`hashlib`.

source: The sqlite3 package
es: El paquete sqlite3

source: The pysqlite module (https://www.pysqlite.org), a wrapper for the SQLite embedded database, has been added to the standard library under the package name :mod:`sqlite3`.
es: El módulo pysqlite (https://www.pysqlite.org), un envoltorio para la base de datos incrustada de SQLite, se agregó a la biblioteca estándar con el nombre de paquete :mod:`sqlite3`.

source: SQLite is a C library that provides a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It's also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.
es: SQLite es una biblioteca en C que proporciona una base de datos ligera basada en disco que no requiere un proceso de servidor independiente y permite acceder a la base de datos utilizando una variante no estándar del lenguaje de consulta SQL. Algunas aplicaciones pueden utilizar SQLite para el almacenamiento interno de datos. También es posible crear un prototipo de una aplicación utilizando SQLite y luego portar el código a una base de datos más grande como PostgreSQL u Oracle.

source: pysqlite was written by Gerhard Häring and provides a SQL interface compliant with the DB-API 2.0 specification described by :pep:`249`.
es: pysqlite fue escrito por Gerhard Häring y proporciona una interfaz SQL que cumple con la especificación DB-API 2.0 descrita por :pep:`249`.

source: If you're compiling the Python source yourself, note that the source tree doesn't include the SQLite code, only the wrapper module. You'll need to have the SQLite libraries and headers installed before compiling Python, and the build process will compile the module when the necessary headers are available.
es: Si estás compilando el código fuente de Python tú mismo, ten en cuenta que el árbol de código fuente no incluye el código de SQLite, sólo el módulo envolvente. Necesitarás tener las librerías y cabeceras de SQLite instaladas antes de compilar Python, y el proceso de construcción compilará el módulo cuando las cabeceras necesarias estén disponibles.

source: To use the module, you must first create a :class:`Connection` object that represents the database. Here the data will be stored in the :file:`/tmp/example` file::
es: Para utilizar el módulo, primero hay que crear un objeto :class:`Connection` que represente la base de datos. Aquí los datos se almacenarán en el archivo :file:`/tmp/example`::

source: You can also supply the special name ``:memory:`` to create a database in RAM.
es: También puede suministrar el nombre especial ``:memory:`` para crear una base de datos en la RAM.

source: Once you have a :class:`Connection`, you can create a :class:`Cursor` object and call its :meth:`execute` method to perform SQL commands::
es: Una vez que tengas una :class:`Connection`, puedes crear un objeto :class:`Cursor` y llamar a su método :meth:`execute` para realizar comandos SQL::

source: Usually your SQL operations will need to use values from Python variables. You shouldn't assemble your query using Python's string operations because doing so is insecure; it makes your program vulnerable to an SQL injection attack.
es: Normalmente tus operaciones SQL necesitarán usar valores de variables de Python. No deberías montar tu consulta usando las operaciones de cadena de Python porque hacerlo es inseguro; hace que tu programa sea vulnerable a un ataque de inyección SQL.

source: Instead, use the DB-API's parameter substitution. Put ``?`` as a placeholder wherever you want to use a value, and then provide a tuple of values as the second argument to the cursor's :meth:`execute` method. (Other database modules may use a different placeholder, such as ``%s`` or ``:1``.) For example::
es: En su lugar, utilice la sustitución de parámetros de la DB-API. Ponga ``?`` como marcador de posición donde quiera usar un valor, y luego proporcione una tupla de valores como segundo argumento al método :meth:`execute` del cursor. (Otros módulos de base de datos pueden utilizar un marcador de posición diferente, como ``%s`` o ``:1``) Por ejemplo::

source: To retrieve data after executing a SELECT statement, you can either treat the cursor as an iterator, call the cursor's :meth:`fetchone` method to retrieve a single matching row, or call :meth:`fetchall` to get a list of the matching rows.
es: Para recuperar datos después de ejecutar una sentencia SELECT, puede tratar el cursor como un iterador, llamar al método :meth:`fetchone` del cursor para recuperar una sola fila que coincida, o llamar a :meth:`fetchall` para obtener una lista de las filas que coincidan.

source: This example uses the iterator form::
es: Este ejemplo utiliza la forma del iterador::

source: For more information about the SQL dialect supported by SQLite, see https://www.sqlite.org.
es: Para más información sobre el dialecto SQL soportado por SQLite, consulte https://www.sqlite.org.

source: The pysqlite web page.
es: La página web de pysqlite.

source: The SQLite web page; the documentation describes the syntax and the available data types for the supported SQL dialect.
es: La página web de SQLite; la documentación describe la sintaxis y los tipos de datos disponibles para el dialecto SQL soportado.

source: The documentation for the :mod:`sqlite3` module.
es: La documentación del módulo :mod:`sqlite3`.

source: :pep:`249` - Database API Specification 2.0
es: :pep:`249` - Especificación de la API de la base de datos 2.0

source: PEP written by Marc-André Lemburg.
es: PEP escrito por Marc-André Lemburg.

source: The wsgiref package
es: El paquete wsgiref

source: The Web Server Gateway Interface (WSGI) v1.0 defines a standard interface between web servers and Python web applications and is described in :pep:`333`. The :mod:`wsgiref` package is a reference implementation of the WSGI specification.
es: La Interfaz de Pasarela del Servidor Web (WSGI) v1.0 define una interfaz estándar entre los servidores web y las aplicaciones web de Python y se describe en :pep:`333`. El paquete :mod:`wsgiref` es una implementación de referencia de la especificación WSGI.

source: The package includes a basic HTTP server that will run a WSGI application; this server is useful for debugging but isn't intended for production use. Setting up a server takes only a few lines of code::
es: El paquete incluye un servidor HTTP básico que ejecutará una aplicación WSGI; este servidor es útil para la depuración pero no está pensado para su uso en producción. La configuración de un servidor sólo requiere unas pocas líneas de código::

source: A central web site for WSGI-related resources.
es: Un sitio web central para los recursos relacionados con WSGI.

source: :pep:`333` - Python Web Server Gateway Interface v1.0
es: :pep:`333` - Interfaz del servidor web Python v1.0

source: PEP written by Phillip J. Eby.
es: PEP escrito por Phillip J. Eby.

source: Build and C API Changes
es: Cambios en la API de construcción y C

source: Changes to Python's build process and to the C API include:
es: Los cambios en el proceso de construcción de Python y en la API de C incluyen:

source: The Python source tree was converted from CVS to Subversion, in a complex migration procedure that was supervised and flawlessly carried out by Martin von Löwis. The procedure was developed as :pep:`347`.
es: El árbol de fuentes de Python fue convertido de CVS a Subversion, en un complejo procedimiento de migración que fue supervisado y llevado a cabo de forma impecable por Martin von Löwis. El procedimiento se desarrolló como :pep:`347`.

source: Coverity, a company that markets a source code analysis tool called Prevent, provided the results of their examination of the Python source code. The analysis found about 60 bugs that were quickly fixed. Many of the bugs were refcounting problems, often occurring in error-handling code. See https://scan.coverity.com for the statistics.
es: Coverity, una empresa que comercializa una herramienta de análisis de código fuente llamada Prevent, proporcionó los resultados de su examen del código fuente de Python. El análisis encontró alrededor de 60 errores que fueron rápidamente corregidos. Muchos de los errores eran problemas de recuento, que a menudo se producen en el código de gestión de errores. Consulte las estadísticas en https://scan.coverity.com.

source: The largest change to the C API came from :pep:`353`, which modifies the interpreter to use a :c:type:`Py_ssize_t` type definition instead of :c:expr:`int`. See the earlier section :ref:`pep-353` for a discussion of this change.
es: El mayor cambio en la API de C provino de :pep:`353`, que modifica el intérprete para usar una definición de tipo :c:type:`Py_ssize_t` en lugar de :c:expr:`int`. Consulte la sección anterior :ref:`pep-353` para obtener una explicación de este cambio.

source: The design of the bytecode compiler has changed a great deal, no longer generating bytecode by traversing the parse tree. Instead the parse tree is converted to an abstract syntax tree (or AST), and it is the abstract syntax tree that's traversed to produce the bytecode.
es: El diseño del compilador de código de bytes ha cambiado mucho, ya no genera código de bytes recorriendo el árbol de análisis sintáctico. En su lugar, el árbol de análisis se convierte en un árbol de sintaxis abstracta (o AST), y es el árbol de sintaxis abstracta el que se recorre para producir el código de bytes.

source: It's possible for Python code to obtain AST objects by using the :func:`compile` built-in and specifying ``_ast.PyCF_ONLY_AST`` as the value of the *flags* parameter::
es: Es posible que el código Python obtenga objetos AST utilizando el built-in :func:`compile` y especificando ``_ast.PyCF_ONLY_AST`` como valor del parámetro *flags*::

source: No official documentation has been written for the AST code yet, but :pep:`339` discusses the design. To start learning about the code, read the definition of the various AST nodes in :file:`Parser/Python.asdl`. A Python script reads this file and generates a set of C structure definitions in :file:`Include/Python-ast.h`. The :c:func:`PyParser_ASTFromString` and :c:func:`!PyParser_ASTFromFile`, defined in :file:`Include/pythonrun.h`, take Python source as input and return the root of an AST representing the contents. This AST can then be turned into a code object by :c:func:`!PyAST_Compile`. For more information, read the source code, and then ask questions on python-dev.
es: Todavía no se ha escrito ninguna documentación oficial para el código AST, pero :pep:`339` discute el diseño. Para empezar a conocer el código, lea la definición de los distintos nodos AST en :file:`Parser/Python.asdl`. Un script de Python lee este archivo y genera un conjunto de definiciones de estructuras C en :file:`Include/Python-ast.h`. Las funciones :c:func:`PyParser_ASTFromString` y :c:func:`!PyParser_ASTFromFile`, definidas en :file:`Include/pythonrun.h`, toman el código fuente de Python como entrada y devuelven la raíz de un AST que representa el contenido. Este AST puede convertirse en un objeto de código mediante :c:func:`!PyAST_Compile`. Para más información, lea el código fuente, y luego haga preguntas en python-dev.

source: The AST code was developed under Jeremy Hylton's management, and implemented by (in alphabetical order) Brett Cannon, Nick Coghlan, Grant Edwards, John Ehresman, Kurt Kaiser, Neal Norwitz, Tim Peters, Armin Rigo, and Neil Schemenauer, plus the participants in a number of AST sprints at conferences such as PyCon.
es: El código de la AST fue desarrollado bajo la dirección de Jeremy Hylton, e implementado por (en orden alfabético) Brett Cannon, Nick Coghlan, Grant Edwards, John Ehresman, Kurt Kaiser, Neal Norwitz, Tim Peters, Armin Rigo y Neil Schemenauer, además de los participantes en varios sprints de la AST en conferencias como la PyCon.

source: Evan Jones's patch to obmalloc, first described in a talk at PyCon DC 2005, was applied. Python 2.4 allocated small objects in 256K-sized arenas, but never freed arenas. With this patch, Python will free arenas when they're empty. The net effect is that on some platforms, when you allocate many objects, Python's memory usage may actually drop when you delete them and the memory may be returned to the operating system. (Implemented by Evan Jones, and reworked by Tim Peters.)
es: Se aplicó el parche de Evan Jones a obmalloc, descrito por primera vez en una charla en la PyCon DC 2005. Python 2.4 asignaba objetos pequeños en arenas de 256K, pero nunca liberaba arenas. Con este parche, Python liberará arenas cuando estén vacías. El efecto neto es que en algunas plataformas, cuando se asignan muchos objetos, el uso de la memoria de Python puede realmente caer cuando se borran y la memoria puede ser devuelta al sistema operativo. (Implementado por Evan Jones, y reelaborado por Tim Peters)

source: Note that this change means extension modules must be more careful when allocating memory. Python's API has many different functions for allocating memory that are grouped into families. For example, :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc`, and :c:func:`PyMem_Free` are one family that allocates raw memory, while :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc`, and :c:func:`PyObject_Free` are another family that's supposed to be used for creating Python objects.
es: Tenga en cuenta que este cambio significa que los módulos de extensión deben ser más cuidadosos al asignar memoria. La API de Python tiene muchas funciones diferentes para asignar memoria que se agrupan en familias. Por ejemplo, :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc`, y :c:func:`PyMem_Free` son una familia que asigna memoria en bruto, mientras que :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc`, y :c:func:`PyObject_Free` son otra familia que se supone que se utiliza para crear objetos de Python.

source: Previously these different families all reduced to the platform's :c:func:`malloc` and :c:func:`free` functions. This meant it didn't matter if you got things wrong and allocated memory with the ``PyMem`` function but freed it with the ``PyObject`` function. With 2.5's changes to obmalloc, these families now do different things and mismatches will probably result in a segfault. You should carefully test your C extension modules with Python 2.5.
es: Anteriormente estas diferentes familias se reducían a las funciones :c:func:`malloc` y :c:func:`free` de la plataforma. Esto significaba que no importaba si te equivocabas y asignabas memoria con la función ``PyMem`` pero la liberabas con la función ``PyObject``. Con los cambios de la versión 2.5 en obmalloc, estas familias hacen ahora cosas diferentes y los desajustes probablemente darán lugar a un fallo de seguridad. Deberías probar cuidadosamente tus módulos de extensión C con Python 2.5.

source: The built-in set types now have an official C API. Call :c:func:`PySet_New` and :c:func:`PyFrozenSet_New` to create a new set, :c:func:`PySet_Add` and :c:func:`PySet_Discard` to add and remove elements, and :c:func:`PySet_Contains` and :c:func:`PySet_Size` to examine the set's state. (Contributed by Raymond Hettinger.)
es: Los tipos de conjuntos incorporados tienen ahora una API oficial en C. Llame a :c:func:`PySet_New` y :c:func:`PyFrozenSet_New` para crear un nuevo conjunto, :c:func:`PySet_Add` y :c:func:`PySet_Discard` para añadir y eliminar elementos, y :c:func:`PySet_Contains` y :c:func:`PySet_Size` para examinar el estado del conjunto. (Contribución de Raymond Hettinger)

source: C code can now obtain information about the exact revision of the Python interpreter by calling the :c:func:`Py_GetBuildInfo` function that returns a string of build information like this: ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contributed by Barry Warsaw.)
es: El código C puede ahora obtener información sobre la revisión exacta del intérprete de Python llamando a la función :c:func:`Py_GetBuildInfo` que devuelve una cadena de información de compilación como esta ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contribuido por Barry Warsaw.)

source: Two new macros can be used to indicate C functions that are local to the current file so that a faster calling convention can be used. ``Py_LOCAL(type)`` declares the function as returning a value of the specified *type* and uses a fast-calling qualifier. ``Py_LOCAL_INLINE(type)`` does the same thing and also requests the function be inlined. If macro :c:macro:`!PY_LOCAL_AGGRESSIVE` is defined before :file:`python.h` is included, a set of more aggressive optimizations are enabled for the module; you should benchmark the results to find out if these optimizations actually make the code faster. (Contributed by Fredrik Lundh at the NeedForSpeed sprint.)
es: Se pueden utilizar dos nuevas macros para indicar las funciones C que son locales al fichero actual, de modo que se pueda utilizar una convención de llamada más rápida. ``Py_LOCAL(type)`` declara que la función devuelve un valor del *tipo* especificado y utiliza un calificador de llamada rápida. ``Py_LOCAL_INLINE(type)`` hace lo mismo y también solicita que la función sea inline. Si :c:macro:`!PY_LOCAL_AGGRESSIVE` se define antes de que se incluya :file:`python.h`, se habilita un conjunto de optimizaciones más agresivas para el módulo; debería comparar los resultados para averiguar si estas optimizaciones realmente hacen el código más rápido. (Contribuido por Fredrik Lundh en el sprint NeedForSpeed)

source: ``PyErr_NewException(name, base, dict)`` can now accept a tuple of base classes as its *base* argument. (Contributed by Georg Brandl.)
es: ``PyErr_NewException(name, base, dict)`` ahora puede aceptar una tupla de clases base como su argumento *base*. (Contribuido por Georg Brandl.)

source: The :c:func:`!PyErr_Warn` function for issuing warnings is now deprecated in favour of ``PyErr_WarnEx(category, message, stacklevel)`` which lets you specify the number of stack frames separating this function and the caller. A *stacklevel* of 1 is the function calling :c:func:`PyErr_WarnEx`, 2 is the function above that, and so forth. (Added by Neal Norwitz.)
es: La función :c:func:`!PyErr_Warn` para emitir avisos está ahora obsoleta en favor de ``PyErr_WarnEx(category, message, stacklevel)`` que permite especificar el número de marcos de pila que separan esta función y la que la llama. Un *stacklevel* de 1 es la función que llama a :c:func:`PyErr_WarnEx`, 2 es la función que está por encima, y así sucesivamente. (Añadido por Neal Norwitz.)

source: The CPython interpreter is still written in C, but the code can now be compiled with a C++ compiler without errors. (Implemented by Anthony Baxter, Martin von Löwis, Skip Montanaro.)
es: El intérprete de CPython sigue estando escrito en C, pero el código ahora puede ser compilado con un compilador de C++ sin errores. (Implementado por Anthony Baxter, Martin von Löwis, Skip Montanaro)

source: The :c:func:`!PyRange_New` function was removed. It was never documented, never used in the core code, and had dangerously lax error checking. In the unlikely case that your extensions were using it, you can replace it by something like the following::
es: Se ha eliminado la función :c:func:`!PyRange_New`. Nunca se documentó, nunca se utilizó en el código del núcleo, y tenía una comprobación de errores peligrosamente laxa. En el improbable caso de que sus extensiones la utilizaran, puede sustituirla por algo como lo siguiente::

source: Port-Specific Changes
es: Cambios específicos en los puertos

source: MacOS X (10.3 and higher): dynamic loading of modules now uses the :c:func:`dlopen` function instead of MacOS-specific functions.
es: MacOS X (10.3 y superior): la carga dinámica de módulos utiliza ahora la función :c:func:`dlopen` en lugar de funciones específicas de MacOS.
