Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: The context manager's :meth:`__enter__` method is called. The value returned is assigned to *VAR*. If no ``'as VAR'`` clause is present, the value is simply discarded.
es: Se llama al método :meth:`__enter__` del gestor de contexto. El valor devuelto se asigna a *VAR*. Si no está presente la cláusula ``'as VAR'``, el valor simplemente se descarta.

source: The code in *BLOCK* is executed.
es: Se ejecuta el código en *BLOQUE*.

source: If *BLOCK* raises an exception, the ``__exit__(type, value, traceback)`` is called with the exception details, the same values returned by :func:`sys.exc_info`. The method's return value controls whether the exception is re-raised: any false value re-raises the exception, and ``True`` will result in suppressing it. You'll only rarely want to suppress the exception, because if you do the author of the code containing the ':keyword:`with`' statement will never realize anything went wrong.
es: Si *BLOCK* lanza una excepción, se llama a ``__exit__(type, value, traceback)`` con los detalles de la excepción, los mismos valores devueltos por :func:`sys.exc_info`. El valor de retorno del método controla si la excepción se vuelve a lanzar: cualquier valor falso vuelve a lanzar la excepción, y ``True`` resultará en suprimirla. Sólo en raras ocasiones querrá suprimir la excepción, porque si lo hace el autor del código que contiene la declaración ':keyword:`with`' nunca se dará cuenta de que algo ha ido mal.

source: If *BLOCK* didn't raise an exception, the :meth:`__exit__` method is still called, but *type*, *value*, and *traceback* are all ``None``.
es: Si *BLOCK* no lanzó una excepción, el método :meth:`__exit__` sigue siendo llamado, pero *type*, *value*, y *traceback* son todos ``None``.

source: Let's think through an example. I won't present detailed code but will only sketch the methods necessary for a database that supports transactions.
es: Pensemos en un ejemplo. No presentaré un código detallado, sino que sólo esbozaré los métodos necesarios para una base de datos que soporte transacciones.

source: (For people unfamiliar with database terminology: a set of changes to the database are grouped into a transaction. Transactions can be either committed, meaning that all the changes are written into the database, or rolled back, meaning that the changes are all discarded and the database is unchanged. See any database textbook for more information.)
es: (Para quienes no estén familiarizados con la terminología de las bases de datos: un conjunto de cambios en la base de datos se agrupa en una transacción. Las transacciones pueden ser confirmadas, lo que significa que todos los cambios se escriben en la base de datos, o revertidas, lo que significa que todos los cambios se descartan y la base de datos no se modifica. Consulte cualquier libro de texto sobre bases de datos para obtener más información)

source: Let's assume there's an object representing a database connection. Our goal will be to let the user write code like this::
es: Supongamos que hay un objeto que representa una conexión a la base de datos. Nuestro objetivo será permitir que el usuario escriba código como este::

source: The transaction should be committed if the code in the block runs flawlessly or rolled back if there's an exception. Here's the basic interface for :class:`DatabaseConnection` that I'll assume::
es: La transacción debe ser confirmada si el código en el bloque se ejecuta sin problemas o revertida si hay una excepción. Aquí está la interfaz básica para :class:`DatabaseConnection` que voy a asumir::

source: The :meth:`__enter__` method is pretty easy, having only to start a new transaction. For this application the resulting cursor object would be a useful result, so the method will return it. The user can then add ``as cursor`` to their ':keyword:`with`' statement to bind the cursor to a variable name. ::
es: El método :meth:`__enter__` es bastante sencillo, ya que sólo hay que iniciar una nueva transacción. Para esta aplicación el objeto cursor resultante sería un resultado útil, por lo que el método lo devolverá. El usuario puede entonces añadir ``as cursor`` a su sentencia ':keyword:`with`' para ligar el cursor a un nombre de variable. ::

source: The :meth:`__exit__` method is the most complicated because it's where most of the work has to be done. The method has to check if an exception occurred. If there was no exception, the transaction is committed. The transaction is rolled back if there was an exception.
es: El método :meth:`__exit__` es el más complicado porque es donde hay que hacer la mayor parte del trabajo. El método tiene que comprobar si se produjo una excepción. Si no hubo ninguna excepción, la transacción es confirmada. La transacción es revertida si hubo una excepción.

source: In the code below, execution will just fall off the end of the function, returning the default value of ``None``. ``None`` is false, so the exception will be re-raised automatically. If you wished, you could be more explicit and add a :keyword:`return` statement at the marked location. ::
es: En el código de abajo, la ejecución simplemente caerá al final de la función, devolviendo el valor por defecto de ``None``. ``None`` es falso, por lo que la excepción se volverá a lanzar automáticamente. Si lo desea, puede ser más explícito y añadir una declaración :keyword:`return` en el lugar marcado. ::

source: The contextlib module
es: El módulo contextlib

source: The new :mod:`contextlib` module provides some functions and a decorator that are useful for writing objects for use with the ':keyword:`with`' statement.
es: El nuevo módulo :mod:`contextlib` proporciona algunas funciones y un decorador que son útiles para escribir objetos para usar con la sentencia ':keyword:`with`'.

source: The decorator is called :func:`contextmanager`, and lets you write a single generator function instead of defining a new class. The generator should yield exactly one value. The code up to the :keyword:`yield` will be executed as the :meth:`__enter__` method, and the value yielded will be the method's return value that will get bound to the variable in the ':keyword:`with`' statement's :keyword:`!as` clause, if any. The code after the :keyword:`yield` will be executed in the :meth:`__exit__` method. Any exception raised in the block will be raised by the :keyword:`!yield` statement.
es: El decorador se llama :func:`contextmanager`, y permite escribir una única función generadora en lugar de definir una nueva clase. El generador debe producir exactamente un valor. El código hasta la palabra clave :keyword:`yield` se ejecutará como el método :meth:`__enter__`, y el valor producido será el valor de retorno del método que se vinculará a la variable en la cláusula :keyword:`with` de la sentencia :keyword:`!as`, si existe. El código después de :keyword:`yield` se ejecutará en el método :meth:`__exit__`. Cualquier excepción lanzada en el bloque será lanzada por la sentencia :keyword:`!yield`.

source: Our database example from the previous section could be written using this decorator as::
es: Nuestro ejemplo de base de datos de la sección anterior podría escribirse utilizando este decorador como::

source: The :mod:`contextlib` module also has a ``nested(mgr1, mgr2, ...)`` function that combines a number of context managers so you don't need to write nested ':keyword:`with`' statements. In this example, the single ':keyword:`!with`' statement both starts a database transaction and acquires a thread lock::
es: El módulo :mod:`contextlib` también tiene una función ``anidada(mgr1, mgr2, ...)`` que combina varios gestores de contexto para que no sea necesario escribir sentencias ':keyword:`with`' anidadas. En este ejemplo, la única sentencia ':keyword:`!with`` inicia una transacción de base de datos y adquiere un bloqueo de hilo::

source: Finally, the ``closing(object)`` function returns *object* so that it can be bound to a variable, and calls ``object.close`` at the end of the block. ::
es: Por último, la función ``closing(object)`` devuelve el *objeto* para que pueda ser vinculado a una variable, y llama a ``object.close`` al final del bloque. ::

source: :pep:`343` - The "with" statement
es: :pep:`343` - La declaración "con"

source: PEP written by Guido van Rossum and Nick Coghlan; implemented by Mike Bland, Guido van Rossum, and Neal Norwitz. The PEP shows the code generated for a ':keyword:`with`' statement, which can be helpful in learning how the statement works.
es: PEP escrito por Guido van Rossum y Nick Coghlan; implementado por Mike Bland, Guido van Rossum y Neal Norwitz. El PEP muestra el código generado para una sentencia ':keyword:`with`', que puede ser útil para aprender cómo funciona la sentencia.

source: The documentation for the :mod:`contextlib` module.
es: La documentación del módulo :mod:`contextlib`.

source: PEP 352: Exceptions as New-Style Classes
es: PEP 352: Las excepciones como clases de nuevo estilo

source: Exception classes can now be new-style classes, not just classic classes, and the built-in :exc:`Exception` class and all the standard built-in exceptions (:exc:`NameError`, :exc:`ValueError`, etc.) are now new-style classes.
es: Las clases de excepción ahora pueden ser clases de nuevo estilo, no sólo clases clásicas, y la clase incorporada :exc:`Exception` y todas las excepciones incorporadas estándar (:exc:`NameError`, :exc:`ValueError`, etc.) son ahora clases de nuevo estilo.

source: The inheritance hierarchy for exceptions has been rearranged a bit. In 2.5, the inheritance relationships are::
es: La jerarquía de herencia de las excepciones se ha reordenado un poco. En 2.5, las relaciones de herencia son::

source: This rearrangement was done because people often want to catch all exceptions that indicate program errors. :exc:`KeyboardInterrupt` and :exc:`SystemExit` aren't errors, though, and usually represent an explicit action such as the user hitting :kbd:`Control-C` or code calling :func:`sys.exit`. A bare ``except:`` will catch all exceptions, so you commonly need to list :exc:`KeyboardInterrupt` and :exc:`SystemExit` in order to re-raise them. The usual pattern is::
es: Esta reorganización se hizo porque la gente a menudo quiere atrapar todas las excepciones que indican errores del programa. :exc:`KeyboardInterrupt` y :exc:`SystemExit` no son errores, sin embargo, y por lo general representan una acción explícita como el usuario pulsando :kbd:`Control-C` o el código llamando a :func:`sys.exit`. Una simple ``except:`` atrapará todas las excepciones, por lo que comúnmente se necesita listar :exc:`KeyboardInterrupt` y :exc:`SystemExit` para volver a lanzarlas. El patrón habitual es::

source: In Python 2.5, you can now write ``except Exception`` to achieve the same result, catching all the exceptions that usually indicate errors but leaving :exc:`KeyboardInterrupt` and :exc:`SystemExit` alone. As in previous versions, a bare ``except:`` still catches all exceptions.
es: En Python 2.5, ahora puedes escribir ``except Exception`` para conseguir el mismo resultado, capturando todas las excepciones que suelen indicar errores pero dejando :exc:`KeyboardInterrupt` y :exc:`SystemExit` en paz. Como en versiones anteriores, un ``except:`` desnudo sigue capturando todas las excepciones.

source: The goal for Python 3.0 is to require any class raised as an exception to derive from :exc:`BaseException` or some descendant of :exc:`BaseException`, and future releases in the Python 2.x series may begin to enforce this constraint. Therefore, I suggest you begin making all your exception classes derive from :exc:`Exception` now. It's been suggested that the bare ``except:`` form should be removed in Python 3.0, but Guido van Rossum hasn't decided whether to do this or not.
es: El objetivo de Python 3.0 es requerir que cualquier clase lanzada como excepción derive de :exc:`BaseException` o de algún descendiente de :exc:`BaseException`, y las futuras versiones de la serie Python 2.x pueden empezar a imponer esta restricción. Por lo tanto, sugiero que empieces a hacer que todas tus clases de excepción deriven de :exc:`Exception` ahora. Se ha sugerido que la forma desnuda ``except:`` sea eliminada en Python 3.0, pero Guido van Rossum no ha decidido si hacerlo o no.

source: Raising of strings as exceptions, as in the statement ``raise "Error occurred"``, is deprecated in Python 2.5 and will trigger a warning. The aim is to be able to remove the string-exception feature in a few releases.
es: El lanzamiento de cadenas como excepciones, como en la declaración ``raise "Error occurred"``, está obsoleto en Python 2.5 y provocará una advertencia. El objetivo es poder eliminar la función de excepción de cadena en algunas versiones.

source: :pep:`352` - Required Superclass for Exceptions
es: :pep:`352` - Superclase necesaria para las excepciones

source: PEP written by Brett Cannon and Guido van Rossum; implemented by Brett Cannon.
es: PEP escrito por Brett Cannon y Guido van Rossum; implementado por Brett Cannon.

source: PEP 353: Using ssize_t as the index type
es: PEP 353: Uso de ssize_t como tipo de índice

source: A wide-ranging change to Python's C API, using a new :c:type:`Py_ssize_t` type definition instead of :c:expr:`int`, will permit the interpreter to handle more data on 64-bit platforms. This change doesn't affect Python's capacity on 32-bit platforms.
es: Un cambio de gran alcance en la API C de Python, que usa una nueva definición de tipo :c:type:`Py_ssize_t` en lugar de :c:expr:`int`, permitirá que el intérprete maneje más datos en plataformas de 64 bits. Este cambio no afecta la capacidad de Python en plataformas de 32 bits.

source: Various pieces of the Python interpreter used C's :c:expr:`int` type to store sizes or counts; for example, the number of items in a list or tuple were stored in an :c:expr:`int`. The C compilers for most 64-bit platforms still define :c:expr:`int` as a 32-bit type, so that meant that lists could only hold up to ``2**31 - 1`` = 2147483647 items. (There are actually a few different programming models that 64-bit C compilers can use -- see https://unix.org/version2/whatsnew/lp64_wp.html for a discussion -- but the most commonly available model leaves :c:expr:`int` as 32 bits.)
es: Varias piezas del intérprete de Python usaban el tipo :c:expr:`int` de C para almacenar tamaños o conteos; por ejemplo, la cantidad de elementos en una lista o tupla se almacenaron en un :c:expr:`int`. Los compiladores de C para la mayoría de las plataformas de 64 bits aún definen :c:expr:`int` como un tipo de 32 bits, lo que significa que las listas solo pueden contener hasta ``2**31 - 1`` = 2147483647 elementos. (En realidad, hay algunos modelos de programación diferentes que los compiladores de C de 64 bits pueden usar; consulte https://unix.org/version2/whatsnew/lp64_wp.html para ver una discusión, pero el modelo más comúnmente disponible deja :c:expr:`int` como 32 bits).

source: A limit of 2147483647 items doesn't really matter on a 32-bit platform because you'll run out of memory before hitting the length limit. Each list item requires space for a pointer, which is 4 bytes, plus space for a :c:type:`PyObject` representing the item. 2147483647\*4 is already more bytes than a 32-bit address space can contain.
es: Un límite de 2147483647 elementos no importa realmente en una plataforma de 32 bits porque te quedarás sin memoria antes de alcanzar el límite de longitud. Cada elemento de la lista requiere espacio para un puntero, que es de 4 bytes, más espacio para un :c:type:`PyObject` que representa el elemento. 2147483647*4 ya son más bytes de los que puede contener un espacio de direcciones de 32 bits.

source: It's possible to address that much memory on a 64-bit platform, however. The pointers for a list that size would only require 16 GiB of space, so it's not unreasonable that Python programmers might construct lists that large. Therefore, the Python interpreter had to be changed to use some type other than :c:expr:`int`, and this will be a 64-bit type on 64-bit platforms. The change will cause incompatibilities on 64-bit machines, so it was deemed worth making the transition now, while the number of 64-bit users is still relatively small. (In 5 or 10 years, we may *all* be on 64-bit machines, and the transition would be more painful then.)
es: Sin embargo, es posible abordar esa cantidad de memoria en una plataforma de 64 bits. Los punteros para una lista de ese tamaño solo requerirían 16 GiB de espacio, por lo que no es irrazonable que los programadores de Python puedan construir listas tan grandes. Por lo tanto, el intérprete de Python tuvo que cambiarse para usar algún tipo diferente a :c:expr:`int`, y este será un tipo de 64 bits en plataformas de 64 bits. El cambio provocará incompatibilidades en las máquinas de 64 bits, por lo que se consideró que valía la pena hacer la transición ahora, mientras que la cantidad de usuarios de 64 bits aún es relativamente pequeña. (En 5 o 10 años, es posible que *todo* esté en máquinas de 64 bits y la transición sería más dolorosa entonces).

source: This change most strongly affects authors of C extension modules. Python strings and container types such as lists and tuples now use :c:type:`Py_ssize_t` to store their size. Functions such as :c:func:`PyList_Size` now return :c:type:`Py_ssize_t`. Code in extension modules may therefore need to have some variables changed to :c:type:`Py_ssize_t`.
es: Este cambio afecta en mayor medida a los autores de módulos de extensión de C. Las cadenas de Python y los tipos contenedores como las listas y las tuplas utilizan ahora :c:type:`Py_ssize_t` para almacenar su tamaño. Funciones como :c:func:`PyList_Size` ahora devuelven :c:type:`Py_ssize_t`. Por lo tanto, el código de los módulos de extensión puede necesitar cambiar algunas variables a :c:type:`Py_ssize_t`.

source: The :c:func:`PyArg_ParseTuple` and :c:func:`Py_BuildValue` functions have a new conversion code, ``n``, for :c:type:`Py_ssize_t`. :c:func:`PyArg_ParseTuple`'s ``s#`` and ``t#`` still output :c:expr:`int` by default, but you can define the macro :c:macro:`PY_SSIZE_T_CLEAN` before including :file:`Python.h` to make them return :c:type:`Py_ssize_t`.
es: Las funciones :c:func:`PyArg_ParseTuple` y :c:func:`Py_BuildValue` tienen un nuevo código de conversión, ``n``, para :c:type:`Py_ssize_t`. ``s#`` y ``t#`` de :c:func:`PyArg_ParseTuple` aún generan :c:expr:`int` de forma predeterminada, pero puede definir la macro :c:macro:`PY_SSIZE_T_CLEAN` antes de incluir :file:`Python.h` para que devuelvan :c:type:`Py_ssize_t`.

source: :pep:`353` has a section on conversion guidelines that extension authors should read to learn about supporting 64-bit platforms.
es: :pep:`353` tiene una sección sobre directrices de conversión que los autores de extensiones deberían leer para aprender a soportar plataformas de 64 bits.

source: :pep:`353` - Using ssize_t as the index type
es: :pep:`353` - Uso de ssize_t como tipo de índice

source: PEP written and implemented by Martin von Löwis.
es: PEP escrito y aplicado por Martin von Löwis.

source: PEP 357: The '__index__' method
es: PEP 357: El método '__index__'

source: The NumPy developers had a problem that could only be solved by adding a new special method, :meth:`__index__`. When using slice notation, as in ``[start:stop:step]``, the values of the *start*, *stop*, and *step* indexes must all be either integers or long integers. NumPy defines a variety of specialized integer types corresponding to unsigned and signed integers of 8, 16, 32, and 64 bits, but there was no way to signal that these types could be used as slice indexes.
es: Los desarrolladores de NumPy tenían un problema que sólo podía resolverse añadiendo un nuevo método especial, :meth:`__index__`. Cuando se utiliza la notación de trozos, como en ``[start:stop:step]``, los valores de los índices *start*, *stop* y *step* deben ser todos enteros o enteros largos. NumPy define una variedad de tipos de enteros especializados que corresponden a enteros sin signo y con signo de 8, 16, 32 y 64 bits, pero no había forma de señalar que estos tipos pudieran usarse como índices de trozos.

source: Slicing can't just use the existing :meth:`__int__` method because that method is also used to implement coercion to integers. If slicing used :meth:`__int__`, floating-point numbers would also become legal slice indexes and that's clearly an undesirable behaviour.
es: El rebanado no puede utilizar el método :meth:`__int__` existente porque ese método también se utiliza para implementar la coerción a enteros. Si el rebanado utilizara :meth:`__int__`, los números de punto flotante también se convertirían en índices de rebanada legales y eso es claramente un comportamiento indeseable.

source: Instead, a new special method called :meth:`__index__` was added. It takes no arguments and returns an integer giving the slice index to use. For example::
es: En su lugar, se ha añadido un nuevo método especial llamado :meth:`__index__`. No toma argumentos y devuelve un entero que da el índice de corte a utilizar. Por ejemplo::

source: The return value must be either a Python integer or long integer. The interpreter will check that the type returned is correct, and raises a :exc:`TypeError` if this requirement isn't met.
es: El valor devuelto debe ser un entero de Python o un entero largo. El intérprete comprobará que el tipo devuelto es correcto, y lanza un :exc:`TypeError` si no se cumple este requisito.

source: A corresponding :c:member:`~PyNumberMethods.nb_index` slot was added to the C-level :c:type:`PyNumberMethods` structure to let C extensions implement this protocol. ``PyNumber_Index(obj)`` can be used in extension code to call the :meth:`__index__` function and retrieve its result.
es: Se agregó una ranura :c:member:`~PyNumberMethods.nb_index` correspondiente a la estructura :c:type:`PyNumberMethods` de nivel C para permitir que las extensiones C implementen este protocolo. ``PyNumber_Index(obj)`` se puede utilizar en código de extensión para llamar a la función :meth:`__index__` y recuperar su resultado.

source: :pep:`357` - Allowing Any Object to be Used for Slicing
es: :pep:`357` - Permitir el uso de cualquier objeto para rebanar

source: PEP written and implemented by Travis Oliphant.
es: PEP escrito e implementado por Travis Oliphant.

source: Other Language Changes
es: Otros cambios lingüísticos

source: Here are all of the changes that Python 2.5 makes to the core Python language.
es: Estos son todos los cambios que Python 2.5 introduce en el núcleo del lenguaje Python.

source: The :class:`dict` type has a new hook for letting subclasses provide a default value when a key isn't contained in the dictionary. When a key isn't found, the dictionary's ``__missing__(key)`` method will be called. This hook is used to implement the new :class:`defaultdict` class in the :mod:`collections` module. The following example defines a dictionary that returns zero for any missing key::
es: El tipo :class:`dict` tiene un nuevo gancho para permitir que las subclases proporcionen un valor por defecto cuando una clave no está contenida en el diccionario. Cuando no se encuentre una clave, se llamará al método ``missing__(key)`` del diccionario. Este hook se utiliza para implementar la nueva clase :class:`defaultdict` en el módulo :mod:`collections`. El siguiente ejemplo define un diccionario que devuelve cero para cualquier clave que falte::

source: Both 8-bit and Unicode strings have new ``partition(sep)`` and ``rpartition(sep)`` methods that simplify a common use case.
es: Tanto las cadenas de 8 bits como las de Unicode tienen nuevos métodos ``partition(sep)`` y ``rpartition(sep)`` que simplifican un caso de uso común.
