Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: The ``find(S)`` method is often used to get an index which is then used to slice the string and obtain the pieces that are before and after the separator. ``partition(sep)`` condenses this pattern into a single method call that returns a 3-tuple containing the substring before the separator, the separator itself, and the substring after the separator. If the separator isn't found, the first element of the tuple is the entire string and the other two elements are empty. ``rpartition(sep)`` also returns a 3-tuple but starts searching from the end of the string; the ``r`` stands for 'reverse'.
es: El método ``find(S)`` se utiliza a menudo para obtener un índice que luego se utiliza para cortar la cadena y obtener las piezas que están antes y después del separador. El método ``partition(sep)`` condensa este patrón en una sola llamada al método que devuelve una tripleta que contiene la subcadena antes del separador, el propio separador y la subcadena después del separador. Si no se encuentra el separador, el primer elemento de la tupla es la cadena completa y los otros dos elementos están vacíos. ``rpartition(sep)`` también devuelve una tupla de 3 elementos, pero empieza a buscar desde el final de la cadena; la ``r`` significa "al revés".

source: Some examples::
es: Algunos ejemplos::

source: (Implemented by Fredrik Lundh following a suggestion by Raymond Hettinger.)
es: (Implementado por Fredrik Lundh tras una sugerencia de Raymond Hettinger)

source: The :meth:`startswith` and :meth:`endswith` methods of string types now accept tuples of strings to check for. ::
es: Los métodos :meth:`startswith` y :meth:`endswith` de los tipos de cadena aceptan ahora tuplas de cadenas para su comprobación. ::

source: (Implemented by Georg Brandl following a suggestion by Tom Lynn.)
es: (Implementado por Georg Brandl tras una sugerencia de Tom Lynn)

source: The :func:`min` and :func:`max` built-in functions gained a ``key`` keyword parameter analogous to the ``key`` argument for :meth:`sort`. This parameter supplies a function that takes a single argument and is called for every value in the list; :func:`min`/:func:`max` will return the element with the smallest/largest return value from this function. For example, to find the longest string in a list, you can do::
es: Las funciones incorporadas :func:`min` y :func:`max` han ganado un parámetro de palabra clave ``key`` análogo al argumento ``key`` de :meth:`sort`. Este parámetro proporciona una función que toma un único argumento y es llamada para cada valor de la lista; :func:`min`/:func:`max` devolverá el elemento con el valor de retorno más pequeño/más grande de esta función. Por ejemplo, para encontrar la cadena más larga de una lista, puede hacer::

source: (Contributed by Steven Bethard and Raymond Hettinger.)
es: (Contribución de Steven Bethard y Raymond Hettinger)

source: Two new built-in functions, :func:`any` and :func:`all`, evaluate whether an iterator contains any true or false values. :func:`any` returns :const:`True` if any value returned by the iterator is true; otherwise it will return :const:`False`. :func:`all` returns :const:`True` only if all of the values returned by the iterator evaluate as true. (Suggested by Guido van Rossum, and implemented by Raymond Hettinger.)
es: Dos nuevas funciones incorporadas, :func:`any` y :func:`all`, evalúan si un iterador contiene algún valor verdadero o falso. :func:`any` devuelve :const:`True` si cualquier valor devuelto por el iterador es verdadero; en caso contrario devolverá :const:`False`. :func:`all` devuelve :const:`True` sólo si todos los valores devueltos por el iterador se evalúan como verdaderos. (Sugerido por Guido van Rossum, e implementado por Raymond Hettinger)

source: The result of a class's :meth:`__hash__` method can now be either a long integer or a regular integer. If a long integer is returned, the hash of that value is taken. In earlier versions the hash value was required to be a regular integer, but in 2.5 the :func:`id` built-in was changed to always return non-negative numbers, and users often seem to use ``id(self)`` in :meth:`__hash__` methods (though this is discouraged).
es: El resultado del método :meth:`__hash__` de una clase puede ser ahora un entero largo o un entero normal. Si se devuelve un entero largo, se toma el hash de ese valor. En versiones anteriores se requería que el valor del hash fuera un entero regular, pero en 2.5 el built-in :func:`id` se cambió para devolver siempre números no negativos, y los usuarios parecen utilizar a menudo ``id(self)`` en los métodos :meth:`__hash__` (aunque esto se desaconseja).

source: ASCII is now the default encoding for modules. It's now a syntax error if a module contains string literals with 8-bit characters but doesn't have an encoding declaration. In Python 2.4 this triggered a warning, not a syntax error. See :pep:`263` for how to declare a module's encoding; for example, you might add a line like this near the top of the source file::
es: ASCII es ahora la codificación por defecto para los módulos. Ahora es un error de sintaxis si un módulo contiene literales de cadena con caracteres de 8 bits pero no tiene una declaración de codificación. En Python 2.4 esto provocaba una advertencia, no un error de sintaxis. Vea en :pep:`263` cómo declarar la codificación de un módulo; por ejemplo, puede añadir una línea como ésta cerca de la parte superior del fichero fuente::

source: A new warning, :class:`UnicodeWarning`, is triggered when you attempt to compare a Unicode string and an 8-bit string that can't be converted to Unicode using the default ASCII encoding. The result of the comparison is false::
es: Una nueva advertencia, :class:`UnicodeWarning`, se activa cuando se intenta comparar una cadena Unicode y una cadena de 8 bits que no se puede convertir a Unicode utilizando la codificación ASCII por defecto. El resultado de la comparación es falso::

source: Previously this would raise a :class:`UnicodeDecodeError` exception, but in 2.5 this could result in puzzling problems when accessing a dictionary. If you looked up ``unichr(128)`` and ``chr(128)`` was being used as a key, you'd get a :class:`UnicodeDecodeError` exception. Other changes in 2.5 resulted in this exception being raised instead of suppressed by the code in :file:`dictobject.c` that implements dictionaries.
es: Anteriormente, esto lanzaba una excepción :class:`UnicodeDecodeError`, pero en 2.5 esto podía dar lugar a problemas desconcertantes al acceder a un diccionario. Si se buscaba ``unichr(128)`` y se utilizaba ``chr(128)`` como clave, se producía una excepción :class:`UnicodeDecodeError`. Otros cambios en la versión 2.5 hicieron que esta excepción se lanzara en lugar de ser suprimida por el código de :file:`dictobject.c` que implementa los diccionarios.

source: Raising an exception for such a comparison is strictly correct, but the change might have broken code, so instead :class:`UnicodeWarning` was introduced.
es: Lanzar una excepción para tal comparación es estrictamente correcto, pero el cambio podría haber roto el código, así que en su lugar se introdujo :class:`UnicodeWarning`.

source: (Implemented by Marc-André Lemburg.)
es: (Implementado por Marc-André Lemburg.)

source: One error that Python programmers sometimes make is forgetting to include an :file:`__init__.py` module in a package directory. Debugging this mistake can be confusing, and usually requires running Python with the :option:`-v` switch to log all the paths searched. In Python 2.5, a new :exc:`ImportWarning` warning is triggered when an import would have picked up a directory as a package but no :file:`__init__.py` was found. This warning is silently ignored by default; provide the :option:`-Wd <-W>` option when running the Python executable to display the warning message. (Implemented by Thomas Wouters.)
es: Un error que a veces cometen los programadores de Python es olvidarse de incluir un módulo :file:`__init__.py` en el directorio de un paquete. Depurar este error puede ser confuso, y normalmente requiere ejecutar Python con el modificador :option:`-v` para registrar todas las rutas buscadas. En Python 2.5, una nueva advertencia :exc:`ImportWarning` se activa cuando una importación habría recogido un directorio como paquete pero no se encontró ningún :file:`__init__.py`. Esta advertencia se ignora silenciosamente por defecto; proporcione la opción :option:`-Wd <-W>` cuando ejecute el ejecutable de Python para mostrar el mensaje de advertencia. (Implementado por Thomas Wouters)</-W>

source: The list of base classes in a class definition can now be empty. As an example, this is now legal::
es: La lista de clases base en una definición de clase ahora puede estar vacía. Como ejemplo, esto es ahora legal::

source: (Implemented by Brett Cannon.)
es: (Implementado por Brett Cannon.)

source: Interactive Interpreter Changes
es: Cambios en el intérprete interactivo

source: In the interactive interpreter, ``quit`` and ``exit`` have long been strings so that new users get a somewhat helpful message when they try to quit::
es: En el intérprete interactivo, ``quit`` y ``exit`` han sido durante mucho tiempo cadenas para que los nuevos usuarios obtengan un mensaje algo útil cuando intenten salir::

source: In Python 2.5, ``quit`` and ``exit`` are now objects that still produce string representations of themselves, but are also callable. Newbies who try ``quit()`` or ``exit()`` will now exit the interpreter as they expect. (Implemented by Georg Brandl.)
es: En Python 2.5, ``quit`` y ``exit`` son ahora objetos que siguen produciendo representaciones de cadena de sí mismos, pero también son invocables. Los novatos que prueben ``quit()`` o ``exit()`` ahora saldrán del intérprete como se espera. (Implementado por Georg Brandl.)

source: The Python executable now accepts the standard long options :option:`--help` and :option:`--version`; on Windows, it also accepts the :option:`/? <-?>` option for displaying a help message. (Implemented by Georg Brandl.)
es: El ejecutable de Python ahora acepta las opciones largas estándar :option:`--help` y :option:`--version`; en Windows, también acepta la opción :option:`/? <-?>` para mostrar un mensaje de ayuda. (Implementado por Georg Brandl)

source: Optimizations
es: Optimizaciones

source: Several of the optimizations were developed at the NeedForSpeed sprint, an event held in Reykjavik, Iceland, from May 21--28 2006. The sprint focused on speed enhancements to the CPython implementation and was funded by EWT LLC with local support from CCP Games. Those optimizations added at this sprint are specially marked in the following list.
es: Varias de las optimizaciones se desarrollaron en el sprint NeedForSpeed, un evento celebrado en Reikiavik, Islandia, del 21 al 28 de mayo de 2006. El sprint se centró en las mejoras de velocidad de la implementación de CPython y fue financiado por EWT LLC con el apoyo local de CCP Games. Las optimizaciones añadidas en este sprint están especialmente marcadas en la siguiente lista.

source: When they were introduced in Python 2.4, the built-in :class:`set` and :class:`frozenset` types were built on top of Python's dictionary type. In 2.5 the internal data structure has been customized for implementing sets, and as a result sets will use a third less memory and are somewhat faster. (Implemented by Raymond Hettinger.)
es: Cuando se introdujeron en Python 2.4, los tipos incorporados :class:`set` y :class:`frozenset` se construyeron sobre el tipo diccionario de Python. En 2.5 la estructura de datos interna se ha personalizado para implementar conjuntos, y como resultado los conjuntos utilizarán un tercio menos de memoria y son algo más rápidos. (Implementado por Raymond Hettinger)

source: The speed of some Unicode operations, such as finding substrings, string splitting, and character map encoding and decoding, has been improved. (Substring search and splitting improvements were added by Fredrik Lundh and Andrew Dalke at the NeedForSpeed sprint. Character maps were improved by Walter Dörwald and Martin von Löwis.)
es: Se ha mejorado la velocidad de algunas operaciones Unicode, como la búsqueda de subcadenas, la división de cadenas y la codificación y decodificación de mapas de caracteres. (Las mejoras en la búsqueda de subcadenas y la división fueron añadidas por Fredrik Lundh y Andrew Dalke en el sprint NeedForSpeed. Los mapas de caracteres fueron mejorados por Walter Dörwald y Martin von Löwis)

source: The ``long(str, base)`` function is now faster on long digit strings because fewer intermediate results are calculated. The peak is for strings of around 800--1000 digits where the function is 6 times faster. (Contributed by Alan McIntyre and committed at the NeedForSpeed sprint.)
es: La función ``long(str, base)`` es ahora más rápida en cadenas de dígitos largos porque se calculan menos resultados intermedios. El máximo es para cadenas de alrededor de 800-1000 dígitos, donde la función es 6 veces más rápida. (Aportado por Alan McIntyre y comprometido en el sprint NeedForSpeed)

source: It's now illegal to mix iterating over a file with ``for line in file`` and calling the file object's :meth:`read`/:meth:`readline`/:meth:`readlines` methods. Iteration uses an internal buffer and the :meth:`read\*` methods don't use that buffer. Instead they would return the data following the buffer, causing the data to appear out of order. Mixing iteration and these methods will now trigger a :exc:`ValueError` from the :meth:`read\*` method. (Implemented by Thomas Wouters.)
es: Ahora es ilegal mezclar la iteración sobre un fichero con ``for line in file`` y llamar a los métodos :meth:`read`/:meth:`readline`/:meth:`readlines` del objeto fichero. La iteración utiliza un buffer interno y los métodos :meth:`read\*` no utilizan ese buffer. En su lugar, devolverán los datos que siguen al buffer, haciendo que los datos aparezcan desordenados. Mezclar la iteración y estos métodos provocará ahora un :exc:`ValueError` del método :meth:`read\*`. (Implementado por Thomas Wouters)

source: The :mod:`struct` module now compiles structure format strings into an internal representation and caches this representation, yielding a 20% speedup. (Contributed by Bob Ippolito at the NeedForSpeed sprint.)
es: El módulo :mod:`struct` ahora compila cadenas de formato de estructura en una representación interna y almacena en caché esta representación, lo que supone una mejora del 20% s. (Contribuido por Bob Ippolito en el sprint NeedForSpeed)

source: The :mod:`re` module got a 1 or 2% speedup by switching to Python's allocator functions instead of the system's :c:func:`malloc` and :c:func:`free`. (Contributed by Jack Diederich at the NeedForSpeed sprint.)
es: El módulo :mod:`re` obtuvo un 1 o 2% s de velocidad al cambiar a las funciones asignadoras de Python en lugar de las :c:func:`malloc` y :c:func:`free` del sistema. (Contribuido por Jack Diederich en el sprint NeedForSpeed)

source: The code generator's peephole optimizer now performs simple constant folding in expressions. If you write something like ``a = 2+3``, the code generator will do the arithmetic and produce code corresponding to ``a = 5``. (Proposed and implemented by Raymond Hettinger.)
es: El optimizador de la mirilla del generador de código realiza ahora un simple plegado de constantes en las expresiones. Si escribes algo como ``a = 2+3``, el generador de código hará la aritmética y producirá el código correspondiente a ``a = 5``. (Propuesto e implementado por Raymond Hettinger)

source: Function calls are now faster because code objects now keep the most recently finished frame (a "zombie frame") in an internal field of the code object, reusing it the next time the code object is invoked. (Original patch by Michael Hudson, modified by Armin Rigo and Richard Jones; committed at the NeedForSpeed sprint.) Frame objects are also slightly smaller, which may improve cache locality and reduce memory usage a bit. (Contributed by Neal Norwitz.)
es: Las llamadas a funciones son ahora más rápidas porque los objetos de código guardan ahora el último fotograma terminado (un "fotograma zombi") en un campo interno del objeto de código, reutilizándolo la próxima vez que se invoque el objeto de código. (Parche original de Michael Hudson, modificado por Armin Rigo y Richard Jones; confirmado en el sprint NeedForSpeed) Los objetos marco son también ligeramente más pequeños, lo que puede mejorar la localidad de la caché y reducir un poco el uso de la memoria. (Contribución de Neal Norwitz)

source: Python's built-in exceptions are now new-style classes, a change that speeds up instantiation considerably. Exception handling in Python 2.5 is therefore about 30% faster than in 2.4. (Contributed by Richard Jones, Georg Brandl and Sean Reifschneider at the NeedForSpeed sprint.)
es: Las excepciones incorporadas en Python son ahora clases de nuevo estilo, un cambio que acelera considerablemente la instanciación. El manejo de excepciones en Python 2.5 es, por tanto, un 30% f más rápido que en 2.4. (Contribución de Richard Jones, Georg Brandl y Sean Reifschneider en el sprint NeedForSpeed)

source: Importing now caches the paths tried, recording whether they exist or not so that the interpreter makes fewer :c:func:`open` and :c:func:`stat` calls on startup. (Contributed by Martin von Löwis and Georg Brandl.)
es: La importación ahora almacena en caché las rutas intentadas, registrando si existen o no para que el intérprete haga menos llamadas a :c:func:`open` y :c:func:`stat` al iniciar. (Contribución de Martin von Löwis y Georg Brandl)

source: New, Improved, and Removed Modules
es: Módulos nuevos, mejorados y eliminados

source: The standard library received many enhancements and bug fixes in Python 2.5. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the SVN logs for all the details.
es: La biblioteca estándar ha recibido muchas mejoras y correcciones de errores en Python 2.5. Aquí hay una lista parcial de los cambios más notables, ordenados alfabéticamente por el nombre del módulo. Consulte el archivo :file:`Misc/NEWS` en el árbol de fuentes para obtener una lista más completa de los cambios, o busque en los registros de SVN para obtener todos los detalles.

source: The :mod:`audioop` module now supports the a-LAW encoding, and the code for u-LAW encoding has been improved. (Contributed by Lars Immisch.)
es: El módulo :mod:`audioop` soporta ahora la codificación a-LAW, y se ha mejorado el código para la codificación u-LAW. (Contribución de Lars Immisch)

source: The :mod:`codecs` module gained support for incremental codecs. The :func:`codec.lookup` function now returns a :class:`CodecInfo` instance instead of a tuple. :class:`CodecInfo` instances behave like a 4-tuple to preserve backward compatibility but also have the attributes :attr:`encode`, :attr:`decode`, :attr:`incrementalencoder`, :attr:`incrementaldecoder`, :attr:`streamwriter`, and :attr:`streamreader`. Incremental codecs can receive input and produce output in multiple chunks; the output is the same as if the entire input was fed to the non-incremental codec. See the :mod:`codecs` module documentation for details. (Designed and implemented by Walter Dörwald.)
es: El módulo :mod:`codecs` ha ganado soporte para códecs incrementales. La función :func:`codec.lookup` devuelve ahora una instancia de :class:`CodecInfo` en lugar de una tupla. Las instancias de :class:`CodecInfo` se comportan como una cuádruple tupla para preservar la compatibilidad con versiones anteriores, pero también tienen los atributos :attr:`encode`, :attr:`decode`, :attr:`incrementalencoder`, :attr:`incrementaldecoder`, :attr:`streamwriter` y :attr:`streamreader`. Los códecs incrementales pueden recibir la entrada y producir la salida en varios trozos; la salida es la misma que si la entrada completa fuera alimentada por el códec no incremental. Consulte la documentación del módulo :mod:`codecs` para más detalles. (Diseñado e implementado por Walter Dörwald)

source: The :mod:`collections` module gained a new type, :class:`defaultdict`, that subclasses the standard :class:`dict` type. The new type mostly behaves like a dictionary but constructs a default value when a key isn't present, automatically adding it to the dictionary for the requested key value.
es: El módulo :mod:`collections` ha ganado un nuevo tipo, :class:`defaultdict`, que subclasifica el tipo estándar :class:`dict`. El nuevo tipo se comporta principalmente como un diccionario pero construye un valor por defecto cuando una clave no está presente, añadiéndolo automáticamente al diccionario para el valor de la clave solicitada.

source: The first argument to :class:`defaultdict`'s constructor is a factory function that gets called whenever a key is requested but not found. This factory function receives no arguments, so you can use built-in type constructors such as :func:`list` or :func:`int`. For example, you can make an index of words based on their initial letter like this::
es: El primer argumento del constructor de :class:`defaultdict` es una función de fábrica que se llama cada vez que se solicita una clave pero no se encuentra. Esta función de fábrica no recibe argumentos, por lo que puede utilizar constructores de tipo incorporado como :func:`list` o :func:`int`. Por ejemplo, puedes hacer un índice de palabras basado en su letra inicial así::

source: Printing ``index`` results in the following output::
es: Al imprimir ``index`` se obtiene la siguiente salida::

source: (Contributed by Guido van Rossum.)
es: (Contribución de Guido van Rossum.)

source: The :class:`deque` double-ended queue type supplied by the :mod:`collections` module now has a ``remove(value)`` method that removes the first occurrence of *value* in the queue, raising :exc:`ValueError` if the value isn't found. (Contributed by Raymond Hettinger.)
es: El tipo de cola doble :class:`deque` suministrado por el módulo :mod:`collections` tiene ahora un método ``remove(value)`` que elimina la primera aparición de *value* en la cola, lanzando :exc:`ValueError` si no se encuentra el valor. (Contribución de Raymond Hettinger)

source: New module: The :mod:`contextlib` module contains helper functions for use with the new ':keyword:`with`' statement. See section :ref:`contextlibmod` for more about this module.
es: Nuevo módulo: El módulo :mod:`contextlib` contiene funciones de ayuda para usar con la nueva sentencia ':keyword:`with`'. Consulte la sección :ref:`contextlibmod` para obtener más información sobre este módulo.

source: New module: The :mod:`cProfile` module is a C implementation of the existing :mod:`profile` module that has much lower overhead. The module's interface is the same as :mod:`profile`: you run ``cProfile.run('main()')`` to profile a function, can save profile data to a file, etc. It's not yet known if the Hotshot profiler, which is also written in C but doesn't match the :mod:`profile` module's interface, will continue to be maintained in future versions of Python. (Contributed by Armin Rigo.)
es: Nuevo módulo: El módulo :mod:`cProfile` es una implementación en C del módulo existente :mod:`profile` que tiene una sobrecarga mucho menor. La interfaz del módulo es la misma que la de :mod:`profile`: se ejecuta ``cProfile.run('main()')`` para perfilar una función, se pueden guardar los datos del perfil en un archivo, etc. Todavía no se sabe si el perfilador Hotshot, que también está escrito en C pero no coincide con la interfaz del módulo :mod:`profile`, seguirá manteniéndose en futuras versiones de Python. (Contribución de Armin Rigo.)
