Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: What's New in Python 2.5
es: Qué hay de nuevo en Python 2.5

source: Author
es: Autor

source: This article explains the new features in Python 2.5. The final release of Python 2.5 is scheduled for August 2006; :pep:`356` describes the planned release schedule. Python 2.5 was released on September 19, 2006.
es: Este artículo explica las nuevas características de Python 2.5. La versión final de Python 2.5 está prevista para agosto de 2006; :pep:`356` describe el cronograma de lanzamiento planificado.

source: The changes in Python 2.5 are an interesting mix of language and library improvements. The library enhancements will be more important to Python's user community, I think, because several widely useful packages were added. New modules include ElementTree for XML processing (:mod:`xml.etree`), the SQLite database module (:mod:`sqlite`), and the :mod:`ctypes` module for calling C functions.
es: Los cambios en Python 2.5 son una interesante mezcla de mejoras en el lenguaje y en las bibliotecas. Las mejoras en las bibliotecas serán más importantes para la comunidad de usuarios de Python, creo, debido a que se han añadido varios paquetes bastante útiles. Los nuevos módulos incluyen ElementTree para el procesamiento de XML (:mod:`xml.etree`), el módulo de base de datos SQLite (:mod:`sqlite`), y el módulo :mod:`ctypes` para llamar a funciones escritas en lenguaje C.

source: The language changes are of middling significance. Some pleasant new features were added, but most of them aren't features that you'll use every day. Conditional expressions were finally added to the language using a novel syntax; see section :ref:`pep-308`. The new ':keyword:`with`' statement will make writing cleanup code easier (section :ref:`pep-343`). Values can now be passed into generators (section :ref:`pep-342`). Imports are now visible as either absolute or relative (section :ref:`pep-328`). Some corner cases of exception handling are handled better (section :ref:`pep-341`). All these improvements are worthwhile, but they're improvements to one specific language feature or another; none of them are broad modifications to Python's semantics.
es: Los cambios en el lenguaje son de mediana importancia. Se han añadido algunas características nuevas y agradables, pero la mayoría de ellas no son características que vaya a utilizar todos los días. Las expresiones condicionales fueron finalmente añadidas al lenguaje usando una nueva sintaxis; ver sección :ref:`pep-308`. La nueva sentencia ':keyword:`with`' facilitará la escritura de código de limpieza (sección :ref:`pep-343`). Ahora se pueden pasar valores a los generadores (sección :ref:`pep-342`). Las importaciones son ahora visibles como absolutas o relativas (sección :ref:`pep-328`). Se han mejorado algunos casos de manejo de excepciones (sección :ref:`pep-341`). Todas estas mejoras merecen la pena, pero son mejoras de una u otra característica específica del lenguaje; ninguna de ellas es una modificación amplia de la semántica de Python.

source: As well as the language and library additions, other improvements and bugfixes were made throughout the source tree. A search through the SVN change logs finds there were 353 patches applied and 458 bugs fixed between Python 2.4 and 2.5. (Both figures are likely to be underestimates.)
es: Además de las adiciones al lenguaje y a la biblioteca, se han realizado otras mejoras y correcciones de errores en todo el árbol de código fuente. Una búsqueda en los registros de cambios del SVN revela que se aplicaron 353 parches y se corrigieron 458 errores entre Python 2.4 y 2.5. (Es probable que ambas cifras estén subestimadas)

source: This article doesn't try to be a complete specification of the new features; instead changes are briefly introduced using helpful examples. For full details, you should always refer to the documentation for Python 2.5 at https://docs.python.org. If you want to understand the complete implementation and design rationale, refer to the PEP for a particular new feature.
es: Este artículo no pretende ser una especificación completa de las nuevas características; en su lugar, los cambios se introducen brevemente utilizando ejemplos útiles. Para obtener todos los detalles, siempre debes consultar la documentación de Python 2.5 en https://docs.python.org. Si quieres entender la implementación completa y los fundamentos del diseño, consulta el PEP de una nueva característica en particular.

source: Comments, suggestions, and error reports for this document are welcome; please e-mail them to the author or open a bug in the Python bug tracker.
es: Son bienvenidos los comentarios, las sugerencias y los informes de errores para este documento; por favor, envíelos por correo electrónico al autor o abra un error en el rastreador de errores de Python.

source: PEP 308: Conditional Expressions
es: PEP 308: Expresiones condicionales

source: For a long time, people have been requesting a way to write conditional expressions, which are expressions that return value A or value B depending on whether a Boolean value is true or false. A conditional expression lets you write a single assignment statement that has the same effect as the following::
es: Durante mucho tiempo, la gente ha solicitado una forma de escribir expresiones condicionales, que son expresiones que devuelven el valor A o el valor B dependiendo de si un valor booleano es verdadero o falso. Una expresión condicional le permite escribir una única sentencia de asignación que tiene el mismo efecto que la siguiente::

source: There have been endless tedious discussions of syntax on both python-dev and comp.lang.python. A vote was even held that found the majority of voters wanted conditional expressions in some form, but there was no syntax that was preferred by a clear majority. Candidates included C's ``cond ? true_v : false_v``, ``if cond then true_v else false_v``, and 16 other variations.
es: Ha habido interminables y tediosas discusiones sobre la sintaxis tanto en python-dev como en comp.lang.python. Incluso se llevó a cabo una votación en la que se descubrió que la mayoría de los votantes querían expresiones condicionales de alguna forma, pero no había ninguna sintaxis que fuera preferida por una clara mayoría. Los candidatos incluían ``cond ? true_v : false_v``, ``if cond then true_v else false_v``, y otras 16 variaciones.

source: Guido van Rossum eventually chose a surprising syntax::
es: Guido van Rossum eligió finalmente una sintaxis sorprendente::

source: Evaluation is still lazy as in existing Boolean expressions, so the order of evaluation jumps around a bit. The *condition* expression in the middle is evaluated first, and the *true_value* expression is evaluated only if the condition was true. Similarly, the *false_value* expression is only evaluated when the condition is false.
es: La evaluación sigue siendo perezosa como en las expresiones booleanas existentes, por lo que el orden de evaluación salta un poco. La expresión *condición* del medio se evalúa primero, y la expresión *valor_verdadero* se evalúa sólo si la condición es verdadera. Del mismo modo, la expresión *valor_falso* sólo se evalúa cuando la condición es falsa.

source: This syntax may seem strange and backwards; why does the condition go in the *middle* of the expression, and not in the front as in C's ``c ? x : y``? The decision was checked by applying the new syntax to the modules in the standard library and seeing how the resulting code read. In many cases where a conditional expression is used, one value seems to be the 'common case' and one value is an 'exceptional case', used only on rarer occasions when the condition isn't met. The conditional syntax makes this pattern a bit more obvious::
es: Esta sintaxis puede parecer extraña y retrógrada; ¿por qué la condición va en el *medio* de la expresión, y no en la parte delantera como en ``c ? x : y`` de C? La decisión se comprobó aplicando la nueva sintaxis a los módulos de la biblioteca estándar y viendo cómo se leía el código resultante. En muchos casos en los que se utiliza una expresión condicional, un valor parece ser el "caso común" y otro valor es un "caso excepcional", utilizado sólo en las raras ocasiones en las que no se cumple la condición. La sintaxis condicional hace que este patrón sea un poco más obvio::

source: I read the above statement as meaning "here *contents* is usually assigned a value of ``doc+'\n'``; sometimes *doc* is empty, in which special case an empty string is returned." I doubt I will use conditional expressions very often where there isn't a clear common and uncommon case.
es: Leo la afirmación anterior en el sentido de que "aquí se asigna a *contents* un valor de ``doc+'\n'``; a veces *doc* está vacío, en cuyo caso especial se devuelve una cadena vacía" Dudo que use expresiones condicionales muy a menudo donde no hay un caso común y no común claro.

source: There was some discussion of whether the language should require surrounding conditional expressions with parentheses. The decision was made to *not* require parentheses in the Python language's grammar, but as a matter of style I think you should always use them. Consider these two statements::
es: Hubo alguna discusión sobre si el lenguaje debería requerir rodear las expresiones condicionales con paréntesis. Se tomó la decisión de *no* requerir paréntesis en la gramática del lenguaje Python, pero como una cuestión de estilo creo que siempre deberías usarlos. Considere estas dos declaraciones::

source: In the first version, I think a reader's eye might group the statement into 'level = 1', 'if logging', 'else 0', and think that the condition decides whether the assignment to *level* is performed. The second version reads better, in my opinion, because it makes it clear that the assignment is always performed and the choice is being made between two values.
es: En la primera versión, creo que el ojo de un lector podría agrupar la sentencia en 'nivel = 1', 'si registro', 'si no 0', y pensar que la condición decide si se realiza la asignación a *nivel*. La segunda versión se lee mejor, en mi opinión, porque deja claro que la asignación se realiza siempre y que se está eligiendo entre dos valores.

source: Another reason for including the brackets: a few odd combinations of list comprehensions and lambdas could look like incorrect conditional expressions. See :pep:`308` for some examples. If you put parentheses around your conditional expressions, you won't run into this case.
es: Otra razón para incluir los paréntesis: algunas combinaciones extrañas de comprensiones de listas y lambdas podrían parecer expresiones condicionales incorrectas. Véase :pep:`308` para algunos ejemplos. Si pone paréntesis alrededor de sus expresiones condicionales, no se encontrará con este caso.

source: :pep:`308` - Conditional Expressions
es: :pep:`308` - Expresiones condicionales

source: PEP written by Guido van Rossum and Raymond D. Hettinger; implemented by Thomas Wouters.
es: PEP escrito por Guido van Rossum y Raymond D. Hettinger; implementado por Thomas Wouters.

source: PEP 309: Partial Function Application
es: PEP 309: Aplicación parcial de funciones

source: The :mod:`functools` module is intended to contain tools for functional-style programming.
es: El módulo :mod:`functools` está destinado a contener herramientas para la programación de estilo funcional.

source: One useful tool in this module is the :func:`partial` function. For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you could create a new function ``g(b, c)`` that was equivalent to ``f(1, b, c)``. This is called "partial function application".
es: Una herramienta útil de este módulo es la función :func:`partial`. Para los programas escritos en un estilo funcional, a veces querrá construir variantes de funciones existentes que tengan algunos de los parámetros rellenados. Considere una función Python ``f(a, b, c)``; podría crear una nueva función ``g(b, c)`` que fuera equivalente a ``f(1, b, c)``. Esto se llama "aplicación parcial de funciones".

source: :func:`partial` takes the arguments ``(function, arg1, arg2, ... kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke *function* with the filled-in arguments.
es: :func:`parcial` toma los argumentos ``(function, arg1, arg2, ... kwarg1=valor1, kwarg2=valor2)``. El objeto resultante es invocable, por lo que puedes llamarlo para invocar la *función* con los argumentos rellenados.

source: Here's a small but realistic example::
es: He aquí un pequeño pero realista ejemplo::

source: Here's another example, from a program that uses PyGTK. Here a context-sensitive pop-up menu is being constructed dynamically. The callback provided for the menu option is a partially applied version of the :meth:`open_item` method, where the first argument has been provided. ::
es: Aquí hay otro ejemplo, de un programa que utiliza PyGTK. Aquí se está construyendo dinámicamente un menú emergente sensible al contexto. El callback proporcionado para la opción de menú es una versión parcialmente aplicada del método :meth:`open_item`, donde se ha proporcionado el primer argumento ::

source: Another function in the :mod:`functools` module is the ``update_wrapper(wrapper, wrapped)`` function that helps you write well-behaved decorators. :func:`update_wrapper` copies the name, module, and docstring attribute to a wrapper function so that tracebacks inside the wrapped function are easier to understand. For example, you might write::
es: Otra función del módulo :mod:`functools` es la función ``update_wrapper(wrapper, wrapped)`` que le ayuda a escribir decoradores con un buen comportamiento. :func:`update_wrapper` copia el nombre, el módulo y el atributo docstring a una función wrapper para que las trazas dentro de la función envuelta sean más fáciles de entender. Por ejemplo, puedes escribir::

source: :func:`wraps` is a decorator that can be used inside your own decorators to copy the wrapped function's information. An alternate version of the previous example would be::
es: :func:`wraps` es un decorador que se puede utilizar dentro de sus propios decoradores para copiar la información de la función envuelta. Una versión alternativa del ejemplo anterior sería::

source: :pep:`309` - Partial Function Application
es: :pep:`309` - Aplicación parcial de funciones

source: PEP proposed and written by Peter Harris; implemented by Hye-Shik Chang and Nick Coghlan, with adaptations by Raymond Hettinger.
es: PEP propuesto y escrito por Peter Harris; implementado por Hye-Shik Chang y Nick Coghlan, con adaptaciones de Raymond Hettinger.

source: PEP 314: Metadata for Python Software Packages v1.1
es: PEP 314: Metadatos para paquetes de software Python v1.1

source: Some simple dependency support was added to Distutils. The :func:`setup` function now has ``requires``, ``provides``, and ``obsoletes`` keyword parameters. When you build a source distribution using the ``sdist`` command, the dependency information will be recorded in the :file:`PKG-INFO` file.
es: Se ha añadido a Distutils un sencillo soporte de dependencias. La función :func:`setup` ahora tiene parámetros de palabras clave ``requires``, ``provides`` y ``obsoletes``. Cuando se construye una distribución de origen utilizando el comando ``sdist``, la información de las dependencias se registrará en el archivo :file:`PKG-INFO`.

source: Another new keyword parameter is ``download_url``, which should be set to a URL for the package's source code. This means it's now possible to look up an entry in the package index, determine the dependencies for a package, and download the required packages. ::
es: Otro nuevo parámetro de palabra clave es ``download_url``, que debe establecerse como una URL para el código fuente del paquete. Esto significa que ahora es posible buscar una entrada en el índice de paquetes, determinar las dependencias de un paquete y descargar los paquetes necesarios. ::

source: Another new enhancement to the Python package index at https://pypi.org is storing source and binary archives for a package. The new :command:`upload` Distutils command will upload a package to the repository.
es: Otra nueva mejora en el índice de paquetes de Python en https://pypi.org es el almacenamiento de archivos fuente y binarios de un paquete. El nuevo comando :command:`upload` de Distutils subirá un paquete al repositorio.

source: Before a package can be uploaded, you must be able to build a distribution using the :command:`sdist` Distutils command. Once that works, you can run ``python setup.py upload`` to add your package to the PyPI archive. Optionally you can GPG-sign the package by supplying the :option:`!--sign` and :option:`!--identity` options.
es: Antes de poder subir un paquete, debes ser capaz de construir una distribución usando el comando :command:`sdist` de Distutils. Una vez que funcione, puedes ejecutar ``python setup.py upload`` para añadir tu paquete al archivo PyPI. Opcionalmente puedes firmar el paquete con GPG suministrando las opciones :option:`!--sign` y :option:`!--identity`.

source: Package uploading was implemented by Martin von Löwis and Richard Jones.
es: La carga de paquetes fue implementada por Martin von Löwis y Richard Jones.

source: :pep:`314` - Metadata for Python Software Packages v1.1
es: :pep:`314` - Metadatos para paquetes de software Python v1.1

source: PEP proposed and written by A.M. Kuchling, Richard Jones, and Fred Drake; implemented by Richard Jones and Fred Drake.
es: PEP propuesto y redactado por A.M. Kuchling, Richard Jones y Fred Drake; aplicado por Richard Jones y Fred Drake.

source: PEP 328: Absolute and Relative Imports
es: PEP 328: Importaciones absolutas y relativas

source: The simpler part of :pep:`328` was implemented in Python 2.4: parentheses could now be used to enclose the names imported from a module using the ``from ... import ...`` statement, making it easier to import many different names.
es: La parte más sencilla de :pep:`328` se implementó en Python 2.4: los paréntesis podían utilizarse ahora para encerrar los nombres importados de un módulo utilizando la sentencia ``from ... import ...``, facilitando la importación de muchos nombres diferentes.

source: The more complicated part has been implemented in Python 2.5: importing a module can be specified to use absolute or package-relative imports. The plan is to move toward making absolute imports the default in future versions of Python.
es: La parte más complicada se ha implementado en Python 2.5: la importación de un módulo puede especificarse para utilizar importaciones absolutas o relativas al paquete. El plan es hacer que las importaciones absolutas sean el valor por defecto en futuras versiones de Python.

source: Let's say you have a package directory like this::
es: Digamos que tienes un directorio de paquetes como este::

source: This defines a package named :mod:`pkg` containing the :mod:`pkg.main` and :mod:`pkg.string` submodules.
es: Esto define un paquete llamado :mod:`pkg` que contiene los submódulos :mod:`pkg.main` y :mod:`pkg.string`.

source: Consider the code in the :file:`main.py` module. What happens if it executes the statement ``import string``? In Python 2.4 and earlier, it will first look in the package's directory to perform a relative import, finds :file:`pkg/string.py`, imports the contents of that file as the :mod:`pkg.string` module, and that module is bound to the name ``string`` in the :mod:`pkg.main` module's namespace.
es: Considera el código del módulo :file:`main.py`. ¿Qué ocurre si ejecuta la sentencia ``importar cadena``? En Python 2.4 y anteriores, primero buscará en el directorio del paquete para realizar una importación relativa, encuentra :file:`pkg/string.py`, importa el contenido de ese archivo como el módulo :mod:`pkg.string`, y ese módulo se vincula al nombre ``string`` en el espacio de nombres del módulo :mod:`pkg.main`.

source: That's fine if :mod:`pkg.string` was what you wanted. But what if you wanted Python's standard :mod:`string` module? There's no clean way to ignore :mod:`pkg.string` and look for the standard module; generally you had to look at the contents of ``sys.modules``, which is slightly unclean. Holger Krekel's :mod:`py.std` package provides a tidier way to perform imports from the standard library, ``import py; py.std.string.join()``, but that package isn't available on all Python installations.
es: Eso está bien si :mod:`pkg.string` era lo que querías. ¿Pero qué pasa si quieres el módulo estándar de Python :mod:`string`? No hay una forma limpia de ignorar :mod:`pkg.string` y buscar el módulo estándar; generalmente tienes que mirar el contenido de ``sys.modules``, lo cual es ligeramente sucio. El paquete :mod:`py.std` de Holger Krekel proporciona una forma más ordenada de realizar importaciones desde la biblioteca estándar, ``import py; py.std.string.join()``, pero ese paquete no está disponible en todas las instalaciones de Python.

source: Reading code which relies on relative imports is also less clear, because a reader may be confused about which module, :mod:`string` or :mod:`pkg.string`, is intended to be used. Python users soon learned not to duplicate the names of standard library modules in the names of their packages' submodules, but you can't protect against having your submodule's name being used for a new module added in a future version of Python.
es: La lectura de código que depende de importaciones relativas también es menos clara, porque un lector puede confundirse sobre qué módulo, :mod:`cadena` o :mod:`cadena.pkg`, se pretende utilizar. Los usuarios de Python aprendieron pronto a no duplicar los nombres de los módulos de la biblioteca estándar en los nombres de los submódulos de sus paquetes, pero no puedes protegerte de que el nombre de tu submódulo se utilice para un nuevo módulo añadido en una futura versión de Python.

source: In Python 2.5, you can switch :keyword:`import`'s behaviour to absolute imports using a ``from __future__ import absolute_import`` directive. This absolute-import behaviour will become the default in a future version (probably Python 2.7). Once absolute imports are the default, ``import string`` will always find the standard library's version. It's suggested that users should begin using absolute imports as much as possible, so it's preferable to begin writing ``from pkg import string`` in your code.
es: En Python 2.5, puedes cambiar el comportamiento de :keyword:`import` a importaciones absolutas usando una directiva ``from __future__ import absolute_import``. Este comportamiento de importación absoluta será el predeterminado en una versión futura (probablemente Python 2.7). Una vez que las importaciones absolutas sean el valor por defecto, ``import string`` siempre encontrará la versión de la biblioteca estándar. Se sugiere que los usuarios comiencen a usar importaciones absolutas tanto como sea posible, así que es preferible comenzar a escribir ``de pkg import string`` en su código.

source: Relative imports are still possible by adding a leading period to the module name when using the ``from ... import`` form::
es: Las importaciones relativas siguen siendo posibles añadiendo un punto inicial al nombre del módulo cuando se utiliza la forma ``from ... import``::
