Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: This imports the :mod:`string` module relative to the current package, so in :mod:`pkg.main` this will import *name1* and *name2* from :mod:`pkg.string`. Additional leading periods perform the relative import starting from the parent of the current package. For example, code in the :mod:`A.B.C` module can do::
es: Esto importa el módulo :mod:`string` relativo al paquete actual, así que en :mod:`pkg.main` esto importará *nombre1* y *nombre2* de :mod:`pkg.string`. Los puntos iniciales adicionales realizan la importación relativa empezando por el padre del paquete actual. Por ejemplo, el código en el módulo :mod:`A.B.C` puede hacer::

source: Leading periods cannot be used with the ``import modname`` form of the import statement, only the ``from ... import`` form.
es: Los puntos suspensivos no pueden usarse con la forma ``importar nombre de modelo`` de la sentencia import, sólo con la forma ``de ... import``.

source: :pep:`328` - Imports: Multi-Line and Absolute/Relative
es: :pep:`328` - Importaciones: Multilínea y Absoluto/Relativo

source: PEP written by Aahz; implemented by Thomas Wouters.
es: PEP escrito por Aahz; implementado por Thomas Wouters.

source: The py library by Holger Krekel, which contains the :mod:`py.std` package.
es: La biblioteca py de Holger Krekel, que contiene el paquete :mod:`py.std`.

source: PEP 338: Executing Modules as Scripts
es: PEP 338: Ejecutando Módulos como Scripts

source: The :option:`-m` switch added in Python 2.4 to execute a module as a script gained a few more abilities. Instead of being implemented in C code inside the Python interpreter, the switch now uses an implementation in a new module, :mod:`runpy`.
es: El conmutador :option:`-m` añadido en Python 2.4 para ejecutar un módulo como un script ganó algunas habilidades más. En lugar de estar implementado en código C dentro del intérprete de Python, el interruptor ahora utiliza una implementación en un nuevo módulo, :mod:`runpy`.

source: The :mod:`runpy` module implements a more sophisticated import mechanism so that it's now possible to run modules in a package such as :mod:`pychecker.checker`. The module also supports alternative import mechanisms such as the :mod:`zipimport` module. This means you can add a .zip archive's path to ``sys.path`` and then use the :option:`-m` switch to execute code from the archive.
es: El módulo :mod:`runpy` implementa un mecanismo de importación más sofisticado de forma que ahora es posible ejecutar módulos en un paquete como :mod:`pychecker.checker`. El módulo también soporta mecanismos de importación alternativos como el módulo :mod:`zipimport`. Esto significa que puede añadir la ruta de un archivo .zip a ``sys.path`` y luego utilizar el modificador :option:`-m` para ejecutar el código del archivo.

source: :pep:`338` - Executing modules as scripts
es: :pep:`338` - Ejecución de módulos como scripts

source: PEP written and implemented by Nick Coghlan.
es: PEP escrito e implementado por Nick Coghlan.

source: PEP 341: Unified try/except/finally
es: PEP 341: Try/except/finally unificados

source: Until Python 2.5, the :keyword:`try` statement came in two flavours. You could use a :keyword:`finally` block to ensure that code is always executed, or one or more :keyword:`except` blocks to catch specific exceptions. You couldn't combine both :keyword:`!except` blocks and a :keyword:`!finally` block, because generating the right bytecode for the combined version was complicated and it wasn't clear what the semantics of the combined statement should be.
es: Hasta la versión 2.5 de Python, la sentencia :keyword:`try` tenía dos variantes. Podías usar un bloque :keyword:`finally` para asegurarte de que el código se ejecutaba siempre, o uno o más bloques :keyword:`except` para capturar excepciones específicas. No podías combinar ambos bloques :keyword:`!except` y un bloque :keyword:`!finally`, porque generar el bytecode correcto para la versión combinada era complicado y no estaba claro cuál debía ser la semántica de la sentencia combinada.

source: Guido van Rossum spent some time working with Java, which does support the equivalent of combining :keyword:`except` blocks and a :keyword:`finally` block, and this clarified what the statement should mean. In Python 2.5, you can now write::
es: Guido van Rossum pasó algún tiempo trabajando con Java, que sí soporta el equivalente de combinar bloques :keyword:`except` y un bloque :keyword:`finally`, y esto aclaró lo que debería significar la declaración. En Python 2.5, ahora se puede escribir::

source: The code in *block-1* is executed. If the code raises an exception, the various :keyword:`except` blocks are tested: if the exception is of class :class:`Exception1`, *handler-1* is executed; otherwise if it's of class :class:`Exception2`, *handler-2* is executed, and so forth. If no exception is raised, the *else-block* is executed.
es: Se ejecuta el código del *bloque-1*. Si el código lanza una excepción, se comprueban los distintos bloques :keyword:`except`: si la excepción es de clase :class:`Exception1`, se ejecuta *handler-1*; en caso contrario, si es de clase :class:`Exception2`, se ejecuta *handler-2*, y así sucesivamente. Si no se produce ninguna excepción, se ejecuta el bloque *else*.

source: No matter what happened previously, the *final-block* is executed once the code block is complete and any raised exceptions handled. Even if there's an error in an exception handler or the *else-block* and a new exception is raised, the code in the *final-block* is still run.
es: No importa lo que haya sucedido previamente, el *bloque final* se ejecuta una vez que el bloque de código se ha completado y se han manejado las excepciones planteadas. Incluso si hay un error en un manejador de excepciones o en el *bloque else* y se lanza una nueva excepción, el código del *bloque final* se sigue ejecutando.

source: :pep:`341` - Unifying try-except and try-finally
es: :pep:`341` - Unificar try-except y try-finally

source: PEP written by Georg Brandl; implementation by Thomas Lee.
es: PEP escrito por Georg Brandl; implementación por Thomas Lee.

source: PEP 342: New Generator Features
es: PEP 342: Nuevas funciones del generador

source: Python 2.5 adds a simple way to pass values *into* a generator. As introduced in Python 2.3, generators only produce output; once a generator's code was invoked to create an iterator, there was no way to pass any new information into the function when its execution is resumed. Sometimes the ability to pass in some information would be useful. Hackish solutions to this include making the generator's code look at a global variable and then changing the global variable's value, or passing in some mutable object that callers then modify.
es: Python 2.5 añade una forma sencilla de pasar valores *a* un generador. Tal y como se introdujo en Python 2.3, los generadores sólo producen salida; una vez que se invoca el código de un generador para crear un iterador, no hay forma de pasar ninguna información nueva a la función cuando se reanuda su ejecución. A veces, la capacidad de pasar alguna información sería útil. Las soluciones más ingeniosas para esto incluyen hacer que el código del generador mire a una variable global y luego cambie el valor de la variable global, o pasar algún objeto mutable que los llamadores luego modifiquen.

source: To refresh your memory of basic generators, here's a simple example::
es: Para refrescar la memoria de los generadores básicos, he aquí un ejemplo sencillo::

source: When you call ``counter(10)``, the result is an iterator that returns the values from 0 up to 9. On encountering the :keyword:`yield` statement, the iterator returns the provided value and suspends the function's execution, preserving the local variables. Execution resumes on the following call to the iterator's :meth:`next` method, picking up after the :keyword:`!yield` statement.
es: Cuando se llama a ``contador(10)``, el resultado es un iterador que devuelve los valores de 0 a 9. Al encontrar la sentencia :keyword:`yield`, el iterador devuelve el valor proporcionado y suspende la ejecución de la función, preservando las variables locales. La ejecución se reanuda en la siguiente llamada al método :meth:`next` del iterador, retomando después de la sentencia :keyword:`!yield`.

source: In Python 2.3, :keyword:`yield` was a statement; it didn't return any value. In 2.5, :keyword:`!yield` is now an expression, returning a value that can be assigned to a variable or otherwise operated on::
es: En Python 2.3, :keyword:`yield` era una declaración; no devolvía ningún valor. En 2.5, :keyword:`!yield` es ahora una expresión, que devuelve un valor que se puede asignar a una variable o que se puede operar de otra manera::

source: I recommend that you always put parentheses around a :keyword:`yield` expression when you're doing something with the returned value, as in the above example. The parentheses aren't always necessary, but it's easier to always add them instead of having to remember when they're needed.
es: Te recomiendo que siempre pongas paréntesis alrededor de una expresión :keyword:`yield` cuando estés haciendo algo con el valor devuelto, como en el ejemplo anterior. Los paréntesis no siempre son necesarios, pero es más fácil añadirlos siempre en lugar de tener que recordar cuándo son necesarios.

source: (:pep:`342` explains the exact rules, which are that a :keyword:`yield`\ -expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` but have to use parentheses when there's an operation, as in ``val = (yield i) + 12``.)
es: (:pep:`342` explica las reglas exactas, que consisten en que una expresión :keyword:`yield`\ debe ir siempre entre paréntesis, excepto cuando ocurre en la expresión de nivel superior en el lado derecho de una asignación. Esto significa que puedes escribir ``val = yield i`` pero tienes que usar paréntesis cuando hay una operación, como en ``val = (yield i) + 12``)

source: Values are sent into a generator by calling its ``send(value)`` method. The generator's code is then resumed and the :keyword:`yield` expression returns the specified *value*. If the regular :meth:`next` method is called, the :keyword:`!yield` returns :const:`None`.
es: Los valores se envían a un generador llamando a su método ``send(value)``. El código del generador se reanuda y la expresión :keyword:`yield` devuelve el *valor* especificado. Si se llama al método regular :meth:`next`, la expresión :keyword:`!yield` devuelve :const:`None`.

source: Here's the previous example, modified to allow changing the value of the internal counter. ::
es: Aquí está el ejemplo anterior, modificado para permitir cambiar el valor del contador interno. ::

source: And here's an example of changing the counter::
es: Y aquí hay un ejemplo de cambio de contador::

source: :keyword:`yield` will usually return :const:`None`, so you should always check for this case. Don't just use its value in expressions unless you're sure that the :meth:`send` method will be the only method used to resume your generator function.
es: :keyword:`yield` normalmente devolverá :const:`None`, por lo que siempre debes comprobar este caso. No utilices su valor en las expresiones sin más, a menos que estés seguro de que el método :meth:`send` será el único utilizado para reanudar tu función generadora.

source: In addition to :meth:`send`, there are two other new methods on generators:
es: Además de :meth:`send`, hay otros dos nuevos métodos en los generadores:

source: ``throw(type, value=None, traceback=None)`` is used to raise an exception inside the generator; the exception is raised by the :keyword:`yield` expression where the generator's execution is paused.
es: ``throw(type, value=None, traceback=None)`` se utiliza para lanzar una excepción dentro del generador; la excepción es lanzada por la expresión :keyword:`yield` donde la ejecución del generador se pausa.

source: :meth:`close` raises a new :exc:`GeneratorExit` exception inside the generator to terminate the iteration. On receiving this exception, the generator's code must either raise :exc:`GeneratorExit` or :exc:`StopIteration`. Catching the :exc:`GeneratorExit` exception and returning a value is illegal and will trigger a :exc:`RuntimeError`; if the function raises some other exception, that exception is propagated to the caller. :meth:`close` will also be called by Python's garbage collector when the generator is garbage-collected.
es: :meth:`close` lanza una nueva excepción :exc:`GeneratorExit` dentro del generador para terminar la iteración. Al recibir esta excepción, el código del generador debe lanzar :exc:`GeneratorExit` o :exc:`StopIteration`. Capturar la excepción :exc:`GeneratorExit` y devolver un valor es ilegal y provocará un :exc:`RuntimeError`; si la función lanza alguna otra excepción, esa excepción se propaga a quien la llama. :meth:`close` también será llamado por el recolector de basura de Python cuando el generador sea recolectado.

source: If you need to run cleanup code when a :exc:`GeneratorExit` occurs, I suggest using a ``try: ... finally:`` suite instead of catching :exc:`GeneratorExit`.
es: Si necesitas ejecutar código de limpieza cuando se produce un :exc:`GeneratorExit`, te sugiero que utilices un conjunto ``try: ... finally:`` en lugar de atrapar :exc:`GeneratorExit`.

source: The cumulative effect of these changes is to turn generators from one-way producers of information into both producers and consumers.
es: El efecto acumulativo de estos cambios es que los generadores pasan de ser productores unidireccionales de información a ser tanto productores como consumidores.

source: Generators also become *coroutines*, a more generalized form of subroutines. Subroutines are entered at one point and exited at another point (the top of the function, and a :keyword:`return` statement), but coroutines can be entered, exited, and resumed at many different points (the :keyword:`yield` statements). We'll have to figure out patterns for using coroutines effectively in Python.
es: Los generadores también se convierten en *corutinas*, una forma más generalizada de subrutinas. Las subrutinas se introducen en un punto y se salen en otro (la parte superior de la función, y una declaración :keyword:`return`), pero las coroutines pueden introducirse, salirse y reanudarse en muchos puntos diferentes (las declaraciones :keyword:`yield`). Tendremos que descubrir patrones para usar coroutines de forma efectiva en Python.

source: The addition of the :meth:`close` method has one side effect that isn't obvious. :meth:`close` is called when a generator is garbage-collected, so this means the generator's code gets one last chance to run before the generator is destroyed. This last chance means that ``try...finally`` statements in generators can now be guaranteed to work; the :keyword:`finally` clause will now always get a chance to run. The syntactic restriction that you couldn't mix :keyword:`yield` statements with a ``try...finally`` suite has therefore been removed. This seems like a minor bit of language trivia, but using generators and ``try...finally`` is actually necessary in order to implement the :keyword:`with` statement described by :pep:`343`. I'll look at this new statement in the following section.
es: La adición del método :meth:`close` tiene un efecto secundario que no es obvio. :meth:`close` es llamado cuando un generador es recogido por la basura, lo que significa que el código del generador tiene una última oportunidad de ejecutarse antes de que el generador sea destruido. Esta última oportunidad significa que ahora se puede garantizar que las sentencias ``intentar...finalmente`` en los generadores funcionen; la cláusula :keyword:`finally` ahora siempre tendrá una oportunidad de ejecutarse. Por lo tanto, se ha eliminado la restricción sintáctica que impedía mezclar sentencias :keyword:`yield` con un conjunto ``try...finally``. Esto parece una trivialidad menor del lenguaje, pero el uso de generadores y ``try...finally`` es realmente necesario para implementar la sentencia :keyword:`with` descrita por :pep:`343`. Veré esta nueva sentencia en la siguiente sección.

source: Another even more esoteric effect of this change: previously, the :attr:`gi_frame` attribute of a generator was always a frame object. It's now possible for :attr:`gi_frame` to be ``None`` once the generator has been exhausted.
es: Otro efecto aún más esotérico de este cambio: antes, el atributo :attr:`gi_frame` de un generador era siempre un objeto frame. Ahora es posible que :attr:`gi_frame` sea ``None`` una vez que el generador se ha agotado.

source: :pep:`342` - Coroutines via Enhanced Generators
es: :pep:`342` - Coroutines mediante generadores mejorados

source: PEP written by Guido van Rossum and Phillip J. Eby; implemented by Phillip J. Eby. Includes examples of some fancier uses of generators as coroutines.
es: PEP escrito por Guido van Rossum y Phillip J. Eby; implementado por Phillip J. Eby. Incluye ejemplos de algunos usos más sofisticados de los generadores como coroutines.

source: Earlier versions of these features were proposed in :pep:`288` by Raymond Hettinger and :pep:`325` by Samuele Pedroni.
es: Versiones anteriores de estas características fueron propuestas en :pep:`288` por Raymond Hettinger y :pep:`325` por Samuele Pedroni.

source: The Wikipedia entry for coroutines.
es: La entrada de Wikipedia para las coroutines.

source: An explanation of coroutines from a Perl point of view, written by Dan Sugalski.
es: Una explicación de las coroutines desde el punto de vista de Perl, escrita por Dan Sugalski.

source: PEP 343: The 'with' statement
es: PEP 343: La declaración "con

source: The ':keyword:`with`' statement clarifies code that previously would use ``try...finally`` blocks to ensure that clean-up code is executed. In this section, I'll discuss the statement as it will commonly be used. In the next section, I'll examine the implementation details and show how to write objects for use with this statement.
es: La sentencia ':keyword:`with`' aclara el código que antes utilizaba bloques ``try...finally``' para asegurar que se ejecuta el código de limpieza. En esta sección, hablaré de la sentencia tal y como se utiliza habitualmente. En la siguiente sección, examinaré los detalles de la implementación y mostraré cómo escribir objetos para usar con esta sentencia.

source: The ':keyword:`with`' statement is a new control-flow structure whose basic structure is::
es: La declaración ':keyword:`with`' es una nueva estructura de flujo de control cuya estructura básica es::

source: The expression is evaluated, and it should result in an object that supports the context management protocol (that is, has :meth:`__enter__` and :meth:`__exit__` methods.
es: La expresión se evalúa y debe dar como resultado un objeto que soporte el protocolo de gestión de contextos (es decir, que tenga los métodos :meth:`__enter__` y :meth:`__exit__`).

source: The object's :meth:`__enter__` is called before *with-block* is executed and therefore can run set-up code. It also may return a value that is bound to the name *variable*, if given. (Note carefully that *variable* is *not* assigned the result of *expression*.)
es: El :meth:`__enter__` del objeto es llamado antes de que se ejecute *with-block* y por lo tanto puede ejecutar código de configuración. También puede devolver un valor ligado al nombre *variable*, si se da. (Observe cuidadosamente que a *variable* no se le asigna el resultado de la *expresión*)

source: After execution of the *with-block* is finished, the object's :meth:`__exit__` method is called, even if the block raised an exception, and can therefore run clean-up code.
es: Una vez finalizada la ejecución del *with-block*, se llama al método :meth:`__exit__` del objeto, incluso si el bloque lanzó una excepción, y por lo tanto puede ejecutar código de limpieza.

source: To enable the statement in Python 2.5, you need to add the following directive to your module::
es: Para habilitar la declaración en Python 2.5, debe añadir la siguiente directiva a su módulo::

source: The statement will always be enabled in Python 2.6.
es: La declaración siempre estará habilitada en Python 2.6.

source: Some standard Python objects now support the context management protocol and can be used with the ':keyword:`with`' statement. File objects are one example::
es: Algunos objetos estándar de Python soportan ahora el protocolo de gestión de contextos y pueden utilizarse con la sentencia ':keyword:`with`''. Los objetos de archivo son un ejemplo::

source: After this statement has executed, the file object in *f* will have been automatically closed, even if the :keyword:`for` loop raised an exception part-way through the block.
es: Después de que esta sentencia se haya ejecutado, el objeto archivo en *f* se habrá cerrado automáticamente, incluso si el bucle :keyword:`for` lanzó una excepción a mitad del bloque.

source: In this case, *f* is the same object created by :func:`open`, because :meth:`file.__enter__` returns *self*.
es: En este caso, *f* es el mismo objeto creado por :func:`open`, porque :meth:`file.__enter__` devuelve *self*.

source: The :mod:`threading` module's locks and condition variables also support the ':keyword:`with`' statement::
es: Los bloqueos y las variables de condición del módulo :mod:`threading` también soportan la sentencia ':keyword:`with`'::

source: The lock is acquired before the block is executed and always released once the block is complete.
es: El bloqueo se adquiere antes de que se ejecute el bloque y siempre se libera una vez que el bloque se ha completado.

source: The new :func:`localcontext` function in the :mod:`decimal` module makes it easy to save and restore the current decimal context, which encapsulates the desired precision and rounding characteristics for computations::
es: La nueva función :func:`localcontext` del módulo :mod:`decimal` facilita el guardado y la restauración del contexto decimal actual, que encapsula las características de precisión y redondeo deseadas para los cálculos::

source: Writing Context Managers
es: Redacción de Gestores de Contexto

source: Under the hood, the ':keyword:`with`' statement is fairly complicated. Most people will only use ':keyword:`!with`' in company with existing objects and don't need to know these details, so you can skip the rest of this section if you like. Authors of new objects will need to understand the details of the underlying implementation and should keep reading.
es: Bajo el capó, la sentencia ':keyword:`with`' es bastante complicada. La mayoría de la gente sólo utilizará ':keyword:`!with`' en compañía de objetos existentes y no necesita conocer estos detalles, así que puedes saltarte el resto de esta sección si quieres. Los autores de nuevos objetos necesitarán entender los detalles de la implementación subyacente y deberían seguir leyendo.

source: A high-level explanation of the context management protocol is:
es: Una explicación de alto nivel del protocolo de gestión del contexto es:

source: The expression is evaluated and should result in an object called a "context manager". The context manager must have :meth:`__enter__` and :meth:`__exit__` methods.
es: La expresión se evalúa y debe dar como resultado un objeto llamado "gestor de contexto". El gestor de contexto debe tener métodos :meth:`__enter__` y :meth:`__exit__`.
