Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: MacOS X: an :option:`!--enable-universalsdk` switch was added to the :program:`configure` script that compiles the interpreter as a universal binary able to run on both PowerPC and Intel processors. (Contributed by Ronald Oussoren; :issue:`2573`.)
es: MacOS X: se ha añadido una opción :option:`!--enable-universalsdk` al script :program:`configure` que compila el intérprete como un binario universal capaz de funcionar tanto en procesadores PowerPC como Intel. (Contribución de Ronald Oussoren; :issue:`2573`.)

source: Windows: :file:`.dll` is no longer supported as a filename extension for extension modules. :file:`.pyd` is now the only filename extension that will be searched for.
es: Windows: :file:`.dll` ya no se admite como extensión de nombre de archivo para los módulos de extensión. :file:`.pyd` es ahora la única extensión de nombre de archivo que se buscará.

source: Porting to Python 2.5
es: Adaptación a Python 2.5

source: This section lists previously described changes that may require changes to your code:
es: Esta sección enumera los cambios descritos anteriormente que pueden requerir cambios en su código:

source: ASCII is now the default encoding for modules. It's now a syntax error if a module contains string literals with 8-bit characters but doesn't have an encoding declaration. In Python 2.4 this triggered a warning, not a syntax error.
es: ASCII es ahora la codificación por defecto para los módulos. Ahora es un error de sintaxis si un módulo contiene literales de cadena con caracteres de 8 bits pero no tiene una declaración de codificación. En Python 2.4 esto provocaba una advertencia, no un error de sintaxis.

source: Previously, the :attr:`gi_frame` attribute of a generator was always a frame object. Because of the :pep:`342` changes described in section :ref:`pep-342`, it's now possible for :attr:`gi_frame` to be ``None``.
es: Anteriormente, el atributo :attr:`gi_frame` de un generador era siempre un objeto frame. Debido a los cambios de :pep:`342` descritos en la sección :ref:`pep-342`, ahora es posible que :attr:`gi_frame` sea ``None``.

source: A new warning, :class:`UnicodeWarning`, is triggered when you attempt to compare a Unicode string and an 8-bit string that can't be converted to Unicode using the default ASCII encoding. Previously such comparisons would raise a :class:`UnicodeDecodeError` exception.
es: Una nueva advertencia, :class:`UnicodeWarning`, se lanza cuando se intenta comparar una cadena Unicode y una cadena de 8 bits que no puede ser convertida a Unicode utilizando la codificación ASCII por defecto. Anteriormente estas comparaciones lanzaban una excepción :class:`UnicodeDecodeError`.

source: Library: the :mod:`csv` module is now stricter about multi-line quoted fields. If your files contain newlines embedded within fields, the input should be split into lines in a manner which preserves the newline characters.
es: Biblioteca: el módulo :mod:`csv` es ahora más estricto con los campos citados en varias líneas. Si sus archivos contienen nuevas líneas incrustadas dentro de los campos, la entrada debe dividirse en líneas de manera que se conserven los caracteres de nueva línea.

source: Library: the :mod:`locale` module's :func:`format` function's would previously accept any string as long as no more than one %char specifier appeared. In Python 2.5, the argument must be exactly one %char specifier with no surrounding text.
es: Biblioteca: la función :func:`format` del módulo :mod:`locale` aceptaba antes cualquier cadena siempre que no apareciera más de un especificador %char. En Python 2.5, el argumento debe ser exactamente un especificador %char sin texto alrededor.

source: Library: The :mod:`pickle` and :mod:`cPickle` modules no longer accept a return value of ``None`` from the :meth:`__reduce__` method; the method must return a tuple of arguments instead. The modules also no longer accept the deprecated *bin* keyword parameter.
es: Biblioteca: Los módulos :mod:`pickle` y :mod:`cPickle` ya no aceptan un valor de retorno de ``None`` del método :meth:`__reduce__`; el método debe devolver una tupla de argumentos. Los módulos tampoco aceptan ya el parámetro obsoleto de la palabra clave *bin*.

source: Library: The :mod:`SimpleXMLRPCServer` and :mod:`DocXMLRPCServer` classes now have a :attr:`rpc_paths` attribute that constrains XML-RPC operations to a limited set of URL paths; the default is to allow only ``'/'`` and ``'/RPC2'``. Setting :attr:`rpc_paths` to ``None`` or an empty tuple disables this path checking.
es: Biblioteca: Las clases :mod:`SimpleXMLRPCServer` y :mod:`DocXMLRPCServer` tienen ahora un atributo :attr:`rpc_paths` que restringe las operaciones XML-RPC a un conjunto limitado de rutas URL; por defecto sólo se permiten ``'/'`` y ``'/RPC2'``. Establecer :attr:`rpc_paths` como ``None`` o una tupla vacía desactiva esta comprobación de rutas.

source: C API: Many functions now use :c:type:`Py_ssize_t` instead of :c:expr:`int` to allow processing more data on 64-bit machines. Extension code may need to make the same change to avoid warnings and to support 64-bit machines. See the earlier section :ref:`pep-353` for a discussion of this change.
es: API de C: muchas funciones ahora usan :c:type:`Py_ssize_t` en lugar de :c:expr:`int` para permitir el procesamiento de más datos en máquinas de 64 bits. Es posible que el código de extensión deba realizar el mismo cambio para evitar advertencias y admitir máquinas de 64 bits. Consulte la sección anterior :ref:`pep-353` para obtener una explicación de este cambio.

source: C API: The obmalloc changes mean that you must be careful to not mix usage of the ``PyMem_*`` and ``PyObject_*`` families of functions. Memory allocated with one family's ``*_Malloc`` must be freed with the corresponding family's ``*_Free`` function.
es: API C: Los cambios en obmalloc significan que debe tener cuidado de no mezclar el uso de las familias de funciones ``PyMem_*`` y ``PyObject_*``. La memoria asignada con la función ``*_Malloc`` de una familia, debe ser liberada con la función ``*_Free`` de la familia correspondiente.

source: Acknowledgements
es: Agradecimientos

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Georg Brandl, Nick Coghlan, Phillip J. Eby, Lars Gustäbel, Raymond Hettinger, Ralf W. Grosse-Kunstleve, Kent Johnson, Iain Lowe, Martin von Löwis, Fredrik Lundh, Andrew McNamara, Skip Montanaro, Gustavo Niemeyer, Paul Prescod, James Pryor, Mike Rovner, Scott Weikart, Barry Warsaw, Thomas Wouters.
es: El autor desea agradecer a las siguientes personas sus sugerencias, correcciones y ayuda en varios borradores de este artículo: Georg Brandl, Nick Coghlan, Phillip J. Eby, Lars Gustäbel, Raymond Hettinger, Ralf W. Grosse-Kunstleve, Kent Johnson, Iain Lowe, Martin von Löwis, Fredrik Lundh, Andrew McNamara, Skip Montanaro, Gustavo Niemeyer, Paul Prescod, James Pryor, Mike Rovner, Scott Weikart, Barry Warsaw, Thomas Wouters.

source: universal newlines
es: nuevas líneas universales

source: What's new
es: Qué hay de nuevo
