Repository: python/python-docs-es
Catalog: whatsnew/2.5.po
Languages: es

source: The :mod:`socket` module now supports :const:`AF_NETLINK` sockets on Linux, thanks to a patch from Philippe Biondi. Netlink sockets are a Linux-specific mechanism for communications between a user-space process and kernel code; an introductory article about them is at https://www.linuxjournal.com/article/7356. In Python code, netlink addresses are represented as a tuple of 2 integers, ``(pid, group_mask)``.
es: El módulo :mod:`socket` ahora soporta sockets :const:`AF_NETLINK` en Linux, gracias a un parche de Philippe Biondi. Los sockets Netlink son un mecanismo específico de Linux para las comunicaciones entre un proceso en el espacio del usuario y el código del kernel; hay un artículo introductorio sobre ellos en https://www.linuxjournal.com/article/7356. En el código Python, las direcciones de netlink se representan como una tupla de 2 enteros, ``(pid, group_mask)``.

source: Two new methods on socket objects, ``recv_into(buffer)`` and ``recvfrom_into(buffer)``, store the received data in an object that supports the buffer protocol instead of returning the data as a string. This means you can put the data directly into an array or a memory-mapped file.
es: Dos nuevos métodos en objetos socket, ``recv_into(buffer)`` y ``recvrom_into(buffer)``, almacenan los datos recibidos en un objeto que soporta el protocolo de buffer en lugar de devolver los datos como una cadena. Esto significa que puedes poner los datos directamente en un array o en un archivo mapeado en memoria.

source: Socket objects also gained :meth:`getfamily`, :meth:`gettype`, and :meth:`getproto` accessor methods to retrieve the family, type, and protocol values for the socket.
es: Los objetos Socket también han ganado métodos de acceso :meth:`getfamily`, :meth:`gettype` y :meth:`getproto` para recuperar los valores de familia, tipo y protocolo del socket.

source: New module: the :mod:`spwd` module provides functions for accessing the shadow password database on systems that support shadow passwords.
es: Nuevo módulo: el módulo :mod:`spwd` proporciona funciones para acceder a la base de datos de contraseñas en la sombra en sistemas que soportan contraseñas en la sombra.

source: The :mod:`struct` is now faster because it compiles format strings into :class:`Struct` objects with :meth:`pack` and :meth:`unpack` methods. This is similar to how the :mod:`re` module lets you create compiled regular expression objects. You can still use the module-level :func:`pack` and :func:`unpack` functions; they'll create :class:`Struct` objects and cache them. Or you can use :class:`Struct` instances directly::
es: El módulo :mod:`struct` es ahora más rápido porque compila cadenas de formato en objetos :class:`Struct` con métodos :meth:`pack` y :meth:`unpack`. Esto es similar a cómo el módulo :mod:`re` permite crear objetos de expresión regular compilados. Puede seguir utilizando las funciones :func:`pack` y :func:`unpack` a nivel de módulo; éstas crearán objetos :class:`Struct` y los almacenarán en caché. O puede utilizar directamente las instancias de :class:`Struct`::

source: You can also pack and unpack data to and from buffer objects directly using the ``pack_into(buffer, offset, v1, v2, ...)`` and ``unpack_from(buffer, offset)`` methods. This lets you store data directly into an array or a memory-mapped file.
es: También puedes empaquetar y desempaquetar datos hacia y desde objetos buffer directamente usando los métodos ``pack_into(buffer, offset, v1, v2, ...)`` y ``unpack_from(buffer, offset)``. Esto te permite almacenar datos directamente en un array o en un archivo mapeado en memoria.

source: (:class:`Struct` objects were implemented by Bob Ippolito at the NeedForSpeed sprint. Support for buffer objects was added by Martin Blais, also at the NeedForSpeed sprint.)
es: (:class:`Struct` objects fueron implementados por Bob Ippolito en el sprint NeedForSpeed. El soporte para los objetos buffer fue añadido por Martin Blais, también en el sprint NeedForSpeed)

source: The Python developers switched from CVS to Subversion during the 2.5 development process. Information about the exact build version is available as the ``sys.subversion`` variable, a 3-tuple of ``(interpreter-name, branch-name, revision-range)``. For example, at the time of writing my copy of 2.5 was reporting ``('CPython', 'trunk', '45313:45315')``.
es: Los desarrolladores de Python cambiaron de CVS a Subversion durante el proceso de desarrollo de la versión 2.5. La información sobre la versión exacta de construcción está disponible como la variable ``sys.subversion``, una 3-tupla de ``(nombre del intérprete, nombre de la rama, rango de revisión)``. Por ejemplo, en el momento de escribir esto, mi copia de 2.5 informaba de ``('CPython', 'trunk', '45313:45315')``.

source: This information is also available to C extensions via the :c:func:`Py_GetBuildInfo` function that returns a string of build information like this: ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contributed by Barry Warsaw.)
es: Esta información también está disponible para las extensiones de C a través de la función :c:func:`Py_GetBuildInfo` que devuelve una cadena de información de compilación como esta ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contribuido por Barry Warsaw.)

source: Another new function, :func:`sys._current_frames`, returns the current stack frames for all running threads as a dictionary mapping thread identifiers to the topmost stack frame currently active in that thread at the time the function is called. (Contributed by Tim Peters.)
es: Otra nueva función, :func:`sys._current_frames`, devuelve los marcos de pila actuales para todos los hilos en ejecución como un diccionario que asigna los identificadores de los hilos al marco de pila superior actualmente activo en ese hilo en el momento en que se llama a la función. (Contribuido por Tim Peters.)

source: The :class:`TarFile` class in the :mod:`tarfile` module now has an :meth:`extractall` method that extracts all members from the archive into the current working directory. It's also possible to set a different directory as the extraction target, and to unpack only a subset of the archive's members.
es: La clase :class:`TarFile` del módulo :mod:`tarfile` tiene ahora un método :meth:`extractall` que extrae todos los miembros del archivo en el directorio de trabajo actual. También es posible establecer un directorio diferente como destino de la extracción, y desempaquetar sólo un subconjunto de los miembros del archivo.

source: The compression used for a tarfile opened in stream mode can now be autodetected using the mode ``'r|*'``. (Contributed by Lars Gustäbel.)
es: La compresión utilizada para un archivo tar abierto en modo stream puede ahora ser autodetectada utilizando el modo ``'r|*'``. (Contribución de Lars Gustäbel)

source: The :mod:`threading` module now lets you set the stack size used when new threads are created. The ``stack_size([*size*])`` function returns the currently configured stack size, and supplying the optional *size* parameter sets a new value. Not all platforms support changing the stack size, but Windows, POSIX threading, and OS/2 all do. (Contributed by Andrew MacIntyre.)
es: El módulo :mod:`threading` permite ahora establecer el tamaño de la pila utilizado cuando se crean nuevos hilos. La función ``stack_size([*size*])`` devuelve el tamaño de pila actualmente configurado, y suministrando el parámetro opcional *size* establece un nuevo valor. No todas las plataformas soportan el cambio del tamaño de la pila, pero Windows, POSIX threading y OS/2 lo hacen. (Contribución de Andrew MacIntyre)

source: The :mod:`unicodedata` module has been updated to use version 4.1.0 of the Unicode character database. Version 3.2.0 is required by some specifications, so it's still available as :data:`unicodedata.ucd_3_2_0`.
es: El módulo :mod:`unicodedata` ha sido actualizado para utilizar la versión 4.1.0 de la base de datos de caracteres Unicode. La versión 3.2.0 es requerida por algunas especificaciones, por lo que sigue estando disponible como :data:`unicodedata.ucd_3_2_0`.

source: New module: the :mod:`uuid` module generates universally unique identifiers (UUIDs) according to :rfc:`4122`. The RFC defines several different UUID versions that are generated from a starting string, from system properties, or purely randomly. This module contains a :class:`UUID` class and functions named :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, and :func:`uuid5` to generate different versions of UUID. (Version 2 UUIDs are not specified in :rfc:`4122` and are not supported by this module.) ::
es: Nuevo módulo: el módulo :mod:`uuid` genera identificadores únicos universales (UUID) de acuerdo con :rfc:`4122`. El RFC define varias versiones diferentes de UUID que se generan a partir de una cadena inicial, de propiedades del sistema o de forma puramente aleatoria. Este módulo contiene una clase :class:`UUID` y funciones llamadas :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, y :func:`uuid5` para generar diferentes versiones de UUID. (Los UUID de la versión 2 no se especifican en :rfc:`4122` y no están soportados por este módulo) ::

source: (Contributed by Ka-Ping Yee.)
es: (Contribución de Ka-Ping Yee.)

source: The :mod:`weakref` module's :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` types gained new methods for iterating over the weak references contained in the dictionary. :meth:`iterkeyrefs` and :meth:`keyrefs` methods were added to :class:`WeakKeyDictionary`, and :meth:`itervaluerefs` and :meth:`valuerefs` were added to :class:`WeakValueDictionary`. (Contributed by Fred L. Drake, Jr.)
es: Los tipos :mod:`weakref` del módulo :class:`WeakKeyDictionary` y :class:`WeakValueDictionary` han obtenido nuevos métodos para iterar sobre las referencias débiles contenidas en el diccionario. Se han añadido los métodos :meth:`iterkeyrefs` y :meth:`keyrefs` a :class:`WeakKeyDictionary`, y :meth:`itervaluerefs` y :meth:`valuerefs` a :class:`WeakValueDictionary`. (Contribución de Fred L. Drake, Jr.)

source: The :mod:`webbrowser` module received a number of enhancements. It's now usable as a script with ``python -m webbrowser``, taking a URL as the argument; there are a number of switches to control the behaviour (:option:`!-n` for a new browser window, :option:`!-t` for a new tab). New module-level functions, :func:`open_new` and :func:`open_new_tab`, were added to support this. The module's :func:`open` function supports an additional feature, an *autoraise* parameter that signals whether to raise the open window when possible. A number of additional browsers were added to the supported list such as Firefox, Opera, Konqueror, and elinks. (Contributed by Oleg Broytmann and Georg Brandl.)
es: El módulo :mod:`webbrowser` ha recibido una serie de mejoras. Ahora se puede utilizar como un script con ``python -m webbrowser``, tomando una URL como argumento; hay una serie de interruptores para controlar el comportamiento (:option:`!-n` para una nueva ventana del navegador, :option:`!-t` para una nueva pestaña). Se han añadido nuevas funciones a nivel de módulo, :func:`open_new` y :func:`open_new_tab`, para soportar esto. La función :func:`open` del módulo soporta una característica adicional, un parámetro *autoraise* que señala si se debe levantar la ventana abierta cuando sea posible. Se añadieron varios navegadores adicionales a la lista de soportados, como Firefox, Opera, Konqueror y elinks. (Contribución de Oleg Broytmann y Georg Brandl)

source: The :mod:`xmlrpclib` module now supports returning :class:`~datetime.datetime` objects for the XML-RPC date type. Supply ``use_datetime=True`` to the :func:`loads` function or the :class:`Unmarshaller` class to enable this feature. (Contributed by Skip Montanaro.)
es: El módulo :mod:`xmlrpclib` ahora soporta la devolución de objetos :class:`~datetime.datetime` para el tipo de fecha XML-RPC. Proporcione ``use_datetime=True`` a la función :func:`loads` o a la clase :class:`Unmarshaller` para activar esta característica. (Contribución de Skip Montanaro)

source: The :mod:`zipfile` module now supports the ZIP64 version of the format, meaning that a .zip archive can now be larger than 4 GiB and can contain individual files larger than 4 GiB. (Contributed by Ronald Oussoren.)
es: El módulo :mod:`zipfile` ahora soporta la versión ZIP64 del formato, lo que significa que un archivo .zip ahora puede ser mayor de 4 GiB y puede contener archivos individuales mayores de 4 GiB. (Contribución de Ronald Oussoren)

source: The :mod:`zlib` module's :class:`Compress` and :class:`Decompress` objects now support a :meth:`copy` method that makes a copy of the object's internal state and returns a new :class:`Compress` or :class:`Decompress` object. (Contributed by Chris AtLee.)
es: Los objetos :class:`zlib` y :class:`Decompress` del módulo :mod:`zlib` soportan ahora un método :meth:`copy` que realiza una copia del estado interno del objeto y devuelve un nuevo objeto :class:`Compress` o :class:`Decompress`. (Contribución de Chris AtLee)

source: The ctypes package
es: El paquete ctypes

source: The :mod:`ctypes` package, written by Thomas Heller, has been added to the standard library. :mod:`ctypes` lets you call arbitrary functions in shared libraries or DLLs. Long-time users may remember the :mod:`dl` module, which provides functions for loading shared libraries and calling functions in them. The :mod:`ctypes` package is much fancier.
es: El paquete :mod:`ctypes`, escrito por Thomas Heller, se ha añadido a la biblioteca estándar. :mod:`ctypes` permite llamar a funciones arbitrarias en bibliotecas compartidas o DLL. Los usuarios veteranos recordarán el módulo :mod:`dl`, que proporciona funciones para cargar bibliotecas compartidas y llamar a las funciones que contienen. El paquete :mod:`ctypes` es mucho más sofisticado.

source: To load a shared library or DLL, you must create an instance of the :class:`CDLL` class and provide the name or path of the shared library or DLL. Once that's done, you can call arbitrary functions by accessing them as attributes of the :class:`CDLL` object. ::
es: Para cargar una biblioteca compartida o DLL, debes crear una instancia de la clase :class:`CDLL` y proporcionar el nombre o la ruta de la biblioteca compartida o DLL. Una vez hecho esto, puedes llamar a funciones arbitrarias accediendo a ellas como atributos del objeto :class:`CDLL`. ::

source: Type constructors for the various C types are provided: :func:`c_int`, :func:`c_float`, :func:`c_double`, :func:`c_char_p` (equivalent to :c:expr:`char \*`), and so forth. Unlike Python's types, the C versions are all mutable; you can assign to their :attr:`value` attribute to change the wrapped value. Python integers and strings will be automatically converted to the corresponding C types, but for other types you must call the correct type constructor. (And I mean *must*; getting it wrong will often result in the interpreter crashing with a segmentation fault.)
es: Se proporcionan constructores de tipo para los distintos tipos de C: :func:`c_int`, :func:`c_float`, :func:`c_double`, :func:`c_char_p` (equivalente a :c:expr:`char \*` ), etcétera. A diferencia de los tipos de Python, las versiones C son todas mutables; puede asignar a su atributo :attr:`value` para cambiar el valor envuelto. Los enteros y las cadenas de Python se convertirán automáticamente a los tipos C correspondientes, pero para otros tipos debe llamar al constructor de tipo correcto. (Y me refiero a *debe*; hacerlo mal a menudo resultará en que el intérprete falle con una falla de segmentación).

source: You shouldn't use :func:`c_char_p` with a Python string when the C function will be modifying the memory area, because Python strings are supposed to be immutable; breaking this rule will cause puzzling bugs. When you need a modifiable memory area, use :func:`create_string_buffer`::
es: No debería usar :func:`c_char_p` con una cadena de Python cuando la función C vaya a modificar el área de memoria, porque se supone que las cadenas de Python son inmutables; romper esta regla causará errores desconcertantes. Cuando necesite un área de memoria modificable, utilice :func:`create_string_buffer`::

source: C functions are assumed to return integers, but you can set the :attr:`restype` attribute of the function object to change this::
es: Se supone que las funciones en C devuelven números enteros, pero se puede establecer el atributo :attr:`restype` del objeto de la función para cambiar esto::

source: :mod:`ctypes` also provides a wrapper for Python's C API as the ``ctypes.pythonapi`` object. This object does *not* release the global interpreter lock before calling a function, because the lock must be held when calling into the interpreter's code. There's a :class:`py_object()` type constructor that will create a :c:expr:`PyObject *` pointer. A simple usage::
es: :mod:`ctypes` también proporciona un contenedor para la API C de Python como objeto ``ctypes.pythonapi``. Este objeto *not* libera el bloqueo del intérprete global antes de llamar a una función, porque el bloqueo debe mantenerse cuando se llama al código del intérprete. Hay un constructor de tipo :class:`py_object()` que creará un puntero :c:expr:`PyObject *`. Un uso simple::

source: Don't forget to use :class:`py_object()`; if it's omitted you end up with a segmentation fault.
es: No olvides usar :class:`py_object()`; si se omite acabas con un fallo de segmentación.

source: :mod:`ctypes` has been around for a while, but people still write and distribution hand-coded extension modules because you can't rely on :mod:`ctypes` being present. Perhaps developers will begin to write Python wrappers atop a library accessed through :mod:`ctypes` instead of extension modules, now that :mod:`ctypes` is included with core Python.
es: :mod:`ctypes` existe desde hace tiempo, pero la gente sigue escribiendo y distribuyendo módulos de extensión codificados a mano porque no se puede confiar en que :mod:`ctypes` esté presente. Quizás los desarrolladores empiecen a escribir envoltorios de Python sobre una biblioteca a la que se accede a través de :mod:`ctypes` en lugar de módulos de extensión, ahora que :mod:`ctypes` está incluido en el núcleo de Python.

source: The pre-stdlib ctypes web page, with a tutorial, reference, and FAQ.
es: La página web pre-stdlib ctypes, con un tutorial, referencia y preguntas frecuentes.

source: The documentation for the :mod:`ctypes` module.
es: La documentación del módulo :mod:`ctypes`.

source: The ElementTree package
es: El paquete ElementTree

source: A subset of Fredrik Lundh's ElementTree library for processing XML has been added to the standard library as :mod:`xml.etree`. The available modules are :mod:`ElementTree`, :mod:`ElementPath`, and :mod:`ElementInclude` from ElementTree 1.2.6. The :mod:`cElementTree` accelerator module is also included.
es: Un subconjunto de la biblioteca ElementTree de Fredrik Lundh para el procesamiento de XML se ha añadido a la biblioteca estándar como :mod:`xml.etree`. Los módulos disponibles son :mod:`ElementTree`, :mod:`ElementPath` y :mod:`ElementInclude` de ElementTree 1.2.6. También se incluye el módulo acelerador :mod:`cElementTree`.

source: The rest of this section will provide a brief overview of using ElementTree. Full documentation for ElementTree is available at https://web.archive.org/web/20201124024954/http://effbot.org/zone/element-index.htm.
es: El resto de esta sección proporcionará una breve descripción general del uso de ElementTree. La documentación completa de ElementTree está disponible en https://web.archive.org/web/20201124024954/http://effbot.org/zone/element-index.htm.

source: ElementTree represents an XML document as a tree of element nodes. The text content of the document is stored as the :attr:`text` and :attr:`tail` attributes of (This is one of the major differences between ElementTree and the Document Object Model; in the DOM there are many different types of node, including :class:`TextNode`.)
es: ElementTree representa un documento XML como un árbol de nodos de elementos. El contenido de texto del documento se almacena como los atributos :attr:`text` y :attr:`tail` de (Esta es una de las principales diferencias entre ElementTree y el Modelo de Objetos del Documento; en el DOM hay muchos tipos diferentes de nodo, incluyendo :class:`TextNode`)

source: The most commonly used parsing function is :func:`parse`, that takes either a string (assumed to contain a filename) or a file-like object and returns an :class:`ElementTree` instance::
es: La función de análisis más utilizada es :func:`parse`, que toma una cadena (se supone que contiene un nombre de archivo) o un objeto similar a un archivo y devuelve una instancia de :class:`ElementTree`::

source: Once you have an :class:`ElementTree` instance, you can call its :meth:`getroot` method to get the root :class:`Element` node.
es: Una vez que tengas una instancia de :class:`ElementTree`, puedes llamar a su método :meth:`getroot` para obtener el nodo raíz de :class:`Element`.

source: There's also an :func:`XML` function that takes a string literal and returns an :class:`Element` node (not an :class:`ElementTree`). This function provides a tidy way to incorporate XML fragments, approaching the convenience of an XML literal::
es: También hay una función :func:`XML` que toma un literal de cadena y devuelve un nodo :class:`Element` (no un :class:`ElementTree`). Esta función proporciona una forma ordenada de incorporar fragmentos XML, acercándose a la comodidad de un literal XML::

source: Each XML element supports some dictionary-like and some list-like access methods. Dictionary-like operations are used to access attribute values, and list-like operations are used to access child nodes.
es: Cada elemento XML admite algunos métodos de acceso tipo diccionario y otros tipo lista. Las operaciones tipo diccionario se utilizan para acceder a los valores de los atributos, y las operaciones tipo lista se utilizan para acceder a los nodos hijos.

source: Operation
es: Operación

source: Result
es: Resultado

source: Returns n'th child element.
es: Devuelve el elemento hijo enésimo.

source: Returns list of m'th through n'th child elements.
es: Devuelve la lista de m's a n's elementos hijos.

source: Returns number of child elements.
es: Devuelve el número de elementos hijos.

source: ``list(elem)``
es: ``lista(elem)``

source: Returns list of child elements.
es: Devuelve la lista de elementos hijos.

source: Adds *elem2* as a child.
es: Añade *elemento2* como hijo.

source: Inserts *elem2* at the specified location.
es: Inserta *elemento2* en el lugar especificado.

source: Deletes n'th child element.
es: Elimina el elemento hijo enésimo.

source: Returns list of attribute names.
es: Devuelve la lista de nombres de atributos.

source: Returns value of attribute *name*.
es: Devuelve el valor del atributo *nombre*.

source: ``elem.set(name, value)``
es: ``elem.set(nombre, valor)``

source: Sets new value for attribute *name*.
es: Establece el nuevo valor del atributo *nombre*.

source: Retrieves the dictionary containing attributes.
es: Recupera el diccionario que contiene los atributos.

source: Deletes attribute *name*.
es: Borra el atributo *nombre*.

source: Comments and processing instructions are also represented as :class:`Element` nodes. To check if a node is a comment or processing instructions::
es: Los comentarios y las instrucciones de procesamiento también se representan como nodos :class:`Element`. Para comprobar si un nodo es un comentario o unas instrucciones de procesamiento::
