Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: A new calling convention tells :mod:`ctypes` to clear the ``errno`` or Win32 LastError variables at the outset of each wrapped call. (Implemented by Thomas Heller; :issue:`1798`.)
es: Una nueva convención de llamada indica a :mod:`ctypes` que borre las variables ``errno`` o Win32 LastError al inicio de cada llamada envuelta. (Implementado por Thomas Heller; :issue:`1798`.)

source: You can now retrieve the Unix ``errno`` variable after a function call. When creating a wrapped function, you can supply ``use_errno=True`` as a keyword parameter to the :func:`DLL` function and then call the module-level methods :meth:`set_errno` and :meth:`get_errno` to set and retrieve the error value.
es: Ahora puede recuperar la variable Unix ``errno`` después de una llamada a una función. Al crear una función envuelta, puede suministrar ``use_errno=True`` como parámetro de palabra clave a la función :func:`DLL` y luego llamar a los métodos de nivel de módulo :meth:`set_errno` y :meth:`get_errno` para establecer y recuperar el valor del error.

source: The Win32 LastError variable is similarly supported by the :func:`DLL`, :func:`OleDLL`, and :func:`WinDLL` functions. You supply ``use_last_error=True`` as a keyword parameter and then call the module-level methods :meth:`set_last_error` and :meth:`get_last_error`.
es: La variable Win32 LastError es soportada de forma similar por las funciones :func:`DLL`, :func:`OleDLL`, y :func:`WinDLL`. Se suministra ``use_last_error=True`` como parámetro de palabra clave y luego se llaman los métodos a nivel de módulo :meth:`set_last_error` y :meth:`get_last_error`.

source: The :func:`byref` function, used to retrieve a pointer to a ctypes instance, now has an optional *offset* parameter that is a byte count that will be added to the returned pointer.
es: La función :func:`byref`, utilizada para recuperar un puntero a una instancia de ctypes, tiene ahora un parámetro opcional *offset* que es un recuento de bytes que se añadirá al puntero devuelto.

source: Improved SSL Support
es: Mejora de la compatibilidad con SSL

source: Bill Janssen made extensive improvements to Python 2.6's support for the Secure Sockets Layer by adding a new module, :mod:`ssl`, that's built atop the `OpenSSL <https://www.openssl.org/>`__ library. This new module provides more control over the protocol negotiated, the X.509 certificates used, and has better support for writing SSL servers (as opposed to clients) in Python. The existing SSL support in the :mod:`socket` module hasn't been removed and continues to work, though it will be removed in Python 3.0.
es: Bill Janssen ha realizado amplias mejoras en el soporte de Python 2.6 para la Capa de Conexión Segura añadiendo un nuevo módulo, :mod:`ssl`, que está construido sobre la biblioteca `OpenSSL <https://www.openssl.org/>`__. Este nuevo módulo proporciona más control sobre el protocolo negociado, los certificados X.509 utilizados, y tiene un mejor soporte para escribir servidores SSL (a diferencia de los clientes) en Python. El soporte SSL existente en el módulo :mod:`socket` no ha sido eliminado y sigue funcionando, aunque será eliminado en Python 3.0.

source: To use the new module, you must first create a TCP connection in the usual way and then pass it to the :func:`ssl.wrap_socket` function. It's possible to specify whether a certificate is required, and to obtain certificate info by calling the :meth:`getpeercert` method.
es: Para utilizar el nuevo módulo, primero hay que crear una conexión TCP de la forma habitual y luego pasarla a la función :func:`ssl.wrap_socket`. Es posible especificar si se requiere un certificado, y obtener información sobre el mismo llamando al método :meth:`getpeercert`.

source: The documentation for the :mod:`ssl` module.
es: La documentación del módulo :mod:`ssl`.

source: Deprecations and Removals
es: Cancelaciones y eliminaciones

source: String exceptions have been removed. Attempting to use them raises a :exc:`TypeError`.
es: Se han eliminado las excepciones de cadena. Al intentar utilizarlas se produce un :exc:`TypeError`.

source: Changes to the :class:`Exception` interface as dictated by :pep:`352` continue to be made. For 2.6, the :attr:`message` attribute is being deprecated in favor of the :attr:`args` attribute.
es: Los cambios en la interfaz :class:`Exception` dictados por :pep:`352` siguen realizándose. En la versión 2.6, el atributo :attr:`message` queda obsoleto en favor del atributo :attr:`args`.

source: (3.0-warning mode) Python 3.0 will feature a reorganized standard library that will drop many outdated modules and rename others. Python 2.6 running in 3.0-warning mode will warn about these modules when they are imported.
es: (modo 3.0-warning) Python 3.0 presentará una biblioteca estándar reorganizada que eliminará muchos módulos obsoletos y renombrará otros. Python 2.6 funcionando en modo 3.0-warning avisará de estos módulos cuando se importen.

source: The list of deprecated modules is: :mod:`audiodev`, :mod:`bgenlocations`, :mod:`buildtools`, :mod:`bundlebuilder`, :mod:`Canvas`, :mod:`compiler`, :mod:`dircache`, :mod:`dl`, :mod:`fpformat`, :mod:`gensuitemodule`, :mod:`ihooks`, :mod:`imageop`, :mod:`imgfile`, :mod:`linuxaudiodev`, :mod:`mhlib`, :mod:`mimetools`, :mod:`multifile`, :mod:`new`, :mod:`pure`, :mod:`statvfs`, :mod:`sunaudiodev`, :mod:`test.testall`, and :mod:`toaiff`.
es: La lista de módulos obsoletos es: :mod:`audiodev`, :mod:`bgenlocations`, :mod:`buildtools`, :mod:`bundlebuilder`, :mod:`Canvas`, :mod:`compiler`, :mod:`dircache`, :mod:`dl`, :mod:`fpformat`, :mod:`gensuitemodule`, :mod:`ihooks`, :mod:`imageop`, :mod:`imgfile`, :mod:`linuxaudiodev`, :mod:`mhlib`, :mod:`mimetools`, :mod:`multifile`, :mod:`new`, :mod:`pure`, :mod:`statvfs`, :mod:`sunaudiodev`, :mod:`test.testall`, y :mod:`toaiff`.

source: The :mod:`gopherlib` module has been removed.
es: El módulo :mod:`gopherlib` ha sido eliminado.

source: The :mod:`MimeWriter` module and :mod:`mimify` module have been deprecated; use the :mod:`email` package instead.
es: El módulo :mod:`MimeWriter` y el módulo :mod:`mimify` han quedado obsoletos; utilice en su lugar el paquete :mod:`email`.

source: The :mod:`md5` module has been deprecated; use the :mod:`hashlib` module instead.
es: El módulo :mod:`md5` ha quedado obsoleto; utilice en su lugar el módulo :mod:`hashlib`.

source: The :mod:`posixfile` module has been deprecated; :func:`fcntl.lockf` provides better locking.
es: El módulo :mod:`posixfile` ha quedado obsoleto; :func:`fcntl.lockf` proporciona un mejor bloqueo.

source: The :mod:`popen2` module has been deprecated; use the :mod:`subprocess` module.
es: El módulo :mod:`popen2` ha quedado obsoleto; utilice el módulo :mod:`subprocess`.

source: The :mod:`rgbimg` module has been removed.
es: Se ha eliminado el módulo :mod:`rgbimg`.

source: The :mod:`sets` module has been deprecated; it's better to use the built-in :class:`set` and :class:`frozenset` types.
es: El módulo :mod:`sets` ha quedado obsoleto; es mejor utilizar los tipos incorporados :class:`set` y :class:`frozenset`.

source: The :mod:`sha` module has been deprecated; use the :mod:`hashlib` module instead.
es: El módulo :mod:`sha` ha quedado obsoleto; utilice en su lugar el módulo :mod:`hashlib`.

source: Build and C API Changes
es: Cambios en la API de construcción y C

source: Changes to Python's build process and to the C API include:
es: Los cambios en el proceso de construcción de Python y en la API de C incluyen:

source: Python now must be compiled with C89 compilers (after 19 years!). This means that the Python source tree has dropped its own implementations of :c:func:`!memmove` and :c:func:`!strerror`, which are in the C89 standard library.
es: Python ahora debe ser compilado con compiladores C89 (¡después de 19 años!). Esto significa que el árbol de fuentes de Python ha abandonado sus propias implementaciones de :c:func:`!memmove` y :c:func:`!strerror`, que están en la biblioteca estándar de C89.

source: Python 2.6 can be built with Microsoft Visual Studio 2008 (version 9.0), and this is the new default compiler. See the :file:`PCbuild` directory for the build files. (Implemented by Christian Heimes.)
es: Python 2.6 puede ser construido con Microsoft Visual Studio 2008 (versión 9.0), y este es el nuevo compilador por defecto. Ver el directorio :file:`PCbuild` para los archivos de construcción. (Implementado por Christian Heimes)

source: On Mac OS X, Python 2.6 can be compiled as a 4-way universal build. The :program:`configure` script can take a :option:`!--with-universal-archs=[32-bit|64-bit|all]` switch, controlling whether the binaries are built for 32-bit architectures (x86, PowerPC), 64-bit (x86-64 and PPC-64), or both. (Contributed by Ronald Oussoren.)
es: En Mac OS X, Python 2.6 puede ser compilado como una construcción universal de 4 vías. El script :program:`configure` puede tomar una opción :`!--with-universal-archs=[32-bit|64-bit|all]`, controlando si los binarios se construyen para arquitecturas de 32 bits (x86, PowerPC), 64 bits (x86-64 y PPC-64), o ambas. (Contribución de Ronald Oussoren)

source: The BerkeleyDB module now has a C API object, available as ``bsddb.db.api``. This object can be used by other C extensions that wish to use the :mod:`bsddb` module for their own purposes. (Contributed by Duncan Grisby.)
es: El módulo BerkeleyDB tiene ahora un objeto C API, disponible como ``bsddb.db.api``. Este objeto puede ser utilizado por otras extensiones de C que deseen utilizar el módulo :mod:`bsddb` para sus propios fines. (Contribución de Duncan Grisby)

source: The new buffer interface, previously described in `the PEP 3118 section <#pep-3118-revised-buffer-protocol>`__, adds :c:func:`PyObject_GetBuffer` and :c:func:`PyBuffer_Release`, as well as a few other functions.
es: La nueva interfaz del buffer, descrita previamente en `la sección PEP 3118 <#pep-3118-revised-buffer-protocol>`__, añade :c:func:`PyObject_GetBuffer` y :c:func:`PyBuffer_Release`, así como algunas otras funciones.

source: Python's use of the C stdio library is now thread-safe, or at least as thread-safe as the underlying library is. A long-standing potential bug occurred if one thread closed a file object while another thread was reading from or writing to the object. In 2.6 file objects have a reference count, manipulated by the :c:func:`!PyFile_IncUseCount` and :c:func:`!PyFile_DecUseCount` functions. File objects can't be closed unless the reference count is zero. :c:func:`!PyFile_IncUseCount` should be called while the GIL is still held, before carrying out an I/O operation using the ``FILE *`` pointer, and :c:func:`!PyFile_DecUseCount` should be called immediately after the GIL is re-acquired. (Contributed by Antoine Pitrou and Gregory P. Smith.)
es: El uso que hace Python de la biblioteca stdio de C es ahora seguro para los hilos, o al menos tan seguro como la biblioteca subyacente. Un error potencial de larga data ocurría si un hilo cerraba un objeto de archivo mientras otro hilo estaba leyendo o escribiendo en el objeto. En la versión 2.6 los objetos archivo tienen un contador de referencias, manipulado por las funciones :c:func:`!PyFile_IncUseCount` y :c:func:`!PyFile_DecUseCount`. Los objetos de archivo no pueden cerrarse a menos que el recuento de referencias sea cero. :c:func:`!PyFile_IncUseCount` debe llamarse mientras se mantiene el GIL, antes de realizar una operación de E/S utilizando el puntero ``FILE *``, y :c:func:`!PyFile_DecUseCount` debe llamarse inmediatamente después de recuperar el GIL. (Contribución de Antoine Pitrou y Gregory P. Smith)

source: Importing modules simultaneously in two different threads no longer deadlocks; it will now raise an :exc:`ImportError`. A new API function, :c:func:`PyImport_ImportModuleNoBlock`, will look for a module in ``sys.modules`` first, then try to import it after acquiring an import lock. If the import lock is held by another thread, an :exc:`ImportError` is raised. (Contributed by Christian Heimes.)
es: Importar módulos simultáneamente en dos hilos diferentes ya no se bloquea; ahora lanzará un :exc:`ImportError`. Una nueva función de la API, :c:func:`PyImport_ImportModuleNoBlock`, buscará un módulo en ``sys.modules`` primero, y luego intentará importarlo después de adquirir un bloqueo de importación. Si el bloqueo de importación está en manos de otro hilo, se genera un :exc:`ImportError`. (Contribuido por Christian Heimes.)

source: Several functions return information about the platform's floating-point support. :c:func:`PyFloat_GetMax` returns the maximum representable floating point value, and :c:func:`PyFloat_GetMin` returns the minimum positive value. :c:func:`PyFloat_GetInfo` returns an object containing more information from the :file:`float.h` file, such as ``"mant_dig"`` (number of digits in the mantissa), ``"epsilon"`` (smallest difference between 1.0 and the next largest value representable), and several others. (Contributed by Christian Heimes; :issue:`1534`.)
es: Varias funciones devuelven información sobre el soporte de punto flotante de la plataforma. :c:func:`PyFloat_GetMax` devuelve el máximo valor de punto flotante representable, y :c:func:`PyFloat_GetMin` devuelve el mínimo valor positivo. :c:func:`PyFloat_GetInfo` devuelve un objeto que contiene más información del fichero :file:`float.h`, como ``"mant_dig"`` (número de dígitos en la mantisa), ``"epsilon"`` (diferencia más pequeña entre 1.0 y el siguiente valor más grande representable), y varios otros. (Contribución de Christian Heimes; :issue:`1534`.)

source: C functions and methods that use :c:func:`PyComplex_AsCComplex` will now accept arguments that have a :meth:`__complex__` method. In particular, the functions in the :mod:`cmath` module will now accept objects with this method. This is a backport of a Python 3.0 change. (Contributed by Mark Dickinson; :issue:`1675423`.)
es: Las funciones y métodos de C que utilizan :c:func:`PyComplex_AsCComplex` ahora aceptarán argumentos que tengan un método :meth:`__complex__`. En particular, las funciones del módulo :mod:`cmath` ahora aceptarán objetos con este método. Este es un retroceso de un cambio en Python 3.0. (Contribuido por Mark Dickinson; :issue:`1675423`.)

source: Python's C API now includes two functions for case-insensitive string comparisons, ``PyOS_stricmp(char*, char*)`` and ``PyOS_strnicmp(char*, char*, Py_ssize_t)``. (Contributed by Christian Heimes; :issue:`1635`.)
es: La API de C de Python incluye ahora dos funciones para comparar cadenas sin distinción de mayúsculas y minúsculas, ``PyOS_stricmp(char*, char*)`` y ``PyOS_strnicmp(char*, char*, Py_ssize_t)``. (Contribución de Christian Heimes; :issue:`1635`.)

source: Many C extensions define their own little macro for adding integers and strings to the module's dictionary in the ``init*`` function. Python 2.6 finally defines standard macros for adding values to a module, :c:macro:`PyModule_AddStringMacro` and :c:macro:`PyModule_AddIntMacro()`. (Contributed by Christian Heimes.)
es: Muchas extensiones de C definen su propia macro para añadir enteros y cadenas al diccionario del módulo en la función ``init*``. Python 2.6 finalmente define macros estándar para añadir valores a un módulo, :c:macro:`PyModule_AddStringMacro` y :c:macro:`PyModule_AddIntMacro()`. (Contribución de Christian Heimes.)

source: Some macros were renamed in both 3.0 and 2.6 to make it clearer that they are macros, not functions. :c:macro:`!Py_Size()` became :c:macro:`Py_SIZE()`, :c:macro:`!Py_Type()` became :c:macro:`Py_TYPE()`, and :c:macro:`!Py_Refcnt()` became :c:macro:`Py_REFCNT()`. The mixed-case macros are still available in Python 2.6 for backward compatibility. (:issue:`1629`)
es: Algunas macros han sido renombradas tanto en la 3.0 como en la 2.6 para dejar más claro que son macros y no funciones. :c:macro:`!Py_Size()` se convierte en :c:macro:`Py_SIZE()`, :c:macro:`!Py_Type()` se convierte en :c:macro:`Py_TYPE()`, y :c:macro:`!Py_Refcnt()` se convierte en :c:macro:`Py_REFCNT()`. Las macros de mayúsculas y minúsculas siguen estando disponibles en Python 2.6 por compatibilidad con versiones anteriores. (:issue:`1629`)

source: Distutils now places C extensions it builds in a different directory when running on a debug version of Python. (Contributed by Collin Winter; :issue:`1530959`.)
es: Distutils ahora coloca las extensiones C que construye en un directorio diferente cuando se ejecuta en una versión de depuración de Python. (Contribución de Collin Winter; :issue:`1530959`.)

source: Several basic data types, such as integers and strings, maintain internal free lists of objects that can be re-used. The data structures for these free lists now follow a naming convention: the variable is always named ``free_list``, the counter is always named ``numfree``, and a macro ``Py<typename>_MAXFREELIST`` is always defined.
es: Varios tipos de datos básicos, como los enteros y las cadenas, mantienen listas internas de objetos libres que pueden reutilizarse. Las estructuras de datos para estas listas libres siguen ahora una convención de nomenclatura: la variable se llama siempre ``free_list``, el contador se llama siempre ``numfree``, y siempre se define una macro ``Py<typename>_MAXFREELIST``

source: A new Makefile target, "make patchcheck", prepares the Python source tree for making a patch: it fixes trailing whitespace in all modified ``.py`` files, checks whether the documentation has been changed, and reports whether the :file:`Misc/ACKS` and :file:`Misc/NEWS` files have been updated. (Contributed by Brett Cannon.)
es: Un nuevo objetivo de Makefile, "make patchcheck", prepara el árbol de fuentes de Python para hacer un parche: corrige los espacios en blanco al final de todos los archivos ``.py`` modificados, comprueba si la documentación ha sido cambiada, e informa si los archivos :file:`Misc/ACKS` y :file:`Misc/NEWS` han sido actualizados. (Contribuido por Brett Cannon.)

source: Another new target, "make profile-opt", compiles a Python binary using GCC's profile-guided optimization. It compiles Python with profiling enabled, runs the test suite to obtain a set of profiling results, and then compiles using these results for optimization. (Contributed by Gregory P. Smith.)
es: Otro nuevo objetivo, "make profile-opt", compila un binario de Python utilizando la optimización guiada por perfiles de GCC. Compila Python con el perfil habilitado, ejecuta el conjunto de pruebas para obtener un conjunto de resultados de perfil, y luego compila usando estos resultados para la optimización. (Contribución de Gregory P. Smith)

source: Port-Specific Changes: Windows
es: Cambios específicos en los puertos: Windows

source: The support for Windows 95, 98, ME and NT4 has been dropped. Python 2.6 requires at least Windows 2000 SP4.
es: Se ha eliminado el soporte para Windows 95, 98, ME y NT4. Python 2.6 requiere al menos Windows 2000 SP4.

source: The new default compiler on Windows is Visual Studio 2008 (version 9.0). The build directories for Visual Studio 2003 (version 7.1) and 2005 (version 8.0) were moved into the PC/ directory. The new :file:`PCbuild` directory supports cross compilation for X64, debug builds and Profile Guided Optimization (PGO). PGO builds are roughly 10% faster than normal builds. (Contributed by Christian Heimes with help from Amaury Forgeot d'Arc and Martin von Löwis.)
es: El nuevo compilador por defecto en Windows es Visual Studio 2008 (versión 9.0). Los directorios de compilación para Visual Studio 2003 (versión 7.1) y 2005 (versión 8.0) se han trasladado al directorio PC/. El nuevo directorio :file:`PCbuild` admite la compilación cruzada para X64, las compilaciones de depuración y la optimización guiada por perfil (PGO). Las compilaciones PGO son aproximadamente un 10% f más rápidas que las normales. (Contribuido por Christian Heimes con la ayuda de Amaury Forgeot d'Arc y Martin von Löwis)

source: The :mod:`msvcrt` module now supports both the normal and wide char variants of the console I/O API. The :func:`getwch` function reads a keypress and returns a Unicode value, as does the :func:`getwche` function. The :func:`putwch` function takes a Unicode character and writes it to the console. (Contributed by Christian Heimes.)
es: El módulo :mod:`msvcrt` soporta ahora las variantes normal y wide char de la API de E/S de la consola. La función :func:`getwch` lee una pulsación de tecla y devuelve un valor Unicode, al igual que la función :func:`getwche`. La función :func:`putwch` toma un carácter Unicode y lo escribe en la consola. (Contribución de Christian Heimes)

source: :func:`os.path.expandvars` will now expand environment variables in the form "%var%", and "~user" will be expanded into the user's home directory path. (Contributed by Josiah Carlson; :issue:`957650`.)
es: :func:`os.path.expandvars` ahora expandirá las variables de entorno de la forma "%var%", y "~user" se expandirá en la ruta del directorio personal del usuario. (Contribución de Josiah Carlson; :issue:`957650`.)

source: The :mod:`socket` module's socket objects now have an :meth:`ioctl` method that provides a limited interface to the :c:func:`WSAIoctl` system interface.
es: Los objetos socket del módulo :mod:`socket` tienen ahora un método :meth:`ioctl` que proporciona una interfaz limitada a la interfaz del sistema :c:func:`WSAIoctl`.

source: The :mod:`_winreg` module now has a function, :func:`ExpandEnvironmentStrings`, that expands environment variable references such as ``%NAME%`` in an input string. The handle objects provided by this module now support the context protocol, so they can be used in :keyword:`with` statements. (Contributed by Christian Heimes.)
es: El módulo :mod:`_winreg` tiene ahora una función, :func:`ExpandEnvironmentStrings`, que expande las referencias a variables de entorno como ``%NAME%`` en una cadena de entrada. Los objetos handle proporcionados por este módulo ahora soportan el protocolo de contexto, por lo que pueden ser utilizados en sentencias :keyword:`with`. (Contribuido por Christian Heimes.)

source: :mod:`_winreg` also has better support for x64 systems, exposing the :func:`DisableReflectionKey`, :func:`EnableReflectionKey`, and :func:`QueryReflectionKey` functions, which enable and disable registry reflection for 32-bit processes running on 64-bit systems. (:issue:`1753245`)
es: :mod:`_winreg` también tiene un mejor soporte para los sistemas x64, exponiendo las funciones :func:`DisableReflectionKey`, :func:`EnableReflectionKey`, y :func:`QueryReflectionKey`, que habilitan y deshabilitan la reflexión del registro para los procesos de 32 bits que se ejecutan en sistemas de 64 bits. (:issue:`1753245`)

source: The :mod:`msilib` module's :class:`Record` object gained :meth:`GetInteger` and :meth:`GetString` methods that return field values as an integer or a string. (Contributed by Floris Bruynooghe; :issue:`2125`.)
es: El objeto :class:`Record` del módulo :mod:`msilib` ha ganado los métodos :meth:`GetInteger` y :meth:`GetString` que devuelven los valores de los campos como un entero o una cadena. (Contribución de Floris Bruynooghe; :issue:`2125`.)

source: Port-Specific Changes: Mac OS X
es: Cambios específicos en los puertos: Mac OS X

source: When compiling a framework build of Python, you can now specify the framework name to be used by providing the :option:`!--with-framework-name=` option to the :program:`configure` script.
es: Cuando se compila una estructura de Python, ahora se puede especificar el nombre de la estructura que se utilizará proporcionando la opción :option:`!--with-framework-name=` al script :program:`configure`.
