Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: What's New in Python 2.6
es: Qué hay de nuevo en Python 2.6

source: Author
es: Autor

source: A.M. Kuchling (amk at amk.ca)
es: A.M. Kuchling (amk arroba amk.ca)

source: This article explains the new features in Python 2.6, released on October 1, 2008. The release schedule is described in :pep:`361`.
es: Este artículo explica las nuevas funciones de Python 2.6, publicadas el 1 de octubre de 2008. El programa de publicación se describe en :pep:`361`.

source: The major theme of Python 2.6 is preparing the migration path to Python 3.0, a major redesign of the language. Whenever possible, Python 2.6 incorporates new features and syntax from 3.0 while remaining compatible with existing code by not removing older features or syntax. When it's not possible to do that, Python 2.6 tries to do what it can, adding compatibility functions in a :mod:`future_builtins` module and a :option:`!-3` switch to warn about usages that will become unsupported in 3.0.
es: El tema principal de Python 2.6 es preparar el camino de migración a Python 3.0, un importante rediseño del lenguaje. Siempre que sea posible, Python 2.6 incorpora nuevas características y sintaxis de 3.0 mientras sigue siendo compatible con el código existente al no eliminar características o sintaxis más antiguas. Cuando no es posible hacer eso, Python 2.6 intenta hacer lo que puede, agregando funciones de compatibilidad en el módulo :mod:`future_builtins` y un interruptor :option:`!-3` para advertir sobre usos que dejarán de ser compatibles en 3.0 .

source: Some significant new packages have been added to the standard library, such as the :mod:`multiprocessing` and :mod:`json` modules, but there aren't many new features that aren't related to Python 3.0 in some way.
es: Se han agregado algunos paquetes nuevos importantes a la biblioteca estándar, como los módulos :mod:`multiprocessing` y :mod:`json`, pero no hay muchas características nuevas que no estén relacionadas con Python 3.0 de alguna manera.

source: Python 2.6 also sees a number of improvements and bugfixes throughout the source. A search through the change logs finds there were 259 patches applied and 612 bugs fixed between Python 2.5 and 2.6. Both figures are likely to be underestimates.
es: Python 2.6 también incluye una serie de mejoras y correcciones de errores en el código fuente. Una búsqueda en los registros de cambios encuentra que se aplicaron 259 parches y se corrigieron 612 errores entre Python 2.5 y 2.6. Es probable que ambas cifras estén subestimadas.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.6. If you want to understand the rationale for the design and implementation, refer to the PEP for a particular new feature. Whenever possible, "What's New in Python" links to the bug/patch item for each change.
es: Este artículo no intenta proporcionar una especificación completa de las nuevas características, sino que proporciona una conveniente descripción general. Para obtener detalles completos, debe consultar la documentación de Python 2.6. Si desea comprender la justificación del diseño y la implementación, consulte el PEP de una característica nueva en particular. Siempre que sea posible, "Qué hay de nuevo en Python" enlaza con el elemento de error / parche para cada cambio.

source: The development cycle for Python versions 2.6 and 3.0 was synchronized, with the alpha and beta releases for both versions being made on the same days. The development of 3.0 has influenced many features in 2.6.
es: El ciclo de desarrollo de las versiones 2.6 y 3.0 de Python se sincronizó, y las versiones alfa y beta de ambos lanzamientos se realizaron los mismos días. El desarrollo de 3.0 ha influido en muchas características de 2.6.

source: Python 3.0 is a far-ranging redesign of Python that breaks compatibility with the 2.x series. This means that existing Python code will need some conversion in order to run on Python 3.0. However, not all the changes in 3.0 necessarily break compatibility. In cases where new features won't cause existing code to break, they've been backported to 2.6 and are described in this document in the appropriate place. Some of the 3.0-derived features are:
es: Python 3.0 es un rediseño de Python de gran alcance que rompe la compatibilidad con la serie 2.x. Esto significa que el código Python existente necesitará alguna conversión para poder ejecutarse en Python 3.0. Sin embargo, no todos los cambios en 3.0 rompen necesariamente la compatibilidad. En los casos en que las nuevas funciones no provoquen la rotura del código existente, se han actualizado a 2.6 y se describen en este documento en el lugar correspondiente. Algunas de las características derivadas de 3.0 son:

source: A :meth:`__complex__` method for converting objects to a complex number.
es: El método :meth:`__complex__` para convertir objetos en un número complejo.

source: Alternate syntax for catching exceptions: ``except TypeError as exc``.
es: Sintaxis alternativa para detectar excepciones: ``except TypeError as exc``.

source: The addition of :func:`functools.reduce` as a synonym for the built-in :func:`reduce` function.
es: La adición de :func:`functools.reduce` como sinónimo de la función incorporada :func:`reduce`.

source: Python 3.0 adds several new built-in functions and changes the semantics of some existing builtins. Functions that are new in 3.0 such as :func:`bin` have simply been added to Python 2.6, but existing builtins haven't been changed; instead, the :mod:`future_builtins` module has versions with the new 3.0 semantics. Code written to be compatible with 3.0 can do ``from future_builtins import hex, map`` as necessary.
es: Python 3.0 agrega varias funciones integradas nuevas y cambia la semántica de algunas integradas existentes. Las funciones que son nuevas en 3.0 como :func:`bin` simplemente se han agregado a Python 2.6, pero las funciones existentes no se han cambiado; en cambio, el módulo :mod:`future_builtins` tiene versiones con la nueva semántica 3.0. El código escrito puede ser compatible con 3.0 haciendo ``from future_builtins import hex, map`` según sea necesario.

source: A new command-line switch, :option:`!-3`, enables warnings about features that will be removed in Python 3.0. You can run code with this switch to see how much work will be necessary to port code to 3.0. The value of this switch is available to Python code as the boolean variable :data:`sys.py3kwarning`, and to C extension code as :c:data:`Py_Py3kWarningFlag`.
es: Un nuevo modificador de línea de comandos, :option:`!-3`, habilita advertencias sobre características que se eliminarán en Python 3.0. Puede ejecutar código con este modificador para ver cuánto trabajo será necesario para migrar el código a 3.0. El valor de este modificador está disponible para el código Python como la variable booleana :data:`sys.py3kwarning`, y para el código de extensión C como :c:data:`Py_Py3kWarningFlag`.

source: The 3\ *xxx* series of PEPs, which contains proposals for Python 3.0. :pep:`3000` describes the development process for Python 3.0. Start with :pep:`3100` that describes the general goals for Python 3.0, and then explore the higher-numbered PEPS that propose specific features.
es: Las series 3xxx de PEP, que contienen propuestas para Python 3.0. :pep:`3000` describe el proceso de desarrollo de Python 3.0. Empiece con :pep:`3100` que describe los objetivos generales de Python 3.0, y luego explore los PEPS con números más altos que proponen características específicas.

source: Changes to the Development Process
es: Cambios en el proceso de desarrollo

source: While 2.6 was being developed, the Python development process underwent two significant changes: we switched from SourceForge's issue tracker to a customized Roundup installation, and the documentation was converted from LaTeX to reStructuredText.
es: Mientras se desarrollaba 2.6, el proceso de desarrollo de Python experimentó dos cambios significativos: cambiamos del seguidor de incidentes (*issue tracker*) de SourceForge a una instalación personalizada de Roundup, y la documentación se convirtió de LaTeX a reStructuredText.

source: New Issue Tracker: Roundup
es: Nuevo seguidor de incidentes: Roundup

source: For a long time, the Python developers had been growing increasingly annoyed by SourceForge's bug tracker. SourceForge's hosted solution doesn't permit much customization; for example, it wasn't possible to customize the life cycle of issues.
es: Durante mucho tiempo, los desarrolladores de Python estaban cada vez más molestos por el seguidor de errores de SourceForge. La solución alojada en SourceForge no permite mucha personalización; por ejemplo, no fue posible personalizar el ciclo de vida de los problemas.

source: The infrastructure committee of the Python Software Foundation therefore posted a call for issue trackers, asking volunteers to set up different products and import some of the bugs and patches from SourceForge. Four different trackers were examined: `Jira <https://www.atlassian.com/software/jira/>`__, `Launchpad <https://launchpad.net/>`__, `Roundup <https://roundup.sourceforge.io/>`__, and `Trac <https://trac.edgewall.org/>`__. The committee eventually settled on Jira and Roundup as the two candidates. Jira is a commercial product that offers no-cost hosted instances to free-software projects; Roundup is an open-source project that requires volunteers to administer it and a server to host it.
es: Por lo tanto, el comité de infraestructura de la Python Software Foundation publicó una convocatoria de rastreadores de problemas, solicitando voluntarios para configurar diferentes productos e importar algunos de los errores y parches de SourceForge. Se examinaron cuatro rastreadores diferentes: `Jira <https://www.atlassian.com/software/jira/>`__, `Launchpad <https://launchpad.net/>`__, `Roundup <https://roundup.sourceforge.io/>`__ y `Trac <https://trac.edgewall.org/>`__. El comité finalmente se decidió por Jira y Roundup como los dos candidatos. Jira es un producto comercial que ofrece instancias alojadas sin costo para proyectos de software libre; Roundup es un proyecto de código abierto que requiere voluntarios para administrarlo y un servidor para alojarlo.

source: After posting a call for volunteers, a new Roundup installation was set up at https://bugs.python.org. One installation of Roundup can host multiple trackers, and this server now also hosts issue trackers for Jython and for the Python web site. It will surely find other uses in the future. Where possible, this edition of "What's New in Python" links to the bug/patch item for each change.
es: Después de publicar una llamada para voluntarios, se configuró una nueva instalación de Roundup en https://bugs.python.org. Una instalación de Roundup puede alojar varios seguidores, y este servidor ahora también aloja seguidores de problemas para Jython y para el sitio web de Python. Seguramente encontrará otros usos en el futuro. Siempre que sea posible, esta edición de "Qué hay de nuevo en Python" se vincula al elemento de error/parche para cada cambio.

source: Hosting of the Python bug tracker is kindly provided by `Upfront Systems <https://upfrontsoftware.co.za>`__ of Stellenbosch, South Africa. Martin von Löwis put a lot of effort into importing existing bugs and patches from SourceForge; his scripts for this import operation are at ``https://svn.python.org/view/tracker/importer/`` and may be useful to other projects wishing to move from SourceForge to Roundup.
es: `Upfront Systems <https://upfrontsoftware.co.za>`__ de Stellenbosch, Sudáfrica, proporciona amablemente el alojamiento del rastreador de errores de Python. Martin von Löwis se esforzó mucho en importar errores y parches existentes desde SourceForge; Sus scripts para esta operación de importación están en ``https://svn.python.org/view/tracker/importer/`` y pueden ser útiles para otros proyectos que deseen pasar de SourceForge a Roundup.

source: The Python bug tracker.
es: El seguidor de errores de Python.

source: The Jython bug tracker.
es: El seguidor de errores de Jython.

source: Roundup downloads and documentation.
es: Descargas y documentación de Roundup.

source: Martin von Löwis's conversion scripts.
es: Scripts de conversión de Martin von Löwis.

source: New Documentation Format: reStructuredText Using Sphinx
es: Nuevo formato de documentación: texto reestructurado con Sphinx

source: The Python documentation was written using LaTeX since the project started around 1989. In the 1980s and early 1990s, most documentation was printed out for later study, not viewed online. LaTeX was widely used because it provided attractive printed output while remaining straightforward to write once the basic rules of the markup were learned.
es: La documentación de Python se escribió usando LaTeX desde que el proyecto comenzó alrededor de 1989. En la década de 1980 y principios de la de 1990, la mayor parte de la documentación se imprimió para su estudio posterior, no se vio en línea. LaTeX fue ampliamente utilizado porque proporcionaba una salida impresa atractiva sin dejar de ser sencillo de escribir una vez que se aprendían las reglas básicas de marcado.

source: Today LaTeX is still used for writing publications destined for printing, but the landscape for programming tools has shifted. We no longer print out reams of documentation; instead, we browse through it online and HTML has become the most important format to support. Unfortunately, converting LaTeX to HTML is fairly complicated and Fred L. Drake Jr., the long-time Python documentation editor, spent a lot of time maintaining the conversion process. Occasionally people would suggest converting the documentation into SGML and later XML, but performing a good conversion is a major task and no one ever committed the time required to finish the job.
es: Hoy en día, LaTeX todavía se usa para escribir publicaciones destinadas a la impresión, pero el panorama de las herramientas de programación ha cambiado. Ya no imprimimos montones de documentación; en su lugar, lo navegamos en línea y HTML se ha convertido en el formato más importante para dar soporte. Desafortunadamente, convertir LaTeX a HTML es bastante complicado y Fred L. Drake Jr., el editor de documentación de Python desde hace mucho tiempo, pasó mucho tiempo manteniendo el proceso de conversión. De vez en cuando, la gente sugeriría convertir la documentación a SGML y luego a XML, pero realizar una buena conversión es una tarea importante y nadie comprometió el tiempo necesario para terminar el trabajo.

source: During the 2.6 development cycle, Georg Brandl put a lot of effort into building a new toolchain for processing the documentation. The resulting package is called Sphinx, and is available from https://www.sphinx-doc.org/.
es: Durante el ciclo de desarrollo 2.6, Georg Brandl se esforzó mucho en construir una nueva cadena de herramientas para procesar la documentación. El paquete resultante se llama Sphinx y está disponible en https://www.sphinx-doc.org/.

source: Sphinx concentrates on HTML output, producing attractively styled and modern HTML; printed output is still supported through conversion to LaTeX. The input format is reStructuredText, a markup syntax supporting custom extensions and directives that is commonly used in the Python community.
es: Sphinx se concentra en la salida HTML, produciendo HTML moderno y con un estilo atractivo; la salida impresa todavía se admite mediante la conversión a LaTeX. El formato de entrada es reStructuredText, una sintaxis de marcado que admite extensiones y directivas personalizadas que se usa comúnmente en la comunidad de Python.

source: Sphinx is a standalone package that can be used for writing, and almost two dozen other projects (`listed on the Sphinx web site <https://www.sphinx-doc.org/en/master/examples.html>`__) have adopted Sphinx as their documentation tool.
es: Sphinx es un paquete independiente que se puede usar para escribir, y casi dos docenas de otros proyectos (`enumerados en el sitio web de Sphinx <https://www.sphinx-doc.org/en/master/examples.html>`__) han adoptado Sphinx como su herramienta de documentación.

source: `Documenting Python <https://devguide.python.org/documenting/>`__
es: `Documentando Python <https://devguide.python.org/documenting/>`__

source: Describes how to write for Python's documentation.
es: Describe cómo escribir para la documentación de Python.

source: Documentation and code for the Sphinx toolchain.
es: Documentación y código para la cadena de herramientas Sphinx.

source: The underlying reStructuredText parser and toolset.
es: El analizador sintáctico y el conjunto de herramientas *reStructuredText* subyacentes.

source: PEP 343: The 'with' statement
es: PEP 343: La sentencia *'with'*

source: The previous version, Python 2.5, added the ':keyword:`with`' statement as an optional feature, to be enabled by a ``from __future__ import with_statement`` directive. In 2.6 the statement no longer needs to be specially enabled; this means that :keyword:`!with` is now always a keyword. The rest of this section is a copy of the corresponding section from the "What's New in Python 2.5" document; if you're familiar with the ':keyword:`!with`' statement from Python 2.5, you can skip this section.
es: La versión anterior, Python 2.5, agregó la instrucción ':keyword:`with`' como una característica opcional, para ser habilitada por una directiva ``from __future__ import with_statement``. En 2.6, la instrucción ya no necesita estar habilitada especialmente; esto significa que ahora :keyword:`!with` es siempre una palabra clave. El resto de esta sección es una copia de la sección correspondiente del documento "Qué hay de nuevo en Python 2.5"; si está familiarizado con la declaración ':keyword:`!with`' de Python 2.5, puede omitir esta sección.

source: The ':keyword:`with`' statement clarifies code that previously would use ``try...finally`` blocks to ensure that clean-up code is executed. In this section, I'll discuss the statement as it will commonly be used. In the next section, I'll examine the implementation details and show how to write objects for use with this statement.
es: La sentencia ':keyword:`with`' resuelve el código que anteriormente usaría bloques ``try...finally`` para garantizar que el código de limpieza se ejecute. En esta sección, discutiré como se usará comúnmente la declaración. En la siguiente sección, examinaré los detalles de la implementación y mostraré cómo escribir objetos para usar con esta declaración.

source: The ':keyword:`with`' statement is a control-flow structure whose basic structure is::
es: La sentencia ':keyword:`with`' es una estructura de control de flujo cuya estructura básica es::

source: The expression is evaluated, and it should result in an object that supports the context management protocol (that is, has :meth:`__enter__` and :meth:`__exit__` methods).
es: La expresión se evalúa y debe dar como resultado un objeto que admita el protocolo de administración de contexto (es decir, tiene los métodos :meth:`__enter__` y :meth:`__exit__`).

source: The object's :meth:`__enter__` is called before *with-block* is executed and therefore can run set-up code. It also may return a value that is bound to the name *variable*, if given. (Note carefully that *variable* is *not* assigned the result of *expression*.)
es: El objeto :meth:`__enter__` se llama antes de que se ejecute *with-block* y, por lo tanto, se puede ejecutar código de configuración. También, si se proporciona, puede retornar un valor que esté vinculado al nombre *variable*. (Tenga en cuenta que a la *variable* *no* se le asigna el resultado de la *expression*).

source: After execution of the *with-block* is finished, the object's :meth:`__exit__` method is called, even if the block raised an exception, and can therefore run clean-up code.
es: Una vez finalizada la ejecución de *with-block*, se llama al método :meth:`__exit__` del objeto, incluso si el bloque generó una excepción y, por lo tanto, puede ejecutar código de limpieza.

source: Some standard Python objects now support the context management protocol and can be used with the ':keyword:`with`' statement. File objects are one example::
es: Algunos objetos estándar de Python ahora admiten el protocolo de administración de contexto y se pueden usar con la sentencia ':keyword:`with`'. Los objetos de archivo son un ejemplo::

source: After this statement has executed, the file object in *f* will have been automatically closed, even if the :keyword:`for` loop raised an exception part-way through the block.
es: Después de que se haya ejecutado esta sentencia, el objeto de archivo en *f* se habrá cerrado automáticamente, incluso si el bucle :keyword:`for` generó una excepción en la mitad del bloque.

source: In this case, *f* is the same object created by :func:`open`, because :meth:`file.__enter__` returns *self*.
es: En este caso, *f* es el mismo objeto creado por :func:`open`, porque :meth:`file.__enter__` retorna *self*.

source: The :mod:`threading` module's locks and condition variables also support the ':keyword:`with`' statement::
es: Los *locks* y las condiciones variables del módulo :mod:`threading` también admiten la sentencia ':keyword:`with`'::

source: The lock is acquired before the block is executed and always released once the block is complete.
es: El *lock* se adquiere antes de que se ejecute el bloque y siempre se libera una vez que este se completa.

source: The :func:`localcontext` function in the :mod:`decimal` module makes it easy to save and restore the current decimal context, which encapsulates the desired precision and rounding characteristics for computations::
es: La función :func:`localcontext` en el módulo :mod:`decimal` facilita guardar y restaurar el contexto decimal actual, que encapsula la precisión deseada y las características de redondeo para los cálculos::

source: Writing Context Managers
es: Escribiendo gestores de contexto

source: Under the hood, the ':keyword:`with`' statement is fairly complicated. Most people will only use ':keyword:`!with`' in company with existing objects and don't need to know these details, so you can skip the rest of this section if you like. Authors of new objects will need to understand the details of the underlying implementation and should keep reading.
es: Por detrás, la sentencia ':keyword:`with`' es bastante complicada. La mayoría de las personas solo usarán ':keyword:`!with`' en compañía de objetos existentes y no necesitan conocer estos detalles, por lo que puede omitir el resto de esta sección si lo desea. Los autores de nuevos objetos deberán comprender los detalles de la implementación subyacente y deben seguir leyendo.

source: A high-level explanation of the context management protocol is:
es: Una explicación de alto nivel del protocolo de gestor de contexto es:

source: The expression is evaluated and should result in an object called a "context manager". The context manager must have :meth:`__enter__` and :meth:`__exit__` methods.
es: La expresión se evalúa y debería dar como resultado un objeto llamado "gestor de contexto". El gestor de contexto debe tener los métodos :meth:`__enter__` y :meth:`__exit__`.

source: The context manager's :meth:`__enter__` method is called. The value returned is assigned to *VAR*. If no ``as VAR`` clause is present, the value is simply discarded.
es: Se llama al método :meth:`__enter__` del gestor de contexto. El valor retornado se asigna a *VAR*. Si no hay una cláusula ``as VAR``, el valor simplemente se descarta.

source: The code in *BLOCK* is executed.
es: Se ejecuta el código en *BLOCK*.
