Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: The :func:`pdb.post_mortem` function, used to begin debugging a traceback, will now use the traceback returned by :func:`sys.exc_info` if no traceback is supplied. (Contributed by Facundo Batista; :issue:`1106316`.)
es: La función :func:`pdb.post_mortem`, utilizada para iniciar la depuración de un traceback, utilizará ahora el traceback devuelto por :func:`sys.exc_info` si no se suministra ningún traceback. (Contribuido por Facundo Batista; :issue:`1106316`.)

source: The :mod:`pickletools` module now has an :func:`optimize` function that takes a string containing a pickle and removes some unused opcodes, returning a shorter pickle that contains the same data structure. (Contributed by Raymond Hettinger.)
es: El módulo :mod:`pickletools` tiene ahora una función :func:`optimize` que toma una cadena que contiene un pickle y elimina algunos opcodes no utilizados, devolviendo un pickle más corto que contiene la misma estructura de datos. (Contribución de Raymond Hettinger)

source: A :func:`get_data` function was added to the :mod:`pkgutil` module that returns the contents of resource files included with an installed Python package. For example::
es: Se ha añadido una función :func:`get_data` al módulo :mod:`pkgutil` que devuelve el contenido de los archivos de recursos incluidos con un paquete Python instalado. Por ejemplo::

source: (Contributed by Paul Moore; :issue:`2439`.)
es: (Contribución de Paul Moore; :issue:`2439`.)

source: The :mod:`pyexpat` module's :class:`Parser` objects now allow setting their :attr:`buffer_size` attribute to change the size of the buffer used to hold character data. (Contributed by Achim Gaedke; :issue:`1137`.)
es: Los objetos :mod:`pyexpat` del módulo :class:`Parser` permiten ahora establecer su atributo :attr:`buffer_size` para cambiar el tamaño del buffer utilizado para mantener los datos de caracteres. (Contribución de Achim Gaedke; :issue:`1137`.)

source: The :mod:`Queue` module now provides queue variants that retrieve entries in different orders. The :class:`PriorityQueue` class stores queued items in a heap and retrieves them in priority order, and :class:`LifoQueue` retrieves the most recently added entries first, meaning that it behaves like a stack. (Contributed by Raymond Hettinger.)
es: El módulo :mod:`Queue` proporciona ahora variantes de colas que recuperan las entradas en diferentes órdenes. La clase :class:`PriorityQueue` almacena los elementos en cola en un montón y los recupera en orden de prioridad, y :class:`LifoQueue` recupera primero las entradas añadidas más recientemente, lo que significa que se comporta como una pila. (Contribución de Raymond Hettinger)

source: The :mod:`random` module's :class:`Random` objects can now be pickled on a 32-bit system and unpickled on a 64-bit system, and vice versa. Unfortunately, this change also means that Python 2.6's :class:`Random` objects can't be unpickled correctly on earlier versions of Python. (Contributed by Shawn Ligocki; :issue:`1727780`.)
es: Los objetos :class:`Random` del módulo :mod:`random` ahora pueden ser decapados en un sistema de 32 bits y desempaquetados en un sistema de 64 bits, y viceversa. Desafortunadamente, este cambio también significa que los objetos :class:`Random` de Python 2.6 no pueden ser desempaquetados correctamente en versiones anteriores de Python. (Contribuido por Shawn Ligocki; :issue:`1727780`.)

source: The new ``triangular(low, high, mode)`` function returns random numbers following a triangular distribution. The returned values are between *low* and *high*, not including *high* itself, and with *mode* as the most frequently occurring value in the distribution. (Contributed by Wladmir van der Laan and Raymond Hettinger; :issue:`1681432`.)
es: La nueva función ``triangular(low, high, mode)`` devuelve números aleatorios siguiendo una distribución triangular. Los valores devueltos están entre *bajos* y *altos*, sin incluir los propios *altos*, y con *modo* como valor más frecuente en la distribución. (Contribución de Wladmir van der Laan y Raymond Hettinger; :issue:`1681432`.)

source: Long regular expression searches carried out by the :mod:`re` module will check for signals being delivered, so time-consuming searches can now be interrupted. (Contributed by Josh Hoyt and Ralf Schmitt; :issue:`846388`.)
es: Las búsquedas de expresiones regulares largas llevadas a cabo por el módulo :mod:`re` comprobarán la entrega de señales, por lo que ahora se pueden interrumpir las búsquedas que consumen mucho tiempo. (Contribución de Josh Hoyt y Ralf Schmitt; :issue:`846388`.)

source: The regular expression module is implemented by compiling bytecodes for a tiny regex-specific virtual machine. Untrusted code could create malicious strings of bytecode directly and cause crashes, so Python 2.6 includes a verifier for the regex bytecode. (Contributed by Guido van Rossum from work for Google App Engine; :issue:`3487`.)
es: El módulo de expresiones regulares se implementa compilando bytecodes para una pequeña máquina virtual específica de regex. El código no fiable podría crear cadenas maliciosas de código de bytes directamente y causar caídas, por lo que Python 2.6 incluye un verificador para el código de bytes regex. (Contribuido por Guido van Rossum del trabajo para Google App Engine; :issue:`3487`.)

source: The :mod:`rlcompleter` module's :meth:`Completer.complete()` method will now ignore exceptions triggered while evaluating a name. (Fixed by Lorenz Quack; :issue:`2250`.)
es: El método :meth:`Completer.complete()` del módulo :mod:`rlcompleter` ahora ignorará las excepciones que se produzcan al evaluar un nombre. (Corregido por Lorenz Quack; :issue:`2250`.)

source: The :mod:`sched` module's :class:`scheduler` instances now have a read-only :attr:`queue` attribute that returns the contents of the scheduler's queue, represented as a list of named tuples with the fields ``(time, priority, action, argument)``. (Contributed by Raymond Hettinger; :issue:`1861`.)
es: Las instancias :mod:`sched` del módulo :class:`scheduler` tienen ahora un atributo :attr:`queue` de sólo lectura que devuelve el contenido de la cola del planificador, representado como una lista de tuplas con nombre con los campos ``(tiempo, prioridad, acción, argumento)``. (Contribución de Raymond Hettinger; :issue:`1861`.)

source: The :mod:`select` module now has wrapper functions for the Linux :c:func:`!epoll` and BSD :c:func:`!kqueue` system calls. :meth:`modify` method was added to the existing :class:`poll` objects; ``pollobj.modify(fd, eventmask)`` takes a file descriptor or file object and an event mask, modifying the recorded event mask for that file. (Contributed by Christian Heimes; :issue:`1657`.)
es: El módulo :mod:`select` tiene ahora funciones de envoltura para las llamadas al sistema Linux :c:func:`!epoll` y BSD :c:func:`!kqueue`. Se ha añadido el método :meth:`modify` a los objetos :class:`poll` existentes; ``pollobj.modify(fd, eventmask)`` toma un descriptor de fichero o un objeto de fichero y una máscara de evento, modificando la máscara de evento registrada para ese fichero. (Contribución de Christian Heimes; :issue:`1657`.)

source: The :func:`shutil.copytree` function now has an optional *ignore* argument that takes a callable object. This callable will receive each directory path and a list of the directory's contents, and returns a list of names that will be ignored, not copied.
es: La función :func:`shutil.copytree` tiene ahora un argumento opcional *ignore* que toma un objeto callable. Esta llamada recibirá cada ruta de directorio y una lista del contenido del directorio, y devuelve una lista de nombres que serán ignorados, no copiados.

source: The :mod:`shutil` module also provides an :func:`ignore_patterns` function for use with this new parameter. :func:`ignore_patterns` takes an arbitrary number of glob-style patterns and returns a callable that will ignore any files and directories that match any of these patterns. The following example copies a directory tree, but skips both :file:`.svn` directories and Emacs backup files, which have names ending with '~'::
es: El módulo :mod:`shutil` también proporciona una función :func:`ignore_patterns` para su uso con este nuevo parámetro. :func:`ignore_patterns` toma un número arbitrario de patrones de estilo glob y devuelve una llamada que ignorará cualquier archivo o directorio que coincida con cualquiera de estos patrones. El siguiente ejemplo copia un árbol de directorios, pero omite los directorios :file:`.svn` y los ficheros de copia de seguridad de Emacs, que tienen nombres que terminan en '~'::

source: (Contributed by Tarek Ziadé; :issue:`2663`.)
es: (Contribución de Tarek Ziadé; :issue:`2663`.)

source: Integrating signal handling with GUI handling event loops like those used by Tkinter or GTk+ has long been a problem; most software ends up polling, waking up every fraction of a second to check if any GUI events have occurred. The :mod:`signal` module can now make this more efficient. Calling ``signal.set_wakeup_fd(fd)`` sets a file descriptor to be used; when a signal is received, a byte is written to that file descriptor. There's also a C-level function, :c:func:`PySignal_SetWakeupFd`, for setting the descriptor.
es: Integrar el manejo de señales con los bucles de eventos de manejo de la interfaz gráfica de usuario (GUI), como los utilizados por Tkinter o GTk+, ha sido durante mucho tiempo un problema; la mayoría del software acaba sondeando, despertando cada fracción de segundo para comprobar si se ha producido algún evento de la GUI. El módulo :mod:`signal` puede ahora hacer esto más eficiente. Llamando a ``signal.set_wakeup_fd(fd)`` se establece un descriptor de fichero a utilizar; cuando se recibe una señal, se escribe un byte en ese descriptor de fichero. También hay una función en C, :c:func:`PySignal_SetWakeupFd`, para establecer el descriptor.

source: Event loops will use this by opening a pipe to create two descriptors, one for reading and one for writing. The writable descriptor will be passed to :func:`set_wakeup_fd`, and the readable descriptor will be added to the list of descriptors monitored by the event loop via :c:func:`!select` or :c:func:`!poll`. On receiving a signal, a byte will be written and the main event loop will be woken up, avoiding the need to poll.
es: Los bucles de eventos utilizarán esto abriendo una tubería para crear dos descriptores, uno de lectura y otro de escritura. El descriptor de escritura se pasará a :func:`set_wakeup_fd`, y el descriptor de lectura se añadirá a la lista de descriptores monitorizados por el bucle de eventos mediante :c:func:`!select` o :c:func:`!poll`. Al recibir una señal, se escribirá un byte y se despertará el bucle de eventos principal, evitando la necesidad de hacer un sondeo.

source: (Contributed by Adam Olsen; :issue:`1583`.)
es: (Contribución de Adam Olsen; :issue:`1583`.)

source: The :func:`siginterrupt` function is now available from Python code, and allows changing whether signals can interrupt system calls or not. (Contributed by Ralf Schmitt.)
es: La función :func:`siginterrupt` está ahora disponible desde el código Python, y permite cambiar si las señales pueden interrumpir las llamadas al sistema o no. (Contribución de Ralf Schmitt)

source: The :func:`setitimer` and :func:`getitimer` functions have also been added (where they're available). :func:`setitimer` allows setting interval timers that will cause a signal to be delivered to the process after a specified time, measured in wall-clock time, consumed process time, or combined process+system time. (Contributed by Guilherme Polo; :issue:`2240`.)
es: También se han añadido las funciones :func:`setitimer` y :func:`getitimer` (cuando están disponibles). :func:`setitimer` permite establecer temporizadores de intervalo que harán que se entregue una señal al proceso después de un tiempo especificado, medido en tiempo de reloj de pared, tiempo de proceso consumido, o tiempo combinado de proceso+sistema. (Contribuido por Guilherme Polo; :issue:`2240`.)

source: The :mod:`smtplib` module now supports SMTP over SSL thanks to the addition of the :class:`SMTP_SSL` class. This class supports an interface identical to the existing :class:`SMTP` class. (Contributed by Monty Taylor.) Both class constructors also have an optional ``timeout`` parameter that specifies a timeout for the initial connection attempt, measured in seconds. (Contributed by Facundo Batista.)
es: El módulo :mod:`smtplib` ahora soporta SMTP sobre SSL gracias a la adición de la clase :class:`SMTP_SSL`. Esta clase soporta una interfaz idéntica a la clase :class:`SMTP` existente. (Contribuido por Monty Taylor.) Ambos constructores de la clase también tienen un parámetro opcional ``timeout`` que especifica un tiempo de espera para el intento de conexión inicial, medido en segundos. (Contribuido por Facundo Batista.)

source: An implementation of the LMTP protocol (:rfc:`2033`) was also added to the module. LMTP is used in place of SMTP when transferring e-mail between agents that don't manage a mail queue. (LMTP implemented by Leif Hedstrom; :issue:`957003`.)
es: También se ha añadido al módulo una implementación del protocolo LMTP (:rfc:`2033`). LMTP se utiliza en lugar de SMTP cuando se transfiere correo electrónico entre agentes que no gestionan una cola de correo. (LMTP implementado por Leif Hedstrom; :issue:`957003`.)

source: :meth:`SMTP.starttls` now complies with :rfc:`3207` and forgets any knowledge obtained from the server not obtained from the TLS negotiation itself. (Patch contributed by Bill Fenner; :issue:`829951`.)
es: :meth:`SMTP.starttls` ahora cumple con :rfc:`3207` y olvida cualquier conocimiento obtenido del servidor que no se haya obtenido de la propia negociación TLS. (Parche aportado por Bill Fenner; :issue:`829951`.)

source: The :mod:`socket` module now supports TIPC (https://tipc.sourceforge.net/), a high-performance non-IP-based protocol designed for use in clustered environments. TIPC addresses are 4- or 5-tuples. (Contributed by Alberto Bertogli; :issue:`1646`.)
es: El módulo :mod:`socket` soporta ahora TIPC (http://tipc.sourceforge.net/), un protocolo de alto rendimiento no basado en IP y diseñado para su uso en entornos agrupados. Las direcciones TIPC son de 4 o 5 tuplas. (Contribución de Alberto Bertogli; :issue:`1646`.)

source: A new function, :func:`create_connection`, takes an address and connects to it using an optional timeout value, returning the connected socket object. This function also looks up the address's type and connects to it using IPv4 or IPv6 as appropriate. Changing your code to use :func:`create_connection` instead of ``socket(socket.AF_INET, ...)`` may be all that's required to make your code work with IPv6.
es: Una nueva función, :func:`create_connection`, toma una dirección y se conecta a ella utilizando un valor opcional de tiempo de espera, devolviendo el objeto socket conectado. Esta función también busca el tipo de dirección y se conecta a ella usando IPv4 o IPv6 según sea el caso. Cambiar su código para usar :func:`create_connection` en lugar de ``socket(socket.AF_INET, ...)`` puede ser todo lo que se necesita para que su código funcione con IPv6.

source: The base classes in the :mod:`SocketServer` module now support calling a :meth:`handle_timeout` method after a span of inactivity specified by the server's :attr:`timeout` attribute. (Contributed by Michael Pomraning.) The :meth:`serve_forever` method now takes an optional poll interval measured in seconds, controlling how often the server will check for a shutdown request. (Contributed by Pedro Werneck and Jeffrey Yasskin; :issue:`742598`, :issue:`1193577`.)
es: Las clases base del módulo :mod:`SocketServer` ahora soportan la llamada a un método :meth:`handle_timeout` después de un periodo de inactividad especificado por el atributo :attr:`timeout` del servidor. (Contribuido por Michael Pomraning.) El método :meth:`serve_forever` ahora toma un intervalo de sondeo opcional medido en segundos, controlando la frecuencia con la que el servidor comprobará si hay una solicitud de cierre. (Contribuido por Pedro Werneck y Jeffrey Yasskin; :issue:`742598`, :issue:`1193577`.)

source: The :mod:`sqlite3` module, maintained by Gerhard Häring, has been updated from version 2.3.2 in Python 2.5 to version 2.4.1.
es: El módulo :mod:`sqlite3`, mantenido por Gerhard Häring, ha sido actualizado de la versión 2.3.2 en Python 2.5 a la versión 2.4.1.

source: The :mod:`struct` module now supports the C99 :c:expr:`_Bool` type, using the format character ``'?'``. (Contributed by David Remahl.)
es: El módulo :mod:`struct` ahora admite el tipo C99 :c:expr:`_Bool`, utilizando el carácter de formato ``'?'``. (Aportado por David Remahl.)

source: The :class:`Popen` objects provided by the :mod:`subprocess` module now have :meth:`terminate`, :meth:`kill`, and :meth:`send_signal` methods. On Windows, :meth:`send_signal` only supports the :const:`SIGTERM` signal, and all these methods are aliases for the Win32 API function :c:func:`TerminateProcess`. (Contributed by Christian Heimes.)
es: Los objetos :class:`Popen` proporcionados por el módulo :mod:`subprocess` tienen ahora métodos :meth:`terminate`, :meth:`kill` y :meth:`send_signal`. En Windows, :meth:`send_signal` sólo soporta la señal :const:`SIGTERM`, y todos estos métodos son alias de la función de la API Win32 :c:func:`TerminateProcess`. (Contribuido por Christian Heimes.)

source: A new variable in the :mod:`sys` module, :attr:`float_info`, is an object containing information derived from the :file:`float.h` file about the platform's floating-point support. Attributes of this object include :attr:`mant_dig` (number of digits in the mantissa), :attr:`epsilon` (smallest difference between 1.0 and the next largest value representable), and several others. (Contributed by Christian Heimes; :issue:`1534`.)
es: Una nueva variable en el módulo :mod:`sys`, :attr:`float_info`, es un objeto que contiene información derivada del archivo :file:`float.h` sobre el soporte de punto flotante de la plataforma. Los atributos de este objeto incluyen :attr:`mant_dig` (número de dígitos en la mantisa), :attr:`epsilon` (diferencia más pequeña entre 1.0 y el siguiente valor más grande representable), y varios otros. (Contribuido por Christian Heimes; :issue:`1534`.)

source: Another new variable, :attr:`dont_write_bytecode`, controls whether Python writes any :file:`.pyc` or :file:`.pyo` files on importing a module. If this variable is true, the compiled files are not written. The variable is initially set on start-up by supplying the :option:`-B` switch to the Python interpreter, or by setting the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable before running the interpreter. Python code can subsequently change the value of this variable to control whether bytecode files are written or not. (Contributed by Neal Norwitz and Georg Brandl.)
es: Otra nueva variable, :attr:`dont_write_bytecode`, controla si Python escribe algún archivo :file:`.pyc` o :file:`.pyo` al importar un módulo. Si esta variable es verdadera, los archivos compilados no se escriben. La variable se establece inicialmente al iniciar el intérprete de Python con la opción :option:`-B`, o estableciendo la variable de entorno :envvar:`PYTHONDONTWRITEBYTECODE` antes de ejecutar el intérprete. El código de Python puede cambiar posteriormente el valor de esta variable para controlar si los archivos de código de bytes se escriben o no. (Contribución de Neal Norwitz y Georg Brandl)

source: Information about the command-line arguments supplied to the Python interpreter is available by reading attributes of a named tuple available as ``sys.flags``. For example, the :attr:`verbose` attribute is true if Python was executed in verbose mode, :attr:`debug` is true in debugging mode, etc. These attributes are all read-only. (Contributed by Christian Heimes.)
es: La información sobre los argumentos de la línea de comandos suministrados al intérprete de Python está disponible leyendo los atributos de una tupla con nombre disponible como ``sys.flags``. Por ejemplo, el atributo :attr:`verbose` es verdadero si Python fue ejecutado en modo verbose, :attr:`debug` es verdadero en modo debugging, etc. Todos estos atributos son de sólo lectura. (Contribución de Christian Heimes)

source: A new function, :func:`getsizeof`, takes a Python object and returns the amount of memory used by the object, measured in bytes. Built-in objects return correct results; third-party extensions may not, but can define a :meth:`__sizeof__` method to return the object's size. (Contributed by Robert Schuppenies; :issue:`2898`.)
es: Una nueva función, :func:`getsizeof`, toma un objeto Python y devuelve la cantidad de memoria utilizada por el objeto, medida en bytes. Los objetos incorporados devuelven resultados correctos; las extensiones de terceros pueden no hacerlo, pero pueden definir un método :meth:`__sizeof__` para devolver el tamaño del objeto. (Contribución de Robert Schuppenies; :issue:`2898`.)

source: It's now possible to determine the current profiler and tracer functions by calling :func:`sys.getprofile` and :func:`sys.gettrace`. (Contributed by Georg Brandl; :issue:`1648`.)
es: Ahora es posible determinar las funciones actuales del perfilador y del trazador llamando a :func:`sys.getprofile` y :func:`sys.gettrace`. (Contribuido por Georg Brandl; :issue:`1648`.)

source: The :mod:`tarfile` module now supports POSIX.1-2001 (pax) tarfiles in addition to the POSIX.1-1988 (ustar) and GNU tar formats that were already supported. The default format is GNU tar; specify the ``format`` parameter to open a file using a different format::
es: El módulo :mod:`tarfile` soporta ahora archivos tar POSIX.1-2001 (pax) además de los formatos POSIX.1-1988 (ustar) y GNU tar que ya estaban soportados. El formato por defecto es GNU tar; especifique el parámetro ``format`` para abrir un archivo con un formato diferente::

source: The new ``encoding`` and ``errors`` parameters specify an encoding and an error handling scheme for character conversions. ``'strict'``, ``'ignore'``, and ``'replace'`` are the three standard ways Python can handle errors,; ``'utf-8'`` is a special value that replaces bad characters with their UTF-8 representation. (Character conversions occur because the PAX format supports Unicode filenames, defaulting to UTF-8 encoding.)
es: Los nuevos parámetros ``encoding`` y ``errors`` especifican una codificación y un esquema de manejo de errores para las conversiones de caracteres. ``'strict'``, ``'ignore'``, y ``'replace'`` son las tres formas estándar en las que Python puede manejar los errores; ``'utf-8'`` es un valor especial que reemplaza los caracteres erróneos con su representación UTF-8. (Las conversiones de caracteres ocurren porque el formato PAX soporta nombres de archivo Unicode, por defecto con codificación UTF-8)

source: The :meth:`TarFile.add` method now accepts an ``exclude`` argument that's a function that can be used to exclude certain filenames from an archive. The function must take a filename and return true if the file should be excluded or false if it should be archived. The function is applied to both the name initially passed to :meth:`add` and to the names of files in recursively added directories.
es: El método :meth:`TarFile.add` ahora acepta un argumento ``exclude`` que es una función que se puede usar para excluir ciertos nombres de archivo de un archivo. La función debe tomar un nombre de archivo y retornar verdadero si el archivo debe excluirse o falso si debe archivarse. La función se aplica tanto al nombre pasado inicialmente a :meth:`add` como a los nombres de los archivos en los directorios agregados recursivamente.

source: (All changes contributed by Lars Gustäbel).
es: (Todos los cambios han sido aportados por Lars Gustäbel).
