Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: An optional ``timeout`` parameter was added to the :class:`telnetlib.Telnet` class constructor, specifying a timeout measured in seconds. (Added by Facundo Batista.)
es: Se agregó un parámetro opcional ``timeout`` al constructor de la clase :class:`telnetlib.Telnet`, especificando un tiempo de espera medido en segundos. (Añadido por Facundo Batista)

source: The :class:`tempfile.NamedTemporaryFile` class usually deletes the temporary file it created when the file is closed. This behaviour can now be changed by passing ``delete=False`` to the constructor. (Contributed by Damien Miller; :issue:`1537850`.)
es: La clase :class:`tempfile.NamedTemporaryFile` suele borrar el archivo temporal que ha creado cuando se cierra el archivo. Este comportamiento se puede cambiar pasando ``delete=False`` al constructor. (Contribución de Damien Miller; :issue:`1537850`.)

source: A new class, :class:`SpooledTemporaryFile`, behaves like a temporary file but stores its data in memory until a maximum size is exceeded. On reaching that limit, the contents will be written to an on-disk temporary file. (Contributed by Dustin J. Mitchell.)
es: Una nueva clase, :class:`SpooledTemporaryFile`, se comporta como un archivo temporal pero almacena sus datos en memoria hasta que se supera un tamaño máximo. Al llegar a ese límite, el contenido se escribirá en un archivo temporal en el disco. (Contribución de Dustin J. Mitchell)

source: The :class:`NamedTemporaryFile` and :class:`SpooledTemporaryFile` classes both work as context managers, so you can write ``with tempfile.NamedTemporaryFile() as tmp: ...``. (Contributed by Alexander Belopolsky; :issue:`2021`.)
es: Las clases :class:`NamedTemporaryFile` y :class:`SpooledTemporaryFile` funcionan como gestores de contexto, por lo que puedes escribir ``con tempfile.NamedTemporaryFile() como tmp: ...``. (Contribuido por Alexander Belopolsky; :issue:`2021`.)

source: The :mod:`test.test_support` module gained a number of context managers useful for writing tests. :func:`EnvironmentVarGuard` is a context manager that temporarily changes environment variables and automatically restores them to their old values.
es: El módulo :mod:`test.test_support` obtuvo una serie de gestores de contexto útiles para escribir pruebas. :func:`EnvironmentVarGuard` es un gestor de contexto que cambia temporalmente las variables de entorno y las restaura automáticamente a sus valores anteriores.

source: Another context manager, :class:`TransientResource`, can surround calls to resources that may or may not be available; it will catch and ignore a specified list of exceptions. For example, a network test may ignore certain failures when connecting to an external web site::
es: Otro gestor de contexto, :class:`TransientResource`, puede rodear las llamadas a recursos que pueden o no estar disponibles; atrapará e ignorará una lista especificada de excepciones. Por ejemplo, una prueba de red puede ignorar ciertos fallos al conectarse a un sitio web externo::

source: Finally, :func:`check_warnings` resets the :mod:`warning` module's warning filters and returns an object that will record all warning messages triggered (:issue:`3781`)::
es: Por último, :func:`check_warnings` restablece los filtros de advertencia del módulo :mod:`warning` y devuelve un objeto que registrará todos los mensajes de advertencia activados (:issue:`3781`)::

source: (Contributed by Brett Cannon.)
es: (Contribución de Brett Cannon.)

source: The :mod:`textwrap` module can now preserve existing whitespace at the beginnings and ends of the newly created lines by specifying ``drop_whitespace=False`` as an argument::
es: El módulo :mod:`textwrap` ahora puede conservar los espacios en blanco existentes al principio y al final de las líneas recién creadas especificando ``drop_whitespace=False`` como argumento:

source: (Contributed by Dwayne Bailey; :issue:`1581073`.)
es: (Contribución de Dwayne Bailey; :issue:`1581073`.)

source: The :mod:`threading` module API is being changed to use properties such as :attr:`daemon` instead of :meth:`setDaemon` and :meth:`isDaemon` methods, and some methods have been renamed to use underscores instead of camel-case; for example, the :meth:`activeCount` method is renamed to :meth:`active_count`. Both the 2.6 and 3.0 versions of the module support the same properties and renamed methods, but don't remove the old methods. No date has been set for the deprecation of the old APIs in Python 3.x; the old APIs won't be removed in any 2.x version. (Carried out by several people, most notably Benjamin Peterson.)
es: La API del módulo :mod:`threading` se ha cambiado para utilizar propiedades como :attr:`daemon` en lugar de los métodos :meth:`setDaemon` y :meth:`isDaemon`, y algunos métodos se han renombrado para utilizar guiones bajos en lugar de mayúsculas; por ejemplo, el método :meth:`activeCount` se ha renombrado a :meth:`active_count`. Tanto la versión 2.6 como la 3.0 del módulo soportan las mismas propiedades y métodos renombrados, pero no eliminan los métodos antiguos. No se ha fijado una fecha para la eliminación de las antiguas APIs en Python 3.x; las antiguas APIs no se eliminarán en ninguna versión 2.x. (Llevado a cabo por varias personas, sobre todo por Benjamin Peterson)

source: The :mod:`threading` module's :class:`Thread` objects gained an :attr:`ident` property that returns the thread's identifier, a nonzero integer. (Contributed by Gregory P. Smith; :issue:`2871`.)
es: Los objetos :mod:`threading` del módulo :class:`Thread` han ganado una propiedad :attr:`ident` que devuelve el identificador del hilo, un entero no nulo. (Contribución de Gregory P. Smith; :issue:`2871`.)

source: The :mod:`timeit` module now accepts callables as well as strings for the statement being timed and for the setup code. Two convenience functions were added for creating :class:`Timer` instances: ``repeat(stmt, setup, time, repeat, number)`` and ``timeit(stmt, setup, time, number)`` create an instance and call the corresponding method. (Contributed by Erik Demaine; :issue:`1533909`.)
es: El módulo :mod:`timeit` acepta ahora callables así como cadenas para la sentencia que se está cronometrando y para el código de configuración. Se han añadido dos funciones para crear instancias de :class:`Timer`: ``repeat(stmt, setup, time, repeat, number)`` y ``timeit(stmt, setup, time, number)`` crean una instancia y llaman al método correspondiente. (Contribución de Erik Demaine; :issue:`1533909`.)

source: The :mod:`Tkinter` module now accepts lists and tuples for options, separating the elements by spaces before passing the resulting value to Tcl/Tk. (Contributed by Guilherme Polo; :issue:`2906`.)
es: El módulo :mod:`Tkinter` ahora acepta listas y tuplas para las opciones, separando los elementos por espacios antes de pasar el valor resultante a Tcl/Tk. (Contribuido por Guilherme Polo; :issue:`2906`.)

source: The :mod:`turtle` module for turtle graphics was greatly enhanced by Gregor Lingl. New features in the module include:
es: El módulo :mod:`turtle` para los gráficos de tortugas ha sido muy mejorado por Gregor Lingl. Las nuevas características del módulo incluyen:

source: Better animation of turtle movement and rotation.
es: Mejor animación del movimiento y la rotación de la tortuga.

source: Control over turtle movement using the new :meth:`delay`, :meth:`tracer`, and :meth:`speed` methods.
es: Control del movimiento de las tortugas mediante los nuevos métodos :meth:`retraso`, :meth:`tracer` y :meth:`velocidad`.

source: The ability to set new shapes for the turtle, and to define a new coordinate system.
es: La posibilidad de establecer nuevas formas para la tortuga y de definir un nuevo sistema de coordenadas.

source: Turtles now have an :meth:`undo()` method that can roll back actions.
es: Las tortugas ahora tienen un método :meth:`undo()` que puede revertir las acciones.

source: Simple support for reacting to input events such as mouse and keyboard activity, making it possible to write simple games.
es: Soporte sencillo para reaccionar a eventos de entrada como la actividad del ratón y del teclado, lo que permite escribir juegos sencillos.

source: A :file:`turtle.cfg` file can be used to customize the starting appearance of the turtle's screen.
es: Se puede utilizar un archivo :file:`turtle.cfg` para personalizar la apariencia inicial de la pantalla de la tortuga.

source: The module's docstrings can be replaced by new docstrings that have been translated into another language.
es: Los docstrings del módulo pueden ser sustituidos por nuevos docstrings traducidos a otro idioma.

source: An optional ``timeout`` parameter was added to the :func:`urllib.urlopen` function and the :class:`urllib.ftpwrapper` class constructor, as well as the :func:`urllib2.urlopen` function. The parameter specifies a timeout measured in seconds. For example::
es: Se ha añadido un parámetro opcional ``timeout`` a la función :func:`urllib.urlopen` y al constructor de la clase :class:`urllib.ftpwrapper`, así como a la función :func:`urllib2.urlopen`. El parámetro especifica un tiempo de espera medido en segundos. Por ejemplo::

source: (Added by Facundo Batista.)
es: (Añadido por Facundo Batista.)

source: The Unicode database provided by the :mod:`unicodedata` module has been updated to version 5.1.0. (Updated by Martin von Löwis; :issue:`3811`.)
es: La base de datos Unicode proporcionada por el módulo :mod:`unicodedata` ha sido actualizada a la versión 5.1.0. (Actualizado por Martin von Löwis; :issue:`3811`.)

source: The :mod:`warnings` module's :func:`formatwarning` and :func:`showwarning` gained an optional *line* argument that can be used to supply the line of source code. (Added as part of :issue:`1631171`, which re-implemented part of the :mod:`warnings` module in C code.)
es: Las funciones :mod:`warnings` del módulo :func:`formatwarning` y :func:`showwarning` han ganado un argumento opcional *line* que puede utilizarse para proporcionar la línea de código fuente. (Añadido como parte de :issue:`1631171`, que reimplementaba parte del módulo :mod:`warnings` en código C)

source: A new function, :func:`catch_warnings`, is a context manager intended for testing purposes that lets you temporarily modify the warning filters and then restore their original values (:issue:`3781`).
es: Una nueva función, :func:`catch_warnings`, es un gestor de contexto destinado a la realización de pruebas que permite modificar temporalmente los filtros de advertencia y luego restaurar sus valores originales (:issue:`3781`).

source: The XML-RPC :class:`SimpleXMLRPCServer` and :class:`DocXMLRPCServer` classes can now be prevented from immediately opening and binding to their socket by passing ``False`` as the *bind_and_activate* constructor parameter. This can be used to modify the instance's :attr:`allow_reuse_address` attribute before calling the :meth:`server_bind` and :meth:`server_activate` methods to open the socket and begin listening for connections. (Contributed by Peter Parente; :issue:`1599845`.)
es: Las clases XML-RPC :class:`SimpleXMLRPCServer` y :class:`DocXMLRPCServer` pueden ahora evitar que se abran inmediatamente y se vinculen a su socket pasando ``False`` como parámetro del constructor *bind_and_activate*. Esto puede usarse para modificar el atributo :attr:`allow_reuse_address` de la instancia antes de llamar a los métodos :meth:`server_bind` y :meth:`server_activate` para abrir el socket y comenzar a escuchar conexiones. (Contribuido por Peter Parente; :issue:`1599845`.)

source: :class:`SimpleXMLRPCServer` also has a :attr:`_send_traceback_header` attribute; if true, the exception and formatted traceback are returned as HTTP headers "X-Exception" and "X-Traceback". This feature is for debugging purposes only and should not be used on production servers because the tracebacks might reveal passwords or other sensitive information. (Contributed by Alan McIntyre as part of his project for Google's Summer of Code 2007.)
es: :class:`SimpleXMLRPCServer` también tiene un atributo :attr:`_send_traceback_header`; si es true, la excepción y el traceback formateado se devuelven como cabeceras HTTP "X-Exception" y "X-Traceback". Esta característica es sólo para propósitos de depuración y no debe ser usada en servidores de producción porque los trazos pueden revelar contraseñas u otra información sensible. (Contribuido por Alan McIntyre como parte de su proyecto para el Summer of Code 2007 de Google)

source: The :mod:`xmlrpclib` module no longer automatically converts :class:`datetime.date` and :class:`datetime.time` to the :class:`xmlrpclib.DateTime` type; the conversion semantics were not necessarily correct for all applications. Code using :mod:`xmlrpclib` should convert :class:`date` and :class:`~datetime.time` instances. (:issue:`1330538`) The code can also handle dates before 1900 (contributed by Ralf Schmitt; :issue:`2014`) and 64-bit integers represented by using ``<i8>`` in XML-RPC responses (contributed by Riku Lindblad; :issue:`2985`).
es: El módulo :mod:`xmlrpclib` ya no convierte automáticamente las instancias :class:`datetime.date` y :class:`datetime.time` al tipo :class:`xmlrpclib.DateTime`; la semántica de conversión no era necesariamente correcta para todas las aplicaciones. El código que utiliza :mod:`xmlrpclib` debe convertir las instancias :class:`date` y :class:`~datetime.time`. (:issue:`1330538`) El código también puede manejar fechas anteriores a 1900 (contribución de Ralf Schmitt; :issue:`2014`) y enteros de 64 bits representados mediante el uso de ``<i8>`` en las respuestas XML-RPC (contribución de Riku Lindblad; :issue:`2985`).

source: The :mod:`zipfile` module's :class:`ZipFile` class now has :meth:`extract` and :meth:`extractall` methods that will unpack a single file or all the files in the archive to the current directory, or to a specified directory::
es: La clase :mod:`zipfile` del módulo :class:`ZipFile` tiene ahora los métodos :meth:`extract` y :meth:`extractall` que desempaquetarán un solo fichero o todos los ficheros del archivo en el directorio actual, o en un directorio especificado::

source: (Contributed by Alan McIntyre; :issue:`467924`.)
es: (Contribución de Alan McIntyre; :issue:`467924`.)

source: The :meth:`open`, :meth:`read` and :meth:`extract` methods can now take either a filename or a :class:`ZipInfo` object. This is useful when an archive accidentally contains a duplicated filename. (Contributed by Graham Horler; :issue:`1775025`.)
es: Los métodos :meth:`open`, :meth:`read` y :meth:`extract` ahora pueden tomar un nombre de archivo o un objeto :class:`ZipInfo`. Esto es útil cuando un archivo contiene accidentalmente un nombre de archivo duplicado. (Contribución de Graham Horler; :issue:`1775025`.)

source: Finally, :mod:`zipfile` now supports using Unicode filenames for archived files. (Contributed by Alexey Borzenkov; :issue:`1734346`.)
es: Por último, :mod:`zipfile` soporta ahora el uso de nombres de archivo Unicode para los ficheros archivados. (Contribución de Alexey Borzenkov; :issue:`1734346`.)

source: The :mod:`ast` module
es: El módulo :mod:`ast`

source: The :mod:`ast` module provides an Abstract Syntax Tree representation of Python code, and Armin Ronacher contributed a set of helper functions that perform a variety of common tasks. These will be useful for HTML templating packages, code analyzers, and similar tools that process Python code.
es: El módulo :mod:`ast` proporciona una representación de árbol de sintaxis abstracta del código Python, y Armin Ronacher ha contribuido con un conjunto de funciones de ayuda que realizan una variedad de tareas comunes. Éstas serán útiles para paquetes de plantillas HTML, analizadores de código y herramientas similares que procesan código Python.

source: The :func:`parse` function takes an expression and returns an AST. The :func:`dump` function outputs a representation of a tree, suitable for debugging::
es: La función :func:`parse` toma una expresión y devuelve un AST. La función :func:`dump` devuelve una representación de un árbol, adecuada para la depuración::

source: This outputs a deeply nested tree::
es: Esto produce un árbol profundamente anidado::

source: The :func:`literal_eval` method takes a string or an AST representing a literal expression, parses and evaluates it, and returns the resulting value. A literal expression is a Python expression containing only strings, numbers, dictionaries, etc. but no statements or function calls. If you need to evaluate an expression but cannot accept the security risk of using an :func:`eval` call, :func:`literal_eval` will handle it safely::
es: El método :func:`literal_eval` toma una cadena o un AST que representa una expresión literal, la analiza y evalúa, y devuelve el valor resultante. Una expresión literal es una expresión de Python que sólo contiene cadenas, números, diccionarios, etc. pero no declaraciones o llamadas a funciones. Si necesita evaluar una expresión pero no puede aceptar el riesgo de seguridad que supone utilizar una llamada a :func:`eval`, :func:`literal_eval` lo hará de forma segura::

source: The module also includes :class:`NodeVisitor` and :class:`NodeTransformer` classes for traversing and modifying an AST, and functions for common transformations such as changing line numbers.
es: El módulo también incluye las clases :class:`NodeVisitor` y :class:`NodeTransformer` para recorrer y modificar un AST, y funciones para transformaciones comunes como el cambio de números de línea.

source: The :mod:`future_builtins` module
es: El módulo :mod:`future_builtins`

source: Python 3.0 makes many changes to the repertoire of built-in functions, and most of the changes can't be introduced in the Python 2.x series because they would break compatibility. The :mod:`future_builtins` module provides versions of these built-in functions that can be imported when writing 3.0-compatible code.
es: Python 3.0 introduce muchos cambios en el repertorio de funciones incorporadas, y la mayoría de los cambios no pueden introducirse en la serie Python 2.x porque romperían la compatibilidad. El módulo :mod:`future_builtins` proporciona versiones de estas funciones incorporadas que pueden importarse al escribir código compatible con la versión 3.0.

source: The functions in this module currently include:
es: Las funciones de este módulo incluyen actualmente:

source: ``ascii(obj)``: equivalent to :func:`repr`. In Python 3.0, :func:`repr` will return a Unicode string, while :func:`ascii` will return a pure ASCII bytestring.
es: ``ascii(obj)``: equivalente a :func:`repr`. En Python 3.0, :func:`repr` devolverá una cadena Unicode, mientras que :func:`ascii` devolverá una cadena de bytes ASCII pura.

source: ``filter(predicate, iterable)``, ``map(func, iterable1, ...)``: the 3.0 versions return iterators, unlike the 2.x builtins which return lists.
es: ``filtro(predicado, iterable)``, ``map(func, iterable1, ...)``: las versiones 3.0 devuelven iteradores, a diferencia de las funciones integradas 2.x que devuelven listas.

source: ``hex(value)``, ``oct(value)``: instead of calling the :meth:`__hex__` or :meth:`__oct__` methods, these versions will call the :meth:`__index__` method and convert the result to hexadecimal or octal. :func:`oct` will use the new ``0o`` notation for its result.
es: ``hex(valor)``, ``oct(valor)``: en lugar de llamar a los métodos :meth:`__hex__` o :meth:`__oct__`, estas versiones llamarán al método :meth:`__index__` y convertirán el resultado a hexadecimal u octal. :func:`oct` utilizará la nueva notación ``0o`` para su resultado.

source: The :mod:`json` module: JavaScript Object Notation
es: El módulo :mod:`json`: Notación de objetos de JavaScript

source: The new :mod:`json` module supports the encoding and decoding of Python types in JSON (Javascript Object Notation). JSON is a lightweight interchange format often used in web applications. For more information about JSON, see http://www.json.org.
es: El nuevo módulo :mod:`json` soporta la codificación y decodificación de tipos Python en JSON (*Javascript Object Notation*). JSON es un formato de intercambio ligero que se utiliza a menudo en las aplicaciones web. Para más información sobre JSON, consulte http://www.json.org.

source: :mod:`json` comes with support for decoding and encoding most built-in Python types. The following example encodes and decodes a dictionary::
es: :mod:`json` viene con soporte para decodificar y codificar la mayoría de los tipos incorporados de Python. El siguiente ejemplo codifica y decodifica un diccionario::

source: It's also possible to write your own decoders and encoders to support more types. Pretty-printing of the JSON strings is also supported.
es: También es posible escribir tus propios decodificadores y codificadores para soportar más tipos. También se admite la impresión bonita de las cadenas JSON.

source: :mod:`json` (originally called simplejson) was written by Bob Ippolito.
es: :mod:`json` (originalmente llamado simplejson) fue escrito por Bob Ippolito.

source: The :mod:`plistlib` module: A Property-List Parser
es: El módulo :mod:`plistlib`: Un analizador de listas de propiedades

source: The ``.plist`` format is commonly used on Mac OS X to store basic data types (numbers, strings, lists, and dictionaries) by serializing them into an XML-based format. It resembles the XML-RPC serialization of data types.
es: El formato ``.plist`` se utiliza habitualmente en Mac OS X para almacenar tipos de datos básicos (números, cadenas, listas y diccionarios) serializándolos en un formato basado en XML. Se asemeja a la serialización XML-RPC de los tipos de datos.

source: Despite being primarily used on Mac OS X, the format has nothing Mac-specific about it and the Python implementation works on any platform that Python supports, so the :mod:`plistlib` module has been promoted to the standard library.
es: A pesar de ser utilizado principalmente en Mac OS X, el formato no tiene nada de específico para Mac y la implementación de Python funciona en cualquier plataforma que soporte Python, por lo que el módulo :mod:`plistlib` ha sido promovido a la biblioteca estándar.

source: Using the module is simple::
es: El uso del módulo es sencillo::

source: ctypes Enhancements
es: mejoras en ctypes

source: Thomas Heller continued to maintain and enhance the :mod:`ctypes` module.
es: Thomas Heller siguió manteniendo y mejorando el módulo :mod:`ctypes`.

source: :mod:`ctypes` now supports a :class:`c_bool` datatype that represents the C99 ``bool`` type. (Contributed by David Remahl; :issue:`1649190`.)
es: :mod:`ctypes` soporta ahora un tipo de datos :class:`c_bool` que representa el tipo C99 ``bool``. (Contribución de David Remahl; :issue:`1649190`.)

source: The :mod:`ctypes` string, buffer and array types have improved support for extended slicing syntax, where various combinations of ``(start, stop, step)`` are supplied. (Implemented by Thomas Wouters.)
es: Los tipos de cadena, buffer y array de :mod:`ctypes` han mejorado el soporte para la sintaxis de corte extendida, donde se suministran varias combinaciones de ``(start, stop, step)``. (Implementado por Thomas Wouters)

source: All :mod:`ctypes` data types now support :meth:`from_buffer` and :meth:`from_buffer_copy` methods that create a ctypes instance based on a provided buffer object. :meth:`from_buffer_copy` copies the contents of the object, while :meth:`from_buffer` will share the same memory area.
es: Todos los tipos de datos :mod:`ctypes` soportan ahora los métodos :meth:`from_buffer` y :meth:`from_buffer_copy` que crean una instancia de ctypes basada en un objeto buffer proporcionado. :meth:`from_buffer_copy` copia el contenido del objeto, mientras que :meth:`from_buffer` compartirá la misma área de memoria.
