Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: Let's say you have a particular class and wish to know whether it supports dictionary-style access. The phrase "dictionary-style" is vague, however. It probably means that accessing items with ``obj[1]`` works. Does it imply that setting items with ``obj[2] = value`` works? Or that the object will have :meth:`keys`, :meth:`values`, and :meth:`items` methods? What about the iterative variants such as :meth:`iterkeys`? :meth:`copy` and :meth:`update`? Iterating over the object with :func:`iter`?
es: Supongamos que tiene una clase concreta y desea saber si admite el acceso tipo diccionario. Sin embargo, la frase "estilo diccionario" es vaga. Probablemente significa que el acceso a los elementos con ``obj[1]`` funciona. ¿Implica que el establecimiento de elementos con ``obj[2] = valor`` funciona? ¿O que el objeto tendrá métodos :meth:`keys`, :meth:`values` y :meth:`items`? ¿Qué pasa con las variantes iterativas como :meth:`iterkeys`? :meth:`copy` y :meth:`update`? ¿Iterar sobre el objeto con :func:`iter`?

source: The Python 2.6 :mod:`collections` module includes a number of different ABCs that represent these distinctions. :class:`Iterable` indicates that a class defines :meth:`__iter__`, and :class:`Container` means the class defines a :meth:`__contains__` method and therefore supports ``x in y`` expressions. The basic dictionary interface of getting items, setting items, and :meth:`keys`, :meth:`values`, and :meth:`items`, is defined by the :class:`MutableMapping` ABC.
es: El módulo :mod:`collections` de Python 2.6 incluye un número de ABCs diferentes que representan estas distinciones. :class:`Iterable` indica que una clase define :meth:`__iter__`, y :class:`Container` significa que la clase define un método :meth:`__contains__` y por lo tanto soporta expresiones ``x in y``. La interfaz básica del diccionario para obtener elementos, establecer elementos, y :meth:`llaves`, :meth:`valores`, y :meth:`elementos`, está definida por el :class:`MutableMapping` ABC.

source: You can derive your own classes from a particular ABC to indicate they support that ABC's interface::
es: Puedes derivar tus propias clases de un ABC particular para indicar que soportan la interfaz de ese ABC::

source: Alternatively, you could write the class without deriving from the desired ABC and instead register the class by calling the ABC's :meth:`register` method::
es: Alternativamente, puede escribir la clase sin derivar del ABC deseado y en su lugar registrar la clase llamando al método :meth:`register` del ABC::

source: For classes that you write, deriving from the ABC is probably clearer. The :meth:`register` method is useful when you've written a new ABC that can describe an existing type or class, or if you want to declare that some third-party class implements an ABC. For example, if you defined a :class:`PrintableType` ABC, it's legal to do::
es: Para las clases que usted escribe, derivar del ABC es probablemente más claro. El método :meth:`register` es útil cuando has escrito un nuevo ABC que puede describir un tipo o clase existente, o si quieres declarar que alguna clase de terceros implementa un ABC. Por ejemplo, si has definido un :class:`PrintableType` ABC, es legal hacer::

source: Classes should obey the semantics specified by an ABC, but Python can't check this; it's up to the class author to understand the ABC's requirements and to implement the code accordingly.
es: Las clases deben obedecer la semántica especificada por un ABC, pero Python no puede comprobarlo; depende del autor de la clase entender los requisitos del ABC e implementar el código en consecuencia.

source: To check whether an object supports a particular interface, you can now write::
es: Para comprobar si un objeto es compatible con una determinada interfaz, ahora se puede escribir::

source: Don't feel that you must now begin writing lots of checks as in the above example. Python has a strong tradition of duck-typing, where explicit type-checking is never done and code simply calls methods on an object, trusting that those methods will be there and raising an exception if they aren't. Be judicious in checking for ABCs and only do it where it's absolutely necessary.
es: No sientas que ahora debes empezar a escribir muchas comprobaciones como en el ejemplo anterior. Python tiene una fuerte tradición de "duck-typing", donde la comprobación explícita de tipos nunca se hace y el código simplemente llama a los métodos de un objeto, confiando en que esos métodos estarán ahí y lanzando una excepción si no lo están. Sea juicioso al comprobar el ABC y hágalo sólo cuando sea absolutamente necesario.

source: You can write your own ABCs by using ``abc.ABCMeta`` as the metaclass in a class definition::
es: Puedes escribir tu propio ABC utilizando ``abc.ABCMeta`` como metaclase en una definición de clase::

source: In the :class:`Drawable` ABC above, the :meth:`draw_doubled` method renders the object at twice its size and can be implemented in terms of other methods described in :class:`Drawable`. Classes implementing this ABC therefore don't need to provide their own implementation of :meth:`draw_doubled`, though they can do so. An implementation of :meth:`draw` is necessary, though; the ABC can't provide a useful generic implementation.
es: En el ABC de :class:`Drawable` anterior, el método :meth:`draw_doubled` renderiza el objeto al doble de su tamaño y puede ser implementado en términos de otros métodos descritos en :class:`Drawable`. Las clases que implementan este ABC no necesitan proporcionar su propia implementación de :meth:`draw_doubled`, aunque pueden hacerlo. Sin embargo, es necesaria una implementación de :meth:`draw`; el ABC no puede proporcionar una implementación genérica útil.

source: You can apply the ``@abstractmethod`` decorator to methods such as :meth:`draw` that must be implemented; Python will then raise an exception for classes that don't define the method. Note that the exception is only raised when you actually try to create an instance of a subclass lacking the method::
es: Puedes aplicar el decorador ``@abstractmethod`` a métodos como :meth:`draw` que deben ser implementados; Python lanzará una excepción para las clases que no definan el método. Ten en cuenta que la excepción sólo se produce cuando intentas crear una instancia de una subclase que carece del método::

source: Abstract data attributes can be declared using the ``@abstractproperty`` decorator::
es: Los atributos de datos abstractos pueden declararse utilizando el decorador ``@abstractproperty``::

source: Subclasses must then define a :meth:`readonly` property.
es: Las subclases deben definir una propiedad :meth:`readonly`.

source: :pep:`3119` - Introducing Abstract Base Classes
es: :pep:`3119` - Presentación de las clases base abstractas

source: PEP written by Guido van Rossum and Talin. Implemented by Guido van Rossum. Backported to 2.6 by Benjamin Aranguren, with Alex Martelli.
es: PEP escrito por Guido van Rossum y Talin. Implementado por Guido van Rossum. Adaptado a la versión 2.6 por Benjamin Aranguren, con Alex Martelli.

source: PEP 3127: Integer Literal Support and Syntax
es: PEP 3127: Soporte y sintaxis de literales enteros

source: Python 3.0 changes the syntax for octal (base-8) integer literals, prefixing them with "0o" or "0O" instead of a leading zero, and adds support for binary (base-2) integer literals, signalled by a "0b" or "0B" prefix.
es: Python 3.0 cambia la sintaxis de los literales enteros octales (base-8), prefijándolos con "0o" o "0O" en lugar de un cero inicial, y añade soporte para los literales enteros binarios (base-2), señalados con un prefijo "0b" o "0B".

source: Python 2.6 doesn't drop support for a leading 0 signalling an octal number, but it does add support for "0o" and "0b"::
es: Python 2.6 no elimina el soporte para el 0 inicial que señala un número octal, pero sí añade soporte para "0o" y "0b"::

source: The :func:`oct` builtin still returns numbers prefixed with a leading zero, and a new :func:`bin` builtin returns the binary representation for a number::
es: La función :func:`oct` sigue devolviendo números prefijados con un cero a la izquierda, y la nueva función :func:`bin` devuelve la representación binaria de un número::

source: The :func:`int` and :func:`long` builtins will now accept the "0o" and "0b" prefixes when base-8 or base-2 are requested, or when the *base* argument is zero (signalling that the base used should be determined from the string)::
es: Las funciones built-in :func:`int` y :func:`long` aceptarán ahora los prefijos "0o" y "0b" cuando se solicite base-8 o base-2, o cuando el argumento *base* sea cero (indicando que la base utilizada debe determinarse a partir de la cadena)::

source: :pep:`3127` - Integer Literal Support and Syntax
es: :pep:`3127` - Soporte y sintaxis de literales enteros

source: PEP written by Patrick Maupin; backported to 2.6 by Eric Smith.
es: PEP escrito por Patrick Maupin; retroalimentado a 2.6 por Eric Smith.

source: PEP 3129: Class Decorators
es: PEP 3129: Decoradores de clase

source: Decorators have been extended from functions to classes. It's now legal to write::
es: Los decoradores se han ampliado de funciones a clases. Ahora es legal escribir::

source: This is equivalent to::
es: Esto equivale a::

source: :pep:`3129` - Class Decorators
es: :pep:`3129` - Decoradores de clase

source: PEP written by Collin Winter.
es: PEP escrito por Collin Winter.

source: PEP 3141: A Type Hierarchy for Numbers
es: PEP 3141: Una jerarquía de tipos para los números

source: Python 3.0 adds several abstract base classes for numeric types inspired by Scheme's numeric tower. These classes were backported to 2.6 as the :mod:`numbers` module.
es: Python 3.0 añade varias clases base abstractas para tipos numéricos inspiradas en la torre numérica de Scheme. Estas clases fueron retrocedidas a la versión 2.6 como el módulo :mod:`numbers`.

source: The most general ABC is :class:`Number`. It defines no operations at all, and only exists to allow checking if an object is a number by doing ``isinstance(obj, Number)``.
es: El ABC más general es :class:`Number`. No define ninguna operación, y sólo existe para permitir comprobar si un objeto es un número haciendo ``isinstance(obj, Number)``.

source: :class:`Complex` is a subclass of :class:`Number`. Complex numbers can undergo the basic operations of addition, subtraction, multiplication, division, and exponentiation, and you can retrieve the real and imaginary parts and obtain a number's conjugate. Python's built-in complex type is an implementation of :class:`Complex`.
es: :class:`Complex` es una subclase de :class:`Number`. Los números complejos pueden someterse a las operaciones básicas de suma, resta, multiplicación, división y exponenciación, y se pueden recuperar las partes real e imaginaria y obtener el conjugado de un número. El tipo complejo incorporado en Python es una implementación de :class:`Complex`.

source: :class:`Real` further derives from :class:`Complex`, and adds operations that only work on real numbers: :func:`floor`, :func:`trunc`, rounding, taking the remainder mod N, floor division, and comparisons.
es: :class:`Real` deriva a su vez de :class:`Complex`, y añade operaciones que sólo funcionan con números reales: :func:`floor`, :func:`trunc`, redondeo, toma del resto mod N, división entera a la baja y comparaciones.

source: :class:`Rational` numbers derive from :class:`Real`, have :attr:`numerator` and :attr:`denominator` properties, and can be converted to floats. Python 2.6 adds a simple rational-number class, :class:`Fraction`, in the :mod:`fractions` module. (It's called :class:`Fraction` instead of :class:`Rational` to avoid a name clash with :class:`numbers.Rational`.)
es: Los números :class:`Rational` derivan de :class:`Real`, tienen las propiedades :attr:`numerator` y :attr:`denominator`, y se pueden convertir en flotantes. Python 2.6 añade una clase simple de números racionales, :class:`Fraction`, en el módulo :mod:`fractions`. (Se llama :class:`Fraction` en lugar de :class:`Rational` para evitar un choque de nombres con :class:`numbers.Rational`)

source: :class:`Integral` numbers derive from :class:`Rational`, and can be shifted left and right with ``<<`` and ``>>``, combined using bitwise operations such as ``&`` and ``|``, and can be used as array indexes and slice boundaries.
es: Los números de :class:`Integral` derivan de :class:`Rational`, y pueden desplazarse a la izquierda y a la derecha con ``<`` y ``>```, combinarse utilizando operaciones de bits como ``&`` y ``|``, y pueden utilizarse como índices de matrices y límites de cortes.

source: In Python 3.0, the PEP slightly redefines the existing builtins :func:`round`, :func:`math.floor`, :func:`math.ceil`, and adds a new one, :func:`math.trunc`, that's been backported to Python 2.6. :func:`math.trunc` rounds toward zero, returning the closest :class:`Integral` that's between the function's argument and zero.
es: En Python 3.0, el PEP redefine ligeramente las funciones integradas existentes :func:`round`, :func:`math.floor`, :func:`math.ceil`, y añade uno nuevo, :func:`math.trunc`, que ha sido retrocedido a Python 2.6. :func:`math.trunc` redondea hacia cero, devolviendo el :class:`Integral` más cercano que esté entre el argumento de la función y cero.

source: :pep:`3141` - A Type Hierarchy for Numbers
es: :pep:`3141` - Una jerarquía de tipos para los números

source: PEP written by Jeffrey Yasskin.
es: PEP escrito por Jeffrey Yasskin.

source: `Scheme's numerical tower <https://www.gnu.org/software/guile/manual/html_node/Numerical-Tower.html#Numerical-Tower>`__, from the Guile manual.
es: `Torre numérica del esquema <https://www.gnu.org/software/guile/manual/html_node/Numerical-Tower.html#Numerical-Tower>`__, del manual de Guile.

source: `Scheme's number datatypes <https://conservatory.scheme.org/schemers/Documents/Standards/R5RS/HTML/r5rs-Z-H-9.html#%_sec_6.2>`__ from the R5RS Scheme specification.
es: `Scheme's number datatypes <https://conservatory.scheme.org/schemers/Documents/Standards/R5RS/HTML/r5rs-Z-H-9.html#%_sec_6.2>`__ de la especificación del esquema R5RS.

source: The :mod:`fractions` Module
es: El módulo :mod:`fractions`

source: To fill out the hierarchy of numeric types, the :mod:`fractions` module provides a rational-number class. Rational numbers store their values as a numerator and denominator forming a fraction, and can exactly represent numbers such as ``2/3`` that floating-point numbers can only approximate.
es: Para completar la jerarquía de tipos numéricos, el módulo :mod:`fractions` proporciona una clase de números racionales. Los números racionales almacenan sus valores como un numerador y un denominador que forman una fracción, y pueden representar exactamente números como ``2/3`` que los números de punto flotante sólo pueden aproximar.

source: The :class:`Fraction` constructor takes two :class:`Integral` values that will be the numerator and denominator of the resulting fraction. ::
es: El constructor :class:`Fraction` toma dos valores :class:`Integral` que serán el numerador y el denominador de la fracción resultante. ::

source: For converting floating-point numbers to rationals, the float type now has an :meth:`as_integer_ratio()` method that returns the numerator and denominator for a fraction that evaluates to the same floating-point value::
es: Para convertir números de punto flotante en racionales, el tipo float tiene ahora un método :meth:`as_integer_ratio()` que devuelve el numerador y el denominador de una fracción que se evalúa al mismo valor de punto flotante::

source: Note that values that can only be approximated by floating-point numbers, such as 1./3, are not simplified to the number being approximated; the fraction attempts to match the floating-point value **exactly**.
es: Tenga en cuenta que los valores que sólo pueden ser aproximados por números de punto flotante, como 1,/3, no se simplifican al número que se está aproximando; la fracción intenta coincidir con el valor de punto flotante **exactamente**.

source: The :mod:`fractions` module is based upon an implementation by Sjoerd Mullender that was in Python's :file:`Demo/classes/` directory for a long time. This implementation was significantly updated by Jeffrey Yasskin.
es: El módulo :mod:`fractions` se basa en una implementación de Sjoerd Mullender que estuvo en el directorio :file:`Demo/classes/` de Python durante mucho tiempo. Esta implementación fue significativamente actualizada por Jeffrey Yasskin.

source: Other Language Changes
es: Otros cambios lingüísticos

source: Some smaller changes made to the core Python language are:
es: Algunos de los cambios más pequeños realizados en el núcleo del lenguaje Python son:

source: Directories and zip archives containing a :file:`__main__.py` file can now be executed directly by passing their name to the interpreter. The directory or zip archive is automatically inserted as the first entry in sys.path. (Suggestion and initial patch by Andy Chu, subsequently revised by Phillip J. Eby and Nick Coghlan; :issue:`1739468`.)
es: Los directorios y archivos zip que contengan un archivo :file:`__main__.py` pueden ahora ejecutarse directamente pasando su nombre al intérprete. El directorio o archivo zip se inserta automáticamente como la primera entrada en sys.path. (Sugerencia y parche inicial de Andy Chu, revisado posteriormente por Phillip J. Eby y Nick Coghlan; :issue:`1739468`)

source: The :func:`hasattr` function was catching and ignoring all errors, under the assumption that they meant a :meth:`__getattr__` method was failing somehow and the return value of :func:`hasattr` would therefore be ``False``. This logic shouldn't be applied to :exc:`KeyboardInterrupt` and :exc:`SystemExit`, however; Python 2.6 will no longer discard such exceptions when :func:`hasattr` encounters them. (Fixed by Benjamin Peterson; :issue:`2196`.)
es: La función :func:`hasattr` estaba capturando e ignorando todos los errores, bajo la suposición de que significaban que un método :meth:`__getattr__` estaba fallando de alguna manera y que el valor de retorno de :func:`hasattr` sería por tanto ``False``. Esta lógica no debería aplicarse a :exc:`KeyboardInterrupt` y :exc:`SystemExit`, sin embargo; Python 2.6 ya no descartará tales excepciones cuando :func:`hasattr` las encuentre. (Corregido por Benjamin Peterson; :issue:`2196`.)

source: When calling a function using the ``**`` syntax to provide keyword arguments, you are no longer required to use a Python dictionary; any mapping will now work::
es: Cuando se llama a una función utilizando la sintaxis ``**`` para proporcionar argumentos de palabras clave, ya no es necesario utilizar un diccionario de Python; ahora funcionará cualquier asignación::

source: (Contributed by Alexander Belopolsky; :issue:`1686487`.)
es: (Contribución de Alexander Belopolsky; :issue:`1686487`.)

source: It's also become legal to provide keyword arguments after a ``*args`` argument to a function call. ::
es: También se ha convertido en legal proporcionar argumentos de palabras clave después de un argumento ``*args`` a una llamada de función. ::

source: Previously this would have been a syntax error. (Contributed by Amaury Forgeot d'Arc; :issue:`3473`.)
es: Anteriormente, esto habría sido un error de sintaxis. (Contribución de Amaury Forgeot d'Arc; :issue:`3473`.)

source: A new builtin, ``next(iterator, [default])`` returns the next item from the specified iterator. If the *default* argument is supplied, it will be returned if *iterator* has been exhausted; otherwise, the :exc:`StopIteration` exception will be raised. (Backported in :issue:`2719`.)
es: Un nuevo builtin, ``next(iterator, [default])`` devuelve el siguiente elemento del iterador especificado. Si se suministra el argumento *default*, se devolverá si *iterador* se ha agotado; en caso contrario, se lanzará la excepción :exc:`StopIteration`. (Se ha modificado en :issue:`2719`.)

source: Tuples now have :meth:`index` and :meth:`count` methods matching the list type's :meth:`index` and :meth:`count` methods::
es: Las tuplas tienen ahora métodos :meth:`index` y :meth:`count` que coinciden con los métodos :meth:`index` y :meth:`count` del tipo lista::

source: (Contributed by Raymond Hettinger)
es: (Contribución de Raymond Hettinger)

source: The built-in types now have improved support for extended slicing syntax, accepting various combinations of ``(start, stop, step)``. Previously, the support was partial and certain corner cases wouldn't work. (Implemented by Thomas Wouters.)
es: Los tipos incorporados tienen ahora un soporte mejorado para la sintaxis de corte extendida, aceptando varias combinaciones de ``(inicio, parada, paso)``. Anteriormente, el soporte era parcial y algunos casos de esquina no funcionaban. (Implementado por Thomas Wouters)

source: Properties now have three attributes, :attr:`getter`, :attr:`setter` and :attr:`deleter`, that are decorators providing useful shortcuts for adding a getter, setter or deleter function to an existing property. You would use them like this::
es: Las propiedades tienen ahora tres atributos, :attr:`getter`, :attr:`setter` y :attr:`deleter`, que son decoradores que proporcionan atajos útiles para añadir una función getter, setter o deleter a una propiedad existente. Los usarás así::

source: Several methods of the built-in set types now accept multiple iterables: :meth:`intersection`, :meth:`intersection_update`, :meth:`union`, :meth:`update`, :meth:`difference` and :meth:`difference_update`.
es: Varios métodos de los tipos de conjuntos incorporados aceptan ahora múltiples iterables: :meth:`intersection`, :meth:`intersection_update`, :meth:`union`, :meth:`update`, :meth:`difference` y :meth:`difference_update`.

source: (Contributed by Raymond Hettinger.)
es: (Contribución de Raymond Hettinger.)

source: Many floating-point features were added. The :func:`float` function will now turn the string ``nan`` into an IEEE 754 Not A Number value, and ``+inf`` and ``-inf`` into positive or negative infinity. This works on any platform with IEEE 754 semantics. (Contributed by Christian Heimes; :issue:`1635`.)
es: Se han añadido muchas funciones de punto flotante. La función :func:`float` ahora convertirá la cadena ``nan`` en un valor IEEE 754 Not A Number, y ``+inf`` y ``-inf`` en infinito positivo o negativo. Esto funciona en cualquier plataforma con semántica IEEE 754. (Contribución de Christian Heimes; :issue:`1635`.)

source: Other functions in the :mod:`math` module, :func:`isinf` and :func:`isnan`, return true if their floating-point argument is infinite or Not A Number. (:issue:`1640`)
es: Otras funciones del módulo :mod:`math`, :func:`isinf` y :func:`isnan`, devuelven true si su argumento en coma flotante es infinito o No es un número. (:issue:`1640`)

source: Conversion functions were added to convert floating-point numbers into hexadecimal strings (:issue:`3008`). These functions convert floats to and from a string representation without introducing rounding errors from the conversion between decimal and binary. Floats have a :meth:`hex` method that returns a string representation, and the ``float.fromhex()`` method converts a string back into a number::
es: Se han añadido funciones de conversión para convertir números de punto flotante en cadenas hexadecimales (:issue:`3008`). Estas funciones convierten los números flotantes a y desde una representación de cadena sin introducir errores de redondeo por la conversión entre decimal y binario. Los flotadores tienen un método :meth:`hex` que devuelve una representación de cadena, y el método ``float.fromhex()`` convierte una cadena de nuevo en un número::
