Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: A new window method in the :mod:`curses` module, :meth:`chgat`, changes the display attributes for a certain number of characters on a single line. (Contributed by Fabian Kreutz.)
es: Un nuevo método de ventana en el módulo :mod:`curses`, :meth:`chgat`, cambia los atributos de visualización para un determinado número de caracteres en una sola línea. (Contribución de Fabian Kreutz)

source: The :class:`Textbox` class in the :mod:`curses.textpad` module now supports editing in insert mode as well as overwrite mode. Insert mode is enabled by supplying a true value for the *insert_mode* parameter when creating the :class:`Textbox` instance.
es: La clase :class:`Textbox` del módulo :mod:`curses.textpad` soporta ahora la edición en modo de inserción así como en modo de sobrescritura. El modo de inserción se activa proporcionando un valor verdadero para el parámetro *insert_mode* al crear la instancia de :class:`Textbox`.

source: The :mod:`datetime` module's :meth:`strftime` methods now support a ``%f`` format code that expands to the number of microseconds in the object, zero-padded on the left to six places. (Contributed by Skip Montanaro; :issue:`1158`.)
es: Los métodos :meth:`strftime` del módulo :mod:`datetime` soportan ahora un código de formato ``%f`` que se expande al número de microsegundos en el objeto, rellenado de cero a la izquierda hasta seis lugares. (Contribución de Skip Montanaro; :issue:`1158`.)

source: The :mod:`decimal` module was updated to version 1.66 of `the General Decimal Specification <https://speleotrove.com/decimal/decarith.html>`__. New features include some methods for some basic mathematical functions such as :meth:`exp` and :meth:`log10`::
es: El módulo :mod:`decimal` se actualizó a la versión 1.66 de `the General Decimal Specification <https://speleotrove.com/decimal/decarith.html>`__. Las nuevas características incluyen algunos métodos para algunas funciones matemáticas básicas como :meth:`exp` y :meth:`log10`:

source: The :meth:`as_tuple` method of :class:`Decimal` objects now returns a named tuple with :attr:`sign`, :attr:`digits`, and :attr:`exponent` fields.
es: El método :meth:`as_tuple` de los objetos :class:`Decimal` devuelve ahora una tupla con nombre con los campos :attr:`signo`, :attr:`dígitos` y :attr:`exponente`.

source: (Implemented by Facundo Batista and Mark Dickinson. Named tuple support added by Raymond Hettinger.)
es: (Implementado por Facundo Batista y Mark Dickinson. Soporte de tuplas con nombre añadido por Raymond Hettinger)

source: The :mod:`difflib` module's :class:`SequenceMatcher` class now returns named tuples representing matches, with :attr:`a`, :attr:`b`, and :attr:`size` attributes. (Contributed by Raymond Hettinger.)
es: La clase :mod:`difflib` del módulo :class:`SequenceMatcher` devuelve ahora tuplas con nombre que representan coincidencias, con atributos :attr:`a`, :attr:`b` y :attr:`size`. (Contribución de Raymond Hettinger)

source: An optional ``timeout`` parameter, specifying a timeout measured in seconds, was added to the :class:`ftplib.FTP` class constructor as well as the :meth:`connect` method. (Added by Facundo Batista.) Also, the :class:`FTP` class's :meth:`storbinary` and :meth:`storlines` now take an optional *callback* parameter that will be called with each block of data after the data has been sent. (Contributed by Phil Schwartz; :issue:`1221598`.)
es: Se ha añadido un parámetro opcional ``timeout``, que especifica un tiempo de espera medido en segundos, al constructor de la clase :class:`ftplib.FTP` así como al método :meth:`connect`. (Añadido por Facundo Batista.) Además, los métodos :meth:`storbinary` y :meth:`storlines` de la clase :class:`FTP` ahora toman un parámetro opcional *callback* que será llamado con cada bloque de datos después de que los datos hayan sido enviados. (Contribuido por Phil Schwartz; :issue:`1221598`.)

source: The :func:`reduce` built-in function is also available in the :mod:`functools` module. In Python 3.0, the builtin has been dropped and :func:`reduce` is only available from :mod:`functools`; currently there are no plans to drop the builtin in the 2.x series. (Patched by Christian Heimes; :issue:`1739906`.)
es: La función incorporada :func:`reduce` también está disponible en el módulo :mod:`functools`. En Python 3.0, la función incorporada se ha eliminado y :func:`reduce` sólo está disponible en :mod:`functools`; actualmente no hay planes para eliminar la función incorporada en la serie 2.x. (Parcheado por Christian Heimes; :issue:`1739906`.)

source: When possible, the :mod:`getpass` module will now use :file:`/dev/tty` to print a prompt message and read the password, falling back to standard error and standard input. If the password may be echoed to the terminal, a warning is printed before the prompt is displayed. (Contributed by Gregory P. Smith.)
es: Cuando sea posible, el módulo :mod:`getpass` utilizará ahora :file:`/dev/tty` para imprimir un mensaje de aviso y leer la contraseña, retrocediendo al error estándar y a la entrada estándar. Si la contraseña puede ser enviada al terminal, se imprimirá una advertencia antes de que se muestre el aviso. (Contribución de Gregory P. Smith)

source: The :func:`glob.glob` function can now return Unicode filenames if a Unicode path was used and Unicode filenames are matched within the directory. (:issue:`1001604`)
es: La función :func:`glob.glob` ahora puede devolver nombres de archivo Unicode si se ha utilizado una ruta Unicode y se han encontrado nombres de archivo Unicode dentro del directorio. (:issue:`1001604`)

source: A new function in the :mod:`heapq` module, ``merge(iter1, iter2, ...)``, takes any number of iterables returning data in sorted order, and returns a new generator that returns the contents of all the iterators, also in sorted order. For example::
es: Una nueva función en el módulo :mod:`heapq`, ``merge(iter1, iter2, ...)``, toma cualquier número de iterables que devuelven datos en orden ordenado, y devuelve un nuevo generador que devuelve el contenido de todos los iteradores, también en ordenado. Por ejemplo::

source: Another new function, ``heappushpop(heap, item)``, pushes *item* onto *heap*, then pops off and returns the smallest item. This is more efficient than making a call to :func:`heappush` and then :func:`heappop`.
es: Otra nueva función, ``heappushpop(heap, item)``, empuja *item* a *heap*, luego lo saca y devuelve el elemento más pequeño. Esto es más eficiente que hacer una llamada a :func:`heappush` y luego a :func:`heappop`.

source: :mod:`heapq` is now implemented to only use less-than comparison, instead of the less-than-or-equal comparison it previously used. This makes :mod:`heapq`'s usage of a type match the :meth:`list.sort` method. (Contributed by Raymond Hettinger.)
es: :mod:`heapq` se ha implementado para utilizar únicamente la comparación menor que, en lugar de la comparación menor o igual que utilizaba anteriormente. Esto hace que el uso de :mod:`heapq` de un tipo coincida con el método :meth:`list.sort`. (Contribución de Raymond Hettinger)

source: An optional ``timeout`` parameter, specifying a timeout measured in seconds, was added to the :class:`httplib.HTTPConnection` and :class:`HTTPSConnection` class constructors. (Added by Facundo Batista.)
es: Se ha añadido un parámetro opcional ``timeout``, que especifica un tiempo de espera medido en segundos, a los constructores de las clases :class:`httplib.HTTPConnection` y :class:`HTTPSConnection`. (Añadido por Facundo Batista)

source: Most of the :mod:`inspect` module's functions, such as :func:`getmoduleinfo` and :func:`getargs`, now return named tuples. In addition to behaving like tuples, the elements of the return value can also be accessed as attributes. (Contributed by Raymond Hettinger.)
es: La mayoría de las funciones del módulo :mod:`inspect`, como :func:`getmoduleinfo` y :func:`getargs`, ahora devuelven tuplas con nombre. Además de comportarse como tuplas, también se puede acceder a los elementos del valor devuelto como atributos. (Contribución de Raymond Hettinger)

source: Some new functions in the module include :func:`isgenerator`, :func:`isgeneratorfunction`, and :func:`isabstract`.
es: Algunas de las nuevas funciones del módulo son :func:`isgenerator`, :func:`isgeneratorfunction` y :func:`isabstract`.

source: The :mod:`itertools` module gained several new functions.
es: El módulo :mod:`itertools` ha ganado varias funciones nuevas.

source: ``izip_longest(iter1, iter2, ...[, fillvalue])`` makes tuples from each of the elements; if some of the iterables are shorter than others, the missing values are set to *fillvalue*. For example::
es: ``izip_longest(iter1, iter2, ...[, fillvalue])`` hace tuplas de cada uno de los elementos; si algunos de los iterables son más cortos que otros, los valores que faltan se ponen a *fillvalue*. Por ejemplo::

source: ``product(iter1, iter2, ..., [repeat=N])`` returns the Cartesian product of the supplied iterables, a set of tuples containing every possible combination of the elements returned from each iterable. ::
es: ``product(iter1, iter2, ..., [repeat=N])`` devuelve el producto cartesiano de los iterables suministrados, un conjunto de tuplas que contiene todas las combinaciones posibles de los elementos devueltos de cada iterable. ::

source: The optional *repeat* keyword argument is used for taking the product of an iterable or a set of iterables with themselves, repeated *N* times. With a single iterable argument, *N*-tuples are returned::
es: El argumento opcional de la palabra clave *repeat* se utiliza para tomar el producto de un iterable o un conjunto de iterables con ellos mismos, repetido *N* veces. Con un único argumento iterable, se devuelven *N*-tuplas::

source: With two iterables, *2N*-tuples are returned. ::
es: Con dos iterables, se devuelven *2N*-tuplas. ::

source: ``combinations(iterable, r)`` returns sub-sequences of length *r* from the elements of *iterable*. ::
es: ``combinaciones(iterable, r)`` devuelve subsecuencias de longitud *r* de los elementos de *iterable*. ::

source: ``permutations(iter[, r])`` returns all the permutations of length *r* of the iterable's elements. If *r* is not specified, it will default to the number of elements produced by the iterable. ::
es: ``permutaciones(iter[, r])`` devuelve todas las permutaciones de longitud *r* de los elementos del iterable. Si no se especifica *r*, por defecto será el número de elementos producidos por el iterable. ::

source: ``itertools.chain(*iterables)`` is an existing function in :mod:`itertools` that gained a new constructor in Python 2.6. ``itertools.chain.from_iterable(iterable)`` takes a single iterable that should return other iterables. :func:`chain` will then return all the elements of the first iterable, then all the elements of the second, and so on. ::
es: ``itertools.chain(*iterables)`` es una función existente en :mod:`itertools` que obtuvo un nuevo constructor en Python 2.6. ``itertools.chain.from_iterable(iterable)`` toma un único iterable que debe devolver otros iterables. :func:`chain` devolverá entonces todos los elementos del primer iterable, luego todos los elementos del segundo, y así sucesivamente. ::

source: (All contributed by Raymond Hettinger.)
es: (Todo ello aportado por Raymond Hettinger)

source: The :mod:`logging` module's :class:`FileHandler` class and its subclasses :class:`WatchedFileHandler`, :class:`RotatingFileHandler`, and :class:`TimedRotatingFileHandler` now have an optional *delay* parameter to their constructors. If *delay* is true, opening of the log file is deferred until the first :meth:`emit` call is made. (Contributed by Vinay Sajip.)
es: La clase :mod:`logging` del módulo :class:`FileHandler` y sus subclases :class:`WatchedFileHandler`, :class:`RotatingFileHandler` y :class:`TimedRotatingFileHandler` tienen ahora un parámetro opcional *delay* en sus constructores. Si *retraso* es verdadero, la apertura del fichero de registro se retrasa hasta que se realice la primera llamada :meth:`emit`. (Contribuido por Vinay Sajip.)

source: :class:`TimedRotatingFileHandler` also has a *utc* constructor parameter. If the argument is true, UTC time will be used in determining when midnight occurs and in generating filenames; otherwise local time will be used.
es: :class:`TimedRotatingFileHandler` también tiene un parámetro constructor *utc*. Si el argumento es verdadero, se utilizará la hora UTC para determinar cuándo ocurre la medianoche y para generar los nombres de los archivos; en caso contrario, se utilizará la hora local.

source: Several new functions were added to the :mod:`math` module:
es: Se han añadido varias funciones nuevas al módulo :mod:`math`:

source: :func:`~math.isinf` and :func:`~math.isnan` determine whether a given float is a (positive or negative) infinity or a NaN (Not a Number), respectively.
es: :func:`~math.isinf` y :func:`~math.isnan` determinan si un flotador dado es un infinito (positivo o negativo) o un NaN (Not a Number), respectivamente.

source: :func:`~math.copysign` copies the sign bit of an IEEE 754 number, returning the absolute value of *x* combined with the sign bit of *y*. For example, ``math.copysign(1, -0.0)`` returns -1.0. (Contributed by Christian Heimes.)
es: :func:`~math.copysign` copia el bit de signo de un número IEEE 754, devolviendo el valor absoluto de *x* combinado con el bit de signo de *y*. Por ejemplo, ``math.copysign(1, -0.0)`` devuelve -1.0. (Contribución de Christian Heimes)

source: :func:`~math.factorial` computes the factorial of a number. (Contributed by Raymond Hettinger; :issue:`2138`.)
es: :func:`~math.factorial` calcula el factorial de un número. (Contribuido por Raymond Hettinger; :issue:`2138`.)

source: :func:`~math.fsum` adds up the stream of numbers from an iterable, and is careful to avoid loss of precision through using partial sums. (Contributed by Jean Brouwers, Raymond Hettinger, and Mark Dickinson; :issue:`2819`.)
es: :func:`~math.fsum` suma el flujo de números de un iterable, y tiene cuidado de evitar la pérdida de precisión mediante el uso de sumas parciales. (Contribución de Jean Brouwers, Raymond Hettinger y Mark Dickinson; :issue:`2819`)

source: :func:`~math.acosh`, :func:`~math.asinh` and :func:`~math.atanh` compute the inverse hyperbolic functions.
es: :func:`~math.acosh`, :func:`~math.asinh` y :func:`~math.atanh` calculan las funciones hiperbólicas inversas.

source: :func:`~math.log1p` returns the natural logarithm of *1+x* (base *e*).
es: :func:`~math.log1p` devuelve el logaritmo natural de *1+x* (base *e*).

source: :func:`trunc` rounds a number toward zero, returning the closest :class:`Integral` that's between the function's argument and zero. Added as part of the backport of `PEP 3141's type hierarchy for numbers <#pep-3141>`__.
es: :func:`trunc` redondea un número hacia cero, devolviendo el :class:`Integral` más cercano que esté entre el argumento de la función y el cero. Añadido como parte del backport de la jerarquía de tipos de números de `PEP 3141 <#pep-3141>`__.

source: The :mod:`math` module has been improved to give more consistent behaviour across platforms, especially with respect to handling of floating-point exceptions and IEEE 754 special values.
es: El módulo :mod:`math` se ha mejorado para ofrecer un comportamiento más coherente en todas las plataformas, especialmente en lo que respecta al manejo de las excepciones de punto flotante y los valores especiales IEEE 754.

source: Whenever possible, the module follows the recommendations of the C99 standard about 754's special values. For example, ``sqrt(-1.)`` should now give a :exc:`ValueError` across almost all platforms, while ``sqrt(float('NaN'))`` should return a NaN on all IEEE 754 platforms. Where Annex 'F' of the C99 standard recommends signaling 'divide-by-zero' or 'invalid', Python will raise :exc:`ValueError`. Where Annex 'F' of the C99 standard recommends signaling 'overflow', Python will raise :exc:`OverflowError`. (See :issue:`711019` and :issue:`1640`.)
es: Siempre que es posible, el módulo sigue las recomendaciones del estándar C99 sobre los valores especiales de 754. Por ejemplo, ``sqrt(-1.)`` debería dar ahora un :exc:`ValueError` en casi todas las plataformas, mientras que ``sqrt(float('NaN'))`` debería devolver un NaN en todas las plataformas IEEE 754. Cuando el Anexo 'F' del estándar C99 recomiende señalar 'dividir por cero' o 'inválido', Python lanzará :exc:`ValueError`. Cuando el Anexo 'F' del estándar C99 recomiende señalar 'desbordamiento', Python lanzará :exc:`OverflowError`. (Ver :issue:`711019` y :issue:`1640`)

source: (Contributed by Christian Heimes and Mark Dickinson.)
es: (Contribución de Christian Heimes y Mark Dickinson)

source: :class:`~mmap.mmap` objects now have a :meth:`rfind` method that searches for a substring beginning at the end of the string and searching backwards. The :meth:`find` method also gained an *end* parameter giving an index at which to stop searching. (Contributed by John Lenton.)
es: Los objetos :class:`~mmap.mmap` tienen ahora un método :meth:`rfind` que busca una subcadena empezando por el final de la cadena y buscando hacia atrás. El método :meth:`find` también ha ganado un parámetro *end* que da un índice en el que parar la búsqueda. (Contribución de John Lenton)

source: The :mod:`operator` module gained a :func:`methodcaller` function that takes a name and an optional set of arguments, returning a callable that will call the named function on any arguments passed to it. For example::
es: El módulo :mod:`operator` ganó una función :func:`methodcaller` que toma un nombre y un conjunto opcional de argumentos, devolviendo un callable que llamará a la función nombrada en cualquier argumento que se le pase. Por ejemplo::

source: (Contributed by Georg Brandl, after a suggestion by Gregory Petrosyan.)
es: (Contribución de Georg Brandl, tras una sugerencia de Gregory Petrosyan)

source: The :func:`attrgetter` function now accepts dotted names and performs the corresponding attribute lookups::
es: La función :func:`attrgetter` acepta ahora nombres con puntos y realiza las correspondientes búsquedas de atributos::

source: (Contributed by Georg Brandl, after a suggestion by Barry Warsaw.)
es: (Contribución de Georg Brandl, tras una sugerencia de Barry Warsaw)

source: The :mod:`os` module now wraps several new system calls. ``fchmod(fd, mode)`` and ``fchown(fd, uid, gid)`` change the mode and ownership of an opened file, and ``lchmod(path, mode)`` changes the mode of a symlink. (Contributed by Georg Brandl and Christian Heimes.)
es: El módulo :mod:`os` incluye ahora varias llamadas nuevas al sistema. ``fchmod(fd, mode)`` y ``fchown(fd, uid, gid)`` cambian el modo y la propiedad de un fichero abierto, y ``lchmod(path, mode)`` cambia el modo de un enlace simbólico. (Contribución de Georg Brandl y Christian Heimes)

source: :func:`chflags` and :func:`lchflags` are wrappers for the corresponding system calls (where they're available), changing the flags set on a file. Constants for the flag values are defined in the :mod:`stat` module; some possible values include :const:`UF_IMMUTABLE` to signal the file may not be changed and :const:`UF_APPEND` to indicate that data can only be appended to the file. (Contributed by M. Levinson.)
es: :func:`chflags` y :func:`lchflags` son envoltorios para las correspondientes llamadas al sistema (cuando están disponibles), que cambian las banderas establecidas en un archivo. Las constantes para los valores de las banderas se definen en el módulo :mod:`stat`; algunos valores posibles son :const:`UF_IMMUTABLE` para indicar que el fichero no puede ser modificado y :const:`UF_APPEND` para indicar que sólo se pueden añadir datos al fichero. (Contribución de M. Levinson)

source: ``os.closerange(low, high)`` efficiently closes all file descriptors from *low* to *high*, ignoring any errors and not including *high* itself. This function is now used by the :mod:`subprocess` module to make starting processes faster. (Contributed by Georg Brandl; :issue:`1663329`.)
es: ``os.closerange(low, high)`` cierra eficazmente todos los descriptores de fichero desde *low* hasta *high*, ignorando cualquier error y sin incluir a *high* mismo. Esta función es ahora utilizada por el módulo :mod:`subprocess` para hacer más rápido el arranque de procesos. (Contribuido por Georg Brandl; :issue:`1663329`.)

source: The ``os.environ`` object's :meth:`clear` method will now unset the environment variables using :func:`os.unsetenv` in addition to clearing the object's keys. (Contributed by Martin Horcicka; :issue:`1181`.)
es: El método :meth:`clear` del objeto ``os.environ`` ahora desajustará las variables de entorno utilizando :func:`os.unsetenv` además de borrar las claves del objeto. (Contribuido por Martin Horcicka; :issue:`1181`.)

source: The :func:`os.walk` function now has a ``followlinks`` parameter. If set to True, it will follow symlinks pointing to directories and visit the directory's contents. For backward compatibility, the parameter's default value is false. Note that the function can fall into an infinite recursion if there's a symlink that points to a parent directory. (:issue:`1273829`)
es: La función :func:`os.walk` tiene ahora un parámetro ``followlinks``. Si se establece como True, seguirá los enlaces simbólicos que apunten a directorios y visitará el contenido del directorio. Por compatibilidad con el pasado, el valor por defecto del parámetro es false. Tenga en cuenta que la función puede caer en una recursión infinita si hay un enlace simbólico que apunte a un directorio padre. (:issue:`1273829`)

source: In the :mod:`os.path` module, the :func:`splitext` function has been changed to not split on leading period characters. This produces better results when operating on Unix's dot-files. For example, ``os.path.splitext('.ipython')`` now returns ``('.ipython', '')`` instead of ``('', '.ipython')``. (:issue:`1115886`)
es: En el módulo :mod:`os.path`, la función :func:`splitext` ha sido modificada para no dividir los caracteres de punto inicial. Esto produce mejores resultados cuando se opera con archivos de puntos de Unix. Por ejemplo, ``os.path.splitext('.ipython')`` ahora devuelve ``('.ipython', '')`` en lugar de ``('', '.ipython')``. (:issue:`1115886`)

source: A new function, ``os.path.relpath(path, start='.')``, returns a relative path from the ``start`` path, if it's supplied, or from the current working directory to the destination ``path``. (Contributed by Richard Barran; :issue:`1339796`.)
es: Una nueva función, ``os.path.relpath(path, start='.')``, devuelve una ruta relativa desde la ruta ``start``, si se suministra, o desde el directorio de trabajo actual hasta el destino ``path``. (Contribución de Richard Barran; :issue:`1339796`.)

source: On Windows, :func:`os.path.expandvars` will now expand environment variables given in the form "%var%", and "~user" will be expanded into the user's home directory path. (Contributed by Josiah Carlson; :issue:`957650`.)
es: En Windows, :func:`os.path.expandvars` ahora expandirá las variables de entorno dadas en la forma "%var%", y "~user" se expandirá en la ruta del directorio personal del usuario. (Contribución de Josiah Carlson; :issue:`957650`.)

source: The Python debugger provided by the :mod:`pdb` module gained a new command: "run" restarts the Python program being debugged and can optionally take new command-line arguments for the program. (Contributed by Rocky Bernstein; :issue:`1393667`.)
es: El depurador de Python proporcionado por el módulo :mod:`pdb` ganó un nuevo comando: "run" reinicia el programa Python que se está depurando y puede tomar opcionalmente nuevos argumentos de línea de comandos para el programa. (Contribución de Rocky Bernstein; :issue:`1393667`.)
