Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: If *BLOCK* raises an exception, the context manager's :meth:`__exit__` method is called with three arguments, the exception details (``type, value, traceback``, the same values returned by :func:`sys.exc_info`, which can also be ``None`` if no exception occurred). The method's return value controls whether an exception is re-raised: any false value re-raises the exception, and ``True`` will result in suppressing it. You'll only rarely want to suppress the exception, because if you do the author of the code containing the ':keyword:`with`' statement will never realize anything went wrong.
es: Si *BLOCK* lanza una excepción, se llama al método :meth:`__exit__` del gestor de contexto con tres argumentos, los detalles de la excepción (``type, value, traceback``, los mismos valores retornados por :func:`sys.exc_info`, que también puede ser ``None`` si no se produjo ninguna excepción). El valor de retorno del método controla si se vuelve a generar una excepción: cualquier valor *false* vuelve a lanzar la excepción, y ``True`` resultará en inhibirla. Rara vez querrá suprimir la excepción, porque si lo hace, el autor del código que contenga la sentencia ':keyword:`with`' nunca se dará cuenta de que algo salió mal.

source: If *BLOCK* didn't raise an exception, the :meth:`__exit__` method is still called, but *type*, *value*, and *traceback* are all ``None``.
es: Si *BLOCK* no lanzó una excepción, el método :meth:`__exit__` continúa llamándose, pero *type*, *value* y *traceback* son todos ``None``.

source: Let's think through an example. I won't present detailed code but will only sketch the methods necessary for a database that supports transactions.
es: Pensemos en un ejemplo. No presentaré un código detallado, solo bosquejaré los métodos necesarios para una base de datos que admita transacciones.

source: (For people unfamiliar with database terminology: a set of changes to the database are grouped into a transaction. Transactions can be either committed, meaning that all the changes are written into the database, or rolled back, meaning that the changes are all discarded and the database is unchanged. See any database textbook for more information.)
es: (Para las personas que no están familiarizadas con la terminología de la base de datos: un conjunto de cambios en la base de datos se agrupa en una transacción. Las transacciones pueden confirmarse, lo que significa que todos los cambios se escriben en la base de datos, o deshacerse, lo que significa que todos los cambios se descartan y la base de datos no ha cambiado. Consulte cualquier libro de texto de base de datos para obtener más información.)

source: Let's assume there's an object representing a database connection. Our goal will be to let the user write code like this::
es: Supongamos que hay un objeto que representa una conexión de base de datos. Nuestro objetivo será permitir que el usuario escriba un código como este::

source: The transaction should be committed if the code in the block runs flawlessly or rolled back if there's an exception. Here's the basic interface for :class:`DatabaseConnection` that I'll assume::
es: La transacción debe confirmarse si el código del bloque se ejecuta sin problemas o revertirse si hay una excepción. Aquí está la interfaz básica para :class:`DatabaseConnection` que asumiré::

source: The :meth:`__enter__` method is pretty easy, having only to start a new transaction. For this application the resulting cursor object would be a useful result, so the method will return it. The user can then add ``as cursor`` to their ':keyword:`with`' statement to bind the cursor to a variable name. ::
es: El método :meth:`__enter__` es bastante fácil, ya que solo tiene que iniciar una nueva transacción. Para esta aplicación, el objeto cursor resultante sería un resultado útil, por lo que el método lo retornará. Luego, el usuario puede agregar ``as cursor`` a su sentencia ':keyword:`with`' para vincular el cursor a un nombre de variable. ::

source: The :meth:`__exit__` method is the most complicated because it's where most of the work has to be done. The method has to check if an exception occurred. If there was no exception, the transaction is committed. The transaction is rolled back if there was an exception.
es: El método :meth:`__exit__` es el más complicado porque es donde se debe realizar la mayor parte del trabajo. El método debe verificar si ocurrió una excepción. Si no hubo excepción, la transacción se confirma. La transacción se revierte si hubo una excepción.

source: In the code below, execution will just fall off the end of the function, returning the default value of ``None``. ``None`` is false, so the exception will be re-raised automatically. If you wished, you could be more explicit and add a :keyword:`return` statement at the marked location. ::
es: En el siguiente código, la ejecución simplemente caerá al final de la función, retornando el valor predeterminado ``None``. ``None`` es falso, por lo que la excepción se volverá a lanzar automáticamente. Si lo desea, puede ser más explícito y agregar una sentencia :keyword:`return` en la ubicación marcada. ::

source: The contextlib module
es: El módulo contextlib

source: The :mod:`contextlib` module provides some functions and a decorator that are useful when writing objects for use with the ':keyword:`with`' statement.
es: El módulo :mod:`contextlib` proporciona algunas funciones y un decorador que son útiles al escribir objetos para usar con la sentencia ':keyword:`with`'.

source: The decorator is called :func:`contextmanager`, and lets you write a single generator function instead of defining a new class. The generator should yield exactly one value. The code up to the :keyword:`yield` will be executed as the :meth:`__enter__` method, and the value yielded will be the method's return value that will get bound to the variable in the ':keyword:`with`' statement's :keyword:`!as` clause, if any. The code after the :keyword:`!yield` will be executed in the :meth:`__exit__` method. Any exception raised in the block will be raised by the :keyword:`!yield` statement.
es: El decorador se llama :func:`contextmanager`, y te permite escribir una única función generadora en lugar de definir una clase nueva. El generador debería producir exactamente un valor. El código hasta :keyword:`yield` se ejecutará como el método :meth:`__enter__`, y el valor obtenido será el valor de retorno del método que se vinculará a la variable en la clausula :keyword:`!as` (si la hay) de la sentencia ':keyword:`with`'. El código después de :keyword:`!yield` se ejecutará en el método :meth:`__exit__` . Cualquier excepción lanzada en el bloque será generada por la sentencia :keyword:`!yield`.

source: Using this decorator, our database example from the previous section could be written as::
es: Usando este decorador, nuestro ejemplo de base de datos de la sección anterior podría escribirse como::

source: The :mod:`contextlib` module also has a ``nested(mgr1, mgr2, ...)`` function that combines a number of context managers so you don't need to write nested ':keyword:`with`' statements. In this example, the single ':keyword:`!with`' statement both starts a database transaction and acquires a thread lock::
es: El módulo :mod:`contextlib` también tiene una función ``nested(mgr1, mgr2, ...)`` que combina varios gestores de contexto para que no necesite escribir sentencias ':keyword:`with`' anidadas. En este ejemplo, se utiliza una única sentencia ':keyword:`!with`' que inicia una transacción de base de datos y adquiere un bloqueo del hilo::

source: Finally, the :func:`closing` function returns its argument so that it can be bound to a variable, and calls the argument's ``.close()`` method at the end of the block. ::
es: Por último, la función :func:`close` retorna su argumento para que pueda vincularse a una variable, y llama al método ``.close()`` del argumento al final del bloque. ::

source: :pep:`343` - The "with" statement
es: :pep:`343` - La sentencia "with"

source: PEP written by Guido van Rossum and Nick Coghlan; implemented by Mike Bland, Guido van Rossum, and Neal Norwitz. The PEP shows the code generated for a ':keyword:`with`' statement, which can be helpful in learning how the statement works.
es: PEP escrito por Guido van Rossum y Nick Coghlan; implementado por Mike Bland, Guido van Rossum y Neal Norwitz. El PEP muestra el código generado para una sentencia ':keyword:`with`', que puede ser útil para aprender cómo la sentencia funciona.

source: The documentation for the :mod:`contextlib` module.
es: La documentación para el módulo :mod:`contextlib`.

source: PEP 366: Explicit Relative Imports From a Main Module
es: PEP 366: Importaciones relativas explícitas desde un módulo principal

source: Python's :option:`-m` switch allows running a module as a script. When you ran a module that was located inside a package, relative imports didn't work correctly.
es: El modificador de Python :option:`-m` permite ejecutar un módulo como un script. Cuando ejecutabas un módulo que estaba ubicado dentro de un paquete, las importaciones relativas no funcionaban correctamente.

source: The fix for Python 2.6 adds a :attr:`__package__` attribute to modules. When this attribute is present, relative imports will be relative to the value of this attribute instead of the :attr:`__name__` attribute.
es: La corrección para Python 2.6 agrega un atributo :attr:`__package__` a los módulos. Cuando este atributo está presente, las importaciones relativas serán relativas al valor de este atributo en lugar del atributo :attr:`__name__`.

source: PEP 302-style importers can then set :attr:`__package__` as necessary. The :mod:`runpy` module that implements the :option:`-m` switch now does this, so relative imports will now work correctly in scripts running from inside a package.
es: Las importaciones de estilo PEP 302 pueden configurar :attr:`__package__` según sea necesario. El módulo :mod:`runpy` que implementa el modificador :option:`-m` ahora hace esto, por lo que las importaciones relativas ahora funcionarán correctamente en los scripts que se ejecutan desde el interior de un paquete.

source: PEP 370: Per-user ``site-packages`` Directory
es: PEP 370: Directorio de ``site-packages`` por usuario

source: When you run Python, the module search path ``sys.path`` usually includes a directory whose path ends in ``"site-packages"``. This directory is intended to hold locally installed packages available to all users using a machine or a particular site installation.
es: Cuando ejecuta Python, la ruta de búsqueda del módulo ``sys.path`` generalmente incluye un directorio cuya ruta termina en ``"site-packages"``. Este directorio está destinado a contener paquetes instalados localmente disponibles para todos los usuarios que utilizan una máquina o un sitio de instalación en particular.

source: Python 2.6 introduces a convention for user-specific site directories. The directory varies depending on the platform:
es: Python 2.6 introduce una convención para directorios de sitios específicos del usuario. El directorio varía según la plataforma:

source: Unix and Mac OS X: :file:`~/.local/`
es: Unix y Mac OS X: :file:`~/.local/`

source: Within this directory, there will be version-specific subdirectories, such as :file:`lib/python2.6/site-packages` on Unix/Mac OS and :file:`Python26/site-packages` on Windows.
es: Dentro de este directorio, habrá subdirectorios específicos de versión, como :file:`lib/python2.6/site-packages` en Unix/Mac OS y :file:`Python26/site-packages` en Windows.

source: If you don't like the default directory, it can be overridden by an environment variable. :envvar:`PYTHONUSERBASE` sets the root directory used for all Python versions supporting this feature. On Windows, the directory for application-specific data can be changed by setting the :envvar:`APPDATA` environment variable. You can also modify the :file:`site.py` file for your Python installation.
es: Si no le gusta el directorio predeterminado, puede sobrescribirlo mediante una variable de entorno. :envvar:`PYTHONUSERBASE` establece el directorio raíz utilizado para todas las versiones de Python que admiten esta función. En Windows, el directorio de datos específicos de la aplicación se puede cambiar configurando la variable de entorno :envvar:`APPDATA`. También puede modificar el archivo :file:`site.py` para su instalación de Python.

source: The feature can be disabled entirely by running Python with the :option:`-s` option or setting the :envvar:`PYTHONNOUSERSITE` environment variable.
es: La característica se puede desactivar por completo ejecutando Python con la opción :option:`-s` o *seteando* la variable de entorno :envvar:`PYTHONNOUSERSITE`.

source: :pep:`370` - Per-user ``site-packages`` Directory
es: PEP 370: Directorio de ``site-packages`` por usuario

source: PEP written and implemented by Christian Heimes.
es: PEP escrito e implementado por Christian Heimes.

source: PEP 371: The ``multiprocessing`` Package
es: PEP 371: El paquete ``multiprocessing``

source: The new :mod:`multiprocessing` package lets Python programs create new processes that will perform a computation and return a result to the parent. The parent and child processes can communicate using queues and pipes, synchronize their operations using locks and semaphores, and can share simple arrays of data.
es: El nuevo paquete :mod:`multiprocessing` permite a los programas de Python crear nuevos procesos que realizarán un cálculo y retornaran un resultado al padre. Los procesos padre e hijo pueden comunicarse mediante colas (*queues*) y tuberías (*pipes*), sincronizar sus operaciones mediante bloqueos y semáforos, y pueden compartir matrices simples de datos.

source: The :mod:`multiprocessing` module started out as an exact emulation of the :mod:`threading` module using processes instead of threads. That goal was discarded along the path to Python 2.6, but the general approach of the module is still similar. The fundamental class is the :class:`Process`, which is passed a callable object and a collection of arguments. The :meth:`start` method sets the callable running in a subprocess, after which you can call the :meth:`is_alive` method to check whether the subprocess is still running and the :meth:`join` method to wait for the process to exit.
es: El módulo :mod:`multiprocessing` comenzó como una emulación exacta del módulo :mod:`threading` usando procesos en lugar de hilos. Ese objetivo se descartó en el camino a Python 2.6, pero el enfoque general del módulo sigue siendo similar. La clase fundamental es :class:`Process`, a la que se le pasa un objeto invocable y una colección de argumentos. El método :meth:`start` establece el invocable ejecutándose en un subproceso, después de lo cual se puede llamar al método :meth:`is_alive` para verificar si el subproceso aún se está ejecutando y al método :meth:`join` para esperar al proceso para salir.

source: Here's a simple example where the subprocess will calculate a factorial. The function doing the calculation is written strangely so that it takes significantly longer when the input argument is a multiple of 4.
es: Aquí hay un ejemplo simple donde el subproceso calculará un factorial. La función que realiza el cálculo está escrita de forma extraña, por lo que lleva mucho más tiempo cuando el argumento de entrada es un múltiplo de 4.

source: A :class:`~queue.Queue` is used to communicate the result of the factorial. The :class:`~queue.Queue` object is stored in a global variable. The child process will use the value of the variable when the child was created; because it's a :class:`~queue.Queue`, parent and child can use the object to communicate. (If the parent were to change the value of the global variable, the child's value would be unaffected, and vice versa.)
es: Un :class:`~queue.Queue` se usa para comunicar el resultado del factorial. El objeto :class:`~queue.Queue` se almacena en una variable global. El proceso hijo usará el valor de la variable cuando se creó el hijo; porque es una :class:`~ queue.Queue`, padre e hijo pueden usar el objeto para comunicarse. (Si el padre cambiara el valor de la variable global, el valor del hijo no se vería afectado y viceversa).

source: Two other classes, :class:`Pool` and :class:`Manager`, provide higher-level interfaces. :class:`Pool` will create a fixed number of worker processes, and requests can then be distributed to the workers by calling :meth:`apply` or :meth:`apply_async` to add a single request, and :meth:`map` or :meth:`map_async` to add a number of requests. The following code uses a :class:`Pool` to spread requests across 5 worker processes and retrieve a list of results::
es: Otras dos clases, :class:`Pool` y :class:`Manager`, proporcionan interfaces de nivel superior. :class:`Pool` creará un número fijo de procesos de trabajo, y las solicitudes se pueden distribuir a los trabajadores llamando a :meth:`apply` o :meth:`apply_async` para agregar una sola solicitud, y :meth:`map` o :meth:`map_async` para agregar una serie de solicitudes. El siguiente código usa :class:`Pool` para distribuir las solicitudes en 5 procesos de trabajo y recuperar una lista de resultados::

source: This produces the following output::
es: Esto produce la siguiente salida::

source: The other high-level interface, the :class:`Manager` class, creates a separate server process that can hold master copies of Python data structures. Other processes can then access and modify these data structures using proxy objects. The following example creates a shared dictionary by calling the :meth:`dict` method; the worker processes then insert values into the dictionary. (Locking is not done for you automatically, which doesn't matter in this example. :class:`Manager`'s methods also include :meth:`Lock`, :meth:`RLock`, and :meth:`Semaphore` to create shared locks.)
es: La otra interfaz de alto nivel, la clase :class:`Manager`, crea un proceso de servidor separado que puede contener copias maestras de las estructuras de datos de Python. Luego, otros procesos pueden acceder y modificar estas estructuras de datos utilizando objetos proxy. El siguiente ejemplo crea un diccionario compartido llamando al método :meth:`dict`; los procesos de trabajo luego insertan valores en el diccionario. (El bloqueo no se realiza automáticamente, lo cual no importa en este ejemplo. Los métodos de :class:`Manager` también incluyen :meth:`Lock`, :meth:`RLock`, y :meth:`Semaphore` para crear bloqueos compartidos.)

source: This will produce the output::
es: Esto producirá la salida::

source: The documentation for the :mod:`multiprocessing` module.
es: La documentación del módulo :mod:`multiprocessing`.

source: :pep:`371` - Addition of the multiprocessing package
es: :pep:`371` - Adición del paquete de multiprocesamiento

source: PEP written by Jesse Noller and Richard Oudkerk; implemented by Richard Oudkerk and Jesse Noller.
es: PEP escrito por Jesse Noller y Richard Oudkerk; implementado por Richard Oudkerk y Jesse Noller.

source: PEP 3101: Advanced String Formatting
es: PEP 3101: Formateo avanzado de cadena de caracteres

source: In Python 3.0, the ``%`` operator is supplemented by a more powerful string formatting method, :meth:`format`. Support for the :meth:`str.format` method has been backported to Python 2.6.
es: En Python 3.0, el operador ``%`` se complementa con un método de formato de cadena más potente, :meth:`format`. La compatibilidad con el método :meth:`str.format` se ha retroalimentado a Python 2.6.

source: In 2.6, both 8-bit and Unicode strings have a ``.format()`` method that treats the string as a template and takes the arguments to be formatted. The formatting template uses curly brackets (``{``, ``}``) as special characters::
es: En 2.6, tanto las cadenas de 8 bits como las Unicode tienen un método ``.format()`` que trata la cadena como una plantilla y toma los argumentos para formatear. La plantilla de formato utiliza llaves (``{``, ``}``) como caracteres especiales:

source: Curly brackets can be escaped by doubling them::
es: Las llaves se pueden escapar duplicándose::

source: Field names can be integers indicating positional arguments, such as ``{0}``, ``{1}``, etc. or names of keyword arguments. You can also supply compound field names that read attributes or access dictionary keys::
es: Los nombres de campo pueden ser números enteros que indican argumentos posicionales, como ``{0}``, ``{1}``, etc. o nombres de argumentos de palabras clave. También puede proporcionar nombres de campos compuestos que lean atributos o accedan a claves de diccionario::

source: Note that when using dictionary-style notation such as ``[.mp4]``, you don't need to put any quotation marks around the string; it will look up the value using ``.mp4`` as the key. Strings beginning with a number will be converted to an integer. You can't write more complicated expressions inside a format string.
es: Tenga en cuenta que cuando utilice una notación de estilo diccionario como ``[.mp4]``, no es necesario poner comillas alrededor de la cadena; se buscará el valor usando ``.mp4`` como clave. Las cadenas de caracteres que comienzan con un número se convertirán en entero. No puede escribir expresiones más complicadas dentro de una cadena de formato.

source: So far we've shown how to specify which field to substitute into the resulting string. The precise formatting used is also controllable by adding a colon followed by a format specifier. For example::
es: Hasta ahora hemos mostrado cómo especificar qué campo sustituir en la cadena resultante. El formato preciso utilizado también se puede controlar agregando dos puntos seguidos de un especificador de formato. Por ejemplo::

source: Format specifiers can reference other fields through nesting::
es: Los especificadores de formato pueden hacer referencia a otros campos a través del anidamiento::

source: The alignment of a field within the desired width can be specified:
es: Se puede especificar la alineación de un campo dentro del ancho deseado:

source: Character
es: Carácter

source: Effect
es: Efecto

source: < (default)
es: < (por defecto)

source: Left-align
es: Alinear a la izquierda

source: Right-align
es: Alinear a la derecha

source: Center
es: Centrado

source: (For numeric types only) Pad after the sign.
es: (Solo para tipos numéricos) Relleno después del signo.

source: Format specifiers can also include a presentation type, which controls how the value is formatted. For example, floating-point numbers can be formatted as a general number or in exponential notation::
es: Los especificadores de formato también pueden incluir un tipo de presentación, que controla cómo se formatea el valor. Por ejemplo, los números de punto flotante pueden formatearse como un número general o en notación exponencial::

source: A variety of presentation types are available. Consult the 2.6 documentation for a :ref:`complete list <formatstrings>`; here's a sample:
es: Hay una variedad de tipos de presentación disponibles. Consulte la documentación 2.6 para obtener una :ref:`lista completa <formatstrings>`; aquí hay un ejemplo:

source: Binary. Outputs the number in base 2.
es: Binario. Emite el número en base 2.

source: Character. Converts the integer to the corresponding Unicode character before printing.
es: Carácter. Convierte el número entero en el carácter Unicode correspondiente antes de imprimirlo.

source: Decimal Integer. Outputs the number in base 10.
es: Entero Decimal. Muestra el número en base 10.

source: Octal format. Outputs the number in base 8.
es: Formato octal. Da salida al número en base 8.

source: Hex format. Outputs the number in base 16, using lower-case letters for the digits above 9.
es: Formato hexadecimal. Muestra el número en base 16, utilizando letras minúsculas para los dígitos superiores a 9.
