Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: A numerical nicety: when creating a complex number from two floats on systems that support signed zeros (-0 and +0), the :func:`complex` constructor will now preserve the sign of the zero. (Fixed by Mark T. Dickinson; :issue:`1507`.)
es: Un detalle numérico: cuando se crea un número complejo a partir de dos flotantes en sistemas que admiten ceros con signo (-0 y +0), el constructor :func:`complex` conserva ahora el signo del cero. (Corregido por Mark T. Dickinson; :issue:`1507`.)

source: Classes that inherit a :meth:`__hash__` method from a parent class can set ``__hash__ = None`` to indicate that the class isn't hashable. This will make ``hash(obj)`` raise a :exc:`TypeError` and the class will not be indicated as implementing the :class:`Hashable` ABC.
es: Las clases que heredan un método :meth:`__hash__` de una clase padre pueden establecer ``__hash__ = None`` para indicar que la clase no es hashable. Esto hará que ``hash(obj)`` lance un :exc:`TypeError` y la clase no será indicada como implementando el ABC de :class:`Hashable`.

source: You should do this when you've defined a :meth:`__cmp__` or :meth:`__eq__` method that compares objects by their value rather than by identity. All objects have a default hash method that uses ``id(obj)`` as the hash value. There's no tidy way to remove the :meth:`__hash__` method inherited from a parent class, so assigning ``None`` was implemented as an override. At the C level, extensions can set ``tp_hash`` to :c:func:`PyObject_HashNotImplemented`. (Fixed by Nick Coghlan and Amaury Forgeot d'Arc; :issue:`2235`.)
es: Debes hacer esto cuando hayas definido un método :meth:`__cmp__` o :meth:`__eq__` que compare objetos por su valor en lugar de por su identidad. Todos los objetos tienen un método hash por defecto que utiliza ``id(obj)`` como valor hash. No hay una forma ordenada de eliminar el método :meth:`__hash__` heredado de una clase padre, por lo que la asignación de ``None`` fue implementada como una sobreescritura. A nivel de C, las extensiones pueden establecer ``tp_hash`` a :c:func:`PyObject_HashNotImplemented`. (Corregido por Nick Coghlan y Amaury Forgeot d'Arc; :issue:`2235`.)

source: The :exc:`GeneratorExit` exception now subclasses :exc:`BaseException` instead of :exc:`Exception`. This means that an exception handler that does ``except Exception:`` will not inadvertently catch :exc:`GeneratorExit`. (Contributed by Chad Austin; :issue:`1537`.)
es: La excepción :exc:`GeneratorExit` ahora subclasa :exc:`BaseException` en lugar de :exc:`Exception`. Esto significa que un manejador de excepciones que haga ``except Exception:`` no atrapará inadvertidamente :exc:`GeneratorExit`. (Contribuido por Chad Austin; :issue:`1537`.)

source: Generator objects now have a :attr:`gi_code` attribute that refers to the original code object backing the generator. (Contributed by Collin Winter; :issue:`1473257`.)
es: Los objetos generadores tienen ahora un atributo :attr:`gi_code` que hace referencia al objeto de código original que respalda al generador. (Contribución de Collin Winter; :issue:`1473257`.)

source: The :func:`compile` built-in function now accepts keyword arguments as well as positional parameters. (Contributed by Thomas Wouters; :issue:`1444529`.)
es: La función incorporada :func:`compile` ahora acepta argumentos de palabras clave así como parámetros posicionales. (Contribución de Thomas Wouters; :issue:`1444529`.)

source: The :func:`complex` constructor now accepts strings containing parenthesized complex numbers, meaning that ``complex(repr(cplx))`` will now round-trip values. For example, ``complex('(3+4j)')`` now returns the value (3+4j). (:issue:`1491866`)
es: El constructor :func:`complex` ahora acepta cadenas que contengan números complejos entre paréntesis, lo que significa que ``complex(repr(cplx))`` ahora redondeará los valores. Por ejemplo, ``complex('(3+4j)')`` ahora devuelve el valor (3+4j). (:issue:`1491866`)

source: The string :meth:`translate` method now accepts ``None`` as the translation table parameter, which is treated as the identity transformation. This makes it easier to carry out operations that only delete characters. (Contributed by Bengt Richter and implemented by Raymond Hettinger; :issue:`1193128`.)
es: El método string :meth:`translate` acepta ahora ``None`` como parámetro de la tabla de traducción, que se trata como la transformación de identidad. Esto facilita la realización de operaciones que sólo eliminan caracteres. (Contribuido por Bengt Richter e implementado por Raymond Hettinger; :issue:`1193128`)

source: The built-in :func:`dir` function now checks for a :meth:`__dir__` method on the objects it receives. This method must return a list of strings containing the names of valid attributes for the object, and lets the object control the value that :func:`dir` produces. Objects that have :meth:`__getattr__` or :meth:`__getattribute__` methods can use this to advertise pseudo-attributes they will honor. (:issue:`1591665`)
es: La función incorporada :func:`dir` ahora comprueba si existe un método :meth:`__dir__` en los objetos que recibe. Este método debe devolver una lista de cadenas que contengan los nombres de los atributos válidos para el objeto, y permite al objeto controlar el valor que :func:`dir` produce. Los objetos que tienen métodos :meth:`__getattr__` o :meth:`__getattribute__` pueden usar esto para anunciar los pseudo-atributos que respetarán. (:issue:`1591665`)

source: Instance method objects have new attributes for the object and function comprising the method; the new synonym for :attr:`im_self` is :attr:`__self__`, and :attr:`im_func` is also available as :attr:`__func__`. The old names are still supported in Python 2.6, but are gone in 3.0.
es: Los objetos de método de instancia tienen nuevos atributos para el objeto y la función que comprende el método; el nuevo sinónimo de :attr:`im_self` es :attr:`__self__`, y :attr:`im_func` también está disponible como :attr:`__func__`. Los nombres antiguos todavía se soportan en Python 2.6, pero han desaparecido en la 3.0.

source: An obscure change: when you use the :func:`locals` function inside a :keyword:`class` statement, the resulting dictionary no longer returns free variables. (Free variables, in this case, are variables referenced in the :keyword:`!class` statement that aren't attributes of the class.)
es: Un cambio oscuro: cuando se utiliza la función :func:`locals` dentro de una sentencia :keyword:`class`, el diccionario resultante ya no devuelve variables libres. (Las variables libres, en este caso, son variables referenciadas en la sentencia :keyword:`!class` que no son atributos de la clase)

source: Optimizations
es: Optimizaciones

source: The :mod:`warnings` module has been rewritten in C. This makes it possible to invoke warnings from the parser, and may also make the interpreter's startup faster. (Contributed by Neal Norwitz and Brett Cannon; :issue:`1631171`.)
es: El módulo :mod:`warnings` ha sido reescrito en C. Esto hace posible invocar advertencias desde el analizador sintáctico, y también puede hacer que el arranque del intérprete sea más rápido. (Contribuido por Neal Norwitz y Brett Cannon; :issue:`1631171`.)

source: Type objects now have a cache of methods that can reduce the work required to find the correct method implementation for a particular class; once cached, the interpreter doesn't need to traverse base classes to figure out the right method to call. The cache is cleared if a base class or the class itself is modified, so the cache should remain correct even in the face of Python's dynamic nature. (Original optimization implemented by Armin Rigo, updated for Python 2.6 by Kevin Jacobs; :issue:`1700288`.)
es: Los objetos de tipo tienen ahora una caché de métodos que puede reducir el trabajo necesario para encontrar la implementación del método correcto para una clase en particular; una vez almacenada en la caché, el intérprete no necesita recorrer las clases base para averiguar el método correcto a llamar. La caché se borra si una clase base o la propia clase se modifica, por lo que la caché debería seguir siendo correcta incluso ante la naturaleza dinámica de Python. (Optimización original implementada por Armin Rigo, actualizada para Python 2.6 por Kevin Jacobs; :issue:`1700288`.)

source: By default, this change is only applied to types that are included with the Python core. Extension modules may not necessarily be compatible with this cache, so they must explicitly add :c:macro:`Py_TPFLAGS_HAVE_VERSION_TAG` to the module's ``tp_flags`` field to enable the method cache. (To be compatible with the method cache, the extension module's code must not directly access and modify the ``tp_dict`` member of any of the types it implements. Most modules don't do this, but it's impossible for the Python interpreter to determine that. See :issue:`1878` for some discussion.)
es: Por defecto, este cambio sólo se aplica a los tipos que se incluyen con el núcleo de Python. Los módulos de extensión no son necesariamente compatibles con esta caché, por lo que deben añadir explícitamente :c:macro:`Py_TPFLAGS_HAVE_VERSION_TAG` al campo ``tp_flags`` del módulo para habilitar la caché de métodos. (Para ser compatible con la caché de métodos, el código del módulo de extensión no debe acceder directamente ni modificar el miembro ``tp_dict`` de ninguno de los tipos que implementa. La mayoría de los módulos no lo hacen, pero es imposible que el intérprete de Python lo determine. Ver :issue:`1878` para una discusión)

source: Function calls that use keyword arguments are significantly faster by doing a quick pointer comparison, usually saving the time of a full string comparison. (Contributed by Raymond Hettinger, after an initial implementation by Antoine Pitrou; :issue:`1819`.)
es: Las llamadas a funciones que utilizan argumentos de palabras clave son significativamente más rápidas al hacer una comparación rápida de punteros, lo que suele ahorrar el tiempo de una comparación completa de cadenas. (Contribución de Raymond Hettinger, tras una implementación inicial de Antoine Pitrou; :issue:`1819`)

source: All of the functions in the :mod:`struct` module have been rewritten in C, thanks to work at the Need For Speed sprint. (Contributed by Raymond Hettinger.)
es: Todas las funciones del módulo :mod:`struct` han sido reescritas en C, gracias al trabajo en el sprint de Need For Speed. (Contribución de Raymond Hettinger)

source: Some of the standard built-in types now set a bit in their type objects. This speeds up checking whether an object is a subclass of one of these types. (Contributed by Neal Norwitz.)
es: Algunos de los tipos estándar incorporados ahora establecen un bit en sus objetos de tipo. Esto acelera la comprobación de si un objeto es una subclase de uno de estos tipos. (Contribución de Neal Norwitz)

source: Unicode strings now use faster code for detecting whitespace and line breaks; this speeds up the :meth:`split` method by about 25% and :meth:`splitlines` by 35%. (Contributed by Antoine Pitrou.) Memory usage is reduced by using pymalloc for the Unicode string's data.
es: Las cadenas Unicode utilizan ahora un código más rápido para detectar los espacios en blanco y los saltos de línea; esto acelera el método :meth:`split` en un 25% a y :meth:`splitlines` en un 35%. (Contribuido por Antoine Pitrou.) El uso de la memoria se reduce utilizando pymalloc para los datos de la cadena Unicode.

source: The ``with`` statement now stores the :meth:`__exit__` method on the stack, producing a small speedup. (Implemented by Jeffrey Yasskin.)
es: La sentencia ``with`` ahora almacena el método :meth:`__exit__` en la pila, produciendo un pequeño aumento de velocidad. (Implementado por Jeffrey Yasskin)

source: To reduce memory usage, the garbage collector will now clear internal free lists when garbage-collecting the highest generation of objects. This may return memory to the operating system sooner.
es: Para reducir el uso de memoria, el recolector de basura ahora borrará las listas libres internas cuando recolecte la generación más alta de objetos. Esto puede devolver la memoria al sistema operativo antes.

source: Interpreter Changes
es: Cambios de intérprete

source: Two command-line options have been reserved for use by other Python implementations. The :option:`-J` switch has been reserved for use by Jython for Jython-specific options, such as switches that are passed to the underlying JVM. :option:`-X` has been reserved for options specific to a particular implementation of Python such as CPython, Jython, or IronPython. If either option is used with Python 2.6, the interpreter will report that the option isn't currently used.
es: Se han reservado dos opciones de la línea de comandos para su uso por otras implementaciones de Python. La opción :option:`-J` se ha reservado para su uso por parte de Jython para las opciones específicas de Jython, como los interruptores que se pasan a la JVM subyacente. :option:`-X` se ha reservado para las opciones específicas de una implementación particular de Python como CPython, Jython o IronPython. Si cualquiera de estas opciones se utiliza con Python 2.6, el intérprete informará de que la opción no se utiliza actualmente.

source: Python can now be prevented from writing :file:`.pyc` or :file:`.pyo` files by supplying the :option:`-B` switch to the Python interpreter, or by setting the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable before running the interpreter. This setting is available to Python programs as the ``sys.dont_write_bytecode`` variable, and Python code can change the value to modify the interpreter's behaviour. (Contributed by Neal Norwitz and Georg Brandl.)
es: Ahora se puede evitar que Python escriba archivos :file:`.pyc` o :file:`.pyo` proporcionando el modificador :option:`-B` al intérprete de Python, o estableciendo la variable de entorno :envvar:`PYTHONDONTWRITEBYTECODE` antes de ejecutar el intérprete. Esta configuración está disponible para los programas de Python como la variable ``sys.dont_write_bytecode``, y el código de Python puede cambiar el valor para modificar el comportamiento del intérprete. (Contribución de Neal Norwitz y Georg Brandl)

source: The encoding used for standard input, output, and standard error can be specified by setting the :envvar:`PYTHONIOENCODING` environment variable before running the interpreter. The value should be a string in the form ``<encoding>`` or ``<encoding>:<errorhandler>``. The *encoding* part specifies the encoding's name, e.g. ``utf-8`` or ``latin-1``; the optional *errorhandler* part specifies what to do with characters that can't be handled by the encoding, and should be one of "error", "ignore", or "replace". (Contributed by Martin von Löwis.)
es: La codificación utilizada para la entrada, la salida y el error estándar puede especificarse estableciendo la variable de entorno :envvar:`PYTHONIOENCODING` antes de ejecutar el intérprete. El valor debe ser una cadena de la forma ``<encoding>`` o ``<encoding>:<errorhandler>``. La parte *encoding* especifica el nombre de la codificación, por ejemplo ``utf-8`` o ``latin-1``; la parte opcional *errorhandler* especifica qué hacer con los caracteres que no pueden ser manejados por la codificación, y debe ser una de las opciones "error", "ignorar" o "reemplazar". (Contribución de Martin von Löwis)</errorhandler></encoding></encoding>

source: New and Improved Modules
es: Módulos nuevos y mejorados

source: As in every release, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the Subversion logs for all the details.
es: Como en cada versión, la biblioteca estándar de Python ha recibido una serie de mejoras y correcciones de errores. Aquí hay una lista parcial de los cambios más notables, ordenados alfabéticamente por nombre de módulo. Consulta el archivo :file:`Misc/NEWS` en el árbol de fuentes para una lista más completa de cambios, o mira los registros de Subversion para todos los detalles.

source: The :mod:`asyncore` and :mod:`asynchat` modules are being actively maintained again, and a number of patches and bugfixes were applied. (Maintained by Josiah Carlson; see :issue:`1736190` for one patch.)
es: Los módulos :mod:`asyncore` y :mod:`asynchat` están siendo mantenidos activamente de nuevo, y se han aplicado varios parches y correcciones de errores. (Mantenido por Josiah Carlson; véase :issue:`1736190` para un parche)

source: The :mod:`bsddb` module also has a new maintainer, Jesús Cea Avión, and the package is now available as a standalone package. The web page for the package is `www.jcea.es/programacion/pybsddb.htm <https://www.jcea.es/programacion/pybsddb.htm>`__. The plan is to remove the package from the standard library in Python 3.0, because its pace of releases is much more frequent than Python's.
es: El módulo :mod:`bsddb` también tiene un nuevo mantenedor, Jesús Cea Avión, y el paquete está ahora disponible como paquete independiente. La página web del paquete es `www.jcea.es/programacion/pybsddb.htm <https://www.jcea.es/programacion/pybsddb.htm>`__. El plan es eliminar el paquete de la biblioteca estándar en Python 3.0, porque su ritmo de lanzamientos es mucho más frecuente que el de Python.

source: The :mod:`bsddb.dbshelve` module now uses the highest pickling protocol available, instead of restricting itself to protocol 1. (Contributed by W. Barnes.)
es: El módulo :mod:`bsddb.dbshelve` utiliza ahora el protocolo de decapado más alto disponible, en lugar de limitarse al protocolo 1. (Contribución de W. Barnes.)

source: The :mod:`cgi` module will now read variables from the query string of an HTTP POST request. This makes it possible to use form actions with URLs that include query strings such as "/cgi-bin/add.py?category=1". (Contributed by Alexandre Fiori and Nubis; :issue:`1817`.)
es: El módulo :mod:`cgi` leerá ahora las variables de la cadena de consulta de una petición HTTP POST. Esto permite utilizar acciones de formulario con URLs que incluyen cadenas de consulta como "/cgi-bin/add.py?category=1". (Contribución de Alexandre Fiori y Nubis; :issue:`1817`.)

source: The :func:`parse_qs` and :func:`parse_qsl` functions have been relocated from the :mod:`cgi` module to the :mod:`urlparse` module. The versions still available in the :mod:`cgi` module will trigger :exc:`PendingDeprecationWarning` messages in 2.6 (:issue:`600362`).
es: Las funciones :func:`parse_qs` y :func:`parse_qsl` han sido reubicadas del módulo :mod:`cgi` al módulo :mod:`urlparse`. Las versiones aún disponibles en el módulo :mod:`cgi` activarán los mensajes :exc:`PendingDeprecationWarning` en la versión 2.6 (:issue:`600362`).

source: The :mod:`cmath` module underwent extensive revision, contributed by Mark Dickinson and Christian Heimes. Five new functions were added:
es: El módulo :mod:`cmath` ha sido objeto de una amplia revisión, a la que han contribuido Mark Dickinson y Christian Heimes. Se han añadido cinco nuevas funciones:

source: :func:`polar` converts a complex number to polar form, returning the modulus and argument of the complex number.
es: :func:`polar` convierte un número complejo en forma polar, devolviendo el módulo y el argumento del número complejo.

source: :func:`rect` does the opposite, turning a modulus, argument pair back into the corresponding complex number.
es: :func:`rect` hace lo contrario, convirtiendo un par de módulos y argumentos en el correspondiente número complejo.

source: :func:`phase` returns the argument (also called the angle) of a complex number.
es: :func:`phase` devuelve el argumento (también llamado ángulo) de un número complejo.

source: :func:`isnan` returns True if either the real or imaginary part of its argument is a NaN.
es: :func:`isnan` devuelve True si la parte real o imaginaria de su argumento es un NaN.

source: :func:`isinf` returns True if either the real or imaginary part of its argument is infinite.
es: :func:`isinf` devuelve True si la parte real o imaginaria de su argumento es infinita.

source: The revisions also improved the numerical soundness of the :mod:`cmath` module. For all functions, the real and imaginary parts of the results are accurate to within a few units of least precision (ulps) whenever possible. See :issue:`1381` for the details. The branch cuts for :func:`asinh`, :func:`atanh`: and :func:`atan` have also been corrected.
es: Las revisiones también han mejorado la solidez numérica del módulo :mod:`cmath`. Para todas las funciones, las partes real e imaginaria de los resultados son exactas con unas pocas unidades de precisión mínima (ulps) siempre que sea posible. Véase :issue:`1381` para los detalles. También se han corregido los cortes de rama para :func:`asinh`, :func:`atanh`: y :func:`atan`.

source: The tests for the module have been greatly expanded; nearly 2000 new test cases exercise the algebraic functions.
es: Las pruebas del módulo se han ampliado considerablemente; casi 2000 nuevos casos de prueba ejercitan las funciones algebraicas.

source: On IEEE 754 platforms, the :mod:`cmath` module now handles IEEE 754 special values and floating-point exceptions in a manner consistent with Annex 'G' of the C99 standard.
es: En las plataformas IEEE 754, el módulo :mod:`cmath` maneja ahora los valores especiales IEEE 754 y las excepciones de punto flotante de forma consistente con el Anexo 'G' del estándar C99.

source: A new data type in the :mod:`collections` module: ``namedtuple(typename, fieldnames)`` is a factory function that creates subclasses of the standard tuple whose fields are accessible by name as well as index. For example::
es: Un nuevo tipo de datos en el módulo :mod:`collections`: ``namedtuple(typename, fieldnames)`` es una función de fábrica que crea subclases de la tupla estándar cuyos campos son accesibles tanto por nombre como por índice. Por ejemplo::

source: Several places in the standard library that returned tuples have been modified to return :func:`namedtuple` instances. For example, the :meth:`Decimal.as_tuple` method now returns a named tuple with :attr:`sign`, :attr:`digits`, and :attr:`exponent` fields.
es: Varios lugares de la biblioteca estándar que devolvían tuplas han sido modificados para devolver instancias de :func:`namedtuple`. Por ejemplo, el método :meth:`Decimal.as_tuple` ahora devuelve una tupla con nombre con los campos :attr:`sign`, :attr:`digits` y :attr:`exponent`.

source: Another change to the :mod:`collections` module is that the :class:`deque` type now supports an optional *maxlen* parameter; if supplied, the deque's size will be restricted to no more than *maxlen* items. Adding more items to a full deque causes old items to be discarded.
es: Otro cambio en el módulo :mod:`collections` es que el tipo :class:`deque` admite ahora un parámetro opcional *maxlen*; si se suministra, el tamaño del deque estará restringido a no más de *maxlen* elementos. Si se añaden más elementos a un deque lleno, se descartan los elementos antiguos.

source: The :mod:`Cookie` module's :class:`Morsel` objects now support an :attr:`httponly` attribute. In some browsers. cookies with this attribute set cannot be accessed or manipulated by JavaScript code. (Contributed by Arvin Schnell; :issue:`1638033`.)
es: Los objetos :mod:`Cookie` del módulo :class:`Morsel` soportan ahora un atributo :attr:`httponly`. En algunos navegadores, las cookies con este atributo no pueden ser accedidas o manipuladas por el código JavaScript. (Contribución de Arvin Schnell; :issue:`1638033`.)
