Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: Exponent notation. Prints the number in scientific notation using the letter 'e' to indicate the exponent.
es: Notación de exponente. Imprime el número en notación científica utilizando la letra 'e' para indicar el exponente.

source: General format. This prints the number as a fixed-point number, unless the number is too large, in which case it switches to 'e' exponent notation.
es: Formato general. Esto imprime el número como un número de punto fijo, a menos que el número sea demasiado grande, en cuyo caso cambia a la notación de exponente 'e'.

source: Number. This is the same as 'g' (for floats) or 'd' (for integers), except that it uses the current locale setting to insert the appropriate number separator characters.
es: Número. Es lo mismo que 'g' (para flotantes) o 'd' (para enteros), salvo que utiliza la configuración regional actual para insertar los caracteres separadores de números adecuados.

source: Percentage. Multiplies the number by 100 and displays in fixed ('f') format, followed by a percent sign.
es: Porcentaje. Multiplica el número por 100 y lo muestra en formato fijo ('f'), seguido de un signo de porcentaje.

source: Classes and types can define a :meth:`__format__` method to control how they're formatted. It receives a single argument, the format specifier::
es: Las clases y los tipos pueden definir un método :meth:`__format__` para controlar cómo se formatean. Recibe un único argumento, el especificador de formato::

source: There's also a :func:`format` builtin that will format a single value. It calls the type's :meth:`__format__` method with the provided specifier::
es: También hay un builtin :func:`format` que formateará un solo valor. Llama al método :meth:`__format__` del tipo con el especificador proporcionado::

source: The reference documentation for format fields.
es: La documentación de referencia para los campos de formato.

source: :pep:`3101` - Advanced String Formatting
es: :pep:`3101` - Formato avanzado de cadenas

source: PEP written by Talin. Implemented by Eric Smith.
es: PEP escrito por Talin. Implementado por Eric Smith.

source: PEP 3105: ``print`` As a Function
es: PEP 3105: ``print`` como función

source: The ``print`` statement becomes the :func:`print` function in Python 3.0. Making :func:`print` a function makes it possible to replace the function by doing ``def print(...)`` or importing a new function from somewhere else.
es: La sentencia ``print`` se convierte en la función :func:`print` en Python 3.0. Hacer de :func:`print` una función hace posible reemplazar la función haciendo ``def print(...)`` o importando una nueva función desde otro lugar.

source: Python 2.6 has a ``__future__`` import that removes ``print`` as language syntax, letting you use the functional form instead. For example::
es: Python 2.6 tiene una importación ``__future__`` que elimina ``print`` como sintaxis del lenguaje, permitiéndote usar la forma funcional en su lugar. Por ejemplo::

source: The signature of the new function is::
es: La firma de la nueva función es::

source: The parameters are:
es: Los parámetros son:

source: *args*: positional arguments whose values will be printed out.
es: *args*: argumentos posicionales cuyos valores se imprimirán.

source: *sep*: the separator, which will be printed between arguments.
es: *sep*: el separador que se imprimirá entre los argumentos.

source: *end*: the ending text, which will be printed after all of the arguments have been output.
es: *end*: el texto final, que se imprimirá después de que se hayan emitido todos los argumentos.

source: *file*: the file object to which the output will be sent.
es: *archivo*: el objeto archivo al que se enviará la salida.

source: :pep:`3105` - Make print a function
es: :pep:`3105` - Hacer de la impresión una función

source: PEP written by Georg Brandl.
es: PEP escrito por Georg Brandl.

source: PEP 3110: Exception-Handling Changes
es: PEP 3110: Cambios en el manejo de excepciones

source: One error that Python programmers occasionally make is writing the following code::
es: Un error que ocasionalmente cometen los programadores de Python es escribir el siguiente código::

source: The author is probably trying to catch both :exc:`TypeError` and :exc:`ValueError` exceptions, but this code actually does something different: it will catch :exc:`TypeError` and bind the resulting exception object to the local name ``"ValueError"``. The :exc:`ValueError` exception will not be caught at all. The correct code specifies a tuple of exceptions::
es: El autor probablemente está tratando de atrapar ambas excepciones :exc:`TypeError` y :exc:`ValueError`, pero este código en realidad hace algo diferente: atrapará :exc:`TypeError` y vinculará el objeto de excepción resultante al nombre local ``"ValueError"``. La excepción :exc:`ValueError` no será capturada en absoluto. El código correcto especifica una tupla de excepciones::

source: This error happens because the use of the comma here is ambiguous: does it indicate two different nodes in the parse tree, or a single node that's a tuple?
es: Este error se produce porque el uso de la coma aquí es ambiguo: ¿indica dos nodos diferentes en el árbol de análisis sintáctico, o un único nodo que es una tupla?

source: Python 3.0 makes this unambiguous by replacing the comma with the word "as". To catch an exception and store the exception object in the variable ``exc``, you must write::
es: Python 3.0 hace que esto sea inequívoco al sustituir la coma por la palabra "as". Para atrapar una excepción y almacenar el objeto de excepción en la variable ``exc``, debes escribir::

source: Python 3.0 will only support the use of "as", and therefore interprets the first example as catching two different exceptions. Python 2.6 supports both the comma and "as", so existing code will continue to work. We therefore suggest using "as" when writing new Python code that will only be executed with 2.6.
es: Python 3.0 sólo soporta el uso de "as", y por lo tanto interpreta el primer ejemplo como la captura de dos excepciones diferentes. Python 2.6 soporta tanto la coma como "as", por lo que el código existente seguirá funcionando. Por lo tanto, sugerimos utilizar "as" cuando se escriba nuevo código Python que sólo se ejecutará con la versión 2.6.

source: :pep:`3110` - Catching Exceptions in Python 3000
es: :pep:`3110` - Captura de excepciones en Python 3000

source: PEP written and implemented by Collin Winter.
es: PEP escrito y ejecutado por Collin Winter.

source: PEP 3112: Byte Literals
es: PEP 3112: Literales de bytes

source: Python 3.0 adopts Unicode as the language's fundamental string type and denotes 8-bit literals differently, either as ``b'string'`` or using a :class:`bytes` constructor. For future compatibility, Python 2.6 adds :class:`bytes` as a synonym for the :class:`str` type, and it also supports the ``b''`` notation.
es: Python 3.0 adopta Unicode como el tipo de cadena fundamental del lenguaje y denota los literales de 8 bits de forma diferente, ya sea como ``b'string`` o utilizando un constructor :class:`bytes`. Por compatibilidad futura, Python 2.6 añade :class:`bytes` como sinónimo del tipo :class:`str`, y también soporta la notación ``b''``.

source: The 2.6 :class:`str` differs from 3.0's :class:`bytes` type in various ways; most notably, the constructor is completely different. In 3.0, ``bytes([65, 66, 67])`` is 3 elements long, containing the bytes representing ``ABC``; in 2.6, ``bytes([65, 66, 67])`` returns the 12-byte string representing the :func:`str` of the list.
es: El tipo :class:`str` de la versión 2.6 difiere del tipo :class:`bytes` de la versión 3.0 en varios aspectos; el más notable es que el constructor es completamente diferente. En la 3.0, ``bytes([65, 66, 67])`` tiene 3 elementos, que contienen los bytes que representan ``ABC``; en la 2.6, ``bytes([65, 66, 67])`` devuelve la cadena de 12 bytes que representa el :func:`str` de la lista.

source: The primary use of :class:`bytes` in 2.6 will be to write tests of object type such as ``isinstance(x, bytes)``. This will help the 2to3 converter, which can't tell whether 2.x code intends strings to contain either characters or 8-bit bytes; you can now use either :class:`bytes` or :class:`str` to represent your intention exactly, and the resulting code will also be correct in Python 3.0.
es: El uso principal de :class:`bytes` en 2.6 será escribir pruebas de tipo de objeto como ``isinstance(x, bytes)``. Esto ayudará al convertidor de 2 a 3, que no puede decir si el código de 2.x pretende que las cadenas contengan caracteres o bytes de 8 bits; ahora puede utilizar :class:`bytes` o :class:`str` para representar su intención exactamente, y el código resultante también será correcto en Python 3.0.

source: There's also a ``__future__`` import that causes all string literals to become Unicode strings. This means that ``\u`` escape sequences can be used to include Unicode characters::
es: También hay una importación ``__future__`` que hace que todos los literales de cadena se conviertan en cadenas Unicode. Esto significa que las secuencias de escape ``u`` pueden ser utilizadas para incluir caracteres Unicode::

source: At the C level, Python 3.0 will rename the existing 8-bit string type, called :c:type:`!PyStringObject` in Python 2.x, to :c:type:`PyBytesObject`. Python 2.6 uses ``#define`` to support using the names :c:func:`PyBytesObject`, :c:func:`PyBytes_Check`, :c:func:`PyBytes_FromStringAndSize`, and all the other functions and macros used with strings.
es: A nivel de C, Python 3.0 renombrará el tipo de cadena de 8 bits existente, llamado :c:type:`!PyStringObject` en Python 2.x, a :c:type:`PyBytesObject`. Python 2.6 utiliza ``#define`` para soportar el uso de los nombres :c:func:`PyBytesObject`, :c:func:`PyBytes_Check`, :c:func:`PyBytes_FromStringAndSize`, y todas las demás funciones y macros utilizadas con cadenas.

source: Instances of the :class:`bytes` type are immutable just as strings are. A new :class:`bytearray` type stores a mutable sequence of bytes::
es: Las instancias del tipo :class:`bytes` son inmutables al igual que las cadenas. Un nuevo tipo :class:`bytearray` almacena una secuencia mutable de bytes::

source: Byte arrays support most of the methods of string types, such as :meth:`startswith`/:meth:`endswith`, :meth:`find`/:meth:`rfind`, and some of the methods of lists, such as :meth:`append`, :meth:`pop`, and :meth:`reverse`.
es: Las matrices de bytes admiten la mayoría de los métodos de los tipos de cadena, como :meth:`startswith`/:meth:`endswith`, :meth:`find`/:meth:`rfind`, y algunos de los métodos de las listas, como :meth:`append`, :meth:`pop` y :meth:`reverse`.

source: There's also a corresponding C API, with :c:func:`PyByteArray_FromObject`, :c:func:`PyByteArray_FromStringAndSize`, and various other functions.
es: También existe la correspondiente API en C, con :c:func:`PyByteArray_FromObject`, :c:func:`PyByteArray_FromStringAndSize`, y varias otras funciones.

source: :pep:`3112` - Bytes literals in Python 3000
es: :pep:`3112` - Literales de bytes en Python 3000

source: PEP written by Jason Orendorff; backported to 2.6 by Christian Heimes.
es: PEP escrito por Jason Orendorff; retroalimentado a 2.6 por Christian Heimes.

source: PEP 3116: New I/O Library
es: PEP 3116: Nueva biblioteca de E/S

source: Python's built-in file objects support a number of methods, but file-like objects don't necessarily support all of them. Objects that imitate files usually support :meth:`read` and :meth:`write`, but they may not support :meth:`readline`, for example. Python 3.0 introduces a layered I/O library in the :mod:`io` module that separates buffering and text-handling features from the fundamental read and write operations.
es: Los objetos de archivo incorporados en Python soportan una serie de métodos, pero los objetos que imitan a los archivos no necesariamente los soportan todos. Los objetos que imitan a los archivos normalmente soportan :meth:`read` y :meth:`write`, pero pueden no soportar :meth:`readline`, por ejemplo. Python 3.0 introduce una biblioteca de E/S por capas en el módulo :mod:`io` que separa las funciones de almacenamiento en búfer y manejo de texto de las operaciones fundamentales de lectura y escritura.

source: There are three levels of abstract base classes provided by the :mod:`io` module:
es: Existen tres niveles de clases base abstractas proporcionadas por el módulo :mod:`io`:

source: :class:`RawIOBase` defines raw I/O operations: :meth:`read`, :meth:`readinto`, :meth:`write`, :meth:`seek`, :meth:`tell`, :meth:`truncate`, and :meth:`close`. Most of the methods of this class will often map to a single system call. There are also :meth:`readable`, :meth:`writable`, and :meth:`seekable` methods for determining what operations a given object will allow.
es: :class:`RawIOBase` define las operaciones de E/S en bruto: :meth:`read`, :meth:`readinto`, :meth:`write`, :meth:`seek`, :meth:`tell`, :meth:`truncate`, y :meth:`close`. La mayoría de los métodos de esta clase suelen corresponder a una única llamada al sistema. También hay métodos :meth:`readable`, :meth:`writable` y :meth:`seekable` para determinar qué operaciones permite un objeto dado.

source: Python 3.0 has concrete implementations of this class for files and sockets, but Python 2.6 hasn't restructured its file and socket objects in this way.
es: Python 3.0 tiene implementaciones concretas de esta clase para archivos y sockets, pero Python 2.6 no ha reestructurado sus objetos archivo y socket de esta manera.

source: :class:`BufferedIOBase` is an abstract base class that buffers data in memory to reduce the number of system calls used, making I/O processing more efficient. It supports all of the methods of :class:`RawIOBase`, and adds a :attr:`raw` attribute holding the underlying raw object.
es: :class:`BufferedIOBase` es una clase base abstracta que almacena los datos en la memoria para reducir el número de llamadas al sistema, haciendo más eficiente el procesamiento de E/S. Soporta todos los métodos de :class:`RawIOBase`, y añade un atributo :attr:`raw` que contiene el objeto crudo subyacente.

source: There are five concrete classes implementing this ABC. :class:`BufferedWriter` and :class:`BufferedReader` are for objects that support write-only or read-only usage that have a :meth:`seek` method for random access. :class:`BufferedRandom` objects support read and write access upon the same underlying stream, and :class:`BufferedRWPair` is for objects such as TTYs that have both read and write operations acting upon unconnected streams of data. The :class:`BytesIO` class supports reading, writing, and seeking over an in-memory buffer.
es: Hay cinco clases concretas que implementan este ABC. :class:`BufferedWriter` y :class:`BufferedReader` son para objetos que soportan el uso de sólo escritura o de sólo lectura que tienen un método :meth:`seek` para el acceso aleatorio. Los objetos :class:`BufferedRandom` soportan el acceso de lectura y escritura sobre el mismo flujo subyacente, y :class:`BufferedRWPair` es para objetos como los TTYs que tienen operaciones de lectura y escritura actuando sobre flujos de datos desconectados. La clase :class:`BytesIO` permite leer, escribir y buscar sobre un buffer en memoria.

source: :class:`TextIOBase`: Provides functions for reading and writing strings (remember, strings will be Unicode in Python 3.0), and supporting :term:`universal newlines`. :class:`TextIOBase` defines the :meth:`readline` method and supports iteration upon objects.
es: :class:`TextIOBase`: Proporciona funciones para leer y escribir cadenas (recuerde que las cadenas serán Unicode en Python 3.0), y soporta :term:`universal newlines`. :class:`TextIOBase` define el método :meth:`readline` y soporta la iteración sobre objetos.

source: There are two concrete implementations. :class:`TextIOWrapper` wraps a buffered I/O object, supporting all of the methods for text I/O and adding a :attr:`buffer` attribute for access to the underlying object. :class:`StringIO` simply buffers everything in memory without ever writing anything to disk.
es: Hay dos implementaciones concretas. :class:`TextIOWrapper` envuelve un objeto de E/S con buffer, soportando todos los métodos de E/S de texto y añadiendo un atributo :attr:`buffer` para acceder al objeto subyacente. :class:`StringIO` simplemente almacena todo en memoria sin escribir nunca nada en el disco.

source: (In Python 2.6, :class:`io.StringIO` is implemented in pure Python, so it's pretty slow. You should therefore stick with the existing :mod:`StringIO` module or :mod:`cStringIO` for now. At some point Python 3.0's :mod:`io` module will be rewritten into C for speed, and perhaps the C implementation will be backported to the 2.x releases.)
es: (En Python 2.6, :class:`io.StringIO` está implementado en Python puro, por lo que es bastante lento. Por lo tanto, deberías seguir con el módulo :mod:`StringIO` existente o con :mod:`cStringIO` por ahora. En algún momento el módulo :mod:`io` de Python 3.0 será reescrito en C para aumentar la velocidad, y quizás la implementación en C será retroalimentada a las versiones 2.x)

source: In Python 2.6, the underlying implementations haven't been restructured to build on top of the :mod:`io` module's classes. The module is being provided to make it easier to write code that's forward-compatible with 3.0, and to save developers the effort of writing their own implementations of buffering and text I/O.
es: En Python 2.6, las implementaciones subyacentes no han sido reestructuradas para construir sobre las clases del módulo :mod:`io`. El módulo se proporciona para facilitar la escritura de código compatible con la versión 3.0, y para ahorrar a los desarrolladores el esfuerzo de escribir sus propias implementaciones de búfer y E/S de texto.

source: :pep:`3116` - New I/O
es: :pep:`3116` - Nueva E/S

source: PEP written by Daniel Stutzbach, Mike Verdone, and Guido van Rossum. Code by Guido van Rossum, Georg Brandl, Walter Doerwald, Jeremy Hylton, Martin von Löwis, Tony Lownds, and others.
es: PEP escrito por Daniel Stutzbach, Mike Verdone y Guido van Rossum. Código de Guido van Rossum, Georg Brandl, Walter Doerwald, Jeremy Hylton, Martin von Löwis, Tony Lownds y otros.

source: PEP 3118: Revised Buffer Protocol
es: PEP 3118: Protocolo revisado de la memoria intermedia

source: The buffer protocol is a C-level API that lets Python types exchange pointers into their internal representations. A memory-mapped file can be viewed as a buffer of characters, for example, and this lets another module such as :mod:`re` treat memory-mapped files as a string of characters to be searched.
es: El protocolo de búferes es una API de nivel C que permite a los tipos de Python intercambiar punteros a sus representaciones internas. Un archivo mapeado en memoria puede ser visto como un buffer de caracteres, por ejemplo, y esto permite que otro módulo como :mod:`re` trate los archivos mapeados en memoria como una cadena de caracteres a buscar.

source: The primary users of the buffer protocol are numeric-processing packages such as NumPy, which expose the internal representation of arrays so that callers can write data directly into an array instead of going through a slower API. This PEP updates the buffer protocol in light of experience from NumPy development, adding a number of new features such as indicating the shape of an array or locking a memory region.
es: Los principales usuarios del protocolo de búferes son los paquetes de procesamiento numérico como NumPy, que exponen la representación interna de los arrays para que los invocadores puedan escribir datos directamente en un array en lugar de pasar por una API más lenta. Este PEP actualiza el protocolo de búfer a la luz de la experiencia del desarrollo de NumPy, añadiendo una serie de nuevas características como la indicación de la forma de un array o el bloqueo de una región de memoria.

source: The most important new C API function is ``PyObject_GetBuffer(PyObject *obj, Py_buffer *view, int flags)``, which takes an object and a set of flags, and fills in the ``Py_buffer`` structure with information about the object's memory representation. Objects can use this operation to lock memory in place while an external caller could be modifying the contents, so there's a corresponding ``PyBuffer_Release(Py_buffer *view)`` to indicate that the external caller is done.
es: La nueva función más importante de la API en C es ``PyObject_GetBuffer(PyObject *obj, Py_buffer *view, int flags)``, que toma un objeto y un conjunto de flags, y rellena la estructura ``Py_buffer`` con información sobre la representación en memoria del objeto. Los objetos pueden utilizar esta operación para bloquear la memoria en su lugar mientras un llamador externo podría estar modificando el contenido, por lo que hay un correspondiente ``PyBuffer_Release(Py_buffer *view)`` para indicar que el llamador externo ha terminado.

source: The *flags* argument to :c:func:`PyObject_GetBuffer` specifies constraints upon the memory returned. Some examples are:
es: El argumento *flags* de :c:func:`PyObject_GetBuffer` especifica las restricciones de la memoria devuelta. Algunos ejemplos son:

source: :c:macro:`PyBUF_WRITABLE` indicates that the memory must be writable.
es: :c:macro:`PyBUF_WRITABLE` indica que la memoria debe ser grabable.

source: :c:macro:`PyBUF_LOCK` requests a read-only or exclusive lock on the memory.
es: :c:macro:`PyBUF_LOCK` solicita un bloqueo de sólo lectura o exclusivo en la memoria.

source: :c:macro:`PyBUF_C_CONTIGUOUS` and :c:macro:`PyBUF_F_CONTIGUOUS` requests a C-contiguous (last dimension varies the fastest) or Fortran-contiguous (first dimension varies the fastest) array layout.
es: :c:macro:`PyBUF_C_CONTIGUOUS` y :c:macro:`PyBUF_F_CONTIGUOUS` solicitan una disposición de matriz contigua en C (la última dimensión varía más rápidamente) o contigua en Fortran (la primera dimensión varía más rápidamente).

source: Two new argument codes for :c:func:`PyArg_ParseTuple`, ``s*`` and ``z*``, return locked buffer objects for a parameter.
es: Dos nuevos códigos de argumento para :c:func:`PyArg_ParseTuple`, ``s*`` y ``z*``, devuelven objetos buffer bloqueados para un parámetro.

source: :pep:`3118` - Revising the buffer protocol
es: :pep:`3118` - Revisión del protocolo del buffer

source: PEP written by Travis Oliphant and Carl Banks; implemented by Travis Oliphant.
es: PEP escrito por Travis Oliphant y Carl Banks; implementado por Travis Oliphant.

source: PEP 3119: Abstract Base Classes
es: PEP 3119: Clases base abstractas

source: Some object-oriented languages such as Java support interfaces, declaring that a class has a given set of methods or supports a given access protocol. Abstract Base Classes (or ABCs) are an equivalent feature for Python. The ABC support consists of an :mod:`abc` module containing a metaclass called :class:`ABCMeta`, special handling of this metaclass by the :func:`isinstance` and :func:`issubclass` builtins, and a collection of basic ABCs that the Python developers think will be widely useful. Future versions of Python will probably add more ABCs.
es: Algunos lenguajes orientados a objetos, como Java, admiten interfaces, que declaran que una clase tiene un determinado conjunto de métodos o admite un determinado protocolo de acceso. Las clases base abstractas (o ABC) son una característica equivalente para Python. El soporte de ABC consiste en un módulo :mod:`abc` que contiene una metaclase llamada :class:`ABCMeta`, un manejo especial de esta metaclase por parte de los builtins :func:`isinstance` y :func:`issubclass`, y una colección de ABCs básicas que los desarrolladores de Python creen que serán ampliamente útiles. Las futuras versiones de Python probablemente añadirán más ABCs.
