Repository: python/python-docs-es
Catalog: whatsnew/2.6.po
Languages: es

source: The :mod:`macfs` module has been removed. This in turn required the :func:`macostools.touched` function to be removed because it depended on the :mod:`macfs` module. (:issue:`1490190`)
es: Se ha eliminado el módulo :mod:`macfs`. Esto, a su vez, ha requerido la eliminación de la función :func:`macostools.touched` porque dependía del módulo :mod:`macfs`. (:issue:`1490190`)

source: Many other Mac OS modules have been deprecated and will be removed in Python 3.0: :mod:`_builtinSuites`, :mod:`aepack`, :mod:`aetools`, :mod:`aetypes`, :mod:`applesingle`, :mod:`appletrawmain`, :mod:`appletrunner`, :mod:`argvemulator`, :mod:`Audio_mac`, :mod:`autoGIL`, :mod:`Carbon`, :mod:`cfmfile`, :mod:`CodeWarrior`, :mod:`ColorPicker`, :mod:`EasyDialogs`, :mod:`Explorer`, :mod:`Finder`, :mod:`FrameWork`, :mod:`findertools`, :mod:`ic`, :mod:`icglue`, :mod:`icopen`, :mod:`macerrors`, :mod:`MacOS`, :mod:`macfs`, :mod:`macostools`, :mod:`macresource`, :mod:`MiniAEFrame`, :mod:`Nav`, :mod:`Netscape`, :mod:`OSATerminology`, :mod:`pimp`, :mod:`PixMapWrapper`, :mod:`StdSuites`, :mod:`SystemEvents`, :mod:`Terminal`, and :mod:`terminalcommand`.
es: Muchos otros módulos de Mac OS han quedado obsoletos y serán eliminados en Python 3.0: :mod:`_builtinSuites`, :mod:`aepack`, :mod:`aetools`, :mod:`aetypes`, :mod:`applesingle`, :mod:`appletrawmain`, :mod:`appletrunner`, :mod:`argvemulator`, :mod:`Audio_mac`, :mod:`autoGIL`, :mod:`Carbon`, :mod:`cfmfile`, :mod:`CodeWarrior`, :mod:`ColorPicker`, :mod:`EasyDialogs`, :mod:`Explorer`, :mod:`Finder`, :mod:`FrameWork`, :mod:`findertools`, :mod:`ic`, :mod:`icglue`, :mod:`icopen`, :mod:`macerrors`, :mod:`MacOS`, :mod:`macfs`, :mod:`macostools`, :mod:`macresource`, :mod:`MiniAEFrame`, :mod:`Nav`, :mod:`Netscape`, :mod:`OSATerminology`, :mod:`pimp`, :mod:`PixMapWrapper`, :mod:`StdSuites`, :mod:`SystemEvents`, :mod:`Terminal`, y :mod:`terminalcommand`.

source: Port-Specific Changes: IRIX
es: Cambios específicos en los puertos: IRIX

source: A number of old IRIX-specific modules were deprecated and will be removed in Python 3.0: :mod:`al` and :mod:`AL`, :mod:`cd`, :mod:`cddb`, :mod:`cdplayer`, :mod:`CL` and :mod:`cl`, :mod:`DEVICE`, :mod:`ERRNO`, :mod:`FILE`, :mod:`FL` and :mod:`fl`, :mod:`flp`, :mod:`fm`, :mod:`GET`, :mod:`GLWS`, :mod:`GL` and :mod:`gl`, :mod:`IN`, :mod:`IOCTL`, :mod:`jpeg`, :mod:`panelparser`, :mod:`readcd`, :mod:`SV` and :mod:`sv`, :mod:`torgb`, :mod:`videoreader`, and :mod:`WAIT`.
es: Una serie de antiguos módulos específicos de IRIX fueron obsoletos y serán eliminados en Python 3.0: :mod:`al` y :mod:`AL`, :mod:`cd`, :mod:`cddb`, :mod:`cdplayer`, :mod:`CL` y :mod:`cl`, :mod:`DEVICE`, :mod:`ERRNO`, :mod:`FILE`, :mod:`FL` y :mod:`fl`, :mod:`flp`, :mod:`fm`, :mod:`GET`, :mod:`GLWS`, :mod:`GL` y :mod:`gl`, :mod:`IN`, :mod:`IOCTL`, :mod:`jpeg`, :mod:`panelparser`, :mod:`readcd`, :mod:`SV` y :mod:`sv`, :mod:`torgb`, :mod:`videoreader` y :mod:`WAIT`.

source: Porting to Python 2.6
es: Adaptación a Python 2.6

source: This section lists previously described changes and other bugfixes that may require changes to your code:
es: Esta sección enumera los cambios descritos anteriormente y otras correcciones de errores que pueden requerir cambios en su código:

source: Classes that aren't supposed to be hashable should set ``__hash__ = None`` in their definitions to indicate the fact.
es: Las clases que no se supone que son hashable deben establecer ``__hash__ = None`` en sus definiciones para indicar el hecho.

source: The :meth:`__init__` method of :class:`collections.deque` now clears any existing contents of the deque before adding elements from the iterable. This change makes the behavior match ``list.__init__()``.
es: El método :meth:`__init__` de :class:`collections.deque` ahora borra cualquier contenido existente del deque antes de añadir elementos del iterable. Este cambio hace que el comportamiento coincida con ``list.__init__()``.

source: :meth:`object.__init__` previously accepted arbitrary arguments and keyword arguments, ignoring them. In Python 2.6, this is no longer allowed and will result in a :exc:`TypeError`. This will affect :meth:`__init__` methods that end up calling the corresponding method on :class:`object` (perhaps through using :func:`super`). See :issue:`1683368` for discussion.
es: :meth:`object.__init__` anteriormente aceptaba argumentos arbitrarios y argumentos de palabras clave, ignorándolos. En Python 2.6, esto ya no está permitido y resultará en un :exc:`TypeError`. Esto afectará a los métodos :meth:`__init__` que acaben llamando al método correspondiente en :class:`object` (quizás mediante el uso de :func:`super`). Ver :issue:`1683368` para su discusión.

source: The :class:`Decimal` constructor now accepts leading and trailing whitespace when passed a string. Previously it would raise an :exc:`InvalidOperation` exception. On the other hand, the :meth:`create_decimal` method of :class:`Context` objects now explicitly disallows extra whitespace, raising a :exc:`ConversionSyntax` exception.
es: El constructor :class:`Decimal` ahora acepta los espacios en blanco iniciales y finales cuando se le pasa una cadena. Antes lanzaba una excepción :exc:`InvalidOperation`. Por otro lado, el método :meth:`create_decimal` de los objetos :class:`Context` ahora desestima explícitamente los espacios en blanco adicionales, lanzando una excepción :exc:`ConversionSyntax`.

source: Due to an implementation accident, if you passed a file path to the built-in :func:`__import__` function, it would actually import the specified file. This was never intended to work, however, and the implementation now explicitly checks for this case and raises an :exc:`ImportError`.
es: Debido a un accidente de implementación, si se pasaba una ruta de archivo a la función incorporada :func:`__import__`, ésta importaría realmente el archivo especificado. Sin embargo, nunca se pretendió que esto funcionara, y la implementación ahora comprueba explícitamente este caso y lanza un :exc:`ImportError`.

source: C API: the :c:func:`PyImport_Import` and :c:func:`PyImport_ImportModule` functions now default to absolute imports, not relative imports. This will affect C extensions that import other modules.
es: API C: las funciones :c:func:`PyImport_Import` y :c:func:`PyImport_ImportModule` ahora se ajustan por defecto a importaciones absolutas, no a importaciones relativas. Esto afectará a las extensiones de C que importen otros módulos.

source: C API: extension data types that shouldn't be hashable should define their ``tp_hash`` slot to :c:func:`PyObject_HashNotImplemented`.
es: API C: los tipos de datos de extensión que no deben ser hashable deben definir su ranura ``tp_hash`` a :c:func:`PyObject_HashNotImplemented`.

source: The :mod:`socket` module exception :exc:`socket.error` now inherits from :exc:`IOError`. Previously it wasn't a subclass of :exc:`StandardError` but now it is, through :exc:`IOError`. (Implemented by Gregory P. Smith; :issue:`1706815`.)
es: La excepción del módulo :mod:`socket` :exc:`socket.error` ahora hereda de :exc:`IOError`. Anteriormente no era una subclase de :exc:`StandardError` pero ahora lo es, a través de :exc:`IOError`. (Implementado por Gregory P. Smith; :issue:`1706815`.)

source: The :mod:`xmlrpclib` module no longer automatically converts :class:`datetime.date` and :class:`datetime.time` to the :class:`xmlrpclib.DateTime` type; the conversion semantics were not necessarily correct for all applications. Code using :mod:`xmlrpclib` should convert :class:`date` and :class:`~datetime.time` instances. (:issue:`1330538`)
es: El módulo :mod:`xmlrpclib` ya no convierte automáticamente las instancias :class:`datetime.date` y :class:`datetime.time` al tipo :class:`xmlrpclib.DateTime`; la semántica de conversión no era necesariamente correcta para todas las aplicaciones. El código que utiliza :mod:`xmlrpclib` debe convertir las instancias :class:`date` y :class:`~datetime.time`. (:issue:`1330538`)

source: (3.0-warning mode) The :class:`Exception` class now warns when accessed using slicing or index access; having :class:`Exception` behave like a tuple is being phased out.
es: (Modo de advertencia 3.0) La clase :class:`Exception` ahora advierte cuando se accede utilizando el acceso a la rebanada o al índice; tener :class:`Exception` se comporta como una tupla está siendo eliminado.

source: (3.0-warning mode) inequality comparisons between two dictionaries or two objects that don't implement comparison methods are reported as warnings. ``dict1 == dict2`` still works, but ``dict1 < dict2`` is being phased out.
es: (modo de advertencia 3.0) las comparaciones de desigualdad entre dos diccionarios o dos objetos que no implementan métodos de comparación se reportan como advertencias. ``dict1 == dict2`` sigue funcionando, pero ``dict1 < dict2`` está siendo eliminado.

source: Comparisons between cells, which are an implementation detail of Python's scoping rules, also cause warnings because such comparisons are forbidden entirely in 3.0.
es: Las comparaciones entre celdas, que son un detalle de implementación de las reglas de alcance de Python, también causan advertencias porque tales comparaciones están prohibidas por completo en 3.0.

source: Acknowledgements
es: Agradecimientos

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Georg Brandl, Steve Brown, Nick Coghlan, Ralph Corderoy, Jim Jewett, Kent Johnson, Chris Lambacher, Martin Michlmayr, Antoine Pitrou, Brian Warner.
es: El autor desea agradecer a las siguientes personas sus sugerencias, correcciones y ayuda en varios borradores de este artículo: Georg Brandl, Steve Brown, Nick Coghlan, Ralph Corderoy, Jim Jewett, Kent Johnson, Chris Lambacher, Martin Michlmayr, Antoine Pitrou, Brian Warner.

source: universal newlines
es: nuevas líneas universales

source: What's new
es: Qué hay de nuevo
