Repository: python/python-docs-es
Catalog: whatsnew/3.0.po
Languages: es_es

source: What's New In Python 3.0
es_es: Qué hay de nuevo en Python 3.0

source: Author
es_es: Autor

source: This article explains the new features in Python 3.0, compared to 2.6. Python 3.0, also known as "Python 3000" or "Py3K", is the first ever *intentionally backwards incompatible* Python release. Python 3.0 was released on December 3, 2008. There are more changes than in a typical release, and more that are important for all Python users. Nevertheless, after digesting the changes, you'll find that Python really hasn't changed all that much -- by and large, we're mostly fixing well-known annoyances and warts, and removing a lot of old cruft.
es_es: Este artículo explica las nuevas características de Python 3.0, en comparación con 2.6. Python 3.0, también conocido como "Python 3000" o "Py3K", es la primera versión *intentionally backwards incompatible* de Python. Python 3.0 se lanzó el 3 de diciembre de 2008. Hay más cambios que en una versión típica y más que son importantes para todos los usuarios de Python. Sin embargo, después de digerir los cambios, descubrirá que Python realmente no ha cambiado tanto; en general, estamos solucionando principalmente molestias y defectos conocidos, y eliminando una gran cantidad de viejas cosas.

source: This article doesn't attempt to provide a complete specification of all new features, but instead tries to give a convenient overview. For full details, you should refer to the documentation for Python 3.0, and/or the many PEPs referenced in the text. If you want to understand the complete implementation and design rationale for a particular feature, PEPs usually have more details than the regular documentation; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented.
es_es: Este artículo no intenta proporcionar una especificación completa de todas las características nuevas, sino que intenta proporcionar una visión general conveniente. Para obtener más información, se debe consultar la documentación de Python 3.0 y/o los muchos PEP a los que se hace referencia en el texto. Si se desea comprender la lógica completa de implementación y diseño para una característica determinada, los PEP suelen tener más detalles que la documentación regular, pero téngase en cuenta que los PEP generalmente no se mantienen actualizados una vez que una característica se ha implementado completamente.

source: Due to time constraints this document is not as complete as it should have been. As always for a new release, the ``Misc/NEWS`` file in the source distribution contains a wealth of detailed information about every small thing that was changed.
es_es: Debido a restricciones de tiempo, este documento no es tan completo como debería haber sido. Como siempre para una nueva versión, el archivo ``Misc/NEWS`` en la distribución de origen contiene una gran cantidad de información detallada sobre cada pequeña cosa que se cambió.

source: Common Stumbling Blocks
es_es: Escollos comunes

source: This section lists those few changes that are most likely to trip you up if you're used to Python 2.5.
es_es: Esta sección contiene esos pequeños cambios que probablemente generarán tropiezos si se está acostumbrado a Python 2.5.

source: Print Is A Function
es_es: *Print* es una función

source: The ``print`` statement has been replaced with a :func:`print` function, with keyword arguments to replace most of the special syntax of the old ``print`` statement (:pep:`3105`). Examples::
es_es: La declaración ``print`` se ha sustituido por una función :func:`print`, con argumentos de palabra clave para reemplazar la mayor parte de la sintaxis especial de la antigua declaración ``print`` (:pep:`3105`). Ejemplos::

source: You can also customize the separator between items, e.g.::
es_es: También se puede personalizar el separador entre ítems, por ejemplo::

source: which produces:
es_es: que genera:

source: Note:
es_es: Nota:

source: The :func:`print` function doesn't support the "softspace" feature of the old ``print`` statement. For example, in Python 2.x, ``print "A\n", "B"`` would write ``"A\nB\n"``; but in Python 3.0, ``print("A\n", "B")`` writes ``"A\n B\n"``.
es_es: La función :func:`print` no soporta la característica "softspace" de la declaración ``print`` vieja. Por ejemplo, en Python 2.x ``print "A\n", "B"`` escribiría ``"A\nB\n"``; pero en Python 3.0, ``print("A\n", "B")`` escribe ``"A\n B\n"``.

source: Initially, you'll be finding yourself typing the old ``print x`` a lot in interactive mode. Time to retrain your fingers to type ``print(x)`` instead!
es_es: Inicialmente, te encontrarás escribiendo mucho la antigua ``print x`` en modo interactivo. ¡Es hora de volver a entrenar los dedos para escribir ``print(x)`` en su lugar!

source: When using the ``2to3`` source-to-source conversion tool, all ``print`` statements are automatically converted to :func:`print` function calls, so this is mostly a non-issue for larger projects.
es_es: En el uso de la herramienta de conversión fuente-a-fuente ``2to3``, todos las declaraciones ``print`` son automáticamente convertidas a una llamada de la función :func:`print`, por lo que en general esto no es un problema para proyectos más grandes.

source: Views And Iterators Instead Of Lists
es_es: Vistas e iteradores en lugar de listas

source: Some well-known APIs no longer return lists:
es_es: Algunas APIs bien conocidas no retornan más listas:

source: :class:`dict` methods :meth:`dict.keys`, :meth:`dict.items` and :meth:`dict.values` return "views" instead of lists. For example, this no longer works: ``k = d.keys(); k.sort()``. Use ``k = sorted(d)`` instead (this works in Python 2.5 too and is just as efficient).
es_es: Los métodos :class:`dict` :meth:`dict.keys`, :meth:`dict.items` y :meth:`dict.values` retornan "vistas" en lugar de listas. Por ejemplo, esto no funciona más: ``k = d.keys(); k.sort()``. Se usa ``k = sorted(d)`` en su lugar (esto funciona también en Python 2.5 y es igual de eficiente).

source: Also, the :meth:`dict.iterkeys`, :meth:`dict.iteritems` and :meth:`dict.itervalues` methods are no longer supported.
es_es: Además, los métodos :meth:`dict.iterkeys`, :meth:`dict.iteritems` y :meth:`dict.itervalues` ya no son compatibles.

source: :func:`map` and :func:`filter` return iterators. If you really need a list and the input sequences are all of equal length, a quick fix is to wrap :func:`map` in :func:`list`, e.g. ``list(map(...))``, but a better fix is often to use a list comprehension (especially when the original code uses :keyword:`lambda`), or rewriting the code so it doesn't need a list at all. Particularly tricky is :func:`map` invoked for the side effects of the function; the correct transformation is to use a regular :keyword:`for` loop (since creating a list would just be wasteful).
es_es: :func:`map` y :func:`filter` retornan iteradores. Si realmente se necesita una lista y las secuencias de entrada son todas de igual longitud, una solución rápida es envolver :func:`map` en :func:`list`, por ejemplo ``list(map(...))``, pero una mejor solución es a menudo utilizar una lista por comprensión (especialmente cuando el código original utiliza :keyword:`lambda`), o reescribir el código para que no necesite una lista en absoluto. Particularmente complicado es :func:`map` invocado para los efectos secundarios de la función; la transformación correcta es usar un bucle :keyword:`for` normal (ya que crear una lista sería simplemente un desperdicio).

source: If the input sequences are not of equal length, :func:`map` will stop at the termination of the shortest of the sequences. For full compatibility with :func:`map` from Python 2.x, also wrap the sequences in :func:`itertools.zip_longest`, e.g. ``map(func, *sequences)`` becomes ``list(map(func, itertools.zip_longest(*sequences)))``.
es_es: Si las secuencias de entrada no tienen la misma longitud, :func:`map` se detendrá en la terminación de la más corta de las secuencias. Para una compatibilidad completa con :func:`map` de Python 2.x, también se envuelve las secuencias en :func:`itertools.zip_longest`, por ejemplo ``map(func, *sequences)`` se convierte en ``list(map(func, itertools.zip_longest(*sequences)))``.

source: :func:`range` now behaves like :func:`xrange` used to behave, except it works with values of arbitrary size. The latter no longer exists.
es_es: :func:`range` ahora se comporta como :func:`xrange` solía comportarse, excepto que funciona con valores de tamaño arbitrario. Este último ya no existe.

source: :func:`zip` now returns an iterator.
es_es: :func:`zip` ahora retorna un iterador.

source: Ordering Comparisons
es_es: Comparaciones de ordenamiento

source: Python 3.0 has simplified the rules for ordering comparisons:
es_es: Python 3.0 ha simplificado las reglas para las comparaciones de ordenamiento:

source: The ordering comparison operators (``<``, ``<=``, ``>=``, ``>``) raise a TypeError exception when the operands don't have a meaningful natural ordering. Thus, expressions like ``1 < ''``, ``0 > None`` or ``len <= len`` are no longer valid, and e.g. ``None < None`` raises :exc:`TypeError` instead of returning ``False``. A corollary is that sorting a heterogeneous list no longer makes sense -- all the elements must be comparable to each other. Note that this does not apply to the ``==`` and ``!=`` operators: objects of different incomparable types always compare unequal to each other.
es_es: Los operadores de comparaciones de ordenamiento (``<``, ``<``,``'>``, ``>``) lanzan una excepción *TypeError* cuando los operandos no tienen un orden natural significativo. Por lo tanto, expresiones como ``1 < ''``, ``0 > None`` o ``len <= len`` ya no son válidas, y por ejemplo ``Ninguno < Ninguno`` lanza :exc:`TypeError` en lugar de retornar ``False``. Un corolario es que ordenar una lista heterogénea ya no tiene sentido -- todos los elementos deben ser comparables entre sí. Tener en cuenta que esto no se aplica a los operadores ``==`` y ``!=``: los objetos de diferentes tipos incomparables siempre se comparan desiguales entre sí.

source: :meth:`builtin.sorted` and :meth:`list.sort` no longer accept the *cmp* argument providing a comparison function. Use the *key* argument instead. N.B. the *key* and *reverse* arguments are now "keyword-only".
es_es: :meth:`builtin.sorted` y :meth:`list.sort` ya no aceptan el argumento *cmp* que proporciona una función de comparación. Utilice el argumento *key* en su lugar. N.B. los argumentos *key* y *reverse* ahora son "argumentos por palabra clave".

source: The :func:`cmp` function should be treated as gone, and the :meth:`__cmp__` special method is no longer supported. Use :meth:`__lt__` for sorting, :meth:`__eq__` with :meth:`__hash__`, and other rich comparisons as needed. (If you really need the :func:`cmp` functionality, you could use the expression ``(a > b) - (a < b)`` as the equivalent for ``cmp(a, b)``.)
es_es: La función :func:`cmp` debe tratarse como quitada, y el método especial :meth:`__cmp__` ya no es compatible. Utilizar :meth:`__lt__` para el ordenamiento, :meth:`__eq__` con :meth:`__hash__`, y otras comparaciones costosas según sea necesario. (Si realmente se necesita la funcionalidad :func:`cmp`, se puede utilizar la expresión ``(a > b) - (a < b)`` como el equivalente para ``cmp(a, b)``.)

source: Integers
es_es: Enteros

source: :pep:`237`: Essentially, :class:`long` renamed to :class:`int`. That is, there is only one built-in integral type, named :class:`int`; but it behaves mostly like the old :class:`long` type.
es_es: :pep:`237`: Esencialmente, :class:`long` renombrado a :class:`int`. Es decir, solo hay un tipo integral incorporado, denominado :class:`int`; pero se comporta sobre todo como el viejo tipo :class:`long`.

source: :pep:`238`: An expression like ``1/2`` returns a float. Use ``1//2`` to get the truncating behavior. (The latter syntax has existed for years, at least since Python 2.2.)
es_es: :pep:`238`: Una expresión como ``1/2`` retorna un float. Utilizar ``1//2`` para obtener el comportamiento de truncamiento. (Esta última sintaxis ha existido durante años, al menos desde Python 2.2.)

source: The :data:`sys.maxint` constant was removed, since there is no longer a limit to the value of integers. However, :data:`sys.maxsize` can be used as an integer larger than any practical list or string index. It conforms to the implementation's "natural" integer size and is typically the same as :data:`sys.maxint` in previous releases on the same platform (assuming the same build options).
es_es: Se eliminó la constante :data:`sys.maxint`, ya que ya no hay un límite para el valor de los enteros. Sin embargo, :data:`sys.maxsize` se puede utilizar como un entero mayor que cualquier lista práctica o índice de cadena de caracteres. Se ajusta al tamaño entero "natural" de la implementación y suele ser el mismo que :data:`sys.maxint` en versiones anteriores de la misma plataforma (suponiendo las mismas opciones de compilación).

source: The :func:`repr` of a long integer doesn't include the trailing ``L`` anymore, so code that unconditionally strips that character will chop off the last digit instead. (Use :func:`str` instead.)
es_es: El :func:`repr` de un entero largo ya no incluye la ``L`` final, por lo que el código que elimina incondicionalmente ese carácter cortará el último dígito en su lugar. (Utilizar :func:`str` en su lugar.)

source: Octal literals are no longer of the form ``0720``; use ``0o720`` instead.
es_es: Los literales octales ya no usan la forma ``0720``; úsese ``0o720`` en su lugar.

source: Text Vs. Data Instead Of Unicode Vs. 8-bit
es_es: Texto vs. datos en lugar de unicode vs. 8 bits

source: Everything you thought you knew about binary data and Unicode has changed.
es_es: Todo lo que pensabas saber sobre datos binarios y Unicode ha cambiado.

source: Python 3.0 uses the concepts of *text* and (binary) *data* instead of Unicode strings and 8-bit strings. All text is Unicode; however *encoded* Unicode is represented as binary data. The type used to hold text is :class:`str`, the type used to hold data is :class:`bytes`. The biggest difference with the 2.x situation is that any attempt to mix text and data in Python 3.0 raises :exc:`TypeError`, whereas if you were to mix Unicode and 8-bit strings in Python 2.x, it would work if the 8-bit string happened to contain only 7-bit (ASCII) bytes, but you would get :exc:`UnicodeDecodeError` if it contained non-ASCII values. This value-specific behavior has caused numerous sad faces over the years.
es_es: Python 3.0 utiliza los conceptos de *text* y *datos* (binarios) en lugar de cadenas de caracteres Unicode y cadenas de caracteres de 8 bits. Todo el texto es Unicode; sin embargo el Unicode *codificado* se representa como datos binarios. El tipo utilizado para contener texto es :class:`str`, el tipo utilizado para contener datos es :class:`bytes`. La mayor diferencia con la situación 2.x es que cualquier intento de mezclar texto y datos en Python 3.0 lanza un :exc:`TypeError`, mientras que si se mezclan cadenas Unicode y de 8 bits en Python 2.x, funcionaría si la cadena de 8 bits contuviera sólo bytes de 7 bits (ASCII), pero se obtendría un :exc:`UnicodeDecodeError` si contenía valores no ASCII. Este comportamiento específico del valor ha causado numerosas caras tristes a lo largo de los años.

source: As a consequence of this change in philosophy, pretty much all code that uses Unicode, encodings or binary data most likely has to change. The change is for the better, as in the 2.x world there were numerous bugs having to do with mixing encoded and unencoded text. To be prepared in Python 2.x, start using :class:`unicode` for all unencoded text, and :class:`str` for binary or encoded data only. Then the ``2to3`` tool will do most of the work for you.
es_es: Como consecuencia de este cambio en la filosofía, prácticamente todo el código que utiliza Unicode, codificaciones o datos binarios muy probablemente tiene que cambiar. El cambio es para mejor, ya que en el mundo 2.x había numerosos errores que tenían que ver con la mezcla de texto codificado y sin codificar. Para estar preparado en Python 2.x, comienza a usar :class:`unicode` para todo el texto sin codificar, y :class:`str` solo para datos binarios o codificados. Luego , la herramienta ``2to3`` hará la mayor parte del trabajo por ti.

source: You can no longer use ``u"..."`` literals for Unicode text. However, you must use ``b"..."`` literals for binary data.
es_es: Ya no se puede utilizar literales ``u"..."`` para texto Unicode. Sin embargo, se debe usar literales ``b"..."`` para los datos binarios.

source: As the :class:`str` and :class:`bytes` types cannot be mixed, you must always explicitly convert between them. Use :meth:`str.encode` to go from :class:`str` to :class:`bytes`, and :meth:`bytes.decode` to go from :class:`bytes` to :class:`str`. You can also use ``bytes(s, encoding=...)`` and ``str(b, encoding=...)``, respectively.
es_es: Como los tipos :class:`str` y :class:`bytes` no se pueden mezclar, siempre se deben convertir explícitamente entre ellos. Utilizar :meth:`str.encode` para pasar de :class:`str` a :class:`bytes`, y :meth:`bytes.decode` para pasar de :class:`bytes` a :class:`str`. También se puede utilizar ``bytes(s, encoding=...)`` y ``str(b, encoding=...)``, respectivamente.

source: Like :class:`str`, the :class:`bytes` type is immutable. There is a separate *mutable* type to hold buffered binary data, :class:`bytearray`. Nearly all APIs that accept :class:`bytes` also accept :class:`bytearray`. The mutable API is based on :class:`collections.MutableSequence`.
es_es: Al igual que :class:`str`, el tipo :class:`bytes` es inmutable. Hay un tipo *mutable* independiente para contener datos binarios almacenados en búfer, :class:`bytearray`. Casi todas las API que aceptan :class:`bytes` también aceptan :class:`bytearray`. La API mutable se basa en :class:`collections. MutableSequence`.

source: All backslashes in raw string literals are interpreted literally. This means that ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially. For example, ``r'\u20ac'`` is a string of 6 characters in Python 3.0, whereas in 2.6, ``ur'\u20ac'`` was the single "euro" character. (Of course, this change only affects raw string literals; the euro character is ``'\u20ac'`` in Python 3.0.)
es_es: Todas las barras invertidas en literales de cadena de caracteres sin formato se interpretan literalmente. Esto significa que los escapes ``'\U'`` y ``'\u'`` en cadenas de caracteres sin formato no se tratan especialmente. Por ejemplo, ``r'\u20ac'`` es una cadena de 6 caracteres en Python 3.0, mientras que en 2.6, ``ur'\u20ac'`` era el único carácter "euro". (Por supuesto, este cambio sólo afecta a los literales de cadena de caracteres sin formato; el carácter del euro es ``'\u20ac'`` en Python 3.0.)

source: The built-in :class:`basestring` abstract type was removed. Use :class:`str` instead. The :class:`str` and :class:`bytes` types don't have functionality enough in common to warrant a shared base class. The ``2to3`` tool (see below) replaces every occurrence of :class:`basestring` with :class:`str`.
es_es: Se eliminó el tipo abstracto :class:`basestring` incorporado. Se utiliza :class:`str` en su lugar. Los tipos :class:`str` y :class:`bytes` no tienen suficiente funcionalidad en común para garantizar una clase base compartida. La herramienta ``2to3`` (ver más abajo) reemplaza cada aparición de :class:`basestring` por :class:`str`.

source: Files opened as text files (still the default mode for :func:`open`) always use an encoding to map between strings (in memory) and bytes (on disk). Binary files (opened with a ``b`` in the mode argument) always use bytes in memory. This means that if a file is opened using an incorrect mode or encoding, I/O will likely fail loudly, instead of silently producing incorrect data. It also means that even Unix users will have to specify the correct mode (text or binary) when opening a file. There is a platform-dependent default encoding, which on Unixy platforms can be set with the ``LANG`` environment variable (and sometimes also with some other platform-specific locale-related environment variables). In many cases, but not all, the system default is UTF-8; you should never count on this default. Any application reading or writing more than pure ASCII text should probably have a way to override the encoding. There is no longer any need for using the encoding-aware streams in the :mod:`codecs` module.
es_es: Los archivos abiertos como archivos de texto (todavía el modo predeterminado para :func:`open`) siempre utilizan una codificación para asignar entre cadenas de caracteres(en memoria) y bytes (en disco). Los archivos binarios (abiertos con una ``b`` en el argumento modo) siempre utilizan bytes en la memoria. Esto significa que si un archivo se abre utilizando un modo o codificación incorrectos, es probable que la E/S falle ruidosamente, en lugar de producir datos incorrectos de forma silenciosa. También significa que incluso los usuarios de Unix tendrán que especificar el modo correcto (texto o binario) al abrir un archivo. Hay una codificación predeterminada dependiente de la plataforma, que en las plataformas Unix se puede establecer con la variable de entorno ``LANG`` (y a veces también con algunas otras variables de entorno relacionadas con la configuración regional específicas de la plataforma). En muchos casos, pero no en todos, el valor predeterminado del sistema es UTF-8; nunca se debe contar con este valor predeterminado. Cualquier aplicación que lea o escriba más que texto ASCII puro probablemente debería tener una manera de invalidar la codificación. Ya no es necesario utilizar las secuencias compatibles con la codificación en el módulo :mod:`codecs`.

source: The initial values of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` are now unicode-only text files (i.e., they are instances of :class:`io.TextIOBase`). To read and write bytes data with these streams, you need to use their :data:`io.TextIOBase.buffer` attribute.
es_es: Los valores iniciales de :data:`sys.stdin`, :data:`sys.stdout` y :data:`sys.stderr` ahora son archivos de texto solo unicode (es decir, son instancias de :class:`io.TextIOBase`). Para leer y escribir datos de bytes con estas secuencias, se debe usar su atributo :data:`io.TextIOBase.buffer`.
