Repository: python/python-docs-es
Catalog: whatsnew/3.0.po
Languages: es_es

source: (Prerequisite:) Start with excellent test coverage.
es_es: (Prerrequisito:) Comenzar con excelente cobertura de test.

source: Port to Python 2.6. This should be no more work than the average port from Python 2.x to Python 2.(x+1). Make sure all your tests pass.
es_es: Migrar a Python 2.6. Esto no debería representar más trabajo que la migración promedio de Python 2.x a Python 2.(x+1). Asegurarse que todos los test pasen.

source: (Still using 2.6:) Turn on the :option:`!-3` command line switch. This enables warnings about features that will be removed (or change) in 3.0. Run your test suite again, and fix code that you get warnings about until there are no warnings left, and all your tests still pass.
es_es: (Todavía utilizando 2.6:) Activar el modificador de línea de comandos :option:`!-3`. Esto habilita las advertencias sobre las características que se eliminarán (o cambiarán) en 3.0. Ejecutar el conjunto de pruebas de nuevo y corregir el código sobre el que se recibe advertencias hasta que no queden advertencias y todas las pruebas sigan pasando.

source: Run the ``2to3`` source-to-source translator over your source code tree. (See :ref:`2to3-reference` for more on this tool.) Run the result of the translation under Python 3.0. Manually fix up any remaining issues, fixing problems until all tests pass again.
es_es: Ejecutar el traductor de origen a origen ``2to3`` sobre el árbol de código fuente. (Consultar :ref:`2to3-reference` para obtener más información sobre esta herramienta.) Ejecutar el resultado de la traducción en Python 3.0. Corregir manualmente los problemas restantes, solucionando problemas hasta que todos las pruebas vuelvan a pasar.

source: It is not recommended to try to write source code that runs unchanged under both Python 2.6 and 3.0; you'd have to use a very contorted coding style, e.g. avoiding ``print`` statements, metaclasses, and much more. If you are maintaining a library that needs to support both Python 2.6 and Python 3.0, the best approach is to modify step 3 above by editing the 2.6 version of the source code and running the ``2to3`` translator again, rather than editing the 3.0 version of the source code.
es_es: No se recomienda intentar escribir código fuente que se ejecute sin cambios en Python 2.6 y 3.0; se tendría que usar un estilo de codificación muy contorsionado, por ejemplo, evitando las sentencias ``print``, metaclases y mucho más. Si se mantiene una biblioteca que necesita soportar Python 2.6 y Python 3.0, el mejor enfoque es modificar el paso 3 anterior editando la versión 2.6 del código fuente y ejecutando el traductor ``2to3`` de nuevo, en lugar de editar la versión 3.0 del código fuente.

source: For porting C extensions to Python 3.0, please see :ref:`cporting-howto`.
es_es: Para migrar las extensiones C a Python 3.0, por favor ver :ref:`cporting-howto`.
