Repository: python/python-docs-es
Catalog: whatsnew/3.0.po
Languages: es_es

source: Filenames are passed to and returned from APIs as (Unicode) strings. This can present platform-specific problems because on some platforms filenames are arbitrary byte strings. (On the other hand, on Windows filenames are natively stored as Unicode.) As a work-around, most APIs (e.g. :func:`open` and many functions in the :mod:`os` module) that take filenames accept :class:`bytes` objects as well as strings, and a few APIs have a way to ask for a :class:`bytes` return value. Thus, :func:`os.listdir` returns a list of :class:`bytes` instances if the argument is a :class:`bytes` instance, and :func:`os.getcwdb` returns the current working directory as a :class:`bytes` instance. Note that when :func:`os.listdir` returns a list of strings, filenames that cannot be decoded properly are omitted rather than raising :exc:`UnicodeError`.
es_es: Los nombres de archivos son pasados y retornados de cadenas desde APIs como cadenas de caracteres (Unicode). Esto puede presentar problemas específicos de plataformas porque en algunas plataformas los nombres de archivos son cadenas de caracteres de bytes arbitrarios. (Por otro lado, en Windows los nombres de archivos son almacenados de forma nativa como Unicode.) Como solución alternativa, la mayoría de las APIs (por ejemplo :func:`open` y muchas otras funciones en el módulo :mod:`os`) que toman nombres de archivos aceptan tanto objetos :class:`bytes` como cadenas de caracteres, y algunas APIs tienen una forma de demandar por un valor de retorno :class:`bytes`. Por lo tanto, :func:`os.listdir` retorna una lista de instancias :class:`bytes` si el argumento es una instancia :class:`bytes`, y :func:`os.getcwdb` retorna el directorio de trabajo actual como una instancia :class:`bytes`. Tener en cuenta que cuando :func:`os.listdir` retorna una lista de cadenas de caracteres, los nombres de archivo que no se pueden decodificar correctamente se omiten en lugar de lanzar :exc:`UnicodeError`.

source: Some system APIs like :data:`os.environ` and :data:`sys.argv` can also present problems when the bytes made available by the system is not interpretable using the default encoding. Setting the ``LANG`` variable and rerunning the program is probably the best approach.
es_es: Algunas APIs del sistema como :data:`os.environ` y :data:`sys.argv` también pueden presentar problemas cuando los bytes puestos a disposición por el sistema no son interpretables usando la codificación predeterminada. Probablemente el mejor abordaje sea asignando la variable ``LANG`` y volviendo a ejecutar el programa.

source: :pep:`3138`: The :func:`repr` of a string no longer escapes non-ASCII characters. It still escapes control characters and code points with non-printable status in the Unicode standard, however.
es_es: :pep:`3138`: El :func:`repr` de una cadena de caracteres ya no escapa caracteres no ASCII. Sin embargo, todavía escapa caracteres de control caracteres y puntos de código con estado no imprimible en el estándar the Unicode.

source: :pep:`3120`: The default source encoding is now UTF-8.
es_es: :pep:`3120`: La codificación de fuente predeterminada ahora es UTF-8.

source: :pep:`3131`: Non-ASCII letters are now allowed in identifiers. (However, the standard library remains ASCII-only with the exception of contributor names in comments.)
es_es: :pep:`3131`: Letras no ASCII ahora están permitidas en identificadores. (De todas maneras, la librería estándar permanece como sólo ASCII con la excepción de nombres de colaboradores en comentarios.)

source: The :mod:`StringIO` and :mod:`cStringIO` modules are gone. Instead, import the :mod:`io` module and use :class:`io.StringIO` or :class:`io.BytesIO` for text and data respectively.
es_es: Los módulos :mod:`StringIO` and :mod:`cStringIO` ya no están. En su lugar, se importa el módulo the :mod:`io` y se usa :class:`io.StringIO` o :class:`io.BytesIO` para texto y datos respectivamente.

source: See also the :ref:`unicode-howto`, which was updated for Python 3.0.
es_es: Ver también :ref:`unicode-howto`, que fue actualizado para Python 3.0.

source: Overview Of Syntax Changes
es_es: Descripción general de los cambios de sintaxis

source: This section gives a brief overview of every *syntactic* change in Python 3.0.
es_es: Esta sección brinda una descripción general breve de cada cambio *sintáctico* en Python 3.0.

source: New Syntax
es_es: Nueva sintaxis

source: :pep:`3107`: Function argument and return value annotations. This provides a standardized way of annotating a function's parameters and return value. There are no semantics attached to such annotations except that they can be introspected at runtime using the :attr:`__annotations__` attribute. The intent is to encourage experimentation through metaclasses, decorators or frameworks.
es_es: :pep:`3107`: Argumento de función y anotaciones de valor retornado. Esto proporciona una forma estandarizada de anotar los parámetros y el valor retornado de una función. No hay semántica asociada a estas anotaciones, excepto que se pueden introspeccionar en tiempo de ejecución mediante el atributo :attr:`__annotations__`. La intención es fomentar la experimentación a través de metaclases, decoradores o *frameworks*.

source: :pep:`3102`: Keyword-only arguments. Named parameters occurring after ``*args`` in the parameter list *must* be specified using keyword syntax in the call. You can also use a bare ``*`` in the parameter list to indicate that you don't accept a variable-length argument list, but you do have keyword-only arguments.
es_es: :pep:`3102`: Argumentos de sólo palabra clave. Los parámetros con nombre que se producen después de ``*args`` en la lista de parámetros *deben* especificarse mediante la sintaxis de palabra clave en la llamada. También puede usarse apenas un ``*`` sólo en la lista de parámetros para indicar que no se acepta una lista de argumentos de longitud variable, pero se tiene argumentos de sólo palabra clave.

source: Keyword arguments are allowed after the list of base classes in a class definition. This is used by the new convention for specifying a metaclass (see next section), but can be used for other purposes as well, as long as the metaclass supports it.
es_es: Los argumentos de palabra clave se permiten después de la lista de clases base en una definición de clase. Esto lo usa la nueva convención para especificar una metaclase (consultar la sección siguiente), pero también se puede usar para otros fines, siempre y cuando la metaclase la admita.

source: :pep:`3104`: :keyword:`nonlocal` statement. Using ``nonlocal x`` you can now assign directly to a variable in an outer (but non-global) scope. :keyword:`!nonlocal` is a new reserved word.
es_es: :pep:`3104`: Declaración :keyword:`nonlocal`. Utilizando ``nonlocal x`` ahora se puede asignar directamente a una variable en un entorno externo (pero no global). :keyword:`!nonlocal` es una nueva palabra reservada.

source: :pep:`3132`: Extended Iterable Unpacking. You can now write things like ``a, b, *rest = some_sequence``. And even ``*rest, a = stuff``. The ``rest`` object is always a (possibly empty) list; the right-hand side may be any iterable. Example::
es_es: :pep:`3132`: Desempaque iterable extendido. Ahora se puede escribir cosas como ``a, b, *rest = some_sequence``. E incluso ``*rest, a = cosas``. El objeto ``rest`` es siempre una lista (posiblemente vacía); el lado derecho puede ser cualquier iterable. Ejemplo::

source: This sets *a* to ``0``, *b* to ``4``, and *rest* to ``[1, 2, 3]``.
es_es: Esto asigna *a* a ``0``, *b* a ``4``, y *rest* a ``[1, 2, 3]``.

source: Dictionary comprehensions: ``{k: v for k, v in stuff}`` means the same thing as ``dict(stuff)`` but is more flexible. (This is :pep:`274` vindicated. :-)
es_es: Comprensiones por diccionario: ``{k: v for k, v in cosas}`` significa lo mismo que ``dict(cosas)``, pero es más flexible. (Esto es :pep:`274` reivindicado. :-)

source: Set literals, e.g. ``{1, 2}``. Note that ``{}`` is an empty dictionary; use ``set()`` for an empty set. Set comprehensions are also supported; e.g., ``{x for x in stuff}`` means the same thing as ``set(stuff)`` but is more flexible.
es_es: Asignar los literales, por ejemplo, ``{1, 2}``. Tener en cuenta que ``{}`` es un diccionario vacío; utilizar ``set()`` para un conjunto vacío. También se admiten las comprensiones de conjunto; por ejemplo, ``x for x in cosas`` significa lo mismo que ``set(cosas)``, pero es más flexible.

source: New octal literals, e.g. ``0o720`` (already in 2.6). The old octal literals (``0720``) are gone.
es_es: Nuevos octales literales, por ejemplo, ``0o720`` (ya en 2.6). Los octales literales viejos (``0720``) se eliminaron.

source: New binary literals, e.g. ``0b1010`` (already in 2.6), and there is a new corresponding built-in function, :func:`bin`.
es_es: Nuevos literales binarios, por ejemplo, ``0b1010`` (ya en 2.6), y hay una nueva función incorporada correspondiente, :func:`bin`.

source: Bytes literals are introduced with a leading ``b`` or ``B``, and there is a new corresponding built-in function, :func:`bytes`.
es_es: Los literales de bytes se introducen con un ``b`` o ``B`` delantero, y hay una nueva función incorporada correspondiente, :func:`bytes`.

source: Changed Syntax
es_es: Sintaxis modificada

source: :pep:`3109` and :pep:`3134`: new :keyword:`raise` statement syntax: :samp:`raise [{expr} [from {expr}]]`. See below.
es_es: :pep:`3109` y :pep:`3134`: Nueva sintaxis de la instrucción :keyword:`raise`: :samp:`raise [{expr} [from {expr}]]`. Ver a continuación.

source: :keyword:`!as` and :keyword:`with` are now reserved words. (Since 2.6, actually.)
es_es: :keyword:`!as` y :keyword:`with` ahora son palabras reservadas. (Desde 2.6, de hecho.)

source: ``True``, ``False``, and ``None`` are reserved words. (2.6 partially enforced the restrictions on ``None`` already.)
es_es: ``True``, ``False`` y ``None`` son palabras reservadas. (2.6 parcialmente estableció restricciones ya en ``None``.)

source: Change from :keyword:`except` *exc*, *var* to :keyword:`!except` *exc* :keyword:`!as` *var*. See :pep:`3110`.
es_es: Cambio de :keyword:`except` *exc*, *var* a :keyword:`!except` *exc* :keyword:`!as` *var*.Ver :pep:`3110`.

source: :pep:`3115`: New Metaclass Syntax. Instead of::
es_es: :pep:`3115`: Nueva sintaxis de metaclase. En lugar de::

source: you must now use::
es_es: ahora se debe usar:

source: The module-global :data:`__metaclass__` variable is no longer supported. (It was a crutch to make it easier to default to new-style classes without deriving every class from :class:`object`.)
es_es: Ya no se admite la variable de módulo global :data:`__metaclass__`. (Era una muleta para facilitar al valor predeterminado a las clases de estilo nuevo sin derivar todas las clases de :class:`object`.)

source: List comprehensions no longer support the syntactic form :samp:`[... for {var} in {item1}, {item2}, ...]`. Use :samp:`[... for {var} in ({item1}, {item2}, ...)]` instead. Also note that list comprehensions have different semantics: they are closer to syntactic sugar for a generator expression inside a :func:`list` constructor, and in particular the loop control variables are no longer leaked into the surrounding scope.
es_es: Las listas por comprensión ya no admiten la forma sintáctica :samp:`[... for {var} in {item1}, {item2}, ...]`. Utilizar :samp:`[... for{var} in ({item1}, {item2}, ...)]` en su lugar. También tener en cuenta que las listas por comprensión tienen semántica diferente: están más cerca del azúcar sintáctico para una expresión de generador dentro de un constructor :func:`list` y, en particular, las variables de control de bucle ya no se filtran en el ámbito circundante.

source: The *ellipsis* (``...``) can be used as an atomic expression anywhere. (Previously it was only allowed in slices.) Also, it *must* now be spelled as ``...``. (Previously it could also be spelled as ``. . .``, by a mere accident of the grammar.)
es_es: La *elipsis* (``...``) puede ser utilizada como una expresión atómica en cualquier lugar. (Previamente sólo estaba permitida en segmentos.) Asimismo, esto ahora *debe* ser escrito como ``...``. (Anteriormente, también podía ser escrito como ``. . .``, por un mero accidente de la gramática.)

source: Removed Syntax
es_es: Sintaxis eliminada

source: :pep:`3113`: Tuple parameter unpacking removed. You can no longer write ``def foo(a, (b, c)): ...``. Use ``def foo(a, b_c): b, c = b_c`` instead.
es_es: :pep:`3113`: Desempaque de parámetros de tupla eliminados. Ya no se puede escribir ``def foo(a, (b, c)): ...``. Utilizar ``def foo(a, b_c): b, c = b_c`` en su lugar.

source: Removed backticks (use :func:`repr` instead).
es_es: Comillas invertidas eliminadas (usar :func:`repr` en su lugar).

source: Removed ``<>`` (use ``!=`` instead).
es_es: Eliminados ``<>`` (usar ``!=`` en su lugar).

source: Removed keyword: :func:`exec` is no longer a keyword; it remains as a function. (Fortunately the function syntax was also accepted in 2.x.) Also note that :func:`exec` no longer takes a stream argument; instead of ``exec(f)`` you can use ``exec(f.read())``.
es_es: Palabra clave eliminada: :func:`exec` ya no es una palabra clave; continúa siendo una función. (Afortunadamente la sintaxis de la función también era aceptada en 2.x.) Asimismo, nótese que la :func:`exec` ya no toma un argumento de flujo; en lugar de ``exec(f)`` se puede utilizar ``exec(f.read())``.

source: Integer literals no longer support a trailing ``l`` or ``L``.
es_es: Literales enteros no admiten más ``l`` o ``L`` finales.

source: String literals no longer support a leading ``u`` or ``U``.
es_es: Literales de cadena de caracteres no admiten más ``u`` or ``U`` iniciales.

source: The :keyword:`from` *module* :keyword:`import` ``*`` syntax is only allowed at the module level, no longer inside functions.
es_es: La sintaxis :keyword:`from` *module* :keyword:`import` ``*`` solo se permite en el nivel de módulo, ya no dentro de las funciones.

source: The only acceptable syntax for relative imports is :samp:`from .[{module}] import {name}`. All :keyword:`import` forms not starting with ``.`` are interpreted as absolute imports. (:pep:`328`)
es_es: La única sintaxis aceptable para *imports* relativos es :samp:`from .[{module}] import {name}`. Todos los formularios :keyword:`import` que no comienzan con ``.`` son interpretados como *imports* absolutos

source: Classic classes are gone.
es_es: Se eliminaron las clases clásicas.

source: Changes Already Present In Python 2.6
es_es: Cambios ya presentes en Python 2.6

source: Since many users presumably make the jump straight from Python 2.5 to Python 3.0, this section reminds the reader of new features that were originally designed for Python 3.0 but that were back-ported to Python 2.6. The corresponding sections in :ref:`whats-new-in-2.6` should be consulted for longer descriptions.
es_es: Dado que es de suponer que muchos usuarios saltan directamente de Python 2.5 a Python 3.0, esta sección recuerda al lector nuevas características que se diseñaron originalmente para Python 3.0 pero que fueron llevadas hacia atrás a Python 2.6. Las secciones correspondientes en :ref:`whats-new-in-2.6` deberían ser consultadas para descripciones más largas.

source: :ref:`pep-0343`. The :keyword:`with` statement is now a standard feature and no longer needs to be imported from the :mod:`__future__`. Also check out :ref:`new-26-context-managers` and :ref:`new-module-contextlib`.
es_es: :ref:`pep-0343`.La declaración :keyword:`with` ahora es una característica estándar y ya no necesita ser importada del :mod:`__future__`. También puede revisarse :ref:`new-26-context-managers` y :ref:`new-module-contextlib`.

source: :ref:`pep-0366`. This enhances the usefulness of the :option:`-m` option when the referenced module lives in a package.
es_es: :ref:`pep-0366`. Esto mejora la utilidad de opción :option:`-m` cuando el módulo al que se hace referencia vive en un paquete.

source: :ref:`pep-3101`. Note: the 2.6 description mentions the :meth:`format` method for both 8-bit and Unicode strings. In 3.0, only the :class:`str` type (text strings with Unicode support) supports this method; the :class:`bytes` type does not. The plan is to eventually make this the only API for string formatting, and to start deprecating the ``%`` operator in Python 3.1.
es_es: :ref:`pep-3101`. Nota: la descripción 2.6 menciona el método :meth:`format` tanto para cadenas de caracteres 8 bits como de Unicode. En 3.0, solo el tipo :class:`str` (cadenas de texto con compatibilidad con Unicode) admite este método; el tipo :class:`bytes` no. El plan es a la larga convertir esta en la única API para el formato de cadena de caracteres y comenzar a dejar de utilizar el operador ``%`` en Python 3.1.

source: :ref:`pep-3105`. This is now a standard feature and no longer needs to be imported from :mod:`__future__`. More details were given above.
es_es: :ref:`pep-3105`. Esta ahora es una característica estándar y ya no necesita ser importada de :mod:`__future__`. Más detalles fueron dados anteriormente.

source: :ref:`pep-3110`. The :keyword:`except` *exc* :keyword:`!as` *var* syntax is now standard and :keyword:`!except` *exc*, *var* is no longer supported. (Of course, the :keyword:`!as` *var* part is still optional.)
es_es: :ref:`pep-3110`. La sintaxis :keyword:`except` *exc* :keyword:`!as` *var* ahora es estándar y :keyword:`!except` *exc*, *var* ya no es compatible. (Por supuesto, la parte :keyword:`!as` *var* sigue siendo opcional.)

source: :ref:`pep-3112`. The ``b"..."`` string literal notation (and its variants like ``b'...'``, ``b"""..."""``, and ``br"..."``) now produces a literal of type :class:`bytes`.
es_es: :ref:`pep-3112`. La notación literal de cadena de caracteres ``b"..."`` (y sus variantes como ``b'...'``, ``b"""..."""``, y ``br"..."``) ahora genera un literal de tipo :class:`bytes`.

source: :ref:`pep-3116`. The :mod:`io` module is now the standard way of doing file I/O. The built-in :func:`open` function is now an alias for :func:`io.open` and has additional keyword arguments *encoding*, *errors*, *newline* and *closefd*. Also note that an invalid *mode* argument now raises :exc:`ValueError`, not :exc:`IOError`. The binary file object underlying a text file object can be accessed as :attr:`f.buffer` (but beware that the text object maintains a buffer of itself in order to speed up the encoding and decoding operations).
es_es: :ref:`pep-3116`. El módulo :mod:`io` ahora es la forma estándar de hacer E/S de archivos. La función incorporada :func:`open` ahora es un alias para :func:`io.open` y tiene argumentos de palabra clave adicionales *encoding*, *errors*, *newline* y *closefd*. Tener en cuenta también que un argumento *mode* inválido ahora lanza :exc:`ValueError`, no :exc:`IOError`. Se puede acceder al objeto de archivo binario subyacente a un objeto de archivo de texto como :attr:`f.buffer` (pero tener en cuenta que el objeto de texto mantiene un búfer de sí mismo para acelerar las operaciones de codificación y descodificación).

source: :ref:`pep-3118`. The old builtin :func:`buffer` is now really gone; the new builtin :func:`memoryview` provides (mostly) similar functionality.
es_es: :ref:`pep-3118`. El antiguo :func:`buffer` incorporado ahora realmente se ha eliminado; el :func:`memoryview` incorporado nuevo proporciona (mayormente) una funcionalidad similar.

source: :ref:`pep-3119`. The :mod:`abc` module and the ABCs defined in the :mod:`collections` module plays a somewhat more prominent role in the language now, and built-in collection types like :class:`dict` and :class:`list` conform to the :class:`collections.MutableMapping` and :class:`collections.MutableSequence` ABCs, respectively.
es_es: :ref:`pep-3119`. El módulo :mod:`abc` y los ABC definidos en el módulo :mod:`collections` desempeñan un papel algo más destacado en el lenguaje ahora, y los tipos de colección incorporados como :class:`dict` y :class:`list` se ajustan a los ABCs de :class:`collections.MutableMapping` y :class:`collections.MutableSequence`, respectivamente.

source: :ref:`pep-3127`. As mentioned above, the new octal literal notation is the only one supported, and binary literals have been added.
es_es: :ref:`pep-3127`. Como se mencionó anteriormente, la nueva notación literal octal es la única admitida y se han agregado literales binarios.

source: :ref:`pep-3141`. The :mod:`numbers` module is another new use of ABCs, defining Python's "numeric tower". Also note the new :mod:`fractions` module which implements :class:`numbers.Rational`.
es_es: :ref:`pep-3141`. El módulo :mod:`numbers` es otro uso nuevo de ABCs, definiendo la "torre numérica" de Python. También tener en cuenta el nuevo módulo :mod:`fractions` que implementa :class:`numbers.Rational`.

source: Library Changes
es_es: Cambios de biblioteca

source: Due to time constraints, this document does not exhaustively cover the very extensive changes to the standard library. :pep:`3108` is the reference for the major changes to the library. Here's a capsule review:
es_es: Debido a las limitaciones de tiempo, este documento no cubre exhaustivamente los muy extensos cambios en la biblioteca estándar. :pep:`3108` es la referencia para los principales cambios en la biblioteca. Aquí hay una revisión de cápsula:

source: Many old modules were removed. Some, like :mod:`gopherlib` (no longer used) and :mod:`md5` (replaced by :mod:`hashlib`), were already deprecated by :pep:`4`. Others were removed as a result of the removal of support for various platforms such as Irix, BeOS and Mac OS 9 (see :pep:`11`). Some modules were also selected for removal in Python 3.0 due to lack of use or because a better replacement exists. See :pep:`3108` for an exhaustive list.
es_es: Se eliminaron muchos módulos antiguos. Algunos, como :mod:`gopherlib` (ya no se usa) y :mod:`md5` (reemplazado por :mod:`hashlib`), ya estaban en desuso por :pep:`4`. Otros fueron eliminados como resultado de la eliminación de soporte para varias plataformas como Irix, BeOS y Mac OS 9 (ver :pep:`11`). Algunos módulos también fueron seleccionados para su eliminación en Python 3.0 debido a la falta de uso o porque existe un mejor reemplazo. Consultar :pep:`3108` para obtener una lista exhaustiva.

source: The :mod:`bsddb3` package was removed because its presence in the core standard library has proved over time to be a particular burden for the core developers due to testing instability and Berkeley DB's release schedule. However, the package is alive and well, externally maintained at https://www.jcea.es/programacion/pybsddb.htm.
es_es: El paquete :mod:`bsddb3` fue eliminado porque su presencia en la biblioteca estándar principal ha demostrado con el tiempo ser una particular carga para los desarrolladores principales, debido a la inestabilidad de las pruebas y la programación del lanzamiento de Berkeley DB. Sin embargo, el paquete está vivo y bien, mantenido externamente en https://www.jcea.es/programacion/pybsddb.htm.

source: Some modules were renamed because their old name disobeyed :pep:`8`, or for various other reasons. Here's the list:
es_es: Algunos módulos fueron renombrados porque su antiguo nombre desobedeció :pep:`8`, o por varias otras razones. Aquí está la lista:

source: Old Name
es_es: Nombre anterior

source: New Name
es_es: Nombre nuevo
