Repository: python/python-docs-es
Catalog: whatsnew/3.0.po
Languages: es_es

source: A common pattern in Python 2.x is to have one version of a module implemented in pure Python, with an optional accelerated version implemented as a C extension; for example, :mod:`pickle` and :mod:`cPickle`. This places the burden of importing the accelerated version and falling back on the pure Python version on each user of these modules. In Python 3.0, the accelerated versions are considered implementation details of the pure Python versions. Users should always import the standard version, which attempts to import the accelerated version and falls back to the pure Python version. The :mod:`pickle` / :mod:`cPickle` pair received this treatment. The :mod:`profile` module is on the list for 3.1. The :mod:`StringIO` module has been turned into a class in the :mod:`io` module.
es_es: Un patrón común en Python 2.x es tener una versión de un módulo implementado en Python puro, con una versión acelerada opcional implementada como una extensión C; por ejemplo, :mod:`pickle` y :mod:`cPickle`. Esto coloca la carga de importar la versión acelerada y volver a caer en la versión de Python pura en cada usuario de estos módulos. En Python 3.0, las versiones aceleradas se consideran detalles de implementación de las versiones puras de Python. Los usuarios siempre deberían importar la versión estándar, que intenta importar la versión acelerada y vuelve a la versión de Python pura. El par :mod:`pickle` / :mod:`cPickle` recibió este tratamiento. El módulo :mod:`profile` está en la lista para 3.1. El módulo :mod:`StringIO` se ha convertido en una clase en el módulo :mod:`io`.

source: Some related modules have been grouped into packages, and usually the submodule names have been simplified. The resulting new packages are:
es_es: Algunos módulos relacionados se han agrupado en paquetes y, por lo general, los nombres de submódulo se han simplificado. Los nuevos paquetes resultantes son:

source: :mod:`tkinter` (all :mod:`Tkinter`-related modules except :mod:`turtle`). The target audience of :mod:`turtle` doesn't really care about :mod:`tkinter`. Also note that as of Python 2.6, the functionality of :mod:`turtle` has been greatly enhanced.
es_es: :mod:`tkinter` (todos los módulos relacionados con :mod:`Tkinter` excepto :mod:`turtle`). Al público objetivo de :mod:`turtle` no le interesa realmente :mod:`tkinter`. También tener en cuenta que a partir de Python 2.6, la funcionalidad de :mod:`turtle` se ha mejorado considerablemente.

source: Some other changes to standard library modules, not covered by :pep:`3108`:
es_es: Algunos otros cambios a los módulos de la biblioteca estándar, no cubiertos por :pep:`3108`:

source: Killed :mod:`sets`. Use the built-in :func:`set` class.
es_es: Quitado :mod:`sets`. Usar la clase incorporada :func:`set`.

source: Cleanup of the :mod:`sys` module: removed :func:`sys.exitfunc`, :func:`sys.exc_clear`, :data:`sys.exc_type`, :data:`sys.exc_value`, :data:`sys.exc_traceback`. (Note that :data:`sys.last_type` etc. remain.)
es_es: Limpiado el módulo :mod:`sys`: quitado :func:`sys.exitfunc`, :func:`sys.exc_clear`, :data:`sys.exc_type`, :data:`sys.exc_value`, :data:`sys.exc_traceback`. (Notar que :data:`sys.last_type` etc. permanece.)

source: Cleanup of the :class:`array.array` type: the :meth:`read` and :meth:`write` methods are gone; use :meth:`fromfile` and :meth:`tofile` instead. Also, the ``'c'`` typecode for array is gone -- use either ``'b'`` for bytes or ``'u'`` for Unicode characters.
es_es: Limpiado del tipo :class:`array.array`: los métodos :meth:`read` y :meth:`write` ya no están; usar :meth:`fromfile` y :meth:`tofile` en su lugar. Asimismo, the el código de tipo ``'c'`` para arreglo ya no está-- utilizar o bien ``'b'`` para bytes o ``'u'`` para caracteres Unicode.

source: Cleanup of the :mod:`operator` module: removed :func:`sequenceIncludes` and :func:`isCallable`.
es_es: Limpieza del módulo :mod:`operator`: quitados :func:`sequenceIncludes` y :func:`isCallable`.

source: Cleanup of the :mod:`thread` module: :func:`acquire_lock` and :func:`release_lock` are gone; use :func:`acquire` and :func:`release` instead.
es_es: Limpieza del módulo :mod:`thread`: :func:`acquire_lock` y :func:`release_lock` ya no están; utilizar :func:`acquire` y :func:`release` en su lugar.

source: Cleanup of the :mod:`random` module: removed the :func:`jumpahead` API.
es_es: Limpieza del módulo :mod:`random`: quitada la API :func:`jumpahead`.

source: The :mod:`new` module is gone.
es_es: El módulo :mod:`new` ya no está.

source: The functions :func:`os.tmpnam`, :func:`os.tempnam` and :func:`os.tmpfile` have been removed in favor of the :mod:`tempfile` module.
es_es: Las funciones :func:`os.tmpnam`, :func:`os.tempnam` y :func:`os.tmpfile` se han eliminado en favor del módulo :mod:`tempfile`.

source: The :mod:`tokenize` module has been changed to work with bytes. The main entry point is now :func:`tokenize.tokenize`, instead of generate_tokens.
es_es: El módulo :mod:`tokenize` se ha cambiado para trabajar con bytes. El punto de entrada principal es ahora :func:`tokenize.tokenize`, en lugar de generate_tokens.

source: :data:`string.letters` and its friends (:data:`string.lowercase` and :data:`string.uppercase`) are gone. Use :data:`string.ascii_letters` etc. instead. (The reason for the removal is that :data:`string.letters` and friends had locale-specific behavior, which is a bad idea for such attractively named global "constants".)
es_es: :data:`string.letters` y sus amigos (:data:`string.lowercase` y :data:`string.uppercase`) se han ido. Utilice :data:`string.ascii_letters`, etc. en su lugar. (El motivo de la eliminación es que :data:`string.letters` y sus amigos tenían un comportamiento específico de la configuración regional, lo cual es una mala idea para "constantes" globales con nombres tan atractivos).

source: Renamed module :mod:`__builtin__` to :mod:`builtins` (removing the underscores, adding an 's'). The :data:`__builtins__` variable found in most global namespaces is unchanged. To modify a builtin, you should use :mod:`builtins`, not :data:`__builtins__`!
es_es: Renombrado el módulo :mod:`__builtin__` a :mod:`builtins` (quitando los guiones bajos, agregando una 's'). La variable :data:`__builtins__` encontrada en la mayoría de los espacios de nombres globales no tiene cambios. Para modificar un *builtin*, Se debería usar :mod:`builtins`, no :data:`__builtins__`!

source: :pep:`3101`: A New Approach To String Formatting
es_es: :pep:`3101`: Un nuevo enfoque al formateo de cadena de caracteres

source: A new system for built-in string formatting operations replaces the ``%`` string formatting operator. (However, the ``%`` operator is still supported; it will be deprecated in Python 3.1 and removed from the language at some later time.) Read :pep:`3101` for the full scoop.
es_es: Un nuevo sistema para operaciones de formateo de cadenas de caracteres incorporadas reemplaza el operador de formato de cadena de caracteres ``%``. (De todas maneras, el operador ``%`` sigue siento soportado; será obsoleto en Python 3.1 y quitado del lenguaje en algún momento más adelante.) Leer :pep:`3101` para la primicia completa.

source: Changes To Exceptions
es_es: Cambios a excepciones

source: The APIs for raising and catching exception have been cleaned up and new powerful features added:
es_es: Las APIs para lanzar y capturar excepciones se limpiaron y se agregaron nuevas características poderosas:

source: :pep:`352`: All exceptions must be derived (directly or indirectly) from :exc:`BaseException`. This is the root of the exception hierarchy. This is not new as a recommendation, but the *requirement* to inherit from :exc:`BaseException` is new. (Python 2.6 still allowed classic classes to be raised, and placed no restriction on what you can catch.) As a consequence, string exceptions are finally truly and utterly dead.
es_es: :pep:`352`: Todas las excepciones deben derivarse (directa o indirectamente) de :exc:`BaseException`. Esta es la raíz de la jerarquía de excepciones. Esto no es nuevo como recomendación, pero el *requisito* de heredar de :exc:`BaseException` es nuevo. (Python 2.6 aún permitía que las clases clásicas se lanzaran, y no ponía ninguna restricción en lo que se podía capturar.) Como consecuencia, las excepciones de cadena de caracteres finalmente están verdaderamente y completamente muertas.

source: Almost all exceptions should actually derive from :exc:`Exception`; :exc:`BaseException` should only be used as a base class for exceptions that should only be handled at the top level, such as :exc:`SystemExit` or :exc:`KeyboardInterrupt`. The recommended idiom for handling all exceptions except for this latter category is to use :keyword:`except` :exc:`Exception`.
es_es: Casi todas las excepciones deberían de hecho derivarse de :exc:`Exception`; :exc:`BaseException` sólo debe utilizarse como clase base para las excepciones que solo deben controlarse en el nivel superior, como :exc:`SystemExit` o :exc:`KeyboardInterrupt`. El modismo recomendado para controlar todas las excepciones excepto esta última categoría es usar :keyword:`except` :exc:`Exception`.

source: :exc:`StandardError` was removed.
es_es: :exc:`StandardError` fue eliminado.

source: Exceptions no longer behave as sequences. Use the :attr:`args` attribute instead.
es_es: Las excepciones ya no se comportan como secuencias. Utilizar el atributo :attr:`args` en su lugar.

source: :pep:`3109`: Raising exceptions. You must now use :samp:`raise {Exception}({args})` instead of :samp:`raise {Exception}, {args}`. Additionally, you can no longer explicitly specify a traceback; instead, if you *have* to do this, you can assign directly to the :attr:`__traceback__` attribute (see below).
es_es: :pep:`3109`: Lanzando excepciones. Ahora se debe usar :samp:`raise {Exception}({args})` en lugar de :samp:`raise {Exception}, {args}`. Adicionalmente, ya no se puede especificar explícitamente un traceback; en su lugar, si se *debe* hacer esto, se puede asignar directamente al atributo :attr:`__traceback__` (ver debajo).

source: :pep:`3110`: Catching exceptions. You must now use :samp:`except {SomeException} as {variable}` instead of :samp:`except {SomeException}, {variable}`. Moreover, the *variable* is explicitly deleted when the :keyword:`except` block is left.
es_es: :pep:`3110`: Atrapando excepciones. Ahora se debe usar :samp:`except {AlgunaExcepcion} como {variable}` en lugar de :samp:`except {AlgunaExcepcion}, {variable}`. Además, la *variable* es específicamente eliminada cuando el bloque :keyword:`except` se deja.

source: :pep:`3134`: Exception chaining. There are two cases: implicit chaining and explicit chaining. Implicit chaining happens when an exception is raised in an :keyword:`except` or :keyword:`finally` handler block. This usually happens due to a bug in the handler block; we call this a *secondary* exception. In this case, the original exception (that was being handled) is saved as the :attr:`__context__` attribute of the secondary exception. Explicit chaining is invoked with this syntax::
es_es: :pep:`3134`: Encadenamiento de excepciones. Hay dos casos: encadenamiento implícito y encadenamiento explícito. El encadenamiento implícito se produce cuando se lanza una excepción en un bloque de controlador :keyword:`except` o :keyword:`finally`. Esto suele ocurrir debido a un error en el bloque de controlador; llamamos a esto una excepción *secundaria*. En este caso, la excepción original (que se estaba controlando) se guarda como el atributo :attr:`__context__` de la excepción secundaria. El encadenamiento explícito se invoca con esta sintaxis:

source: (where *primary_exception* is any expression that produces an exception object, probably an exception that was previously caught). In this case, the primary exception is stored on the :attr:`__cause__` attribute of the secondary exception. The traceback printed when an unhandled exception occurs walks the chain of :attr:`__cause__` and :attr:`__context__` attributes and prints a separate traceback for each component of the chain, with the primary exception at the top. (Java users may recognize this behavior.)
es_es: (donde *primary_exception* es cualquier expresión que produce un objeto de excepción, probablemente una excepción que se detectó anteriormente). En este caso, la excepción principal se almacena en el atributo :attr:`__cause__` de la excepción secundaria. El traceback impreso recorre la cadena de atributos :attr:`__cause__` y :attr:`__context__` cuando se produce una excepción no controlada e imprime un traceback independiente para cada componente de la cadena, con la excepción principal en la parte superior. (Los usuarios de Java pueden reconocer este comportamiento.)

source: :pep:`3134`: Exception objects now store their traceback as the :attr:`__traceback__` attribute. This means that an exception object now contains all the information pertaining to an exception, and there are fewer reasons to use :func:`sys.exc_info` (though the latter is not removed).
es_es: :pep:`3134`: Los objetos de excepción ahora almacenan su traceback como el atributo :attr:`__traceback__`. Esto significa que un objeto de excepción ahora contiene toda la información relativa a una excepción y hay menos razones para usar :func:`sys.exc_info` (aunque este último no se quita).

source: A few exception messages are improved when Windows fails to load an extension module. For example, ``error code 193`` is now ``%1 is not a valid Win32 application``. Strings now deal with non-English locales.
es_es: Algunos mensajes de excepción se mejoraron cuando Windows falla al cargar un módulo de extensión. Por ejemplo, ``error code 193`` ahora es ``%1 is not a valid Win32 application``. Las cadenas de caracteres ahora tratan con configuraciones regionales no inglesas.

source: Miscellaneous Other Changes
es_es: Otros cambios diversos

source: Operators And Special Methods
es_es: Operadores y métodos especiales

source: ``!=`` now returns the opposite of ``==``, unless ``==`` returns :data:`NotImplemented`.
es_es: ``!=`` ahora retorna lo opuesto de ``==``, salvo que ``==`` retorne :data:`NotImplemented`.

source: The concept of "unbound methods" has been removed from the language. When referencing a method as a class attribute, you now get a plain function object.
es_es: El concepto de "métodos independientes" fue quitado del lenguaje. Cuando se refiere a un método como atributo de clase, ahora se obtiene un objeto de función simple.

source: :meth:`__getslice__`, :meth:`__setslice__` and :meth:`__delslice__` were killed. The syntax ``a[i:j]`` now translates to ``a.__getitem__(slice(i, j))`` (or :meth:`__setitem__` or :meth:`__delitem__`, when used as an assignment or deletion target, respectively).
es_es: :meth:`__getslice__`, :meth:`__setslice__` y :meth:`__delslice__` se quitaron. La sintaxis ``a[i:j]`` ahora se traduce a ``a.__getitem__(slice(i, j))`` (o :meth:`__setitem__` o :meth:`__delitem__`, cuando se utiliza como destino de asignación o eliminación, respectivamente).

source: :pep:`3114`: the standard :meth:`next` method has been renamed to :meth:`~iterator.__next__`.
es_es: :pep:`3114`: El método estándar :meth:`next` se ha renombrado como :meth:`~iterator.__next__`.

source: The :meth:`__oct__` and :meth:`__hex__` special methods are removed -- :func:`oct` and :func:`hex` use :meth:`__index__` now to convert the argument to an integer.
es_es: Los métodos especiales :meth:`__oct__` y :meth:`__hex__` se quitaron -- :func:`oct` y :func:`hex` utilizan :meth:`__index__` ahora para convertir el argumento a un entero.

source: Removed support for :attr:`__members__` and :attr:`__methods__`.
es_es: Soporte eliminado para :attr:`__members__` y :attr:`__methods__`.

source: The function attributes named :attr:`func_X` have been renamed to use the :data:`__X__` form, freeing up these names in the function attribute namespace for user-defined attributes. To wit, :attr:`func_closure`, :attr:`func_code`, :attr:`func_defaults`, :attr:`func_dict`, :attr:`func_doc`, :attr:`func_globals`, :attr:`func_name` were renamed to :attr:`__closure__`, :attr:`__code__`, :attr:`__defaults__`, :attr:`~object.__dict__`, :attr:`__doc__`, :attr:`__globals__`, :attr:`~definition.__name__`, respectively.
es_es: Se ha cambiado el nombre de los atributos de función denominados :attr:`func_X` para utilizar el formulario :data:`__X__`, liberando estos nombres en el espacio de nombres de atributo de función para los atributos definidos por el usuario. Es decir, :attr:`func_closure`, :attr:`func_code`, :attr:`func_defaults`, :attr:`func_dict`, :attr:`func_doc`, :attr:`func_globals`, :attr:`func_name` se renombraron a :attr:`__closure__`, :attr:`__code__`, :attr:`__defaults__`, :attr:`~object.__dict__`, :attr:`__doc__`, :attr:`__globals__`, :attr:`~definition.__name__`, respectivamente.

source: Builtins
es_es: Incorporados

source: :pep:`3135`: New :func:`super`. You can now invoke :func:`super` without arguments and (assuming this is in a regular instance method defined inside a :keyword:`class` statement) the right class and instance will automatically be chosen. With arguments, the behavior of :func:`super` is unchanged.
es_es: :pep:`3135`: Nuevo :func:`super`. Ahora se puede invocar :func:`super` sin argumentos y (suponiendo que se encuentra en un método de instancia normal definido dentro de una declaración :keyword:`class`) se elegirá automáticamente la clase y la instancia correctas. Con argumentos, el comportamiento de :func:`super` no cambia.

source: :pep:`3111`: :func:`raw_input` was renamed to :func:`input`. That is, the new :func:`input` function reads a line from :data:`sys.stdin` and returns it with the trailing newline stripped. It raises :exc:`EOFError` if the input is terminated prematurely. To get the old behavior of :func:`input`, use ``eval(input())``.
es_es: :pep:`3111`: :func:`raw_input` se renombró a :func:`input`. Es decir, la nueva función :func:`input` lee una línea de :data:`sys.stdin` y la retorna con la línea final despojada. Lanza :exc:`EOFError` si la entrada se termina prematuramente. Para obtener el comportamiento anterior de :func:`input`, utilice ``eval(input())``.

source: A new built-in function :func:`next` was added to call the :meth:`~iterator.__next__` method on an object.
es_es: Se añadió una nueva función incorporada :func:`next` para llamar al método :meth:`~iterator.__next__` sobre un objeto.

source: The :func:`round` function rounding strategy and return type have changed. Exact halfway cases are now rounded to the nearest even result instead of away from zero. (For example, ``round(2.5)`` now returns ``2`` rather than ``3``.) ``round(x[, n])`` now delegates to ``x.__round__([n])`` instead of always returning a float. It generally returns an integer when called with a single argument and a value of the same type as ``x`` when called with two arguments.
es_es: La estrategia de redondeo de la función :func:`round` y el tipo de retorno han cambiado. Los casos exactamente a mitad de camino ahora se redondean al resultado par más cercano en lugar de alejarse de cero. (Por ejemplo, ``round(2.5)`` ahora retorna ''2'' en lugar de ``3``.) ``round(x[, n])`` ahora delega en ``x.__round__([n])`` en lugar de retornar siempre un float. Por lo general, retorna un entero cuando se llama con un único argumento y un valor del mismo tipo que ``x`` cuando se llama con dos argumentos.

source: Moved :func:`intern` to :func:`sys.intern`.
es_es: Se movió :func:`intern` a :func:`sys.intern`.

source: Removed: :func:`apply`. Instead of ``apply(f, args)`` use ``f(*args)``.
es_es: Se eliminó: :func:`apply`. En lugar de ``apply(f, args)`` se utiliza ``f(*args)``.

source: Removed :func:`callable`. Instead of ``callable(f)`` you can use ``isinstance(f, collections.Callable)``. The :func:`operator.isCallable` function is also gone.
es_es: Se eliminó :func:`callable`. En lugar de ``callable(f)`` se puede utilizar ``isinstance(f, collections.Callable)``. La función :func:`operator.isCallable` también se quitó.

source: Removed :func:`coerce`. This function no longer serves a purpose now that classic classes are gone.
es_es: Se eliminó :func:`coerce`. Esta función ya no sirve para nada ahora que las clases clásicas se han quitado.

source: Removed :func:`execfile`. Instead of ``execfile(fn)`` use ``exec(open(fn).read())``.
es_es: Se eliminó :func:`execfile`. En lugar de ``execfile(fn)`` utilizar ``exec(open(fn).read())``.

source: Removed the :class:`file` type. Use :func:`open`. There are now several different kinds of streams that open can return in the :mod:`io` module.
es_es: Se eliminó el tipo :class:`file`. Se utiliza :func:`open`. Ahora hay varios tipos diferentes de secuencias que se abren y pueden retornar en el módulo :mod:`io`.

source: Removed :func:`reduce`. Use :func:`functools.reduce` if you really need it; however, 99 percent of the time an explicit :keyword:`for` loop is more readable.
es_es: Se eliminó :func:`reduce`. Se puede utilizar :func:`functools.reduce` si es realmente necesario; de todas maneras, 99 por ciento del tiempo un bucle :keyword:`for` explícito es más legible.

source: Removed. :meth:`dict.has_key` -- use the :keyword:`in` operator instead.
es_es: Se eliminó :meth:`dict.has_key` -- se utiliza el operador :keyword:`in` en su lugar.

source: Build and C API Changes
es_es: Construcción y cambios a la API de C

source: Due to time constraints, here is a *very* incomplete list of changes to the C API.
es_es: Debido a restricciones de tiempo, aquí hay una *muy* incompleta lista de cambios a la API de C.

source: Support for several platforms was dropped, including but not limited to Mac OS 9, BeOS, RISCOS, Irix, and Tru64.
es_es: Se ha eliminado el soporte para varias plataformas, incluyendo pero no limitado a Mac OS 9, BeOS, RISCOS, Irix y Tru64.

source: :pep:`3118`: New Buffer API.
es_es: :pep:`3118`: Nueva API de búfer.

source: :pep:`3121`: Extension Module Initialization & Finalization.
es_es: :pep:`3121`: Inicialización y finalización de módulos de extensión.

source: :pep:`3123`: Making :c:macro:`PyObject_HEAD` conform to standard C.
es_es: :pep:`3123`: Haciendo :c:macro:`PyObject_HEAD` conforme al estándar C.

source: No more C API support for restricted execution.
es_es: No más compatibilidad con API C para ejecución restringida.

source: New C API :c:func:`PyImport_ImportModuleNoBlock`, works like :c:func:`PyImport_ImportModule` but won't block on the import lock (returning an error instead).
es_es: La nueva API C :c:func:`PyImport_ImportModuleNoBlock`, trabaja como :c:func:`PyImport_ImportModule` pero no bloqueará en el bloqueo de importación (en su lugar, retornará un error).

source: Renamed the boolean conversion C-level slot and method: ``nb_nonzero`` is now ``nb_bool``.
es_es: Se renombró la conversión booleana de ranura de nivel C y el método: ``nb_nonzero`` ahora es ``nb_bool``.

source: Performance
es_es: Rendimiento

source: The net result of the 3.0 generalizations is that Python 3.0 runs the pystone benchmark around 10% slower than Python 2.5. Most likely the biggest cause is the removal of special-casing for small integers. There's room for improvement, but it will happen after 3.0 is released!
es_es: El resultado neto de las generalizaciones 3.0 es que Python 3.0 ejecuta el punto de referencia *pystone* alrededor de 10% más lenta que Python 2.5. Lo más probable es que la mayor causa sea la eliminación de mayúsculas y minúsculas especiales para enteros pequeños. Hay margen de mejora, ¡pero sucederá después de que se publique 3.0!

source: Porting To Python 3.0
es_es: Migración a Python 3.0

source: For porting existing Python 2.5 or 2.6 source code to Python 3.0, the best strategy is the following:
es_es: Para migrar código Python 2.5 o 2.6 existente a Python 3.0, la mejor estrategia es la siguiente:
