Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: What's New In Python 3.12
es: Novedades de Python 3.12

source: This article explains the new features in Python 3.12, compared to 3.11. Python 3.12 was released on October 2, 2023. For full details, see the :ref:`changelog <changelog>`.
es: Este artículo explica las nuevas características de Python 3.12, en comparación con 3.11. Python 3.12 se lanzó el 2 de octubre de 2023. Para obtener detalles completos, consulte :ref:`changelog <changelog>`.

source: :pep:`693` -- Python 3.12 Release Schedule
es: :pep:`693` - Calendario de lanzamiento de Python 3.12

source: Summary -- Release highlights
es: Resumen: aspectos destacados de la versión

source: Python 3.12 is the latest stable release of the Python programming language, with a mix of changes to the language and the standard library. The library changes focus on cleaning up deprecated APIs, usability, and correctness. Of note, the :mod:`!distutils` package has been removed from the standard library. Filesystem support in :mod:`os` and :mod:`pathlib` has seen a number of improvements, and several modules have better performance.
es: Python 3.12 es la última versión estable del lenguaje de programación Python, con una combinación de cambios en el lenguaje y la biblioteca estándar. Los cambios en la biblioteca se centran en limpiar las API obsoletas, su usabilidad y su corrección. Es de destacar que el paquete :mod:`!distutils` se ha eliminado de la biblioteca estándar. La compatibilidad con el sistema de archivos en :mod:`os` y :mod:`pathlib` ha experimentado una serie de mejoras y varios módulos tienen un mejor rendimiento.

source: The language changes focus on usability, as :term:`f-strings <f-string>` have had many limitations removed and 'Did you mean ...' suggestions continue to improve. The new :ref:`type parameter syntax <whatsnew312-pep695>` and :keyword:`type` statement improve ergonomics for using :term:`generic types <generic type>` and :term:`type aliases <type alias>` with static type checkers.
es: Los cambios de idioma se centran en la usabilidad, ya que a :term:`f-strings <f-string>` se le han eliminado muchas limitaciones y las sugerencias "¿Quiso decir..." continúan mejorando. La nueva declaración :ref:`type parameter syntax <whatsnew312-pep695>` y :keyword:`type` mejora la ergonomía para usar :term:`generic types <generic type>` y :term:`type aliases <type alias>` con controladores de tipo estático.

source: This article doesn't attempt to provide a complete specification of all new features, but instead gives a convenient overview. For full details, you should refer to the documentation, such as the :ref:`Library Reference <library-index>` and :ref:`Language Reference <reference-index>`. If you want to understand the complete implementation and design rationale for a change, refer to the PEP for a particular new feature; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented.
es: Este artículo no intenta proporcionar una especificación completa de todas las características nuevas, sino que brinda una descripción general conveniente. Para obtener detalles completos, debe consultar la documentación, como :ref:`Library Reference <library-index>` y :ref:`Language Reference <reference-index>`. Si desea comprender la implementación completa y la justificación del diseño de un cambio, consulte el PEP para conocer una característica nueva en particular; pero tenga en cuenta que los PEP generalmente no se mantienen actualizados una vez que una característica se ha implementado por completo.

source: New syntax features:
es: Nuevas características de sintaxis:

source: :ref:`PEP 695 <whatsnew312-pep695>`, type parameter syntax and the :keyword:`type` statement
es: :ref:`PEP 695 <whatsnew312-pep695>`, sintaxis de parámetro de tipo y sentencia :keyword:`type`

source: New grammar features:
es: Nuevas características gramaticales:

source: :ref:`PEP 701 <whatsnew312-pep701>`, :term:`f-strings <f-string>` in the grammar
es: :ref:`PEP 701 <whatsnew312-pep701>`, :term:`f-strings <f-string>` en la gramática

source: Interpreter improvements:
es: Mejoras del intérprete:

source: :ref:`PEP 684 <whatsnew312-pep684>`, a unique per-interpreter :term:`GIL <global interpreter lock>`
es: :ref:`PEP 684 <whatsnew312-pep684>`, un :term:`GIL <global interpreter lock>` único por intérprete

source: :ref:`PEP 669 <whatsnew312-pep669>`, low impact monitoring
es: :ref:`PEP 669 <whatsnew312-pep669>`, monitorización de bajo impacto

source: `Improved 'Did you mean ...' suggestions <improved error messages_>`_ for :exc:`NameError`, :exc:`ImportError`, and :exc:`SyntaxError` exceptions
es: `Improved 'Did you mean ...' suggestions <improved error messages_>`_ para excepciones :exc:`NameError`, :exc:`ImportError` y :exc:`SyntaxError`

source: Python data model improvements:
es: Mejoras en el modelo de datos de Python:

source: :ref:`PEP 688 <whatsnew312-pep688>`, using the :ref:`buffer protocol <bufferobjects>` from Python
es: :ref:`PEP 688 <whatsnew312-pep688>`, usando :ref:`buffer protocol <bufferobjects>` de Python

source: Significant improvements in the standard library:
es: Mejoras significativas en la biblioteca estándar:

source: The :class:`pathlib.Path` class now supports subclassing
es: La clase :class:`pathlib.Path` ahora admite subclases

source: The :mod:`os` module received several improvements for Windows support
es: El módulo :mod:`os` recibió varias mejoras para el soporte de Windows

source: A :ref:`command-line interface <sqlite3-cli>` has been added to the :mod:`sqlite3` module
es: Se ha agregado un :ref:`command-line interface <sqlite3-cli>` al módulo :mod:`sqlite3`

source: :func:`isinstance` checks against :func:`runtime-checkable protocols <typing.runtime_checkable>` enjoy a speed up of between two and 20 times
es: Los controles :func:`isinstance` frente a :func:`runtime-checkable protocols <typing.runtime_checkable>` benefician de una aceleración de entre dos y 20 veces

source: The :mod:`asyncio` package has had a number of performance improvements, with some benchmarks showing a 75% speed up.
es: El paquete :mod:`asyncio` ha tenido una serie de mejoras de rendimiento, y algunos puntos de referencia muestran una aceleración del 75 %.

source: A :ref:`command-line interface <uuid-cli>` has been added to the :mod:`uuid` module
es: Se ha agregado un :ref:`command-line interface <uuid-cli>` al módulo :mod:`uuid`

source: Due to the changes in :ref:`PEP 701 <whatsnew312-pep701>`, producing tokens via the :mod:`tokenize` module is up to up to 64% faster.
es: Debido a los cambios en :ref:`PEP 701 <whatsnew312-pep701>`, la producción de tokens a través del módulo :mod:`tokenize` es hasta un 64% más rápida.

source: Security improvements:
es: Mejoras de seguridad:

source: Replace the builtin :mod:`hashlib` implementations of SHA1, SHA3, SHA2-384, SHA2-512, and MD5 with formally verified code from the `HACL* <https://github.com/hacl-star/hacl-star/>`__ project. These builtin implementations remain as fallbacks that are only used when OpenSSL does not provide them.
es: Reemplaza las implementaciones :mod:`hashlib` integradas de SHA1, SHA3, SHA2-384, SHA2-512 y MD5 con código verificado formalmente del proyecto `HACL* <https://github.com/hacl-star/hacl-star/>`__. Estas implementaciones integradas permanecen como alternativas que solo se utilizan cuando OpenSSL no las proporciona.

source: C API improvements:
es: Mejoras de la API C:

source: :ref:`PEP 697 <whatsnew312-pep697>`, unstable C API tier
es: :ref:`PEP 697 <whatsnew312-pep697>`, nivel de API C inestable

source: :ref:`PEP 683 <whatsnew312-pep683>`, immortal objects
es: :ref:`PEP 683 <whatsnew312-pep683>`, objetos inmortales

source: CPython implementation improvements:
es: Mejoras en la implementación de CPython:

source: :ref:`PEP 709 <whatsnew312-pep709>`, comprehension inlining
es: :ref:`PEP 709 <whatsnew312-pep709>`, comprensión en línea

source: :ref:`CPython support <perf_profiling>` for the Linux ``perf`` profiler
es: :ref:`CPython support <perf_profiling>` para el perfilador Linux ``perf``

source: Implement stack overflow protection on supported platforms
es: Implementar protección contra desbordamiento de pila en plataformas compatibles

source: New typing features:
es: Nuevas funciones de tipado:

source: :ref:`PEP 692 <whatsnew312-pep692>`, using :class:`~typing.TypedDict` to annotate :term:`**kwargs <argument>`
es: :ref:`PEP 692 <whatsnew312-pep692>`, usando :class:`~typing.TypedDict` para anotar :term:`**kwargs <argument>`

source: :ref:`PEP 698 <whatsnew312-pep698>`, :func:`typing.override` decorator
es: :ref:`PEP 698 <whatsnew312-pep698>`, decorador :func:`typing.override`

source: Important deprecations, removals or restrictions:
es: Depreciaciones, eliminaciones o restricciones importantes:

source: :pep:`623`: Remove ``wstr`` from Unicode objects in Python's C API, reducing the size of every :class:`str` object by at least 8 bytes.
es: :pep:`623`: elimina ``wstr`` de los objetos Unicode en la API C de Python, reduciendo el tamaño de cada objeto :class:`str` en al menos 8 bytes.

source: :pep:`632`: Remove the :mod:`!distutils` package. See `the migration guide <https://peps.python.org/pep-0632/#migration-advice>`_ for advice replacing the APIs it provided. The third-party `Setuptools <https://setuptools.pypa.io/en/latest/deprecated/distutils-legacy.html>`__ package continues to provide :mod:`!distutils`, if you still require it in Python 3.12 and beyond.
es: :pep:`632`: elimina el paquete :mod:`!distutils`. Consulte `the migration guide <https://peps.python.org/pep-0632/#migration-advice>`_ para obtener consejos sobre cómo reemplazar las API que proporcionaba. El paquete `Setuptools <https://setuptools.pypa.io/en/latest/deprecated/distutils-legacy.html>`__ de terceros continúa proporcionando :mod:`!distutils`, si aún lo necesita en Python 3.12 y versiones posteriores.

source: :gh:`95299`: Do not pre-install ``setuptools`` in virtual environments created with :mod:`venv`. This means that ``distutils``, ``setuptools``, ``pkg_resources``, and ``easy_install`` will no longer available by default; to access these run ``pip install setuptools`` in the :ref:`activated <venv-explanation>` virtual environment.
es: :gh:`95299`: No preinstala ``setuptools`` en entornos virtuales creados con :mod:`venv`. Esto significa que ``distutils``, ``setuptools``, ``pkg_resources`` y ``easy_install`` ya no estarán disponibles de forma predeterminada; para acceder a ellos, ejecute ``pip install setuptools`` en el entorno virtual :ref:`activated <venv-explanation>`.

source: The :mod:`!asynchat`, :mod:`!asyncore`, and :mod:`!imp` modules have been removed, along with several :class:`unittest.TestCase` `method aliases <unittest-TestCase-removed-aliases_>`_.
es: Se han eliminado los módulos :mod:`!asynchat`, :mod:`!asyncore` y :mod:`!imp`, junto con varios :class:`unittest.TestCase` `method aliases <unittest-TestCase-removed-aliases_>`_.

source: New Features
es: Nuevas características

source: PEP 695: Type Parameter Syntax
es: PEP 695: Sintaxis de parámetro de tipo

source: Generic classes and functions under :pep:`484` were declared using a verbose syntax that left the scope of type parameters unclear and required explicit declarations of variance.
es: Las clases y funciones genéricas en :pep:`484` se declararon utilizando una sintaxis detallada que dejaba el alcance de los parámetros de tipo poco claro y requería declaraciones explícitas de variación.

source: :pep:`695` introduces a new, more compact and explicit way to create :ref:`generic classes <generic-classes>` and :ref:`functions <generic-functions>`::
es: :pep:`695` presenta una forma nueva, más compacta y explícita de crear :ref:`generic classes <generic-classes>` y :ref:`functions <generic-functions>`:

source: In addition, the PEP introduces a new way to declare :ref:`type aliases <type-aliases>` using the :keyword:`type` statement, which creates an instance of :class:`~typing.TypeAliasType`::
es: Además, el PEP introduce una nueva forma de declarar :ref:`type aliases <type-aliases>` utilizando la declaración :keyword:`type`, que crea una instancia de :class:`~typing.TypeAliasType`:

source: Type aliases can also be :ref:`generic <generic-type-aliases>`::
es: Los alias de tipo también pueden ser :ref:`generic <generic-type-aliases>`::

source: The new syntax allows declaring :class:`~typing.TypeVarTuple` and :class:`~typing.ParamSpec` parameters, as well as :class:`~typing.TypeVar` parameters with bounds or constraints::
es: La nueva sintaxis permite declarar los parámetros :class:`~typing.TypeVarTuple` y :class:`~typing.ParamSpec`, así como los parámetros :class:`~typing.TypeVar` con límites o restricciones::

source: The value of type aliases and the bound and constraints of type variables created through this syntax are evaluated only on demand (see :ref:`lazy evaluation <lazy-evaluation>`). This means type aliases are able to refer to other types defined later in the file.
es: El valor de los alias de tipo y los límites y restricciones de las variables de tipo creadas mediante esta sintaxis se evalúan solo según demanda (consulte :ref:`lazy evaluation <lazy-evaluation>`). Esto significa que los alias de tipo pueden hacer referencia a otros tipos definidos más adelante en el archivo.

source: Type parameters declared through a type parameter list are visible within the scope of the declaration and any nested scopes, but not in the outer scope. For example, they can be used in the type annotations for the methods of a generic class or in the class body. However, they cannot be used in the module scope after the class is defined. See :ref:`type-params` for a detailed description of the runtime semantics of type parameters.
es: Los parámetros de tipo declarados a través de una lista de parámetros de tipo son visibles dentro del alcance de la declaración y de cualquier alcance anidado, pero no en el alcance externo. Por ejemplo, se pueden utilizar en las anotaciones de tipo de los métodos de una clase genérica o en el cuerpo de la clase. Sin embargo, no se pueden utilizar en el alcance del módulo una vez definida la clase. Consulte :ref:`type-params` para obtener una descripción detallada de la semántica de tiempo de ejecución de los parámetros de tipo.

source: In order to support these scoping semantics, a new kind of scope is introduced, the :ref:`annotation scope <annotation-scopes>`. Annotation scopes behave for the most part like function scopes, but interact differently with enclosing class scopes. In Python 3.13, :term:`annotations <annotation>` will also be evaluated in annotation scopes.
es: Para respaldar esta semántica de alcance, se introduce un nuevo tipo de alcance, el :ref:`annotation scope <annotation-scopes>`. Los ámbitos de anotación se comportan en su mayor parte como ámbitos de función, pero interactúan de manera diferente con los ámbitos de clase adjuntos. En Python 3.13, :term:`annotations <annotation>` también se evaluará en ámbitos de anotación.

source: See :pep:`695` for more details.
es: Consulte :pep:`695` para obtener más detalles.

source: (PEP written by Eric Traut. Implementation by Jelle Zijlstra, Eric Traut, and others in :gh:`103764`.)
es: (PEP escrito por Eric Traut. Implementación por Jelle Zijlstra, Eric Traut y otros en :gh:`103764`.)

source: PEP 701: Syntactic formalization of f-strings
es: PEP 701: Formalización sintáctica de cadenas f

source: :pep:`701` lifts some restrictions on the usage of :term:`f-strings <f-string>`. Expression components inside f-strings can now be any valid Python expression, including strings reusing the same quote as the containing f-string, multi-line expressions, comments, backslashes, and unicode escape sequences. Let's cover these in detail:
es: :pep:`701` elimina algunas restricciones sobre el uso de :term:`f-strings <f-string>`. Los componentes de expresión dentro de cadenas f ahora pueden ser cualquier expresión Python válida, incluidas cadenas que reutilizan la misma comilla que la cadena f que las contiene, expresiones de varias líneas, comentarios, barras invertidas y secuencias de escape Unicode. Cubramos estos en detalle:

source: Quote reuse: in Python 3.11, reusing the same quotes as the enclosing f-string raises a :exc:`SyntaxError`, forcing the user to either use other available quotes (like using double quotes or triple quotes if the f-string uses single quotes). In Python 3.12, you can now do things like this:
es: Reutilización de comillas: en Python 3.11, reutilizar las mismas comillas que la cadena f adjunta genera un :exc:`SyntaxError`, lo que obliga al usuario a usar otras comillas disponibles (como usar comillas dobles o triples si la cadena f usa comillas simples). En Python 3.12, ahora puedes hacer cosas como esta:

source: Note that before this change there was no explicit limit in how f-strings can be nested, but the fact that string quotes cannot be reused inside the expression component of f-strings made it impossible to nest f-strings arbitrarily. In fact, this is the most nested f-string that could be written:
es: Tenga en cuenta que antes de este cambio no había un límite explícito en cómo se pueden anidar las cadenas f, pero el hecho de que las comillas de cadena no se pueden reutilizar dentro del componente de expresión de las cadenas f hacía imposible anidar cadenas f arbitrariamente. De hecho, esta es la cadena f más anidada que podría escribirse:

source: As now f-strings can contain any valid Python expression inside expression components, it is now possible to nest f-strings arbitrarily:
es: Como ahora las cadenas f pueden contener cualquier expresión Python válida dentro de los componentes de expresión, ahora es posible anidar cadenas f de forma arbitraria:

source: Multi-line expressions and comments: In Python 3.11, f-string expressions must be defined in a single line, even if the expression within the f-string could normally span multiple lines (like literal lists being defined over multiple lines), making them harder to read. In Python 3.12 you can now define f-strings spanning multiple lines, and add inline comments:
es: Expresiones y comentarios de varias líneas: en Python 3.11, las expresiones de cadena f deben definirse en una sola línea, incluso si la expresión dentro de la cadena f normalmente podría abarcar varias líneas (como listas literales que se definen en varias líneas), lo que las hace más difícil de leer. En Python 3.12 ahora puedes definir cadenas f que abarquen varias líneas y agregar comentarios en línea:

source: Backslashes and unicode characters: before Python 3.12 f-string expressions couldn't contain any ``\`` character. This also affected unicode :ref:`escape sequences <escape-sequences>` (such as ``\N{snowman}``) as these contain the ``\N`` part that previously could not be part of expression components of f-strings. Now, you can define expressions like this:
es: Barras invertidas y caracteres Unicode: antes de Python 3.12, las expresiones de cadena f no podían contener ningún carácter ``\``. Esto también afectó a Unicode :ref:`escape sequences <escape-sequences>` (como ``\N{snowman}``), ya que contienen la parte ``\N`` que anteriormente no podía ser parte de los componentes de expresión de f-strings. Ahora puedes definir expresiones como esta:

source: See :pep:`701` for more details.
es: Consulte :pep:`701` para obtener más detalles.

source: As a positive side-effect of how this feature has been implemented (by parsing f-strings with :pep:`the PEG parser <617>`, now error messages for f-strings are more precise and include the exact location of the error. For example, in Python 3.11, the following f-string raises a :exc:`SyntaxError`:
es: Como efecto secundario positivo de cómo se implementó esta característica (al analizar cadenas f con :pep:`the PEG parser <617>`, ahora los mensajes de error para cadenas f son más precisos e incluyen la ubicación exacta del error. Por ejemplo, en Python 3.11, lo siguiente f-string genera un :exc:`SyntaxError`:

source: but the error message doesn't include the exact location of the error within the line and also has the expression artificially surrounded by parentheses. In Python 3.12, as f-strings are parsed with the PEG parser, error messages can be more precise and show the entire line:
es: pero el mensaje de error no incluye la ubicación exacta del error dentro de la línea y también tiene la expresión artificialmente entre paréntesis. En Python 3.12, a medida que las cadenas f se analizan con el analizador PEG, los mensajes de error pueden ser más precisos y mostrar la línea completa:

source: (Contributed by Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou, Cristián Maureira-Fredes and Marta Gómez in :gh:`102856`. PEP written by Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou and Marta Gómez).
es: (Aportado por Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou, Cristián Maureira-Fredes y Marta Gómez en :gh:`102856`. PEP escrito por Pablo Galindo, Batuhan Taskaya, Lysandros Nikolaou y Marta Gómez).

source: PEP 684: A Per-Interpreter GIL
es: PEP 684: un GIL por intérprete

source: :pep:`684` introduces a per-interpreter :term:`GIL <global interpreter lock>`, so that sub-interpreters may now be created with a unique GIL per interpreter. This allows Python programs to take full advantage of multiple CPU cores. This is currently only available through the C-API, though a Python API is :pep:`anticipated for 3.13 <554>`.
es: :pep:`684` introduce un :term:`GIL <global interpreter lock>` por intérprete, de modo que ahora se pueden crear subintérpretes con un GIL único por intérprete. Esto permite que los programas Python aprovechen al máximo múltiples núcleos de CPU. Actualmente, esto solo está disponible a través de C-API, aunque una API de Python es :pep:`anticipada para 3.13 <554>`.

source: Use the new :c:func:`Py_NewInterpreterFromConfig` function to create an interpreter with its own GIL::
es: Utilice la nueva función :c:func:`Py_NewInterpreterFromConfig` para crear un intérprete con su propio GIL::

source: For further examples how to use the C-API for sub-interpreters with a per-interpreter GIL, see :source:`Modules/_xxsubinterpretersmodule.c`.
es: Para obtener más ejemplos de cómo utilizar C-API para subintérpretes con un GIL por intérprete, consulte :source:`Modules/_xxsubinterpretersmodule.c`.

source: (Contributed by Eric Snow in :gh:`104210`, etc.)
es: (Aportado por Eric Snow en :gh:`104210`, etc.)

source: PEP 669: Low impact monitoring for CPython
es: PEP 669: Monitoreo de bajo impacto para CPython

source: :pep:`669` defines a new :mod:`API <sys.monitoring>` for profilers, debuggers, and other tools to monitor events in CPython. It covers a wide range of events, including calls, returns, lines, exceptions, jumps, and more. This means that you only pay for what you use, providing support for near-zero overhead debuggers and coverage tools. See :mod:`sys.monitoring` for details.
es: :pep:`669` define un nuevo :mod:`API <sys.monitoring>` para perfiladores, depuradores y otras herramientas para monitorear eventos en CPython. Cubre una amplia gama de eventos, incluidas llamadas, devoluciones, líneas, excepciones, saltos y más. Esto significa que solo paga por lo que usa, brindando soporte para depuradores generales y herramientas de cobertura casi nulos. Consulte :mod:`sys.monitoring` para obtener más detalles.

source: (Contributed by Mark Shannon in :gh:`103082`.)
es: (Aportado por Mark Shannon en :gh:`103082`.)

source: PEP 688: Making the buffer protocol accessible in Python
es: PEP 688: Hacer accesible el protocolo de búfer en Python
