Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: :pep:`683`: Introduce *Immortal Objects*, which allows objects to bypass reference counts, and related changes to the C-API:
es: :pep:`683`: presente *Immortal Objects*, que permite que los objetos omitan los recuentos de referencias y los cambios relacionados en C-API:

source: ``_Py_IMMORTAL_REFCNT``: The reference count that defines an object
es: ``_Py_IMMORTAL_REFCNT``: el recuento de referencias que define un objeto

source: as immortal.
es: como inmortal.

source: ``_Py_IsImmortal`` Checks if an object has the immortal reference count.
es: ``_Py_IsImmortal`` Comprueba si un objeto tiene el recuento de referencia inmortal.

source: ``PyObject_HEAD_INIT`` This will now initialize reference count to
es: ``PyObject_HEAD_INIT`` Esto ahora inicializará el recuento de referencias

source: ``_Py_IMMORTAL_REFCNT`` when used with ``Py_BUILD_CORE``.
es: ``_Py_IMMORTAL_REFCNT`` cuando se utiliza con ``Py_BUILD_CORE``.

source: ``SSTATE_INTERNED_IMMORTAL`` An identifier for interned unicode objects
es: ``SSTATE_INTERNED_IMMORTAL`` Un identificador para objetos Unicode internos

source: that are immortal.
es: que son inmortales.

source: ``SSTATE_INTERNED_IMMORTAL_STATIC`` An identifier for interned unicode
es: ``SSTATE_INTERNED_IMMORTAL_STATIC`` Un identificador para Unicode interno

source: objects that are immortal and static
es: Objetos inmortales y estáticos.

source: ``sys.getunicodeinternedsize`` This returns the total number of unicode
es: ``sys.getunicodeinternedsize`` Esto devuelve el número total de Unicode

source: objects that have been interned. This is now needed for :file:`refleak.py` to correctly track reference counts and allocated blocks
es: objetos que han sido internados. Esto ahora es necesario para que :file:`refleak.py` rastree correctamente los recuentos de referencia y los bloques asignados.

source: (Contributed by Eddie Elizondo in :gh:`84436`.)
es: (Contribuido por Eddie Elizondo en :gh:`84436`.)

source: :pep:`684`: Add the new :c:func:`Py_NewInterpreterFromConfig` function and :c:type:`PyInterpreterConfig`, which may be used to create sub-interpreters with their own GILs. (See :ref:`whatsnew312-pep684` for more info.) (Contributed by Eric Snow in :gh:`104110`.)
es: :pep:`684`: agregue la nueva función :c:func:`Py_NewInterpreterFromConfig` y :c:type:`PyInterpreterConfig`, que pueden usarse para crear subintérpretes con sus propios GIL. (Consulte :ref:`whatsnew312-pep684` para obtener más información). (Contribución de Eric Snow en :gh:`104110`.)

source: In the limited C API version 3.12, :c:func:`Py_INCREF` and :c:func:`Py_DECREF` functions are now implemented as opaque function calls to hide implementation details. (Contributed by Victor Stinner in :gh:`105387`.)
es: En la versión limitada de C API 3.12, las funciones :c:func:`Py_INCREF` y :c:func:`Py_DECREF` ahora se implementan como llamadas de función opacas para ocultar los detalles de implementación. (Aportado por Victor Stinner en :gh:`105387`.)

source: Legacy Unicode APIs based on ``Py_UNICODE*`` representation has been removed. Please migrate to APIs based on UTF-8 or ``wchar_t*``.
es: Se han eliminado las API Unicode heredadas basadas en la representación ``Py_UNICODE*``. Migre a API basadas en UTF-8 o ``wchar_t*``.

source: Argument parsing functions like :c:func:`PyArg_ParseTuple` doesn't support ``Py_UNICODE*`` based format (e.g. ``u``, ``Z``) anymore. Please migrate to other formats for Unicode like ``s``, ``z``, ``es``, and ``U``.
es: Las funciones de análisis de argumentos como :c:func:`PyArg_ParseTuple` ya no admiten el formato basado en ``Py_UNICODE*`` (por ejemplo, ``u``, ``Z``). Migre a otros formatos para Unicode como ``s``, ``z``, ``es`` y ``U``.

source: ``tp_weaklist`` for all static builtin types is always ``NULL``. This is an internal-only field on ``PyTypeObject`` but we're pointing out the change in case someone happens to be accessing the field directly anyway. To avoid breakage, consider using the existing public C-API instead, or, if necessary, the (internal-only) ``_PyObject_GET_WEAKREFS_LISTPTR()`` macro.
es: ``tp_weaklist`` para todos los tipos integrados estáticos siempre es ``NULL``. Este es un campo solo interno en ``PyTypeObject``, pero señalamos el cambio en caso de que alguien acceda al campo directamente de todos modos. Para evitar roturas, considere utilizar la C-API pública existente o, si es necesario, la macro ``_PyObject_GET_WEAKREFS_LISTPTR()`` (solo interna).

source: This internal-only :c:member:`PyTypeObject.tp_subclasses` may now not be a valid object pointer. Its type was changed to :c:expr:`void *` to reflect this. We mention this in case someone happens to be accessing the internal-only field directly.
es: Es posible que este :c:member:`PyTypeObject.tp_subclasses` solo interno ya no sea un puntero de objeto válido. Su tipo se cambió a :c:expr:`void *` para reflejar esto. Mencionamos esto en caso de que alguien acceda directamente al campo interno.

source: To get a list of subclasses, call the Python method :py:meth:`~class.__subclasses__` (using :c:func:`PyObject_CallMethod`, for example).
es: Para obtener una lista de subclases, llame al método Python :py:meth:`~class.__subclasses__` (usando :c:func:`PyObject_CallMethod`, por ejemplo).

source: Add support of more formatting options (left aligning, octals, uppercase hexadecimals, :c:type:`intmax_t`, :c:type:`ptrdiff_t`, :c:type:`wchar_t` C strings, variable width and precision) in :c:func:`PyUnicode_FromFormat` and :c:func:`PyUnicode_FromFormatV`. (Contributed by Serhiy Storchaka in :gh:`98836`.)
es: Agregado soporte para más opciones de formato (alineación a la izquierda, octales, hexadecimales en mayúsculas, cadenas :c:type:`intmax_t`, :c:type:`ptrdiff_t`, :c:type:`wchar_t` C, ancho variable y precisión) en :c:func:`PyUnicode_FromFormat` y :c:func:`PyUnicode_FromFormatV`. (Aportado por Serhiy Storchaka en :gh:`98836`.)

source: An unrecognized format character in :c:func:`PyUnicode_FromFormat` and :c:func:`PyUnicode_FromFormatV` now sets a :exc:`SystemError`. In previous versions it caused all the rest of the format string to be copied as-is to the result string, and any extra arguments discarded. (Contributed by Serhiy Storchaka in :gh:`95781`.)
es: Un carácter de formato no reconocido en :c:func:`PyUnicode_FromFormat` y :c:func:`PyUnicode_FromFormatV` ahora establece un :exc:`SystemError`. En versiones anteriores, provocaba que el resto de la cadena de formato se copiara tal cual en la cadena de resultado y se descartaran los argumentos adicionales. (Aportado por Serhiy Storchaka en :gh:`95781`.)

source: Fix wrong sign placement in :c:func:`PyUnicode_FromFormat` and :c:func:`PyUnicode_FromFormatV`. (Contributed by Philip Georgi in :gh:`95504`.)
es: Se corrigió la ubicación incorrecta de los letreros en :c:func:`PyUnicode_FromFormat` y :c:func:`PyUnicode_FromFormatV`. (Aportado por Philip Georgi en :gh:`95504`.)

source: Extension classes wanting to add a ``__dict__`` or weak reference slot should use :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead of ``tp_dictoffset`` and ``tp_weaklistoffset``, respectively. The use of ``tp_dictoffset`` and ``tp_weaklistoffset`` is still supported, but does not fully support multiple inheritance (:gh:`95589`), and performance may be worse. Classes declaring :c:macro:`Py_TPFLAGS_MANAGED_DICT` should call :c:func:`!_PyObject_VisitManagedDict` and :c:func:`!_PyObject_ClearManagedDict` to traverse and clear their instance's dictionaries. To clear weakrefs, call :c:func:`PyObject_ClearWeakRefs`, as before.
es: Las clases de extensión que deseen agregar un ``__dict__`` o una ranura de referencia débil deben usar :c:macro:`Py_TPFLAGS_MANAGED_DICT` y :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` en lugar de ``tp_dictoffset`` y ``tp_weaklistoffset``, respectivamente. El uso de ``tp_dictoffset`` y ``tp_weaklistoffset`` aún se admite, pero no es totalmente compatible con la herencia múltiple (:gh:`95589`) y el rendimiento puede ser peor. Las clases que declaran :c:macro:`Py_TPFLAGS_MANAGED_DICT` deben llamar a :c:func:`!_PyObject_VisitManagedDict` y :c:func:`!_PyObject_ClearManagedDict` para recorrer y borrar los diccionarios de su instancia. Para borrar referencias débiles, llame a :c:func:`PyObject_ClearWeakRefs`, como antes.

source: The :c:func:`PyUnicode_FSDecoder` function no longer accepts bytes-like paths, like :class:`bytearray` and :class:`memoryview` types: only the exact :class:`bytes` type is accepted for bytes strings. (Contributed by Victor Stinner in :gh:`98393`.)
es: La función :c:func:`PyUnicode_FSDecoder` ya no acepta rutas de tipo bytes, como los tipos :class:`bytearray` y :class:`memoryview`: solo se acepta el tipo :class:`bytes` exacto para cadenas de bytes. (Aportado por Victor Stinner en :gh:`98393`.)

source: The :c:macro:`Py_CLEAR`, :c:macro:`Py_SETREF` and :c:macro:`Py_XSETREF` macros now only evaluate their arguments once. If an argument has side effects, these side effects are no longer duplicated. (Contributed by Victor Stinner in :gh:`98724`.)
es: Las macros :c:macro:`Py_CLEAR`, :c:macro:`Py_SETREF` y :c:macro:`Py_XSETREF` ahora solo evalúan sus argumentos una vez. Si un argumento tiene efectos secundarios, estos efectos secundarios ya no se duplican. (Aportado por Victor Stinner en :gh:`98724`.)

source: The interpreter's error indicator is now always normalized. This means that :c:func:`PyErr_SetObject`, :c:func:`PyErr_SetString` and the other functions that set the error indicator now normalize the exception before storing it. (Contributed by Mark Shannon in :gh:`101578`.)
es: El indicador de error del intérprete ahora siempre está normalizado. Esto significa que :c:func:`PyErr_SetObject`, :c:func:`PyErr_SetString` y las otras funciones que configuran el indicador de error ahora normalizan la excepción antes de almacenarla. (Aportado por Mark Shannon en :gh:`101578`.)

source: ``_Py_RefTotal`` is no longer authoritative and only kept around for ABI compatibility. Note that it is an internal global and only available on debug builds. If you happen to be using it then you'll need to start using ``_Py_GetGlobalRefTotal()``.
es: ``_Py_RefTotal`` ya no tiene autoridad y solo se conserva por compatibilidad con ABI. Tenga en cuenta que es un global interno y solo está disponible en compilaciones de depuración. Si lo está utilizando, deberá comenzar a utilizar ``_Py_GetGlobalRefTotal()``.

source: The following functions now select an appropriate metaclass for the newly created type:
es: Las siguientes funciones ahora seleccionan una metaclase apropiada para el tipo recién creado:

source: Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated, and in Python 3.14+ it will be disallowed. Note that these functions ignore ``tp_new`` of the metaclass, possibly allowing incomplete initialization.
es: La creación de clases cuya metaclase anule :c:member:`~PyTypeObject.tp_new` está en desuso y en Python 3.14+ no estará permitida. Tenga en cuenta que estas funciones ignoran ``tp_new`` de la metaclase, lo que posiblemente permita una inicialización incompleta.

source: Note that :c:func:`PyType_FromMetaclass` (added in Python 3.12) already disallows creating classes whose metaclass overrides ``tp_new`` (:meth:`~object.__new__` in Python).
es: Tenga en cuenta que :c:func:`PyType_FromMetaclass` (agregado en Python 3.12) ya no permite la creación de clases cuya metaclase anule ``tp_new`` (:meth:`~object.__new__` en Python).

source: Since ``tp_new`` overrides almost everything ``PyType_From*`` functions do, the two are incompatible with each other. The existing behavior -- ignoring the metaclass for several steps of type creation -- is unsafe in general, since (meta)classes assume that ``tp_new`` was called. There is no simple general workaround. One of the following may work for you:
es: Dado que ``tp_new`` anula casi todo lo que hacen las funciones ``PyType_From*``, las dos son incompatibles entre sí. El comportamiento existente (ignorar la metaclase durante varios pasos de la creación de tipos) no es seguro en general, ya que las (meta)clases suponen que se llamó a ``tp_new``. No existe una solución general sencilla. Uno de los siguientes puede funcionar para usted:

source: If you control the metaclass, avoid using ``tp_new`` in it:
es: Si controlas la metaclase, evita usar ``tp_new`` en ella:

source: If initialization can be skipped, it can be done in :c:member:`~PyTypeObject.tp_init` instead.
es: Si se puede omitir la inicialización, se puede realizar en :c:member:`~PyTypeObject.tp_init`.

source: If the metaclass doesn't need to be instantiated from Python, set its ``tp_new`` to ``NULL`` using the :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag. This makes it acceptable for ``PyType_From*`` functions.
es: Si no es necesario crear una instancia de la metaclase desde Python, configure su ``tp_new`` en ``NULL`` usando el indicador :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`. Esto lo hace aceptable para funciones ``PyType_From*``.

source: Avoid ``PyType_From*`` functions: if you don't need C-specific features (slots or setting the instance size), create types by :ref:`calling <call>` the metaclass.
es: Evite las funciones ``PyType_From*``: si no necesita funciones específicas de C (ranuras o configuración del tamaño de la instancia), cree tipos mediante la metaclase :ref:`calling <call>`.

source: If you *know* the ``tp_new`` can be skipped safely, filter the deprecation warning out using :func:`warnings.catch_warnings` from Python.
es: Si *know* puede omitir ``tp_new`` de forma segura, filtre la advertencia de obsolescencia usando :func:`warnings.catch_warnings` de Python.

source: :c:var:`PyOS_InputHook` and :c:var:`PyOS_ReadlineFunctionPointer` are no longer called in :ref:`subinterpreters <sub-interpreter-support>`. This is because clients generally rely on process-wide global state (since these callbacks have no way of recovering extension module state).
es: :c:var:`PyOS_InputHook` y :c:var:`PyOS_ReadlineFunctionPointer` ya no se llaman en :ref:`subinterpreters <sub-interpreter-support>`. Esto se debe a que los clientes generalmente dependen del estado global de todo el proceso (ya que estas devoluciones de llamada no tienen forma de recuperar el estado del módulo de extensión).

source: This also avoids situations where extensions may find themselves running in a subinterpreter that they don't support (or haven't yet been loaded in). See :gh:`104668` for more info.
es: Esto también evita situaciones en las que las extensiones pueden encontrarse ejecutándose en un subintérprete que no admiten (o que aún no se han cargado). Consulte :gh:`104668` para obtener más información.

source: :c:struct:`PyLongObject` has had its internals changed for better performance. Although the internals of :c:struct:`PyLongObject` are private, they are used by some extension modules. The internal fields should no longer be accessed directly, instead the API functions beginning ``PyLong_...`` should be used instead. Two new *unstable* API functions are provided for efficient access to the value of :c:struct:`PyLongObject`\s which fit into a single machine word:
es: :c:struct:`PyLongObject` ha tenido cambios internos para un mejor rendimiento. Aunque las partes internas de :c:struct:`PyLongObject` son privadas, algunos módulos de extensión las utilizan. Ya no se debe acceder directamente a los campos internos, sino que se deben utilizar las funciones API que comienzan con ``PyLong_...``. Se proporcionan dos nuevas funciones API *unstable* para un acceso eficiente al valor de :c:struct:`PyLongObject`\s que cabe en una sola palabra de máquina:

source: Custom allocators, set via :c:func:`PyMem_SetAllocator`, are now required to be thread-safe, regardless of memory domain. Allocators that don't have their own state, including "hooks", are not affected. If your custom allocator is not already thread-safe and you need guidance then please create a new GitHub issue and CC ``@ericsnowcurrently``.
es: Ahora se requiere que los asignadores personalizados, configurados a través de :c:func:`PyMem_SetAllocator`, sean seguros para subprocesos, independientemente del dominio de memoria. Los asignadores que no tienen su propio estado, incluidos los "ganchos", no se ven afectados. Si su asignador personalizado aún no es seguro para subprocesos y necesita orientación, cree una nueva incidencia en GitHub y CC ``@ericsnowcurrently``.

source: In accordance with :pep:`699`, the ``ma_version_tag`` field in :c:type:`PyDictObject` is deprecated for extension modules. Accessing this field will generate a compiler warning at compile time. This field will be removed in Python 3.14. (Contributed by Ramvikrams and Kumar Aditya in :gh:`101193`. PEP by Ken Jin.)
es: De acuerdo con :pep:`699`, el campo ``ma_version_tag`` en :c:type:`PyDictObject` está obsoleto para los módulos de extensión. Acceder a este campo generará una advertencia del compilador en el momento de la compilación. Este campo se eliminará en Python 3.14. (Contribución de Ramvikrams y Kumar Aditya en :gh:`101193`. PEP de Ken Jin.)

source: Deprecate global configuration variable:
es: Variable de configuración global obsoleta:

source: :c:var:`Py_HashRandomizationFlag`: use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed`
es: :c:var:`Py_HashRandomizationFlag`: use :c:member:`PyConfig.use_hash_seed` y :c:member:`PyConfig.hash_seed`

source: :c:var:`!Py_UTF8Mode`: use :c:member:`PyPreConfig.utf8_mode` (see :c:func:`Py_PreInitialize`)
es: :c:var:`!Py_UTF8Mode`: use :c:member:`PyPreConfig.utf8_mode` (ver :c:func:`Py_PreInitialize`)

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead. (Contributed by Victor Stinner in :gh:`77782`.)
es: La API :c:func:`Py_InitializeFromConfig` debe usarse con :c:type:`PyConfig` en su lugar. (Aportado por Victor Stinner en :gh:`77782`.)

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases is deprecated and will be disabled in Python 3.14. (:gh:`95388`)
es: La creación de :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` con bases mutables está obsoleta y se deshabilitará en Python 3.14. (:gh:`95388`)

source: The :file:`structmember.h` header is deprecated, though it continues to be available and there are no plans to remove it.
es: El encabezado :file:`structmember.h` está en desuso, aunque sigue estando disponible y no hay planes para eliminarlo.

source: Its contents are now available just by including :file:`Python.h`, with a ``Py`` prefix added if it was missing:
es: Su contenido ahora está disponible simplemente incluyendo :file:`Python.h`, con un prefijo ``Py`` agregado si faltara:

source: :c:struct:`PyMemberDef`, :c:func:`PyMember_GetOne` and :c:func:`PyMember_SetOne`
es: :c:struct:`PyMemberDef`, :c:func:`PyMember_GetOne` y :c:func:`PyMember_SetOne`

source: Type macros like :c:macro:`Py_T_INT`, :c:macro:`Py_T_DOUBLE`, etc. (previously ``T_INT``, ``T_DOUBLE``, etc.)
es: Escriba macros como :c:macro:`Py_T_INT`, :c:macro:`Py_T_DOUBLE`, etc. (anteriormente ``T_INT``, ``T_DOUBLE``, etc.)

source: The flags :c:macro:`Py_READONLY` (previously ``READONLY``) and :c:macro:`Py_AUDIT_READ` (previously all uppercase)
es: Las banderas :c:macro:`Py_READONLY` (anteriormente ``READONLY``) y :c:macro:`Py_AUDIT_READ` (anteriormente todas en mayúsculas)

source: Several items are not exposed from :file:`Python.h`:
es: Varios elementos no están expuestos desde :file:`Python.h`:

source: :c:macro:`T_NONE` (previously undocumented, and pretty quirky)
es: :c:macro:`T_NONE` (anteriormente indocumentado y bastante peculiar)

source: The macro ``WRITE_RESTRICTED`` which does nothing.
es: La macro ``WRITE_RESTRICTED`` que no hace nada.

source: The macros ``RESTRICTED`` and ``READ_RESTRICTED``, equivalents of :c:macro:`Py_AUDIT_READ`.
es: Las macros ``RESTRICTED`` y ``READ_RESTRICTED``, equivalentes a :c:macro:`Py_AUDIT_READ`.

source: In some configurations, ``<stddef.h>`` is not included from :file:`Python.h`. It should be included manually when using ``offsetof()``.
es: En algunas configuraciones, ``<stddef.h>`` no se incluye en :file:`Python.h`. Debe incluirse manualmente cuando se utiliza ``offsetof()``.

source: The deprecated header continues to provide its original contents under the original names. Your old code can stay unchanged, unless the extra include and non-namespaced macros bother you greatly.
es: El encabezado obsoleto continúa proporcionando su contenido original con los nombres originales. Su código antiguo puede permanecer sin cambios, a menos que las macros de inclusión y sin espacio de nombres adicionales le molesten mucho.

source: (Contributed in :gh:`47146` by Petr Viktorin, based on earlier work by Alexander Belopolsky and Matthias Braun.)
es: (Contribuido en :gh:`47146` por Petr Viktorin, basado en trabajos anteriores de Alexander Belopolsky y Matthias Braun.)

source: :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` are deprecated. Use :c:func:`PyErr_GetRaisedException` and :c:func:`PyErr_SetRaisedException` instead. (Contributed by Mark Shannon in :gh:`101578`.)
es: :c:func:`PyErr_Fetch` y :c:func:`PyErr_Restore` están en desuso. Utilice :c:func:`PyErr_GetRaisedException` y :c:func:`PyErr_SetRaisedException` en su lugar. (Aportado por Mark Shannon en :gh:`101578`.)

source: :c:func:`!PyErr_Display` is deprecated. Use :c:func:`PyErr_DisplayException` instead. (Contributed by Irit Katriel in :gh:`102755`).
es: :c:func:`!PyErr_Display` está en desuso. Utilice :c:func:`PyErr_DisplayException` en su lugar. (Aportado por Irit Katriel en :gh:`102755`).

source: ``_PyErr_ChainExceptions`` is deprecated. Use ``_PyErr_ChainExceptions1`` instead. (Contributed by Irit Katriel in :gh:`102192`.)
es: ``_PyErr_ChainExceptions`` está en desuso. Utilice ``_PyErr_ChainExceptions1`` en su lugar. (Aportado por Irit Katriel en :gh:`102192`.)

source: Using :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases` or :c:func:`PyType_FromModuleAndSpec` to create a class whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated. Call the metaclass instead.
es: El uso de :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases` o :c:func:`PyType_FromModuleAndSpec` para crear una clase cuya metaclase anula :c:member:`~PyTypeObject.tp_new` está en desuso. En su lugar, llame a la metaclase.

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
es: El campo ``ma_version_tag`` en :c:type:`PyDictObject` para módulos de extensión (:pep:`699`; :gh:`101193`).

source: Global configuration variables:
es: Variables de configuración globales:

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
es: La API :c:func:`Py_InitializeFromConfig` debe usarse con :c:type:`PyConfig` en su lugar.

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
es: Creando :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` con bases mutables (:gh:`95388`).

source: Pending Removal in Python 3.15
es: Eliminación pendiente en Python 3.15

source: :c:func:`PyImport_ImportModuleNoBlock`: use :c:func:`PyImport_ImportModule`
es: :c:func:`PyImport_ImportModuleNoBlock`: utilizar :c:func:`PyImport_ImportModule`

source: :c:type:`!Py_UNICODE_WIDE` type: use :c:type:`wchar_t`
es: Tipo :c:type:`!Py_UNICODE_WIDE`: use :c:type:`wchar_t`

source: :c:type:`Py_UNICODE` type: use :c:type:`wchar_t`
es: Tipo :c:type:`Py_UNICODE`: use :c:type:`wchar_t`

source: Python initialization functions:
es: Funciones de inicialización de Python:
