Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: :pep:`688` introduces a way to use the :ref:`buffer protocol <bufferobjects>` from Python code. Classes that implement the :meth:`~object.__buffer__` method are now usable as buffer types.
es: :pep:`688` presenta una forma de utilizar :ref:`buffer protocol <bufferobjects>` desde el código Python. Las clases que implementan el método :meth:`~object.__buffer__` ahora se pueden utilizar como tipos de búfer.

source: The new :class:`collections.abc.Buffer` ABC provides a standard way to represent buffer objects, for example in type annotations. The new :class:`inspect.BufferFlags` enum represents the flags that can be used to customize buffer creation. (Contributed by Jelle Zijlstra in :gh:`102500`.)
es: El nuevo :class:`collections.abc.Buffer` ABC proporciona una forma estándar de representar objetos de búfer, por ejemplo en anotaciones de tipo. La nueva enumeración :class:`inspect.BufferFlags` representa los indicadores que se pueden usar para personalizar la creación del búfer. (Aportado por Jelle Zijlstra en :gh:`102500`.)

source: PEP 709: Comprehension inlining
es: PEP 709: Integración de la comprensión

source: Dictionary, list, and set comprehensions are now inlined, rather than creating a new single-use function object for each execution of the comprehension. This speeds up execution of a comprehension by up to two times. See :pep:`709` for further details.
es: Las comprensiones de diccionario, lista y conjunto ahora están integradas, en lugar de crear un nuevo objeto de función de un solo uso para cada ejecución de la comprensión. Esto acelera la ejecución de una comprensión hasta dos veces. Consulte :pep:`709` para obtener más detalles.

source: Comprehension iteration variables remain isolated and don't overwrite a variable of the same name in the outer scope, nor are they visible after the comprehension. Inlining does result in a few visible behavior changes:
es: Las variables de iteración de comprensión permanecen aisladas y no sobrescriben una variable del mismo nombre en el alcance externo, ni son visibles después de la comprensión. La incorporación da como resultado algunos cambios de comportamiento visibles:

source: There is no longer a separate frame for the comprehension in tracebacks, and tracing/profiling no longer shows the comprehension as a function call.
es: Ya no hay un marco separado para la comprensión en los rastreos, y el rastreo/elaboración de perfiles ya no muestra la comprensión como una llamada a función.

source: The :mod:`symtable` module will no longer produce child symbol tables for each comprehension; instead, the comprehension's locals will be included in the parent function's symbol table.
es: El módulo :mod:`symtable` ya no producirá tablas de símbolos secundarios para cada comprensión; en cambio, los locales de comprensión se incluirán en la tabla de símbolos de la función principal.

source: Calling :func:`locals` inside a comprehension now includes variables from outside the comprehension, and no longer includes the synthetic ``.0`` variable for the comprehension "argument".
es: Llamar a :func:`locals` dentro de una comprensión ahora incluye variables externas a la comprensión y ya no incluye la variable sintética ``.0`` para el "argumento" de comprensión.

source: A comprehension iterating directly over ``locals()`` (e.g. ``[k for k in locals()]``) may see "RuntimeError: dictionary changed size during iteration" when run under tracing (e.g. code coverage measurement). This is the same behavior already seen in e.g. ``for k in locals():``. To avoid the error, first create a list of keys to iterate over: ``keys = list(locals()); [k for k in keys]``.
es: Una comprensión que itera directamente sobre ``locals()`` (por ejemplo, ``[k for k in locals()]``) puede ver "RuntimeError: el diccionario cambió de tamaño durante la iteración" cuando se ejecuta bajo seguimiento (por ejemplo, medición de cobertura de código). Este es el mismo comportamiento que ya se ha visto, por ejemplo, en ``for k in locals():``. Para evitar el error, primero cree una lista de claves para iterar: ``keys = list(locals()); [k for k in keys]``.

source: (Contributed by Carl Meyer and Vladimir Matveev in :pep:`709`.)
es: (Aportado por Carl Meyer y Vladimir Matveev en :pep:`709`.)

source: Improved Error Messages
es: Mensajes de error mejorados

source: Modules from the standard library are now potentially suggested as part of the error messages displayed by the interpreter when a :exc:`NameError` is raised to the top level. (Contributed by Pablo Galindo in :gh:`98254`.)
es: Ahora se sugieren potencialmente módulos de la biblioteca estándar como parte de los mensajes de error que muestra el intérprete cuando un :exc:`NameError` se eleva al nivel superior. (Aportado por Pablo Galindo en :gh:`98254`.)

source: Improve the error suggestion for :exc:`NameError` exceptions for instances. Now if a :exc:`NameError` is raised in a method and the instance has an attribute that's exactly equal to the name in the exception, the suggestion will include ``self.<NAME>`` instead of the closest match in the method scope. (Contributed by Pablo Galindo in :gh:`99139`.)
es: Mejora la sugerencia de error para excepciones :exc:`NameError` para instancias. Ahora, si se genera un :exc:`NameError` en un método y la instancia tiene un atributo que es exactamente igual al nombre en la excepción, la sugerencia incluirá ``self.<NAME>`` en lugar de la coincidencia más cercana en el alcance del método. (Aportado por Pablo Galindo en :gh:`99139`.)

source: Improve the :exc:`SyntaxError` error message when the user types ``import x from y`` instead of ``from y import x``. (Contributed by Pablo Galindo in :gh:`98931`.)
es: Mejora el mensaje de error :exc:`SyntaxError` cuando el usuario escribe ``import x from y`` en lugar de ``from y import x``. (Aportado por Pablo Galindo en :gh:`98931`.)

source: :exc:`ImportError` exceptions raised from failed ``from <module> import <name>`` statements now include suggestions for the value of ``<name>`` based on the available names in ``<module>``. (Contributed by Pablo Galindo in :gh:`91058`.)
es: Las excepciones :exc:`ImportError` generadas por sentencias ``from <module> import <name>`` fallidas ahora incluyen sugerencias para el valor de ``<name>`` según los nombres disponibles en ``<module>``. (Aportado por Pablo Galindo en :gh:`91058`.)

source: New Features Related to Type Hints
es: Nuevas funciones relacionadas con las sugerencias de escritura

source: This section covers major changes affecting :pep:`type hints <484>` and the :mod:`typing` module.
es: Esta sección cubre los cambios principales que afectan a :pep:`type hints <484>` y al módulo :mod:`typing`.

source: PEP 692: Using ``TypedDict`` for more precise ``**kwargs`` typing
es: PEP 692: uso de ``TypedDict`` para una escritura ``**kwargs`` más precisa

source: Typing ``**kwargs`` in a function signature as introduced by :pep:`484` allowed for valid annotations only in cases where all of the ``**kwargs`` were of the same type.
es: Escribir ``**kwargs`` en una firma de función introducida por :pep:`484` permitía anotaciones válidas solo en los casos en que todos los ``**kwargs`` eran del mismo tipo.

source: :pep:`692` specifies a more precise way of typing ``**kwargs`` by relying on typed dictionaries::
es: :pep:`692` especifica una forma más precisa de escribir ``**kwargs`` basándose en diccionarios escritos::

source: See :pep:`692` for more details.
es: Consulte :pep:`692` para obtener más detalles.

source: (Contributed by Franek Magiera in :gh:`103629`.)
es: (Aportado por Franek Magiera en :gh:`103629`.)

source: PEP 698: Override Decorator for Static Typing
es: PEP 698: Decorador override para escritura estática

source: A new decorator :func:`typing.override` has been added to the :mod:`typing` module. It indicates to type checkers that the method is intended to override a method in a superclass. This allows type checkers to catch mistakes where a method that is intended to override something in a base class does not in fact do so.
es: Se ha agregado un nuevo decorador :func:`typing.override` al módulo :mod:`typing`. Indica a los inspectores de tipo que el método está destinado a anular un método en una superclase. Esto permite a los verificadores de tipos detectar errores cuando un método destinado a anular algo en una clase base en realidad no lo hace.

source: Example::
es: Ejemplo::

source: See :pep:`698` for more details.
es: Consulte :pep:`698` para obtener más detalles.

source: (Contributed by Steven Troxler in :gh:`101561`.)
es: (Aportado por Steven Troxler en :gh:`101561`.)

source: Other Language Changes
es: Otros cambios del lenguaje

source: The parser now raises :exc:`SyntaxError` when parsing source code containing null bytes. (Contributed by Pablo Galindo in :gh:`96670`.)
es: El analizador ahora genera :exc:`SyntaxError` al analizar el código fuente que contiene bytes nulos. (Aportado por Pablo Galindo en :gh:`96670`.)

source: A backslash-character pair that is not a valid escape sequence now generates a :exc:`SyntaxWarning`, instead of :exc:`DeprecationWarning`. For example, ``re.compile("\d+\.\d+")`` now emits a :exc:`SyntaxWarning` (``"\d"`` is an invalid escape sequence, use raw strings for regular expression: ``re.compile(r"\d+\.\d+")``). In a future Python version, :exc:`SyntaxError` will eventually be raised, instead of :exc:`SyntaxWarning`. (Contributed by Victor Stinner in :gh:`98401`.)
es: Un par de caracteres de barra invertida que no es una secuencia de escape válida ahora genera un :exc:`SyntaxWarning`, en lugar de :exc:`DeprecationWarning`. Por ejemplo, ``re.compile("\d+\.\d+")`` ahora emite un :exc:`SyntaxWarning` (``"\d"`` es una secuencia de escape no válida; utilice cadenas sin formato para la expresión regular: ``re.compile(r"\d+\.\d+")``). En una versión futura de Python, eventualmente se generará :exc:`SyntaxError`, en lugar de :exc:`SyntaxWarning`. (Aportado por Victor Stinner en :gh:`98401`.)

source: Octal escapes with value larger than ``0o377`` (ex: ``"\477"``), deprecated in Python 3.11, now produce a :exc:`SyntaxWarning`, instead of :exc:`DeprecationWarning`. In a future Python version they will be eventually a :exc:`SyntaxError`. (Contributed by Victor Stinner in :gh:`98401`.)
es: Los escapes octales con un valor mayor que ``0o377`` (por ejemplo, ``"\477"``), obsoletos en Python 3.11, ahora producen un :exc:`SyntaxWarning`, en lugar de :exc:`DeprecationWarning`. En una futura versión de Python, eventualmente serán un :exc:`SyntaxError`. (Aportado por Victor Stinner en :gh:`98401`.)

source: Variables used in the target part of comprehensions that are not stored to can now be used in assignment expressions (``:=``). For example, in ``[(b := 1) for a, b.prop in some_iter]``, the assignment to ``b`` is now allowed. Note that assigning to variables stored to in the target part of comprehensions (like ``a``) is still disallowed, as per :pep:`572`. (Contributed by Nikita Sobolev in :gh:`100581`.)
es: Las variables utilizadas en la parte de destino de las comprensiones que no están almacenadas ahora se pueden usar en expresiones de asignación (``:=``). Por ejemplo, en ``[(b := 1) for a, b.prop in some_iter]``, ahora se permite la asignación a ``b``. Tenga en cuenta que la asignación de variables almacenadas en la parte de destino de las comprensiones (como ``a``) todavía no está permitida, según :pep:`572`. (Aportado por Nikita Sobolev en :gh:`100581`.)

source: Exceptions raised in a class or type's ``__set_name__`` method are no longer wrapped by a :exc:`RuntimeError`. Context information is added to the exception as a :pep:`678` note. (Contributed by Irit Katriel in :gh:`77757`.)
es: Las excepciones generadas en el método ``__set_name__`` de una clase o tipo ya no están incluidas en un :exc:`RuntimeError`. La información de contexto se agrega a la excepción como una nota :pep:`678`. (Aportado por Irit Katriel en :gh:`77757`.)

source: When a ``try-except*`` construct handles the entire :exc:`ExceptionGroup` and raises one other exception, that exception is no longer wrapped in an :exc:`ExceptionGroup`. Also changed in version 3.11.4. (Contributed by Irit Katriel in :gh:`103590`.)
es: Cuando una construcción ``try-except*`` maneja todo el :exc:`ExceptionGroup` y genera otra excepción, esa excepción ya no está incluida en un :exc:`ExceptionGroup`. También cambió en la versión 3.11.4. (Aportado por Irit Katriel en :gh:`103590`.)

source: The Garbage Collector now runs only on the eval breaker mechanism of the Python bytecode evaluation loop instead of object allocations. The GC can also run when :c:func:`PyErr_CheckSignals` is called so C extensions that need to run for a long time without executing any Python code also have a chance to execute the GC periodically. (Contributed by Pablo Galindo in :gh:`97922`.)
es: El recolector de basura ahora se ejecuta solo en el mecanismo de interrupción de evaluación del ciclo de evaluación del código de bytes de Python en lugar de en las asignaciones de objetos. El GC también se puede ejecutar cuando se llama a :c:func:`PyErr_CheckSignals`, por lo que las extensiones C que necesitan ejecutarse durante un período prolongado sin ejecutar ningún código Python también tienen la posibilidad de ejecutar el GC periódicamente. (Aportado por Pablo Galindo en :gh:`97922`.)

source: All builtin and extension callables expecting boolean parameters now accept arguments of any type instead of just :class:`bool` and :class:`int`. (Contributed by Serhiy Storchaka in :gh:`60203`.)
es: Todos los invocables integrados y de extensión que esperan parámetros booleanos ahora aceptan argumentos de cualquier tipo en lugar de solo :class:`bool` y :class:`int`. (Contribución de Serhiy Storchaka en :gh:`60203`.)

source: :class:`memoryview` now supports the half-float type (the "e" format code). (Contributed by Donghee Na and Antoine Pitrou in :gh:`90751`.)
es: :class:`memoryview` ahora admite el tipo medio flotante (el código de formato "e"). (Contribución de Donghee Na y Antoine Pitrou en :gh:`90751`.)

source: :class:`slice` objects are now hashable, allowing them to be used as dict keys and set items. (Contributed by Will Bradshaw, Furkan Onder, and Raymond Hettinger in :gh:`101264`.)
es: Los objetos :class:`slice` ahora son hasheables, lo que permite usarlos como claves de dictado y elementos de configuración. (Contribución de Will Bradshaw, Furkan Onder y Raymond Hettinger en :gh:`101264`.)

source: :func:`sum` now uses Neumaier summation to improve accuracy and commutativity when summing floats or mixed ints and floats. (Contributed by Raymond Hettinger in :gh:`100425`.)
es: :func:`sum` ahora utiliza la suma de Neumaier para mejorar la precisión y la conmutatividad al sumar flotantes o enteros y flotantes mixtos. (Aportado por Raymond Hettinger en :gh:`100425`.)

source: :func:`ast.parse` now raises :exc:`SyntaxError` instead of :exc:`ValueError` when parsing source code containing null bytes. (Contributed by Pablo Galindo in :gh:`96670`.)
es: :func:`ast.parse` ahora genera :exc:`SyntaxError` en lugar de :exc:`ValueError` al analizar el código fuente que contiene bytes nulos. (Aportado por Pablo Galindo en :gh:`96670`.)

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile extraction filters <tarfile-extraction-filter>` for details. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
es: Los métodos de extracción en :mod:`tarfile` y :func:`shutil.unpack_archive` tienen un nuevo argumento, *filter*, que permite limitar funciones tar que puedan resultar sorprendentes o peligrosas, como la creación de archivos fuera del directorio de destino. Consulte :ref:`tarfile extraction filters <tarfile-extraction-filter>` para obtener más detalles. En Python 3.14, el valor predeterminado cambiará a ``'data'``. (Aportado por Petr Viktorin en :pep:`706`.)

source: :class:`types.MappingProxyType` instances are now hashable if the underlying mapping is hashable. (Contributed by Serhiy Storchaka in :gh:`87995`.)
es: Las instancias :class:`types.MappingProxyType` ahora son hasheables si el mapeo subyacente es hasheable. (Contribución de Serhiy Storchaka en :gh:`87995`.)

source: Add :ref:`support for the perf profiler <perf_profiling>` through the new environment variable :envvar:`PYTHONPERFSUPPORT` and command-line option :option:`-X perf <-X>`, as well as the new :func:`sys.activate_stack_trampoline`, :func:`sys.deactivate_stack_trampoline`, and :func:`sys.is_stack_trampoline_active` functions. (Design by Pablo Galindo. Contributed by Pablo Galindo and Christian Heimes with contributions from Gregory P. Smith [Google] and Mark Shannon in :gh:`96123`.)
es: Agregado :ref:`support for the perf profiler <perf_profiling>` a través de la nueva variable de entorno :envvar:`PYTHONPERFSUPPORT` y la opción de línea de comandos :option:`-X perf <-X>`, así como las nuevas funciones :func:`sys.activate_stack_trampoline`, :func:`sys.deactivate_stack_trampoline` y :func:`sys.is_stack_trampoline_active`. (Diseño de Pablo Galindo. Contribución de Pablo Galindo y Christian Heimes con contribuciones de Gregory P. Smith [Google] y Mark Shannon en :gh:`96123`.)

source: New Modules
es: Nuevos módulos

source: None.
es: Ninguno.

source: Improved Modules
es: Módulos mejorados

source: The :class:`array.array` class now supports subscripting, making it a :term:`generic type`. (Contributed by Jelle Zijlstra in :gh:`98658`.)
es: La clase :class:`array.array` ahora admite subíndices, lo que la convierte en :term:`generic type`. (Aportado por Jelle Zijlstra en :gh:`98658`.)

source: asyncio
es: asincio

source: The performance of writing to sockets in :mod:`asyncio` has been significantly improved. ``asyncio`` now avoids unnecessary copying when writing to sockets and uses :meth:`~socket.socket.sendmsg` if the platform supports it. (Contributed by Kumar Aditya in :gh:`91166`.)
es: Se ha mejorado significativamente el rendimiento de escritura en sockets en :mod:`asyncio`. ``asyncio`` ahora evita copias innecesarias al escribir en sockets y usa :meth:`~socket.socket.sendmsg` si la plataforma lo admite. (Aportado por Kumar Aditya en :gh:`91166`.)

source: Add :func:`asyncio.eager_task_factory` and :func:`asyncio.create_eager_task_factory` functions to allow opting an event loop in to eager task execution, making some use-cases 2x to 5x faster. (Contributed by Jacob Bower & Itamar Oren in :gh:`102853`, :gh:`104140`, and :gh:`104138`)
es: Agregado las funciones :func:`asyncio.eager_task_factory` y :func:`asyncio.create_eager_task_factory` para permitir la opción de un bucle de eventos para la ejecución de tareas entusiastas, lo que hace que algunos casos de uso sean de 2 a 5 veces más rápidos. (Contribución de Jacob Bower e Itamar Oren en :gh:`102853`, :gh:`104140` y :gh:`104138`)

source: On Linux, :mod:`asyncio` uses :class:`asyncio.PidfdChildWatcher` by default if :func:`os.pidfd_open` is available and functional instead of :class:`asyncio.ThreadedChildWatcher`. (Contributed by Kumar Aditya in :gh:`98024`.)
es: En Linux, :mod:`asyncio` usa :class:`asyncio.PidfdChildWatcher` de forma predeterminada si :func:`os.pidfd_open` está disponible y es funcional en lugar de :class:`asyncio.ThreadedChildWatcher`. (Aportado por Kumar Aditya en :gh:`98024`.)

source: The event loop now uses the best available child watcher for each platform (:class:`asyncio.PidfdChildWatcher` if supported and :class:`asyncio.ThreadedChildWatcher` otherwise), so manually configuring a child watcher is not recommended. (Contributed by Kumar Aditya in :gh:`94597`.)
es: El bucle de eventos ahora utiliza el mejor observador de hijos disponible para cada plataforma (:class:`asyncio.PidfdChildWatcher` si es compatible y :class:`asyncio.ThreadedChildWatcher` en caso contrario), por lo que no se recomienda configurar manualmente un observador de hijos. (Aportado por Kumar Aditya en :gh:`94597`.)

source: Add *loop_factory* parameter to :func:`asyncio.run` to allow specifying a custom event loop factory. (Contributed by Kumar Aditya in :gh:`99388`.)
es: Agregado el parámetro *loop_factory* a :func:`asyncio.run` para permitir especificar una fábrica de bucle de eventos personalizada. (Aportado por Kumar Aditya en :gh:`99388`.)

source: Add C implementation of :func:`asyncio.current_task` for 4x-6x speedup. (Contributed by Itamar Oren and Pranav Thulasiram Bhat in :gh:`100344`.)
es: Agregado la implementación C de :func:`asyncio.current_task` para una aceleración de 4x-6x. (Aportado por Itamar Oren y Pranav Thulasiram Bhat en :gh:`100344`.)

source: :func:`asyncio.iscoroutine` now returns ``False`` for generators as :mod:`asyncio` does not support legacy generator-based coroutines. (Contributed by Kumar Aditya in :gh:`102748`.)
es: :func:`asyncio.iscoroutine` ahora devuelve ``False`` para generadores, ya que :mod:`asyncio` no admite rutinas heredadas basadas en generadores. (Aportado por Kumar Aditya en :gh:`102748`.)

source: :func:`asyncio.wait` and :func:`asyncio.as_completed` now accepts generators yielding tasks. (Contributed by Kumar Aditya in :gh:`78530`.)
es: :func:`asyncio.wait` y :func:`asyncio.as_completed` ahora aceptan generadores que generan tareas. (Aportado por Kumar Aditya en :gh:`78530`.)

source: Add enums :data:`calendar.Month` and :data:`calendar.Day` defining months of the year and days of the week. (Contributed by Prince Roshan in :gh:`103636`.)
es: Agregado las enumeraciones :data:`calendar.Month` y :data:`calendar.Day` que definen los meses del año y los días de la semana. (Aportado por el Príncipe Roshan en :gh:`103636`.)

source: Add :const:`csv.QUOTE_NOTNULL` and :const:`csv.QUOTE_STRINGS` flags to provide finer grained control of ``None`` and empty strings by :class:`csv.writer` objects.
es: Agregado indicadores :const:`csv.QUOTE_NOTNULL` y :const:`csv.QUOTE_STRINGS` para proporcionar un control más detallado de ``None`` y cadenas vacías por objetos :class:`csv.writer`.

source: Pseudo instruction opcodes (which are used by the compiler but do not appear in executable bytecode) are now exposed in the :mod:`dis` module. :opcode:`HAVE_ARGUMENT` is still relevant to real opcodes, but it is not useful for pseudo instructions. Use the new :data:`dis.hasarg` collection instead. (Contributed by Irit Katriel in :gh:`94216`.)
es: Los códigos de operación de pseudoinstrucción (que son utilizados por el compilador pero que no aparecen en el código de bytes ejecutable) ahora están expuestos en el módulo :mod:`dis`. :opcode:`HAVE_ARGUMENT` sigue siendo relevante para códigos de operación reales, pero no es útil para pseudoinstrucciones. Utilice la nueva colección :data:`dis.hasarg` en su lugar. (Aportado por Irit Katriel en :gh:`94216`.)

source: Add the :data:`dis.hasexc` collection to signify instructions that set an exception handler. (Contributed by Irit Katriel in :gh:`94216`.)
es: Agregado la colección :data:`dis.hasexc` para indicar instrucciones que establecen un controlador de excepciones. (Aportado por Irit Katriel en :gh:`94216`.)

source: Objects of type :class:`fractions.Fraction` now support float-style formatting. (Contributed by Mark Dickinson in :gh:`100161`.)
es: Los objetos de tipo :class:`fractions.Fraction` ahora admiten formato de estilo flotante. (Aportado por Mark Dickinson en :gh:`100161`.)

source: :func:`importlib.resources.as_file` now supports resource directories. (Contributed by Jason R. Coombs in :gh:`97930`.)
es: :func:`importlib.resources.as_file` ahora admite directorios de recursos. (Aportado por Jason R. Coombs en :gh:`97930`.)
