Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: :c:func:`PySys_ResetWarnOptions`: clear :data:`sys.warnoptions` and :data:`!warnings.filters`
es: :c:func:`PySys_ResetWarnOptions`: borrar :data:`sys.warnoptions` y :data:`!warnings.filters`

source: :c:func:`Py_GetExecPrefix`: get :data:`sys.exec_prefix`
es: :c:func:`Py_GetExecPrefix`: obtener :data:`sys.exec_prefix`

source: :c:func:`Py_GetPath`: get :data:`sys.path`
es: :c:func:`Py_GetPath`: obtener :data:`sys.path`

source: :c:func:`Py_GetPrefix`: get :data:`sys.prefix`
es: :c:func:`Py_GetPrefix`: obtener :data:`sys.prefix`

source: :c:func:`Py_GetProgramFullPath`: get :data:`sys.executable`
es: :c:func:`Py_GetProgramFullPath`: obtener :data:`sys.executable`

source: :c:func:`Py_GetProgramName`: get :data:`sys.executable`
es: :c:func:`Py_GetProgramName`: obtener :data:`sys.executable`

source: :c:func:`Py_GetPythonHome`: get :c:member:`PyConfig.home` or the :envvar:`PYTHONHOME` environment variable
es: :c:func:`Py_GetPythonHome`: obtenga :c:member:`PyConfig.home` o la variable de entorno :envvar:`PYTHONHOME`

source: The following APIs are deprecated and will be removed, although there is currently no date scheduled for their removal.
es: Las siguientes API están obsoletas y se eliminarán, aunque actualmente no hay una fecha programada para su eliminación.

source: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: unneeded since Python 3.8
es: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: innecesario desde Python 3.8

source: :c:func:`PyErr_Fetch`: use :c:func:`PyErr_GetRaisedException`
es: :c:func:`PyErr_Fetch`: utilizar :c:func:`PyErr_GetRaisedException`

source: :c:func:`PyErr_NormalizeException`: use :c:func:`PyErr_GetRaisedException`
es: :c:func:`PyErr_NormalizeException`: utilizar :c:func:`PyErr_GetRaisedException`

source: :c:func:`PyErr_Restore`: use :c:func:`PyErr_SetRaisedException`
es: :c:func:`PyErr_Restore`: utilizar :c:func:`PyErr_SetRaisedException`

source: :c:func:`PyModule_GetFilename`: use :c:func:`PyModule_GetFilenameObject`
es: :c:func:`PyModule_GetFilename`: utilizar :c:func:`PyModule_GetFilenameObject`

source: :c:func:`PyOS_AfterFork`: use :c:func:`PyOS_AfterFork_Child`
es: :c:func:`PyOS_AfterFork`: utilizar :c:func:`PyOS_AfterFork_Child`

source: :c:func:`PySlice_GetIndicesEx`: use :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`
es: :c:func:`PySlice_GetIndicesEx`: utilice :c:func:`PySlice_Unpack` y :c:func:`PySlice_AdjustIndices`

source: :c:func:`!PyUnicode_AsDecodedObject`: use :c:func:`PyCodec_Decode`
es: :c:func:`!PyUnicode_AsDecodedObject`: utilizar :c:func:`PyCodec_Decode`

source: :c:func:`!PyUnicode_AsDecodedUnicode`: use :c:func:`PyCodec_Decode`
es: :c:func:`!PyUnicode_AsDecodedUnicode`: utilizar :c:func:`PyCodec_Decode`

source: :c:func:`!PyUnicode_AsEncodedObject`: use :c:func:`PyCodec_Encode`
es: :c:func:`!PyUnicode_AsEncodedObject`: utilizar :c:func:`PyCodec_Encode`

source: :c:func:`!PyUnicode_AsEncodedUnicode`: use :c:func:`PyCodec_Encode`
es: :c:func:`!PyUnicode_AsEncodedUnicode`: utilizar :c:func:`PyCodec_Encode`

source: :c:func:`PyUnicode_READY`: unneeded since Python 3.12
es: :c:func:`PyUnicode_READY`: innecesario desde Python 3.12

source: :c:func:`!PyErr_Display`: use :c:func:`PyErr_DisplayException`
es: :c:func:`!PyErr_Display`: utilizar :c:func:`PyErr_DisplayException`

source: :c:func:`!_PyErr_ChainExceptions`: use ``_PyErr_ChainExceptions1``
es: :c:func:`!_PyErr_ChainExceptions`: utilizar ``_PyErr_ChainExceptions1``

source: :c:member:`!PyBytesObject.ob_shash` member: call :c:func:`PyObject_Hash` instead
es: Miembro :c:member:`!PyBytesObject.ob_shash`: llame a :c:func:`PyObject_Hash` en su lugar

source: :c:member:`!PyDictObject.ma_version_tag` member
es: Miembro :c:member:`!PyDictObject.ma_version_tag`

source: Thread Local Storage (TLS) API:
es: API de almacenamiento local de subprocesos (TLS):

source: :c:func:`PyThread_create_key`: use :c:func:`PyThread_tss_alloc`
es: :c:func:`PyThread_create_key`: utilizar :c:func:`PyThread_tss_alloc`

source: :c:func:`PyThread_delete_key`: use :c:func:`PyThread_tss_free`
es: :c:func:`PyThread_delete_key`: utilizar :c:func:`PyThread_tss_free`

source: :c:func:`PyThread_set_key_value`: use :c:func:`PyThread_tss_set`
es: :c:func:`PyThread_set_key_value`: utilizar :c:func:`PyThread_tss_set`

source: :c:func:`PyThread_get_key_value`: use :c:func:`PyThread_tss_get`
es: :c:func:`PyThread_get_key_value`: utilizar :c:func:`PyThread_tss_get`

source: :c:func:`PyThread_delete_key_value`: use :c:func:`PyThread_tss_delete`
es: :c:func:`PyThread_delete_key_value`: utilizar :c:func:`PyThread_tss_delete`

source: :c:func:`PyThread_ReInitTLS`: unneeded since Python 3.7
es: :c:func:`PyThread_ReInitTLS`: innecesario desde Python 3.7

source: Remove the :file:`token.h` header file. There was never any public tokenizer C API. The :file:`token.h` header file was only designed to be used by Python internals. (Contributed by Victor Stinner in :gh:`92651`.)
es: Elimine el archivo de encabezado :file:`token.h`. Nunca hubo ninguna API C de tokenizador público. El archivo de encabezado :file:`token.h` solo fue diseñado para ser utilizado por componentes internos de Python. (Aportado por Victor Stinner en :gh:`92651`.)

source: Legacy Unicode APIs have been removed. See :pep:`623` for detail.
es: Se han eliminado las API Unicode heredadas. Consulte :pep:`623` para obtener más detalles.

source: Remove the ``PyUnicode_InternImmortal()`` function macro. (Contributed by Victor Stinner in :gh:`85858`.)
es: Elimine la macro de función ``PyUnicode_InternImmortal()``. (Aportado por Victor Stinner en :gh:`85858`.)

source: Remove ``Jython`` compatibility hacks from several stdlib modules and tests. (Contributed by Nikita Sobolev in :gh:`99482`.)
es: Elimine los trucos de compatibilidad ``Jython`` de varios módulos y pruebas stdlib. (Aportado por Nikita Sobolev en :gh:`99482`.)

source: Remove ``_use_broken_old_ctypes_structure_semantics_`` flag from :mod:`ctypes` module. (Contributed by Nikita Sobolev in :gh:`99285`.)
es: Elimine el indicador ``_use_broken_old_ctypes_structure_semantics_`` del módulo :mod:`ctypes`. (Aportado por Nikita Sobolev en :gh:`99285`.)
