Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: More strict rules are now applied for numerical group references and group names in regular expressions. Only sequence of ASCII digits is now accepted as a numerical reference. The group name in bytes patterns and replacement strings can now only contain ASCII letters and digits and underscore. (Contributed by Serhiy Storchaka in :gh:`91760`.)
es: Ahora se aplican reglas más estrictas para las referencias numéricas de grupos y los nombres de grupos en expresiones regulares. Ahora sólo se acepta como referencia numérica la secuencia de dígitos ASCII. El nombre del grupo en patrones de bytes y cadenas de reemplazo ahora solo puede contener letras y dígitos ASCII y guiones bajos. (Contribución de Serhiy Storchaka en :gh:`91760`.)

source: Remove ``randrange()`` functionality deprecated since Python 3.10. Formerly, ``randrange(10.0)`` losslessly converted to ``randrange(10)``. Now, it raises a :exc:`TypeError`. Also, the exception raised for non-integer values such as ``randrange(10.5)`` or ``randrange('10')`` has been changed from :exc:`ValueError` to :exc:`TypeError`. This also prevents bugs where ``randrange(1e25)`` would silently select from a larger range than ``randrange(10**25)``. (Originally suggested by Serhiy Storchaka :gh:`86388`.)
es: Elimine la funcionalidad ``randrange()`` en desuso desde Python 3.10. Anteriormente, ``randrange(10.0)`` se convertía sin pérdidas a ``randrange(10)``. Ahora, genera un :exc:`TypeError`. Además, la excepción planteada para valores no enteros como ``randrange(10.5)`` o ``randrange('10')`` se cambió de :exc:`ValueError` a :exc:`TypeError`. Esto también evita errores en los que ``randrange(1e25)`` seleccionaría silenciosamente de un rango mayor que ``randrange(10**25)``. (Originalmente sugerido por Serhiy Storchaka :gh:`86388`.)

source: :class:`argparse.ArgumentParser` changed encoding and error handler for reading arguments from file (e.g. ``fromfile_prefix_chars`` option) from default text encoding (e.g. :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>`) to :term:`filesystem encoding and error handler`. Argument files should be encoded in UTF-8 instead of ANSI Codepage on Windows.
es: :class:`argparse.ArgumentParser` cambió la codificación y el controlador de errores para leer argumentos de un archivo (por ejemplo, la opción ``fromfile_prefix_chars``) de la codificación de texto predeterminada (por ejemplo, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>`) a :term:`filesystem encoding and error handler`. Los archivos de argumentos deben codificarse en UTF-8 en lugar de en la página de códigos ANSI en Windows.

source: Remove the ``asyncore``-based ``smtpd`` module deprecated in Python 3.4.7 and 3.5.4. A recommended replacement is the :mod:`asyncio`-based aiosmtpd_ PyPI module.
es: Elimine el módulo ``smtpd`` basado en ``asyncore`` que está en desuso en Python 3.4.7 y 3.5.4. Un reemplazo recomendado es el módulo aiosmtpd_ PyPI basado en :mod:`asyncio`.

source: :func:`shlex.split`: Passing ``None`` for *s* argument now raises an exception, rather than reading :data:`sys.stdin`. The feature was deprecated in Python 3.9. (Contributed by Victor Stinner in :gh:`94352`.)
es: :func:`shlex.split`: Pasar ``None`` por el argumento *s* ahora genera una excepción, en lugar de leer :data:`sys.stdin`. La característica quedó obsoleta en Python 3.9. (Aportado por Victor Stinner en :gh:`94352`.)

source: The :mod:`os` module no longer accepts bytes-like paths, like :class:`bytearray` and :class:`memoryview` types: only the exact :class:`bytes` type is accepted for bytes strings. (Contributed by Victor Stinner in :gh:`98393`.)
es: El módulo :mod:`os` ya no acepta rutas tipo bytes, como los tipos :class:`bytearray` y :class:`memoryview`: solo se acepta el tipo exacto :class:`bytes` para cadenas de bytes. (Aportado por Victor Stinner en :gh:`98393`.)

source: :func:`syslog.openlog` and :func:`syslog.closelog` now fail if used in subinterpreters. :func:`syslog.syslog` may still be used in subinterpreters, but now only if :func:`syslog.openlog` has already been called in the main interpreter. These new restrictions do not apply to the main interpreter, so only a very small set of users might be affected. This change helps with interpreter isolation. Furthermore, :mod:`syslog` is a wrapper around process-global resources, which are best managed from the main interpreter. (Contributed by Donghee Na in :gh:`99127`.)
es: :func:`syslog.openlog` y :func:`syslog.closelog` ahora fallan si se usan en subintérpretes. :func:`syslog.syslog` aún se puede usar en subintérpretes, pero ahora solo si :func:`syslog.openlog` ya ha sido llamado en el intérprete principal. Estas nuevas restricciones no se aplican al intérprete principal, por lo que sólo un conjunto muy pequeño de usuarios podría verse afectado. Este cambio ayuda con el aislamiento del intérprete. Además, :mod:`syslog` es un contenedor de recursos globales de procesos, que se administran mejor desde el intérprete principal. (Aportado por Donghee Na en :gh:`99127`.)

source: The undocumented locking behavior of :func:`~functools.cached_property` is removed, because it locked across all instances of the class, leading to high lock contention. This means that a cached property getter function could now run more than once for a single instance, if two threads race. For most simple cached properties (e.g. those that are idempotent and simply calculate a value based on other attributes of the instance) this will be fine. If synchronization is needed, implement locking within the cached property getter function or around multi-threaded access points.
es: Se elimina el comportamiento de bloqueo no documentado de :func:`~functools.cached_property`, porque bloqueaba todas las instancias de la clase, lo que generaba una alta contención de bloqueo. Esto significa que una función de obtención de propiedades almacenadas en caché ahora podría ejecutarse más de una vez para una sola instancia, si dos subprocesos se ejecutan. Para la mayoría de las propiedades almacenadas en caché simples (por ejemplo, aquellas que son idempotentes y simplemente calculan un valor en función de otros atributos de la instancia), esto estará bien. Si se necesita sincronización, implemente el bloqueo dentro de la función de obtención de propiedades en caché o alrededor de puntos de acceso de subprocesos múltiples.

source: When extracting tar files using :mod:`tarfile` or :func:`shutil.unpack_archive`, pass the *filter* argument to limit features that may be surprising or dangerous. See :ref:`tarfile-extraction-filter` for details.
es: Al extraer archivos tar usando :mod:`tarfile` o :func:`shutil.unpack_archive`, pase el argumento *filter* para limitar las funciones que pueden resultar sorprendentes o peligrosas. Consulte :ref:`tarfile-extraction-filter` para obtener más detalles.

source: The output of the :func:`tokenize.tokenize` and :func:`tokenize.generate_tokens` functions is now changed due to the changes introduced in :pep:`701`. This means that ``STRING`` tokens are not emitted any more for f-strings and the tokens described in :pep:`701` are now produced instead: ``FSTRING_START``, ``FSTRING_MIDDLE`` and ``FSTRING_END`` are now emitted for f-string "string" parts in addition to the appropriate tokens for the tokenization in the expression components. For example for the f-string ``f"start {1+1} end"`` the old version of the tokenizer emitted::
es: La salida de las funciones :func:`tokenize.tokenize` y :func:`tokenize.generate_tokens` ahora cambia debido a los cambios introducidos en :pep:`701`. Esto significa que los tokens ``STRING`` ya no se emiten para cadenas f y los tokens descritos en :pep:`701` ahora se producen en su lugar: ``FSTRING_START``, ``FSTRING_MIDDLE`` y ``FSTRING_END`` ahora se emiten para partes de "cadena" de cadena f además de los tokens apropiados para la tokenización. en los componentes de la expresión. Por ejemplo, para la cadena f ``f"start {1+1} end"``, la versión anterior del tokenizador emitió::

source: while the new version emits::
es: mientras que la nueva versión emite::

source: Additionally, there may be some minor behavioral changes as a consequence of the changes required to support :pep:`701`. Some of these changes include:
es: Además, puede haber algunos cambios de comportamiento menores como consecuencia de los cambios necesarios para admitir :pep:`701`. Algunos de estos cambios incluyen:

source: The ``type`` attribute of the tokens emitted when tokenizing some invalid Python characters such as ``!`` has changed from ``ERRORTOKEN`` to ``OP``.
es: El atributo ``type`` de los tokens emitidos al tokenizar algunos caracteres de Python no válidos, como ``!``, ha cambiado de ``ERRORTOKEN`` a ``OP``.

source: Incomplete single-line strings now also raise :exc:`tokenize.TokenError` as incomplete multiline strings do.
es: Las cadenas incompletas de una sola línea ahora también generan :exc:`tokenize.TokenError` como lo hacen las cadenas incompletas de varias líneas.

source: Some incomplete or invalid Python code now raises :exc:`tokenize.TokenError` instead of returning arbitrary ``ERRORTOKEN`` tokens when tokenizing it.
es: Algún código Python incompleto o no válido ahora genera :exc:`tokenize.TokenError` en lugar de devolver tokens ``ERRORTOKEN`` arbitrarios al tokenizarlo.

source: Mixing tabs and spaces as indentation in the same file is not supported anymore and will raise a :exc:`TabError`.
es: Ya no se admite la combinación de tabulaciones y espacios como sangría en el mismo archivo y generará un :exc:`TabError`.

source: Build Changes
es: Cambios de compilación

source: Python no longer uses :file:`setup.py` to build shared C extension modules. Build parameters like headers and libraries are detected in ``configure`` script. Extensions are built by :file:`Makefile`. Most extensions use ``pkg-config`` and fall back to manual detection. (Contributed by Christian Heimes in :gh:`93939`.)
es: Python ya no usa :file:`setup.py` para crear módulos de extensión C compartidos. Los parámetros de compilación, como encabezados y bibliotecas, se detectan en el script ``configure``. Las extensiones están construidas por :file:`Makefile`. La mayoría de las extensiones usan ``pkg-config`` y recurren a la detección manual. (Aportado por Christian Heimes en :gh:`93939`.)

source: ``va_start()`` with two parameters, like ``va_start(args, format),`` is now required to build Python. ``va_start()`` is no longer called with a single parameter. (Contributed by Kumar Aditya in :gh:`93207`.)
es: Ahora se requiere ``va_start()`` con dos parámetros, como ``va_start(args, format),``, para compilar Python. ``va_start()`` ya no se llama con un solo parámetro. (Aportado por Kumar Aditya en :gh:`93207`.)

source: CPython now uses the ThinLTO option as the default link time optimization policy if the Clang compiler accepts the flag. (Contributed by Donghee Na in :gh:`89536`.)
es: CPython ahora usa la opción ThinLTO como política predeterminada de optimización del tiempo de enlace si el compilador Clang acepta la marca. (Aportado por Donghee Na en :gh:`89536`.)

source: Add ``COMPILEALL_OPTS`` variable in :file:`Makefile` to override :mod:`compileall` options (default: ``-j0``) in ``make install``. Also merged the 3 ``compileall`` commands into a single command to build .pyc files for all optimization levels (0, 1, 2) at once. (Contributed by Victor Stinner in :gh:`99289`.)
es: Agregado la variable ``COMPILEALL_OPTS`` en :file:`Makefile` para anular las opciones de :mod:`compileall` (predeterminada: ``-j0``) en ``make install``. También fusionó los 3 comandos ``compileall`` en un solo comando para crear archivos .pyc para todos los niveles de optimización (0, 1, 2) a la vez. (Aportado por Victor Stinner en :gh:`99289`.)

source: Add platform triplets for 64-bit LoongArch:
es: Agregado tripletes de plataforma para LoongArch de 64 bits:

source: (Contributed by Zhang Na in :gh:`90656`.)
es: (Aportado por Zhang Na en :gh:`90656`.)

source: ``PYTHON_FOR_REGEN`` now require Python 3.10 or newer.
es: ``PYTHON_FOR_REGEN`` ahora requiere Python 3.10 o posterior.

source: Autoconf 2.71 and aclocal 1.16.4 is now required to regenerate :file:`!configure`. (Contributed by Christian Heimes in :gh:`89886`.)
es: Ahora se requieren Autoconf 2.71 y aclocal 1.16.4 para regenerar :file:`!configure`. (Aportado por Christian Heimes en :gh:`89886`.)

source: Windows builds and macOS installers from python.org now use OpenSSL 3.0.
es: Las compilaciones de Windows y los instaladores de macOS de python.org ahora usan OpenSSL 3.0.

source: C API Changes
es: Cambios en la API de C

source: :pep:`697`: Introduce the :ref:`Unstable C API tier <unstable-c-api>`, intended for low-level tools like debuggers and JIT compilers. This API may change in each minor release of CPython without deprecation warnings. Its contents are marked by the ``PyUnstable_`` prefix in names.
es: :pep:`697`: presente :ref:`Unstable C API tier <unstable-c-api>`, destinado a herramientas de bajo nivel como depuradores y compiladores JIT. Esta API puede cambiar en cada versión menor de CPython sin advertencias de obsolescencia. Su contenido está marcado con el prefijo ``PyUnstable_`` en los nombres.

source: Code object constructors:
es: Constructores de objetos de código:

source: ``PyUnstable_Code_New()`` (renamed from ``PyCode_New``)
es: ``PyUnstable_Code_New()`` (renombrado de ``PyCode_New``)

source: ``PyUnstable_Code_NewWithPosOnlyArgs()`` (renamed from ``PyCode_NewWithPosOnlyArgs``)
es: ``PyUnstable_Code_NewWithPosOnlyArgs()`` (renombrado de ``PyCode_NewWithPosOnlyArgs``)

source: Extra storage for code objects (:pep:`523`):
es: Almacenamiento adicional para objetos de código (:pep:`523`):

source: ``PyUnstable_Eval_RequestCodeExtraIndex()`` (renamed from ``_PyEval_RequestCodeExtraIndex``)
es: ``PyUnstable_Eval_RequestCodeExtraIndex()`` (renombrado de ``_PyEval_RequestCodeExtraIndex``)

source: ``PyUnstable_Code_GetExtra()`` (renamed from ``_PyCode_GetExtra``)
es: ``PyUnstable_Code_GetExtra()`` (renombrado de ``_PyCode_GetExtra``)

source: ``PyUnstable_Code_SetExtra()`` (renamed from ``_PyCode_SetExtra``)
es: ``PyUnstable_Code_SetExtra()`` (renombrado de ``_PyCode_SetExtra``)

source: The original names will continue to be available until the respective API changes.
es: Los nombres originales seguirán estando disponibles hasta que cambie la API respectiva.

source: (Contributed by Petr Viktorin in :gh:`101101`.)
es: (Aportado por Petr Viktorin en :gh:`101101`.)

source: :pep:`697`: Add an API for extending types whose instance memory layout is opaque:
es: :pep:`697`: agregue una API para extender tipos cuyo diseño de memoria de instancia es opaco:

source: :c:member:`PyType_Spec.basicsize` can be zero or negative to specify inheriting or extending the base class size.
es: :c:member:`PyType_Spec.basicsize` puede ser cero o negativo para especificar heredar o ampliar el tamaño de la clase base.

source: :c:func:`PyObject_GetTypeData` and :c:func:`PyType_GetTypeDataSize` added to allow access to subclass-specific instance data.
es: Se agregaron :c:func:`PyObject_GetTypeData` y :c:func:`PyType_GetTypeDataSize` para permitir el acceso a datos de instancia específicos de subclase.

source: :c:macro:`Py_TPFLAGS_ITEMS_AT_END` and :c:func:`PyObject_GetItemData` added to allow safely extending certain variable-sized types, including :c:var:`PyType_Type`.
es: Se agregaron :c:macro:`Py_TPFLAGS_ITEMS_AT_END` y :c:func:`PyObject_GetItemData` para permitir extender de forma segura ciertos tipos de tamaño variable, incluido :c:var:`PyType_Type`.

source: :c:macro:`Py_RELATIVE_OFFSET` added to allow defining :c:type:`members <PyMemberDef>` in terms of a subclass-specific struct.
es: Se agregó :c:macro:`Py_RELATIVE_OFFSET` para permitir definir :c:type:`members <PyMemberDef>` en términos de una estructura específica de subclase.

source: (Contributed by Petr Viktorin in :gh:`103509`.)
es: (Aportado por Petr Viktorin en :gh:`103509`.)

source: Add the new :ref:`limited C API <limited-c-api>` function :c:func:`PyType_FromMetaclass`, which generalizes the existing :c:func:`PyType_FromModuleAndSpec` using an additional metaclass argument. (Contributed by Wenzel Jakob in :gh:`93012`.)
es: Agregado la nueva función :ref:`limited C API <limited-c-api>` :c:func:`PyType_FromMetaclass`, que generaliza el :c:func:`PyType_FromModuleAndSpec` existente utilizando un argumento de metaclase adicional. (Aportado por Wenzel Jakob en :gh:`93012`.)

source: API for creating objects that can be called using :ref:`the vectorcall protocol <vectorcall>` was added to the :ref:`Limited API <stable>`:
es: Se agregó API para crear objetos que se pueden llamar usando :ref:`the vectorcall protocol <vectorcall>` a :ref:`Limited API <stable>`:

source: The :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` flag is now removed from a class when the class's :py:meth:`~object.__call__` method is reassigned. This makes vectorcall safe to use with mutable types (i.e. heap types without the immutable flag, :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`). Mutable types that do not override :c:member:`~PyTypeObject.tp_call` now inherit the ``Py_TPFLAGS_HAVE_VECTORCALL`` flag. (Contributed by Petr Viktorin in :gh:`93274`.)
es: El indicador :c:macro:`Py_TPFLAGS_HAVE_VECTORCALL` ahora se elimina de una clase cuando se reasigna el método :py:meth:`~object.__call__` de la clase. Esto hace que vectorcall sea seguro de usar con tipos mutables (es decir, tipos de montón sin el indicador inmutable, :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`). Los tipos mutables que no anulan :c:member:`~PyTypeObject.tp_call` ahora heredan el indicador ``Py_TPFLAGS_HAVE_VECTORCALL``. (Aportado por Petr Viktorin en :gh:`93274`.)

source: The :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` flags have been added. This allows extensions classes to support object ``__dict__`` and weakrefs with less bookkeeping, using less memory and with faster access.
es: Se han agregado los indicadores :c:macro:`Py_TPFLAGS_MANAGED_DICT` y :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF`. Esto permite que las clases de extensiones admitan el objeto ``__dict__`` y las referencias débiles con menos contabilidad, usando menos memoria y con un acceso más rápido.

source: API for performing calls using :ref:`the vectorcall protocol <vectorcall>` was added to the :ref:`Limited API <stable>`:
es: Se agregó API para realizar llamadas usando :ref:`the vectorcall protocol <vectorcall>` a :ref:`Limited API <stable>`:

source: This means that both the incoming and outgoing ends of the vector call protocol are now available in the :ref:`Limited API <stable>`. (Contributed by Wenzel Jakob in :gh:`98586`.)
es: Esto significa que tanto el extremo entrante como el saliente del protocolo de llamada vectorial ahora están disponibles en el :ref:`Limited API <stable>`. (Aportado por Wenzel Jakob en :gh:`98586`.)

source: Add two new public functions, :c:func:`PyEval_SetProfileAllThreads` and :c:func:`PyEval_SetTraceAllThreads`, that allow to set tracing and profiling functions in all running threads in addition to the calling one. (Contributed by Pablo Galindo in :gh:`93503`.)
es: Agregado dos nuevas funciones públicas, :c:func:`PyEval_SetProfileAllThreads` y :c:func:`PyEval_SetTraceAllThreads`, que permiten configurar funciones de seguimiento y creación de perfiles en todos los subprocesos en ejecución además del que realiza la llamada. (Aportado por Pablo Galindo en :gh:`93503`.)

source: Add new function :c:func:`PyFunction_SetVectorcall` to the C API which sets the vectorcall field of a given :c:type:`PyFunctionObject`. (Contributed by Andrew Frost in :gh:`92257`.)
es: Agregado la nueva función :c:func:`PyFunction_SetVectorcall` a la API de C que establece el campo de llamada vectorial de un :c:type:`PyFunctionObject` determinado. (Aportado por Andrew Frost en :gh:`92257`.)

source: The C API now permits registering callbacks via :c:func:`PyDict_AddWatcher`, :c:func:`PyDict_Watch` and related APIs to be called whenever a dictionary is modified. This is intended for use by optimizing interpreters, JIT compilers, or debuggers. (Contributed by Carl Meyer in :gh:`91052`.)
es: La API de C ahora permite registrar devoluciones de llamada a través de :c:func:`PyDict_AddWatcher`, :c:func:`PyDict_Watch` y API relacionadas para ser llamadas cada vez que se modifica un diccionario. Está pensado para optimizar intérpretes, compiladores JIT o depuradores. (Aportado por Carl Meyer en :gh:`91052`.)

source: Add :c:func:`PyType_AddWatcher` and :c:func:`PyType_Watch` API to register callbacks to receive notification on changes to a type. (Contributed by Carl Meyer in :gh:`91051`.)
es: Agregado las API :c:func:`PyType_AddWatcher` y :c:func:`PyType_Watch` para registrar devoluciones de llamadas y recibir notificaciones sobre cambios en un tipo. (Aportado por Carl Meyer en :gh:`91051`.)

source: Add :c:func:`PyCode_AddWatcher` and :c:func:`PyCode_ClearWatcher` APIs to register callbacks to receive notification on creation and destruction of code objects. (Contributed by Itamar Oren in :gh:`91054`.)
es: Agregado las API :c:func:`PyCode_AddWatcher` y :c:func:`PyCode_ClearWatcher` para registrar devoluciones de llamadas y recibir notificaciones sobre la creación y destrucción de objetos de código. (Aportado por Itamar Oren en :gh:`91054`.)

source: Add :c:func:`PyFrame_GetVar` and :c:func:`PyFrame_GetVarString` functions to get a frame variable by its name. (Contributed by Victor Stinner in :gh:`91248`.)
es: Agregado las funciones :c:func:`PyFrame_GetVar` y :c:func:`PyFrame_GetVarString` para obtener una variable de marco por su nombre. (Aportado por Victor Stinner en :gh:`91248`.)

source: Add :c:func:`PyErr_GetRaisedException` and :c:func:`PyErr_SetRaisedException` for saving and restoring the current exception. These functions return and accept a single exception object, rather than the triple arguments of the now-deprecated :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore`. This is less error prone and a bit more efficient. (Contributed by Mark Shannon in :gh:`101578`.)
es: Agregado :c:func:`PyErr_GetRaisedException` y :c:func:`PyErr_SetRaisedException` para guardar y restaurar la excepción actual. Estas funciones devuelven y aceptan un único objeto de excepción, en lugar de los argumentos triples de los ahora obsoletos :c:func:`PyErr_Fetch` y :c:func:`PyErr_Restore`. Esto es menos propenso a errores y un poco más eficiente. (Aportado por Mark Shannon en :gh:`101578`.)

source: Add ``_PyErr_ChainExceptions1``, which takes an exception instance, to replace the legacy-API ``_PyErr_ChainExceptions``, which is now deprecated. (Contributed by Mark Shannon in :gh:`101578`.)
es: Agregado ``_PyErr_ChainExceptions1``, que toma una instancia de excepción, para reemplazar la API heredada ``_PyErr_ChainExceptions``, que ahora está en desuso. (Aportado por Mark Shannon en :gh:`101578`.)

source: Add :c:func:`PyException_GetArgs` and :c:func:`PyException_SetArgs` as convenience functions for retrieving and modifying the :attr:`~BaseException.args` passed to the exception's constructor. (Contributed by Mark Shannon in :gh:`101578`.)
es: Agregado :c:func:`PyException_GetArgs` y :c:func:`PyException_SetArgs` como funciones convenientes para recuperar y modificar el :attr:`~BaseException.args` pasado al constructor de la excepción. (Aportado por Mark Shannon en :gh:`101578`.)

source: Add :c:func:`PyErr_DisplayException`, which takes an exception instance, to replace the legacy-api :c:func:`!PyErr_Display`. (Contributed by Irit Katriel in :gh:`102755`).
es: Agregado :c:func:`PyErr_DisplayException`, que toma una instancia de excepción, para reemplazar la API heredada :c:func:`!PyErr_Display`. (Aportado por Irit Katriel en :gh:`102755`).
