Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: Remove ``wstr`` and ``wstr_length`` members from Unicode objects. It reduces object size by 8 or 16 bytes on 64bit platform. (:pep:`623`) (Contributed by Inada Naoki in :gh:`92536`.)
es: Elimine los miembros ``wstr`` y ``wstr_length`` de los objetos Unicode. Reduce el tamaño del objeto en 8 o 16 bytes en una plataforma de 64 bits. (:pep:`623`) (Aportado por Inada Naoki en :gh:`92536`.)

source: Add experimental support for using the BOLT binary optimizer in the build process, which improves performance by 1-5%. (Contributed by Kevin Modzelewski in :gh:`90536` and tuned by Donghee Na in :gh:`101525`)
es: Agregado soporte experimental para usar el optimizador binario BOLT en el proceso de compilación, lo que mejora el rendimiento entre un 1% y un 5%. (Contribuido por Kevin Modzelewski en :gh:`90536` y sintonizado por Donghee Na en :gh:`101525`)

source: Speed up the regular expression substitution (functions :func:`re.sub` and :func:`re.subn` and corresponding :class:`!re.Pattern` methods) for replacement strings containing group references by 2--3 times. (Contributed by Serhiy Storchaka in :gh:`91524`.)
es: Acelere la sustitución de expresiones regulares (funciones :func:`re.sub` y :func:`re.subn` y los métodos :class:`!re.Pattern` correspondientes) para cadenas de reemplazo que contienen referencias de grupo entre 2 y 3 veces. (Aportado por Serhiy Storchaka en :gh:`91524`.)

source: Speed up :class:`asyncio.Task` creation by deferring expensive string formatting. (Contributed by Itamar Oren in :gh:`103793`.)
es: Acelere la creación de :class:`asyncio.Task` aplazando el costoso formato de cadenas. (Aportado por Itamar Oren en :gh:`103793`.)

source: The :func:`tokenize.tokenize` and :func:`tokenize.generate_tokens` functions are up to 64% faster as a side effect of the changes required to cover :pep:`701` in the :mod:`tokenize` module. (Contributed by Marta Gómez Macías and Pablo Galindo in :gh:`102856`.)
es: Las funciones :func:`tokenize.tokenize` y :func:`tokenize.generate_tokens` son hasta un 64 % más rápidas como efecto secundario de los cambios necesarios para cubrir :pep:`701` en el módulo :mod:`tokenize`. (Aportado por Marta Gómez Macías y Pablo Galindo en :gh:`102856`.)

source: Speed up :func:`super` method calls and attribute loads via the new :opcode:`LOAD_SUPER_ATTR` instruction. (Contributed by Carl Meyer and Vladimir Matveev in :gh:`103497`.)
es: Acelere las llamadas al método :func:`super` y las cargas de atributos mediante la nueva instrucción :opcode:`LOAD_SUPER_ATTR`. (Contribución de Carl Meyer y Vladimir Matveev en :gh:`103497`.)

source: CPython bytecode changes
es: Cambios en el código de bytes de CPython

source: Remove the :opcode:`!LOAD_METHOD` instruction. It has been merged into :opcode:`LOAD_ATTR`. :opcode:`LOAD_ATTR` will now behave like the old :opcode:`!LOAD_METHOD` instruction if the low bit of its oparg is set. (Contributed by Ken Jin in :gh:`93429`.)
es: Elimine la instrucción :opcode:`!LOAD_METHOD`. Se ha fusionado con :opcode:`LOAD_ATTR`. :opcode:`LOAD_ATTR` ahora se comportará como la antigua instrucción :opcode:`!LOAD_METHOD` si el bit bajo de su oparg está configurado. (Contribuido por Ken Jin en :gh:`93429`.)

source: Remove the :opcode:`!JUMP_IF_FALSE_OR_POP` and :opcode:`!JUMP_IF_TRUE_OR_POP` instructions. (Contributed by Irit Katriel in :gh:`102859`.)
es: Elimine las instrucciones :opcode:`!JUMP_IF_FALSE_OR_POP` y :opcode:`!JUMP_IF_TRUE_OR_POP`. (Aportado por Irit Katriel en :gh:`102859`.)

source: Remove the :opcode:`!PRECALL` instruction. (Contributed by Mark Shannon in :gh:`92925`.)
es: Elimine la instrucción :opcode:`!PRECALL`. (Aportado por Mark Shannon en :gh:`92925`.)

source: Add the :opcode:`BINARY_SLICE` and :opcode:`STORE_SLICE` instructions. (Contributed by Mark Shannon in :gh:`94163`.)
es: Agregado las instrucciones :opcode:`BINARY_SLICE` y :opcode:`STORE_SLICE`. (Aportado por Mark Shannon en :gh:`94163`.)

source: Add the :opcode:`CALL_INTRINSIC_1` instructions. (Contributed by Mark Shannon in :gh:`99005`.)
es: Agregado las instrucciones :opcode:`CALL_INTRINSIC_1`. (Aportado por Mark Shannon en :gh:`99005`.)

source: Add the :opcode:`CALL_INTRINSIC_2` instruction. (Contributed by Irit Katriel in :gh:`101799`.)
es: Agregado la instrucción :opcode:`CALL_INTRINSIC_2`. (Aportado por Irit Katriel en :gh:`101799`.)

source: Add the :opcode:`CLEANUP_THROW` instruction. (Contributed by Brandt Bucher in :gh:`90997`.)
es: Agregado la instrucción :opcode:`CLEANUP_THROW`. (Aportado por Brandt Bucher en :gh:`90997`.)

source: Add the :opcode:`!END_SEND` instruction. (Contributed by Mark Shannon in :gh:`103082`.)
es: Agregado la instrucción :opcode:`!END_SEND`. (Aportado por Mark Shannon en :gh:`103082`.)

source: Add the :opcode:`LOAD_FAST_AND_CLEAR` instruction as part of the implementation of :pep:`709`. (Contributed by Carl Meyer in :gh:`101441`.)
es: Agregada la instrucción :opcode:`LOAD_FAST_AND_CLEAR` como parte de la implementación de :pep:`709`. (Aportado por Carl Meyer en :gh:`101441`.)

source: Add the :opcode:`LOAD_FAST_CHECK` instruction. (Contributed by Dennis Sweeney in :gh:`93143`.)
es: Agregado la instrucción :opcode:`LOAD_FAST_CHECK`. (Aportado por Dennis Sweeney en :gh:`93143`.)

source: Add the :opcode:`LOAD_FROM_DICT_OR_DEREF`, :opcode:`LOAD_FROM_DICT_OR_GLOBALS`, and :opcode:`LOAD_LOCALS` opcodes as part of the implementation of :pep:`695`. Remove the :opcode:`!LOAD_CLASSDEREF` opcode, which can be replaced with :opcode:`LOAD_LOCALS` plus :opcode:`LOAD_FROM_DICT_OR_DEREF`. (Contributed by Jelle Zijlstra in :gh:`103764`.)
es: Agregado los códigos de operación :opcode:`LOAD_FROM_DICT_OR_DEREF`, :opcode:`LOAD_FROM_DICT_OR_GLOBALS` y :opcode:`LOAD_LOCALS` como parte de la implementación de :pep:`695`. Elimine el código de operación :opcode:`!LOAD_CLASSDEREF`, que se puede reemplazar con :opcode:`LOAD_LOCALS` más :opcode:`LOAD_FROM_DICT_OR_DEREF`. (Aportado por Jelle Zijlstra en :gh:`103764`.)

source: Add the :opcode:`LOAD_SUPER_ATTR` instruction. (Contributed by Carl Meyer and Vladimir Matveev in :gh:`103497`.)
es: Agregado la instrucción :opcode:`LOAD_SUPER_ATTR`. (Contribución de Carl Meyer y Vladimir Matveev en :gh:`103497`.)

source: Add the :opcode:`RETURN_CONST` instruction. (Contributed by Wenyang Wang in :gh:`101632`.)
es: Agregado la instrucción :opcode:`RETURN_CONST`. (Aportado por Wenyang Wang en :gh:`101632`.)

source: Demos and Tools
es: Demostraciones y herramientas

source: Remove the ``Tools/demo/`` directory which contained old demo scripts. A copy can be found in the `old-demos project <https://github.com/gvanrossum/old-demos>`_. (Contributed by Victor Stinner in :gh:`97681`.)
es: Elimine el directorio ``Tools/demo/`` que contenía scripts de demostración antiguos. Se puede encontrar una copia en el `old-demos project <https://github.com/gvanrossum/old-demos>`_. (Aportado por Victor Stinner en :gh:`97681`.)

source: Remove outdated example scripts of the ``Tools/scripts/`` directory. A copy can be found in the `old-demos project <https://github.com/gvanrossum/old-demos>`_. (Contributed by Victor Stinner in :gh:`97669`.)
es: Elimine los scripts de ejemplo obsoletos del directorio ``Tools/scripts/``. Se puede encontrar una copia en el `old-demos project <https://github.com/gvanrossum/old-demos>`_. (Aportado por Victor Stinner en :gh:`97669`.)

source: Deprecated
es: Obsoleto

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction` are deprecated and will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`92248`.)
es: :mod:`argparse`: Los parámetros *type*, *choices* y *metavar* de :class:`!argparse.BooleanOptionalAction` están obsoletos y se eliminarán en 3.14. (Contribución de Nikita Sobolev en :gh:`92248`.)

source: :mod:`ast`: The following :mod:`ast` features have been deprecated in documentation since Python 3.8, now cause a :exc:`DeprecationWarning` to be emitted at runtime when they are accessed or used, and will be removed in Python 3.14:
es: :mod:`ast`: las siguientes características de :mod:`ast` han quedado obsoletas en la documentación desde Python 3.8, ahora provocan que se emita un :exc:`DeprecationWarning` en tiempo de ejecución cuando se accede a ellas o se usan, y se eliminarán en Python 3.14:

source: Use :class:`ast.Constant` instead. (Contributed by Serhiy Storchaka in :gh:`90953`.)
es: Utilice :class:`ast.Constant` en su lugar. (Aportado por Serhiy Storchaka en :gh:`90953`.)

source: The child watcher classes :class:`asyncio.MultiLoopChildWatcher`, :class:`asyncio.FastChildWatcher`, :class:`asyncio.AbstractChildWatcher` and :class:`asyncio.SafeChildWatcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
es: Las clases de vigilancia secundaria :class:`asyncio.MultiLoopChildWatcher`, :class:`asyncio.FastChildWatcher`, :class:`asyncio.AbstractChildWatcher` y :class:`asyncio.SafeChildWatcher` están en desuso y se eliminarán en Python 3.14. (Aportado por Kumar Aditya en :gh:`94597`.)

source: :func:`asyncio.set_child_watcher`, :func:`asyncio.get_child_watcher`, :meth:`asyncio.AbstractEventLoopPolicy.set_child_watcher` and :meth:`asyncio.AbstractEventLoopPolicy.get_child_watcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
es: :func:`asyncio.set_child_watcher`, :func:`asyncio.get_child_watcher`, :meth:`asyncio.AbstractEventLoopPolicy.set_child_watcher` y :meth:`asyncio.AbstractEventLoopPolicy.get_child_watcher` están en desuso y se eliminarán en Python 3.14. (Aportado por Kumar Aditya en :gh:`94597`.)

source: The :meth:`~asyncio.get_event_loop` method of the default event loop policy now emits a :exc:`DeprecationWarning` if there is no current event loop set and it decides to create one. (Contributed by Serhiy Storchaka and Guido van Rossum in :gh:`100160`.)
es: El método :meth:`~asyncio.get_event_loop` de la política de bucle de eventos predeterminada ahora emite un :exc:`DeprecationWarning` si no hay ningún bucle de eventos establecido y decide crear uno. (Contribución de Serhiy Storchaka y Guido van Rossum en :gh:`100160`.)

source: :mod:`calendar`: ``calendar.January`` and ``calendar.February`` constants are deprecated and replaced by :data:`calendar.JANUARY` and :data:`calendar.FEBRUARY`. (Contributed by Prince Roshan in :gh:`103636`.)
es: :mod:`calendar`: las constantes ``calendar.January`` y ``calendar.February`` están obsoletas y reemplazadas por :data:`calendar.JANUARY` y :data:`calendar.FEBRUARY`. (Aportado por el Príncipe Roshan en :gh:`103636`.)

source: :mod:`collections.abc`: Deprecated :class:`collections.abc.ByteString`. Prefer :class:`Sequence` or :class:`collections.abc.Buffer`. For use in typing, prefer a union, like ``bytes | bytearray``, or :class:`collections.abc.Buffer`. (Contributed by Shantanu Jain in :gh:`91896`.)
es: :mod:`collections.abc`: :class:`collections.abc.ByteString` en desuso. Prefiere :class:`Sequence` o :class:`collections.abc.Buffer`. Para usar al escribir, prefiera una unión, como ``bytes | bytearray`` o :class:`collections.abc.Buffer`. (Aportado por Shantanu Jain en :gh:`91896`.)

source: :mod:`datetime`: :class:`datetime.datetime`'s :meth:`~datetime.datetime.utcnow` and :meth:`~datetime.datetime.utcfromtimestamp` are deprecated and will be removed in a future version. Instead, use timezone-aware objects to represent datetimes in UTC: respectively, call :meth:`~datetime.datetime.now` and :meth:`~datetime.datetime.fromtimestamp` with the *tz* parameter set to :const:`datetime.UTC`. (Contributed by Paul Ganssle in :gh:`103857`.)
es: :mod:`datetime`: :meth:`~datetime.datetime.utcnow` y :meth:`~datetime.datetime.utcfromtimestamp` de :class:`datetime.datetime` están en desuso y se eliminarán en una versión futura. En su lugar, utilice objetos que tengan en cuenta la zona horaria para representar las fechas y horas en UTC: respectivamente, llame a :meth:`~datetime.datetime.now` y :meth:`~datetime.datetime.fromtimestamp` con el parámetro *tz* establecido en :const:`datetime.UTC`. (Aportado por Paul Ganssle en :gh:`103857`.)

source: :mod:`email`: Deprecate the *isdst* parameter in :func:`email.utils.localtime`. (Contributed by Alan Williams in :gh:`72346`.)
es: :mod:`email`: obsoleto el parámetro *isdst* en :func:`email.utils.localtime`. (Aportado por Alan Williams en :gh:`72346`.)

source: :mod:`importlib.abc`: Deprecated the following classes, scheduled for removal in Python 3.14:
es: :mod:`importlib.abc`: Obsoletas las siguientes clases, cuya eliminación está programada en Python 3.14:

source: Use :mod:`importlib.resources.abc` classes instead:
es: Utilice clases :mod:`importlib.resources.abc` en su lugar:

source: (Contributed by Jason R. Coombs and Hugo van Kemenade in :gh:`93963`.)
es: (Contribución de Jason R. Coombs y Hugo van Kemenade en :gh:`93963`.)

source: :mod:`itertools`: Deprecate the support for copy, deepcopy, and pickle operations, which is undocumented, inefficient, historically buggy, and inconsistent. This will be removed in 3.14 for a significant reduction in code volume and maintenance burden. (Contributed by Raymond Hettinger in :gh:`101588`.)
es: :mod:`itertools`: obsoleta la compatibilidad con operaciones de copia, copia profunda y pickle, que no está documentada, es ineficiente, históricamente tiene errores e inconsistente. Esto se eliminará en 3.14 para lograr una reducción significativa en el volumen de código y la carga de mantenimiento. (Aportado por Raymond Hettinger en :gh:`101588`.)

source: :mod:`multiprocessing`: In Python 3.14, the default :mod:`multiprocessing` start method will change to a safer one on Linux, BSDs, and other non-macOS POSIX platforms where ``'fork'`` is currently the default (:gh:`84559`). Adding a runtime warning about this was deemed too disruptive as the majority of code is not expected to care. Use the :func:`~multiprocessing.get_context` or :func:`~multiprocessing.set_start_method` APIs to explicitly specify when your code *requires* ``'fork'``. See :ref:`contexts and start methods <multiprocessing-start-methods>`.
es: :mod:`multiprocessing`: en Python 3.14, el método de inicio predeterminado de :mod:`multiprocessing` cambiará a uno más seguro en Linux, BSD y otras plataformas POSIX que no sean macOS donde ``'fork'`` es actualmente el predeterminado (:gh:`84559`). Agregar una advertencia de tiempo de ejecución sobre esto se consideró demasiado perjudicial ya que se espera que a la mayoría del código no le importe. Utilice las API :func:`~multiprocessing.get_context` o :func:`~multiprocessing.set_start_method` para especificar explícitamente cuándo su código *requires* ``'fork'``. Ver :ref:`contexts and start methods <multiprocessing-start-methods>`.

source: :mod:`pkgutil`: :func:`pkgutil.find_loader` and :func:`pkgutil.get_loader` are deprecated and will be removed in Python 3.14; use :func:`importlib.util.find_spec` instead. (Contributed by Nikita Sobolev in :gh:`97850`.)
es: :mod:`pkgutil`: :func:`pkgutil.find_loader` y :func:`pkgutil.get_loader` están en desuso y se eliminarán en Python 3.14; utilice :func:`importlib.util.find_spec` en su lugar. (Contribución de Nikita Sobolev en :gh:`97850`.)

source: :mod:`pty`: The module has two undocumented ``master_open()`` and ``slave_open()`` functions that have been deprecated since Python 2 but only gained a proper :exc:`DeprecationWarning` in 3.12. Remove them in 3.14. (Contributed by Soumendra Ganguly and Gregory P. Smith in :gh:`85984`.)
es: :mod:`pty`: el módulo tiene dos funciones ``master_open()`` y ``slave_open()`` no documentadas que han quedado obsoletas desde Python 2 pero que solo obtuvieron un :exc:`DeprecationWarning` adecuado en 3.12. Elimínelos en 3.14. (Aportado por Soumendra Ganguly y Gregory P. Smith en :gh:`85984`.)

source: The ``st_ctime`` fields return by :func:`os.stat` and :func:`os.lstat` on Windows are deprecated. In a future release, they will contain the last metadata change time, consistent with other platforms. For now, they still contain the creation time, which is also available in the new ``st_birthtime`` field. (Contributed by Steve Dower in :gh:`99726`.)
es: Los campos ``st_ctime`` devueltos por :func:`os.stat` y :func:`os.lstat` en Windows están en desuso. En una versión futura, contendrán la hora del último cambio de metadatos, de forma coherente con otras plataformas. Por ahora, todavía contienen la hora de creación, que también está disponible en el nuevo campo ``st_birthtime``. (Aportado por Steve Dower en :gh:`99726`.)

source: On POSIX platforms, :func:`os.fork` can now raise a :exc:`DeprecationWarning` when it can detect being called from a multithreaded process. There has always been a fundamental incompatibility with the POSIX platform when doing so. Even if such code *appeared* to work. We added the warning to to raise awareness as issues encounted by code doing this are becoming more frequent. See the :func:`os.fork` documentation for more details along with `this discussion on fork being incompatible with threads <https://discuss.python.org/t/33555>`_ for *why* we're now surfacing this longstanding platform compatibility problem to developers.
es: En plataformas POSIX, :func:`os.fork` ahora puede generar un :exc:`DeprecationWarning` cuando detecta una llamada desde un proceso multiproceso. Siempre ha habido una incompatibilidad fundamental con la plataforma POSIX al hacerlo. Incluso si dicho código *appeared* funciona. Agregamos la advertencia para crear conciencia, ya que los problemas encontrados por el código al hacer esto son cada vez más frecuentes. Consulte la documentación de :func:`os.fork` para obtener más detalles junto con `this discussion on fork being incompatible with threads <https://discuss.python.org/t/33555>`_ para *why*. Ahora estamos exponiendo a los desarrolladores este problema de compatibilidad de plataforma de larga data.

source: When this warning appears due to usage of :mod:`multiprocessing` or :mod:`concurrent.futures` the fix is to use a different :mod:`multiprocessing` start method such as ``"spawn"`` or ``"forkserver"``.
es: Cuando aparece esta advertencia debido al uso de :mod:`multiprocessing` o :mod:`concurrent.futures`, la solución es utilizar un método de inicio de :mod:`multiprocessing` diferente, como ``"spawn"`` o ``"forkserver"``.

source: :mod:`shutil`: The *onerror* argument of :func:`shutil.rmtree` is deprecated and will be removed in Python 3.14. Use *onexc* instead. (Contributed by Irit Katriel in :gh:`102828`.)
es: :mod:`shutil`: el argumento *onerror* de :func:`shutil.rmtree` está obsoleto y se eliminará en Python 3.14. Utilice *onexc* en su lugar. (Aportado por Irit Katriel en :gh:`102828`.)

source: :ref:`default adapters and converters <sqlite3-default-converters>` are now deprecated. Instead, use the :ref:`sqlite3-adapter-converter-recipes` and tailor them to your needs. (Contributed by Erlend E. Aasland in :gh:`90016`.)
es: :ref:`default adapters and converters <sqlite3-default-converters>` ahora están en desuso. En su lugar, utilice el :ref:`sqlite3-adapter-converter-recipes` y adáptelo a sus necesidades. (Aportado por Erlend E. Aasland en :gh:`90016`.)

source: In :meth:`~sqlite3.Cursor.execute`, :exc:`DeprecationWarning` is now emitted when :ref:`named placeholders <sqlite3-placeholders>` are used together with parameters supplied as a :term:`sequence` instead of as a :class:`dict`. Starting from Python 3.14, using named placeholders with parameters supplied as a sequence will raise a :exc:`~sqlite3.ProgrammingError`. (Contributed by Erlend E. Aasland in :gh:`101698`.)
es: En :meth:`~sqlite3.Cursor.execute`, :exc:`DeprecationWarning` ahora se emite cuando :ref:`named placeholders <sqlite3-placeholders>` se utiliza junto con los parámetros proporcionados como :term:`sequence` en lugar de como :class:`dict`. A partir de Python 3.14, el uso de marcadores de posición con nombre con parámetros proporcionados como una secuencia generará un :exc:`~sqlite3.ProgrammingError`. (Aportado por Erlend E. Aasland en :gh:`101698`.)

source: :mod:`sys`: The :data:`sys.last_type`, :data:`sys.last_value` and :data:`sys.last_traceback` fields are deprecated. Use :data:`sys.last_exc` instead. (Contributed by Irit Katriel in :gh:`102778`.)
es: :mod:`sys`: los campos :data:`sys.last_type`, :data:`sys.last_value` y :data:`sys.last_traceback` están en desuso. Utilice :data:`sys.last_exc` en su lugar. (Aportado por Irit Katriel en :gh:`102778`.)

source: :mod:`tarfile`: Extracting tar archives without specifying *filter* is deprecated until Python 3.14, when ``'data'`` filter will become the default. See :ref:`tarfile-extraction-filter` for details.
es: :mod:`tarfile`: la extracción de archivos tar sin especificar *filter* está en desuso hasta Python 3.14, cuando el filtro ``'data'`` se convertirá en el predeterminado. Consulte :ref:`tarfile-extraction-filter` para obtener más detalles.

source: :class:`typing.Hashable` and :class:`typing.Sized` aliases for :class:`collections.abc.Hashable` and :class:`collections.abc.Sized`. (:gh:`94309`.)
es: :class:`typing.Hashable` y :class:`typing.Sized` alias para :class:`collections.abc.Hashable` y :class:`collections.abc.Sized`. (:gh:`94309`.)

source: :class:`typing.ByteString`, deprecated since Python 3.9, now causes a :exc:`DeprecationWarning` to be emitted when it is used. (Contributed by Alex Waygood in :gh:`91896`.)
es: :class:`typing.ByteString`, en desuso desde Python 3.9, ahora provoca que se emita un :exc:`DeprecationWarning` cuando se utiliza. (Aportado por Alex Waygood en :gh:`91896`.)

source: :mod:`xml.etree.ElementTree`: The module now emits :exc:`DeprecationWarning` when testing the truth value of an :class:`xml.etree.ElementTree.Element`. Before, the Python implementation emitted :exc:`FutureWarning`, and the C implementation emitted nothing. (Contributed by Jacob Walls in :gh:`83122`.)
es: :mod:`xml.etree.ElementTree`: el módulo ahora emite :exc:`DeprecationWarning` al probar el valor de verdad de un :class:`xml.etree.ElementTree.Element`. Antes, la implementación de Python emitía :exc:`FutureWarning` y la implementación de C no emitía nada. (Aportado por Jacob Walls en :gh:`83122`.)

source: The 3-arg signatures (type, value, traceback) of :meth:`coroutine throw() <coroutine.throw>`, :meth:`generator throw() <generator.throw>` and :meth:`async generator throw() <agen.athrow>` are deprecated and may be removed in a future version of Python. Use the single-arg versions of these functions instead. (Contributed by Ofey Chan in :gh:`89874`.)
es: Las firmas de 3 argumentos (tipo, valor, rastreo) de :meth:`coroutine throw() <coroutine.throw>`, :meth:`generator throw() <generator.throw>` y :meth:`async generator throw() <agen.athrow>` están en desuso y es posible que se eliminen en una versión futura de Python. Utilice en su lugar las versiones de un solo argumento de estas funciones. (Aportado por Ofey Chan en :gh:`89874`.)

source: :exc:`DeprecationWarning` is now raised when ``__package__`` on a module differs from ``__spec__.parent`` (previously it was :exc:`ImportWarning`). (Contributed by Brett Cannon in :gh:`65961`.)
es: :exc:`DeprecationWarning` ahora se genera cuando ``__package__`` en un módulo difiere de ``__spec__.parent`` (anteriormente era :exc:`ImportWarning`). (Aportado por Brett Cannon en :gh:`65961`.)

source: Setting ``__package__`` or ``__cached__`` on a module is deprecated, and will cease to be set or taken into consideration by the import system in Python 3.14. (Contributed by Brett Cannon in :gh:`65961`.)
es: La configuración de ``__package__`` o ``__cached__`` en un módulo está obsoleta y el sistema de importación dejará de configurarla o tomarla en consideración en Python 3.14. (Aportado por Brett Cannon en :gh:`65961`.)
