Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: The bitwise inversion operator (``~``) on bool is deprecated. It will throw an error in Python 3.14. Use ``not`` for logical negation of bools instead. In the rare case that you really need the bitwise inversion of the underlying ``int``, convert to int explicitly: ``~int(x)``. (Contributed by Tim Hoffmann in :gh:`103487`.)
es: El operador de inversión bit a bit (``~``) en bool está en desuso. Lanzará un error en Python 3.14. Utilice ``not`` para la negación lógica de bools. En el raro caso de que realmente necesite la inversión bit a bit del ``int`` subyacente, lo convierte a int explícitamente: ``~int(x)``. (Aportado por Tim Hoffmann en :gh:`103487`.)

source: Accessing ``co_lnotab`` on code objects was deprecated in Python 3.10 via :pep:`626`, but it only got a proper :exc:`DeprecationWarning` in 3.12, therefore it will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`101866`.)
es: El acceso a ``co_lnotab`` en objetos de código quedó obsoleto en Python 3.10 a través de :pep:`626`, pero solo obtuvo un :exc:`DeprecationWarning` adecuado en 3.12, por lo que se eliminará en 3.14. (Aportado por Nikita Sobolev en :gh:`101866`.)

source: Pending Removal in Python 3.13
es: Eliminación pendiente en Python 3.13

source: The following modules and APIs have been deprecated in earlier Python releases, and will be removed in Python 3.13.
es: Los siguientes módulos y API quedaron obsoletos en versiones anteriores de Python y se eliminarán en Python 3.13.

source: Modules (see :pep:`594`):
es: Módulos (ver :pep:`594`):

source: Other modules:
es: Otros módulos:

source: :mod:`!lib2to3`, and the :program:`2to3` program (:gh:`84540`)
es: :mod:`!lib2to3` y el programa :program:`2to3` (:gh:`84540`)

source: :class:`classmethod` descriptor chaining (:gh:`89519`)
es: Encadenamiento de descriptores :class:`classmethod` (:gh:`89519`)

source: Pending Removal in Python 3.14
es: Eliminación pendiente en Python 3.14

source: The following APIs have been deprecated and will be removed in Python 3.14.
es: Las siguientes API han quedado obsoletas y se eliminarán en Python 3.14.

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction`
es: :mod:`argparse`: Los parámetros *type*, *choices* y *metavar* de :class:`!argparse.BooleanOptionalAction`

source: :mod:`email`: the *isdst* parameter in :func:`email.utils.localtime`.
es: :mod:`email`: el parámetro *isdst* en :func:`email.utils.localtime`.

source: :mod:`itertools`: Support for copy, deepcopy, and pickle operations.
es: :mod:`itertools`: soporte para operaciones de copia, copia profunda y pickle.

source: :mod:`shutil`: The *onerror* argument of :func:`shutil.rmtree`
es: :mod:`shutil`: El argumento *onerror* de :func:`shutil.rmtree`

source: :mod:`xml.etree.ElementTree`: Testing the truth value of an :class:`xml.etree.ElementTree.Element`.
es: :mod:`xml.etree.ElementTree`: Probando el valor de verdad de un :class:`xml.etree.ElementTree.Element`.

source: The ``__package__`` and ``__cached__`` attributes on module objects.
es: Los atributos ``__package__`` y ``__cached__`` en los objetos del módulo.

source: The ``co_lnotab`` attribute of code objects.
es: El atributo ``co_lnotab`` de los objetos de código.

source: Pending Removal in Future Versions
es: Eliminación pendiente en versiones futuras

source: The following APIs were deprecated in earlier Python versions and will be removed, although there is currently no date scheduled for their removal.
es: Las siguientes API quedaron obsoletas en versiones anteriores de Python y se eliminarán, aunque actualmente no hay una fecha programada para su eliminación.

source: :mod:`array`'s ``'u'`` format code (:gh:`57281`)
es: Código de formato ``'u'`` de :mod:`array` (:gh:`57281`)

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). A syntax warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In a future release it will be changed to a syntax error. (:gh:`87999`)
es: Actualmente, Python acepta literales numéricos seguidos inmediatamente de palabras clave, por ejemplo ``0in x``, ``1or x``, ``0if 1else 2``. Permite expresiones confusas y ambiguas como ``[0x1for x in y]`` (que puede interpretarse como ``[0x1 for x in y]`` o ``[0x1f or x in y]``). Se genera una advertencia de sintaxis si el literal numérico va seguido inmediatamente de una de las palabras clave :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` y :keyword:`or`. En una versión futura se cambiará a un error de sintaxis. (:gh:`87999`)

source: Removed
es: Eliminado

source: asynchat and asyncore
es: asynchat y asyncore

source: These two modules have been removed according to the schedule in :pep:`594`, having been deprecated in Python 3.6. Use :mod:`asyncio` instead. (Contributed by Nikita Sobolev in :gh:`96580`.)
es: Estos dos módulos se eliminaron según lo programado en :pep:`594` y quedaron obsoletos en Python 3.6. Utilice :mod:`asyncio` en su lugar. (Aportado por Nikita Sobolev en :gh:`96580`.)

source: Several names deprecated in the :mod:`configparser` way back in 3.2 have been removed per :gh:`89336`:
es: Varios nombres obsoletos en :mod:`configparser` en 3.2 se han eliminado según :gh:`89336`:

source: :class:`configparser.ParsingError` no longer has a ``filename`` attribute or argument. Use the ``source`` attribute and argument instead.
es: :class:`configparser.ParsingError` ya no tiene un atributo o argumento ``filename``. Utilice el atributo y el argumento ``source`` en su lugar.

source: :mod:`configparser` no longer has a ``SafeConfigParser`` class. Use the shorter :class:`~configparser.ConfigParser` name instead.
es: :mod:`configparser` ya no tiene una clase ``SafeConfigParser``. Utilice en su lugar el nombre :class:`~configparser.ConfigParser` más corto.

source: :class:`configparser.ConfigParser` no longer has a ``readfp`` method. Use :meth:`~configparser.ConfigParser.read_file` instead.
es: :class:`configparser.ConfigParser` ya no tiene un método ``readfp``. Utilice :meth:`~configparser.ConfigParser.read_file` en su lugar.

source: Remove the :py:mod:`!distutils` package. It was deprecated in Python 3.10 by :pep:`632` "Deprecate distutils module". For projects still using ``distutils`` and cannot be updated to something else, the ``setuptools`` project can be installed: it still provides ``distutils``. (Contributed by Victor Stinner in :gh:`92584`.)
es: Elimine el paquete :py:mod:`!distutils`. Quedó obsoleto en Python 3.10 por :pep:`632` "Módulo distutils obsoleto". Para proyectos que todavía usan ``distutils`` y no se pueden actualizar a otra cosa, se puede instalar el proyecto ``setuptools``: todavía proporciona ``distutils``. (Aportado por Victor Stinner en :gh:`92584`.)

source: Remove the bundled setuptools wheel from :mod:`ensurepip`, and stop installing setuptools in environments created by :mod:`venv`.
es: Retire la rueda de herramientas de configuración incluida en :mod:`ensurepip` y deje de instalar herramientas de configuración en entornos creados por :mod:`venv`.

source: ``pip (>= 22.1)`` does not require setuptools to be installed in the environment. ``setuptools``-based (and ``distutils``-based) packages can still be used with ``pip install``, since pip will provide ``setuptools`` in the build environment it uses for building a package.
es: ``pip (>= 22.1)`` no requiere la instalación de herramientas de configuración en el entorno. Los paquetes basados ​​en ``setuptools`` (y ``distutils``) aún se pueden usar con ``pip install``, ya que pip proporcionará ``setuptools`` en el entorno de compilación que utiliza para crear un paquete.

source: ``easy_install``, ``pkg_resources``, ``setuptools`` and ``distutils`` are no longer provided by default in environments created with ``venv`` or bootstrapped with ``ensurepip``, since they are part of the ``setuptools`` package. For projects relying on these at runtime, the ``setuptools`` project should be declared as a dependency and installed separately (typically, using pip).
es: ``easy_install``, ``pkg_resources``, ``setuptools`` y ``distutils`` ya no se proporcionan de forma predeterminada en entornos creados con ``venv`` o arrancados con ``ensurepip``, ya que forman parte del paquete ``setuptools``. Para proyectos que dependen de estos en tiempo de ejecución, el proyecto ``setuptools`` debe declararse como una dependencia e instalarse por separado (generalmente, usando pip).

source: (Contributed by Pradyun Gedam in :gh:`95299`.)
es: (Aportado por Pradyun Gedam en :gh:`95299`.)

source: Remove :mod:`enum`'s ``EnumMeta.__getattr__``, which is no longer needed for enum attribute access. (Contributed by Ethan Furman in :gh:`95083`.)
es: Elimine ``EnumMeta.__getattr__`` de :mod:`enum`, que ya no es necesario para acceder al atributo de enumeración. (Aportado por Ethan Furman en :gh:`95083`.)

source: Remove :mod:`ftplib`'s ``FTP_TLS.ssl_version`` class attribute: use the *context* parameter instead. (Contributed by Victor Stinner in :gh:`94172`.)
es: Elimine el atributo de clase ``FTP_TLS.ssl_version`` de :mod:`ftplib`: utilice el parámetro *context* en su lugar. (Aportado por Victor Stinner en :gh:`94172`.)

source: Remove the ``filename`` attribute of :mod:`gzip`'s :class:`gzip.GzipFile`, deprecated since Python 2.6, use the :attr:`~gzip.GzipFile.name` attribute instead. In write mode, the ``filename`` attribute added ``'.gz'`` file extension if it was not present. (Contributed by Victor Stinner in :gh:`94196`.)
es: Elimine el atributo ``filename`` del :class:`gzip.GzipFile` de :mod:`gzip`, en desuso desde Python 2.6; utilice el atributo :attr:`~gzip.GzipFile.name` en su lugar. En modo de escritura, el atributo ``filename`` agregaba la extensión de archivo ``'.gz'`` si no estaba presente. (Aportado por Victor Stinner en :gh:`94196`.)

source: Remove the pure Python implementation of :mod:`hashlib`'s :func:`hashlib.pbkdf2_hmac()`, deprecated in Python 3.10. Python 3.10 and newer requires OpenSSL 1.1.1 (:pep:`644`): this OpenSSL version provides a C implementation of :func:`~hashlib.pbkdf2_hmac()` which is faster. (Contributed by Victor Stinner in :gh:`94199`.)
es: Elimine la implementación pura de Python de :func:`hashlib.pbkdf2_hmac()` de :mod:`hashlib`, obsoleta en Python 3.10. Python 3.10 y versiones posteriores requieren OpenSSL 1.1.1 (:pep:`644`): esta versión de OpenSSL proporciona una implementación C de :func:`~hashlib.pbkdf2_hmac()` que es más rápida. (Aportado por Victor Stinner en :gh:`94199`.)

source: Many previously deprecated cleanups in :mod:`importlib` have now been completed:
es: Muchas limpiezas anteriormente obsoletas en :mod:`importlib` ahora se han completado:

source: References to, and support for :meth:`!module_repr()` has been removed. (Contributed by Barry Warsaw in :gh:`97850`.)
es: Se han eliminado las referencias y la compatibilidad con :meth:`!module_repr()`. (Aportado por Barry Varsovia en :gh:`97850`.)

source: ``importlib.util.set_package``, ``importlib.util.set_loader`` and ``importlib.util.module_for_loader`` have all been removed. (Contributed by Brett Cannon and Nikita Sobolev in :gh:`65961` and :gh:`97850`.)
es: Se han eliminado ``importlib.util.set_package``, ``importlib.util.set_loader`` y ``importlib.util.module_for_loader``. (Contribución de Brett Cannon y Nikita Sobolev en :gh:`65961` y :gh:`97850`.)

source: Support for ``find_loader()`` and ``find_module()`` APIs have been removed. (Contributed by Barry Warsaw in :gh:`98040`.)
es: Se eliminó la compatibilidad con las API ``find_loader()`` y ``find_module()``. (Aportado por Barry Varsovia en :gh:`98040`.)

source: ``importlib.abc.Finder``, ``pkgutil.ImpImporter``, and ``pkgutil.ImpLoader`` have been removed. (Contributed by Barry Warsaw in :gh:`98040`.)
es: Se han eliminado ``importlib.abc.Finder``, ``pkgutil.ImpImporter`` y ``pkgutil.ImpLoader``. (Aportado por Barry Varsovia en :gh:`98040`.)

source: The :mod:`!imp` module has been removed. (Contributed by Barry Warsaw in :gh:`98040`.)
es: Se ha eliminado el módulo :mod:`!imp`. (Aportado por Barry Varsovia en :gh:`98040`.)

source: To migrate, consult the following correspondence table:
es: Para migrar consulte la siguiente tabla de correspondencias:

source: Insert ``None`` into ``sys.path_importer_cache``
es: Inserta ``None`` en ``sys.path_importer_cache``

source: :attr:`importlib.machinery.SOURCE_SUFFIXES`, :attr:`importlib.machinery.EXTENSION_SUFFIXES`, and :attr:`importlib.machinery.BYTECODE_SUFFIXES`
es: :attr:`importlib.machinery.SOURCE_SUFFIXES`, :attr:`importlib.machinery.EXTENSION_SUFFIXES` y :attr:`importlib.machinery.BYTECODE_SUFFIXES`

source: *See below*
es: *Ver abajo*

source: Replace ``imp.load_source()`` with::
es: Reemplace ``imp.load_source()`` con::

source: Remove :mod:`!imp` functions and attributes with no replacements:
es: Elimine las funciones y atributos de :mod:`!imp` sin reemplazos:

source: Undocumented functions:
es: Funciones no documentadas:

source: ``imp.lock_held()``, ``imp.acquire_lock()``, ``imp.release_lock()``: the locking scheme has changed in Python 3.3 to per-module locks.
es: ``imp.lock_held()``, ``imp.acquire_lock()``, ``imp.release_lock()``: el esquema de bloqueo ha cambiado en Python 3.3 a bloqueos por módulo.

source: ``imp.find_module()`` constants: ``SEARCH_ERROR``, ``PY_SOURCE``, ``PY_COMPILED``, ``C_EXTENSION``, ``PY_RESOURCE``, ``PKG_DIRECTORY``, ``C_BUILTIN``, ``PY_FROZEN``, ``PY_CODERESOURCE``, ``IMP_HOOK``.
es: Constantes ``imp.find_module()``: ``SEARCH_ERROR``, ``PY_SOURCE``, ``PY_COMPILED``, ``C_EXTENSION``, ``PY_RESOURCE``, ``PKG_DIRECTORY``, ``C_BUILTIN``, ``PY_FROZEN``, ``PY_CODERESOURCE``, ``IMP_HOOK``.

source: Remove :mod:`io`'s ``io.OpenWrapper`` and ``_pyio.OpenWrapper``, deprecated in Python 3.10: just use :func:`open` instead. The :func:`open` (:func:`io.open`) function is a built-in function. Since Python 3.10, :func:`!_pyio.open` is also a static method. (Contributed by Victor Stinner in :gh:`94169`.)
es: Elimine ``io.OpenWrapper`` y ``_pyio.OpenWrapper`` de :mod:`io`, obsoletos en Python 3.10: simplemente use :func:`open` en su lugar. La función :func:`open` (:func:`io.open`) es una función incorporada. Desde Python 3.10, :func:`!_pyio.open` también es un método estático. (Aportado por Victor Stinner en :gh:`94169`.)

source: Remove :mod:`locale`'s :func:`!locale.format` function, deprecated in Python 3.7: use :func:`locale.format_string` instead. (Contributed by Victor Stinner in :gh:`94226`.)
es: Elimine la función :func:`!locale.format` de :mod:`locale`, obsoleta en Python 3.7: use :func:`locale.format_string` en su lugar. (Aportado por Victor Stinner en :gh:`94226`.)

source: ``smtpd``: The module has been removed according to the schedule in :pep:`594`, having been deprecated in Python 3.4.7 and 3.5.4. Use aiosmtpd_ PyPI module or any other :mod:`asyncio`-based server instead. (Contributed by Oleg Iarygin in :gh:`93243`.)
es: ``smtpd``: el módulo se eliminó según lo programado en :pep:`594`, ya que quedó obsoleto en Python 3.4.7 y 3.5.4. Utilice el módulo aiosmtpd_ PyPI o cualquier otro servidor basado en :mod:`asyncio`. (Contribución de Oleg Iarygin en :gh:`93243`.)

source: The following undocumented :mod:`sqlite3` features, deprecated in Python 3.10, are now removed:
es: Las siguientes características :mod:`sqlite3` no documentadas, obsoletas en Python 3.10, ahora se eliminan:

source: If a shared cache must be used, open the database in URI mode using the ``cache=shared`` query parameter.
es: Si se debe utilizar una caché compartida, abra la base de datos en modo URI utilizando el parámetro de consulta ``cache=shared``.

source: The ``sqlite3.OptimizedUnicode`` text factory has been an alias for :class:`str` since Python 3.3. Code that previously set the text factory to ``OptimizedUnicode`` can either use ``str`` explicitly, or rely on the default value which is also ``str``.
es: La fábrica de textos ``sqlite3.OptimizedUnicode`` ha sido un alias para :class:`str` desde Python 3.3. El código que previamente configuró la fábrica de texto en ``OptimizedUnicode`` puede usar ``str`` explícitamente o confiar en el valor predeterminado que también es ``str``.

source: (Contributed by Erlend E. Aasland in :gh:`92548`.)
es: (Aportado por Erlend E. Aasland en :gh:`92548`.)

source: Remove :mod:`ssl`'s :func:`!ssl.RAND_pseudo_bytes` function, deprecated in Python 3.6: use :func:`os.urandom` or :func:`ssl.RAND_bytes` instead. (Contributed by Victor Stinner in :gh:`94199`.)
es: Elimine la función :func:`!ssl.RAND_pseudo_bytes` de :mod:`ssl`, obsoleta en Python 3.6: use :func:`os.urandom` o :func:`ssl.RAND_bytes` en su lugar. (Aportado por Victor Stinner en :gh:`94199`.)

source: Remove the :func:`!ssl.match_hostname` function. It was deprecated in Python 3.7. OpenSSL performs hostname matching since Python 3.7, Python no longer uses the :func:`!ssl.match_hostname` function. (Contributed by Victor Stinner in :gh:`94199`.)
es: Elimine la función :func:`!ssl.match_hostname`. Quedó obsoleto en Python 3.7. OpenSSL realiza coincidencias de nombres de host desde Python 3.7, Python ya no usa la función :func:`!ssl.match_hostname`. (Aportado por Victor Stinner en :gh:`94199`.)

source: Remove the :func:`!ssl.wrap_socket` function, deprecated in Python 3.7: instead, create a :class:`ssl.SSLContext` object and call its :class:`ssl.SSLContext.wrap_socket` method. Any package that still uses :func:`!ssl.wrap_socket` is broken and insecure. The function neither sends a SNI TLS extension nor validates server hostname. Code is subject to `CWE-295 <https://cwe.mitre.org/data/definitions/295.html>`_: Improper Certificate Validation. (Contributed by Victor Stinner in :gh:`94199`.)
es: Elimine la función :func:`!ssl.wrap_socket`, obsoleta en Python 3.7: en su lugar, cree un objeto :class:`ssl.SSLContext` y llame a su método :class:`ssl.SSLContext.wrap_socket`. Cualquier paquete que todavía use :func:`!ssl.wrap_socket` está roto y es inseguro. La función no envía una extensión SNI TLS ni valida el nombre de host del servidor. El código está sujeto a `CWE-295 <https://cwe.mitre.org/data/definitions/295.html>`_: Validación de certificado incorrecta. (Aportado por Victor Stinner en :gh:`94199`.)

source: Remove many long-deprecated :mod:`unittest` features:
es: Elimine muchas características de :mod:`unittest` que están en desuso desde hace mucho tiempo:

source: A number of :class:`~unittest.TestCase` method aliases:
es: Varios alias del método :class:`~unittest.TestCase`:

source: Deprecated alias
es: Alias obsoleto

source: Method Name
es: Nombre del método

source: Deprecated in
es: En desuso en

source: You can use https://github.com/isidentical/teyit to automatically modernise your unit tests.
es: Puede utilizar https://github.com/isidentical/teyit para modernizar automáticamente sus pruebas unitarias.

source: Undocumented and broken :class:`~unittest.TestCase` method ``assertDictContainsSubset`` (deprecated in Python 3.2).
es: Método ``assertDictContainsSubset`` de :class:`~unittest.TestCase` indocumentado y roto (obsoleto en Python 3.2).

source: Undocumented :meth:`TestLoader.loadTestsFromModule <unittest.TestLoader.loadTestsFromModule>` parameter *use_load_tests* (deprecated and ignored since Python 3.2).
es: Parámetro :meth:`TestLoader.loadTestsFromModule <unittest.TestLoader.loadTestsFromModule>` no documentado *use_load_tests* (obsoleto e ignorado desde Python 3.2).

source: An alias of the :class:`~unittest.TextTestResult` class: ``_TextTestResult`` (deprecated in Python 3.2).
es: Un alias de la clase :class:`~unittest.TextTestResult`: ``_TextTestResult`` (obsoleto en Python 3.2).

source: (Contributed by Serhiy Storchaka in :gh:`89325`.)
es: (Contribución de Serhiy Storchaka en :gh:`89325`.)

source: Remove support for obsolete browsers from :mod:`webbrowser`. The removed browsers include: Grail, Mosaic, Netscape, Galeon, Skipstone, Iceape, Firebird, and Firefox versions 35 and below (:gh:`102871`).
es: Elimina la compatibilidad con navegadores obsoletos de :mod:`webbrowser`. Los navegadores eliminados incluyen: Grail, Mosaic, Netscape, Galeon, Skipstone, Iceape, Firebird y Firefox versiones 35 e inferiores (:gh:`102871`).

source: Remove the ``ElementTree.Element.copy()`` method of the pure Python implementation, deprecated in Python 3.10, use the :func:`copy.copy` function instead. The C implementation of :mod:`xml.etree.ElementTree` has no ``copy()`` method, only a ``__copy__()`` method. (Contributed by Victor Stinner in :gh:`94383`.)
es: Elimine el método ``ElementTree.Element.copy()`` de la implementación pura de Python, obsoleto en Python 3.10, use la función :func:`copy.copy` en su lugar. La implementación C de :mod:`xml.etree.ElementTree` no tiene ningún método ``copy()``, solo un método ``__copy__()``. (Aportado por Victor Stinner en :gh:`94383`.)

source: Remove :mod:`zipimport`'s ``find_loader()`` and ``find_module()`` methods, deprecated in Python 3.10: use the ``find_spec()`` method instead. See :pep:`451` for the rationale. (Contributed by Victor Stinner in :gh:`94379`.)
es: Elimine los métodos ``find_loader()`` y ``find_module()`` de :mod:`zipimport`, obsoletos en Python 3.10: use el método ``find_spec()`` en su lugar. Consulte :pep:`451` para conocer el fundamento. (Aportado por Victor Stinner en :gh:`94379`.)

source: Others
es: Otros

source: Remove the ``suspicious`` rule from the documentation :file:`Makefile` and :file:`Doc/tools/rstlint.py`, both in favor of `sphinx-lint <https://github.com/sphinx-contrib/sphinx-lint>`_. (Contributed by Julien Palard in :gh:`98179`.)
es: Elimine la regla ``suspicious`` de la documentación :file:`Makefile` y :file:`Doc/tools/rstlint.py`, ambas a favor de `sphinx-lint <https://github.com/sphinx-contrib/sphinx-lint>`_. (Contribución de Julien Palard en :gh:`98179`.)

source: Remove the *keyfile* and *certfile* parameters from the :mod:`ftplib`, :mod:`imaplib`, :mod:`poplib` and :mod:`smtplib` modules, and the *key_file*, *cert_file* and *check_hostname* parameters from the :mod:`http.client` module, all deprecated since Python 3.6. Use the *context* parameter (*ssl_context* in :mod:`imaplib`) instead. (Contributed by Victor Stinner in :gh:`94172`.)
es: Elimine los parámetros *keyfile* y *certfile* de los módulos :mod:`ftplib`, :mod:`imaplib`, :mod:`poplib` y :mod:`smtplib`, y los parámetros *key_file*, *cert_file* y *check_hostname* del módulo :mod:`http.client`, todos obsoletos desde Python 3.6. Utilice el parámetro *context* (*ssl_context* en :mod:`imaplib`) en su lugar. (Aportado por Victor Stinner en :gh:`94172`.)

source: Porting to Python 3.12
es: Portar a Python 3.12

source: This section lists previously described changes and other bugfixes that may require changes to your code.
es: Esta sección enumera los cambios descritos anteriormente y otras correcciones de errores que pueden requerir cambios en su código.

source: Changes in the Python API
es: Cambios en la API de Python
