Repository: python/python-docs-es
Catalog: whatsnew/3.12.po
Languages: es

source: Add :func:`inspect.markcoroutinefunction` to mark sync functions that return a :term:`coroutine` for use with :func:`inspect.iscoroutinefunction`. (Contributed Carlton Gibson in :gh:`99247`.)
es: Agregado :func:`inspect.markcoroutinefunction` para marcar las funciones de sincronización que devuelven un :term:`coroutine` para usar con :func:`inspect.iscoroutinefunction`. (Contribuyó Carlton Gibson en :gh:`99247`.)

source: Add :func:`inspect.getasyncgenstate` and :func:`inspect.getasyncgenlocals` for determining the current state of asynchronous generators. (Contributed by Thomas Krennwallner in :gh:`79940`.)
es: Agregado :func:`inspect.getasyncgenstate` y :func:`inspect.getasyncgenlocals` para determinar el estado actual de los generadores asíncronos. (Aportado por Thomas Krennwallner en :gh:`79940`.)

source: The performance of :func:`inspect.getattr_static` has been considerably improved. Most calls to the function should be at least 2x faster than they were in Python 3.11, and some may be 6x faster or more. (Contributed by Alex Waygood in :gh:`103193`.)
es: El rendimiento de :func:`inspect.getattr_static` se ha mejorado considerablemente. La mayoría de las llamadas a la función deberían ser al menos 2 veces más rápidas que en Python 3.11, y algunas pueden ser 6 veces más rápidas o más. (Contribuido por Alex Waygood en :gh:`103193`.)

source: Add :class:`itertools.batched()` for collecting into even-sized tuples where the last batch may be shorter than the rest. (Contributed by Raymond Hettinger in :gh:`98363`.)
es: Agregado :class:`itertools.batched()` para recopilar en tuplas de tamaño par donde el último lote puede ser más corto que el resto. (Aportado por Raymond Hettinger en :gh:`98363`.)

source: Add :func:`math.sumprod` for computing a sum of products. (Contributed by Raymond Hettinger in :gh:`100485`.)
es: Agregado :func:`math.sumprod` para calcular una suma de productos. (Aportado por Raymond Hettinger en :gh:`100485`.)

source: Extend :func:`math.nextafter` to include a *steps* argument for moving up or down multiple steps at a time. (By Matthias Goergens, Mark Dickinson, and Raymond Hettinger in :gh:`94906`.)
es: Se extendió :func:`math.nextafter` para incluir un argumento *steps* para subir o bajar varios pasos a la vez. (Por Matthias Goergens, Mark Dickinson y Raymond Hettinger en :gh:`94906`.)

source: Add :const:`os.PIDFD_NONBLOCK` to open a file descriptor for a process with :func:`os.pidfd_open` in non-blocking mode. (Contributed by Kumar Aditya in :gh:`93312`.)
es: Agregado :const:`os.PIDFD_NONBLOCK` para abrir un descriptor de archivo para un proceso con :func:`os.pidfd_open` en modo sin bloqueo. (Aportado por Kumar Aditya en :gh:`93312`.)

source: :class:`os.DirEntry` now includes an :meth:`os.DirEntry.is_junction` method to check if the entry is a junction. (Contributed by Charles Machalow in :gh:`99547`.)
es: :class:`os.DirEntry` ahora incluye un método :meth:`os.DirEntry.is_junction` para verificar si la entrada es un cruce. (Aportado por Charles Machalow en :gh:`99547`.)

source: Add :func:`os.listdrives`, :func:`os.listvolumes` and :func:`os.listmounts` functions on Windows for enumerating drives, volumes and mount points. (Contributed by Steve Dower in :gh:`102519`.)
es: Agregado funciones :func:`os.listdrives`, :func:`os.listvolumes` y :func:`os.listmounts` en Windows para enumerar unidades, volúmenes y puntos de montaje. (Aportado por Steve Dower en :gh:`102519`.)

source: :func:`os.stat` and :func:`os.lstat` are now more accurate on Windows. The ``st_birthtime`` field will now be filled with the creation time of the file, and ``st_ctime`` is deprecated but still contains the creation time (but in the future will return the last metadata change, for consistency with other platforms). ``st_dev`` may be up to 64 bits and ``st_ino`` up to 128 bits depending on your file system, and ``st_rdev`` is always set to zero rather than incorrect values. Both functions may be significantly faster on newer releases of Windows. (Contributed by Steve Dower in :gh:`99726`.)
es: :func:`os.stat` y :func:`os.lstat` ahora son más precisos en Windows. El campo ``st_birthtime`` ahora se completará con la hora de creación del archivo, y ``st_ctime`` está obsoleto pero aún contiene la hora de creación (pero en el futuro devolverá el último cambio de metadatos, para mantener la coherencia con otras plataformas). ``st_dev`` puede tener hasta 64 bits y ``st_ino`` hasta 128 bits dependiendo de su sistema de archivos, y ``st_rdev`` siempre está configurado en cero en lugar de valores incorrectos. Ambas funciones pueden ser significativamente más rápidas en las versiones más recientes de Windows. (Aportado por Steve Dower en :gh:`99726`.)

source: Add :func:`os.path.isjunction` to check if a given path is a junction. (Contributed by Charles Machalow in :gh:`99547`.)
es: Agregado :func:`os.path.isjunction` para verificar si una ruta determinada es un cruce. (Aportado por Charles Machalow en :gh:`99547`.)

source: Add :func:`os.path.splitroot` to split a path into a triad ``(drive, root, tail)``. (Contributed by Barney Gale in :gh:`101000`.)
es: Agregado :func:`os.path.splitroot` para dividir una ruta en una tríada ``(drive, root, tail)``. (Aportado por Barney Gale en :gh:`101000`.)

source: Add support for subclassing :class:`pathlib.PurePath` and :class:`pathlib.Path`, plus their Posix- and Windows-specific variants. Subclasses may override the :meth:`pathlib.PurePath.with_segments` method to pass information between path instances.
es: Agregado soporte para subclasificar :class:`pathlib.PurePath` y :class:`pathlib.Path`, además de sus variantes específicas de Posix y Windows. Las subclases pueden anular el método :meth:`pathlib.PurePath.with_segments` para pasar información entre instancias de ruta.

source: Add :meth:`pathlib.Path.walk` for walking the directory trees and generating all file or directory names within them, similar to :func:`os.walk`. (Contributed by Stanislav Zmiev in :gh:`90385`.)
es: Agregado :meth:`pathlib.Path.walk` para recorrer los árboles de directorios y generar todos los nombres de archivos o directorios dentro de ellos, similar a :func:`os.walk`. (Aportado por Stanislav Zmiev en :gh:`90385`.)

source: Add *walk_up* optional parameter to :meth:`pathlib.PurePath.relative_to` to allow the insertion of ``..`` entries in the result; this behavior is more consistent with :func:`os.path.relpath`. (Contributed by Domenico Ragusa in :gh:`84538`.)
es: Agregado el parámetro opcional *walk_up* a :meth:`pathlib.PurePath.relative_to` para permitir la inserción de entradas ``..`` en el resultado; este comportamiento es más consistente con :func:`os.path.relpath`. (Aportado por Domenico Ragusa en :gh:`84538`.)

source: Add :meth:`pathlib.Path.is_junction` as a proxy to :func:`os.path.isjunction`. (Contributed by Charles Machalow in :gh:`99547`.)
es: Agregado :meth:`pathlib.Path.is_junction` como proxy a :func:`os.path.isjunction`. (Aportado por Charles Machalow en :gh:`99547`.)

source: Add *case_sensitive* optional parameter to :meth:`pathlib.Path.glob`, :meth:`pathlib.Path.rglob` and :meth:`pathlib.PurePath.match` for matching the path's case sensitivity, allowing for more precise control over the matching process.
es: Agregado el parámetro opcional *case_sensitive* a :meth:`pathlib.Path.glob`, :meth:`pathlib.Path.rglob` y :meth:`pathlib.PurePath.match` para hacer coincidir la distinción entre mayúsculas y minúsculas de la ruta, lo que permite un control más preciso sobre el proceso de coincidencia.

source: pdb
es: pbd

source: Add convenience variables to hold values temporarily for debug session and provide quick access to values like the current frame or the return value. (Contributed by Tian Gao in :gh:`103693`.)
es: Agregado variables convenientes para mantener valores temporalmente para la sesión de depuración y proporcionar acceso rápido a valores como el marco actual o el valor de retorno. (Aportado por Tian Gao en :gh:`103693`.)

source: Add :func:`random.binomialvariate`. (Contributed by Raymond Hettinger in :gh:`81620`.)
es: Agregado :func:`random.binomialvariate`. (Aportado por Raymond Hettinger en :gh:`81620`.)

source: Add a default of ``lambd=1.0`` to :func:`random.expovariate`. (Contributed by Raymond Hettinger in :gh:`100234`.)
es: Agregado un valor predeterminado de ``lambd=1.0`` a :func:`random.expovariate`. (Aportado por Raymond Hettinger en :gh:`100234`.)

source: :func:`shutil.make_archive` now passes the *root_dir* argument to custom archivers which support it. In this case it no longer temporarily changes the current working directory of the process to *root_dir* to perform archiving. (Contributed by Serhiy Storchaka in :gh:`74696`.)
es: :func:`shutil.make_archive` ahora pasa el argumento *root_dir* a archivadores personalizados que lo admiten. En este caso, ya no cambia temporalmente el directorio de trabajo actual del proceso a *root_dir* para realizar el archivado. (Aportado por Serhiy Storchaka en :gh:`74696`.)

source: :func:`shutil.rmtree` now accepts a new argument *onexc* which is an error handler like *onerror* but which expects an exception instance rather than a *(typ, val, tb)* triplet. *onerror* is deprecated and will be removed in Python 3.14. (Contributed by Irit Katriel in :gh:`102828`.)
es: :func:`shutil.rmtree` ahora acepta un nuevo argumento *onexc* que es un controlador de errores como *onerror* pero que espera una instancia de excepción en lugar de un triplete *(typ, val, tb)*. *onerror* está en desuso y se eliminará en Python 3.14. (Aportado por Irit Katriel en :gh:`102828`.)

source: :func:`shutil.which` now consults the *PATHEXT* environment variable to find matches within *PATH* on Windows even when the given *cmd* includes a directory component. (Contributed by Charles Machalow in :gh:`103179`.)
es: :func:`shutil.which` ahora consulta la variable de entorno *PATHEXT* para encontrar coincidencias dentro de *PATH* en Windows incluso cuando el *cmd* dado incluye un componente de directorio. (Aportado por Charles Machalow en :gh:`103179`.)

source: :func:`shutil.which` will call ``NeedCurrentDirectoryForExePathW`` when querying for executables on Windows to determine if the current working directory should be prepended to the search path. (Contributed by Charles Machalow in :gh:`103179`.)
es: :func:`shutil.which` llamará a ``NeedCurrentDirectoryForExePathW`` cuando solicite ejecutables en Windows para determinar si el directorio de trabajo actual debe anteponerse a la ruta de búsqueda. (Aportado por Charles Machalow en :gh:`103179`.)

source: :func:`shutil.which` will return a path matching the *cmd* with a component from ``PATHEXT`` prior to a direct match elsewhere in the search path on Windows. (Contributed by Charles Machalow in :gh:`103179`.)
es: :func:`shutil.which` devolverá una ruta que coincida con *cmd* con un componente de ``PATHEXT`` antes de una coincidencia directa en otra parte de la ruta de búsqueda en Windows. (Aportado por Charles Machalow en :gh:`103179`.)

source: Add a :ref:`command-line interface <sqlite3-cli>`. (Contributed by Erlend E. Aasland in :gh:`77617`.)
es: Agregado un :ref:`command-line interface <sqlite3-cli>`. (Aportado por Erlend E. Aasland en :gh:`77617`.)

source: Add the :attr:`sqlite3.Connection.autocommit` attribute to :class:`sqlite3.Connection` and the *autocommit* parameter to :func:`sqlite3.connect` to control :pep:`249`-compliant :ref:`transaction handling <sqlite3-transaction-control-autocommit>`. (Contributed by Erlend E. Aasland in :gh:`83638`.)
es: Agregado el atributo :attr:`sqlite3.Connection.autocommit` a :class:`sqlite3.Connection` y el parámetro *autocommit* a :func:`sqlite3.connect` para controlar :ref:`transaction handling <sqlite3-transaction-control-autocommit>` compatible con :pep:`249`. (Aportado por Erlend E. Aasland en :gh:`83638`.)

source: Add *entrypoint* keyword-only parameter to :meth:`sqlite3.Connection.load_extension`, for overriding the SQLite extension entry point. (Contributed by Erlend E. Aasland in :gh:`103015`.)
es: Agregado el parámetro de solo palabra clave *entrypoint* a :meth:`sqlite3.Connection.load_extension`, para anular el punto de entrada de la extensión SQLite. (Aportado por Erlend E. Aasland en :gh:`103015`.)

source: Add :meth:`sqlite3.Connection.getconfig` and :meth:`sqlite3.Connection.setconfig` to :class:`sqlite3.Connection` to make configuration changes to a database connection. (Contributed by Erlend E. Aasland in :gh:`103489`.)
es: Agregado :meth:`sqlite3.Connection.getconfig` y :meth:`sqlite3.Connection.setconfig` a :class:`sqlite3.Connection` para realizar cambios de configuración en una conexión de base de datos. (Aportado por Erlend E. Aasland en :gh:`103489`.)

source: Extend :func:`statistics.correlation` to include as a ``ranked`` method for computing the Spearman correlation of ranked data. (Contributed by Raymond Hettinger in :gh:`95861`.)
es: Se extendió :func:`statistics.correlation` para incluirlo como método ``ranked`` para calcular la correlación de Spearman de datos clasificados. (Aportado por Raymond Hettinger en :gh:`95861`.)

source: Add the :mod:`sys.monitoring` namespace to expose the new :ref:`PEP 669 <whatsnew312-pep669>` monitoring API. (Contributed by Mark Shannon in :gh:`103082`.)
es: Agregado el espacio de nombres :mod:`sys.monitoring` para exponer la nueva API de supervisión :ref:`PEP 669 <whatsnew312-pep669>`. (Aportado por Mark Shannon en :gh:`103082`.)

source: Add :func:`sys.activate_stack_trampoline` and :func:`sys.deactivate_stack_trampoline` for activating and deactivating stack profiler trampolines, and :func:`sys.is_stack_trampoline_active` for querying if stack profiler trampolines are active. (Contributed by Pablo Galindo and Christian Heimes with contributions from Gregory P. Smith [Google] and Mark Shannon in :gh:`96123`.)
es: Agregado :func:`sys.activate_stack_trampoline` y :func:`sys.deactivate_stack_trampoline` para activar y desactivar los trampolines del perfilador de pila, y :func:`sys.is_stack_trampoline_active` para consultar si los trampolines del perfilador de pila están activos. (Contribuido por Pablo Galindo y Christian Heimes con contribuciones de Gregory P. Smith [Google] y Mark Shannon en :gh:`96123`.)

source: Add :data:`sys.last_exc` which holds the last unhandled exception that was raised (for post-mortem debugging use cases). Deprecate the three fields that have the same information in its legacy form: :data:`sys.last_type`, :data:`sys.last_value` and :data:`sys.last_traceback`. (Contributed by Irit Katriel in :gh:`102778`.)
es: Agregado :data:`sys.last_exc` que contiene la última excepción no controlada que se generó (para casos de uso de depuración post-mortem). Deje obsoletos los tres campos que tienen la misma información en su formato heredado: :data:`sys.last_type`, :data:`sys.last_value` y :data:`sys.last_traceback`. (Aportado por Irit Katriel en :gh:`102778`.)

source: :func:`sys._current_exceptions` now returns a mapping from thread-id to an exception instance, rather than to a ``(typ, exc, tb)`` tuple. (Contributed by Irit Katriel in :gh:`103176`.)
es: :func:`sys._current_exceptions` ahora devuelve una asignación de thread-id a una instancia de excepción, en lugar de a una tupla ``(typ, exc, tb)``. (Aportado por Irit Katriel en :gh:`103176`.)

source: :func:`sys.setrecursionlimit` and :func:`sys.getrecursionlimit`. The recursion limit now applies only to Python code. Builtin functions do not use the recursion limit, but are protected by a different mechanism that prevents recursion from causing a virtual machine crash.
es: :func:`sys.setrecursionlimit` y :func:`sys.getrecursionlimit`. El límite de recursividad ahora se aplica sólo al código Python. Las funciones integradas no utilizan el límite de recursividad, pero están protegidas por un mecanismo diferente que evita que la recursividad provoque un fallo de la máquina virtual.

source: The :class:`tempfile.NamedTemporaryFile` function has a new optional parameter *delete_on_close* (Contributed by Evgeny Zorin in :gh:`58451`.)
es: La función :class:`tempfile.NamedTemporaryFile` tiene un nuevo parámetro opcional *delete_on_close* (Aportado por Evgeny Zorin en :gh:`58451`.)

source: :func:`tempfile.mkdtemp` now always returns an absolute path, even if the argument provided to the *dir* parameter is a relative path.
es: :func:`tempfile.mkdtemp` ahora siempre devuelve una ruta absoluta, incluso si el argumento proporcionado al parámetro *dir* es una ruta relativa.

source: Add :func:`threading.settrace_all_threads` and :func:`threading.setprofile_all_threads` that allow to set tracing and profiling functions in all running threads in addition to the calling one. (Contributed by Pablo Galindo in :gh:`93503`.)
es: Agregado :func:`threading.settrace_all_threads` y :func:`threading.setprofile_all_threads` que permiten configurar funciones de seguimiento y creación de perfiles en todos los hilos en ejecución además del que realiza la llamada. (Aportado por Pablo Galindo en :gh:`93503`.)

source: ``tkinter.Canvas.coords()`` now flattens its arguments. It now accepts not only coordinates as separate arguments (``x1, y1, x2, y2, ...``) and a sequence of coordinates (``[x1, y1, x2, y2, ...]``), but also coordinates grouped in pairs (``(x1, y1), (x2, y2), ...`` and ``[(x1, y1), (x2, y2), ...]``), like ``create_*()`` methods. (Contributed by Serhiy Storchaka in :gh:`94473`.)
es: ``tkinter.Canvas.coords()`` ahora aplana sus argumentos. Ahora acepta no sólo coordenadas como argumentos separados (``x1, y1, x2, y2, ...``) y una secuencia de coordenadas (``[x1, y1, x2, y2, ...]``), sino también coordenadas agrupadas en pares (``(x1, y1), (x2, y2), ...`` y ``[(x1, y1), (x2, y2), ...]``), como los métodos ``create_*()``. (Aportado por Serhiy Storchaka en :gh:`94473`.)

source: The :mod:`tokenize` module includes the changes introduced in :pep:`701`. (Contributed by Marta Gómez Macías and Pablo Galindo in :gh:`102856`.) See :ref:`whatsnew312-porting-to-python312` for more information on the changes to the :mod:`tokenize` module.
es: El módulo :mod:`tokenize` incluye los cambios introducidos en :pep:`701`. (Aportado por Marta Gómez Macías y Pablo Galindo en :gh:`102856`.) Consulte :ref:`whatsnew312-porting-to-python312` para obtener más información sobre los cambios en el módulo :mod:`tokenize`.

source: Add :func:`types.get_original_bases` to allow for further introspection of :ref:`user-defined-generics` when subclassed. (Contributed by James Hilton-Balfe and Alex Waygood in :gh:`101827`.)
es: Agregado :func:`types.get_original_bases` para permitir una mayor introspección de :ref:`user-defined-generics` cuando esté subclasificado. (Contribución de James Hilton-Balfe y Alex Waygood en :gh:`101827`.)

source: :func:`isinstance` checks against :func:`runtime-checkable protocols <typing.runtime_checkable>` now use :func:`inspect.getattr_static` rather than :func:`hasattr` to lookup whether attributes exist. This means that descriptors and :meth:`~object.__getattr__` methods are no longer unexpectedly evaluated during ``isinstance()`` checks against runtime-checkable protocols. However, it may also mean that some objects which used to be considered instances of a runtime-checkable protocol may no longer be considered instances of that protocol on Python 3.12+, and vice versa. Most users are unlikely to be affected by this change. (Contributed by Alex Waygood in :gh:`102433`.)
es: Las comprobaciones de :func:`isinstance` con :func:`runtime-checkable protocols <typing.runtime_checkable>` ahora usan :func:`inspect.getattr_static` en lugar de :func:`hasattr` para buscar si existen atributos. Esto significa que los descriptores y los métodos :meth:`~object.__getattr__` ya no se evalúan inesperadamente durante las comprobaciones de ``isinstance()`` con protocolos verificables en tiempo de ejecución. Sin embargo, también puede significar que algunos objetos que solían considerarse instancias de un protocolo verificable en tiempo de ejecución ya no se consideran instancias de ese protocolo en Python 3.12+, y viceversa. Es poco probable que la mayoría de los usuarios se vean afectados por este cambio. (Contribuido por Alex Waygood en :gh:`102433`.)

source: The members of a runtime-checkable protocol are now considered "frozen" at runtime as soon as the class has been created. Monkey-patching attributes onto a runtime-checkable protocol will still work, but will have no impact on :func:`isinstance` checks comparing objects to the protocol. For example::
es: Los miembros de un protocolo verificable en tiempo de ejecución ahora se consideran "congelados" en tiempo de ejecución tan pronto como se crea la clase. La aplicación de parches de atributos en un protocolo verificable en tiempo de ejecución seguirá funcionando, pero no tendrá ningún impacto en las comprobaciones :func:`isinstance` que comparan objetos con el protocolo. Por ejemplo::

source: This change was made in order to speed up ``isinstance()`` checks against runtime-checkable protocols.
es: Este cambio se realizó para acelerar las comprobaciones de ``isinstance()`` en protocolos verificables en tiempo de ejecución.

source: The performance profile of :func:`isinstance` checks against :func:`runtime-checkable protocols <typing.runtime_checkable>` has changed significantly. Most ``isinstance()`` checks against protocols with only a few members should be at least 2x faster than in 3.11, and some may be 20x faster or more. However, ``isinstance()`` checks against protocols with fourteen or more members may be slower than in Python 3.11. (Contributed by Alex Waygood in :gh:`74690` and :gh:`103193`.)
es: El perfil de rendimiento de las comprobaciones de :func:`isinstance` frente a :func:`runtime-checkable protocols <typing.runtime_checkable>` ha cambiado significativamente. La mayoría de las comprobaciones de ``isinstance()`` en protocolos con solo unos pocos miembros deberían ser al menos 2 veces más rápidas que en 3.11, y algunas pueden ser 20 veces más rápidas o más. Sin embargo, las comprobaciones de ``isinstance()`` con protocolos con catorce o más miembros pueden ser más lentas que en Python 3.11. (Contribuido por Alex Waygood en :gh:`74690` y :gh:`103193`.)

source: All :data:`typing.TypedDict` and :data:`typing.NamedTuple` classes now have the ``__orig_bases__`` attribute. (Contributed by Adrian Garcia Badaracco in :gh:`103699`.)
es: Todas las clases :data:`typing.TypedDict` y :data:`typing.NamedTuple` ahora tienen el atributo ``__orig_bases__``. (Aportado por Adrián García Badaracco en :gh:`103699`.)

source: Add ``frozen_default`` parameter to :func:`typing.dataclass_transform`. (Contributed by Erik De Bonte in :gh:`99957`.)
es: Agregado el parámetro ``frozen_default`` a :func:`typing.dataclass_transform`. (Aportado por Erik De Bonte en :gh:`99957`.)

source: The Unicode database has been updated to version 15.0.0. (Contributed by Benjamin Peterson in :gh:`96734`).
es: La base de datos Unicode se ha actualizado a la versión 15.0.0. (Aportado por Benjamin Peterson en :gh:`96734`).

source: Add a ``--durations`` command line option, showing the N slowest test cases::
es: Agregado una opción de línea de comando ``--durations``, que muestra los N casos de prueba más lentos:

source: (Contributed by Giampaolo Rodola in :gh:`48330`)
es: (Aportado por Giampaolo Rodola en :gh:`48330`)

source: Add a :ref:`command-line interface <uuid-cli>`. (Contributed by Adam Chhina in :gh:`88597`.)
es: Agregado un :ref:`command-line interface <uuid-cli>`. (Aportado por Adam Chhina en :gh:`88597`.)

source: Optimizations
es: Optimizaciones
