Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: The :class:`threading.Thread` constructor now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag value from the parent thread (:issue:`6064`).
es: El constructor de la clase :class:`threading.Thread` ahora acepta un argumento de palabra clave ``daemon`` para anular el comportamiento predeterminado de heredar el valor del indicador ``daemon`` desde el hilo principal (:issue:`6064`).

source: The formerly private function ``_thread.get_ident`` is now available as the public function :func:`threading.get_ident`. This eliminates several cases of direct access to the ``_thread`` module in the stdlib. Third party code that used ``_thread.get_ident`` should likewise be changed to use the new public interface.
es: La función anteriormente privada ``_thread.get_ident`` ahora está disponible como función pública :func:`threading.get_ident`. Ésto elimina varios casos de acceso directo al módulo ``_thread`` en el stdlib. El código de terceros que usaba ``_thread.get_ident`` debería de igual forma ser cambiado para usar la nueva interfaz pública.

source: The :pep:`418` added new functions to the :mod:`time` module:
es: El :pep:`418` agrega nuevas funciones al módulo :mod:`time`:

source: :func:`~time.get_clock_info`: Get information on a clock.
es: :func:`~time.get_clock_info`: Obtiene información en un reloj.

source: :func:`~time.monotonic`: Monotonic clock (cannot go backward), not affected by system clock updates.
es: :func:`~time.monotonic`: Reloj monotónico (no se puede retroceder), no se ve afectado por la actualización del reloj del sistema.

source: :func:`~time.perf_counter`: Performance counter with the highest available resolution to measure a short duration.
es: :func:`~time.perf_counter`: Contador de rendimiento con la más alta resolución disponible para medir una corta duración.

source: :func:`~time.process_time`: Sum of the system and user CPU time of the current process.
es: :func:`~time.process_time`: Suma del tiempo de CPU del sistema y del usuario del proceso actual.

source: Other new functions:
es: Otras nuevas funciones:

source: :func:`~time.clock_getres`, :func:`~time.clock_gettime` and :func:`~time.clock_settime` functions with :samp:`CLOCK_{xxx}` constants. (Contributed by Victor Stinner in :issue:`10278`.)
es: Las funciones :func:`~time.clock_getres`, :func:`~time.clock_gettime` y :func:`~time.clock_settime` con constantes :samp:`CLOCK_{xxx}` (Contribución de Victor Stinner in :issue:`10278`.)

source: To improve cross platform consistency, :func:`~time.sleep` now raises a :exc:`ValueError` when passed a negative sleep value. Previously this was an error on posix, but produced an infinite sleep on Windows.
es: Para mejorar la consistencia entre plataformas, la función :func:`~time.sleep` ahora lanza un :exc:`ValueError` cuando se le pasa un valor negativo. Esto era anteriormente un error en posix, pero producía una suspensión definitiva en windows.

source: Add a new :class:`types.MappingProxyType` class: Read-only proxy of a mapping. (:issue:`14386`)
es: Adición de una nueva clase :class:`types.MappingProxyType`: Proxy de solo lectura de una asignación. (:issue:`14386`)

source: The new functions :func:`types.new_class` and :func:`types.prepare_class` provide support for :pep:`3115` compliant dynamic type creation. (:issue:`14588`)
es: Las nuevas funciones :func:`types.new_class` y :func:`types.prepare_class` proporcionan soporte para la creación de tipos dinámicos compatibles. (:issue:`14588`)

source: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns`, and :meth:`.assertWarnsRegex` now accept a keyword argument *msg* when used as context managers. (Contributed by Ezio Melotti and Winston Ewert in :issue:`10775`.)
es: Los métodos :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns`, y :meth:`.assertWarnsRegex` ahora aceptan un argumento de palabra clave *msg* cuando son usados como administradores de contexto. (Contribución por Ezio Melotti y Winston Ewert en :issue:`10775`.)

source: :meth:`unittest.TestCase.run` now returns the :class:`~unittest.TestResult` object.
es: :meth:`unittest.TestCase.run` ahora retorna el objeto :class:`~unittest.TestResult`.

source: The :class:`~urllib.request.Request` class, now accepts a *method* argument used by :meth:`~urllib.request.Request.get_method` to determine what HTTP method should be used. For example, this will send a ``'HEAD'`` request::
es: La clase :class:`~urllib.request.Request` ahora acepta un argumento *method* usado por :meth:`~urllib.request.Request.get_method` para determinar que método HTTP debería usarse. Por ejemplo, esto enviará una solicitud ``'HEAD'``::

source: The :mod:`webbrowser` module supports more "browsers": Google Chrome (named :program:`chrome`, :program:`chromium`, :program:`chrome-browser` or :program:`chromium-browser` depending on the version and operating system), and the generic launchers :program:`xdg-open`, from the FreeDesktop.org project, and :program:`gvfs-open`, which is the default URI handler for GNOME 3. (The former contributed by Arnaud Calmettes in :issue:`13620`, the latter by Matthias Klose in :issue:`14493`.)
es: El módulo :mod:`webbrowser` admite más "navegadores": Google Chrome (llamado :program:`chrome`, :program:`chromium`, :program:`chrome-browser` or :program:`chromium-browser` dependiendo de la versión y del sistema operativo), y los lanzadores genéricos :program:`xdg-open`, del proyecto FreeDesktop.org, y :program:`gvfs-open`, el cual es el controlador URI predeterminado para GNOME3. (El primero agregado por Arnaud Calmettes en :issue:`13620`, el segundo por Matthias Klose en :issue:`14493`.)

source: The :mod:`xml.etree.ElementTree` module now imports its C accelerator by default; there is no longer a need to explicitly import :mod:`xml.etree.cElementTree` (this module stays for backwards compatibility, but is now deprecated). In addition, the ``iter`` family of methods of :class:`~xml.etree.ElementTree.Element` has been optimized (rewritten in C). The module's documentation has also been greatly improved with added examples and a more detailed reference.
es: El módulo :mod:`xml.etree.ElementTree` ahora importa su acelerador C predeterminado, ya no es necesario importar explícitamente :mod:`xml.etree.cElementTree` (Éste módulo permanece para compatibilidad con versiones anteriores, pero ya está obsoleto). Además, la familia de métodos ``iter`` de :class:`~xml.etree.ElementTree.Element` se ha optimizado (Reescrito en C). La documentación del módulo también se ha mejorado mucho, con ejemplos agregados y una referencia más detallada.

source: New attribute :attr:`zlib.Decompress.eof` makes it possible to distinguish between a properly formed compressed stream and an incomplete or truncated one. (Contributed by Nadeem Vawda in :issue:`12646`.)
es: El nuevo atributo :attr:`zlib.Decompress.eof` permite distinguir entre un flujo comprimido correctamente formado y uno incompleto o truncado. (Aportado por Nadeem Vawda en :issue:`12646`.)

source: New attribute :const:`zlib.ZLIB_RUNTIME_VERSION` reports the version string of the underlying ``zlib`` library that is loaded at runtime. (Contributed by Torsten Landschoff in :issue:`12306`.)
es: Nuevo atributo :const:`zlib.ZLIB_RUNTIME_VERSION` informa la cadena de versión de la biblioteca ``zlib`` subyacente que se carga en tiempo de ejecución. (Contribución de Torsten Landschoff en :issue:`12306`.)

source: Optimizations
es: Optimizaciones

source: Major performance enhancements have been added:
es: Se han agregado importantes mejoras de rendimiento:

source: Thanks to :pep:`393`, some operations on Unicode strings have been optimized:
es: Gracias a :pep:`393`, algunas operaciones en las cadenas *Unicode* han sido optimizadas:

source: the memory footprint is divided by 2 to 4 depending on the text
es: la huella de memoria se divide de 2 a 4 según el texto

source: encode an ASCII string to UTF-8 doesn't need to encode characters anymore, the UTF-8 representation is shared with the ASCII representation
es: codificar una cadena ASCII a UTF-8 ya no necesita codificar caracteres, la representación UTF-8 se comparte con la representación ASCII

source: the UTF-8 encoder has been optimized
es: el codificador UTF-8 ha sido optimizado

source: repeating a single ASCII letter and getting a substring of an ASCII string is 4 times faster
es: repetir una única letra ASCII y obtener una subcadena de una cadena ASCII es 4 veces más rápido

source: UTF-8 is now 2x to 4x faster. UTF-16 encoding is now up to 10x faster.
es: UTF-8 ahora es 2x a 4x más rápido. La codificación UTF-16 ahora es 10x más rápida.

source: (Contributed by Serhiy Storchaka, :issue:`14624`, :issue:`14738` and :issue:`15026`.)
es: (Contribución de Serhiy Storchaka, :issue:`14624`, :issue:`14738` y :issue:`15026`.)

source: Build and C API Changes
es: Construcción y cambios en la API de C

source: Changes to Python's build process and to the C API include:
es: Los cambios en el proceso de compilación de Python y en la API de C incluyen:

source: New :pep:`3118` related function:
es: Nueva función relacionada con :pep:`3118`:

source: :pep:`393` added new Unicode types, macros and functions:
es: :pep:`393` Agregó nuevos tipos *unicode*, macros y funciones:

source: High-level API:
es: API de alto nivel:

source: Low-level API:
es: API de bajo nivel:

source: :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4` types
es: Tipos :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4`

source: :c:type:`PyASCIIObject` and :c:type:`PyCompactUnicodeObject` structures
es: Estructuras :c:type:`PyASCIIObject` y :c:type:`PyCompactUnicodeObject`

source: :c:macro:`PyUnicode_KIND` with :c:enum:`PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`
es: :c:macro:`PyUnicode_KIND` con :c:enum:`PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`

source: :c:macro:`PyArg_ParseTuple` now accepts a :class:`bytearray` for the ``c`` format (:issue:`12380`).
es: :c:macro:`PyArg_ParseTuple` ahora acepta un :class:`bytearray` para el formato ``c`` (:issue:`12380`).

source: Deprecated
es: Obsoleto

source: Unsupported Operating Systems
es: Sistemas operativos no compatibles

source: OS/2 and VMS are no longer supported due to the lack of a maintainer.
es: OS/2 y VMS no son compatibles debido a la falta de un responsable de mantenimiento.

source: Windows 2000 and Windows platforms which set ``COMSPEC`` to ``command.com`` are no longer supported due to maintenance burden.
es: Windows 2000 y las plataformas windows que establezcan ``COMSPEC`` a ``command.com`` ya no son compatibles debido a la carga de mantenimiento.

source: OSF support, which was deprecated in 3.2, has been completely removed.
es: La compatibilidad con OSF, que quedó obsoleta en 3.2, ha sido completamente eliminada.

source: Deprecated Python modules, functions and methods
es: Módulos , funciones y métodos obsoletos en Python

source: Passing a non-empty string to ``object.__format__()`` is deprecated, and will produce a :exc:`TypeError` in Python 3.4 (:issue:`9856`).
es: Pasar una cadena no vacía a ``object.__format__()`` está descontinuado, y producirá un :exc:`TypeError` en Python 3.4 (:issue:`9856`).

source: The ``unicode_internal`` codec has been deprecated because of the :pep:`393`, use UTF-8, UTF-16 (``utf-16-le`` or ``utf-16-be``), or UTF-32 (``utf-32-le`` or ``utf-32-be``)
es: El códec ``unicode_internal`` quedó obsoleto a causa del :pep:`393`, use UTF-8, UTF-16 (``utf-16-le`` o ``utf-16-be``), o UTF-32 (``utf-32-le`` or ``utf-32-be``)

source: :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`
es: :meth:`ftplib.FTP.nlst` y :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`

source: :func:`platform.popen`: use the :mod:`subprocess` module. Check especially the :ref:`subprocess-replacements` section (:issue:`11377`).
es: :func:`platform.popen`: use el módulo :mod:`subprocess`. Verifique especialmente la sección :ref:`subprocess-replacements` (:issue:`11377`).

source: :issue:`13374`: The Windows bytes API has been deprecated in the :mod:`os` module. Use Unicode filenames, instead of bytes filenames, to not depend on the ANSI code page anymore and to support any filename.
es: :issue:`13374`: La API de *bytes* de Windows ha sido descontinuada en el módulo :mod:`os`. Use nombres de archivo *Unicode*, en vez de nombres de archivo de bytes, para no depender más de la página de códigos ANSI y admitir cualquier nombre de archivo.

source: :issue:`13988`: The :mod:`xml.etree.cElementTree` module is deprecated. The accelerator is used automatically whenever available.
es: :issue:`13988`: El módulo :mod:`xml.etree.cElementTree` ha quedado obsoleto. El acelerador se utiliza automáticamente siempre que esté disponible.

source: The behaviour of :func:`time.clock` depends on the platform: use the new :func:`time.perf_counter` or :func:`time.process_time` function instead, depending on your requirements, to have a well defined behaviour.
es: El comportamiento de :func:`time.clock` depende de la plataforma: utilice la nueva función :func:`time.perf_counter` o :func:`time.process_time` en su lugar, dependiendo de sus requerimientos, para tener un comportamiento bien definido.

source: The :func:`os.stat_float_times` function is deprecated.
es: La función :func:`os.stat_float_times` ha quedado obsoleta.

source: :mod:`importlib` package:
es: paquete :mod:`importlib`:

source: :meth:`importlib.abc.SourceLoader.path_mtime` is now deprecated in favour of :meth:`importlib.abc.SourceLoader.path_stats` as bytecode files now store both the modification time and size of the source file the bytecode file was compiled from.
es: :meth:`importlib.abc.SourceLoader.path_mtime` ha quedado obsoleto, a favor de :meth:`importlib.abc.SourceLoader.path_stats` ya que los archivos de código de *bytes* ahora almacenan tanto la hora de modificación como el tamaño del archivo fuente desde el cual se compiló el archivo de código de bytes.

source: Deprecated functions and types of the C API
es: Funciones y tipos obsoletos en la API de C

source: The :c:type:`Py_UNICODE` has been deprecated by :pep:`393` and will be removed in Python 4. All functions using this type are deprecated:
es: El :c:type:`Py_UNICODE` ha quedado obsoleto por :pep:`393` y será eliminado en Python 4. Todas las funciones que utilizan éste tipo quedarán en desuso:

source: Unicode functions and methods using :c:type:`Py_UNICODE` and :c:expr:`Py_UNICODE*` types:
es: Funciones y métodos Unicode que utilizan los tipos :c:type:`Py_UNICODE` y :c:expr:`Py_UNICODE*`:

source: :c:macro:`!PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` or :c:func:`PyUnicode_FromKindAndData`
es: :c:macro:`!PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` o :c:func:`PyUnicode_FromKindAndData`

source: :c:macro:`!PyUnicode_AS_DATA`: use :c:macro:`PyUnicode_DATA` with :c:macro:`PyUnicode_READ` and :c:macro:`PyUnicode_WRITE`
es: :c:macro:`!PyUnicode_AS_DATA`: use :c:macro:`PyUnicode_DATA` con :c:macro:`PyUnicode_READ` y :c:macro:`PyUnicode_WRITE`

source: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: use :c:macro:`PyUnicode_GET_LENGTH` or :c:func:`PyUnicode_GetLength`
es: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: use :c:macro:`PyUnicode_GET_LENGTH` o :c:func:`PyUnicode_GetLength`

source: :c:macro:`!PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (only work on ready strings)
es: :c:macro:`!PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (sólo funciona en cadenas listas)

source: :c:func:`!PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString`
es: :c:func:`!PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` o :c:func:`PyUnicode_AsWideCharString`

source: Functions and macros manipulating Py_UNICODE* strings:
es: Funciones y macros que manipulen cadenas de caracteres Py_UNICODE*:

source: :c:macro:`!Py_UNICODE_strlen()`: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
es: :c:macro:`!Py_UNICODE_strlen`: use :c:func:`PyUnicode_GetLength` o :c:macro:`PyUnicode_GET_LENGTH`

source: :c:macro:`!Py_UNICODE_strcat()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
es: :c:macro:`!Py_UNICODE_strcat`: use :c:func:`PyUnicode_CopyCharacters` o :c:func:`PyUnicode_FromFormat`

source: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
es: :c:macro:`!Py_UNICODE_strcpy`, :c:macro:`!Py_UNICODE_strncpy`, :c:macro:`!Py_UNICODE_COPY`: use :c:func:`PyUnicode_CopyCharacters` o :c:func:`PyUnicode_Substring`

source: Encoders:
es: Codificadores:

source: :c:func:`!PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` or :c:func:`PyUnicode_AsUTF8String`
es: :c:func:`!PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` o :c:func:`PyUnicode_AsUTF8String`

source: :c:func:`!PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` or :c:func:`PyUnicode_EncodeCodePage` (with ``CP_ACP`` code_page)
es: :c:func:`!PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` o :c:func:`PyUnicode_EncodeCodePage` (con ``CP_ACP`` code_page)

source: Deprecated features
es: Características obsoletas

source: The :mod:`array` module's ``'u'`` format code is now deprecated and will be removed in Python 4 together with the rest of the (:c:type:`Py_UNICODE`) API.
es: El código del formato ``'u'`` del módulo :mod:`array` ha quedado obsoleto y será eliminado en Python 4, junto con el resto de la API (:c:type:`Py_UNICODE`).

source: Porting to Python 3.3
es: Migración a Python 3.3

source: This section lists previously described changes and other bugfixes that may require changes to your code.
es: Esta sección enumera los cambios descritos previamente y otras correcciones que pueden requerir cambios en su código.

source: Porting Python code
es: Portando código Python

source: Hash randomization is enabled by default. Set the :envvar:`PYTHONHASHSEED` environment variable to ``0`` to disable hash randomization. See also the :meth:`object.__hash__` method.
es: La aleatoriedad de Hash ha sido habilitada de forma predeterminada. Establezca la variable de entorno :envvar:`PYTHONHASHSEED` a 0, para deshabilitar la aleatoriedad de Hash. Vea también el método :meth:`object.__hash__` method.

source: :issue:`12326`: On Linux, sys.platform doesn't contain the major version anymore. It is now always 'linux', instead of 'linux2' or 'linux3' depending on the Linux version used to build Python. Replace sys.platform == 'linux2' with sys.platform.startswith('linux'), or directly sys.platform == 'linux' if you don't need to support older Python versions.
es: :issue:`12326`: En Linux, sys.platform ya no contiene la versión principal. Ahora siempre es 'linux', en vez de 'linux2' o 'linux3' dependiendo de la versión de Linux usada para compilar Python. Reemplace sys.platform == 'linux2' con sys.platform.startswith('linux'), o directamente sys.platform == 'linux' si no necesita admitir versiones anteriores de Python.

source: :issue:`13847`, :issue:`14180`: :mod:`time` and :mod:`datetime`: :exc:`OverflowError` is now raised instead of :exc:`ValueError` if a timestamp is out of range. :exc:`OSError` is now raised if C functions :c:func:`gmtime` or :c:func:`localtime` failed.
es: :issue:`13847`, :issue:`14180`: :mod:`time` y :mod:`datetime`: :exc:`OverflowError` ahora se lanza en lugar de :exc:`ValueError` si una marca de tiempo está fuera de rango. :exc:`OSError` ahora se genera si fallaron las funciones C :c:func:`gmtime` o :c:func:`localtime`.

source: The default finders used by import now utilize a cache of what is contained within a specific directory. If you create a Python source file or sourceless bytecode file, make sure to call :func:`importlib.invalidate_caches` to clear out the cache for the finders to notice the new file.
es: Los buscadores predeterminados usados para las importaciones, ahora utilizan un caché de lo que está contenido en un directorio específico. Si crea un archivo fuente de Python o archivo de código de *bytes* sin fuente, asegúrese de llamar a :func:`importlib.invalidate_caches` para limpiar la caché para que los buscadores encuentren el nuevo archivo.

source: :exc:`ImportError` now uses the full name of the module that was attempted to be imported. Doctests that check ImportErrors' message will need to be updated to use the full name of the module instead of just the tail of the name.
es: :exc:`ImportError` ahora usa el nombre completo del módulo que se intentó importar. Las pruebas de documentos que verifican el mensaje de 'ImportErrors' necesitaran ser actualizados para usar el nombre completo del módulo en vez de sólo la terminación del nombre.

source: The *index* argument to :func:`__import__` now defaults to 0 instead of -1 and no longer support negative values. It was an oversight when :pep:`328` was implemented that the default value remained -1. If you need to continue to perform a relative import followed by an absolute import, then perform the relative import using an index of 1, followed by another import using an index of 0. It is preferred, though, that you use :func:`importlib.import_module` rather than call :func:`__import__` directly.
es: El argumento *index* para la función :func:`__import__` ahora tiene un valor predeterminado de 0, en vez de -1, y ya no admite valores negativos. Ha sido un descuido en la implementación de :pep:`328` que el valor predeterminado permaneciera en -1. Si necesita continuar realizando una importación relativa seguida por una importación absoluta, entonces realice la importación relativa usando un índice de 1, seguida por otra importación que use un índice de 0. Sin embargo, es preferible usar :func:`importlib.import_module` en vez de llamar a la función :func:`__import__` directamente.

source: :func:`__import__` no longer allows one to use an index value other than 0 for top-level modules. E.g. ``__import__('sys', level=1)`` is now an error.
es: :func:`__import__` ya no admite usar un valor de índice distinto de 0 para los módulos de alto nivel. Por ejemplo, ``__import__('sys', level=1)`` ahora es un error.

source: Because :data:`sys.meta_path` and :data:`sys.path_hooks` now have finders on them by default, you will most likely want to use :meth:`list.insert` instead of :meth:`list.append` to add to those lists.
es: Dado que :data:`sys.meta_path` y :data:`sys.path_hooks` ahora tienen buscadores por defecto, lo más probable es que desee usar :meth:`list.insert` en vez de :meth:`list.append` para agregar a esas listas.
