Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: Because ``None`` is now inserted into :data:`sys.path_importer_cache`, if you are clearing out entries in the dictionary of paths that do not have a finder, you will need to remove keys paired with values of ``None`` **and** :class:`!imp.NullImporter` to be backwards-compatible. This will lead to extra overhead on older versions of Python that re-insert ``None`` into :data:`sys.path_importer_cache` where it represents the use of implicit finders, but semantically it should not change anything.
es: Dado que ``None`` ahora ha sido insertado en :data:`sys.path_importer_cache`, si usted está borrando entradas en el diccionario de rutas que no tienen un buscador, usted necesitará eliminar los pares con valores de ``None`` **y** :class:`!imp.NullImporter` para ser compatible con versiones anteriores. Esto conducirá a una sobrecarga adicional con las versiones más antiguas de Python que re-inserten ``None`` dentro de :data:`sys.path_importer_cache` donde éste represente el uso de buscadores implícitos, pero semánticamente no debería cambiar nada.

source: :class:`!importlib.abc.Finder` no longer specifies a ``find_module()`` abstract method that must be implemented. If you were relying on subclasses to implement that method, make sure to check for the method's existence first. You will probably want to check for ``find_loader()`` first, though, in the case of working with :term:`path entry finders <path entry finder>`.
es: :class:`!importlib.abc.Finder` ya no especifica un método abstracto ``find_module()`` que debe implementarse. Si confiaba en subclases para implementar ese método, asegúrese de verificar primero la existencia del método. Sin embargo, probablemente querrá verificar primero ``find_loader()``, en el caso de trabajar con :term:`path entry finders <path entry finder>`.

source: :mod:`pkgutil` has been converted to use :mod:`importlib` internally. This eliminates many edge cases where the old behaviour of the :pep:`302` import emulation failed to match the behaviour of the real import system. The import emulation itself is still present, but is now deprecated. The :func:`pkgutil.iter_importers` and :func:`pkgutil.walk_packages` functions special case the standard import hooks so they are still supported even though they do not provide the non-standard ``iter_modules()`` method.
es: :mod:`pkgutil` ha sido convertido para usar :mod:`importlib` internamente. Esto elimina varios casos extremos donde el antiguo comportamiento de la emulación de importación :pep:`302` fallaba al comparar el comportamiento del sistema real de importación. La emulación de importación en sí aún está presente, pero está en desuso. Las funciones :func:`pkgutil.iter_importers` y :func:`pkgutil.walk_packages` en un caso especial son los ganchos de importación estándar, por lo que aún son compatibles aunque no proporcionen el método no estándar ``iter_modules ()``.

source: A longstanding RFC-compliance bug (:issue:`1079`) in the parsing done by :func:`email.header.decode_header` has been fixed. Code that uses the standard idiom to convert encoded headers into unicode (``str(make_header(decode_header(h))``) will see no change, but code that looks at the individual tuples returned by decode_header will see that whitespace that precedes or follows ``ASCII`` sections is now included in the ``ASCII`` section. Code that builds headers using ``make_header`` should also continue to work without change, since ``make_header`` continues to add whitespace between ``ASCII`` and non-``ASCII`` sections if it is not already present in the input strings.
es: Se ha corregido un error de larga data de cumplimiento de RFC (:issue:`1079`) en el análisis realizado por :func:`email.header.decode_header`. El código que usa el lenguaje estándar para convertir encabezados codificados en *unicode* (``str (make_header (decode_header (h))``) no verá cambios, pero el código que mira las tuplas individuales retornadas por decode_header verá ese espacio en blanco que precede o sigue las secciones ``ASCII`` ahora está incluido en la sección ``ASCII``. El código que crea encabezados usando ``make_header`` también debería continuar funcionando sin cambios, ya que ``make_header`` continúa agregando espacios en blanco entre ``Secciones ASCII`` y no ``ASCII`` si aún no está presente en las cadenas de caracteres entrantes.

source: :func:`email.utils.formataddr` now does the correct content transfer encoding when passed non-``ASCII`` display names. Any code that depended on the previous buggy behavior that preserved the non-``ASCII`` unicode in the formatted output string will need to be changed (:issue:`1690608`).
es: :func:`email.utils.formataddr` ahora realiza la codificación de transferencia de contenido correcta, al pasar nombres para mostrar que no son ASCII. Cualquier código que dependa del comportamiento defectuoso anterior que conservó el *unicode* que no es ``ASCII`` en la cadena de salida formateada deberá cambiarse (:issue:`1690608`).

source: :meth:`poplib.POP3.quit` may now raise protocol errors like all other ``poplib`` methods. Code that assumes ``quit`` does not raise :exc:`poplib.error_proto` errors may need to be changed if errors on ``quit`` are encountered by a particular application (:issue:`11291`).
es: :meth:`poplib.POP3.quit` ahora puede generar errores de protocolos como todos los demás métodos ``poplib``. El código que asume que ``quit`` no genera errores :exc:`poplib.error_proto` puede necesitar ser cambiado si una aplicación en particular encuentran errores en ``quit`` (:issue:`11291`).

source: The ``strict`` argument to :class:`email.parser.Parser`, deprecated since Python 2.4, has finally been removed.
es: El argumento ``strict`` para la clase :class:`email.parser.Parser`, que quedó obsoleto desde Python 2.4, finalmente ha sido eliminado.

source: The deprecated method ``unittest.TestCase.assertSameElements`` has been removed.
es: El método ``unittest.TestCase.assertSameElements`` que estaba obsoleto, ha sido eliminado.

source: The deprecated variable ``time.accept2dyear`` has been removed.
es: La variable ``time.accept2dyear`` que estaba obsoleta, ha sido eliminada.

source: The deprecated ``Context._clamp`` attribute has been removed from the :mod:`decimal` module. It was previously replaced by the public attribute :attr:`~decimal.Context.clamp`. (See :issue:`8540`.)
es: El atributo ``Context._clamp`` que estaba obsoleto, ha sido eliminado del módulo :mod:`decimal`. Este se reemplazó anteriormente por el atributo público :attr:`~decimal.Context.clamp`. (Ver :issue:`8540`.)

source: The undocumented internal helper class ``SSLFakeFile`` has been removed from :mod:`smtplib`, since its functionality has long been provided directly by :meth:`socket.socket.makefile`.
es: La clase interna auxiliar indocumentada ``SSLFakeFile``, ha sido eliminada de :mod:`smtplib`, dado que su funcionalidad ha sido proporcionada directamente por :meth:`socket.socket.makefile`.

source: Passing a negative value to :func:`time.sleep` on Windows now raises an error instead of sleeping forever. It has always raised an error on posix.
es: El paso de valores negativos a la función :func:`time.sleep` en Windows, ahora lanza un error en vez de detenerse definitivamente. Este siempre ha lanzado un error en posix.

source: The ``ast.__version__`` constant has been removed. If you need to make decisions affected by the AST version, use :data:`sys.version_info` to make the decision.
es: La constante ``ast.__version__`` ha sido eliminada. Si usted necesita tomar decisiones afectadas por la versión AST, use :data:`sys.version_info` para tomar la decisión.

source: Code that used to work around the fact that the :mod:`threading` module used factory functions by subclassing the private classes will need to change to subclass the now-public classes.
es: El código que solía solucionar el hecho de que el módulo :mod:`threading` utilizaba funciones de fábrica mediante la subclase de las clases privadas tendrá que cambiar a la subclase de las clases ahora públicas.

source: The undocumented debugging machinery in the threading module has been removed, simplifying the code. This should have no effect on production code, but is mentioned here in case any application debug frameworks were interacting with it (:issue:`13550`).
es: La indocumentada maquinaria de depuración en el módulo threading ha sido eliminada, simplificando el código. Esto no debería tener efecto en el código de producción, pero se menciona aquí en caso de que algún framework de depuración de aplicaciones interactúe con el (:issue:`13550`).

source: Porting C code
es: Portando código C

source: In the course of changes to the buffer API the undocumented :c:member:`!smalltable` member of the :c:type:`Py_buffer` structure has been removed and the layout of the :c:type:`PyMemoryViewObject` has changed.
es: En el curso de los cambios en la API del búfer, se eliminó el miembro :c:member:`!smalltable` no documentado de la estructura :c:type:`Py_buffer` y se cambió el diseño del :c:type:`PyMemoryViewObject`.

source: All extensions relying on the relevant parts in ``memoryobject.h`` or ``object.h`` must be rebuilt.
es: Todas las extensiones que quedan en las partes relevantes de ``memoryobject.h`` o ``object.h`` deben ser reconstruídas.

source: Due to :ref:`PEP 393 <pep-393>`, the :c:type:`Py_UNICODE` type and all functions using this type are deprecated (but will stay available for at least five years). If you were using low-level Unicode APIs to construct and access unicode objects and you want to benefit of the memory footprint reduction provided by :pep:`393`, you have to convert your code to the new :doc:`Unicode API <../c-api/unicode>`.
es: Debido a :ref:`PEP 393 <pep-393>`, el tipo :c:type:`Py_UNICODE` y todas las funciones que lo utilicen han quedado obsoletas (pero seguirán estando disponibles por al menos 5 años). Si usted estuvo usando APIS Unicode de bajo nivel para construir y acceder a objetos unicode, y desea beneficiarse de la reducción de huella de memoria proporcionada por :pep:`393`, usted debe convertir su código al nuevo :doc:`Unicode API <../c-api/unicode>`.

source: However, if you only have been using high-level functions such as :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` or :c:func:`PyUnicode_FromFormat()`, your code will automatically take advantage of the new unicode representations.
es: Sin embargo, si sólo ha estado usando funciones de alto nivel como :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` o :c:func:`PyUnicode_FromFormat()`, automáticamente su código se beneficiará de las nuevas representaciones *unicode*.

source: :c:func:`PyImport_GetMagicNumber` now returns ``-1`` upon failure.
es: :c:func:`PyImport_GetMagicNumber` ahora retorna ``-1`` en caso de falla.

source: As a negative value for the *level* argument to :func:`__import__` is no longer valid, the same now holds for :c:func:`PyImport_ImportModuleLevel`. This also means that the value of *level* used by :c:func:`PyImport_ImportModuleEx` is now ``0`` instead of ``-1``.
es: Como valor negativo para el argumento *level* de la función :func:`__import__` ya no es válido, y lo mismo ahora es válido para la función :c:func:`PyImport_ImportModuleLevel`. Esto también significa que el valor de *level* usado por la función :c:func:`PyImport_ImportModuleEx` ahora es ``0`` en vez de ``-1``.

source: Building C extensions
es: Construyendo extensiones C

source: The range of possible file names for C extensions has been narrowed. Very rarely used spellings have been suppressed: under POSIX, files named ``xxxmodule.so``, ``xxxmodule.abi3.so`` and ``xxxmodule.cpython-*.so`` are no longer recognized as implementing the ``xxx`` module. If you had been generating such files, you have to switch to the other spellings (i.e., remove the ``module`` string from the file names).
es: Se ha reducido el rango de nombres de archivo posibles para las extensiones C. Muy raramente se han suprimido las ortografías utilizadas: en POSIX, los archivos denominados ``xxxmodule.so``, ``xxxmodule.abi3.so`` y ``xxxmodule.cpython-*.so`` ya no se reconocen como la implementación del módulo ``xxx``. Si ha estado generando estos archivos, tiene que cambiar a las otras ortografías (es decir, eliminar la cadena de caracteres ``módulo`` de los nombres de archivo).

source: (implemented in :issue:`14040`.)
es: (implementado en :issue:`14040`.)

source: Command Line Switch Changes
es: Cambios en el conmutador de línea de comandos

source: The -Q command-line flag and related artifacts have been removed. Code checking sys.flags.division_warning will need updating.
es: Se han quitado el indicador de línea de comandos -Q y los artefactos relacionados. La comprobación de código sys.flags.division_warning tendrá que actualizar.

source: (:issue:`10998`, contributed by Éric Araujo.)
es: (:issue:`10998`, contribución de Éric Araujo.)

source: When :program:`python` is started with :option:`-S`, ``import site`` will no longer add site-specific paths to the module search paths. In previous versions, it did.
es: Cuando se inicia :program:`python` con :option:`-S`, ``import site`` ya no agregará las rutas específicas de sitio al módulo de búsqueda de rutas. En las versiones anteriores si lo hacía.

source: (:issue:`11591`, contributed by Carl Meyer with editions by Éric Araujo.)
es: (:issue:`11591`, contribución de Carl Meyer con ediciones de Éric Araujo.)

source: yield
es: producir

source: yield from (in What's New)
es: producir desde (en Novedades)
