Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: And the :exc:`ConnectionError` itself has finer-grained subclasses:
es: Y el mismo :exc:`ConnectionError` tiene subclases más detalladas:

source: Thanks to the new exceptions, common usages of the :mod:`errno` can now be avoided. For example, the following code written for Python 3.2::
es: Gracias a las nuevas excepciones, los usos comunes de :mod:`errno` ahora se pueden evitar. Por ejemplo, el siguiente código escrito para Python 3.2:

source: can now be written without the :mod:`errno` import and without manual inspection of exception attributes::
es: ahora se pueden escribir sin la importación de :mod:`errno` y sin la inspección manual de atributos de excepción:

source: :pep:`3151` - Reworking the OS and IO Exception Hierarchy
es: :pep:`3151` - Re elaboración de la jerarquía de excepciones de IO y OS

source: PEP written and implemented by Antoine Pitrou
es: PEP escrito e implementado por Antoine Pitrou

source: PEP 380: Syntax for Delegating to a Subgenerator
es: PEP 380: Sintaxis para delegar en un subgenerador

source: PEP 380 adds the ``yield from`` expression, allowing a :term:`generator` to delegate part of its operations to another generator. This allows a section of code containing :keyword:`yield` to be factored out and placed in another generator. Additionally, the subgenerator is allowed to return with a value, and the value is made available to the delegating generator.
es: PEP 380 agrega la expresión ``yield from``, permitiendo que un :term:`generator` delegue parte de sus operaciones a otro generador. Esto permite tomar en consideración una sección de código que contenga la palabra :keyword:`yield` y ubicarla en otro generador. Además, el subgenerador puede regresar con un valor y el valor se pone a disposición del generador que delega.

source: While designed primarily for use in delegating to a subgenerator, the ``yield from`` expression actually allows delegation to arbitrary subiterators.
es: Aunque está diseñada principalmente para su uso en la delegación a un subgenerador, la expresión ``yield from`` en realidad permite la delegación a subiteradores arbitrarios.

source: For simple iterators, ``yield from iterable`` is essentially just a shortened form of ``for item in iterable: yield item``::
es: Para iteradores simples, ``yield from iterable`` es esencialmente una forma abreviada de ``for item in iterable: yield item``::

source: However, unlike an ordinary loop, ``yield from`` allows subgenerators to receive sent and thrown values directly from the calling scope, and return a final value to the outer generator::
es: Sin embargo, a diferencia de un ciclo ordinario, ``yield from`` permite que los subgeneradores reciban valores enviados y lanzados directamente desde el ámbito de la llamada y retornen un valor final al generador externo:

source: The main principle driving this change is to allow even generators that are designed to be used with the ``send`` and ``throw`` methods to be split into multiple subgenerators as easily as a single large function can be split into multiple subfunctions.
es: Lo más importante de éste cambio es permitir que incluso los generadores que están diseñados para ser usados con los métodos ``send`` y ``throw`` sean separados en múltiples subgeneradores tan fácilmente como las funciones grandes se pueden dividir en varias subfunciones.

source: :pep:`380` - Syntax for Delegating to a Subgenerator
es: :pep:`380` - Sintaxis para delegar a un subgenerador

source: PEP written by Greg Ewing; implementation by Greg Ewing, integrated into 3.3 by Renaud Blanch, Ryan Kelly and Nick Coghlan; documentation by Zbigniew Jędrzejewski-Szmek and Nick Coghlan
es: PEP escrito por Greg Ewing; implementación por Greg Ewing, integrado en 3.3 por Renaud Blanch, Ryan Kelly y Nick Coghlan; documentación de Zbigniew Jędrzejewski-Szmek y Nick Coghlan

source: PEP 409: Suppressing exception context
es: PEP 409: Suprimir el contexto de excepción

source: PEP 409 introduces new syntax that allows the display of the chained exception context to be disabled. This allows cleaner error messages in applications that convert between exception types::
es: PEP 409 introduce una nueva sintaxis que permite deshabilitar la visualización del contexto de excepción encadenado. Esto permite mensajes de error más limpios en aplicaciones que convierten entre tipos de excepción:

source: Without the ``from None`` suffix to suppress the cause, the original exception would be displayed by default::
es: Sin el sufijo ``from None`` para suprimir la causa, la excepción original se mostraría de forma predeterminada:

source: No debugging capability is lost, as the original exception context remains available if needed (for example, if an intervening library has incorrectly suppressed valuable underlying details)::
es: No se pierde ninguna capacidad de depuración, ya que el contexto de la excepción original permanece disponible en caso de ser necesario (por ejemplo, si una biblioteca suprime detalles importantes y valiosos de forma incorrecta)

source: :pep:`409` - Suppressing exception context
es: :pep:`409` - Supresión del contexto de excepción

source: PEP written by Ethan Furman; implemented by Ethan Furman and Nick Coghlan.
es: PEP escrito por Ethan Furman; implementado por Ethan Furman y Nick Coghlan.

source: PEP 414: Explicit Unicode literals
es: PEP 414: Literales *Unicode* explícitos

source: To ease the transition from Python 2 for Unicode aware Python applications that make heavy use of Unicode literals, Python 3.3 once again supports the "``u``" prefix for string literals. This prefix has no semantic significance in Python 3, it is provided solely to reduce the number of purely mechanical changes in migrating to Python 3, making it easier for developers to focus on the more significant semantic changes (such as the stricter default separation of binary and text data).
es: Para facilitar la transición de Python 2 para las aplicaciones de Python que reconocen *Unicode* y que hacen un uso intensivo de literales Unicode, Python 3.3 una vez más admite el prefijo "``u``" para cadenas literales. Este prefijo no tiene importancia semántica en Python 3, se proporciona únicamente para reducir el número de cambios puramente mecánicos en la migración a Python 3, lo que facilita a los desarrolladores centrarse en los cambios semánticos más significativos (como la separación predeterminada más estricta de binary y datos de texto).

source: :pep:`414` - Explicit Unicode literals
es: :pep:`414` - Literales *Unicode* Explícitos

source: PEP written by Armin Ronacher.
es: PEP escrito por Armin Ronacher.

source: PEP 3155: Qualified name for classes and functions
es: PEP 3155: Nombres calificados para clases y funciones

source: Functions and class objects have a new ``__qualname__`` attribute representing the "path" from the module top-level to their definition. For global functions and classes, this is the same as ``__name__``. For other functions and classes, it provides better information about where they were actually defined, and how they might be accessible from the global scope.
es: Las funciones y objetos de clases tienen un nuevo atributo ``__qualname__``, que representa la ruta desde el nivel superior del módulo hasta su definición. Para funciones globales y clases, es lo mismo que ``__name__``. Para otras funciones y clases, éste proporciona mejor información sobre donde han sido definidos realmente y como podrían ser accesibles desde un ámbito global.

source: Example with (non-bound) methods::
es: Ejemplo con métodos (no vinculados):

source: Example with nested classes::
es: Ejemplo con clases anidadas:

source: Example with nested functions::
es: Ejemplo con funciones anidadas:

source: The string representation of those objects is also changed to include the new, more precise information::
es: La representación en cadena de estos objetos, también se ha modificado para incluir la información nueva y más precisa:

source: :pep:`3155` - Qualified name for classes and functions
es: :pep:`3155` - Nombres calificados para clases y funciones

source: PEP written and implemented by Antoine Pitrou.
es: PEP Escrito e implementado por Antoine Pitrou.

source: PEP 412: Key-Sharing Dictionary
es: PEP 412: Diccionario de intercambio de claves

source: Dictionaries used for the storage of objects' attributes are now able to share part of their internal storage between each other (namely, the part which stores the keys and their respective hashes). This reduces the memory consumption of programs creating many instances of non-builtin types.
es: Los diccionarios usados para almacenar atributos de objetos, ahora pueden compartir parte de su almacenamiento interno entre sí (a saber, la parte que almacena las claves y sus respectivos hashes). Esto reduce el consumo de memoria de programas creando varias instancias de tipos no integrados.

source: :pep:`412` - Key-Sharing Dictionary
es: :pep:`412` -Diccionario de intercambio de claves

source: PEP written and implemented by Mark Shannon.
es: PEP escrito e implementado por Mark Shannon.

source: PEP 362: Function Signature Object
es: PEP 362: Objeto de firma de función

source: A new function :func:`inspect.signature` makes introspection of python callables easy and straightforward. A broad range of callables is supported: python functions, decorated or not, classes, and :func:`functools.partial` objects. New classes :class:`inspect.Signature`, :class:`inspect.Parameter` and :class:`inspect.BoundArguments` hold information about the call signatures, such as, annotations, default values, parameters kinds, and bound arguments, which considerably simplifies writing decorators and any code that validates or amends calling signatures or arguments.
es: Una nueva función :func:`inspect.signature` hace que la introspección de las llamadas de Python sea fácil y directa. Se admite una amplia gama de invocables: funciones python, decoradas o no, clases y objetos :func:`functools.partial`. Las Nuevas clases :class:`inspect.Signature`, :class:`inspect.Parameter` y :class:`inspect.BoundArguments` contienen información sobre las firmas de llamadas, tales como anotaciones, valores por defecto, tipos de parámetros, y los argumentos vinculados, lo cual simplifica considerablemente la escritura de decoradores y de cualquier código que valide o modifique las firmas de llamadas o argumentos.

source: :pep:`362`: - Function Signature Object
es: :pep:`362`: - Objeto de firmas de función

source: PEP written by Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implemented by Yury Selivanov.
es: PEP escrito por Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implementado por Yury Selivanov.

source: PEP 421: Adding sys.implementation
es: PEP 421: Agregar sys.implementation

source: A new attribute on the :mod:`sys` module exposes details specific to the implementation of the currently running interpreter. The initial set of attributes on :data:`sys.implementation` are ``name``, ``version``, ``hexversion``, and ``cache_tag``.
es: Un nuevo atributo en el módulo :mod:`sys` expone detalles específicos de la implementación del intérprete que se ésta ejecutando en el momento actual. El conjunto inicial de atributos en :data:`sys.implementation` son ``name``, ``version``, ``hexversion``, y ``cache_tag``.

source: The intention of ``sys.implementation`` is to consolidate into one namespace the implementation-specific data used by the standard library. This allows different Python implementations to share a single standard library code base much more easily. In its initial state, ``sys.implementation`` holds only a small portion of the implementation-specific data. Over time that ratio will shift in order to make the standard library more portable.
es: La intención de ``sys.implementation`` es consolidar dentro de un espacio de nombres, la implementación específica de datos usado por la biblioteca estándar. Esto permite que diferentes implementaciones de python puedan compartir código de la biblioteca estándar de manera más fácil. En su estado inicial, ``sys.implementation`` contiene solo una pequeña porción de los datos específicos de la implementación. Con el tiempo esta proporción cambiará para hacer que la biblioteca estándar sea más portable..

source: One example of improved standard library portability is ``cache_tag``. As of Python 3.3, ``sys.implementation.cache_tag`` is used by :mod:`importlib` to support :pep:`3147` compliance. Any Python implementation that uses ``importlib`` for its built-in import system may use ``cache_tag`` to control the caching behavior for modules.
es: Un ejemplo de mejor portabilidad de la biblioteca estándar es ``cache_tag``. A partir de Python 3.3, ``sys.implementation.cache_tag`` es utilizado por :mod:`importlib` para admitir el cumplimiento :pep:`3147`. Cualquier implementación de Python que utilice ``importlib`` para su sistema de importación integrado puede usar ``cache_tag`` para controlar el comportamiento de almacenamiento en caché de los módulos.

source: The implementation of ``sys.implementation`` also introduces a new type to Python: :class:`types.SimpleNamespace`. In contrast to a mapping-based namespace, like :class:`dict`, ``SimpleNamespace`` is attribute-based, like :class:`object`. However, unlike ``object``, ``SimpleNamespace`` instances are writable. This means that you can add, remove, and modify the namespace through normal attribute access.
es: La implementación de ``sys.implementation`` también trae un nuevo tipo a Python: La clase :class:`types.SimpleNamespace`. En comparación con un nombre de espacio basado en mapas, como :class:`dict`, ``SimpleNamespace`` es basado en atributos, como :class:`object`. Sin embargo a diferencia de ``object``, las instancias de ``SimpleNamespace`` son editables. Esto significa que puedes agregar, eliminar, y modificar el nombre de espacio a través del acceso normal a los atributos.

source: :pep:`421` - Adding sys.implementation
es: :pep:`421` - Agregar sys.implementation

source: PEP written and implemented by Eric Snow.
es: PEP escrito e implementado por Mark Shannon.

source: Using importlib as the Implementation of Import
es: Usar importlib como implementación de Import

source: :issue:`2377` - Replace __import__ w/ importlib.__import__ :issue:`13959` - Re-implement parts of :mod:`!imp` in pure Python :issue:`14605` - Make import machinery explicit :issue:`14646` - Require loaders set __loader__ and __package__
es: :issue:`2377`- Replace__import__w/ importlib.__import__ :issue:`13959` - Re-implementar partes de :mod:`!imp` en Python puro :issue:`14605` - Hacer que la maquinaria de importación sea explícita :issue:`14646` - Requerir que los cargadores establezcan __loader__ y __package__

source: The :func:`__import__` function is now powered by :func:`importlib.__import__`. This work leads to the completion of "phase 2" of :pep:`302`. There are multiple benefits to this change. First, it has allowed for more of the machinery powering import to be exposed instead of being implicit and hidden within the C code. It also provides a single implementation for all Python VMs supporting Python 3.3 to use, helping to end any VM-specific deviations in import semantics. And finally it eases the maintenance of import, allowing for future growth to occur.
es: La función :func:`__import__` ahora es potenciada por la función :func:`importlib.__import__`. Este trabajo conduce a completar la "fase 2" de :pep:`302`. Hay múltiples beneficios en éste cambio. En primer lugar, ha permitido que la mayoría de la maquinaria que potencia las importaciones sea expuesta, en vez de estar implícitas y ocultas en el código de C. También proporciona una única implementación para todas las máquinas virtuales de python que admitan el uso de Python 3.3 lo que ayuda a terminar con cualquier desviación específica de VM en la semántica de importación. Y finalmente facilita el mantenimiento de la importación, permitiendo que ocurra un crecimiento futuro.

source: For the common user, there should be no visible change in semantics. For those whose code currently manipulates import or calls import programmatically, the code changes that might possibly be required are covered in the `Porting Python code`_ section of this document.
es: Para el usuario común, no debería haber cambios visibles en la semántica. Para aquellos cuyo código realmente manipula la importación o las llamadas de importación de forma programática, los cambios de código que posiblemente sean necesarios, se tratan en la sección `Porting Python code`_ de éste documento.

source: New APIs
es: Nuevas APIs

source: One of the large benefits of this work is the exposure of what goes into making the import statement work. That means the various importers that were once implicit are now fully exposed as part of the :mod:`importlib` package.
es: Uno de los grandes beneficios de éste trabajo es la exposición de lo que implica hacer que funcione la sentencia de importación. Esto significa que los varios importadores que una vez fueron implícitos, ahora son expuestos completamente como parte del paquete :mod:`importlib`.

source: The abstract base classes defined in :mod:`importlib.abc` have been expanded to properly delineate between :term:`meta path finders <meta path finder>` and :term:`path entry finders <path entry finder>` by introducing :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder`, respectively. The old ABC of :class:`!importlib.abc.Finder` is now only provided for backwards-compatibility and does not enforce any method requirements.
es: Las clases base abstractas definidas en :mod:`importlib.abc` se han expandido para delimitar adecuadamente entre :term:`buscadores de rutas meta <meta path finder>` y :term:`buscadores de entrada de rutas <path entry finder>` al introducir la clase :class:`importlib.abc.MetaPathFinder` y :class:`importlib.abc.PathEntryFinder` respectivamente. El antiguo ABC de la clase :class:`!importlib.abc.Finder` ahora solo se proporciona para compatibilidad con versiones anteriores y no exige ningún requisito de método.

source: In terms of finders, :class:`importlib.machinery.FileFinder` exposes the mechanism used to search for source and bytecode files of a module. Previously this class was an implicit member of :data:`sys.path_hooks`.
es: En términos de buscadores, :class:`importlib.machinery.FileFinder` expone el mecanismo utilizado para buscar archivos fuente y de código de *bytes* de un módulo. Anteriormente, ésta clase era un miembro implícito de :data:`sys.path_hooks`.

source: For loaders, the new abstract base class :class:`importlib.abc.FileLoader` helps write a loader that uses the file system as the storage mechanism for a module's code. The loader for source files (:class:`importlib.machinery.SourceFileLoader`), sourceless bytecode files (:class:`importlib.machinery.SourcelessFileLoader`), and extension modules (:class:`importlib.machinery.ExtensionFileLoader`) are now available for direct use.
es: Para los cargadores, la nueva clase base abstracta :class:`importlib.abc.FileLoader` ayuda a escribir un cargador que usa el sistema de archivos como mecanismo de almacenamiento para el código de un módulo. El cargador de archivos fuente (:class:`importlib.machinery.SourceFileLoader`), archivos de código byte sin fuente (:class:`importlib.machinery.SourcelessFileLoader`) y módulos de extensión (:class:`importlib.machinery.ExtensionFileLoader`) ahora están disponibles para su uso directo.

source: :exc:`ImportError` now has ``name`` and ``path`` attributes which are set when there is relevant data to provide. The message for failed imports will also provide the full name of the module now instead of just the tail end of the module's name.
es: :exc:`ImportError` ahora tiene los atributos ``name`` y ``path`` que se establecen cuando hay datos relevantes para proporcionar. También, el mensaje de importaciones fallidas ahora proporcionará el nombre completo del módulo en lugar de solo el final del nombre del mismo.

source: The :func:`importlib.invalidate_caches` function will now call the method with the same name on all finders cached in :data:`sys.path_importer_cache` to help clean up any stored state as necessary.
es: La función :func:`importlib.invalidate_caches` ahora llamará al método con el mismo nombre en todos los buscadores almacenados en :data:`sys.path_importer_cache` para ayudar a limpiar cualquier estado almacenado según sea necesario.

source: Visible Changes
es: Cambios visibles

source: For potential required changes to code, see the `Porting Python code`_ section.
es: Para conocer los posibles cambios necesarios en el código, consulte la sección `Porting Python code`_ .

source: Beyond the expanse of what :mod:`importlib` now exposes, there are other visible changes to import. The biggest is that :data:`sys.meta_path` and :data:`sys.path_hooks` now store all of the meta path finders and path entry hooks used by import. Previously the finders were implicit and hidden within the C code of import instead of being directly exposed. This means that one can now easily remove or change the order of the various finders to fit one's needs.
es: Más allá de la extensión de lo que ahora expone :mod:`importlib`, hay otros cambios visibles para importar. El más grande es que :data:`sys.meta_path` y :data:`sys.path_hooks` ahora almacenan todos los buscadores de rutas meta y los ganchos de entrada de rutas usados por la importación. Anteriormente, los buscadores estaban implícitos y ocultos dentro del código C de importación en lugar de estar expuestos directamente. Esto significa que ahora uno puede eliminar o cambiar fácilmente el orden de los diversos buscadores para satisfacer sus necesidades.

source: Another change is that all modules have a ``__loader__`` attribute, storing the loader used to create the module. :pep:`302` has been updated to make this attribute mandatory for loaders to implement, so in the future once 3rd-party loaders have been updated people will be able to rely on the existence of the attribute. Until such time, though, import is setting the module post-load.
es: Otro cambio es que todos los módulos tienen un atributo ``__loader__`` que almacena el cargador usado para crear el módulo. La :pep:`302` se ha actualizado para hacer que este atributo sea obligatorio para implementar los cargadores, de manera que en el futuro, una vez que los cargadores de terceros hayan sido actualizados, las personas puedan confiar en la existencia de éste atributo. Sin embargo, hasta entonces la importación está configurando la post carga del módulo.

source: Loaders are also now expected to set the ``__package__`` attribute from :pep:`366`. Once again, import itself is already setting this on all loaders from :mod:`importlib` and import itself is setting the attribute post-load.
es: También se espera que ahora los cargadores establezcan el atributo ``__package__`` de :pep:`366`. Una vez más, la importación por sí misma ya está configurando ésto en todos los cargadores del módulo :mod:`importlib` y la importación misma está configurando la post carga del atributo.

source: ``None`` is now inserted into :data:`sys.path_importer_cache` when no finder can be found on :data:`sys.path_hooks`. Since :class:`!imp.NullImporter` is not directly exposed on :data:`sys.path_hooks` it could no longer be relied upon to always be available to use as a value representing no finder found.
es: Ahora se incluye el atributo ``None`` dentro de :data:`sys.path_importer_cache` cuando no se encuentre ningún buscador en :data:`sys.path_hooks`. Dado que :class:`!imp.NullImporter` no está directamente expuesto en :data:`sys.path_hooks`, podría no haber una certeza de que esté disponible para su uso como un valor que represente que no se ha encontrado ningún buscador.
