Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: Performance gains range from 10x for database applications to 100x for numerically intensive applications. These numbers are expected gains for standard precisions used in decimal floating point arithmetic. Since the precision is user configurable, the exact figures may vary. For example, in integer bignum arithmetic the differences can be significantly higher.
es: El rango de ganancias del rendimiento va de 10x para las aplicaciones de base de datos, a 100x para aplicaciones numéricamente intensivas. Estos números son ganancias esperadas para las precisiones estándar usadas en la aritmética de punto flotante decimal. Dado que la precisión es configurable por el usuario, las cifras exactas pueden variar. Por ejemplo, en la aritmética de enteros bignum, las diferencias pueden ser significativamente mayores.

source: The following table is meant as an illustration. Benchmarks are available at https://www.bytereef.org/mpdecimal/quickstart.html.
es: La siguiente tabla está pensada como una ilustración. Los puntos de referencia están disponibles en https://www.bytereef.org/mpdecimal/quickstart.html.

source: The :exc:`~decimal.FloatOperation` signal optionally enables stricter semantics for mixing floats and Decimals.
es: La señal :exc:`~decimal.FloatOperation` habilita opcionalmente las semánticas estrictas para mezclar decimales y flotantes.

source: If Python is compiled without threads, the C version automatically disables the expensive thread local context machinery. In this case, the variable :const:`~decimal.HAVE_THREADS` is set to ``False``.
es: Si python se compila sin subprocesos, la versión C deshabilita automáticamente la costosa maquinaria de contexto local de subprocesos. En éste caso, la variable :const:`~decimal.HAVE_THREADS` se establece en ``False``.

source: The C module has the following context limits, depending on the machine architecture:
es: El módulo C tiene los siguientes límites de contexto, dependiendo de la arquitectura de la máquina:

source: In the context templates (:class:`~decimal.DefaultContext`, :class:`~decimal.BasicContext` and :class:`~decimal.ExtendedContext`) the magnitude of :attr:`~decimal.Context.Emax` and :attr:`~decimal.Context.Emin` has changed to ``999999``.
es: En las plantillas de contexto (:class:`~decimal.DefaultContext`, :class:`~decimal.BasicContext` and :class:`~decimal.ExtendedContext`) la magnitud de :attr:`~decimal.Context.Emax` y :attr:`~decimal.Context.Emin` se ha cambiado a ``999999``.

source: The :class:`~decimal.Decimal` constructor in decimal.py does not observe the context limits and converts values with arbitrary exponents or precision exactly. Since the C version has internal limits, the following scheme is used: If possible, values are converted exactly, otherwise :exc:`~decimal.InvalidOperation` is raised and the result is NaN. In the latter case it is always possible to use :meth:`~decimal.Context.create_decimal` in order to obtain a rounded or inexact value.
es: El constructor :class:`~decimal.Decimal` en decimal.py no observa los límites de contexto y convierte valores con exponentes arbitrarios o precisión exacta. Dado que la versión C tiene límites internos, se usa el siguiente esquema: Si es posible, los valores son convertidos a valores exactos, de lo contrario se genera :exc:`~decimal.InvalidOperation` y el resultado es NaN. En éste último caso siempre es posible usar :meth:`~decimal.Context.create_decimal` para obtener un valor redondeado o inexacto.

source: The power function in decimal.py is always correctly rounded. In the C version, it is defined in terms of the correctly rounded :meth:`~decimal.Decimal.exp` and :meth:`~decimal.Decimal.ln` functions, but the final result is only "almost always correctly rounded".
es: La función de potencia en decimal.py siempre se redondea correctamente. En la versión C, se define en términos de las funciones :meth:`~decimal.Decimal.exp` y :meth:`~decimal.Decimal.ln` correctamente redondeadas, pero el resultado final es solo "casi siempre correctamente redondeado".

source: In the C version, the context dictionary containing the signals is a :class:`~collections.abc.MutableMapping`. For speed reasons, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` always refer to the same :class:`~collections.abc.MutableMapping` that the context was initialized with. If a new signal dictionary is assigned, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` are updated with the new values, but they do not reference the RHS dictionary.
es: En la versión C, el diccionario de contexto que contiene las señales, es una :class:`~collections.abc.MutableMapping`. Por razones de velocidad, :attr:`~decimal.Context.flags` y :attr:`~decimal.Context.traps` siempre se refiere a la misma :class:`~collections.abc.MutableMapping` que el contexto con el que se inicializó. Si se asigna un nuevo diccionario de señales, :attr:`~decimal.Context.flags` y :attr:`~decimal.Context.traps` son actualizados con los nuevos valores, pero no hacen referencia al diccionario RHS.

source: Pickling a :class:`~decimal.Context` produces a different output in order to have a common interchange format for the Python and C versions.
es: Decapar a :class:`~decimal.Context` produce una salida diferente para tener un formato de intercambio común para las versiones de Python y C.

source: The order of arguments in the :class:`~decimal.Context` constructor has been changed to match the order displayed by :func:`repr`.
es: El orden de los argumentos en el constructor de la clase :class:`~decimal.Context`, ha sido cambiado para que coincida con el orden mostrado por la función :func:`repr`.

source: The ``watchexp`` parameter in the :meth:`~decimal.Decimal.quantize` method is deprecated.
es: El parámetro ``watchexp`` en el método :meth:`~decimal.Decimal.quantize` ha quedado obsoleto.

source: Policy Framework
es: Marco de políticas

source: The email package now has a :mod:`~email.policy` framework. A :class:`~email.policy.Policy` is an object with several methods and properties that control how the email package behaves. The primary policy for Python 3.3 is the :class:`~email.policy.Compat32` policy, which provides backward compatibility with the email package in Python 3.2. A ``policy`` can be specified when an email message is parsed by a :mod:`~email.parser`, or when a :class:`~email.message.Message` object is created, or when an email is serialized using a :mod:`~email.generator`. Unless overridden, a policy passed to a ``parser`` is inherited by all the ``Message`` object and sub-objects created by the ``parser``. By default a ``generator`` will use the policy of the ``Message`` object it is serializing. The default policy is :data:`~email.policy.compat32`.
es: El paquete de correo electrónico ahora tiene un marco :mod:`~email.policy`. Un :class:`~email.policy.Policy` es un objeto con varios métodos y propiedades que controlan el comportamiento del paquete de correo electrónico. La política principal de Python 3.3 es la política :class:`~email.policy.Compat32`, que proporciona compatibilidad con versiones anteriores del paquete de correo electrónico en Python 3.2. Se puede especificar una ``policy`` cuando un mensaje de correo electrónico es analizado por un :mod:`~email.parser`, o cuando se crea un objeto :class:`~email.message.Message`, o cuando se serializa un correo electrónico mediante un :mod:`~email.generator`. A menos que se invalide, una política pasada a un ``parser`` es heredada por todos los objetos ``Message`` y los subobjetos creados por el ``parser``. De forma predeterminada, un ``generator`` utilizará la política del objeto ``Message`` que está serializando. La directiva predeterminada es :data:`~email.policy.compat32`.

source: The minimum set of controls implemented by all ``policy`` objects are:
es: El conjunto mínimo de controles implementado por todos los objetos ``policy`` son:

source: The maximum length, excluding the linesep character(s), individual lines may have when a ``Message`` is serialized. Defaults to 78.
es: La longitud máxima, excluyendo el(los) caracter(es) *linesep*, que las líneas individuales pueden tener cuando un ``Message`` se serializa es por defecto de 78.

source: The character used to separate individual lines when a ``Message`` is serialized. Defaults to ``\n``.
es: El caracter usado para separar las líneas individuales cuando se serializa un ``Message`` es por defecto ``\n``.

source: ``7bit`` or ``8bit``. ``8bit`` applies only to a ``Bytes`` ``generator``, and means that non-ASCII may be used where allowed by the protocol (or where it exists in the original input).
es: ``7bit`` or ``8bit``. ``8bit`` sólo se aplica a un ``Bytes`` ``generator``, y significa que pueden utilizarse "no ASCII" cuando lo permita el protocolo (o cuando exista en la entrada original).

source: Causes a ``parser`` to raise error when defects are encountered instead of adding them to the ``Message`` object's ``defects`` list.
es: Hace que un ''analizador'' genere el error cuando se encuentran defectos en lugar de agregarlos a la lista ''Mensaje'' del objeto ''defectos''.

source: A new policy instance, with new settings, is created using the :meth:`~email.policy.Policy.clone` method of policy objects. ``clone`` takes any of the above controls as keyword arguments. Any control not specified in the call retains its default value. Thus you can create a policy that uses ``\r\n`` linesep characters like this::
es: Una nueva instancia de directiva, con nueva configuración, se crea mediante el método :meth:`~email.policy.Policy.clone` de objetos de política. ``clone`` toma cualquiera de los controles anteriores como argumentos de palabra clave. Cualquier control no especificado en la llamada conserva su valor predeterminado. Por lo tanto, puede crear una directiva que utilice caracteres *linesep* ``\r\n`` como este::

source: Policies can be used to make the generation of messages in the format needed by your application simpler. Instead of having to remember to specify ``linesep='\r\n'`` in all the places you call a ``generator``, you can specify it once, when you set the policy used by the ``parser`` or the ``Message``, whichever your program uses to create ``Message`` objects. On the other hand, if you need to generate messages in multiple forms, you can still specify the parameters in the appropriate ``generator`` call. Or you can have custom policy instances for your different cases, and pass those in when you create the ``generator``.
es: Las directivas pueden ser usadas para facilitar la generación de mensajes en el formato requerido por la aplicación. En vez de tener que recordar especificar ``linesep='\r\n'`` en todos los lugares en donde llamas a ``generator``, puedes especificarlo una sola vez cuando estableces la política usada por el ``analizador`` o el ``Mensaje``, el que tu programa utilice para crear los objetos ``Mensaje``. Por otra parte, si necesitas generar mensajes en múltiples formas, aún puedes especificar los parámetros en la llamada al generador apropiado. O puedes tener instancias de política personalizadas para tus distintos casos, y pasarlos al crear el ``generator``.

source: Provisional Policy with New Header API
es: Política provisional con nueva API de encabezado

source: While the policy framework is worthwhile all by itself, the main motivation for introducing it is to allow the creation of new policies that implement new features for the email package in a way that maintains backward compatibility for those who do not use the new policies. Because the new policies introduce a new API, we are releasing them in Python 3.3 as a :term:`provisional policy <provisional package>`. Backwards incompatible changes (up to and including removal of the code) may occur if deemed necessary by the core developers.
es: Aunque el marco de políticas vale la pena por sí solo, la principal motivación para presentarlo es permitir la creación de nuevas políticas que implementen nuevas características para el paquete de correo electrónico, de modo que mantenga la compatibilidad con versiones anteriores para aquellos quienes no usen las nuevas directivas. Dado que las nuevas políticas introducen una nueva API, estamos lanzándolas en Python 3.3 como una :term:`provisional policy <provisional package>`. Pueden producirse cambios incompatibles con versiones anteriores (hasta la eliminación del código) si los desarrolladores principales lo consideran necesario.

source: The new policies are instances of :class:`~email.policy.EmailPolicy`, and add the following additional controls:
es: Las nuevas directivas son instancias de :class:`~email.policy.EmailPolicy`, y agregan los siguientes controles adicionales:

source: Controls whether or not headers parsed by a :mod:`~email.parser` are refolded by the :mod:`~email.generator`. It can be ``none``, ``long``, or ``all``. The default is ``long``, which means that source headers with a line longer than ``max_line_length`` get refolded. ``none`` means no line get refolded, and ``all`` means that all lines get refolded.
es: Controla si los encabezados analizados por un :mod:`~email.parser` son replegados por :mod:`~email.generator`. Éste puede ser ``none``, ``long``, o ``all``. El valor por defecto es ``long``, lo que significa que los encabezados principales con una linea más larga que ``max_line_length`` se repliegan. ``none`` significa que no se repliega ninguna linea, y ``all`` significa que todas las lineas son replegadas.

source: A callable that take a ``name`` and ``value`` and produces a custom header object.
es: Un invocable que toma un ``nombre`` y un ``valor`` y produce un objeto de encabezado personalizado.

source: The ``header_factory`` is the key to the new features provided by the new policies. When one of the new policies is used, any header retrieved from a ``Message`` object is an object produced by the ``header_factory``, and any time you set a header on a ``Message`` it becomes an object produced by ``header_factory``. All such header objects have a ``name`` attribute equal to the header name. Address and Date headers have additional attributes that give you access to the parsed data of the header. This means you can now do things like this::
es: El ``header_factory`` es la clave a las nuevas características proporcionadas por las nuevas directivas. Cuando se usa una de las nuevas directivas, cualquier encabezado retornado por un objeto ``Message`` es un objeto producido por el ``header_factory``, y en cualquier momento que se establece un encabezado en un ``Message``, éste se convierte en un objeto producido por ``header_factory``. Todos éstos objetos de encabezado tienen un atributo ``name`` igual al nombre del encabezado. Los encabezados de direcciones y fechas tienen atributos adicionales que te dan acceso a los datos analizados del encabezado. Ésto significa que ahora puedes hacer cosas como ésta:

source: You will note that the unicode display name is automatically encoded as ``utf-8`` when the message is serialized, but that when the header is accessed directly, you get the unicode version. This eliminates any need to deal with the :mod:`email.header` :meth:`~email.header.decode_header` or :meth:`~email.header.make_header` functions.
es: Notarás que el nombre de visualización *Unicode* se codifica automáticamente como ``utf-8`` cuando se serializa el mensaje, pero que cuando se accede al encabezado directamente, obtienes la versión unicode. Ésto elimina cualquier necesidad de lidiar con las funciones :mod:`email.header` :meth:`~email.header.decode_header` or :meth:`~email.header.make_header`.

source: You can also create addresses from parts::
es: También puedes crear direcciones a partir de partes::

source: Decoding to unicode is done automatically::
es: La decodificación a *Unicode* se realiza automáticamente:

source: When you parse a message, you can use the ``addresses`` and ``groups`` attributes of the header objects to access the groups and individual addresses::
es: Cuando analizas un mensaje, puedes usar los atributos ``addresses`` y ``groups`` de los objetos de encabezado, para acceder a los grupos y direcciones individuales::

source: In summary, if you use one of the new policies, header manipulation works the way it ought to: your application works with unicode strings, and the email package transparently encodes and decodes the unicode to and from the RFC standard Content Transfer Encodings.
es: En resumen, si usas una de las nuevas directivas, la manipulación de encabezados funciona del modo que debería: Su aplicación funciona con cadenas *unicode*, y el paquete de correo electrónico codifica y decodifica de forma transparente el unicode desde y hacia las codificaciones de transferencia de contenido estándar RFC.

source: Other API Changes
es: Otros cambios en la API

source: New :class:`~email.parser.BytesHeaderParser`, added to the :mod:`~email.parser` module to complement :class:`~email.parser.HeaderParser` and complete the Bytes API.
es: Nuevo :class:`~email.parser.BytesHeaderParser`, añadido al módulo :mod:`~email.parser` para complementar :class:`~email.parser.HeaderParser` y completar la API Bytes.

source: New utility functions:
es: Nuevas funciones de utilidad:

source: :func:`~email.utils.format_datetime`: given a :class:`~datetime.datetime`, produce a string formatted for use in an email header.
es: :func:`~email.utils.format_datetime`: dado un :class:`~datetime.datetime`, produce una cadena formateada para su uso en un encabezado de correo electrónico.

source: :func:`~email.utils.parsedate_to_datetime`: given a date string from an email header, convert it into an aware :class:`~datetime.datetime`, or a naive :class:`~datetime.datetime` if the offset is ``-0000``.
es: :func:`email.utils.parsedate_to_datetime`: dada una cadena de fecha de un encabezado de correo electrónico, conviértela en un :class:`datetime.datetime`, o un ingenuo :class:`datetime.datetime` si el desplazamiento es ``-0000``.

source: :func:`~email.utils.localtime`: With no argument, returns the current local time as an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`. Given an aware :class:`~datetime.datetime`, converts it into an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`.
es: :func:`~email.utils.localtime`: Sin argumento, retorna la hora local actual como un reconocimiento :class:`~datetime.datetime` utilizando el local :class:`~datetime.timezone`. Teniendo en cuenta :class:`~datetime.datetime`, lo convierte en un :class:`~datetime.datetime` con el valor local :class:`~datetime.timezone`.

source: :class:`ftplib.FTP` now accepts a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Giampaolo Rodolà in :issue:`8594`.)
es: :class:`ftplib.FTP` ahora acepta un argumento de palabra clave ``source_address`` para especificar el ``(host, port)`` que se usará como dirección de origen en la llamada de enlace al crear el socket saliente. (Contribución de Giampaolo Rodolà en :issue:`8594`.)

source: The :class:`~ftplib.FTP_TLS` class now provides a new :func:`~ftplib.FTP_TLS.ccc` function to revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports. (Contributed by Giampaolo Rodolà in :issue:`12139`.)
es: La clase :class:`~ftplib.FTP_TLS` ahora proporciona una nueva función :func:`~ftplib.FTP_TLS.ccc` para revertir el canal de control a texto sin formato. Esto puede ser útil para aprovechar los firewalls que saben cómo manejar NAT con FTP no seguro sin abrir puertos fijos. (Contribución de Giampaolo Rodolà en :issue:`12139`.)

source: Added :meth:`ftplib.FTP.mlsd` method which provides a parsable directory listing format and deprecates :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`. (Contributed by Giampaolo Rodolà in :issue:`11072`.)
es: Añadido el método :meth:`ftplib.FTP.mlsd` que proporciona un formato de listado de directorios analizable y pone en desuso :meth:`ftplib.FTP.nlst` y :meth:`ftplib.FTP.dir`. (Contribución de Giampaolo Rodolà en :issue:`11072`.)

source: The :func:`functools.lru_cache` decorator now accepts a ``typed`` keyword argument (that defaults to ``False`` to ensure that it caches values of different types that compare equal in separate cache slots. (Contributed by Raymond Hettinger in :issue:`13227`.)
es: El decorador :func:`functools.lru_cache` ahora acepta un argumento de palabra clave ``typed`` (que por defecto tiene el valor ``False`` para asegurar que almacene en caché valores de diferentes tipos que se comparen igual en ranuras separadas de caché. (Contribución de Raymond Hettinger en :issue:`13227`.)

source: It is now possible to register callbacks invoked by the garbage collector before and after collection using the new :data:`~gc.callbacks` list.
es: Ahora es posible registrar devoluciones de llamadas invocadas por el recolector de basura antes y después de la recolección, utilizando la nueva lista :data:`~gc.callbacks`.

source: A new :func:`~hmac.compare_digest` function has been added to prevent side channel attacks on digests through timing analysis. (Contributed by Nick Coghlan and Christian Heimes in :issue:`15061`.)
es: Se ha agregado una nueva función :func:`~hmac.compare_digest` para prevenir los ataques de canales adyacentes en resúmenes durante el análisis de tiempos. (Contribución de Nick Coghlan y Christian Heimes en :issue:`15061`.)

source: :class:`http.server.BaseHTTPRequestHandler` now buffers the headers and writes them all at once when :meth:`~http.server.BaseHTTPRequestHandler.end_headers` is called. A new method :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` can be used to directly manage when the accumulated headers are sent. (Contributed by Andrew Schaaf in :issue:`3709`.)
es: :class:`http.server.BaseHTTPRequestHandler` ahora almacena en buffer los encabezados y los escribe todos a la vez cuando se llama a :meth:`~http.server.BaseHTTPRequestHandler.end_headers`. Se puede usar un nuevo método :meth:`~ http.server.BaseHTTPRequestHandler.flush_headers` para administrar directamente cuándo se envían los encabezados acumulados. (Contribución por Andrew Schaaf en :issue:`3709`.)

source: :class:`http.server` now produces valid ``HTML 4.01 strict`` output. (Contributed by Ezio Melotti in :issue:`13295`.)
es: :class:`http.server` ahora produce una salida ``HTML 4.01 strict`` válida. (Contribución de Ezio Melotti in :issue:`13295`)

source: :class:`http.client.HTTPResponse` now has a :meth:`~http.client.HTTPResponse.readinto` method, which means it can be used as an :class:`io.RawIOBase` class. (Contributed by John Kuhn in :issue:`13464`.)
es: La clase :class:`http.client.HTTPResponse` ahora tiene un método :meth:`~http.client.HTTPResponse.readinto`, lo que significa que puede ser usado como una clase :class:`io.RawIOBase`. (Contribución de John Kuhn in :issue:`13464`)
