Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: All other changes relate to semantic changes which should be taken into consideration when updating code for Python 3.3, and thus should be read about in the `Porting Python code`_ section of this document.
es: Todos los demás cambios se relacionan con los cambios de semántica que deben tomarse en cuenta al actualizar el código a python 3.3, por lo tanto, deben leerse en la sección `Portar código Python`_ de este documento.

source: (Implementation by Brett Cannon)
es: (Implementación por Brett Cannon)

source: Other Language Changes
es: Otros cambios de idioma

source: Some smaller changes made to the core Python language are:
es: Algunos cambios más pequeños realizados en el lenguaje Python principal son:

source: Added support for Unicode name aliases and named sequences. Both :func:`unicodedata.lookup()` and ``'\N{...}'`` now resolve name aliases, and :func:`unicodedata.lookup()` resolves named sequences too.
es: Se ha añadido compatibilidad con alias de nombres *Unicode* y secuencias con nombre. Tanto :func:`unicodedata.lookup()` como ``'N{...}'`` ahora resuelven los alias de nombre, y :func:`unicodedata.lookup()` también resuelve las secuencias con nombre.

source: (Contributed by Ezio Melotti in :issue:`12753`.)
es: (Contribución de Ezio Melotti en :issue:`12753`.)

source: Unicode database updated to UCD version 6.1.0
es: Base de datos *Unicode* actualizada a la versión 6.1.0 de UCD

source: Equality comparisons on :func:`range` objects now return a result reflecting the equality of the underlying sequences generated by those range objects. (:issue:`13201`)
es: Las comparaciones de igualdad en los objetos :func:`range` ahora retornan un resultado que refleja la igualdad de las secuencias subyacentes generadas por esos objetos de rango. (:issue:`13201`)

source: The ``count()``, ``find()``, ``rfind()``, ``index()`` and ``rindex()`` methods of :class:`bytes` and :class:`bytearray` objects now accept an integer between 0 and 255 as their first argument.
es: Los métodos ``count()``, ``find()``, ``rfind()``, ``index()`` y ``rindex()`` de los objetos :class:`bytes` y :class:`bytearray` ahora aceptan un entero entre 0 y 255 como su primer argumento.

source: (Contributed by Petri Lehtinen in :issue:`12170`.)
es: (Contribución por Petri Lehtinen en :issue:`12170`.)

source: The ``rjust()``, ``ljust()``, and ``center()`` methods of :class:`bytes` and :class:`bytearray` now accept a :class:`bytearray` for the ``fill`` argument. (Contributed by Petri Lehtinen in :issue:`12380`.)
es: Los métodos ``rjust()``, ``ljust()``, y ``center()`` de :class:`bytes` y :class:`bytearray` ahora aceptan un :class:`bytearray` para el argumento ``fill``. (Contribución de Petri Lehtinen en :issue:`12380`.)

source: New methods have been added to :class:`list` and :class:`bytearray`: ``copy()`` and ``clear()`` (:issue:`10516`). Consequently, :class:`~collections.abc.MutableSequence` now also defines a :meth:`~collections.abc.MutableSequence.clear` method (:issue:`11388`).
es: Se han agregado nuevos métodos a :class:`list` y :class:`bytearray`: ``copy()`` y ``clear()`` (:issue:`10516`). En consecuencia, :class:`~collections.abc.MutableSequence` ahora también definen un método :meth:`~collections.abc.MutableSequence.clear` (:issue:`11388`).

source: Raw bytes literals can now be written ``rb"..."`` as well as ``br"..."``.
es: Los literales de *bytes* sin formato ahora se pueden escribir ``rb"..."`` así como ``br"..."``.

source: (Contributed by Antoine Pitrou in :issue:`13748`.)
es: (Contribución de Antoine Pitrou en :issue:`13748`.)

source: :meth:`dict.setdefault` now does only one lookup for the given key, making it atomic when used with built-in types.
es: El método :meth:`dict.setdefault` ahora solo hace una sola búsqueda de la clave dada, haciéndola atómica cuando se usa con tipos incorporados.

source: (Contributed by Filip Gruszczyński in :issue:`13521`.)
es: (Contribución de Filip Gruszczyński en :issue:`13521`.)

source: The error messages produced when a function call does not match the function signature have been significantly improved.
es: Los mensajes de error producidos cuando la llamada de una función no coincide con la firma han sido mejorados significativamente.

source: (Contributed by Benjamin Peterson.)
es: (Contribución de Benjamin Peterson.)

source: A Finer-Grained Import Lock
es: Un bloqueo de importación más detallado

source: Previous versions of CPython have always relied on a global import lock. This led to unexpected annoyances, such as deadlocks when importing a module would trigger code execution in a different thread as a side-effect. Clumsy workarounds were sometimes employed, such as the :c:func:`PyImport_ImportModuleNoBlock` C API function.
es: Las versiones anteriores de CPython siempre se han basado en un bloqueo de importación global. Ésto conduce a problemas inesperados tales como bloqueos cuando la importación un módulo debería disparar la ejecución de código en un hilo diferente como un efecto secundario. A veces se empleaban soluciones torpes, como la función de API C :c:func:`PyImport_ImportModuleNoBlock` .

source: In Python 3.3, importing a module takes a per-module lock. This correctly serializes importation of a given module from multiple threads (preventing the exposure of incompletely initialized modules), while eliminating the aforementioned annoyances.
es: En Python 3.3, la importación de un módulo toma un bloqueo por módulo. Esto serializa correctamente la importación de un módulo determinado a partir de múltiples subprocesos (impidiendo la exposición de módulos inicializados incompletamente), mientras elimina las molestias antes mencionadas.

source: (Contributed by Antoine Pitrou in :issue:`9260`.)
es: (Contribución de Antoine Pitrou en :issue:`9260`.)

source: Builtin functions and types
es: Funciones y tipos incorporados

source: :func:`open` gets a new *opener* parameter: the underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). It can be used to use custom flags like :const:`os.O_CLOEXEC` for example. The ``'x'`` mode was added: open for exclusive creation, failing if the file already exists.
es: :func:`open` obtiene un nuevo parámetro *opener*: el descriptor de archivo subyacente para el objeto de archivo se obtiene llamando a *opener* con (*file*, *flags*). Se puede utilizar para utilizar banderas personalizadas como :const:`os.O_CLOEXEC`, por ejemplo. Se ha añadido el modo ``'x'`` : abierto para la creación exclusiva, fallando si el archivo ya existe.

source: :func:`print`: added the *flush* keyword argument. If the *flush* keyword argument is true, the stream is forcibly flushed.
es: :func:`print`: agregó el argumento de palabra clave *flush*. Si el argumento de palabra clave *flush* es verdadero, la secuencia se vacía por la fuerza.

source: :func:`hash`: hash randomization is enabled by default, see :meth:`object.__hash__` and :envvar:`PYTHONHASHSEED`.
es: :func:`hash`: la aleatorización de hash está habilitada de forma predeterminada, consulte :meth:`object.__hash__` y :envvar:`PYTHONHASHSEED`.

source: The :class:`str` type gets a new :meth:`~str.casefold` method: return a casefolded copy of the string, casefolded strings may be used for caseless matching. For example, ``'ß'.casefold()`` returns ``'ss'``.
es: El tipo :class:`str` obtiene un nuevo método :meth:`~str.casefold`: retorna una copia de la cadena con mayúsculas y minúsculas, las cadenas con mayúsculas y minúsculas se pueden utilizar para la coincidencia sin mayúsculas. Por ejemplo, ``'ß'.casefold()`` retorna ``'ss'``.

source: The sequence documentation has been substantially rewritten to better explain the binary/text sequence distinction and to provide specific documentation sections for the individual builtin sequence types (:issue:`4966`).
es: La documentación de secuencia se ha reescrito sustancialmente para explicar mejor la distinción de secuencia binaria/texto y para proporcionar secciones de documentación específicas para los tipos de secuencia individuales integrados(:issue:`4966`).

source: New Modules
es: Nuevos módulos

source: This new debug module :mod:`faulthandler` contains functions to dump Python tracebacks explicitly, on a fault (a crash like a segmentation fault), after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS`, and :const:`SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using :option:`-X` ``faulthandler`` command line option.
es: Este nuevo módulo de depuración :mod:`faulthandler` contiene funciones para volcar los rastreos de Python explícitamente, en una falla (como una falla de segmentación), después de un tiempo de espera o en una señal de usuario. Llame a :func:`faulthandler.enable` para instalar controladores de fallas para las señales :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS`, y :const:`SIGILL` . También puede habilitarlos al inicio configurando la variable de entorno :envvar:`PYTHONFAULTHANDLER` o usando la opción de línea de comandos :option:`-X` ``faulthandler`` .

source: Example of a segmentation fault on Linux:
es: Ejemplo de una falla de segmentación en Linux:

source: The new :mod:`ipaddress` module provides tools for creating and manipulating objects representing IPv4 and IPv6 addresses, networks and interfaces (i.e. an IP address associated with a specific IP subnet).
es: El nuevo módulo :mod:`ipaddress` proporciona herramientas para crear y manipular objetos que representen direcciones, redes e interfaces IPv4 e IPv6 (es decir, alguna dirección IP asociada con una subred IP específica)

source: (Contributed by Google and Peter Moody in :pep:`3144`.)
es: (Contribución de Google y Peter Moody en :pep:`3144` )

source: The newly added :mod:`lzma` module provides data compression and decompression using the LZMA algorithm, including support for the ``.xz`` and ``.lzma`` file formats.
es: El módulo :mod:`lzma` recién agregado proporciona compresión y descompresión de datos utilizando el algoritmo LZMA, incluida la compatibilidad con los formatos de archivo ``.xz`` y ``.lzma``.

source: (Contributed by Nadeem Vawda and Per Øyvind Karlsen in :issue:`6715`.)
es: (Contribución de Nadeem Vawda y Per Øyvind Karlsen en :issue:`6715`.)

source: Improved Modules
es: Módulos mejorados

source: Improved support for abstract base classes containing descriptors composed with abstract methods. The recommended approach to declaring abstract descriptors is now to provide :attr:`__isabstractmethod__` as a dynamically updated property. The built-in descriptors have been updated accordingly.
es: Soporte mejorado para las clases base abstractas que contienen descriptores compuestos con métodos abstractos. El enfoque recomendado para declarar descriptores abstractos ahora es proporcionar :attr:`__isabstractmethod__` como una propiedad actualizada dinámicamente. Los descriptores integrados han sido actualizados en consecuencia.

source: :class:`abc.abstractproperty` has been deprecated, use :class:`property` with :func:`abc.abstractmethod` instead.
es: La clase :class:`abc.abstractproperty` ha quedado obsoleta, en su lugar use la clase :class:`property` con :func:`abc.abstractmethod`.

source: :class:`abc.abstractclassmethod` has been deprecated, use :class:`classmethod` with :func:`abc.abstractmethod` instead.
es: La clase :class:`abc.abstractclassmethod` ha quedado obsoleta. En su lugar use el método :class:`classmethod` with :func:`abc.abstractmethod`.

source: :class:`abc.abstractstaticmethod` has been deprecated, use :class:`staticmethod` with :func:`abc.abstractmethod` instead.
es: :class:`abc.abstractstaticmethod` ha quedado obsoleta, use :class:`staticmethod` with :func:`abc.abstractmethod`.

source: (Contributed by Darren Dale in :issue:`11610`.)
es: (Contribución de Darren Dale en :issue:`11610`. )

source: :meth:`abc.ABCMeta.register` now returns the registered subclass, which means it can now be used as a class decorator (:issue:`10868`).
es: El método :meth:`abc.ABCMeta.register` ahora retorna las subclases registradas, lo cual significa que ahora éste puede ser usado como un decorador de clases (:issue:`10868`).

source: The :mod:`array` module supports the :c:expr:`long long` type using ``q`` and ``Q`` type codes.
es: El módulo :mod:`array` admite el tipo :c:expr:`long long` utilizando los códigos de tipo ``q`` y ``Q``.

source: (Contributed by Oren Tirosh and Hirokazu Yamamoto in :issue:`1172711`.)
es: (Contribución de Oren Tirosh y Hirokazu Yamamoto en :issue:`1172711`.)

source: ASCII-only Unicode strings are now accepted by the decoding functions of the :mod:`base64` modern interface. For example, ``base64.b64decode('YWJj')`` returns ``b'abc'``. (Contributed by Catalin Iacob in :issue:`13641`.)
es: Las cadenas *Unicode* de solo ASCII ahora son aceptadas por las funciones de decodificación de la interfaz moderna :mod:`base64`. Por ejemplo, ``base64.b64decode ('YWJj')`` retorna ``b'abc'``. (Contribución por Catalin Iacob en: número: `13641`.)

source: In addition to the binary objects they normally accept, the ``a2b_`` functions now all also accept ASCII-only strings as input. (Contributed by Antoine Pitrou in :issue:`13637`.)
es: Además de los objetos binarios que normalmente aceptan, las funciones ``a2b_`` ahora también aceptan cadenas de sólo ASCII como dato de entrada. (Contribución por Antoine Petrou en :issue:`13637`.)

source: The :mod:`bz2` module has been rewritten from scratch. In the process, several new features have been added:
es: El módulo :mod:`bz2` ha sido reescrito desde cero. Durante el proceso, han sido agregadas varias características:

source: New :func:`bz2.open` function: open a bzip2-compressed file in binary or text mode.
es: Nueva función :func:`bz2.open`: abre un archivo comprimido por bzip2, en modo binario o en modo de texto.

source: :class:`bz2.BZ2File` can now read from and write to arbitrary file-like objects, by means of its constructor's *fileobj* argument.
es: :class:`bz2.BZ2File` ahora puede leer y escribir en objetos de tipo archivo arbitrarios, mediante el argumento *fileobj* de su constructor.

source: (Contributed by Nadeem Vawda in :issue:`5863`.)
es: (Contribución de Nadeem Vawda en :issue:`5863`.)

source: :class:`bz2.BZ2File` and :func:`bz2.decompress` can now decompress multi-stream inputs (such as those produced by the :program:`pbzip2` tool). :class:`bz2.BZ2File` can now also be used to create this type of file, using the ``'a'`` (append) mode.
es: La clase :class:`bz2.BZ2File` y la función :func:`bz2.decompress` ahora descomprimen entradas de flujo múltiple (como las producidas por la herramienta :program:`pbzip2`). La clase :class:`bz2.BZ2File` ahora puede ser usada también para crear este tipo de archivos, usando el modo ``'a'`` (agregar).

source: (Contributed by Nir Aides in :issue:`1625`.)
es: (Contribución de Nir Aides en :issue:`1625`.)

source: :class:`bz2.BZ2File` now implements all of the :class:`io.BufferedIOBase` API, except for the :meth:`detach` and :meth:`truncate` methods.
es: La clase :class:`bz2.BZ2File` ahora implementa toda la API :class:`io.BufferedIOBase`, excepto los métodos :meth:`detach` y :meth:`truncate`.

source: codecs
es: códecs

source: The :mod:`~encodings.mbcs` codec has been rewritten to handle correctly ``replace`` and ``ignore`` error handlers on all Windows versions. The :mod:`~encodings.mbcs` codec now supports all error handlers, instead of only ``replace`` to encode and ``ignore`` to decode.
es: El códec :mod:`~encodings.mbcs` ha sido reescrito para manejar correctamente los controladores de error ``reemplazar`` e ``ignorar`` en todas las versiones Windows. El códec :mod:`~encodings.mbcs` ahora admite todos los controladores de error, en lugar de solo ``replace`` para codificar e ``ignore`` para decodificar.

source: A new Windows-only codec has been added: ``cp65001`` (:issue:`13216`). It is the Windows code page 65001 (Windows UTF-8, ``CP_UTF8``). For example, it is used by ``sys.stdout`` if the console output code page is set to cp65001 (e.g., using ``chcp 65001`` command).
es: Ha sido agregado un nuevo códec únicamente para windows: ``cp65001`` (:issue:`13216`). Es la página de códigos de Windows con el código 65001 (Windows UTF-8, ``CP_UTF8``). Por ejemplo, es usado por ``sys.stdout`` si la página de códigos de salida de la consola se establece en cp65001 (por ejemplo, usando el comando ``chcp 65001``).

source: Multibyte CJK decoders now resynchronize faster. They only ignore the first byte of an invalid byte sequence. For example, ``b'\xff\n'.decode('gb2312', 'replace')`` now returns a ``\n`` after the replacement character.
es: Los decodificadores CJK multibyte ahora se re-sincronizan más rápido. Solo ignoran el primer byte de una secuencia de *bytes* no válida. Por ejemplo, ``b'\xff\n'.decode('gb2312', 'replace')`` ahora retorna un ``\n`` después del carácter de reemplazo.

source: Incremental CJK codec encoders are no longer reset at each call to their encode() methods. For example::
es: Los codificadores de códec incrementales CJK ya no se restablecen en cada llamada a sus métodos encode(). Por ejemplo::

source: This example gives ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` with older Python versions.
es: Este ejemplo resulta ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` con versiones anteriores de Python.

source: The ``unicode_internal`` codec has been deprecated.
es: El códec ``unicode_internal`` ha quedado obsoleto.

source: collections
es: colecciones

source: Addition of a new :class:`~collections.ChainMap` class to allow treating a number of mappings as a single unit. (Written by Raymond Hettinger for :issue:`11089`, made public in :issue:`11297`.)
es: Adición de una nueva :class:`~collections.ChainMap` para permitir el tratamiento de un número de asignaciones como una sola unidad. (Escrito por Raymond Hettinger para :issue:`11089`, publicado en :issue:`11297`.)

source: The abstract base classes have been moved in a new :mod:`collections.abc` module, to better differentiate between the abstract and the concrete collections classes. Aliases for ABCs are still present in the :mod:`collections` module to preserve existing imports. (:issue:`11085`)
es: Las clases base abstractas se han movido en un nuevo módulo :mod:`collections.abc`, para diferenciar mejor entre las clases de colecciones abstractas y concretas. Los alias para ABC siguen presentes en el módulo :mod:`collections` para preservar las importaciones existentes. (:issue:`11085`)

source: The :class:`~collections.Counter` class now supports the unary ``+`` and ``-`` operators, as well as the in-place operators ``+=``, ``-=``, ``|=``, and ``&=``. (Contributed by Raymond Hettinger in :issue:`13121`.)
es: La clase :class:`~collections.Counter` ahora admite los operadores ''+'' y ''-'' unarios, así como los operadores in situ ``+=``, ``-=``, ``|=``, and ``&=``. (Contribución de Raymond Hettinger en :issue:`13121`.)

source: :class:`~contextlib.ExitStack` now provides a solid foundation for programmatic manipulation of context managers and similar cleanup functionality. Unlike the previous ``contextlib.nested`` API (which was deprecated and removed), the new API is designed to work correctly regardless of whether context managers acquire their resources in their ``__init__`` method (for example, file objects) or in their ``__enter__`` method (for example, synchronisation objects from the :mod:`threading` module).
es: :class:`~contextlib. ExitStack` ahora proporciona una base sólida para la manipulación programática de los administradores de contexto y una funcionalidad de limpieza similar. A diferencia de la API anterior ``contextlib.nested`` (que estaba en desuso y se eliminó), la nueva API está diseñada para funcionar correctamente independientemente de si los administradores de contexto adquieren sus recursos en su método ``__init__`` (por ejemplo, objetos de archivo) o en su método ``__enter__`` (por ejemplo, objetos de sincronización del módulo :mod:`threading`).

source: Addition of salt and modular crypt format (hashing method) and the :func:`~crypt.mksalt` function to the :mod:`crypt` module.
es: Adición de sal y formato de cripta modular (método de hashing) y la función :func:`~crypt.mksalt` al módulo :mod:`crypt`.

source: If the :mod:`curses` module is linked to the ncursesw library, use Unicode functions when Unicode strings or characters are passed (e.g. :c:func:`waddwstr`), and bytes functions otherwise (e.g. :c:func:`waddstr`).
es: Si el módulo :mod:`curses` es vinculado a la nueva librería ncursesw, se usan las funciones *Unicode* cuando se pasen cadenas o caracteres Unicode (por ejemplo, la función :c:func:`waddwstr`) o en caso contrario, funciones de *bytes* (e.g. :c:func:`waddstr`).

source: Use the locale encoding instead of ``utf-8`` to encode Unicode strings.
es: Usa la codificación local en vez de ``utf-8`` para codificar cadenas *Unicode*.

source: :class:`curses.window` has a new :attr:`curses.window.encoding` attribute.
es: La clase :class:`curses.window` tiene un nuevo atributo :attr:`curses.window.encoding`.

source: The :class:`curses.window` class has a new :meth:`~curses.window.get_wch` method to get a wide character
es: La clase :class:`curses.window` tiene un nuevo método :meth:`~curses.window.get_wch` para obtener un caracter ancho

source: The :mod:`curses` module has a new :meth:`~curses.unget_wch` function to push a wide character so the next :meth:`~curses.window.get_wch` will return it
es: El módulo :mod:`curses` tiene una nueva función :meth:`~curses.unget_wch` para enviar un caracter ancho de manera que el próximo :meth:`~curses.window.get_wch` lo retorne

source: (Contributed by Iñigo Serna in :issue:`6755`.)
es: (Contribución por Iñigo Serna en :issue:`6755`.)

source: Equality comparisons between naive and aware :class:`~datetime.datetime` instances now return :const:`False` instead of raising :exc:`TypeError` (:issue:`15006`).
es: Las comparaciones de igualdad entre instancias conscientes e ingenuas :class:`~datetime.datetime` ahora retornan :const:`False` en lugar de generar :exc:`TypeError` (:issue:`15006`).

source: New :meth:`datetime.datetime.timestamp` method: Return POSIX timestamp corresponding to the :class:`~datetime.datetime` instance.
es: Nuevo método :meth:`datetime.datetime.timestamp`: Retorna la marca de tiempo POSIX correspondiente a la instancia :class:`~datetime.datetime`.

source: The :meth:`datetime.datetime.strftime` method supports formatting years older than 1000.
es: El método :meth:`datetime.datetime.strftime` admite el formato de años anteriores a 1000.

source: The :meth:`datetime.datetime.astimezone` method can now be called without arguments to convert datetime instance to the system timezone.
es: Ahora se puede llamar al método :meth:`datetime.datetime.astimezone` sin argumentos para convertir la instancia datetime en la zona horaria del sistema.

source: :issue:`7652` - integrate fast native decimal arithmetic.
es: :issue:`7652` - integrar la aritmética decimal nativa rápida.

source: C-module and libmpdec written by Stefan Krah.
es: Módulo C y libmpdec escritos por Stefan Krah.

source: The new C version of the decimal module integrates the high speed libmpdec library for arbitrary precision correctly rounded decimal floating point arithmetic. libmpdec conforms to IBM's General Decimal Arithmetic Specification.
es: La nueva versión C del módulo decimal integra la biblioteca libmpdec de alta velocidad para aritmética de coma flotante decimal redondeada correctamente con precisión arbitraria. libmpdec se ajusta a la especificación de aritmética decimal general de IBM.
