Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: What's New In Python 3.3
es: Qué hay de nuevo en Python 3.3

source: This article explains the new features in Python 3.3, compared to 3.2. Python 3.3 was released on September 29, 2012. For full details, see the `changelog <https://docs.python.org/3.3/whatsnew/changelog.html>`_.
es: Éste artículo explica las nuevas características en python 3.3, en comparación con la versión 3.2. Python 3.3 se lanzó el 29 de septiembre de 2012. Para más detalles, ver el log de cambios en la dirección <https://docs.python.org/3.3/whatsnew/changelog.html>.

source: :pep:`398` - Python 3.3 Release Schedule
es: :pep:`398` - Calendario de Publicación Python 3.3

source: Summary -- Release highlights
es: Resumen -- Aspectos destacados de la versión

source: New syntax features:
es: Nuevas características de sintaxis:

source: New ``yield from`` expression for :ref:`generator delegation <pep-380>`.
es: Nueva expresión ``yield from`` para :ref:`delegación de generadores<pep-380>`.

source: The ``u'unicode'`` syntax is accepted again for :class:`str` objects.
es: La sintaxis ``u'unicode'`` se acepta de nuevo para los objetos :class:`str`.

source: New library modules:
es: Nuevos módulos de biblioteca:

source: :mod:`faulthandler` (helps debugging low-level crashes)
es: :mod:`faulthandler` (ayuda a depurar bloqueos de bajo nivel)

source: :mod:`ipaddress` (high-level objects representing IP addresses and masks)
es: :mod:`ipaddress` (Objetos de alto nivel que representan direcciones IP y máscaras)

source: :mod:`lzma` (compress data using the XZ / LZMA algorithm)
es: :mod:`lzma` (comprime datos usando el algoritmo XZ / LZMA)

source: :mod:`unittest.mock` (replace parts of your system under test with mock objects)
es: :mod:`unittest.mock` (Utiliza objetos que simulen partes de tu sistema en ambiente de pruebas)

source: :mod:`venv` (Python :ref:`virtual environments <pep-405>`, as in the popular ``virtualenv`` package)
es: :mod:`venv` (Python :ref:`entornos virtuales <pep-405>`, como en el paquete original Virtualenv)

source: New built-in features:
es: Nuevas características incorporadas:

source: Reworked :ref:`I/O exception hierarchy <pep-3151>`.
es: Se reformula la :ref:`Jerarquía de excepción I/O <pep-3151>` .

source: Implementation improvements:
es: Mejoras de implementación:

source: Rewritten :ref:`import machinery <importlib>` based on :mod:`importlib`.
es: Se reescribe :ref:`Maquinaria de importación <importlib>` con base en :mod:`importlib`.

source: More compact :ref:`unicode strings <pep-393>`.
es: :ref:`cadenas de caracteres unicode <pep-393>` más compactas.

source: More compact :ref:`attribute dictionaries <pep-412>`.
es: :ref:`diccionarios de atributos <pep-412>` más compactos.

source: Significantly Improved Library Modules:
es: Módulos de biblioteca con mejoras significativas:

source: C Accelerator for the :ref:`decimal <new-decimal>` module.
es: Acelerador de C para el módulo :ref:`decimal <new-decimal>` .

source: Better unicode handling in the :ref:`email <new-email>` module (:term:`provisional <provisional package>`).
es: Mejor gestión de *unicode* en el módulo :ref:`email <new-email>` (:term:`provisional <provisional package>`).

source: Security improvements:
es: Mejoras de seguridad:

source: Hash randomization is switched on by default.
es: La aleatoriedad en los hash está habilitada de forma predeterminada.

source: Please read on for a comprehensive list of user-facing changes.
es: Por favor continúa leyendo para obtener una lista completa de los cambios de cara al usuario.

source: PEP 405: Virtual Environments
es: PEP 405: Entornos virtuales

source: Virtual environments help create separate Python setups while sharing a system-wide base install, for ease of maintenance. Virtual environments have their own set of private site packages (i.e. locally installed libraries), and are optionally segregated from the system-wide site packages. Their concept and implementation are inspired by the popular ``virtualenv`` third-party package, but benefit from tighter integration with the interpreter core.
es: Los entornos virtuales ayudan a crear configuraciones separadas de Python mientras comparten una instalación base en todo el sistema, para facilitar el mantenimiento. Los entornos virtuales tienen su propio conjunto de paquetes de sitios privados (es decir, bibliotecas instaladas localmente) y están opcionalmente segregados de los paquetes de sitios de todo el sistema. Su concepto e implementación están inspirados en el popular paquete de terceros ``virtualenv``, pero se benefician de una integración más estrecha con el núcleo del intérprete.

source: This PEP adds the :mod:`venv` module for programmatic access, and the ``pyvenv`` script for command-line access and administration. The Python interpreter checks for a ``pyvenv.cfg``, file whose existence signals the base of a virtual environment's directory tree.
es: Este PEP agrega el módulo :mod:`venv` para acceso programático, y el *script* ``pyvenv`` para administración y acceso a través de línea de comandos. El intérprete de python busca un archivo llamado ``pyvenv.cfg``, cuya existencia señala la base de un árbol de directorios en el entorno virtual.

source: :pep:`405` - Python Virtual Environments
es: :pep:`405` - Entornos virtuales en python

source: PEP written by Carl Meyer; implementation by Carl Meyer and Vinay Sajip
es: PEP escrito por Carl Meyer; implementación por Carl Meyer y Vinay Sajip

source: PEP 420: Implicit Namespace Packages
es: PEP 420: Paquetes para espacios de nombres implícitos

source: Native support for package directories that don't require ``__init__.py`` marker files and can automatically span multiple path segments (inspired by various third party approaches to namespace packages, as described in :pep:`420`)
es: Soporte nativo para directorios de paquetes que no requieran el archivo ``__init.py__`` y puedan abarcar automáticamente múltiples segmentos de rutas de acceso (Inspirado en varios enfoques de terceros para espacios de nombres de paquetes, tal como está especificado en :pep:`420`)

source: :pep:`420` - Implicit Namespace Packages
es: :pep:`420` - Paquetes de espacio de nombres implícitos

source: PEP written by Eric V. Smith; implementation by Eric V. Smith and Barry Warsaw
es: PEP escrito por Eric V. Smith; implementación por Eric V. Smith y Barry Warsaw

source: PEP 3118: New memoryview implementation and buffer protocol documentation
es: PEP 3118: Nueva implementación de vista de memoria y en la documentación del protocolo del buffer

source: The implementation of :pep:`3118` has been significantly improved.
es: La implementación del :pep:`3118` ha tenido mejoras significativas.

source: The new memoryview implementation comprehensively fixes all ownership and lifetime issues of dynamically allocated fields in the Py_buffer struct that led to multiple crash reports. Additionally, several functions that crashed or returned incorrect results for non-contiguous or multi-dimensional input have been fixed.
es: La nueva implementación de la vista de memoria corrige exhaustivamente todos los problemas de propiedad y duración de los campos asignados dinámicamente en la estructura de Py_buffer que ha dado lugar a varios informes de bloqueo. Además, se han corregido varias funciones que se bloquearon o retornaron resultados incorrectos para entradas no contigua o multidimensional.

source: The memoryview object now has a PEP-3118 compliant getbufferproc() that checks the consumer's request type. Many new features have been added, most of them work in full generality for non-contiguous arrays and arrays with suboffsets.
es: El objeto de vista de memoria dispone ahora de PEP-3118 que obedece a getbufferproc(), el cual verifica el tipo de petición del cliente. Se han agregado nuevas características, la mayoría de ellas funcionan generalmente para arrays no contiguos y arrays con subindices.

source: The documentation has been updated, clearly spelling out responsibilities for both exporters and consumers. Buffer request flags are grouped into basic and compound flags. The memory layout of non-contiguous and multi-dimensional NumPy-style arrays is explained.
es: La documentación se ha actualizado y se han establecido claramente las responsabilidades tanto para los exportadores como para los consumidores. Los indicadores de solicitud de buffer se agrupan en indicadores básicos y compuestos. Se explica el diseño de memoria de matrices de estilo NumPy no contiguas y multidimensionales.

source: Features
es: Características

source: All native single character format specifiers in struct module syntax (optionally prefixed with '@') are now supported.
es: Ahora se admiten todos los especificadores nativos de formato de un solo carácter en la sintaxis del módulo de estructura (opcionalmente con el prefijo '@').

source: With some restrictions, the cast() method allows changing of format and shape of C-contiguous arrays.
es: Con algunas reestricciones, el método cast() permite cambiar el formato y forma de los arrays contiguos.

source: Multi-dimensional list representations are supported for any array type.
es: La representación de listas multidimensionales es aceptada por cualquier tipo de array.

source: Multi-dimensional comparisons are supported for any array type.
es: Se admiten comparaciones multidimensionales para cualquier tipo de array.

source: One-dimensional memoryviews of hashable (read-only) types with formats B, b or c are now hashable. (Contributed by Antoine Pitrou in :issue:`13411`.)
es: Los objetos de vista de memoria unidimensionales de tipo hash con formatos B, b, o c ahora son hashables (Contribución por Antoine Pitrou en el issue `13411`.)

source: Arbitrary slicing of any 1-D arrays type is supported. For example, it is now possible to reverse a memoryview in O(1) by using a negative step.
es: Se admite el corte arbitrario de cualquier tipo de array unidimensional. Por ejemplo, ahora es posible revertir una vista de memoria en O(1) utilizando un valor negativo para el índice STEP.

source: API changes
es: Cambios en la API

source: The maximum number of dimensions is officially limited to 64.
es: Oficialmente, se limita el número máximo de dimensiones a 64.

source: The representation of empty shape, strides and suboffsets is now an empty tuple instead of ``None``.
es: Las formas vacías, pasos, y subíndices ahora son representados por una tupla vacía, en vez de ``None``.

source: Accessing a memoryview element with format 'B' (unsigned bytes) now returns an integer (in accordance with the struct module syntax). For returning a bytes object the view must be cast to 'c' first.
es: El acceso al elemento de una vista de memoria con formato 'B' (bytes sin signo) ahora retorna un entero (de acuerdo con la sintaxis del módulo de estructura). Para retornar un objeto *bytes*, primero la vista debe ser convertida a "C".

source: memoryview comparisons now use the logical structure of the operands and compare all array elements by value. All format strings in struct module syntax are supported. Views with unrecognised format strings are still permitted, but will always compare as unequal, regardless of view contents.
es: las comparaciones de la vista de memoria ahora utilizan la estructura lógica de los operandos y comparan todos los elementos de array por valor. Se admiten todos los formatos strings en la sintaxis del módulo de estructura. Aún se admiten las vistas con strings que tengan un formato no reconocido, pero siempre se compararan como desiguales, independientemente del contenido de la vista.

source: For further changes see `Build and C API Changes`_ and `Porting C code`_.
es: Para más cambios, consulte `Compilación y cambios en la API de C`_ y `Portabilidad del código C`_.

source: (Contributed by Stefan Krah in :issue:`10181`.)
es: (Contribución por Stefan Krah en el issue `10181` .)

source: :pep:`3118` - Revising the Buffer Protocol
es: :pep:`3118` - Revisando el protocolo de buffer

source: PEP 393: Flexible String Representation
es: PEP 393: Representación flexible de cadenas de caracteres

source: The Unicode string type is changed to support multiple internal representations, depending on the character with the largest Unicode ordinal (1, 2, or 4 bytes) in the represented string. This allows a space-efficient representation in common cases, but gives access to full UCS-4 on all systems. For compatibility with existing APIs, several representations may exist in parallel; over time, this compatibility should be phased out.
es: El tipo de cadena *Unicode* es modificado para admitir múltiples representaciones internas, dependiendo del caracter con el ordinal Unicode más grande (1, 2 o 4 *bytes*) en la cadena representada. Esto permite una representación que ahorra espacio en casos comunes, pero da acceso a UCS-4 completo en todos los sistemas. Para compatibilidad con APIS existentes, pueden existir varias representaciones en paralelo; con el tiempo, esta compatibilidad debería eliminarse gradualmente.

source: On the Python side, there should be no downside to this change.
es: Por parte de Python, no debería haber inconvenientes por éste cambio.

source: On the C API side, :pep:`393` is fully backward compatible. The legacy API should remain available at least five years. Applications using the legacy API will not fully benefit of the memory reduction, or - worse - may use a bit more memory, because Python may have to maintain two versions of each string (in the legacy format and in the new efficient storage).
es: Por parte de la API de C, :pep:`393` es totalmente compatible con versiones anteriores. La API antigua debería quedar disponible al menos por cinco años. Las aplicaciones que usan la API antigua no saldrán beneficiadas por la reducción de memoria, o -peor- podrían usar un bit más de memoria, debido a que python necesitaría mantener dos versiones de cada cadena de caracteres (en el formato antiguo y en el nuevo almacenamiento)

source: Functionality
es: Funcionalidad

source: Changes introduced by :pep:`393` are the following:
es: Los cambios introducidos en el :pep:`393` son los siguientes:

source: Python now always supports the full range of Unicode code points, including non-BMP ones (i.e. from ``U+0000`` to ``U+10FFFF``). The distinction between narrow and wide builds no longer exists and Python now behaves like a wide build, even under Windows.
es: Ahora python admite siempre el rango completo de códigos *Unicode*, incluyendo los que no son BMP (es decir, ``U+0000`` to ``U+10FFFF``). La distinción entre ancho y angosto ya no existe, y python se comporta ahora como una compilación amplia, incluso en sistemas windows.

source: With the death of narrow builds, the problems specific to narrow builds have also been fixed, for example:
es: Con la eliminación de las construcciones estrechas, han sido solucionados también los problemas específicos referentes a este tipo de construcciones, por ejemplo:

source: :func:`len` now always returns 1 for non-BMP characters, so ``len('\U0010FFFF') == 1``;
es: :func:`len` Ahora siempre retorna 1 para los caracteres que no son BMP, de modo que ``len('\U0010FFFF') == 1``;

source: surrogate pairs are not recombined in string literals, so ``'\uDBFF\uDFFF' != '\U0010FFFF'``;
es: los pares sustitutos no se recombinan en cadenas literales, de modo que ``'\uDBFF\uDFFF' != '\U0010FFFF'``;

source: indexing or slicing non-BMP characters returns the expected value, so ``'\U0010FFFF'[0]`` now returns ``'\U0010FFFF'`` and not ``'\uDBFF'``;
es: la indexación o el corte de caracteres que no son BMP, retorna el valor esperado, de modo que ``'\U0010FFFF'[0]`` ahora retorna ``'\U0010FFFF'`` y no ``'\uDBFF'``;

source: all other functions in the standard library now correctly handle non-BMP code points.
es: todas las demás funciones en la librería estándar ahora gestionan de forma correcta los puntos de código que no son BMP.

source: The value of :data:`sys.maxunicode` is now always ``1114111`` (``0x10FFFF`` in hexadecimal). The :c:func:`!PyUnicode_GetMax` function still returns either ``0xFFFF`` or ``0x10FFFF`` for backward compatibility, and it should not be used with the new Unicode API (see :issue:`13054`).
es: El valor de :data:`sys.maxunicode` ahora es siempre ``1114111`` (``0x10FFFF`` en hexadecimal). La función :c:func:`!PyUnicode_GetMax` aún devuelve ``0xFFFF`` o ``0x10FFFF`` por compatibilidad con versiones anteriores y no debe usarse con la nueva API Unicode (consulte :issue:`13054`).

source: The :file:`./configure` flag ``--with-wide-unicode`` has been removed.
es: Se ha eliminado el indicador :file:`./configure` ``--with-wide-unicode``.

source: Performance and resource usage
es: Rendimiento y uso de recursos

source: The storage of Unicode strings now depends on the highest code point in the string:
es: El almacenamiento de las cadenas *Unicode* ahora depende del punto de código más alto en la cadena:

source: pure ASCII and Latin1 strings (``U+0000-U+00FF``) use 1 byte per code point;
es: las cadenas de caracteres en ASCII puro y Latin1 (``U+0000-U+00FF``) usan 1 byte por punto de código;

source: BMP strings (``U+0000-U+FFFF``) use 2 bytes per code point;
es: Las cadenas de caracteres BMP (``U+0000-U+FFFF``) usan 2 *bytes* por punto de código;

source: non-BMP strings (``U+10000-U+10FFFF``) use 4 bytes per code point.
es: las cadenas de caracteres que no son BMP (``U+10000-U+10FFFF``) usan 4 *bytes* por punto de código.

source: The net effect is that for most applications, memory usage of string storage should decrease significantly - especially compared to former wide unicode builds - as, in many cases, strings will be pure ASCII even in international contexts (because many strings store non-human language data, such as XML fragments, HTTP headers, JSON-encoded data, etc.). We also hope that it will, for the same reasons, increase CPU cache efficiency on non-trivial applications. The memory usage of Python 3.3 is two to three times smaller than Python 3.2, and a little bit better than Python 2.7, on a Django benchmark (see the PEP for details).
es: El efecto neto es que para la mayoría de las aplicaciones, el uso de memoria del almacenamiento de cadenas de caracteres debería disminuir significativamente, especialmente en comparación con las construcciones *unicode* anchas, ya que, en muchos casos, las cadenas serán ASCII puro incluso en contextos internacionales (porque muchas cadenas almacenan datos en lenguaje no humano, tal como fragmentos XML, encabezados HTTP, datos codificados en JSON, etc.). También esperamos que, por las mismas razones, aumente la eficiencia de la caché de la CPU en aplicaciones no triviales. El uso de memoria de Python 3.3 es dos o tres veces más pequeño que Python 3.2, y un poco mejor que Python 2.7, en un punto de referencia de Django (consulte el PEP para obtener más detalles).

source: :pep:`393` - Flexible String Representation
es: :pep:`393` - Representación flexible de cadenas de caracteres

source: PEP written by Martin von Löwis; implementation by Torsten Becker and Martin von Löwis.
es: PEP escrito por Martin von Lowis; implementado por Torsten Becker y Martin von Lowis.

source: PEP 397: Python Launcher for Windows
es: PEP 397: Lanzador de python para windows

source: The Python 3.3 Windows installer now includes a ``py`` launcher application that can be used to launch Python applications in a version independent fashion.
es: El instalador de Python 3.3 para windows ahora incluye una aplicación lanzadora ``py`` que puede ser utilizada para ejecutar aplicaciones python de forma independiente de la versión.

source: This launcher is invoked implicitly when double-clicking ``*.py`` files. If only a single Python version is installed on the system, that version will be used to run the file. If multiple versions are installed, the most recent version is used by default, but this can be overridden by including a Unix-style "shebang line" in the Python script.
es: Este lanzador se invoca de forma implícita cuando haces doble click en archivos ``*.py``. Si el sistema tiene instalada una única versión de python, ésta versión será usada para ejecutar el archivo. Si hay múltiples versiones instaladas en el sistema, se utilizara por defecto la versión más reciente pero ésto puede ser anulado incluyendo una "línea shebang" estilo Unix en el *script* de Python.

source: The launcher can also be used explicitly from the command line as the ``py`` application. Running ``py`` follows the same version selection rules as implicitly launching scripts, but a more specific version can be selected by passing appropriate arguments (such as ``-3`` to request Python 3 when Python 2 is also installed, or ``-2.6`` to specifically request an earlier Python version when a more recent version is installed).
es: El lanzador también se puede usar explícitamente desde la línea de comando como la aplicación ``py``. La ejecución de ``py`` sigue las mismas reglas de selección de versión que la ejecución implícita de scripts, pero se puede seleccionar una versión más específica pasando los argumentos apropiados (como ``-3`` para solicitar Python 3 cuando Python 2 también está instalado, o ``-2.6`` para solicitar específicamente una versión anterior de Python cuando se instala una versión más reciente).

source: In addition to the launcher, the Windows installer now includes an option to add the newly installed Python to the system PATH. (Contributed by Brian Curtin in :issue:`3561`.)
es: Además del lanzador, el instalador de Windows ahora incluye una opción para agregar el Python recién instalado al PATH del sistema. (Contribución de Brian Curtin en :issue:`3561`.)

source: :pep:`397` - Python Launcher for Windows
es: :pep: `397` - Lanzador de Python para Windows

source: PEP written by Mark Hammond and Martin v. Löwis; implementation by Vinay Sajip.
es: PEP escrito por Mark Hammond y Martin v. Löwis; implementado por Vinay Sajip.

source: Launcher documentation: :ref:`launcher`
es: Documentación del lanzador: :ref:`launcher`

source: Installer PATH modification: :ref:`windows-path-mod`
es: Modificación de la ruta del instalador: :ref:`windows-path-mod`

source: PEP 3151: Reworking the OS and IO exception hierarchy
es: PEP 3151: Reelaborando de la jerarquía de excepciones de IO y OS

source: The hierarchy of exceptions raised by operating system errors is now both simplified and finer-grained.
es: La jerarquía de excepciones generada por errores del sistema operativo ahora está simplificada y es más detallada.

source: You don't have to worry anymore about choosing the appropriate exception type between :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` or :exc:`select.error`. All these exception types are now only one: :exc:`OSError`. The other names are kept as aliases for compatibility reasons.
es: No tienes que preocuparte más por cómo elegir el tipo de excepción adecuado entre :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` or :exc:`select.error`. Todos estos tipos de excepción son ahora una sola: :exc:`OSError`. Los otros nombres se mantienen como alias por razones de compatibilidad.

source: Also, it is now easier to catch a specific error condition. Instead of inspecting the ``errno`` attribute (or ``args[0]``) for a particular constant from the :mod:`errno` module, you can catch the adequate :exc:`OSError` subclass. The available subclasses are the following:
es: Además, ahora es más fácil detectar una condición de error específica. En lugar de inspeccionar el atributo ``errno`` (o ``args[0]``) para una constante particular del módulo :mod:`errno`, puede seleccionar la subclase :exc:`OSError` adecuada. Las subclases disponibles son las siguientes:
