Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: :class:`html.parser.HTMLParser` is now able to parse broken markup without raising errors, therefore the *strict* argument of the constructor and the :exc:`~html.parser.HTMLParseError` exception are now deprecated. The ability to parse broken markup is the result of a number of bug fixes that are also available on the latest bug fix releases of Python 2.7/3.2. (Contributed by Ezio Melotti in :issue:`15114`, and :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)
es: :class:`html.parser.HTMLParser` ahora puede analizar el marcado no válido sin generar errores, por lo tanto, el argumento *strict* del constructor y la excepción :exc:`~html.parser.HTMLParseError` ahora están en desuso. La habilidad de analizar marcado inválido es el resultado de un número de correcciones que también están disponibles en la última versión de solución de bugs de Python 2.7/3.2. (Contribución de Ezio Melotti en :issue:`15114`, y :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)

source: A new :data:`~html.entities.html5` dictionary that maps HTML5 named character references to the equivalent Unicode character(s) (e.g. ``html5['gt;'] == '>'``) has been added to the :mod:`html.entities` module. The dictionary is now also used by :class:`~html.parser.HTMLParser`. (Contributed by Ezio Melotti in :issue:`11113` and :issue:`15156`.)
es: Se ha agregado un nuevo diccionario :data:`~html.entities.html5` que asigna referencias de caracteres con nombre HTML5 a los caracteres *Unicode* equivalentes (por ejemplo, ``html5['gt;'] == '>'``) ha sido agregado al módulo :mod:`html.entities`. El diccionario ahora también es utilizado por :class:`~html.parser.HTMLParser`. (Contribución por Ezio Melotti en :issue:`11113` y :issue:`15156`.)

source: The :class:`~imaplib.IMAP4_SSL` constructor now accepts an SSLContext parameter to control parameters of the secure channel.
es: El constructor de :class:`~imaplib.IMAP4_SSL` ahora acepta un parámetro SSLContext para controlar los parámetros del canal seguro.

source: (Contributed by Sijin Joseph in :issue:`8808`.)
es: (Contribución de Sijin Joseph en :issue:`8808`.)

source: A new :func:`~inspect.getclosurevars` function has been added. This function reports the current binding of all names referenced from the function body and where those names were resolved, making it easier to verify correct internal state when testing code that relies on stateful closures.
es: Se ha añadido una nueva función :func:`~inspect.getclosurevars`. Esta función notifica el enlace actual de todos los nombres a los que se hace referencia desde el cuerpo de la función y dónde se resolvieron esos nombres, lo que facilita la comprobación del estado interno correcto al probar el código que se basa en cierres con estado.

source: (Contributed by Meador Inge and Nick Coghlan in :issue:`13062`.)
es: (Contribución de Meador Inge y Nick Coghlan en :issue:`13062`.)

source: A new :func:`~inspect.getgeneratorlocals` function has been added. This function reports the current binding of local variables in the generator's stack frame, making it easier to verify correct internal state when testing generators.
es: Se ha añadido una nueva función :func:`~inspect.getgeneratorlocals`. Esta función informa del enlace actual de variables locales en el marco de pila del generador, lo que facilita la comprobación del estado interno correcto al probar generadores.

source: (Contributed by Meador Inge in :issue:`15153`.)
es: (Contribución de Meador Inge en :issue:`15153`.)

source: The :func:`~io.open` function has a new ``'x'`` mode that can be used to exclusively create a new file, and raise a :exc:`FileExistsError` if the file already exists. It is based on the C11 'x' mode to fopen().
es: La función :func:`~io.open` tiene un nuevo modo ``'x'`` que puede ser usado exclusivamente para crear un nuevo archivo, y lanzar un :exc:`FileExistsError` si el archivo ya existe. Este está basado en el modo C11 'x' para fopen().

source: (Contributed by David Townshend in :issue:`12760`.)
es: (Contribución de David Townsend en :issue:`12760`.)

source: The constructor of the :class:`~io.TextIOWrapper` class has a new *write_through* optional argument. If *write_through* is ``True``, calls to :meth:`~io.TextIOWrapper.write` are guaranteed not to be buffered: any data written on the :class:`~io.TextIOWrapper` object is immediately handled to its underlying binary buffer.
es: El constructor de la clase :class:`~io.TextIOWrapper` tiene un nuevo argumento opcional *write_through*. Si *write_through* es ``True``, se garantiza que las llamadas a :meth:`~ io.TextIOWrapper.write` no se almacenarán en buffer: Cualquier dato escrito en el objeto :class:`~io.TextIOWrapper` es llevado inmediatamente a su buffer subyacente.

source: :func:`~itertools.accumulate` now takes an optional ``func`` argument for providing a user-supplied binary function.
es: :func:`~itertools.accumulate` ahora toma un argumento opcional ``func`` para proporcionar una función binaria proporcionada por el usuario.

source: The :func:`~logging.basicConfig` function now supports an optional ``handlers`` argument taking an iterable of handlers to be added to the root logger.
es: La función :func:`~logging.basicConfig` ahora admite un argumento opcional ``handlers`` tomando un iterable de manejadores para agregarlo en el registrador raíz.

source: A class level attribute :attr:`~logging.handlers.SysLogHandler.append_nul` has been added to :class:`~logging.handlers.SysLogHandler` to allow control of the appending of the ``NUL`` (``\000``) byte to syslog records, since for some daemons it is required while for others it is passed through to the log.
es: Un atributo de nivel de la clase :attr:`~logging.handlers.SysLogHandler.append_nul` ha sido agregado a la clase :class:`~logging.handlers.SysLogHandler` para permitir el control de la adición de ``NUL`` (``\000``) byte a los registros de syslog, dado que para algunos demonios es requerido mientras que para otros se pasa al registro.

source: The :mod:`math` module has a new function, :func:`~math.log2`, which returns the base-2 logarithm of *x*.
es: El módulo :mod:`math` tiene una nueva función, :func:`~math.log2`, la cual retorna el logaritmo de *x* en base 2.

source: (Written by Mark Dickinson in :issue:`11888`.)
es: (Escrito por Mark Dickinson en :issue:`11888`.)

source: The :meth:`~mmap.mmap.read` method is now more compatible with other file-like objects: if the argument is omitted or specified as ``None``, it returns the bytes from the current file position to the end of the mapping. (Contributed by Petri Lehtinen in :issue:`12021`.)
es: El método :meth:`~mmap.mmap.read` ahora es más compatible con otros objetos similares a archivos: Si se omite el argumento o se especifica como ``None``, retorna los *bytes* desde la posición actual hasta el final del mapeo. (Contribución de Petri Lehtinen en :issue:`12021`.)

source: multiprocessing
es: multiprocesamiento

source: The new :func:`multiprocessing.connection.wait` function allows polling multiple objects (such as connections, sockets and pipes) with a timeout. (Contributed by Richard Oudkerk in :issue:`12328`.)
es: La nueva función :func:`multiprocessing.connection.wait` permite sondear varios objetos (como conexiones, sockets y tuberías) con un tiempo de espera. (Contribución de Richard Oudkerk en :issue:`12328`.)

source: :class:`multiprocessing.Connection` objects can now be transferred over multiprocessing connections. (Contributed by Richard Oudkerk in :issue:`4892`.)
es: Los objetos :class:`multiprocessing.Connection` ahora se pueden transferir a través de conexiones de multiprocesamiento. (Contribución de Richard Oudkerk en :issue:`4892`.)

source: :class:`multiprocessing.Process` now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag from the parent process (:issue:`6064`).
es: :class:`multiprocessing.Process` ahora acepta un argumento de palabra clave ``daemon`` para invalidar el comportamiento predeterminado de heredar el indicador ``daemon`` del proceso primario (:issue:`6064`).

source: New attribute :data:`multiprocessing.Process.sentinel` allows a program to wait on multiple :class:`~multiprocessing.Process` objects at one time using the appropriate OS primitives (for example, :mod:`select` on posix systems).
es: Nuevo atributo :data:`multiprocessing.Process.sentinel` permite que un programa espere múltiples objetos :class:`~multiprocessing.Process` a la vez utilizando las primitivas adecuadas del sistema operativo (por ejemplo, :mod:`select` en sistemas posix).

source: New methods :meth:`multiprocessing.pool.Pool.starmap` and :meth:`~multiprocessing.pool.Pool.starmap_async` provide :func:`itertools.starmap` equivalents to the existing :meth:`multiprocessing.pool.Pool.map` and :meth:`~multiprocessing.pool.Pool.map_async` functions. (Contributed by Hynek Schlawack in :issue:`12708`.)
es: Los nuevos métodos :meth:`multiprocessing.pool.Pool.starmap` y :meth:`~multiprocessing.pool.Pool.starmap_async` proporcionan :func:`itertools.starmap` equivalentes a las funciones existentes :meth:`multiprocessing.pool.Pool.map` y :meth:`~multiprocessing.pool.Pool.map_async`. (Contribución de Hynek Schlawack en :issue:`12708`.)

source: The :class:`nntplib.NNTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the NNTP connection when done::
es: La :class:`nntplib.NNTP` ahora admite el protocolo de administración de contexto para consumir incondicionalmente las excepciones :exc:`socket.error` y cerrar la conexión NNTP cuando esté listo::

source: (Contributed by Giampaolo Rodolà in :issue:`9795`.)
es: (Contribución de Giampaolo Rodolà en :issue:`9795`.)

source: The :mod:`os` module has a new :func:`~os.pipe2` function that makes it possible to create a pipe with :const:`~os.O_CLOEXEC` or :const:`~os.O_NONBLOCK` flags set atomically. This is especially useful to avoid race conditions in multi-threaded programs.
es: El módulo :mod:`os` tiene una nueva función :func:`~os.pipe2` que hace posible crear una tubería con banderas :const:`~os.O_CLOEXEC` o :const:`~os.O_NONBLOCK` establecida automáticamente. Esto es especialmente útil para evitar las condiciones de carrera en programas multi-hilos.

source: The :mod:`os` module has a new :func:`~os.sendfile` function which provides an efficient "zero-copy" way for copying data from one file (or socket) descriptor to another. The phrase "zero-copy" refers to the fact that all of the copying of data between the two descriptors is done entirely by the kernel, with no copying of data into userspace buffers. :func:`~os.sendfile` can be used to efficiently copy data from a file on disk to a network socket, e.g. for downloading a file.
es: El módulo :mod:`os` tiene una nueva función :func:`~os.sendfile` que proporciona una forma eficiente de "copia cero" para copiar datos desde un descriptor de archivo (o socket) a otro. La frase "copia cero" se refiere al hecho de que la copia de los datos entre dos descriptores es realizada en su totalidad por el kernel, sin copiar los datos en los búferes del espacio de usuario. La función :func:`~os.sendfile` puede ser usada para copiar datos de forma eficiente desde un archivo en el disco a un conector de red, por ejemplo para descargar un archivo.

source: (Patch submitted by Ross Lagerwall and Giampaolo Rodolà in :issue:`10882`.)
es: (Revisión enviada por Ross Lagerwall y Giampaolo Rodolà en :issue:`10882`.)

source: To avoid race conditions like symlink attacks and issues with temporary files and directories, it is more reliable (and also faster) to manipulate file descriptors instead of file names. Python 3.3 enhances existing functions and introduces new functions to work on file descriptors (:issue:`4761`, :issue:`10755` and :issue:`14626`).
es: Para evitar las condiciones de carrera, como los ataques symlink, y errores con archivos temporales y directorios, es preferible (y más rápido) manipular los descriptores de archivos en vez de los nombres de archivos. Python 3.3 mejora las funciones existentes e introduce nuevas funciones para trabajar con los descriptores de archivos (:issue:`4761`, :issue:`10755` and :issue:`14626`).

source: The :mod:`os` module has a new :func:`~os.fwalk` function similar to :func:`~os.walk` except that it also yields file descriptors referring to the directories visited. This is especially useful to avoid symlink races.
es: El módulo :mod:`os` tiene una nueva función :func:`~os.fwalk` similar a :func:`~os.walk` excepto que también incluye descriptores de archivos que se refieren a los directorios visitados. Esto es especialmente útil para prevenir las carreras de enlaces simbólicos.

source: The following functions get new optional *dir_fd* (:ref:`paths relative to directory descriptors <dir_fd>`) and/or *follow_symlinks* (:ref:`not following symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Platform support for using these parameters can be checked via the sets :data:`os.supports_dir_fd` and :data:`os.supports_follows_symlinks`.
es: Las siguientes funciones tienen las nuevas opciones *dir_fd* (:ref:`rutas relativas a descriptores de archivos <dir_fd>`) y/o *follow_symlinks* (:ref:`not following symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. El soporte de la plataforma para usar éstos parámetros puede verificarse a través de los conjuntos :data:`os.supports_dir_fd` and :data:`os.supports_follows_symlinks`.

source: The following functions now support a file descriptor for their path argument: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Platform support for this can be checked via the :data:`os.supports_fd` set.
es: Las siguientes funciones ahora admiten un descriptor de archivos para su argumento de ruta: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. El soporte de la plataforma para ésto puede ser verificado a través del conjunto :data:`os.supports_fd`.

source: :func:`~os.access` accepts an ``effective_ids`` keyword argument to turn on using the effective uid/gid rather than the real uid/gid in the access check. Platform support for this can be checked via the :data:`~os.supports_effective_ids` set.
es: :func:`~os.access` acepta un argumento de palabra clave ``effective_ids`` acepta el uso del uid/gid efectivo en lugar del uid/gid real en la comprobación de acceso. El soporte de la plataforma para ésto, se puede comprobar a través del conjunto :data:`~os.supports_effective_ids`.

source: The :mod:`os` module has two new functions: :func:`~os.getpriority` and :func:`~os.setpriority`. They can be used to get or set process niceness/priority in a fashion similar to :func:`os.nice` but extended to all processes instead of just the current one.
es: El módulo :mod:`os` tiene dos nuevas funciones :func:`~os.getpriority` y :func:`~os.setpriority`. Estas pueden ser usadas para establecer o recuperar la prioridad en una forma similar a :func:`os.nice` pero extendidos a todos los procesos en vez de solo al proceso actual.

source: (Patch submitted by Giampaolo Rodolà in :issue:`10784`.)
es: (Revisión enviada por Giampaolo Rodolà en :issue:`10784`.)

source: The new :func:`os.replace` function allows cross-platform renaming of a file with overwriting the destination. With :func:`os.rename`, an existing destination file is overwritten under POSIX, but raises an error under Windows. (Contributed by Antoine Pitrou in :issue:`8828`.)
es: La nueva función :func:`os.replace` permite cambiar el nombre de un archivo entre plataformas sobrescribiendo el destino. Con :func:`os.rename`, un archivo de destino existente se sobrescribe bajo POSIX, pero lanza un error en Windows. (Contribución de Antoine Pitrou en :issue:`8828`.)

source: The stat family of functions (:func:`~os.stat`, :func:`~os.fstat`, and :func:`~os.lstat`) now support reading a file's timestamps with nanosecond precision. Symmetrically, :func:`~os.utime` can now write file timestamps with nanosecond precision. (Contributed by Larry Hastings in :issue:`14127`.)
es: La familia de estadísticas de funciones (:func:`~os.stat`, :func:`~os.fstat`, y :func:`~os.lstat`) ahora admite la lectura de marcas de tiempo de un archivo con precisión de nanosegundos. Simétricamente, :func:`~os.utime` ahora puede escribir marcas de tiempo de archivos con precisión de nanosegundos. (Contribución de Larry Hastings en :issue:`14127`.)

source: The new :func:`os.get_terminal_size` function queries the size of the terminal attached to a file descriptor. See also :func:`shutil.get_terminal_size`. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
es: La nueva función :func:`os.get_terminal_size` consulta el tamaño del terminal adjunto al descriptor del archivo. Vea también :func:`shutil.get_terminal_size`. (Contribución de Zbigniew Jędrzejewski-Szmek en :issue:`13609`. )

source: New functions to support Linux extended attributes (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.
es: Nuevas funciones para admitir atributos extendidos de Linux. (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.

source: New interface to the scheduler. These functions control how a process is allocated CPU time by the operating system. New functions: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,
es: Nueva interfaz para el planificador. Estas funciones controlan como el sistema operativo le asigna tiempo de CPU a un proceso. Nuevas funciones: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,

source: New functions to control the file system:
es: Nuevas funciones para controlar el sistema de archivos:

source: :func:`~os.posix_fadvise`: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations.
es: :func:`~os.posix_fadvise`: Anuncia una intención de acceder a los datos en un patrón específico, permitiendo al kernel hacer optimizaciones.

source: :func:`~os.posix_fallocate`: Ensures that enough disk space is allocated for a file.
es: :func:`~os.posix_fallocate`: Garantiza que se asigne el espacio suficiente a un archivo.

source: :func:`~os.sync`: Force write of everything to disk.
es: :func:`~os.sync`: Fuerza la escritura de cualquier cosa en el disco.

source: Additional new posix functions:
es: Nuevas funciones posix adicionales:

source: :func:`~os.lockf`: Apply, test or remove a POSIX lock on an open file descriptor.
es: :func:`~os.lockf`: Aplicar, probar o eliminar un bloqueo POSIX en un descriptor de archivo abierto.

source: :func:`~os.pread`: Read from a file descriptor at an offset, the file offset remains unchanged.
es: :func:`~os.pread`: Leer desde un descriptor de archivo en un desplazamiento, el desplazamiento del archivo permanece sin cambios.

source: :func:`~os.pwrite`: Write to a file descriptor from an offset, leaving the file offset unchanged.
es: :func:`~ os.pwrite`: Escribe en un descriptor de archivo desde un desplazamiento, dejando el desplazamiento del archivo sin cambios.

source: :func:`~os.readv`: Read from a file descriptor into a number of writable buffers.
es: :func:`~os.readv`: Leer desde el descriptor de un archivo en varios búferes editables.

source: :func:`~os.truncate`: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
es: :func:`~os.truncate`: Truncar el archivo correspondiente a *path*, para que tenga como máximo *length* *bytes* de tamaño.

source: :func:`~os.waitid`: Wait for the completion of one or more child processes.
es: :func:`~os.waitid`: Espera que se completen uno o más procesos secundarios.

source: :func:`~os.writev`: Write the contents of *buffers* to a file descriptor, where *buffers* is an arbitrary sequence of buffers.
es: :func:`~os.writev`: Escribir los contenidos de *buffers* a un archivo descriptor, donde *buffers* es una secuencia arbitraria de *buffers*.

source: :func:`~os.getgrouplist` (:issue:`9344`): Return list of group ids that specified user belongs to.
es: :func:`~os.getgrouplist` (:issue:`9344`): Retorna una lista de ids de grupo al que pertenece el usuario especificado.

source: :func:`~os.times` and :func:`~os.uname`: Return type changed from a tuple to a tuple-like object with named attributes.
es: :func:`~os.times` and :func:`~os.uname`: El tipo de retorno cambió de tupla a un objeto tipo tupla con atributos con nombre.

source: Some platforms now support additional constants for the :func:`~os.lseek` function, such as ``os.SEEK_HOLE`` and ``os.SEEK_DATA``.
es: Varias plataformas admiten constantes adicionales para la función :func:`~os.lseek`, tal como ``os.SEEK_HOLE`` y ``os.SEEK_DATA``.

source: New constants :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD`, and :const:`~os.RTLD_DEEPBIND` are available on platforms that support them. These are for use with the :func:`sys.setdlopenflags` function, and supersede the similar constants defined in :mod:`ctypes` and :mod:`DLFCN`. (Contributed by Victor Stinner in :issue:`13226`.)
es: Nuevas constantes :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD`, and :const:`~os.RTLD_DEEPBIND` están disponibles en plataformas que las soporten. Éstas son para uso con la función :func:`sys.setdlopenflags`, y reemplazan las constantes similares definidas en :mod:`ctypes` and :mod:`DLFCN`. (Contribución de Victor Stinner en :issue:`13226`.)

source: :func:`os.symlink` now accepts (and ignores) the ``target_is_directory`` keyword argument on non-Windows platforms, to ease cross-platform support.
es: :func:`os.symlink` ahora acepta (e ignora) el argumento de palabra clave ``target_is_directory`` en plataformas diferentes a windows, para facilitar el soporte multiplataforma.
