Repository: python/python-docs-es
Catalog: whatsnew/3.3.po
Languages: es

source: Tab-completion is now available not only for command names, but also their arguments. For example, for the ``break`` command, function and file names are completed.
es: La finalización de tabulaciones ahora está disponible no solo para los nombres de los comandos, sino también para sus argumentos. Por ejemplo, para el comando ``break``, se completan las funciones y los nombres de archivo.

source: (Contributed by Georg Brandl in :issue:`14210`)
es: (Contribución de Georg Brandl en :issue:`14210`)

source: :class:`pickle.Pickler` objects now have an optional :attr:`~pickle.Pickler.dispatch_table` attribute allowing per-pickler reduction functions to be set.
es: Los objetos :class:`pickle.Pickler` ahora tienen un atributo opcional :attr:`~pickle.Pickler.dispatch_table` que permite establecer funciones de reducción por recolector.

source: (Contributed by Richard Oudkerk in :issue:`14166`.)
es: (Contribución de Richard Oudkerk in :issue:`14166`.)

source: The Tk GUI and the :func:`~pydoc.serve` function have been removed from the :mod:`pydoc` module: ``pydoc -g`` and :func:`~pydoc.serve` have been deprecated in Python 3.2.
es: La Tk GUI y la función :func:`~pydoc.serve` han sido eliminadas del módulo :mod:`pydoc`: ``pydoc -g`` y :func:`~pydoc.serve` han quedado obsoletos en Python 3.2.

source: :class:`str` regular expressions now support ``\u`` and ``\U`` escapes.
es: Las expresiones regulares de la clase :class:`str` ahora admiten escapes de ``\u`` and ``\U`` .

source: (Contributed by Serhiy Storchaka in :issue:`3665`.)
es: (Contribución de Serhiy Storchaka en :issue:`3665`.)

source: :meth:`~sched.scheduler.run` now accepts a *blocking* parameter which when set to false makes the method execute the scheduled events due to expire soonest (if any) and then return immediately. This is useful in case you want to use the :class:`~sched.scheduler` in non-blocking applications. (Contributed by Giampaolo Rodolà in :issue:`13449`.)
es: :meth:`~sched.scheduler.run` ahora acepta un parámetro *blocking* que al configurarse en false, hace que el método ejecute los eventos planificados debido a la pronta expiración (si corresponde) y luego responde inmediatamente. Esto es útil en caso de que quieras usar la :class:`~sched.scheduler` en aplicaciones sin bloqueo. (Contribución de Giampaolo Rodolà in :issue:`13449`.)

source: :class:`~sched.scheduler` class can now be safely used in multi-threaded environments. (Contributed by Josiah Carlson and Giampaolo Rodolà in :issue:`8684`.)
es: La clase :class:`~sched.scheduler` ahora se puede utilizar de forma segura en entornos multiproceso. (Contribución por Josiah Carlson y Giampaolo Rodolà en :issue:`8684`.)

source: *timefunc* and *delayfunct* parameters of :class:`~sched.scheduler` class constructor are now optional and defaults to :func:`time.time` and :func:`time.sleep` respectively. (Contributed by Chris Clark in :issue:`13245`.)
es: Los parámetros *timefunc* y *delayfunct* del constructor de la clase :class:`~sched.scheduler` ahora son opcionales y tienen el valor predeterminado :func:`time.time` y :func:`time.sleep` respectivamente. (Contribución de Chris Clark en :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` *argument* parameter is now optional. (Contributed by Chris Clark in :issue:`13245`.)
es: El parámetro *argument* de :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` ahora es opcional. (Contribución de Chris Clark en :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` now accept a *kwargs* parameter. (Contributed by Chris Clark in :issue:`13245`.)
es: :meth:`~sched.scheduler.enter` y :meth:`~sched.scheduler.enterabs` ahora aceptan un parámetro *kwargs*. (Contribución de Chris Clark en :issue:`13245`.)

source: Solaris and derivative platforms have a new class :class:`select.devpoll` for high performance asynchronous sockets via :file:`/dev/poll`. (Contributed by Jesús Cea Avión in :issue:`6397`.)
es: Solaris y plataformas derivadas tienen una nueva clase :class:`select.devpoll` para sockets asincrónicos de alto rendimiento a través de :file:`/dev/poll`. (Contribución de Jesús Cea Avión en :issue:`6397`.)

source: The previously undocumented helper function ``quote`` from the :mod:`pipes` modules has been moved to the :mod:`shlex` module and documented. :func:`~shlex.quote` properly escapes all characters in a string that might be otherwise given special meaning by the shell.
es: La función auxiliar previamente indocumentada ``quote`` de los módulos :mod:`pipes` se ha movido al módulo :mod:`shlex` y se ha documentado. :func:`~shlex.quote` escapa correctamente a todos los caracteres de una cadena que de otro modo podría tener un significado especial por el shell.

source: New functions:
es: Nuevas funciones:

source: :func:`~shutil.disk_usage`: provides total, used and free disk space statistics. (Contributed by Giampaolo Rodolà in :issue:`12442`.)
es: :func:`~shutil.disk_usage`: Proporciona estadísticas sobre el espacio total, usado, y libre en el disco. (Contribución de Giampaolo Rodolà in :issue:`12442`.)

source: :func:`~shutil.chown`: allows one to change user and/or group of the given path also specifying the user/group names and not only their numeric ids. (Contributed by Sandro Tosi in :issue:`12191`.)
es: :func:`~shutil.chown`: Permite cambiar el usuario y/o grupo de las rutas dadas, además de especificar los nombres de usuario/grupo, y no solos sus id's numèricos. (Contribución de Sandro Tosi in :issue:`12191`.)

source: :func:`shutil.get_terminal_size`: returns the size of the terminal window to which the interpreter is attached. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
es: :func:`shutil.get_terminal_size`: Retorna el tamaño de la ventana del terminar a la cual se adjunta el intérprete. (Contribución de Zbigniew Jędrzejewski-Szmek in :issue:`13609`. )

source: :func:`~shutil.copy2` and :func:`~shutil.copystat` now preserve file timestamps with nanosecond precision on platforms that support it. They also preserve file "extended attributes" on Linux. (Contributed by Larry Hastings in :issue:`14127` and :issue:`15238`.)
es: :func:`~shutil.copy2` and :func:`~shutil.copystat` ahora conservan las marcas de tiempo de archivos con precisión de nanosegundos en plataformas que lo soporten. También conservan los "atributos extendidos" de archivo en Linux (Contribución de Larry Hastings en :issue:`14127` y :issue:`15238`.)

source: Several functions now take an optional ``symlinks`` argument: when that parameter is true, symlinks aren't dereferenced and the operation instead acts on the symlink itself (or creates one, if relevant). (Contributed by Hynek Schlawack in :issue:`12715`.)
es: Algunas funciones ahora toman un argumento opcional de ``symlinks``: Cuando ese parámetro es verdadero, los enlaces simbólicos no se desreferencian y la operación actúa en el enlace simbólico en sí. (o crea uno, si es relevante). (Contribución de Hynek Schlawack in :issue:`12715`.)

source: When copying files to a different file system, :func:`~shutil.move` now handles symlinks the way the posix ``mv`` command does, recreating the symlink rather than copying the target file contents. (Contributed by Jonathan Niehof in :issue:`9993`.) :func:`~shutil.move` now also returns the ``dst`` argument as its result.
es: Al copiar archivos a un sistema de archivos diferente, :func:`~shutil.move` ahora gestiona los enlaces simbólicos de la forma que lo hace el comando ``mv`` de posix, recreando el enlace simbólico en vez de copiar el contenido del archivo de destino. (Contribución de Jonathan Niehof en :issue:`9993`.) :func:`~shutil.move` ahora también retorna el argumento ``dst`` como resultado.

source: :func:`~shutil.rmtree` is now resistant to symlink attacks on platforms which support the new ``dir_fd`` parameter in :func:`os.open` and :func:`os.unlink`. (Contributed by Martin von Löwis and Hynek Schlawack in :issue:`4489`.)
es: :func:`~shutil.rmtree` ahora es resistente a los ataques de enlaces simbólicos en plataformas que admiten el nuevo parámetro ``dir_fd`` en :func:`os.open` y :func:`os.unlink`. (Contribución de Martin von Löwis and Hynek Schlawack in :issue:`4489`.)

source: The :mod:`signal` module has new functions:
es: El módulo :mod:`signal` tiene nuevas funciones:

source: :func:`~signal.pthread_sigmask`: fetch and/or change the signal mask of the calling thread (Contributed by Jean-Paul Calderone in :issue:`8407`);
es: :func:`~signal.pthread_sigmask`: busca y/o cambia la máscara de señal del hilo de llamada (Contribución de Jean-Paul Calderone in :issue:`8407`);

source: :func:`~signal.pthread_kill`: send a signal to a thread;
es: :func:`~signal.pthread_kill`: Envía una señal a un hilo;

source: :func:`~signal.sigpending`: examine pending functions;
es: :func:`~signal.sigpending`: Examina funciones pendientes;

source: :func:`~signal.sigwait`: wait a signal;
es: :func:`~signal.sigwait`: Espera una señal;

source: :func:`~signal.sigwaitinfo`: wait for a signal, returning detailed information about it;
es: :func:`~signal.sigwaitinfo`: Espera una señal, retornando información detallada sobre ella;

source: :func:`~signal.sigtimedwait`: like :func:`~signal.sigwaitinfo` but with a timeout.
es: :func:`~signal.sigtimedwait`: Es similar a :func:`~signal.sigwaitinfo` pero con un tiempo de espera.

source: The signal handler writes the signal number as a single byte instead of a nul byte into the wakeup file descriptor. So it is possible to wait more than one signal and know which signals were raised.
es: El manejador de señales escribe el número de señal, como un único byte en vez de un byte nulo en el descriptor del archivo de activación. Por lo tanto, es posible esperar más de una señal y saber cuales señales han sido lanzadas.

source: :func:`signal.signal` and :func:`signal.siginterrupt` raise an OSError, instead of a RuntimeError: OSError has an errno attribute.
es: :func:`signal.signal` y :func:`signal.siginterrupt` lanzan un OSError, en vez de un RuntimeError: OSError no tiene atributo errno.

source: The :mod:`smtpd` module now supports :rfc:`5321` (extended SMTP) and :rfc:`1870` (size extension). Per the standard, these extensions are enabled if and only if the client initiates the session with an ``EHLO`` command.
es: El módulo :mod:`smtpd` ahora admite :rfc:`5321` (SMTP extendido) y :rfc:`1870` (Ampliación de tamaño). Por lo general, éstas extensiones están habilitadas si y solo si el cliente inicia la sesión con un comando ``EHLO``.

source: (Initial ``ELHO`` support by Alberto Trevino. Size extension by Juhana Jauhiainen. Substantial additional work on the patch contributed by Michele Orrù and Dan Boswell. :issue:`8739`)
es: Soporte inicial de ``ELHO`` de Alberto Treviño. Ampliación de tamaño por Juhana Jauhiainen. Trabajo adicional sustancial en la revisión aportada por Michele Orrù y Dan Boswell. :issue:`8739`)

source: The :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL`, and :class:`~smtplib.LMTP` classes now accept a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Paulo Scardine in :issue:`11281`.)
es: Las clases :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL`, y :class:`~smtplib.LMTP` ahora aceptan un argumento de palabra clave ``source_address``, para especificar el ``(host, port)`` a usar como dirección de origen en la llamada de enlace al crear el socket saliente. (Contribución de Paulo Scardine en :issue:`11281`.)

source: :class:`~smtplib.SMTP` now supports the context management protocol, allowing an ``SMTP`` instance to be used in a ``with`` statement. (Contributed by Giampaolo Rodolà in :issue:`11289`.)
es: :class:`~smtplib.SMTP` ahora admite el protocolo de administración de contexto, permitiendo usar a una instancia ``SMTP`` en una declaración ``with``. (Contribución de Giampaolo Rodolà en :issue:`11289`.)

source: The :class:`~smtplib.SMTP_SSL` constructor and the :meth:`~smtplib.SMTP.starttls` method now accept an SSLContext parameter to control parameters of the secure channel. (Contributed by Kasun Herath in :issue:`8809`.)
es: El constructor :class:`~smtplib.SMTP_SSL` y el método :meth:`~smtplib.SMTP.starttls` ahora aceptan un parámetro SSLContext, para controlar los parámetros del canal seguro. (Contribución por Kasun Herath en :issue:`8809`.)

source: The :class:`~socket.socket` class now exposes additional methods to process ancillary data when supported by the underlying platform:
es: La clase :class:`~socket.socket` ahora expone métodos adicionales para procesar datos auxiliares cuando sean compatibles con la plataforma subyacente:

source: (Contributed by David Watson in :issue:`6560`, based on an earlier patch by Heiko Wundram)
es: (Contribución de David Watson en :issue:`6560`, basado en una revisión anterior de Heiko Wundram)

source: The :class:`~socket.socket` class now supports the PF_CAN protocol family (https://en.wikipedia.org/wiki/Socketcan), on Linux (https://lwn.net/Articles/253425).
es: La clase :class:`~socket.socket` ahora admite la familia del protocolo PF_CAN (https://en.wikipedia.org/wiki/Socketcan), en Linux (https://lwn.net/Articles/253425).

source: (Contributed by Matthias Fuchs, updated by Tiago Gonçalves in :issue:`10141`.)
es: (Contribución de Matthias Fuchs, actualizado por Tiago Gonçalves en :issue:`10141`.)

source: The :class:`~socket.socket` class now supports the PF_RDS protocol family (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets and `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).
es: La clase :class:`~socket.socket` ahora admite la familia de protocolos PF_RDS (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets y `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).

source: The :class:`~socket.socket` class now supports the ``PF_SYSTEM`` protocol family on OS X. (Contributed by Michael Goderbauer in :issue:`13777`.)
es: La clase :class:`~socket.socket` ahora admite la familia del protocolo ``PF_SYSTEM`` en OS X. (Contribución de Michael Goderbauer en :issue:`13777`.)

source: New function :func:`~socket.sethostname` allows the hostname to be set on Unix systems if the calling process has sufficient privileges. (Contributed by Ross Lagerwall in :issue:`10866`.)
es: La nueva función :func:`~socket.sethostname` permite establecer el nombre de host en sistemas Unix si el proceso de llamada tiene suficientes privilegios. (Aportado por Ross Lagerwall en :issue:`10866`.)

source: :class:`~socketserver.BaseServer` now has an overridable method :meth:`~socketserver.BaseServer.service_actions` that is called by the :meth:`~socketserver.BaseServer.serve_forever` method in the service loop. :class:`~socketserver.ForkingMixIn` now uses this to clean up zombie child processes. (Contributed by Justin Warkentin in :issue:`11109`.)
es: :class:`~socketserver.BaseServer` ahora tiene un método reemplazable :meth:`~socketserver.BaseServer.service_actions` que es llamado por el método :meth:`~socketserver.BaseServer.serve_forever` en el ciclo del servicio. :class:`~socketserver.ForkingMixIn` ahora usa ésto para limpiar procesos secundarios zombies. (Contribución de Justin Warkentin en :issue:`11109`.)

source: New :class:`sqlite3.Connection` method :meth:`~sqlite3.Connection.set_trace_callback` can be used to capture a trace of all sql commands processed by sqlite. (Contributed by Torsten Landschoff in :issue:`11688`.)
es: Nuevo método :class:`sqlite3.Connection` :meth:`~sqlite3.Connection.set_trace_callback` puede ser usado para capturar un rastro de todos los comandos sql procesados por sqlite. (Contribución de Torsten Landschoff en :issue:`11688`.)

source: The :mod:`ssl` module has two new random generation functions:
es: El módulo :mod:`ssl` tiene dos funciones de generación aleatoria:

source: :func:`~ssl.RAND_bytes`: generate cryptographically strong pseudo-random bytes.
es: :func:`~ssl.RAND_bytes`: genera bytes pseudo-aleatorios criptográficamente fuertes.

source: :func:`~ssl.RAND_pseudo_bytes`: generate pseudo-random bytes.
es: :func:`~ssl.RAND_pseudo_bytes`: genera bytes pseudoaleatorios.

source: (Contributed by Victor Stinner in :issue:`12049`.)
es: (Contribución de Victor Stinner en :issue:`12049`.)

source: The :mod:`ssl` module now exposes a finer-grained exception hierarchy in order to make it easier to inspect the various kinds of errors. (Contributed by Antoine Pitrou in :issue:`11183`.)
es: El módulo :mod:`ssl` ahora expone una jerarquía de excepciones más detallada para facilitar la inspección de varias clases de errores. (Contribución de Antoine Pitrou en :issue:`11183`.)

source: :meth:`~ssl.SSLContext.load_cert_chain` now accepts a *password* argument to be used if the private key is encrypted. (Contributed by Adam Simpkins in :issue:`12803`.)
es: :meth:`~ssl.SSLContext.load_cert_chain` ahora acepta un argumento *password* que será usado si la clave privada es encriptada. (Contribución de Adam Simpkins en :issue:`12803`.)

source: Diffie-Hellman key exchange, both regular and Elliptic Curve-based, is now supported through the :meth:`~ssl.SSLContext.load_dh_params` and :meth:`~ssl.SSLContext.set_ecdh_curve` methods. (Contributed by Antoine Pitrou in :issue:`13626` and :issue:`13627`.)
es: El intercambio de claves Diffie-Hellman, tanto regular como basado en curvas elípticas, ahora se admite a través de los métodos :meth:`~ ssl.SSLContext.load_dh_params` y :meth:`~ssl.SSLContext.set_ecdh_curve`. (Contribución de Antoine Pitrou en :issue:`13626` y :issue:`13627`.)

source: SSL sockets have a new :meth:`~ssl.SSLSocket.get_channel_binding` method allowing the implementation of certain authentication mechanisms such as SCRAM-SHA-1-PLUS. (Contributed by Jacek Konieczny in :issue:`12551`.)
es: Los sockets SSL tienen un nuevo método :meth:`~ssl.SSLSocket.get_channel_binding` que permite la implementación de ciertos mecanismos de autenticación tales como SCRAM-SHA-1-PLUS. (Contribución por Jacek Konieczny en :issue:`12551`.)

source: You can query the SSL compression algorithm used by an SSL socket, thanks to its new :meth:`~ssl.SSLSocket.compression` method. The new attribute :const:`~ssl.OP_NO_COMPRESSION` can be used to disable compression. (Contributed by Antoine Pitrou in :issue:`13634`.)
es: Puedes consultar el algoritmo de compresión SSL usado por un socket SSL, gracias a su nuevo método :meth:`~ssl.SSLSocket.compression`. El nuevo atributo :const:`~ssl.OP_NO_COMPRESSION` puede ser usado para deshabilitar la compresión. (Contribución de Antoine Pitrou en :issue:`13634`.)

source: Support has been added for the Next Protocol Negotiation extension using the :meth:`ssl.SSLContext.set_npn_protocols` method. (Contributed by Colin Marc in :issue:`14204`.)
es: Se ha agregado soporte para la extensión *Next Protocol Negotiation* usando el método :meth:`ssl.SSLContext.set_npn_protocols`. (Contribución por Colin Marc en :issue:`14204`.)

source: SSL errors can now be introspected more easily thanks to :attr:`~ssl.SSLError.library` and :attr:`~ssl.SSLError.reason` attributes. (Contributed by Antoine Pitrou in :issue:`14837`.)
es: Los errores de SSL ahora pueden introspectarse más fácilmente gracias a los atributos :attr:`~ssl.SSLError.library` y :attr:`~ssl.SSLError.reason`. (Contribución de Antoine Pitrou en :issue:`14837`.)

source: The :func:`~ssl.get_server_certificate` function now supports IPv6. (Contributed by Charles-François Natali in :issue:`11811`.)
es: La función :func:`~ssl.get_server_certificate` ahora admite IPv6. (Contribución por Charles-François Natali en :issue:`11811`.)

source: New attribute :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` allows setting SSLv3 server sockets to use the server's cipher ordering preference rather than the client's (:issue:`13635`).
es: El nuevo atributo :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` permite configurar los sockets del servidor SSLv3 para usar la preferencia de ordenación de cifrado del servidor en lugar de la del cliente. (:issue:`13635`).

source: The undocumented tarfile.filemode function has been moved to :func:`stat.filemode`. It can be used to convert a file's mode to a string of the form '-rwxrwxrwx'.
es: La función indocumentada tarfile.filemode ha sido movida a :func:`stat.filemode`. Este puede ser usado para convertir el modo de un archivo a una cadena de la forma '-rwxrwxrwx'.

source: (Contributed by Giampaolo Rodolà in :issue:`14807`.)
es: (Contribución de Giampaolo Rodolà in :issue:`14807`.)

source: The :mod:`struct` module now supports :c:type:`ssize_t` and :c:type:`size_t` via the new codes ``n`` and ``N``, respectively. (Contributed by Antoine Pitrou in :issue:`3163`.)
es: El módulo :mod:`struct` ahora admite :c:type:`ssize_t` y :c:type:`size_t` a través de los nuevos códigos ``n`` and ``N``, respectivamente. (Contribución de Antoine Pitrou en :issue:`3163`.)

source: Command strings can now be bytes objects on posix platforms. (Contributed by Victor Stinner in :issue:`8513`.)
es: Las cadenas de comandos ahora pueden ser objetos de *bytes* en las plataformas posix. (Contribución de Victor Stinner in :issue:`8513`.)

source: A new constant :const:`~subprocess.DEVNULL` allows suppressing output in a platform-independent fashion. (Contributed by Ross Lagerwall in :issue:`5870`.)
es: Una nueva constante :const:`~subprocess.DEVNULL` permite suprimir la salida de forma independiente de la plataforma. (Contribución de Ross Lagerwall en :issue:`5870`.)

source: The :mod:`sys` module has a new :data:`~sys.thread_info` :term:`named tuple` holding information about the thread implementation (:issue:`11223`).
es: El módulo :mod:`sys` tiene un nuevo :data:`~sys.thread_info` :term:`named tuple` que almacena información sobre la implementación del hilo (:issue:`11223`).

source: :mod:`tarfile` now supports ``lzma`` encoding via the :mod:`lzma` module. (Contributed by Lars Gustäbel in :issue:`5689`.)
es: :mod:`tarfile` ahora admite la codificación ``lzma`` a través del módulo :mod:`lzma`. (Contribución de Lars Gustäbel en :issue:`5689`.)

source: :class:`tempfile.SpooledTemporaryFile`\'s :meth:`~tempfile.SpooledTemporaryFile.truncate` method now accepts a ``size`` parameter. (Contributed by Ryan Kelly in :issue:`9957`.)
es: El método :class:`tempfile.SpooledTemporaryFile`\'s :meth:`~tempfile.SpooledTemporaryFile.truncate` ahora acepta un parámetro ``size``. (Contribución de Ryan Kelly en :issue:`9957`.)

source: The :mod:`textwrap` module has a new :func:`~textwrap.indent` that makes it straightforward to add a common prefix to selected lines in a block of text (:issue:`13857`).
es: El módulo :mod:`textwrap` tiene una nueva función :func:`~textwrap.indent` que facilita la adición de un prefijo común para las lineas seleccionadas en un bloque de texto (:issue:`13857`).

source: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, and :class:`threading.Timer`, all of which used to be factory functions returning a class instance, are now classes and may be subclassed. (Contributed by Éric Araujo in :issue:`10968`.)
es: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, y :class:`threading.Timer`, todas las cuales son usadas para ser funciones de fábrica que retornen una instancia de clase, ahora son clases y pueden ser subclasificadas (Contribución de Éric Araujo in :issue:`10968`.)
