Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: The new :c:func:`PyErr_SetImportErrorSubclass` function allows for specifying a subclass of :exc:`ImportError` to raise. (Contributed by Eric Snow in :issue:`15767`.)
es: La nueva función :c:func:`PyErr_SetImportErrorSubclass` permite especificar una subclase de :exc:`ImportError` para aumentar. (Contribuido por Eric Snow en :issue:`15767`.)

source: The new :c:func:`PyErr_ResourceWarning` function can be used to generate a :exc:`ResourceWarning` providing the source of the resource allocation. (Contributed by Victor Stinner in :issue:`26567`.)
es: La nueva función :c:func:`PyErr_ResourceWarning` se puede utilizar para generar un :exc:`ResourceWarning` que proporcione la fuente de la asignación de recursos. (Contribuido por Victor Stinner en :issue:`26567`.)

source: The new :c:func:`PyOS_FSPath` function returns the file system representation of a :term:`path-like object`. (Contributed by Brett Cannon in :issue:`27186`.)
es: La nueva función :c:func:`PyOS_FSPath` devuelve la representación del sistema de archivos de un :term:`path-like object`. (Contribuido por Brett Cannon en :issue:`27186`.)

source: The :c:func:`PyUnicode_FSConverter` and :c:func:`PyUnicode_FSDecoder` functions will now accept :term:`path-like objects <path-like object>`.
es: Las funciones :c:func:`PyUnicode_FSConverter` y :c:func:`PyUnicode_FSDecoder` ahora aceptarán :term:`path-like objects <path-like object>`.

source: Other Improvements
es: Otras mejoras

source: When :option:`--version` (short form: :option:`-V`) is supplied twice, Python prints :data:`sys.version` for detailed information.
es: Cuando :option:`--version` (forma corta: :option:`-V`) se suministra dos veces, Python imprime :data:`sys.version` para obtener información detallada.

source: Deprecated
es: Obsoleto

source: New Keywords
es: Nuevas palabras clave

source: ``async`` and ``await`` are not recommended to be used as variable, class, function or module names. Introduced by :pep:`492` in Python 3.5, they will become proper keywords in Python 3.7. Starting in Python 3.6, the use of ``async`` or ``await`` as names will generate a :exc:`DeprecationWarning`.
es: No se recomienda el uso de ``async`` y ``await`` como nombres de variable, clase, función o módulo. Introducidos por :pep:`492` en Python 3.5, se convertirán en palabras clave adecuadas en Python 3.7. A partir de Python 3.6, el uso de ``async`` o ``await`` como nombres lanzará un :exc:`DeprecationWarning`.

source: Deprecated Python behavior
es: Comportamiento de Python obsoleto

source: Raising the :exc:`StopIteration` exception inside a generator will now generate a :exc:`DeprecationWarning`, and will trigger a :exc:`RuntimeError` in Python 3.7. See :ref:`whatsnew-pep-479` for details.
es: Al generar la excepción :exc:`StopIteration` dentro de un generador, ahora se lanzará un :exc:`DeprecationWarning` y se activará un :exc:`RuntimeError` en Python 3.7. Consulte :ref:`whatsnew-pep-479` para obtener más detalles.

source: The :meth:`__aiter__` method is now expected to return an asynchronous iterator directly instead of returning an awaitable as previously. Doing the former will trigger a :exc:`DeprecationWarning`. Backward compatibility will be removed in Python 3.7. (Contributed by Yury Selivanov in :issue:`27243`.)
es: Ahora se espera que el método :meth:`__aiter__` devuelva un iterador asincrónico directamente en lugar de devolver un awaitable como antes. Hacer lo primero activará un :exc:`DeprecationWarning`. La compatibilidad con versiones anteriores se eliminará en Python 3.7. (Contribuido por Yury Selivanov en :issue:`27243`.)

source: A backslash-character pair that is not a valid escape sequence now generates a :exc:`DeprecationWarning`. Although this will eventually become a :exc:`SyntaxError`, that will not be for several Python releases. (Contributed by Emanuel Barry in :issue:`27364`.)
es: Un par de caracteres de barra invertida que no es una secuencia de escape válida ahora genera un :exc:`DeprecationWarning`. Aunque eventualmente se convertirá en un :exc:`SyntaxError`, no será así para varias versiones de Python. (Contribuido por Emanuel Barry en :issue:`27364`.)

source: When performing a relative import, falling back on ``__name__`` and ``__path__`` from the calling module when ``__spec__`` or ``__package__`` are not defined now raises an :exc:`ImportWarning`. (Contributed by Rose Ames in :issue:`25791`.)
es: Al realizar una importación relativa, recurrir a ``__name__`` y ``__path__`` desde el módulo de llamada cuando ``__spec__`` o ``__package__`` no están definidos ahora genera un :exc:`ImportWarning`. (Contribuido por Rose Ames en :issue:`25791`.)

source: Deprecated Python modules, functions and methods
es: Módulos, funciones y métodos de Python obsoletos

source: The :mod:`asynchat` has been deprecated in favor of :mod:`asyncio`. (Contributed by Mariatta in :issue:`25002`.)
es: El :mod:`asynchat` ha quedado obsoleto en favor del :mod:`asyncio`. (Contribuido por Mariatta en :issue:`25002`.)

source: The :mod:`asyncore` has been deprecated in favor of :mod:`asyncio`. (Contributed by Mariatta in :issue:`25002`.)
es: El :mod:`asyncore` ha quedado obsoleto en favor del :mod:`asyncio`. (Contribuido por Mariatta en :issue:`25002`.)

source: Unlike other :mod:`dbm` implementations, the :mod:`dbm.dumb` module creates databases with the ``'rw'`` mode and allows modifying the database opened with the ``'r'`` mode. This behavior is now deprecated and will be removed in 3.8. (Contributed by Serhiy Storchaka in :issue:`21708`.)
es: A diferencia de otras implementaciones de :mod:`dbm`, el módulo :mod:`dbm.dumb` crea bases de datos con el modo ``'rw'`` y permite modificar la base de datos abierta con el modo ``'r'``. Este comportamiento ahora está en desuso y se eliminará en 3.8. (Contribuido por Serhiy Storchaka en :issue:`21708`.)

source: The support of non-integer arguments in :func:`~grp.getgrgid` has been deprecated. (Contributed by Serhiy Storchaka in :issue:`26129`.)
es: La compatibilidad con argumentos no enteros en :func:`~grp.getgrgid` ha quedado obsoleta. (Contribuido por Serhiy Storchaka en :issue:`26129`.)

source: The :meth:`importlib.machinery.SourceFileLoader.load_module` and :meth:`importlib.machinery.SourcelessFileLoader.load_module` methods are now deprecated. They were the only remaining implementations of :meth:`importlib.abc.Loader.load_module` in :mod:`importlib` that had not been deprecated in previous versions of Python in favour of :meth:`importlib.abc.Loader.exec_module`.
es: Los métodos :meth:`importlib.machinery.SourceFileLoader.load_module` y :meth:`importlib.machinery.SourcelessFileLoader.load_module` ahora están en desuso. Eran las únicas implementaciones restantes de :meth:`importlib.abc.Loader.load_module` en :mod:`importlib` que no habían quedado obsoletas en versiones anteriores de Python a favor de :meth:`importlib.abc.Loader.exec_module`.

source: Undocumented support of general :term:`bytes-like objects <bytes-like object>` as paths in :mod:`os` functions, :func:`compile` and similar functions is now deprecated. (Contributed by Serhiy Storchaka in :issue:`25791` and :issue:`26754`.)
es: El soporte no documentado de :term:`bytes-like objects <bytes-like object>` general como rutas en funciones :mod:`os`, :func:`compile` y funciones similares ahora está en desuso. (Contribuido por Serhiy Storchaka en :issue:`25791` y :issue:`26754`.)

source: Support for inline flags ``(?letters)`` in the middle of the regular expression has been deprecated and will be removed in a future Python version. Flags at the start of a regular expression are still allowed. (Contributed by Serhiy Storchaka in :issue:`22493`.)
es: La compatibilidad con indicadores en línea ``(?letters)`` en el medio de la expresión regular ha quedado obsoleta y se eliminará en una versión futura de Python. Aún se permiten las banderas al comienzo de una expresión regular. (Contribuido por Serhiy Storchaka en :issue:`22493`.)

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the :mod:`ssl` module will require at least OpenSSL 1.0.2 or 1.1.0.
es: OpenSSL 0.9.8, 1.0.0 y 1.0.1 están obsoletos y ya no son compatibles. En el futuro, el módulo :mod:`ssl` requerirá al menos OpenSSL 1.0.2 o 1.1.0.

source: SSL-related arguments like ``certfile``, ``keyfile`` and ``check_hostname`` in :mod:`ftplib`, :mod:`http.client`, :mod:`imaplib`, :mod:`poplib`, and :mod:`smtplib` have been deprecated in favor of ``context``. (Contributed by Christian Heimes in :issue:`28022`.)
es: Los argumentos relacionados con SSL como ``certfile``, ``keyfile`` y ``check_hostname`` en :mod:`ftplib`, :mod:`http.client`, :mod:`imaplib`, :mod:`poplib` y :mod:`smtplib` se han desaprobado en favor de ``context``. (Contribuido por Christian Heimes en :issue:`28022`.)

source: A couple of protocols and functions of the :mod:`ssl` module are now deprecated. Some features will no longer be available in future versions of OpenSSL. Other features are deprecated in favor of a different API. (Contributed by Christian Heimes in :issue:`28022` and :issue:`26470`.)
es: Un par de protocolos y funciones del módulo :mod:`ssl` ahora están en desuso. Algunas funciones ya no estarán disponibles en futuras versiones de OpenSSL. Otras funciones están obsoletas en favor de una API diferente. (Contribuido por Christian Heimes en :issue:`28022` y :issue:`26470`.)

source: The :mod:`tkinter.tix` module is now deprecated. :mod:`tkinter` users should use :mod:`tkinter.ttk` instead.
es: El módulo :mod:`tkinter.tix` ahora está en desuso. Los usuarios de :mod:`tkinter` deberían utilizar :mod:`tkinter.ttk` en su lugar.

source: The ``pyvenv`` script has been deprecated in favour of ``python3 -m venv``. This prevents confusion as to what Python interpreter ``pyvenv`` is connected to and thus what Python interpreter will be used by the virtual environment. (Contributed by Brett Cannon in :issue:`25154`.)
es: La secuencia de comandos ``pyvenv`` se ha desaprobado en favor de ``python3 -m venv``. Esto evita la confusión en cuanto a qué intérprete de Python ``pyvenv`` está conectado y, por lo tanto, qué intérprete de Python será utilizado por el entorno virtual. (Contribuido por Brett Cannon en :issue:`25154`.)

source: Deprecated functions and types of the C API
es: Funciones y tipos obsoletos de la API de C

source: Deprecated Build Options
es: Opciones de compilación obsoletas

source: The ``--with-system-ffi`` configure flag is now on by default on non-macOS UNIX platforms. It may be disabled by using ``--without-system-ffi``, but using the flag is deprecated and will not be accepted in Python 3.7. macOS is unaffected by this change. Note that many OS distributors already use the ``--with-system-ffi`` flag when building their system Python.
es: El indicador de configuración ``--with-system-ffi`` ahora está activado de forma predeterminada en plataformas UNIX que no son macOS. Puede deshabilitarse mediante ``--without-system-ffi``, pero el uso de la marca está obsoleto y no se aceptará en Python 3.7. macOS no se ve afectado por este cambio. Tenga en cuenta que muchos distribuidores de sistemas operativos ya utilizan el indicador ``--with-system-ffi`` al crear su sistema Python.

source: Removed
es: Remoto

source: API and Feature Removals
es: Eliminaciones de API y funciones

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in regular expressions will now cause an error. In replacement templates for :func:`re.sub` they are still allowed, but deprecated. The :const:`re.LOCALE` flag can now only be used with binary patterns.
es: Los escapes desconocidos que constan de ``'\'`` y una letra ASCII en expresiones regulares ahora provocarán un error. En las plantillas de reemplazo para :func:`re.sub`, todavía están permitidas, pero en desuso. La bandera :const:`re.LOCALE` ahora solo se puede usar con patrones binarios.

source: ``inspect.getmoduleinfo()`` was removed (was deprecated since CPython 3.3). :func:`inspect.getmodulename` should be used for obtaining the module name for a given path. (Contributed by Yury Selivanov in :issue:`13248`.)
es: Se eliminó ``inspect.getmoduleinfo()`` (quedó en desuso desde CPython 3.3). Se debe utilizar :func:`inspect.getmodulename` para obtener el nombre del módulo para una ruta determinada. (Contribuido por Yury Selivanov en :issue:`13248`.)

source: ``traceback.Ignore`` class and ``traceback.usage``, ``traceback.modname``, ``traceback.fullmodname``, ``traceback.find_lines_from_code``, ``traceback.find_lines``, ``traceback.find_strings``, ``traceback.find_executable_lines`` methods were removed from the :mod:`traceback` module. They were undocumented methods deprecated since Python 3.2 and equivalent functionality is available from private methods.
es: La clase ``traceback.Ignore`` y los métodos ``traceback.usage``, ``traceback.modname``, ``traceback.fullmodname``, ``traceback.find_lines_from_code``, ``traceback.find_lines``, ``traceback.find_strings``, ``traceback.find_executable_lines`` se eliminaron del módulo :mod:`traceback`. Eran métodos no documentados en desuso desde Python 3.2 y la funcionalidad equivalente está disponible en métodos privados.

source: The ``tk_menuBar()`` and ``tk_bindForTraversal()`` dummy methods in :mod:`tkinter` widget classes were removed (corresponding Tk commands were obsolete since Tk 4.0).
es: Se eliminaron los métodos ficticios ``tk_menuBar()`` y ``tk_bindForTraversal()`` en las clases de widgets :mod:`tkinter` (los comandos Tk correspondientes estaban obsoletos desde Tk 4.0).

source: The :meth:`~zipfile.ZipFile.open` method of the :class:`zipfile.ZipFile` class no longer supports the ``'U'`` mode (was deprecated since Python 3.4). Use :class:`io.TextIOWrapper` for reading compressed text files in :term:`universal newlines` mode.
es: El método :meth:`~zipfile.ZipFile.open` de la clase :class:`zipfile.ZipFile` ya no admite el modo ``'U'`` (quedó obsoleto desde Python 3.4). Utilice :class:`io.TextIOWrapper` para leer archivos de texto comprimidos en modo :term:`universal newlines`.

source: The undocumented ``IN``, ``CDROM``, ``DLFCN``, ``TYPES``, ``CDIO``, and ``STROPTS`` modules have been removed. They had been available in the platform specific ``Lib/plat-*/`` directories, but were chronically out of date, inconsistently available across platforms, and unmaintained. The script that created these modules is still available in the source distribution at `Tools/scripts/h2py.py <https://github.com/python/cpython/blob/v3.6.15/Tools/scripts/h2py.py>`_.
es: Los módulos indocumentados ``IN``, ``CDROM``, ``DLFCN``, ``TYPES``, ``CDIO`` y ``STROPTS`` se han eliminado. Habían estado disponibles en los directorios ``Lib/plat-*/`` específicos de la plataforma, pero estaban desactualizados de forma crónica, estaban disponibles de manera incoherente en todas las plataformas y no se mantenían. El script que creó estos módulos todavía está disponible en la distribución fuente en: source: `Tools / scripts / h2py.py <https://github.com/python/cpython/blob/v3.6.15/Tools/scripts/h2py.py>`_.

source: The deprecated ``asynchat.fifo`` class has been removed.
es: Se ha eliminado la clase ``asynchat.fifo`` obsoleta.

source: Porting to Python 3.6
es: Portar a Python 3.6

source: This section lists previously described changes and other bugfixes that may require changes to your code.
es: Esta sección enumera los cambios descritos anteriormente y otras correcciones de errores que pueden requerir cambios en su código.

source: Changes in 'python' Command Behavior
es: Cambios en el comportamiento del comando 'python'

source: The output of a special Python build with defined ``COUNT_ALLOCS``, ``SHOW_ALLOC_COUNT`` or ``SHOW_TRACK_COUNT`` macros is now off by default. It can be re-enabled using the ``-X showalloccount`` option. It now outputs to ``stderr`` instead of ``stdout``. (Contributed by Serhiy Storchaka in :issue:`23034`.)
es: La salida de una compilación especial de Python con macros ``COUNT_ALLOCS``, ``SHOW_ALLOC_COUNT`` o ``SHOW_TRACK_COUNT`` definidas ahora está desactivada de forma predeterminada. Se puede volver a habilitar usando la opción ``-X showalloccount``. Ahora emite a ``stderr`` en lugar de ``stdout``. (Contribuido por Serhiy Storchaka en :issue:`23034`.)

source: Changes in the Python API
es: Cambios en la API de Python

source: :func:`open() <open>` will no longer allow combining the ``'U'`` mode flag with ``'+'``. (Contributed by Jeff Balogh and John O'Connor in :issue:`2091`.)
es: :func:`open() <open>` ya no permitirá combinar el indicador de modo ``'U'`` con ``'+'``. (Contribuido por Jeff Balogh y John O'Connor en :issue:`2091`.)

source: :mod:`sqlite3` no longer implicitly commits an open transaction before DDL statements.
es: :mod:`sqlite3` ya no confirma implícitamente una transacción abierta antes de las declaraciones DDL.

source: On Linux, :func:`os.urandom` now blocks until the system urandom entropy pool is initialized to increase the security.
es: En Linux, :func:`os.urandom` ahora se bloquea hasta que se inicializa el grupo de entropía aleatoria del sistema para aumentar la seguridad.

source: When :meth:`importlib.abc.Loader.exec_module` is defined, :meth:`importlib.abc.Loader.create_module` must also be defined.
es: Cuando se define :meth:`importlib.abc.Loader.exec_module`, también se debe definir :meth:`importlib.abc.Loader.create_module`.

source: :c:func:`PyErr_SetImportError` now sets :exc:`TypeError` when its **msg** argument is not set. Previously only ``NULL`` was returned.
es: :c:func:`PyErr_SetImportError` ahora establece :exc:`TypeError` cuando su argumento **msg** no está establecido. Anteriormente, solo se devolvía ``NULL``.

source: The format of the ``co_lnotab`` attribute of code objects changed to support a negative line number delta. By default, Python does not emit bytecode with a negative line number delta. Functions using ``frame.f_lineno``, ``PyFrame_GetLineNumber()`` or ``PyCode_Addr2Line()`` are not affected. Functions directly decoding ``co_lnotab`` should be updated to use a signed 8-bit integer type for the line number delta, but this is only required to support applications using a negative line number delta. See ``Objects/lnotab_notes.txt`` for the ``co_lnotab`` format and how to decode it, and see the :pep:`511` for the rationale.
es: El formato del atributo ``co_lnotab`` de los objetos de código cambió para admitir un delta de número de línea negativo. De forma predeterminada, Python no emite un código de bytes con un delta de número de línea negativo. Las funciones que utilizan ``frame.f_lineno``, ``PyFrame_GetLineNumber()`` o ``PyCode_Addr2Line()`` no se ven afectadas. Las funciones que decodifican directamente ``co_lnotab`` deben actualizarse para usar un tipo entero de 8 bits con signo para el delta del número de línea, pero esto solo es necesario para admitir aplicaciones que usan un delta del número de línea negativo. Consulte ``Objects/lnotab_notes.txt`` para conocer el formato ``co_lnotab`` y cómo decodificarlo, y consulte :pep:`511` para conocer la justificación.

source: The functions in the :mod:`compileall` module now return booleans instead of ``1`` or ``0`` to represent success or failure, respectively. Thanks to booleans being a subclass of integers, this should only be an issue if you were doing identity checks for ``1`` or ``0``. See :issue:`25768`.
es: Las funciones en el módulo :mod:`compileall` ahora devuelven booleanos en lugar de ``1`` o ``0`` para representar éxito o fracaso, respectivamente. Gracias a que los booleanos son una subclase de números enteros, esto solo debería ser un problema si estaba haciendo verificaciones de identidad para ``1`` o ``0``. Ver :issue:`25768`.

source: Reading the :attr:`~urllib.parse.SplitResult.port` attribute of :func:`urllib.parse.urlsplit` and :func:`~urllib.parse.urlparse` results now raises :exc:`ValueError` for out-of-range values, rather than returning :const:`None`. See :issue:`20059`.
es: La lectura del atributo :attr:`~urllib.parse.SplitResult.port` de los resultados de :func:`urllib.parse.urlsplit` y :func:`~urllib.parse.urlparse` ahora lanza :exc:`ValueError` para valores fuera de rango, en lugar de devolver :const:`None`. Ver :issue:`20059`.

source: The following modules have had missing APIs added to their :attr:`__all__` attributes to match the documented APIs: :mod:`calendar`, :mod:`cgi`, :mod:`csv`, :mod:`~xml.etree.ElementTree`, :mod:`enum`, :mod:`fileinput`, :mod:`ftplib`, :mod:`logging`, :mod:`mailbox`, :mod:`mimetypes`, :mod:`optparse`, :mod:`plistlib`, :mod:`smtpd`, :mod:`subprocess`, :mod:`tarfile`, :mod:`threading` and :mod:`wave`. This means they will export new symbols when ``import *`` is used. (Contributed by Joel Taddei and Jacek Kołodziej in :issue:`23883`.)
es: Los siguientes módulos han tenido API faltantes agregadas a sus atributos :attr:`__all__` para que coincidan con las API documentadas: :mod:`calendar`, :mod:`cgi`, :mod:`csv`, :mod:`~xml.etree.ElementTree`, :mod:`enum`, :mod:`fileinput`, :mod:`ftplib`, :mod:`logging`, :mod:`mailbox`, :mod:`mimetypes`, :mod:`optparse`, :mod:`plistlib`, :mod:`smtpd`, :mod:`subprocess`, :mod:`tarfile`, :mod:`threading` y :mod:`wave`. Esto significa que exportarán nuevos símbolos cuando se utilice ``import *``. (Contribuido por Joel Taddei y Jacek Kołodziej en :issue:`23883`.)

source: When performing a relative import, if ``__package__`` does not compare equal to ``__spec__.parent`` then :exc:`ImportWarning` is raised. (Contributed by Brett Cannon in :issue:`25791`.)
es: Al realizar una importación relativa, si ``__package__`` no se compara igual que ``__spec__.parent``, entonces :exc:`ImportWarning` se lanza. (Contribuido por Brett Cannon en :issue:`25791`.)

source: When a relative import is performed and no parent package is known, then :exc:`ImportError` will be raised. Previously, :exc:`SystemError` could be raised. (Contributed by Brett Cannon in :issue:`18018`.)
es: Cuando se realiza una importación relativa y no se conoce ningún paquete principal, se lanzará :exc:`ImportError`. Anteriormente, se podía subir :exc:`SystemError`. (Contribuido por Brett Cannon en :issue:`18018`.)

source: Servers based on the :mod:`socketserver` module, including those defined in :mod:`http.server`, :mod:`xmlrpc.server` and :mod:`wsgiref.simple_server`, now only catch exceptions derived from :exc:`Exception`. Therefore if a request handler raises an exception like :exc:`SystemExit` or :exc:`KeyboardInterrupt`, :meth:`~socketserver.BaseServer.handle_error` is no longer called, and the exception will stop a single-threaded server. (Contributed by Martin Panter in :issue:`23430`.)
es: Los servidores basados en el módulo :mod:`socketserver`, incluidos los definidos en :mod:`http.server`, :mod:`xmlrpc.server` y :mod:`wsgiref.simple_server`, ahora solo detectan excepciones derivadas de :exc:`Exception`. Por lo tanto, si un controlador de solicitudes lanza una excepción como :exc:`SystemExit` o :exc:`KeyboardInterrupt`, ya no se llama a :meth:`~socketserver.BaseServer.handle_error` y la excepción detendrá un servidor de un solo subproceso. (Contribuido por Martin Panter en :issue:`23430`.)

source: :func:`spwd.getspnam` now raises a :exc:`PermissionError` instead of :exc:`KeyError` if the user doesn't have privileges.
es: :func:`spwd.getspnam` ahora lanza un :exc:`PermissionError` en lugar de :exc:`KeyError` si el usuario no tiene privilegios.

source: The :meth:`socket.socket.close` method now raises an exception if an error (e.g. ``EBADF``) was reported by the underlying system call. (Contributed by Martin Panter in :issue:`26685`.)
es: El método :meth:`socket.socket.close` ahora lanza una excepción si la llamada al sistema subyacente informó un error (por ejemplo, ``EBADF``). (Contribuido por Martin Panter en :issue:`26685`.)
