Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: The Settings dialog (Options, Configure IDLE) has been partly rewritten to improve both appearance and function. (Contributed by Cheryl Sabella and Terry Jan Reedy in multiple issues.)
es: El cuadro de diálogo Configuración (Opciones, Configurar IDLE) se ha reescrito parcialmente para mejorar tanto la apariencia como la función. (Contribuido por Cheryl Sabella y Terry Jan Reedy en varios números).

source: New in 3.6.4:
es: Nuevo en 3.6.4:

source: The font sample now includes a selection of non-Latin characters so that users can better see the effect of selecting a particular font. (Contributed by Terry Jan Reedy in :issue:`13802`.) The sample can be edited to include other characters. (Contributed by Serhiy Storchaka in :issue:`31860`.)
es: La muestra de fuente ahora incluye una selección de caracteres no latinos para que los usuarios puedan ver mejor el efecto de seleccionar una fuente en particular. (Contribuido por Terry Jan Reedy en :issue:`13802`.) La muestra se puede editar para incluir otros caracteres. (Contribuido por Serhiy Storchaka en :issue:`31860`.)

source: New in 3.6.6:
es: Nuevo en 3.6.6:

source: Editor code context option revised. Box displays all context lines up to maxlines. Clicking on a context line jumps the editor to that line. Context colors for custom themes is added to Highlights tab of Settings dialog. (Contributed by Cheryl Sabella and Terry Jan Reedy in :issue:`33642`, :issue:`33768`, and :issue:`33679`.)
es: Se revisó la opción de contexto del código del editor. El cuadro muestra todas las líneas de contexto hasta las líneas máximas. Al hacer clic en una línea de contexto, el editor salta a esa línea. Los colores de contexto para temas personalizados se agregan a la pestaña Destacados del cuadro de diálogo Configuración. (Contribuido por Cheryl Sabella y Terry Jan Reedy en :issue:`33642`, :issue:`33768` y :issue:`33679`.)

source: On Windows, a new API call tells Windows that tk scales for DPI. On Windows 8.1+ or 10, with DPI compatibility properties of the Python binary unchanged, and a monitor resolution greater than 96 DPI, this should make text and lines sharper. It should otherwise have no effect. (Contributed by Terry Jan Reedy in :issue:`33656`.)
es: En Windows, una nueva llamada a la API le dice a Windows que tk escala para DPI. En Windows 8.1+ o 10, con las propiedades de compatibilidad de DPI del binario de Python sin cambios y una resolución de monitor superior a 96 DPI, esto debería hacer que el texto y las líneas sean más nítidos. De lo contrario, no debería tener ningún efecto. (Contribuido por Terry Jan Reedy en :issue:`33656`.)

source: New in 3.6.7:
es: Nuevo en 3.6.7:

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
es: La salida sobre N líneas (50 por defecto) se reduce a un botón. N se puede cambiar en la sección PyShell de la página General del cuadro de diálogo Configuración. Se pueden comprimir menos líneas, pero posiblemente más largas, haciendo clic derecho en la salida. La salida comprimida se puede expandir en su lugar haciendo doble clic en el botón o en el portapapeles o en una ventana separada haciendo clic derecho en el botón. (Contribuido por Tal Einat en :issue:`1529353`.)

source: Import now raises the new exception :exc:`ModuleNotFoundError` (subclass of :exc:`ImportError`) when it cannot find a module. Code that current checks for ``ImportError`` (in try-except) will still work. (Contributed by Eric Snow in :issue:`15767`.)
es: Importar ahora lanza la nueva excepción :exc:`ModuleNotFoundError` (subclase de :exc:`ImportError`) cuando no puede encontrar un módulo. Codifique que las comprobaciones actuales para ``ImportError`` (en try-except) seguirán funcionando. (Contribuido por Eric Snow en :issue:`15767`.)

source: :class:`importlib.util.LazyLoader` now calls :meth:`~importlib.abc.Loader.create_module` on the wrapped loader, removing the restriction that :class:`importlib.machinery.BuiltinImporter` and :class:`importlib.machinery.ExtensionFileLoader` couldn't be used with :class:`importlib.util.LazyLoader`.
es: :class:`importlib.util.LazyLoader` ahora llama a :meth:`~importlib.abc.Loader.create_module` en el cargador envuelto, eliminando la restricción de que :class:`importlib.machinery.BuiltinImporter` y :class:`importlib.machinery.ExtensionFileLoader` no se pueden usar con :class:`importlib.util.LazyLoader`.

source: :func:`importlib.util.cache_from_source`, :func:`importlib.util.source_from_cache`, and :func:`importlib.util.spec_from_file_location` now accept a :term:`path-like object`.
es: :func:`importlib.util.cache_from_source`, :func:`importlib.util.source_from_cache` y :func:`importlib.util.spec_from_file_location` ahora aceptan un :term:`path-like object`.

source: inspect
es: inspeccionar

source: The :func:`inspect.signature() <inspect.signature>` function now reports the implicit ``.0`` parameters generated by the compiler for comprehension and generator expression scopes as if they were positional-only parameters called ``implicit0``. (Contributed by Jelle Zijlstra in :issue:`19611`.)
es: La función :func:`inspect.signature() <inspect.signature>` ahora reporta los parámetros ``.0`` implícitos generados por el compilador para los alcances de comprensión y expresión del generador como si fueran parámetros solo posicionales llamados ``implicit0``. (Contribuido por Jelle Zijlstra en :issue:`19611`.)

source: To reduce code churn when upgrading from Python 2.7 and the legacy :func:`inspect.getargspec` API, the previously documented deprecation of :func:`inspect.getfullargspec` has been reversed. While this function is convenient for single/source Python 2/3 code bases, the richer :func:`inspect.signature` interface remains the recommended approach for new code. (Contributed by Nick Coghlan in :issue:`27172`)
es: Para reducir la pérdida de código al actualizar desde Python 2.7 y la API :func:`inspect.getargspec` heredada, se ha revertido la desaprobación previamente documentada de :func:`inspect.getfullargspec`. Si bien esta función es conveniente para bases de código Python 2/3 de fuente única / fuente, la interfaz :func:`inspect.signature` más rica sigue siendo el enfoque recomendado para el nuevo código. (Contribuido por Nick Coghlan en :issue:`27172`)

source: :func:`json.load` and :func:`json.loads` now support binary input. Encoded JSON should be represented using either UTF-8, UTF-16, or UTF-32. (Contributed by Serhiy Storchaka in :issue:`17909`.)
es: :func:`json.load` y :func:`json.loads` ahora admiten entrada binaria. El JSON codificado debe representarse mediante UTF-8, UTF-16 o UTF-32. (Contribuido por Serhiy Storchaka en :issue:`17909`.)

source: logging
es: Inicio sesión

source: The new :meth:`WatchedFileHandler.reopenIfNeeded() <logging.handlers.WatchedFileHandler.reopenIfNeeded>` method has been added to add the ability to check if the log file needs to be reopened. (Contributed by Marian Horban in :issue:`24884`.)
es: Se agregó el nuevo método :meth:`WatchedFileHandler.reopenIfNeeded() <logging.handlers.WatchedFileHandler.reopenIfNeeded>` para agregar la capacidad de verificar si es necesario volver a abrir el archivo de registro. (Contribuido por Marian Horban en :issue:`24884`.)

source: math
es: Matemáticas

source: The tau (*τ*) constant has been added to the :mod:`math` and :mod:`cmath` modules. (Contributed by Lisa Roach in :issue:`12345`, see :pep:`628` for details.)
es: La constante tau (*τ*) se ha agregado a los módulos :mod:`math` y :mod:`cmath`. (Contribuido por Lisa Roach en :issue:`12345`, consulte :pep:`628` para obtener más detalles).

source: multiprocessing
es: multiprocesamiento

source: :ref:`Proxy Objects <multiprocessing-proxy_objects>` returned by :func:`multiprocessing.Manager` can now be nested. (Contributed by Davin Potts in :issue:`6766`.)
es: :ref:`Proxy Objects <multiprocessing-proxy_objects>` devuelto por :func:`multiprocessing.Manager` ahora se puede anidar. (Contribuido por Davin Potts en :issue:`6766`.)

source: See the summary of :ref:`PEP 519 <whatsnew36-pep519>` for details on how the :mod:`os` and :mod:`os.path` modules now support :term:`path-like objects <path-like object>`.
es: Consulte el resumen de :ref:`PEP 519 <whatsnew36-pep519>` para obtener detalles sobre cómo los módulos :mod:`os` y :mod:`os.path` ahora admiten :term:`path-like objects <path-like object>`.

source: :func:`~os.scandir` now supports :class:`bytes` paths on Windows.
es: :func:`~os.scandir` ahora admite rutas :class:`bytes` en Windows.

source: A new :meth:`~os.scandir.close` method allows explicitly closing a :func:`~os.scandir` iterator. The :func:`~os.scandir` iterator now supports the :term:`context manager` protocol. If a :func:`scandir` iterator is neither exhausted nor explicitly closed a :exc:`ResourceWarning` will be emitted in its destructor. (Contributed by Serhiy Storchaka in :issue:`25994`.)
es: Un nuevo método :meth:`~os.scandir.close` permite cerrar explícitamente un iterador :func:`~os.scandir`. El iterador :func:`~os.scandir` ahora admite el protocolo :term:`context manager`. Si un iterador :func:`scandir` no se agota ni se cierra explícitamente, se emitirá un :exc:`ResourceWarning` en su destructor. (Contribuido por Serhiy Storchaka en :issue:`25994`.)

source: The Linux ``getrandom()`` syscall (get random bytes) is now exposed as the new :func:`os.getrandom` function. (Contributed by Victor Stinner, part of the :pep:`524`)
es: El syscall de Linux ``getrandom()`` (obtener bytes aleatorios) ahora se expone como la nueva función :func:`os.getrandom`. (Contribuido por Victor Stinner, parte del :pep:`524`)

source: :mod:`pathlib` now supports :term:`path-like objects <path-like object>`. (Contributed by Brett Cannon in :issue:`27186`.)
es: :mod:`pathlib` ahora es compatible con :term:`path-like objects <path-like object>`. (Contribuido por Brett Cannon en :issue:`27186`.)

source: See the summary of :ref:`PEP 519 <whatsnew36-pep519>` for details.
es: Consulte el resumen de :ref:`PEP 519 <whatsnew36-pep519>` para obtener más detalles.

source: The :class:`~pdb.Pdb` class constructor has a new optional *readrc* argument to control whether ``.pdbrc`` files should be read.
es: El constructor de la clase :class:`~pdb.Pdb` tiene un nuevo argumento *readrc* opcional para controlar si se deben leer los archivos ``.pdbrc``.

source: pickle
es: pepinillo

source: Objects that need ``__new__`` called with keyword arguments can now be pickled using :ref:`pickle protocols <pickle-protocols>` older than protocol version 4. Protocol version 4 already supports this case. (Contributed by Serhiy Storchaka in :issue:`24164`.)
es: Los objetos que necesitan que se llame a ``__new__`` con argumentos de palabras clave ahora se pueden seleccionar utilizando :ref:`pickle protocols <pickle-protocols>` anterior a la versión del protocolo 4. La versión 4 del protocolo ya es compatible con este caso. (Contribuido por Serhiy Storchaka en :issue:`24164`.)

source: pickletools
es: pepinillos

source: :func:`pickletools.dis()` now outputs the implicit memo index for the ``MEMOIZE`` opcode. (Contributed by Serhiy Storchaka in :issue:`25382`.)
es: :func:`pickletools.dis()` ahora genera el índice de memo implícito para el código de operación ``MEMOIZE``. (Contribuido por Serhiy Storchaka en :issue:`25382`.)

source: The :mod:`pydoc` module has learned to respect the ``MANPAGER`` environment variable. (Contributed by Matthias Klose in :issue:`8637`.)
es: El módulo :mod:`pydoc` ha aprendido a respetar la variable de entorno ``MANPAGER``. (Contribuido por Matthias Klose en :issue:`8637`.)

source: :func:`help` and :mod:`pydoc` can now list named tuple fields in the order they were defined rather than alphabetically. (Contributed by Raymond Hettinger in :issue:`24879`.)
es: :func:`help` y :mod:`pydoc` ahora pueden enumerar campos de tupla con nombre en el orden en que se definieron en lugar de alfabéticamente. (Contribuido por Raymond Hettinger en :issue:`24879`.)

source: random
es: aleatorio

source: The new :func:`~random.choices` function returns a list of elements of specified size from the given population with optional weights. (Contributed by Raymond Hettinger in :issue:`18844`.)
es: La nueva función :func:`~random.choices` devuelve una lista de elementos de tamaño especificado de la población dada con pesos opcionales. (Contribuido por Raymond Hettinger en :issue:`18844`.)

source: Added support of modifier spans in regular expressions. Examples: ``'(?i:p)ython'`` matches ``'python'`` and ``'Python'``, but not ``'PYTHON'``; ``'(?i)g(?-i:v)r'`` matches ``'GvR'`` and ``'gvr'``, but not ``'GVR'``. (Contributed by Serhiy Storchaka in :issue:`433028`.)
es: Se agregó soporte para lapsos de modificadores en expresiones regulares. Ejemplos: ``'(?i:p)ython'`` coincide con ``'python'`` y ``'Python'``, pero no con ``'PYTHON'``; ``'(?i)g(?-i:v)r'`` coincide con ``'GvR'`` y ``'gvr'``, pero no con ``'GVR'``. (Contribuido por Serhiy Storchaka en :issue:`433028`.)

source: Match object groups can be accessed by ``__getitem__``, which is equivalent to ``group()``. So ``mo['name']`` is now equivalent to ``mo.group('name')``. (Contributed by Eric Smith in :issue:`24454`.)
es: Se puede acceder a los grupos de objetos coincidentes mediante ``__getitem__``, que es equivalente a ``group()``. Entonces ``mo['name']`` ahora es equivalente a ``mo.group('name')``. (Contribuido por Eric Smith en :issue:`24454`.)

source: :class:`~re.Match` objects now support :meth:`index-like objects <object.__index__>` as group indices. (Contributed by Jeroen Demeyer and Xiang Zhang in :issue:`27177`.)
es: Los objetos :class:`~re.Match` ahora admiten :meth:`index-like objects <object.__index__>` como índices de grupo. (Contribuido por Jeroen Demeyer y Xiang Zhang en :issue:`27177`.)

source: Added :func:`~readline.set_auto_history` to enable or disable automatic addition of input to the history list. (Contributed by Tyler Crompton in :issue:`26870`.)
es: Se agregó :func:`~readline.set_auto_history` para habilitar o deshabilitar la adición automática de entradas a la lista del historial. (Contribuido por Tyler Crompton en :issue:`26870`.)

source: Private and special attribute names now are omitted unless the prefix starts with underscores. A space or a colon is added after some completed keywords. (Contributed by Serhiy Storchaka in :issue:`25011` and :issue:`25209`.)
es: Los nombres de atributos privados y especiales ahora se omiten a menos que el prefijo comience con guiones bajos. Se agrega un espacio o dos puntos después de algunas palabras clave completadas. (Contribuido por Serhiy Storchaka en :issue:`25011` y :issue:`25209`.)

source: The :class:`~shlex.shlex` has much :ref:`improved shell compatibility <improved-shell-compatibility>` through the new *punctuation_chars* argument to control which characters are treated as punctuation. (Contributed by Vinay Sajip in :issue:`1521950`.)
es: El :class:`~shlex.shlex` tiene mucho :ref:`improved shell compatibility <improved-shell-compatibility>` a través del nuevo argumento *punctuation_chars* para controlar qué caracteres se tratan como puntuación. (Contribuido por Vinay Sajip en :issue:`1521950`.)

source: site
es: sitio

source: :attr:`sqlite3.Cursor.lastrowid` now supports the ``REPLACE`` statement. (Contributed by Alex LordThorsen in :issue:`16864`.)
es: :attr:`sqlite3.Cursor.lastrowid` ahora admite la declaración ``REPLACE``. (Contribuido por Alex LordThorsen en :issue:`16864`.)

source: socket
es: enchufe

source: The :meth:`~socket.socket.getsockopt` constants ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC``, and ``SO_PASSSEC`` are now supported. (Contributed by Christian Heimes in :issue:`26907`.)
es: Las constantes :meth:`~socket.socket.getsockopt` ``SO_DOMAIN``, ``SO_PROTOCOL``, ``SO_PEERSEC`` y ``SO_PASSSEC`` ahora son compatibles. (Contribuido por Christian Heimes en :issue:`26907`.)

source: The :meth:`~socket.socket.setsockopt` now supports the ``setsockopt(level, optname, None, optlen: int)`` form. (Contributed by Christian Heimes in :issue:`27744`.)
es: El :meth:`~socket.socket.setsockopt` ahora admite el formulario ``setsockopt(level, optname, None, optlen: int)``. (Contribuido por Christian Heimes en :issue:`27744`.)

source: New Linux constants ``TCP_USER_TIMEOUT`` and ``TCP_CONGESTION`` were added. (Contributed by Omar Sandoval, :issue:`26273`).
es: Se agregaron las nuevas constantes de Linux ``TCP_USER_TIMEOUT`` y ``TCP_CONGESTION``. (Contribuido por Omar Sandoval, :issue:`26273`).

source: socketserver
es: servidor de sockets

source: Servers based on the :mod:`socketserver` module, including those defined in :mod:`http.server`, :mod:`xmlrpc.server` and :mod:`wsgiref.simple_server`, now support the :term:`context manager` protocol. (Contributed by Aviv Palivoda in :issue:`26404`.)
es: Los servidores basados en el módulo :mod:`socketserver`, incluidos los definidos en :mod:`http.server`, :mod:`xmlrpc.server` y :mod:`wsgiref.simple_server`, ahora admiten el protocolo :term:`context manager`. (Contribuido por Aviv Palivoda en :issue:`26404`.)

source: The :attr:`~socketserver.StreamRequestHandler.wfile` attribute of :class:`~socketserver.StreamRequestHandler` classes now implements the :class:`io.BufferedIOBase` writable interface. In particular, calling :meth:`~io.BufferedIOBase.write` is now guaranteed to send the data in full. (Contributed by Martin Panter in :issue:`26721`.)
es: El atributo :attr:`~socketserver.StreamRequestHandler.wfile` de las clases :class:`~socketserver.StreamRequestHandler` ahora implementa la interfaz de escritura :class:`io.BufferedIOBase`. En particular, ahora se garantiza que llamar a :meth:`~io.BufferedIOBase.write` enviará los datos completos. (Contribuido por Martin Panter en :issue:`26721`.)

source: :mod:`ssl` supports OpenSSL 1.1.0. The minimum recommend version is 1.0.2. (Contributed by Christian Heimes in :issue:`26470`.)
es: :mod:`ssl` es compatible con OpenSSL 1.1.0. La versión mínima recomendada es 1.0.2. (Contribuido por Christian Heimes en :issue:`26470`.)

source: 3DES has been removed from the default cipher suites and ChaCha20 Poly1305 cipher suites have been added. (Contributed by Christian Heimes in :issue:`27850` and :issue:`27766`.)
es: Se ha eliminado 3DES de los conjuntos de cifrado predeterminados y se han agregado conjuntos de cifrado ChaCha20 Poly1305. (Contribuido por Christian Heimes en :issue:`27850` y :issue:`27766`.)

source: :class:`~ssl.SSLContext` has better default configuration for options and ciphers. (Contributed by Christian Heimes in :issue:`28043`.)
es: :class:`~ssl.SSLContext` tiene una mejor configuración predeterminada para opciones y cifrados. (Contribuido por Christian Heimes en :issue:`28043`.)

source: SSL session can be copied from one client-side connection to another with the new :class:`~ssl.SSLSession` class. TLS session resumption can speed up the initial handshake, reduce latency and improve performance (Contributed by Christian Heimes in :issue:`19500` based on a draft by Alex Warhawk.)
es: La sesión SSL se puede copiar de una conexión del lado del cliente a otra con la nueva clase :class:`~ssl.SSLSession`. La reanudación de la sesión de TLS puede acelerar el apretón de manos inicial, reducir la latencia y mejorar el rendimiento (Contribuido por Christian Heimes en :issue:`19500` basado en un borrador de Alex Warhawk).

source: The new :meth:`~ssl.SSLContext.get_ciphers` method can be used to get a list of enabled ciphers in order of cipher priority.
es: El nuevo método :meth:`~ssl.SSLContext.get_ciphers` se puede utilizar para obtener una lista de cifrados habilitados en orden de prioridad de cifrado.

source: All constants and flags have been converted to :class:`~enum.IntEnum` and :class:`~enum.IntFlags`. (Contributed by Christian Heimes in :issue:`28025`.)
es: Todas las constantes y banderas se han convertido a :class:`~enum.IntEnum` y :class:`~enum.IntFlags`. (Contribuido por Christian Heimes en :issue:`28025`.)

source: Server and client-side specific TLS protocols for :class:`~ssl.SSLContext` were added. (Contributed by Christian Heimes in :issue:`28085`.)
es: Se agregaron protocolos TLS específicos del lado del servidor y del cliente para :class:`~ssl.SSLContext`. (Contribuido por Christian Heimes en :issue:`28085`.)

source: statistics
es: Estadísticas

source: A new :func:`~statistics.harmonic_mean` function has been added. (Contributed by Steven D'Aprano in :issue:`27181`.)
es: Se ha agregado una nueva función :func:`~statistics.harmonic_mean`. (Contribuido por Steven D'Aprano en :issue:`27181`.)

source: struct
es: estructura

source: :mod:`struct` now supports IEEE 754 half-precision floats via the ``'e'`` format specifier. (Contributed by Eli Stevens, Mark Dickinson in :issue:`11734`.)
es: :mod:`struct` ahora admite flotadores de media precisión IEEE 754 a través del especificador de formato ``'e'``. (Contribuido por Eli Stevens, Mark Dickinson en :issue:`11734`.)

source: subprocess
es: subproceso

source: :class:`subprocess.Popen` destructor now emits a :exc:`ResourceWarning` warning if the child process is still running. Use the context manager protocol (``with proc: ...``) or explicitly call the :meth:`~subprocess.Popen.wait` method to read the exit status of the child process. (Contributed by Victor Stinner in :issue:`26741`.)
es: El destructor :class:`subprocess.Popen` ahora emite una advertencia :exc:`ResourceWarning` si el proceso hijo todavía se está ejecutando. Utilice el protocolo del administrador de contexto (``with proc: ...``) o llame explícitamente al método :meth:`~subprocess.Popen.wait` para leer el estado de salida del proceso hijo. (Contribuido por Victor Stinner en :issue:`26741`.)

source: The :class:`subprocess.Popen` constructor and all functions that pass arguments through to it now accept *encoding* and *errors* arguments. Specifying either of these will enable text mode for the *stdin*, *stdout* and *stderr* streams. (Contributed by Steve Dower in :issue:`6135`.)
es: El constructor :class:`subprocess.Popen` y todas las funciones que le pasan argumentos ahora aceptan argumentos *encoding* y *errors*. Especificando alguno de ellos activará el modo texto para *stdin*, *stdout* y *stderr*. (Contribuido por Steve Dower en :issue:`6135`.)

source: The new :func:`~sys.getfilesystemencodeerrors` function returns the name of the error mode used to convert between Unicode filenames and bytes filenames. (Contributed by Steve Dower in :issue:`27781`.)
es: La nueva función :func:`~sys.getfilesystemencodeerrors` devuelve el nombre del modo de error utilizado para convertir entre nombres de archivo Unicode y nombres de archivo en bytes. (Contribuido por Steve Dower en :issue:`27781`.)

source: On Windows the return value of the :func:`~sys.getwindowsversion` function now includes the *platform_version* field which contains the accurate major version, minor version and build number of the current operating system, rather than the version that is being emulated for the process (Contributed by Steve Dower in :issue:`27932`.)
es: En Windows, el valor de retorno de la función :func:`~sys.getwindowsversion` ahora incluye el campo *platform_version* que contiene la versión principal precisa, la versión secundaria y el número de compilación del sistema operativo actual, en lugar de la versión que se está emulando para el proceso (contribución de Steve Dower en :issue:`27932` .)
