Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: New :meth:`loop.create_future() <asyncio.loop.create_future>` method to create Future objects. This allows alternative event loop implementations, such as `uvloop <https://github.com/MagicStack/uvloop>`_, to provide a faster :class:`asyncio.Future` implementation. (Contributed by Yury Selivanov in :issue:`27041`.)
es: Nuevo método :meth:`loop.create_future() <asyncio.loop.create_future>` para crear objetos Future. Esto permite implementaciones alternativas de bucle de eventos, como `uvloop <https://github.com/MagicStack/uvloop>`_, para proporcionar una implementación :class:`asyncio.Future` más rápida. (Contribuido por Yury Selivanov en :issue:`27041`.)

source: New :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` method to get the current exception handler. (Contributed by Yury Selivanov in :issue:`27040`.)
es: Nuevo método :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` para obtener el controlador de excepciones actual. (Contribuido por Yury Selivanov en :issue:`27040`.)

source: New :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` method to read data from the stream until a separator bytes sequence appears. (Contributed by Mark Korenberg.)
es: Nuevo método :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` para leer datos de la secuencia hasta que aparezca una secuencia de bytes de separación. (Contribuido por Mark Korenberg.)

source: The performance of :meth:`StreamReader.readexactly() <asyncio.StreamReader.readexactly>` has been improved. (Contributed by Mark Korenberg in :issue:`28370`.)
es: Se ha mejorado el rendimiento de :meth:`StreamReader.readexactly() <asyncio.StreamReader.readexactly>`. (Contribuido por Mark Korenberg en :issue:`28370`.)

source: The :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>` method is optimized to avoid calling the system ``getaddrinfo`` function if the address is already resolved. (Contributed by A. Jesse Jiryu Davis.)
es: El método :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>` está optimizado para evitar llamar a la función ``getaddrinfo`` del sistema si la dirección ya está resuelta. (Contribuido por A. Jesse Jiryu Davis.)

source: The :meth:`loop.stop() <asyncio.loop.stop>` method has been changed to stop the loop immediately after the current iteration. Any new callbacks scheduled as a result of the last iteration will be discarded. (Contributed by Guido van Rossum in :issue:`25593`.)
es: El método :meth:`loop.stop() <asyncio.loop.stop>` se ha cambiado para detener el bucle inmediatamente después de la iteración actual. Se descartarán todas las devoluciones de llamada nuevas programadas como resultado de la última iteración. (Contribuido por Guido van Rossum en :issue:`25593`.)

source: :meth:`Future.set_exception <asyncio.futures.Future.set_exception>` will now raise :exc:`TypeError` when passed an instance of the :exc:`StopIteration` exception. (Contributed by Chris Angelico in :issue:`26221`.)
es: :meth:`Future.set_exception <asyncio.futures.Future.set_exception>` ahora lanzará :exc:`TypeError` cuando se pase una instancia de la excepción :exc:`StopIteration`. (Contribuido por Chris Angelico en :issue:`26221`.)

source: New :meth:`loop.connect_accepted_socket() <asyncio.loop.connect_accepted_socket>` method to be used by servers that accept connections outside of asyncio, but that use asyncio to handle them. (Contributed by Jim Fulton in :issue:`27392`.)
es: Nuevo método :meth:`loop.connect_accepted_socket() <asyncio.loop.connect_accepted_socket>` para ser usado por servidores que aceptan conexiones fuera de asyncio, pero que usan asyncio para manejarlas. (Contribuido por Jim Fulton en :issue:`27392`.)

source: ``TCP_NODELAY`` flag is now set for all TCP transports by default. (Contributed by Yury Selivanov in :issue:`27456`.)
es: El indicador ``TCP_NODELAY`` ahora está configurado para todos los transportes TCP de forma predeterminada. (Contribuido por Yury Selivanov en :issue:`27456`.)

source: New :meth:`loop.shutdown_asyncgens() <asyncio.loop.shutdown_asyncgens>` to properly close pending asynchronous generators before closing the loop. (Contributed by Yury Selivanov in :issue:`28003`.)
es: Nuevo :meth:`loop.shutdown_asyncgens() <asyncio.loop.shutdown_asyncgens>` para cerrar correctamente los generadores asincrónicos pendientes antes de cerrar el ciclo. (Contribuido por Yury Selivanov en :issue:`28003`.)

source: :class:`Future <asyncio.Future>` and :class:`Task <asyncio.Task>` classes now have an optimized C implementation which makes asyncio code up to 30% faster. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26081` and :issue:`28544`.)
es: Las clases :class:`Future <asyncio.Future>` y :class:`Task <asyncio.Task>` ahora tienen una implementación C optimizada que hace que el código asyncio sea hasta un 30% más rápido. (Contribuido por Yury Selivanov e INADA Naoki en :issue:`26081` y :issue:`28544`.)

source: The :func:`~binascii.b2a_base64` function now accepts an optional *newline* keyword argument to control whether the newline character is appended to the return value. (Contributed by Victor Stinner in :issue:`25357`.)
es: La función :func:`~binascii.b2a_base64` ahora acepta un argumento de palabra clave *newline* opcional para controlar si el carácter de nueva línea se agrega al valor de retorno. (Contribuido por Victor Stinner en :issue:`25357`.)

source: The new :const:`cmath.tau` (*τ*) constant has been added. (Contributed by Lisa Roach in :issue:`12345`, see :pep:`628` for details.)
es: Se ha agregado la nueva constante :const:`cmath.tau` (*τ*). (Contribuido por Lisa Roach en :issue:`12345`, consulte :pep:`628` para obtener más detalles).

source: New constants: :const:`cmath.inf` and :const:`cmath.nan` to match :const:`math.inf` and :const:`math.nan`, and also :const:`cmath.infj` and :const:`cmath.nanj` to match the format used by complex repr. (Contributed by Mark Dickinson in :issue:`23229`.)
es: Nuevas constantes: :const:`cmath.inf` y :const:`cmath.nan` para que coincidan con :const:`math.inf` y :const:`math.nan`, y también :const:`cmath.infj` y :const:`cmath.nanj` para que coincidan con el formato utilizado por la repetición compleja. (Contribuido por Mark Dickinson en :issue:`23229`.)

source: collections
es: colecciones

source: The new :class:`~collections.abc.Collection` abstract base class has been added to represent sized iterable container classes. (Contributed by Ivan Levkivskyi, docs by Neil Girdhar in :issue:`27598`.)
es: Se ha agregado la nueva clase base abstracta :class:`~collections.abc.Collection` para representar clases de contenedores iterables de tamaño. (Contribuido por Ivan Levkivskyi, documentos de Neil Girdhar en :issue:`27598`.)

source: The new :class:`~collections.abc.Reversible` abstract base class represents iterable classes that also provide the :meth:`__reversed__` method. (Contributed by Ivan Levkivskyi in :issue:`25987`.)
es: La nueva clase base abstracta :class:`~collections.abc.Reversible`. representa clases iterables que también proveen el método :meth:`__reversed__`.(Contribuido por Ivan Levkivskyi en :issue:`25987`.)

source: The new :class:`~collections.abc.AsyncGenerator` abstract base class represents asynchronous generators. (Contributed by Yury Selivanov in :issue:`28720`.)
es: La nueva clase base abstracta :class:`~collections.abc.AsyncGenerator` representa generadores asincrónicos. (Contribuido por Yury Selivanov en :issue:`28720`.)

source: The :func:`~collections.namedtuple` function now accepts an optional keyword argument *module*, which, when specified, is used for the ``__module__`` attribute of the returned named tuple class. (Contributed by Raymond Hettinger in :issue:`17941`.)
es: La función :func:`~collections.namedtuple` ahora acepta un argumento de palabra clave opcional *module*, que, cuando se especifica, se utiliza para el atributo ``__module__`` de la clase de tupla con nombre devuelto. (Contribuido por Raymond Hettinger en :issue:`17941`.)

source: The *verbose* and *rename* arguments for :func:`~collections.namedtuple` are now keyword-only. (Contributed by Raymond Hettinger in :issue:`25628`.)
es: Los argumentos *verbose* and *rename* para :func:`~collections.namedtuple` ahora son solo palabras clave. (Contribuido por Raymond Hettinger en :issue:`25628`.)

source: Recursive :class:`collections.deque` instances can now be pickled. (Contributed by Serhiy Storchaka in :issue:`26482`.)
es: Las instancias de :class:`collections.deque` recursivas ahora se pueden eliminar. (Contribuido por Serhiy Storchaka en :issue:`26482`.)

source: concurrent.futures
es: Futuros concurrentes

source: The :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` class constructor now accepts an optional *thread_name_prefix* argument to make it possible to customize the names of the threads created by the pool. (Contributed by Gregory P. Smith in :issue:`27664`.)
es: El constructor de la clase :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` ahora acepta un argumento *thread_name_prefix* opcional para que sea posible personalizar los nombres de los subprocesos creados por el grupo. (Contribuido por Gregory P. Smith en :issue:`27664`.)

source: The :class:`contextlib.AbstractContextManager` class has been added to provide an abstract base class for context managers. It provides a sensible default implementation for ``__enter__()`` which returns ``self`` and leaves ``__exit__()`` an abstract method. A matching class has been added to the :mod:`typing` module as :class:`typing.ContextManager`. (Contributed by Brett Cannon in :issue:`25609`.)
es: La clase :class:`contextlib.AbstractContextManager` fue agregada para proveer una clase abstracta para gestores de contexto. Provee una implementación por defecto sensible para `__enter__()` que retorna ``self`` y deja un método abstracto `__exit__()`. Se ha agregado una clase coincidente al módulo :mod:`typing` como :class:`typing.ContextManager`. (Contribuido por Brett Cannon en :issue:`25609`.)

source: datetime
es: fecha y hora

source: The :class:`~datetime.datetime` and :class:`~datetime.time` classes have the new :attr:`~time.fold` attribute used to disambiguate local time when necessary. Many functions in the :mod:`datetime` have been updated to support local time disambiguation. See :ref:`Local Time Disambiguation <whatsnew36-pep495>` section for more information. (Contributed by Alexander Belopolsky in :issue:`24773`.)
es: Las clases :class:`~datetime.datetime` y :class:`~datetime.time` tienen el nuevo atributo :attr:`~time.fold` utilizado para eliminar la ambigüedad de la hora local cuando sea necesario. Muchas funciones en el :mod:`datetime` se han actualizado para admitir la desambiguación de la hora local. Consulte la sección :ref:`Local Time Disambiguation <whatsnew36-pep495>` para obtener más información. (Contribuido por Alexander Belopolsky en :issue:`24773`.)

source: The :meth:`datetime.strftime() <datetime.datetime.strftime>` and :meth:`date.strftime() <datetime.date.strftime>` methods now support ISO 8601 date directives ``%G``, ``%u`` and ``%V``. (Contributed by Ashley Anderson in :issue:`12006`.)
es: Los métodos :meth:`datetime.strftime() <datetime.datetime.strftime>` y :meth:`date.strftime() <datetime.date.strftime>` ahora admiten las directivas de fecha ISO 8601 ``%G``, ``%u`` y ``%V``. (Contribuido por Ashley Anderson en :issue:`12006`.)

source: The :func:`datetime.isoformat() <datetime.datetime.isoformat>` function now accepts an optional *timespec* argument that specifies the number of additional components of the time value to include. (Contributed by Alessandro Cucci and Alexander Belopolsky in :issue:`19475`.)
es: La función :func:`datetime.isoformat() <datetime.datetime.isoformat>` ahora acepta un argumento *timespec* opcional que especifica el número de componentes adicionales del valor de tiempo a incluir. (Contribuido por Alessandro Cucci y Alexander Belopolsky en :issue:`19475`.)

source: The :meth:`datetime.combine() <datetime.datetime.combine>` now accepts an optional *tzinfo* argument. (Contributed by Alexander Belopolsky in :issue:`27661`.)
es: El :meth:`datetime.combine() <datetime.datetime.combine>` ahora acepta un argumento *tzinfo* opcional. (Contribuido por Alexander Belopolsky en :issue:`27661`.)

source: New :meth:`Decimal.as_integer_ratio() <decimal.Decimal.as_integer_ratio>` method that returns a pair ``(n, d)`` of integers that represent the given :class:`~decimal.Decimal` instance as a fraction, in lowest terms and with a positive denominator::
es: Nuevo método :meth:`Decimal.as_integer_ratio() <decimal.Decimal.as_integer_ratio>` que devuelve un par ``(n, d)`` de enteros que representan la instancia :class:`~decimal.Decimal` dada como una fracción, en términos más bajos y con un denominador positivo:

source: (Contributed by Stefan Krah amd Mark Dickinson in :issue:`25928`.)
es: (Contribuido por Stefan Krah y Mark Dickinson en :issue:`25928`.)

source: The new email API, enabled via the *policy* keyword to various constructors, is no longer provisional. The :mod:`email` documentation has been reorganized and rewritten to focus on the new API, while retaining the old documentation for the legacy API. (Contributed by R. David Murray in :issue:`24277`.)
es: La nueva API de correo electrónico, habilitada a través de la palabra clave *policy* para varios constructores, ya no es provisional. La documentación de :mod:`email` se ha reorganizado y reescrito para centrarse en la nueva API, conservando la documentación anterior para la API heredada. (Contribuido por R. David Murray en :issue:`24277`.)

source: The :mod:`email.mime` classes now all accept an optional *policy* keyword. (Contributed by Berker Peksag in :issue:`27331`.)
es: Las clases :mod:`email.mime` ahora aceptan todas una palabra clave *policy* opcional. (Contribuido por Berker Peksag en :issue:`27331`.)

source: The :class:`~email.generator.DecodedGenerator` now supports the *policy* keyword.
es: El :class:`~email.generator.DecodedGenerator` ahora admite la palabra clave *policy*.

source: There is a new :mod:`~email.policy` attribute, :attr:`~email.policy.Policy.message_factory`, that controls what class is used by default when the parser creates new message objects. For the :attr:`email.policy.compat32` policy this is :class:`~email.message.Message`, for the new policies it is :class:`~email.message.EmailMessage`. (Contributed by R. David Murray in :issue:`20476`.)
es: Hay un nuevo atributo :mod:`~email.policy`, :attr:`~email.policy.Policy.message_factory`, que controla qué clase se usa por defecto cuando el analizador crea nuevos objetos de mensaje. Para la política :attr:`email.policy.compat32`, es :class:`~email.message.Message`, para las nuevas políticas es :class:`~email.message.EmailMessage`. (Contribuido por R. David Murray en :issue:`20476`.)

source: encodings
es: codificaciones

source: On Windows, added the ``'oem'`` encoding to use ``CP_OEMCP``, and the ``'ansi'`` alias for the existing ``'mbcs'`` encoding, which uses the ``CP_ACP`` code page. (Contributed by Steve Dower in :issue:`27959`.)
es: En Windows, se agregó la codificación ``'oem'`` para usar ``CP_OEMCP`` y el alias ``'ansi'`` para la codificación ``'mbcs'`` existente, que usa la página de códigos ``CP_ACP``. (Contribuido por Steve Dower en :issue:`27959`.)

source: enum
es: enumeración

source: Two new enumeration base classes have been added to the :mod:`enum` module: :class:`~enum.Flag` and :class:`~enum.IntFlags`. Both are used to define constants that can be combined using the bitwise operators. (Contributed by Ethan Furman in :issue:`23591`.)
es: Se han agregado dos nuevas clases base de enumeración al módulo :mod:`enum`: :class:`~enum.Flag` y :class:`~enum.IntFlags`. Ambos se utilizan para definir constantes que se pueden combinar utilizando los operadores bit a bit. (Contribuido por Ethan Furman en :issue:`23591`.)

source: Many standard library modules have been updated to use the :class:`~enum.IntFlags` class for their constants.
es: Muchos módulos de biblioteca estándar se han actualizado para usar la clase :class:`~enum.IntFlags` para sus constantes.

source: The new :class:`enum.auto` value can be used to assign values to enum members automatically::
es: El nuevo valor de :class:`enum.auto` se puede utilizar para asignar valores a los miembros de enumeración automáticamente:

source: faulthandler
es: manipulador de faltas

source: On Windows, the :mod:`faulthandler` module now installs a handler for Windows exceptions: see :func:`faulthandler.enable`. (Contributed by Victor Stinner in :issue:`23848`.)
es: En Windows, el módulo :mod:`faulthandler` ahora instala un controlador para las excepciones de Windows: consulte :func:`faulthandler.enable`. (Contribuido por Victor Stinner en :issue:`23848`.)

source: fileinput
es: entrada de archivo

source: :func:`~fileinput.hook_encoded` now supports the *errors* argument. (Contributed by Joseph Hackman in :issue:`25788`.)
es: :func:`~fileinput.hook_encoded` ahora admite el argumento *errors*. (Contribuido por Joseph Hackman en :issue:`25788`.)

source: :mod:`hashlib` supports OpenSSL 1.1.0. The minimum recommend version is 1.0.2. (Contributed by Christian Heimes in :issue:`26470`.)
es: :mod:`hashlib` es compatible con OpenSSL 1.1.0. La versión mínima recomendada es 1.0.2. (Contribuido por Christian Heimes en :issue:`26470`.)

source: BLAKE2 hash functions were added to the module. :func:`~hashlib.blake2b` and :func:`~hashlib.blake2s` are always available and support the full feature set of BLAKE2. (Contributed by Christian Heimes in :issue:`26798` based on code by Dmitry Chestnykh and Samuel Neves. Documentation written by Dmitry Chestnykh.)
es: Se agregaron funciones hash BLAKE2 al módulo. :func:`~hashlib.blake2b` y :func:`~hashlib.blake2s` siempre están disponibles y admiten el conjunto completo de funciones de BLAKE2. (Contribuido por Christian Heimes en :issue:`26798` basado en código de Dmitry Chestnykh y Samuel Neves. Documentación escrita por Dmitry Chestnykh.)

source: The SHA-3 hash functions :func:`~hashlib.sha3_224`, :func:`~hashlib.sha3_256`, :func:`~hashlib.sha3_384`, :func:`~hashlib.sha3_512`, and SHAKE hash functions :func:`~hashlib.shake_128` and :func:`~hashlib.shake_256` were added. (Contributed by Christian Heimes in :issue:`16113`. Keccak Code Package by Guido Bertoni, Joan Daemen, Michaël Peeters, Gilles Van Assche, and Ronny Van Keer.)
es: Se agregaron las funciones hash SHA-3 :func:`~hashlib.sha3_224`, :func:`~hashlib.sha3_256`, :func:`~hashlib.sha3_384`, :func:`~hashlib.sha3_512` y las funciones hash SHAKE :func:`~hashlib.shake_128` y :func:`~hashlib.shake_256`. (Contribuido por Christian Heimes en :issue:`16113`. Paquete de código Keccak por Guido Bertoni, Joan Daemen, Michaël Peeters, Gilles Van Assche y Ronny Van Keer.)

source: The password-based key derivation function :func:`~hashlib.scrypt` is now available with OpenSSL 1.1.0 and newer. (Contributed by Christian Heimes in :issue:`27928`.)
es: La función de derivación de claves basada en contraseña :func:`~hashlib.scrypt` ahora está disponible con OpenSSL 1.1.0 y versiones posteriores. (Contribuido por Christian Heimes en :issue:`27928`.)

source: :meth:`HTTPConnection.request() <http.client.HTTPConnection.request>` and :meth:`~http.client.HTTPConnection.endheaders` both now support chunked encoding request bodies. (Contributed by Demian Brecht and Rolf Krahl in :issue:`12319`.)
es: :meth:`HTTPConnection.request() <http.client.HTTPConnection.request>` y :meth:`~http.client.HTTPConnection.endheaders` ahora admiten cuerpos de solicitud de codificación fragmentados. (Contribuido por Demian Brecht y Rolf Krahl en :issue:`12319`.)

source: idlelib and IDLE
es: idlelib y IDLE

source: The idlelib package is being modernized and refactored to make IDLE look and work better and to make the code easier to understand, test, and improve. Part of making IDLE look better, especially on Linux and Mac, is using ttk widgets, mostly in the dialogs. As a result, IDLE no longer runs with tcl/tk 8.4. It now requires tcl/tk 8.5 or 8.6. We recommend running the latest release of either.
es: El paquete idlelib se está modernizando y refactorizando para que IDLE se vea y funcione mejor y para que el código sea más fácil de entender, probar y mejorar. Parte de hacer que IDLE se vea mejor, especialmente en Linux y Mac, es usar widgets ttk, principalmente en los cuadros de diálogo. Como resultado, IDLE ya no se ejecuta con tcl / tk 8.4. Ahora requiere tcl / tk 8.5 o 8.6. Recomendamos ejecutar la última versión de cualquiera.

source: 'Modernizing' includes renaming and consolidation of idlelib modules. The renaming of files with partial uppercase names is similar to the renaming of, for instance, Tkinter and TkFont to tkinter and tkinter.font in 3.0. As a result, imports of idlelib files that worked in 3.5 will usually not work in 3.6. At least a module name change will be needed (see idlelib/README.txt), sometimes more. (Name changes contributed by Al Swiegart and Terry Reedy in :issue:`24225`. Most idlelib patches since have been and will be part of the process.)
es: La 'modernización' incluye el cambio de nombre y la consolidación de módulos idlelib. El cambio de nombre de archivos con nombres en mayúsculas parciales es similar al cambio de nombre de, por ejemplo, Tkinter y TkFont a tkinter y tkinter.font en 3.0. Como resultado, las importaciones de archivos idlelib que funcionaban en 3.5 normalmente no funcionarán en 3.6. Se necesitará al menos un cambio de nombre de módulo (ver idlelib / README.txt), a veces más. (Los cambios de nombre aportados por Al Swiegart y Terry Reedy en :issue:`24225`. La mayoría de los parches idlelib desde entonces han sido y serán parte del proceso).

source: In compensation, the eventual result with be that some idlelib classes will be easier to use, with better APIs and docstrings explaining them. Additional useful information will be added to idlelib when available.
es: En compensación, el resultado final será que algunas clases de idlelib serán más fáciles de usar, con mejores API y cadenas de documentación que las expliquen. Se agregará información útil adicional a idlelib cuando esté disponible.

source: New in 3.6.2:
es: Nuevo en 3.6.2:

source: Multiple fixes for autocompletion. (Contributed by Louie Lu in :issue:`15786`.)
es: Varias correcciones para autocompletar. (Contribuido por Louie Lu en :issue:`15786`.)

source: New in 3.6.3:
es: Nuevo en 3.6.3:

source: Module Browser (on the File menu, formerly called Class Browser), now displays nested functions and classes in addition to top-level functions and classes. (Contributed by Guilherme Polo, Cheryl Sabella, and Terry Jan Reedy in :issue:`1612262`.)
es: El Explorador de módulos (en el menú Archivo, antes llamado Explorador de clases), ahora muestra funciones y clases anidadas además de funciones y clases de nivel superior. (Contribuido por Guilherme Polo, Cheryl Sabella y Terry Jan Reedy en :issue:`1612262`.)

source: The IDLE features formerly implemented as extensions have been reimplemented as normal features. Their settings have been moved from the Extensions tab to other dialog tabs. (Contributed by Charles Wohlganger and Terry Jan Reedy in :issue:`27099`.)
es: Las funciones IDLE implementadas anteriormente como extensiones se han vuelto a implementar como funciones normales. Su configuración se ha movido de la pestaña Extensiones a otras pestañas de diálogo. (Contribuido por Charles Wohlganger y Terry Jan Reedy en :issue:`27099`.)
