Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: In most world locations, there have been and will be times when local clocks are moved back. In those times, intervals are introduced in which local clocks show the same time twice in the same day. In these situations, the information displayed on a local clock (or stored in a Python datetime instance) is insufficient to identify a particular moment in time.
es: En la mayoría de las ubicaciones del mundo, ha habido y habrá ocasiones en las que los relojes locales se retrasaron. En esos horarios, se introducen intervalos en los que los relojes locales marcan la misma hora dos veces en el mismo día. En estas situaciones, la información mostrada en un reloj local (o almacenada en una instancia de fecha y hora de Python) es insuficiente para identificar un momento particular en el tiempo.

source: :pep:`495` adds the new *fold* attribute to instances of :class:`datetime.datetime` and :class:`datetime.time` classes to differentiate between two moments in time for which local times are the same::
es: :pep:`495` agrega el nuevo atributo *fold* a las instancias de las clases :class:`datetime.datetime` y :class:`datetime.time` para diferenciar entre dos momentos en el tiempo en los que las horas locales son las mismas:

source: The values of the :attr:`fold <datetime.datetime.fold>` attribute have the value ``0`` for all instances except those that represent the second (chronologically) moment in time in an ambiguous case.
es: Los valores del atributo :attr:`fold <datetime.datetime.fold>` tienen el valor ``0`` para todas las instancias excepto aquellas que representan el segundo momento (cronológicamente) en el tiempo en un caso ambiguo.

source: :pep:`495` -- Local Time Disambiguation
es: :pep:`495` - Desambiguación de hora local

source: PEP written by Alexander Belopolsky and Tim Peters, implementation by Alexander Belopolsky.
es: PEP escrito por Alexander Belopolsky y Tim Peters, implementación por Alexander Belopolsky.

source: PEP 529: Change Windows filesystem encoding to UTF-8
es: PEP 529: cambie la codificación del sistema de archivos de Windows a UTF-8

source: Representing filesystem paths is best performed with str (Unicode) rather than bytes. However, there are some situations where using bytes is sufficient and correct.
es: La representación de las rutas del sistema de archivos se realiza mejor con str (Unicode) en lugar de bytes. Sin embargo, hay algunas situaciones en las que el uso de bytes es suficiente y correcto.

source: Prior to Python 3.6, data loss could result when using bytes paths on Windows. With this change, using bytes to represent paths is now supported on Windows, provided those bytes are encoded with the encoding returned by :func:`sys.getfilesystemencoding()`, which now defaults to ``'utf-8'``.
es: Antes de Python 3.6, podía producirse una pérdida de datos al utilizar rutas de bytes en Windows. Con este cambio, ahora se admite el uso de bytes para representar rutas en Windows, siempre que esos bytes estén codificados con la codificación devuelta por :func:`sys.getfilesystemencoding()`, que ahora tiene como valor predeterminado ``'utf-8'``.

source: Applications that do not use str to represent paths should use :func:`os.fsencode()` and :func:`os.fsdecode()` to ensure their bytes are correctly encoded. To revert to the previous behaviour, set :envvar:`PYTHONLEGACYWINDOWSFSENCODING` or call :func:`sys._enablelegacywindowsfsencoding`.
es: Las aplicaciones que no usan str para representar rutas deben usar :func:`os.fsencode()` y :func:`os.fsdecode()` para asegurarse de que sus bytes estén codificados correctamente. Para volver al comportamiento anterior, configure :envvar:`PYTHONLEGACYWINDOWSFSENCODING` o llame a :func:`sys._enablelegacywindowsfsencoding`.

source: See :pep:`529` for more information and discussion of code modifications that may be required.
es: Consulte :pep:`529` para obtener más información y una discusión sobre las modificaciones de código que pueden ser necesarias.

source: PEP 528: Change Windows console encoding to UTF-8
es: PEP 528: cambie la codificación de la consola de Windows a UTF-8

source: The default console on Windows will now accept all Unicode characters and provide correctly read str objects to Python code. ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` now default to utf-8 encoding.
es: La consola predeterminada en Windows ahora aceptará todos los caracteres Unicode y proporcionará objetos str leídos correctamente al código Python. ``sys.stdin``, ``sys.stdout`` y ``sys.stderr`` ahora tienen la codificación utf-8 por defecto.

source: This change only applies when using an interactive console, and not when redirecting files or pipes. To revert to the previous behaviour for interactive console use, set :envvar:`PYTHONLEGACYWINDOWSSTDIO`.
es: Este cambio solo se aplica cuando se usa una consola interactiva y no cuando se redirigen archivos o canalizaciones. Para volver al comportamiento anterior para el uso de la consola interactiva, configure :envvar:`PYTHONLEGACYWINDOWSSTDIO`.

source: :pep:`528` -- Change Windows console encoding to UTF-8
es: :pep:`528`: cambie la codificación de la consola de Windows a UTF-8

source: PEP written and implemented by Steve Dower.
es: PEP escrito e implementado por Steve Dower.

source: PEP 520: Preserving Class Attribute Definition Order
es: PEP 520: Conservación del orden de definición de atributos de clase

source: Attributes in a class definition body have a natural ordering: the same order in which the names appear in the source. This order is now preserved in the new class's :attr:`~object.__dict__` attribute.
es: Los atributos en el cuerpo de una definición de clase tienen un orden natural: el mismo orden en el que aparecen los nombres en la fuente. Este orden ahora se conserva en el atributo :attr:`~object.__dict__` de la nueva clase.

source: Also, the effective default class *execution* namespace (returned from :ref:`type.__prepare__() <prepare>`) is now an insertion-order-preserving mapping.
es: Además, el espacio de nombres de clase *execution* predeterminado efectivo (devuelto desde :ref:`type.__prepare__() <prepare>`) ahora es una asignación que conserva el orden de inserción.

source: :pep:`520` -- Preserving Class Attribute Definition Order
es: :pep:`520` - Conservación del orden de definición de atributos de clase

source: PEP written and implemented by Eric Snow.
es: PEP escrito e implementado por Eric Snow.

source: PEP 468: Preserving Keyword Argument Order
es: PEP 468: Conservación del orden de los argumentos de las palabras clave

source: ``**kwargs`` in a function signature is now guaranteed to be an insertion-order-preserving mapping.
es: Ahora se garantiza que ``**kwargs`` en una firma de función es un mapeo que conserva el orden de inserción.

source: :pep:`468` -- Preserving Keyword Argument Order
es: :pep:`468` - Conservación del orden de los argumentos de las palabras clave

source: New :ref:`dict <typesmapping>` implementation
es: Nueva implementación de :ref:`dict <typesmapping>`

source: The :ref:`dict <typesmapping>` type now uses a "compact" representation based on `a proposal by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_ which was `first implemented by PyPy <https://morepypy.blogspot.com/2015/01/faster-more-memory-efficient-and-more.html>`_. The memory usage of the new :func:`dict` is between 20% and 25% smaller compared to Python 3.5.
es: El tipo :ref:`dict <typesmapping>` ahora usa una representación "compacta" basada en `a proposal by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_ que era `first implemented by PyPy <https://morepypy.blogspot.com/2015/01/faster-more-memory-efficient-and-more.html>`_. El uso de memoria del nuevo :func:`dict` es entre un 20% y un 25% menor en comparación con Python 3.5.

source: The order-preserving aspect of this new implementation is considered an implementation detail and should not be relied upon (this may change in the future, but it is desired to have this new dict implementation in the language for a few releases before changing the language spec to mandate order-preserving semantics for all current and future Python implementations; this also helps preserve backwards-compatibility with older versions of the language where random iteration order is still in effect, e.g. Python 3.5).
es: El aspecto de conservación del orden de esta nueva implementación se considera un detalle de implementación y no se debe confiar en él (esto puede cambiar en el futuro, pero se desea tener esta nueva implementación de dict en el idioma para algunas versiones antes de cambiar la especificación del idioma para exigir la semántica de preservación del orden para todas las implementaciones de Python actuales y futuras; esto también ayuda a preservar la compatibilidad con versiones anteriores del lenguaje donde el orden de iteración aleatorio todavía está vigente, por ejemplo, Python 3.5).

source: (Contributed by INADA Naoki in :issue:`27350`. Idea `originally suggested by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_.)
es: (Contribuido por INADA Naoki en :issue:`27350`. Idea `originally suggested by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_.)

source: PEP 523: Adding a frame evaluation API to CPython
es: PEP 523: Agregar una API de evaluación de marcos a CPython

source: While Python provides extensive support to customize how code executes, one place it has not done so is in the evaluation of frame objects. If you wanted some way to intercept frame evaluation in Python there really wasn't any way without directly manipulating function pointers for defined functions.
es: Si bien Python proporciona un amplio soporte para personalizar cómo se ejecuta el código, un lugar en el que no lo ha hecho es en la evaluación de objetos de marco. Si quisiera alguna forma de interceptar la evaluación de marcos en Python, realmente no había ninguna forma sin manipular directamente los punteros de función para las funciones definidas.

source: :pep:`523` changes this by providing an API to make frame evaluation pluggable at the C level. This will allow for tools such as debuggers and JITs to intercept frame evaluation before the execution of Python code begins. This enables the use of alternative evaluation implementations for Python code, tracking frame evaluation, etc.
es: :pep:`523` cambia esto al proporcionar una API para hacer que la evaluación de tramas se pueda conectar en el nivel C. Esto permitirá que herramientas como depuradores y JIT intercepten la evaluación del marco antes de que comience la ejecución del código Python. Esto permite el uso de implementaciones de evaluación alternativas para el código Python, seguimiento de la evaluación del marco, etc.

source: This API is not part of the limited C API and is marked as private to signal that usage of this API is expected to be limited and only applicable to very select, low-level use-cases. Semantics of the API will change with Python as necessary.
es: Esta API no forma parte de la API C limitada y está marcada como privada para indicar que se espera que el uso de esta API sea limitado y solo se aplique a casos de uso muy selectos y de bajo nivel. La semántica de la API cambiará con Python según sea necesario.

source: :pep:`523` -- Adding a frame evaluation API to CPython
es: :pep:`523`: agregar una API de evaluación de marcos a CPython

source: PEP written by Brett Cannon and Dino Viehland.
es: PEP escrito por Brett Cannon y Dino Viehland.

source: PYTHONMALLOC environment variable
es: Variable de entorno PYTHONMALLOC

source: The new :envvar:`PYTHONMALLOC` environment variable allows setting the Python memory allocators and installing debug hooks.
es: La nueva variable de entorno :envvar:`PYTHONMALLOC` permite configurar los asignadores de memoria e instalar Python ganchos de depuración.

source: It is now possible to install debug hooks on Python memory allocators on Python compiled in release mode using ``PYTHONMALLOC=debug``. Effects of debug hooks:
es: Ahora es posible instalar enlaces de depuración en asignadores de memoria de Python en Python compilado en modo de lanzamiento usando ``PYTHONMALLOC=debug``. Efectos de los ganchos de depuración:

source: Newly allocated memory is filled with the byte ``0xCB``
es: La memoria recién asignada se llena con el byte ``0xCB``

source: Freed memory is filled with the byte ``0xDB``
es: La memoria liberada se llena con el byte ``0xDB``

source: Detect violations of the Python memory allocator API. For example, :c:func:`PyObject_Free` called on a memory block allocated by :c:func:`PyMem_Malloc`.
es: Detecta violaciones de la API de asignación de memoria de Python. Por ejemplo, :c:func:`PyObject_Free` llamó a un bloque de memoria asignado por :c:func:`PyMem_Malloc`.

source: Detect writes before the start of a buffer (buffer underflows)
es: Detectar escrituras antes del inicio de un búfer (subdesbordamientos del búfer)

source: Detect writes after the end of a buffer (buffer overflows)
es: Detectar escrituras después del final de un búfer (desbordes de búfer)

source: Checking if the GIL is held is also a new feature of Python 3.6.
es: Verificar si el GIL se mantiene también es una nueva característica de Python 3.6.

source: See the :c:func:`PyMem_SetupDebugHooks` function for debug hooks on Python memory allocators.
es: Consulte la función :c:func:`PyMem_SetupDebugHooks` para ver los enlaces de depuración en los asignadores de memoria de Python.

source: It is now also possible to force the usage of the :c:func:`malloc` allocator of the C library for all Python memory allocations using ``PYTHONMALLOC=malloc``. This is helpful when using external memory debuggers like Valgrind on a Python compiled in release mode.
es: Ahora también es posible forzar el uso del asignador :c:func:`malloc` de la biblioteca C para todas las asignaciones de memoria de Python usando ``PYTHONMALLOC=malloc``. Esto es útil cuando se utilizan depuradores de memoria externa como Valgrind en un Python compilado en modo de lanzamiento.

source: On error, the debug hooks on Python memory allocators now use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated.
es: En caso de error, los ganchos de depuración en los asignadores de memoria de Python ahora usan el módulo :mod:`tracemalloc` para obtener el rastreo donde se asignó un bloque de memoria.

source: Example of fatal error on buffer overflow using ``python3.6 -X tracemalloc=5`` (store 5 frames in traces)::
es: Ejemplo de error fatal en el desbordamiento del búfer usando ``python3.6 -X tracemalloc=5`` (almacenar 5 cuadros en trazas):

source: (Contributed by Victor Stinner in :issue:`26516` and :issue:`26564`.)
es: (Contribución de Victor Stinner en :issue:`26516` y :issue:` 26564`.)

source: DTrace and SystemTap probing support
es: Soporte de sondeo DTrace y SystemTap

source: Python can now be built ``--with-dtrace`` which enables static markers for the following events in the interpreter:
es: Python ahora se puede construir ``--with-dtrace`` que habilita marcadores estáticos para los siguientes eventos en el intérprete:

source: function call/return
es: función llamada / retorno

source: garbage collection started/finished
es: recogida de basura iniciada / finalizada

source: line of code executed.
es: línea de código ejecutada.

source: This can be used to instrument running interpreters in production, without the need to recompile specific :ref:`debug builds <debug-build>` or providing application-specific profiling/debugging code.
es: Esto se puede utilizar para instrumentar intérpretes en ejecución en producción, sin la necesidad de volver a compilar :ref:`debug builds <debug-build>` específico o proporcionar código de depuración / perfilado específico de la aplicación.

source: More details in :ref:`instrumentation`.
es: Más detalles en :ref:`instrumentation`.

source: The current implementation is tested on Linux and macOS. Additional markers may be added in the future.
es: La implementación actual se prueba en Linux y macOS. Es posible que se agreguen marcadores adicionales en el futuro.

source: (Contributed by Łukasz Langa in :issue:`21590`, based on patches by Jesús Cea Avión, David Malcolm, and Nikhil Benesch.)
es: (Contribuido por Łukasz Langa en :issue:`21590`, basado en parches de Jesús Cea Avión, David Malcolm y Nikhil Benesch.)

source: Other Language Changes
es: Otros cambios de idioma

source: Some smaller changes made to the core Python language are:
es: Algunos cambios más pequeños realizados en el lenguaje central de Python son:

source: A ``global`` or ``nonlocal`` statement must now textually appear before the first use of the affected name in the same scope. Previously this was a :exc:`SyntaxWarning`.
es: Una declaración ``global`` o ``nonlocal`` ahora debe aparecer textualmente antes del primer uso del nombre afectado en el mismo ámbito. Anteriormente, este era un :exc:`SyntaxWarning`.

source: It is now possible to set a :ref:`special method <specialnames>` to ``None`` to indicate that the corresponding operation is not available. For example, if a class sets :meth:`__iter__` to ``None``, the class is not iterable. (Contributed by Andrew Barnert and Ivan Levkivskyi in :issue:`25958`.)
es: Ahora es posible establecer un :ref:`special method <specialnames>` en ``None`` para indicar que la operación correspondiente no está disponible. Por ejemplo, si una clase establece :meth:`__iter__` en ``None``, la clase no es iterable. (Contribuido por Andrew Barnert e Ivan Levkivskyi en :issue:`25958`.)

source: Long sequences of repeated traceback lines are now abbreviated as ``"[Previous line repeated {count} more times]"`` (see :ref:`whatsnew36-traceback` for an example). (Contributed by Emanuel Barry in :issue:`26823`.)
es: Las secuencias largas de líneas de rastreo repetidas ahora se abrevian como ``"[Previous line repeated {count} more times]"`` (consulte :ref:`whatsnew36-traceback` para ver un ejemplo). (Contribución de Emanuel Barry en :issue:`26823`.)

source: Import now raises the new exception :exc:`ModuleNotFoundError` (subclass of :exc:`ImportError`) when it cannot find a module. Code that currently checks for ImportError (in try-except) will still work. (Contributed by Eric Snow in :issue:`15767`.)
es: Importar ahora lanza la nueva excepción :exc:`ModuleNotFoundError` (subclase de :exc:`ImportError`) cuando no puede encontrar un módulo. El código que actualmente busca ImportError (en try-except) seguirá funcionando. (Contribución de Eric Snow en :issue:`15767`.)

source: Class methods relying on zero-argument ``super()`` will now work correctly when called from metaclass methods during class creation. (Contributed by Martin Teichmann in :issue:`23722`.)
es: Los métodos de clase que se basan en ``super()`` de argumento cero ahora funcionarán correctamente cuando se llamen desde métodos de metaclase durante la creación de la clase. (Contribución de Martin Teichmann en :issue:`23722`.)

source: New Modules
es: Nuevos módulos

source: secrets
es: misterios

source: The main purpose of the new :mod:`secrets` module is to provide an obvious way to reliably generate cryptographically strong pseudo-random values suitable for managing secrets, such as account authentication, tokens, and similar.
es: El objetivo principal del nuevo módulo :mod:`secrets` es proporcionar una forma obvia de generar de manera confiable valores pseudoaleatorios criptográficamente fuertes adecuados para administrar secretos, como autenticación de cuentas, tokens y similares.

source: Note that the pseudo-random generators in the :mod:`random` module should *NOT* be used for security purposes. Use :mod:`secrets` on Python 3.6+ and :func:`os.urandom()` on Python 3.5 and earlier.
es: Tenga en cuenta que los generadores pseudoaleatorios en el módulo :mod:`random` deben utilizarse *NOT* por motivos de seguridad. Utilice :mod:`secrets` en Python 3.6+ y :func:`os.urandom()` en Python 3.5 y versiones anteriores.

source: :pep:`506` -- Adding A Secrets Module To The Standard Library
es: :pep:`506`: adición de un módulo de secretos a la biblioteca estándar

source: PEP written and implemented by Steven D'Aprano.
es: PEP escrito e implementado por Steven D'Aprano.

source: Improved Modules
es: Módulos mejorados

source: array
es: formación

source: Exhausted iterators of :class:`array.array` will now stay exhausted even if the iterated array is extended. This is consistent with the behavior of other mutable sequences.
es: Los iteradores agotados de :class:`array.array` ahora permanecerán agotados incluso si se extiende la matriz iterada. Esto es consistente con el comportamiento de otras secuencias mutables.

source: Contributed by Serhiy Storchaka in :issue:`26492`.
es: Contribuido por Serhiy Storchaka en :issue:`26492`.

source: The new :class:`ast.Constant` AST node has been added. It can be used by external AST optimizers for the purposes of constant folding.
es: Se ha agregado el nuevo nodo :class:`ast.Constant` AST. Puede ser utilizado por optimizadores AST externos con el propósito de plegado constante.

source: Contributed by Victor Stinner in :issue:`26146`.
es: Contribuido por Victor Stinner en :issue:`26146`.

source: Starting with Python 3.6 the ``asyncio`` module is no longer provisional and its API is considered stable.
es: A partir de Python 3.6, el módulo ``asyncio`` ya no es provisional y su API se considera estable.

source: Notable changes in the :mod:`asyncio` module since Python 3.5.0 (all backported to 3.5.x due to the provisional status):
es: Cambios notables en el módulo :mod:`asyncio` desde Python 3.5.0 (todos retroportados a 3.5.x debido al estado provisional):

source: The :func:`~asyncio.get_event_loop` function has been changed to always return the currently running loop when called from coroutines and callbacks. (Contributed by Yury Selivanov in :issue:`28613`.)
es: La función :func:`~asyncio.get_event_loop` se ha cambiado para devolver siempre el bucle que se está ejecutando actualmente cuando se llama desde corrutinas y devoluciones de llamada. (Contribuido por Yury Selivanov en :issue:`28613`.)

source: The :func:`~asyncio.ensure_future` function and all functions that use it, such as :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, now accept all kinds of :term:`awaitable objects <awaitable>`. (Contributed by Yury Selivanov.)
es: La función :func:`~asyncio.ensure_future` y todas las funciones que la utilizan, como :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, ahora aceptan todo tipo de :term:`awaitable objects <awaitable>`. (Contribuido por Yury Selivanov.)

source: New :func:`~asyncio.run_coroutine_threadsafe` function to submit coroutines to event loops from other threads. (Contributed by Vincent Michel.)
es: Nueva función :func:`~asyncio.run_coroutine_threadsafe` para enviar corrutinas a bucles de eventos de otros hilos. (Contribución de Vincent Michel.)

source: New :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` method to check if the transport is closing or closed. (Contributed by Yury Selivanov.)
es: Nuevo método :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` para comprobar si el transporte está cerrando o está cerrado. (Contribuido por Yury Selivanov.)

source: The :meth:`loop.create_server() <asyncio.loop.create_server>` method can now accept a list of hosts. (Contributed by Yann Sionneau.)
es: El método :meth:`loop.create_server() <asyncio.loop.create_server>` ahora puede aceptar una lista de hosts. (Contribuido por Yann Sionneau.)
