Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: What's New In Python 3.6
es: Qué hay de nuevo en Python 3.6

source: This article explains the new features in Python 3.6, compared to 3.5. Python 3.6 was released on December 23, 2016. See the `changelog <https://docs.python.org/3.6/whatsnew/changelog.html>`_ for a full list of changes.
es: Este artículo explica las nuevas funciones de Python 3.6, en comparación con 3.5. Python 3.6 se lanzó el 23 de diciembre de 2016. Consulte el `changelog <https://docs.python.org/3.6/whatsnew/changelog.html>`_ para obtener una lista completa de cambios.

source: :pep:`494` - Python 3.6 Release Schedule
es: :pep:`494` - Programa de lanzamiento de Python 3.6

source: Summary -- Release highlights
es: Resumen: aspectos destacados de la versión

source: New syntax features:
es: Nuevas funciones de sintaxis:

source: :ref:`PEP 498 <whatsnew36-pep498>`, formatted string literals.
es: :ref:`PEP 498 <whatsnew36-pep498>`, literales de cadena formateados.

source: :ref:`PEP 515 <whatsnew36-pep515>`, underscores in numeric literals.
es: :ref:`PEP 515 <whatsnew36-pep515>`, guiones bajos en literales numéricos.

source: :ref:`PEP 526 <whatsnew36-pep526>`, syntax for variable annotations.
es: :ref:`PEP 526 <whatsnew36-pep526>`, sintaxis para anotaciones variables.

source: :ref:`PEP 525 <whatsnew36-pep525>`, asynchronous generators.
es: :ref:`PEP 525 <whatsnew36-pep525>`, generadores asincrónicos.

source: :ref:`PEP 530 <whatsnew36-pep530>`: asynchronous comprehensions.
es: :ref:`PEP 530 <whatsnew36-pep530>`: comprensiones asincrónicas.

source: New library modules:
es: Nuevos módulos de biblioteca:

source: CPython implementation improvements:
es: Mejoras en la implementación de CPython:

source: The :ref:`dict <typesmapping>` type has been reimplemented to use a :ref:`more compact representation <whatsnew36-compactdict>` based on `a proposal by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_ and similar to the `PyPy dict implementation`_. This resulted in dictionaries using 20% to 25% less memory when compared to Python 3.5.
es: El tipo :ref:`dict <typesmapping>` se ha vuelto a implementar para utilizar un :ref:`more compact representation <whatsnew36-compactdict>` basado en `a proposal by Raymond Hettinger <https://mail.python.org/pipermail/python-dev/2012-December/123028.html>`_ y similar al `PyPy dict implementation`_. Esto dio como resultado que los diccionarios usaran entre un 20% y un 25% menos de memoria en comparación con Python 3.5.

source: Customization of class creation has been simplified with the :ref:`new protocol <whatsnew36-pep487>`.
es: La personalización de la creación de clases se ha simplificado con el :ref:`new protocol <whatsnew36-pep487>`.

source: The class attribute definition order is :ref:`now preserved <whatsnew36-pep520>`.
es: El orden de definición de atributo de clase es :ref:`now preserved <whatsnew36-pep520>`.

source: The order of elements in ``**kwargs`` now :ref:`corresponds to the order <whatsnew36-pep468>` in which keyword arguments were passed to the function.
es: El orden de los elementos en ``**kwargs`` ahora :ref:`corresponds to the order <whatsnew36-pep468>` en el que se pasaron argumentos de palabras clave a la función.

source: DTrace and SystemTap :ref:`probing support <whatsnew36-tracing>` has been added.
es: Se han agregado DTrace y SystemTap :ref:`probing support <whatsnew36-tracing>`.

source: The new :ref:`PYTHONMALLOC <whatsnew36-pythonmalloc>` environment variable can now be used to debug the interpreter memory allocation and access errors.
es: La nueva variable de entorno :ref:`PYTHONMALLOC <whatsnew36-pythonmalloc>` ahora se puede utilizar para depurar la asignación de memoria del intérprete y los errores de acceso.

source: Significant improvements in the standard library:
es: Mejoras significativas en la biblioteca estándar:

source: The :mod:`asyncio` module has received new features, significant usability and performance improvements, and a fair amount of bug fixes. Starting with Python 3.6 the ``asyncio`` module is no longer provisional and its API is considered stable.
es: El módulo :mod:`asyncio` ha recibido nuevas funciones, mejoras significativas de rendimiento y usabilidad, y una buena cantidad de correcciones de errores. A partir de Python 3.6, el módulo ``asyncio`` ya no es provisional y su API se considera estable.

source: A new :ref:`file system path protocol <whatsnew36-pep519>` has been implemented to support :term:`path-like objects <path-like object>`. All standard library functions operating on paths have been updated to work with the new protocol.
es: Se ha implementado un nuevo :ref:`file system path protocol <whatsnew36-pep519>` para admitir :term:`path-like objects <path-like object>`. Todas las funciones de biblioteca estándar que operan en rutas se han actualizado para trabajar con el nuevo protocolo.

source: The :mod:`datetime` module has gained support for :ref:`Local Time Disambiguation <whatsnew36-pep495>`.
es: El módulo :mod:`datetime` ha ganado soporte para :ref:`Local Time Disambiguation <whatsnew36-pep495>`.

source: The :mod:`typing` module received a number of :ref:`improvements <whatsnew36-typing>`.
es: El módulo :mod:`typing` recibió varios :ref:`improvements <whatsnew36-typing>`.

source: The :mod:`tracemalloc` module has been significantly reworked and is now used to provide better output for :exc:`ResourceWarning` as well as provide better diagnostics for memory allocation errors. See the :ref:`PYTHONMALLOC section <whatsnew36-pythonmalloc>` for more information.
es: El módulo :mod:`tracemalloc` se ha rediseñado significativamente y ahora se utiliza para proporcionar una mejor salida para :exc:`ResourceWarning`, así como para proporcionar un mejor diagnóstico de errores de asignación de memoria. Consulte :ref:`PYTHONMALLOC section <whatsnew36-pythonmalloc>` para obtener más información.

source: Security improvements:
es: Mejoras de seguridad:

source: The new :mod:`secrets` module has been added to simplify the generation of cryptographically strong pseudo-random numbers suitable for managing secrets such as account authentication, tokens, and similar.
es: Se ha agregado el nuevo módulo :mod:`secrets` para simplificar la generación de números pseudoaleatorios criptográficamente fuertes adecuados para administrar secretos como autenticación de cuentas, tokens y similares.

source: On Linux, :func:`os.urandom` now blocks until the system urandom entropy pool is initialized to increase the security. See the :pep:`524` for the rationale.
es: En Linux, :func:`os.urandom` ahora se bloquea hasta que se inicializa el grupo de entropía aleatoria del sistema para aumentar la seguridad. Consulte el :pep:`524` para conocer la justificación.

source: The :mod:`hashlib` and :mod:`ssl` modules now support OpenSSL 1.1.0.
es: Los módulos :mod:`hashlib` y :mod:`ssl` ahora son compatibles con OpenSSL 1.1.0.

source: The default settings and feature set of the :mod:`ssl` module have been improved.
es: Se han mejorado la configuración predeterminada y el conjunto de funciones del módulo :mod:`ssl`.

source: The :mod:`hashlib` module received support for the BLAKE2, SHA-3 and SHAKE hash algorithms and the :func:`~hashlib.scrypt` key derivation function.
es: El módulo :mod:`hashlib` recibió soporte para los algoritmos hash BLAKE2, SHA-3 y SHAKE y la función de derivación de claves :func:`~hashlib.scrypt`.

source: Windows improvements:
es: Mejoras de Windows:

source: :ref:`PEP 528 <whatsnew36-pep528>` and :ref:`PEP 529 <whatsnew36-pep529>`, Windows filesystem and console encoding changed to UTF-8.
es: :ref:`PEP 528 <whatsnew36-pep528>` y :ref:`PEP 529 <whatsnew36-pep529>`, el sistema de archivos de Windows y la codificación de la consola cambiaron a UTF-8.

source: The ``py.exe`` launcher, when used interactively, no longer prefers Python 2 over Python 3 when the user doesn't specify a version (via command line arguments or a config file). Handling of shebang lines remains unchanged - "python" refers to Python 2 in that case.
es: El lanzador ``py.exe``, cuando se usa de forma interactiva, ya no prefiere Python 2 sobre Python 3 cuando el usuario no especifica una versión (a través de argumentos de línea de comando o un archivo de configuración). El manejo de las líneas shebang permanece sin cambios - "python" se refiere a Python 2 en ese caso.

source: ``python.exe`` and ``pythonw.exe`` have been marked as long-path aware, which means that the 260 character path limit may no longer apply. See :ref:`removing the MAX_PATH limitation <max-path>` for details.
es: ``python.exe`` y ``pythonw.exe`` se han marcado como con reconocimiento de ruta larga, lo que significa que es posible que ya no se aplique el límite de ruta de 260 caracteres. Consulte :ref:`removing the MAX_PATH limitation <max-path>` para obtener más detalles.

source: A ``._pth`` file can be added to force isolated mode and fully specify all search paths to avoid registry and environment lookup. See :ref:`the documentation <windows_finding_modules>` for more information.
es: Se puede agregar un archivo ``._pth`` para forzar el modo aislado y especificar completamente todas las rutas de búsqueda para evitar búsquedas en el registro y el entorno. Consulte :ref:`la documentación <windows_finding_modules>` para obtener más información.

source: A ``python36.zip`` file now works as a landmark to infer :envvar:`PYTHONHOME`. See :ref:`the documentation <windows_finding_modules>` for more information.
es: Un archivo ``python36.zip`` ahora funciona como un punto de referencia para inferir :envvar:`PYTHONHOME`. Consulte :ref:`la documentación <windows_finding_modules>` para obtener más información.

source: New Features
es: Nuevas características

source: PEP 498: Formatted string literals
es: PEP 498: Literales de cadena formateados

source: :pep:`498` introduces a new kind of string literals: *f-strings*, or :ref:`formatted string literals <f-strings>`.
es: :pep:`498` introduce un nuevo tipo de cadenas literales: *f-strings* o :ref:`formatted string literals <f-strings>`.

source: Formatted string literals are prefixed with ``'f'`` and are similar to the format strings accepted by :meth:`str.format`. They contain replacement fields surrounded by curly braces. The replacement fields are expressions, which are evaluated at run time, and then formatted using the :func:`format` protocol::
es: Los literales de cadena formateados tienen el prefijo ``'f'`` y son similares a las cadenas de formato aceptadas por :meth:`str.format`. Contienen campos de reemplazo rodeados por llaves. Los campos de reemplazo son expresiones, que se evalúan en tiempo de ejecución y luego se formatean usando el protocolo :func:`format`:

source: :pep:`498` -- Literal String Interpolation.
es: :pep:`498` - Interpolación de cadenas literal.

source: PEP written and implemented by Eric V. Smith.
es: PEP escrito e implementado por Eric V. Smith.

source: PEP 526: Syntax for variable annotations
es: PEP 526: Sintaxis para anotaciones de variables

source: :pep:`484` introduced the standard for type annotations of function parameters, a.k.a. type hints. This PEP adds syntax to Python for annotating the types of variables including class variables and instance variables::
es: :pep:`484` introdujo el estándar para anotaciones de tipo de parámetros de función, también conocido como sugerencias de tipo. Este PEP agrega sintaxis a Python para anotar los tipos de variables, incluidas las variables de clase y las variables de instancia:

source: Just as for function annotations, the Python interpreter does not attach any particular meaning to variable annotations and only stores them in the ``__annotations__`` attribute of a class or module.
es: Al igual que para las anotaciones de funciones, el intérprete de Python no asigna ningún significado particular a las anotaciones de variables y solo las almacena en el atributo ``__annotations__`` de una clase o módulo.

source: In contrast to variable declarations in statically typed languages, the goal of annotation syntax is to provide an easy way to specify structured type metadata for third party tools and libraries via the abstract syntax tree and the ``__annotations__`` attribute.
es: A diferencia de las declaraciones de variables en lenguajes tipados estáticamente, el objetivo de la sintaxis de anotación es proporcionar una manera fácil de especificar metadatos de tipo estructurado para herramientas y bibliotecas de terceros a través del árbol de sintaxis abstracta y el atributo ``__annotations__``.

source: :pep:`526` -- Syntax for variable annotations.
es: :pep:`526`: sintaxis para anotaciones de variables.

source: PEP written by Ryan Gonzalez, Philip House, Ivan Levkivskyi, Lisa Roach, and Guido van Rossum. Implemented by Ivan Levkivskyi.
es: PEP escrito por Ryan Gonzalez, Philip House, Ivan Levkivskyi, Lisa Roach y Guido van Rossum. Implementado por Ivan Levkivskyi.

source: PEP 515: Underscores in Numeric Literals
es: PEP 515: subrayados en literales numéricos

source: :pep:`515` adds the ability to use underscores in numeric literals for improved readability. For example::
es: :pep:`515` agrega la capacidad de usar guiones bajos en literales numéricos para mejorar la legibilidad. Por ejemplo::

source: Single underscores are allowed between digits and after any base specifier. Leading, trailing, or multiple underscores in a row are not allowed.
es: Se permiten guiones bajos simples entre dígitos y después de cualquier especificador de base. No se permiten guiones bajos al principio, al final o múltiples en una fila.

source: The :ref:`string formatting <formatspec>` language also now has support for the ``'_'`` option to signal the use of an underscore for a thousands separator for floating point presentation types and for integer presentation type ``'d'``. For integer presentation types ``'b'``, ``'o'``, ``'x'``, and ``'X'``, underscores will be inserted every 4 digits::
es: El lenguaje :ref:`string formatting <formatspec>` ahora también tiene soporte para la opción ``'_'`` para señalar el uso de un guión bajo para un separador de miles para los tipos de presentación de punto flotante y para el tipo de presentación de enteros ``'d'``. Para los tipos de presentación de enteros ``'b'``, ``'o'``, ``'x'`` y ``'X'``, se insertarán guiones bajos cada 4 dígitos:

source: :pep:`515` -- Underscores in Numeric Literals
es: :pep:`515` - Guiones bajos en literales numéricos

source: PEP written by Georg Brandl and Serhiy Storchaka.
es: PEP escrito por Georg Brandl y Serhiy Storchaka.

source: PEP 525: Asynchronous Generators
es: PEP 525: Generadores asíncronos

source: :pep:`492` introduced support for native coroutines and ``async`` / ``await`` syntax to Python 3.5. A notable limitation of the Python 3.5 implementation is that it was not possible to use ``await`` and ``yield`` in the same function body. In Python 3.6 this restriction has been lifted, making it possible to define *asynchronous generators*::
es: :pep:`492` introdujo soporte para corrutinas nativas y sintaxis ``async`` / ``await`` para Python 3.5. Una limitación notable de la implementación de Python 3.5 es que no fue posible usar ``await`` y ``yield`` en el mismo cuerpo de función. En Python 3.6 se eliminó esta restricción, lo que permite definir *asynchronous generators* ::

source: The new syntax allows for faster and more concise code.
es: La nueva sintaxis permite un código más rápido y conciso.

source: :pep:`525` -- Asynchronous Generators
es: :pep:`525` - Generadores asincrónicos

source: PEP written and implemented by Yury Selivanov.
es: PEP escrito e implementado por Yury Selivanov.

source: PEP 530: Asynchronous Comprehensions
es: PEP 530: Comprensiones asincrónicas

source: :pep:`530` adds support for using ``async for`` in list, set, dict comprehensions and generator expressions::
es: :pep:`530` agrega soporte para usar ``async for`` en listas, conjuntos, dict comprensiones y expresiones generadoras:

source: Additionally, ``await`` expressions are supported in all kinds of comprehensions::
es: Además, las expresiones ``await`` son compatibles con todo tipo de comprensiones:

source: :pep:`530` -- Asynchronous Comprehensions
es: :pep:`530` - Comprensiones asincrónicas

source: PEP 487: Simpler customization of class creation
es: PEP 487: personalización más sencilla de la creación de clases

source: It is now possible to customize subclass creation without using a metaclass. The new ``__init_subclass__`` classmethod will be called on the base class whenever a new subclass is created::
es: Ahora es posible personalizar la creación de subclases sin utilizar una metaclase. El nuevo método de clase ``__init_subclass__`` se llamará en la clase base siempre que se cree una nueva subclase:

source: In order to allow zero-argument :func:`super` calls to work correctly from :meth:`~object.__init_subclass__` implementations, custom metaclasses must ensure that the new ``__classcell__`` namespace entry is propagated to ``type.__new__`` (as described in :ref:`class-object-creation`).
es: Para permitir que las llamadas :func:`super` sin argumentos funcionen correctamente desde las implementaciones :meth:`~object.__init_subclass__`, las metaclases personalizadas deben garantizar que la nueva entrada del espacio de nombres ``__classcell__`` se propague a ``type.__new__`` (como se describe en :ref:`class-object-creation`).

source: :pep:`487` -- Simpler customization of class creation
es: :pep:`487`: personalización más sencilla de la creación de clases

source: PEP written and implemented by Martin Teichmann.
es: PEP escrito e implementado por Martin Teichmann.

source: PEP 487: Descriptor Protocol Enhancements
es: PEP 487: Mejoras en el protocolo descriptor

source: :pep:`487` extends the descriptor protocol to include the new optional :meth:`~object.__set_name__` method. Whenever a new class is defined, the new method will be called on all descriptors included in the definition, providing them with a reference to the class being defined and the name given to the descriptor within the class namespace. In other words, instances of descriptors can now know the attribute name of the descriptor in the owner class::
es: :pep:`487` amplía el protocolo descriptor para incluir el nuevo método opcional :meth:`~object.__set_name__`. Siempre que se defina una nueva clase, se llamará al nuevo método en todos los descriptores incluidos en la definición, proporcionándoles una referencia a la clase que se está definiendo y el nombre dado al descriptor dentro del espacio de nombres de la clase. En otras palabras, las instancias de descriptores ahora pueden conocer el nombre de atributo del descriptor en la clase propietaria:

source: PEP 519: Adding a file system path protocol
es: PEP 519: Agregar un protocolo de ruta del sistema de archivos

source: File system paths have historically been represented as :class:`str` or :class:`bytes` objects. This has led to people who write code which operate on file system paths to assume that such objects are only one of those two types (an :class:`int` representing a file descriptor does not count as that is not a file path). Unfortunately that assumption prevents alternative object representations of file system paths like :mod:`pathlib` from working with pre-existing code, including Python's standard library.
es: Históricamente, las rutas del sistema de archivos se han representado como objetos :class:`str` o :class:`bytes`. Esto ha llevado a las personas que escriben códigos que operan en las rutas del sistema de archivos a asumir que dichos objetos son solo uno de esos dos tipos (un :class:`int` que representa un descriptor de archivo no cuenta, ya que no es una ruta de archivo). Desafortunadamente, esa suposición evita que las representaciones de objetos alternativos de las rutas del sistema de archivos como :mod:`pathlib` funcionen con código preexistente, incluida la biblioteca estándar de Python.

source: To fix this situation, a new interface represented by :class:`os.PathLike` has been defined. By implementing the :meth:`~os.PathLike.__fspath__` method, an object signals that it represents a path. An object can then provide a low-level representation of a file system path as a :class:`str` or :class:`bytes` object. This means an object is considered :term:`path-like <path-like object>` if it implements :class:`os.PathLike` or is a :class:`str` or :class:`bytes` object which represents a file system path. Code can use :func:`os.fspath`, :func:`os.fsdecode`, or :func:`os.fsencode` to explicitly get a :class:`str` and/or :class:`bytes` representation of a path-like object.
es: Para solucionar esta situación, se ha definido una nueva interfaz representada por :class:`os.PathLike`. Al implementar el método :meth:`~os.PathLike.__fspath__`, un objeto indica que representa una ruta. Entonces, un objeto puede proporcionar una representación de bajo nivel de una ruta del sistema de archivos como un objeto :class:`str` o :class:`bytes`. Esto significa que un objeto se considera :term:`path-like <path-like object>` si implementa :class:`os.PathLike` o es un objeto :class:`str` o :class:`bytes` que representa una ruta del sistema de archivos. El código puede usar :func:`os.fspath`, :func:`os.fsdecode` o :func:`os.fsencode` para obtener explícitamente una representación :class:`str` y / o :class:`bytes` de un objeto similar a una ruta.

source: The built-in :func:`open` function has been updated to accept :class:`os.PathLike` objects, as have all relevant functions in the :mod:`os` and :mod:`os.path` modules, and most other functions and classes in the standard library. The :class:`os.DirEntry` class and relevant classes in :mod:`pathlib` have also been updated to implement :class:`os.PathLike`.
es: La función :func:`open` incorporada se ha actualizado para aceptar objetos :class:`os.PathLike`, al igual que todas las funciones relevantes en los módulos :mod:`os` y :mod:`os.path`, y la mayoría de las otras funciones y clases en la biblioteca estándar. La clase :class:`os.DirEntry` y las clases relevantes en :mod:`pathlib` también se han actualizado para implementar :class:`os.PathLike`.

source: The hope is that updating the fundamental functions for operating on file system paths will lead to third-party code to implicitly support all :term:`path-like objects <path-like object>` without any code changes, or at least very minimal ones (e.g. calling :func:`os.fspath` at the beginning of code before operating on a path-like object).
es: La esperanza es que la actualización de las funciones fundamentales para operar en las rutas del sistema de archivos conducirá a un código de terceros para admitir implícitamente todos los :term:`path-like objects <path-like object>` sin ningún cambio de código, o al menos muy mínimos (por ejemplo, llamar a :func:`os.fspath` al comienzo del código antes de operar en un objeto similar a una ruta).

source: Here are some examples of how the new interface allows for :class:`pathlib.Path` to be used more easily and transparently with pre-existing code::
es: A continuación, se muestran algunos ejemplos de cómo la nueva interfaz permite que :class:`pathlib.Path` se utilice de manera más fácil y transparente con código preexistente:

source: (Implemented by Brett Cannon, Ethan Furman, Dusty Phillips, and Jelle Zijlstra.)
es: (Implementado por Brett Cannon, Ethan Furman, Dusty Phillips y Jelle Zijlstra).

source: :pep:`519` -- Adding a file system path protocol
es: :pep:`519`: adición de un protocolo de ruta del sistema de archivos

source: PEP written by Brett Cannon and Koos Zevenhoven.
es: PEP escrito por Brett Cannon y Koos Zevenhoven.

source: PEP 495: Local Time Disambiguation
es: PEP 495: desambiguación de la hora local
