Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: The *decode_data* argument for the :class:`smtpd.SMTPChannel` and :class:`smtpd.SMTPServer` constructors is now ``False`` by default. This means that the argument passed to :meth:`~smtpd.SMTPServer.process_message` is now a bytes object by default, and ``process_message()`` will be passed keyword arguments. Code that has already been updated in accordance with the deprecation warning generated by 3.5 will not be affected.
es: El argumento *decode_data* para los constructores :class:`smtpd.SMTPChannel` y :class:`smtpd.SMTPServer` ahora es ``False`` por defecto. Esto significa que el argumento pasado a :meth:`~smtpd.SMTPServer.process_message` ahora es un objeto de bytes por defecto, y ``process_message()`` se pasarán argumentos de palabra clave. El código que ya se haya actualizado de acuerdo con la advertencia de obsolescencia generada por 3.5 no se verá afectado.

source: All optional arguments of the :func:`~json.dump`, :func:`~json.dumps`, :func:`~json.load` and :func:`~json.loads` functions and :class:`~json.JSONEncoder` and :class:`~json.JSONDecoder` class constructors in the :mod:`json` module are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`18726`.)
es: Todos los argumentos opcionales de las funciones :func:`~json.dump`, :func:`~json.dumps`, :func:`~json.load` y :func:`~json.loads` y los constructores de clase :class:`~json.JSONEncoder` y :class:`~json.JSONDecoder` en el módulo :mod:`json` ahora son :ref:`keyword-only <keyword-only_parameter>`. (Contribuido por Serhiy Storchaka en :issue:`18726`.)

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
es: Es posible que las subclases de :class:`type` que no anulan ``type.__new__`` ya no utilicen la forma de un argumento para obtener el tipo de un objeto.

source: As part of :pep:`487`, the handling of keyword arguments passed to :class:`type` (other than the metaclass hint, ``metaclass``) is now consistently delegated to :meth:`object.__init_subclass__`. This means that :meth:`type.__new__` and :meth:`type.__init__` both now accept arbitrary keyword arguments, but :meth:`object.__init_subclass__` (which is called from :meth:`type.__new__`) will reject them by default. Custom metaclasses accepting additional keyword arguments will need to adjust their calls to :meth:`type.__new__` (whether direct or via :class:`super`) accordingly.
es: Como parte de :pep:`487`, el manejo de argumentos de palabras clave pasados a :class:`type` (aparte de la sugerencia de metaclase, ``metaclass``) ahora se delega consistentemente en :meth:`object.__init_subclass__`. Esto significa que :meth:`type.__new__` y :meth:`type.__init__` ahora aceptan argumentos de palabras clave arbitrarias, pero :meth:`object.__init_subclass__` (que se llama desde :meth:`type.__new__`) los rechazará de forma predeterminada. Las metaclases personalizadas que acepten argumentos de palabras clave adicionales deberán ajustar sus llamadas a :meth:`type.__new__` (ya sea directa o mediante :class:`super`) en consecuencia.

source: This behavior has also been backported to earlier Python versions by Setuptools 26.0.0.
es: Este comportamiento también ha sido actualizado a versiones anteriores de Python por Setuptools 26.0.0.

source: In the :mod:`urllib.request` module and the :meth:`http.client.HTTPConnection.request` method, if no Content-Length header field has been specified and the request body is a file object, it is now sent with HTTP 1.1 chunked encoding. If a file object has to be sent to a HTTP 1.0 server, the Content-Length value now has to be specified by the caller. (Contributed by Demian Brecht and Rolf Krahl with tweaks from Martin Panter in :issue:`12319`.)
es: En el módulo :mod:`urllib.request` y el método :meth:`http.client.HTTPConnection.request`, si no se ha especificado ningún campo de encabezado Content-Length y el cuerpo de la solicitud es un objeto de archivo, ahora se envía con codificación fragmentada HTTP 1.1. Si un objeto de archivo debe enviarse a un servidor HTTP 1.0, la persona que llama ahora debe especificar el valor de Longitud de contenido. (Contribuido por Demian Brecht y Rolf Krahl con ajustes de Martin Panter en :issue:`12319`.)

source: The :class:`~csv.DictReader` now returns rows of type :class:`~collections.OrderedDict`. (Contributed by Steve Holden in :issue:`27842`.)
es: El :class:`~csv.DictReader` ahora devuelve filas de tipo :class:`~collections.OrderedDict`. (Contribuido por Steve Holden en :issue:`27842`.)

source: The :const:`crypt.METHOD_CRYPT` will no longer be added to ``crypt.methods`` if unsupported by the platform. (Contributed by Victor Stinner in :issue:`25287`.)
es: El :const:`crypt.METHOD_CRYPT` ya no se agregará a ``crypt.methods`` si la plataforma no lo admite. (Contribuido por Victor Stinner en :issue:`25287`.)

source: On Linux, :func:`ctypes.util.find_library` now looks in ``LD_LIBRARY_PATH`` for shared libraries. (Contributed by Vinay Sajip in :issue:`9998`.)
es: En Linux, :func:`ctypes.util.find_library` ahora busca bibliotecas compartidas en ``LD_LIBRARY_PATH``. (Contribuido por Vinay Sajip en :issue:`9998`.)

source: The :class:`imaplib.IMAP4` class now handles flags containing the ``']'`` character in messages sent from the server to improve real-world compatibility. (Contributed by Lita Cho in :issue:`21815`.)
es: La clase :class:`imaplib.IMAP4` ahora maneja banderas que contienen el carácter ``']'`` en mensajes enviados desde el servidor para mejorar la compatibilidad en el mundo real. (Contribuido por Lita Cho en :issue:`21815`.)

source: The :func:`mmap.write() <mmap.write>` function now returns the number of bytes written like other write methods. (Contributed by Jakub Stasiak in :issue:`26335`.)
es: La función :func:`mmap.write() <mmap.write>` ahora devuelve el número de bytes escritos como otros métodos de escritura. (Contribuido por Jakub Stasiak en :issue:`26335`.)

source: The :func:`pkgutil.iter_modules` and :func:`pkgutil.walk_packages` functions now return :class:`~pkgutil.ModuleInfo` named tuples. (Contributed by Ramchandra Apte in :issue:`17211`.)
es: Las funciones :func:`pkgutil.iter_modules` y :func:`pkgutil.walk_packages` ahora devuelven tuplas con nombre :class:`~pkgutil.ModuleInfo`. (Contribuido por Ramchandra Apte en :issue:`17211`.)

source: :func:`re.sub` now raises an error for invalid numerical group references in replacement templates even if the pattern is not found in the string. The error message for invalid group references now includes the group index and the position of the reference. (Contributed by SilentGhost, Serhiy Storchaka in :issue:`25953`.)
es: :func:`re.sub` ahora lanza un error para referencias de grupos numéricos no válidos en plantillas de reemplazo, incluso si el patrón no se encuentra en la cadena. El mensaje de error para referencias de grupo no válidas ahora incluye el índice de grupo y la posición de la referencia. (Contribuido por SilentGhost, Serhiy Storchaka en :issue:`25953`.)

source: :class:`zipfile.ZipFile` will now raise :exc:`NotImplementedError` for unrecognized compression values. Previously a plain :exc:`RuntimeError` was raised. Additionally, calling :class:`~zipfile.ZipFile` methods on a closed ZipFile or calling the :meth:`~zipfile.ZipFile.write` method on a ZipFile created with mode ``'r'`` will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised in those scenarios.
es: :class:`zipfile.ZipFile` ahora lanzará :exc:`NotImplementedError` para valores de compresión no reconocidos. Anteriormente se planteó un :exc:`RuntimeError` simple. Además, llamar a los métodos :class:`~zipfile.ZipFile` en un ZipFile cerrado o llamar al método :meth:`~zipfile.ZipFile.write` en un ZipFile creado con el modo ``'r'`` lanzará un :exc:`ValueError`. Anteriormente, se planteó un :exc:`RuntimeError` en esos escenarios.

source: when custom metaclasses are combined with zero-argument :func:`super` or direct references from methods to the implicit ``__class__`` closure variable, the implicit ``__classcell__`` namespace entry must now be passed up to ``type.__new__`` for initialisation. Failing to do so will result in a :exc:`DeprecationWarning` in Python 3.6 and a :exc:`RuntimeError` in Python 3.8.
es: cuando las metaclases personalizadas se combinan con :func:`super` de argumento cero o referencias directas de métodos a la variable de cierre ``__class__`` implícita, la entrada de espacio de nombres ``__classcell__`` implícita ahora debe pasarse a ``type.__new__`` para la inicialización. No hacerlo resultará en un :exc:`DeprecationWarning` en Python 3.6 y un :exc:`RuntimeError` en Python 3.8.

source: With the introduction of :exc:`ModuleNotFoundError`, import system consumers may start expecting import system replacements to raise that more specific exception when appropriate, rather than the less-specific :exc:`ImportError`. To provide future compatibility with such consumers, implementors of alternative import systems that completely replace :func:`__import__` will need to update their implementations to raise the new subclass when a module can't be found at all. Implementors of compliant plugins to the default import system shouldn't need to make any changes, as the default import system will raise the new subclass when appropriate.
es: Con la introducción de :exc:`ModuleNotFoundError`, los consumidores del sistema de importación pueden comenzar a esperar que los reemplazos del sistema de importación generen esa excepción más específica cuando corresponda, en lugar de que el :exc:`ImportError`. Para proveer compatibilidad futura con dichos consumidores, los implementadores de un sistema alternativo de importación que completamente reemplacen :func:`__import__` necesitarán actualizar su implementación para lanzar la nueva subclase cundo un módulo no puede ser encontrado.. Los implementadores de complementos compatibles con el sistema de importación predeterminado no deberían necesitar realizar ningún cambio, ya que el sistema de importación predeterminado lanzará la nueva subclase cuando sea apropiado.

source: Changes in the C API
es: Cambios en la API de C

source: The :c:func:`PyMem_Malloc` allocator family now uses the :ref:`pymalloc allocator <pymalloc>` rather than the system :c:func:`malloc`. Applications calling :c:func:`PyMem_Malloc` without holding the GIL can now crash. Set the :envvar:`PYTHONMALLOC` environment variable to ``debug`` to validate the usage of memory allocators in your application. See :issue:`26249`.
es: La familia de asignadores :c:func:`PyMem_Malloc` ahora usa el :ref:`pymalloc allocator <pymalloc>` en lugar del sistema :c:func:`malloc`. Las aplicaciones que llaman a :c:func:`PyMem_Malloc` sin sostener el GIL ahora pueden fallar. Establezca la variable de entorno :envvar:`PYTHONMALLOC` en ``debug`` para validar el uso de asignadores de memoria en su aplicación. Ver :issue:`26249`.

source: :c:func:`Py_Exit` (and the main interpreter) now override the exit status with 120 if flushing buffered data failed. See :issue:`5319`.
es: :c:func:`Py_Exit` (y el intérprete principal) ahora anula el estado de salida con 120 si fallaron los datos almacenados en el búfer. Ver :issue:`5319`.

source: CPython bytecode changes
es: Cambios en el código de bytes de CPython

source: There have been several major changes to the :term:`bytecode` in Python 3.6.
es: Ha habido varios cambios importantes en el :term:`bytecode` en Python 3.6.

source: The Python interpreter now uses a 16-bit wordcode instead of bytecode. (Contributed by Demur Rumed with input and reviews from Serhiy Storchaka and Victor Stinner in :issue:`26647` and :issue:`28050`.)
es: El intérprete de Python ahora usa un código de palabra de 16 bits en lugar de un código de bytes. (Contribuido por Demur Rumed con aportes y reseñas de Serhiy Storchaka y Victor Stinner en :issue:`26647` y :issue:`28050`.)

source: The new :opcode:`FORMAT_VALUE` and :opcode:`BUILD_STRING` opcodes as part of the :ref:`formatted string literal <whatsnew36-pep498>` implementation. (Contributed by Eric Smith in :issue:`25483` and Serhiy Storchaka in :issue:`27078`.)
es: Los nuevos códigos de operación :opcode:`FORMAT_VALUE` y :opcode:`BUILD_STRING` como parte de la implementación de :ref:`formatted string literal <whatsnew36-pep498>`. (Contribuido por Eric Smith en :issue:`25483` y Serhiy Storchaka en :issue:`27078`.)

source: The new :opcode:`BUILD_CONST_KEY_MAP` opcode to optimize the creation of dictionaries with constant keys. (Contributed by Serhiy Storchaka in :issue:`27140`.)
es: El nuevo :opcode:`BUILD_CONST_KEY_MAP` opcode para optimizar la creación de diccionarios con claves constantes. (Contribuido por Serhiy Storchaka en :issue:`27140`.)

source: The function call opcodes have been heavily reworked for better performance and simpler implementation. The :opcode:`MAKE_FUNCTION`, :opcode:`CALL_FUNCTION`, :opcode:`CALL_FUNCTION_KW` and :opcode:`BUILD_MAP_UNPACK_WITH_CALL` opcodes have been modified, the new :opcode:`CALL_FUNCTION_EX` and :opcode:`BUILD_TUPLE_UNPACK_WITH_CALL` have been added, and ``CALL_FUNCTION_VAR``, ``CALL_FUNCTION_VAR_KW`` and ``MAKE_CLOSURE`` opcodes have been removed. (Contributed by Demur Rumed in :issue:`27095`, and Serhiy Storchaka in :issue:`27213`, :issue:`28257`.)
es: Los códigos de operación de llamada de función se han rediseñado en gran medida para un mejor rendimiento y una implementación más simple. Se han modificado los códigos de operación :opcode:`MAKE_FUNCTION`, :opcode:`CALL_FUNCTION`, :opcode:`CALL_FUNCTION_KW` y :opcode:`BUILD_MAP_UNPACK_WITH_CALL`, se han agregado los nuevos códigos de operación :opcode:`CALL_FUNCTION_EX` y :opcode:`BUILD_TUPLE_UNPACK_WITH_CALL` y se han eliminado los códigos de operación ``CALL_FUNCTION_VAR``, ``CALL_FUNCTION_VAR_KW`` y ``MAKE_CLOSURE``. (Contribuido por Demur Rumed en :issue:`27095` y Serhiy Storchaka en :issue:`27213`, :issue:`28257`.)

source: The new :opcode:`SETUP_ANNOTATIONS` and :opcode:`STORE_ANNOTATION` opcodes have been added to support the new :term:`variable annotation` syntax. (Contributed by Ivan Levkivskyi in :issue:`27985`.)
es: Se han agregado los nuevos códigos de operación :opcode:`SETUP_ANNOTATIONS` y :opcode:`STORE_ANNOTATION` para admitir la nueva sintaxis :term:`variable annotation`. (Contribuido por Ivan Levkivskyi en :issue:`27985`.)

source: Notable changes in Python 3.6.2
es: Cambios notables en Python 3.6.2

source: New ``make regen-all`` build target
es: Nuevo objetivo de compilación ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
es: Para simplificar la compilación cruzada y garantizar que CPython se pueda compilar de manera confiable sin requerir que una versión existente de Python ya esté disponible, el sistema de compilación basado en autotools ya no intenta volver a compilar implícitamente los archivos generados en función de los tiempos de modificación del archivo.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
es: En su lugar, se ha agregado un nuevo comando ``make regen-all`` para forzar la regeneración de estos archivos cuando se desee (por ejemplo, después de que ya se haya creado una versión inicial de Python basada en las versiones pregeneradas).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
es: También se definen objetivos de regeneración más selectivos; consulte: fuente: `Makefile.pre.in` para obtener más detalles.

source: (Contributed by Victor Stinner in :issue:`23404`.)
es: (Contribuido por Victor Stinner en :issue:`23404`.)

source: Removal of ``make touch`` build target
es: Eliminación del objetivo de compilación ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
es: Se ha eliminado el objetivo de compilación ``make touch`` que se utilizaba anteriormente para solicitar la regeneración implícita de archivos generados mediante la actualización de sus tiempos de modificación.

source: It has been replaced by the new ``make regen-all`` target.
es: Ha sido reemplazado por el nuevo objetivo ``make regen-all``.

source: Notable changes in Python 3.6.4
es: Cambios notables en Python 3.6.4

source: The ``PyExc_RecursionErrorInst`` singleton that was part of the public API has been removed as its members being never cleared may cause a segfault during finalization of the interpreter. (Contributed by Xavier de Gaye in :issue:`22898` and :issue:`30697`.)
es: El singleton ``PyExc_RecursionErrorInst`` que formaba parte de la API pública se ha eliminado ya que sus miembros nunca borrados pueden causar una falla de segmentación durante la finalización del intérprete. (Contribuido por Xavier de Gaye en :issue:`22898` y :issue:`30697`.)

source: Notable changes in Python 3.6.5
es: Cambios notables en Python 3.6.5

source: The :func:`locale.localeconv` function now sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases. (Contributed by Victor Stinner in :issue:`31900`.)
es: La función :func:`locale.localeconv` ahora establece temporalmente la configuración regional ``LC_CTYPE`` en la configuración regional ``LC_NUMERIC`` en algunos casos. (Contribuido por Victor Stinner en :issue:`31900`.)

source: Notable changes in Python 3.6.7
es: Cambios notables en Python 3.6.7

source: In 3.6.7 the :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
es: En 3.6.7, el módulo :mod:`tokenize` ahora emite implícitamente un token ``NEWLINE`` cuando se le proporciona una entrada que no tiene una nueva línea al final. Este comportamiento ahora coincide con lo que hace el tokenizador C internamente. (Contribuido por Ammar Askar en :issue:`33899`.)

source: Notable changes in Python 3.6.10
es: Cambios notables en Python 3.6.10

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
es: Debido a importantes problemas de seguridad, el parámetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` ya no es compatible. Esto se debe al comportamiento de la opción de socket ``SO_REUSEADDR`` en UDP. Para obtener más detalles, consulte la documentación de ``loop.create_datagram_endpoint()``. (Contribuido por Kyle Stanley, Antoine Pitrou y Yury Selivanov en :issue:`37228`.)

source: Notable changes in Python 3.6.13
es: Cambios notables en Python 3.6.13

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
es: Las versiones anteriores de Python permitían el uso de ``;`` y ``&`` como separadores de parámetros de consulta en :func:`urllib.parse.parse_qs` y :func:`urllib.parse.parse_qsl`. Debido a problemas de seguridad y para cumplir con las recomendaciones más recientes del W3C, esto se ha cambiado para permitir solo una clave separadora, con ``&`` como predeterminado. Este cambio también afecta a :func:`cgi.parse` y :func:`cgi.parse_multipart` ya que utilizan las funciones afectadas internamente. Para obtener más detalles, consulte su documentación respectiva. (Contribuido por Adam Goldschmidt, Senthil Kumaran y Ken Jin en :issue:`42967`.)
