Repository: python/python-docs-es
Catalog: whatsnew/3.6.po
Languages: es

source: :class:`~telnetlib.Telnet` is now a context manager (contributed by Stéphane Wirtel in :issue:`25485`).
es: :class:`~telnetlib.Telnet` es ahora un administrador de contexto (contribución de Stéphane Wirtel en :issue:`25485`).

source: time
es: tiempo

source: The :class:`~time.struct_time` attributes :attr:`tm_gmtoff` and :attr:`tm_zone` are now available on all platforms.
es: Los atributos :class:`~time.struct_time` :attr:`tm_gmtoff` y :attr:`tm_zone` ahora están disponibles en todas las plataformas.

source: timeit
es: cronométralo

source: The new :meth:`Timer.autorange() <timeit.Timer.autorange>` convenience method has been added to call :meth:`Timer.timeit() <timeit.Timer.timeit>` repeatedly so that the total run time is greater or equal to 200 milliseconds. (Contributed by Steven D'Aprano in :issue:`6422`.)
es: Se ha agregado el nuevo método de conveniencia :meth:`Timer.autorange() <timeit.Timer.autorange>` para llamar a :meth:`Timer.timeit() <timeit.Timer.timeit>` repetidamente para que el tiempo de ejecución total sea mayor o igual a 200 milisegundos. (Contribuido por Steven D'Aprano en :issue:`6422`.)

source: :mod:`timeit` now warns when there is substantial (4x) variance between best and worst times. (Contributed by Serhiy Storchaka in :issue:`23552`.)
es: :mod:`timeit` ahora advierte cuando hay una variación sustancial (4x) entre el mejor y el peor momento. (Contribuido por Serhiy Storchaka en :issue:`23552`.)

source: Added methods :meth:`~tkinter.Variable.trace_add`, :meth:`~tkinter.Variable.trace_remove` and :meth:`~tkinter.Variable.trace_info` in the :class:`tkinter.Variable` class. They replace old methods :meth:`~tkinter.Variable.trace_variable`, :meth:`~tkinter.Variable.trace`, :meth:`~tkinter.Variable.trace_vdelete` and :meth:`~tkinter.Variable.trace_vinfo` that use obsolete Tcl commands and might not work in future versions of Tcl. (Contributed by Serhiy Storchaka in :issue:`22115`).
es: Se agregaron los métodos :meth:`~tkinter.Variable.trace_add`, :meth:`~tkinter.Variable.trace_remove` y :meth:`~tkinter.Variable.trace_info` en la clase :class:`tkinter.Variable`. Reemplazan los métodos antiguos :meth:`~tkinter.Variable.trace_variable`, :meth:`~tkinter.Variable.trace`, :meth:`~tkinter.Variable.trace_vdelete` y :meth:`~tkinter.Variable.trace_vinfo` que usan comandos Tcl obsoletos y es posible que no funcionen en versiones futuras de Tcl. (Contribuido por Serhiy Storchaka en :issue:`22115`).

source: traceback
es: rastrear

source: Both the traceback module and the interpreter's builtin exception display now abbreviate long sequences of repeated lines in tracebacks as shown in the following example::
es: Tanto el módulo de rastreo como la pantalla de excepción incorporada del intérprete ahora abrevian largas secuencias de líneas repetidas en los rastreos como se muestra en el siguiente ejemplo:

source: (Contributed by Emanuel Barry in :issue:`26823`.)
es: (Contribuido por Emanuel Barry en :issue:`26823`.)

source: The :mod:`tracemalloc` module now supports tracing memory allocations in multiple different address spaces.
es: El módulo :mod:`tracemalloc` ahora admite el seguimiento de asignaciones de memoria en varios espacios de direcciones diferentes.

source: The new :class:`~tracemalloc.DomainFilter` filter class has been added to filter block traces by their address space (domain).
es: Se ha agregado la nueva clase de filtro :class:`~tracemalloc.DomainFilter` para filtrar los rastros de bloques por su espacio de direcciones (dominio).

source: (Contributed by Victor Stinner in :issue:`26588`.)
es: (Contribuido por Victor Stinner en :issue:`26588`.)

source: typing
es: mecanografía

source: Since the :mod:`typing` module is :term:`provisional <provisional API>`, all changes introduced in Python 3.6 have also been backported to Python 3.5.x.
es: Dado que el módulo :mod:`typing` es :term:`provisional <provisional API>`, todos los cambios introducidos en Python 3.6 también se han actualizado a Python 3.5.x.

source: The :mod:`typing` module has a much improved support for generic type aliases. For example ``Dict[str, Tuple[S, T]]`` is now a valid type annotation. (Contributed by Guido van Rossum in `Github #195 <https://github.com/python/typing/pull/195>`_.)
es: El módulo :mod:`typing` tiene un soporte mucho mejor para los alias de tipo genérico. Por ejemplo, ``Dict[str, Tuple[S, T]]`` ahora es una anotación de tipo válida. (Contribuido por Guido van Rossum en `Github #195 <https://github.com/python/typing/pull/195>`_.)

source: The :class:`typing.ContextManager` class has been added for representing :class:`contextlib.AbstractContextManager`. (Contributed by Brett Cannon in :issue:`25609`.)
es: Se ha agregado la clase :class:`typing.ContextManager` para representar :class:`contextlib.AbstractContextManager`. (Contribuido por Brett Cannon en :issue:`25609`.)

source: The :class:`typing.Collection` class has been added for representing :class:`collections.abc.Collection`. (Contributed by Ivan Levkivskyi in :issue:`27598`.)
es: Se ha agregado la clase :class:`typing.Collection` para representar :class:`collections.abc.Collection`. (Contribuido por Ivan Levkivskyi en :issue:`27598`.)

source: The :const:`typing.ClassVar` type construct has been added to mark class variables. As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. (Contributed by Ivan Levkivskyi in `Github #280 <https://github.com/python/typing/pull/280>`_.)
es: Se ha agregado la construcción de tipo :const:`typing.ClassVar` para marcar las variables de clase. Como se introdujo en :pep:`526`, una anotación de variable envuelta en ClassVar indica que un atributo dado está destinado a ser utilizado como una variable de clase y no debe establecerse en instancias de esa clase. (Contribuido por Ivan Levkivskyi en `Github #280 <https://github.com/python/typing/pull/280>`_.)

source: A new :const:`~typing.TYPE_CHECKING` constant that is assumed to be ``True`` by the static type checkers, but is ``False`` at runtime. (Contributed by Guido van Rossum in `Github #230 <https://github.com/python/typing/issues/230>`_.)
es: Una nueva constante :const:`~typing.TYPE_CHECKING` que se supone que es ``True`` por los verificadores de tipo estático, pero es ``False`` en tiempo de ejecución. (Contribuido por Guido van Rossum en `Github #230 <https://github.com/python/typing/issues/230>`_.)

source: A new :func:`~typing.NewType` helper function has been added to create lightweight distinct types for annotations::
es: Se ha agregado una nueva función auxiliar :func:`~typing.NewType` para crear tipos distintos ligeros para anotaciones:

source: The static type checker will treat the new type as if it were a subclass of the original type. (Contributed by Ivan Levkivskyi in `Github #189 <https://github.com/python/typing/issues/189>`_.)
es: El verificador de tipo estático tratará el nuevo tipo como si fuera una subclase del tipo original. (Contribuido por Ivan Levkivskyi en `Github #189 <https://github.com/python/typing/issues/189>`_.)

source: The :mod:`unicodedata` module now uses data from `Unicode 9.0.0 <https://unicode.org/versions/Unicode9.0.0/>`_. (Contributed by Benjamin Peterson.)
es: El módulo :mod:`unicodedata` ahora usa datos de `Unicode 9.0.0 <http://unicode.org/versions/Unicode9.0.0/>`_. (Contribuido por Benjamin Peterson).

source: The :class:`~unittest.mock.Mock` class has the following improvements:
es: La clase :class:`~unittest.mock.Mock` tiene las siguientes mejoras:

source: Two new methods, :meth:`Mock.assert_called() <unittest.mock.Mock.assert_called>` and :meth:`Mock.assert_called_once() <unittest.mock.Mock.assert_called_once>` to check if the mock object was called. (Contributed by Amit Saha in :issue:`26323`.)
es: Dos nuevos métodos, :meth:`Mock.assert_called() <unittest.mock.Mock.assert_called>` y :meth:`Mock.assert_called_once() <unittest.mock.Mock.assert_called_once>` para verificar si se llamó al objeto simulado. (Contribuido por Amit Saha en :issue:`26323`.)

source: The :meth:`Mock.reset_mock() <unittest.mock.Mock.reset_mock>` method now has two optional keyword only arguments: *return_value* and *side_effect*. (Contributed by Kushal Das in :issue:`21271`.)
es: El método :meth:`Mock.reset_mock() <unittest.mock.Mock.reset_mock>` ahora tiene dos argumentos opcionales de solo palabras clave: *return_value* and *side_effect*. (Contribuido por Kushal Das en :issue:`21271`.)

source: If a HTTP request has a file or iterable body (other than a bytes object) but no ``Content-Length`` header, rather than throwing an error, :class:`~urllib.request.AbstractHTTPHandler` now falls back to use chunked transfer encoding. (Contributed by Demian Brecht and Rolf Krahl in :issue:`12319`.)
es: Si una solicitud HTTP tiene un archivo o un cuerpo iterable (que no sea un objeto de bytes) pero no un encabezado ``Content-Length``, en lugar de generar un error, :class:`~urllib.request.AbstractHTTPHandler` ahora recurre a la codificación de transferencia fragmentada. (Contribuido por Demian Brecht y Rolf Krahl en :issue:`12319`.)

source: :class:`~urllib.robotparser.RobotFileParser` now supports the ``Crawl-delay`` and ``Request-rate`` extensions. (Contributed by Nikolay Bogoychev in :issue:`16099`.)
es: :class:`~urllib.robotparser.RobotFileParser` ahora admite las extensiones ``Crawl-delay`` y ``Request-rate``. (Contribuido por Nikolay Bogoychev en :issue:`16099`.)

source: :mod:`venv` accepts a new parameter ``--prompt``. This parameter provides an alternative prefix for the virtual environment. (Proposed by Łukasz Balcerzak and ported to 3.6 by Stéphane Wirtel in :issue:`22829`.)
es: :mod:`venv` acepta un nuevo parámetro ``--prompt``. Este parámetro proporciona un prefijo alternativo para el entorno virtual. (Propuesto por Łukasz Balcerzak y portado a 3.6 por Stéphane Wirtel en :issue:`22829`.)

source: warnings
es: advertencias

source: A new optional *source* parameter has been added to the :func:`warnings.warn_explicit` function: the destroyed object which emitted a :exc:`ResourceWarning`. A *source* attribute has also been added to :class:`warnings.WarningMessage` (contributed by Victor Stinner in :issue:`26568` and :issue:`26567`).
es: También se ha agregado un nuevo atributo opcional *source* a la función :func:`warnings.warn_explicit` : el objeto destruído que lanzó un :exc:`ResourceWarning`. Un atributo *source* también se agregó a :class:`warnings.WarningMessage` (aportado por Victor Stinner en :issue:`26568` y :issue:`26567`).

source: When a :exc:`ResourceWarning` warning is logged, the :mod:`tracemalloc` module is now used to try to retrieve the traceback where the destroyed object was allocated.
es: Cuando se registra una advertencia :exc:`ResourceWarning`, el módulo :mod:`tracemalloc` ahora se usa para intentar recuperar el rastreo donde se asignó el objeto destruido.

source: Example with the script ``example.py``::
es: Ejemplo con el script ``example.py``:

source: Output of the command ``python3.6 -Wd -X tracemalloc=5 example.py``::
es: Salida del comando ``python3.6 -Wd -X tracemalloc=5 example.py``:

source: The "Object allocated at" traceback is new and is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and if the :mod:`warnings` module was already imported.
es: El rastreo "Objeto asignado en" es nuevo y solo se muestra si :mod:`tracemalloc` está rastreando asignaciones de memoria de Python y si el módulo :mod:`warnings` ya fue importado.

source: Added the 64-bit integer type :data:`REG_QWORD <winreg.REG_QWORD>`. (Contributed by Clement Rouault in :issue:`23026`.)
es: Se agregó el tipo entero de 64 bits :data:`REG_QWORD <winreg.REG_QWORD>`. (Contribuido por Clement Rouault en :issue:`23026`.)

source: winsound
es: winsonido

source: Allowed keyword arguments to be passed to :func:`Beep <winsound.Beep>`, :func:`MessageBeep <winsound.MessageBeep>`, and :func:`PlaySound <winsound.PlaySound>` (:issue:`27982`).
es: Se permite que los argumentos de palabras clave se pasen a :func:`Beep <winsound.Beep>`, :func:`MessageBeep <winsound.MessageBeep>` y :func:`PlaySound <winsound.PlaySound>` (:issue:`27982`).

source: The :mod:`xmlrpc.client` module now supports unmarshalling additional data types used by the Apache XML-RPC implementation for numerics and ``None``. (Contributed by Serhiy Storchaka in :issue:`26885`.)
es: El módulo :mod:`xmlrpc.client` ahora admite la descomposición de tipos de datos adicionales utilizados por la implementación Apache XML-RPC para números y ``None``. (Contribuido por Serhiy Storchaka en :issue:`26885`.)

source: zipfile
es: archivo zip

source: A new :meth:`ZipInfo.from_file() <zipfile.ZipInfo.from_file>` class method allows making a :class:`~zipfile.ZipInfo` instance from a filesystem file. A new :meth:`ZipInfo.is_dir() <zipfile.ZipInfo.is_dir>` method can be used to check if the :class:`~zipfile.ZipInfo` instance represents a directory. (Contributed by Thomas Kluyver in :issue:`26039`.)
es: Un nuevo método de clase :meth:`ZipInfo.from_file() <zipfile.ZipInfo.from_file>` permite crear una instancia :class:`~zipfile.ZipInfo` a partir de un archivo del sistema de archivos. Se puede usar un nuevo método :meth:`ZipInfo.is_dir() <zipfile.ZipInfo.is_dir>` para verificar si la instancia :class:`~zipfile.ZipInfo` representa un directorio. (Contribuido por Thomas Kluyver en :issue:`26039`.)

source: The :meth:`ZipFile.open() <zipfile.ZipFile.open>` method can now be used to write data into a ZIP file, as well as for extracting data. (Contributed by Thomas Kluyver in :issue:`26039`.)
es: El método :meth:`ZipFile.open() <zipfile.ZipFile.open>` ahora se puede utilizar para escribir datos en un archivo ZIP, así como para extraer datos. (Contribuido por Thomas Kluyver en :issue:`26039`.)

source: The :func:`~zlib.compress` and :func:`~zlib.decompress` functions now accept keyword arguments. (Contributed by Aviv Palivoda in :issue:`26243` and Xiang Zhang in :issue:`16764` respectively.)
es: Las funciones :func:`~zlib.compress` y :func:`~zlib.decompress` ahora aceptan argumentos de palabras clave. (Contribuido por Aviv Palivoda en :issue:`26243` y Xiang Zhang en :issue:`16764` respectivamente).

source: Optimizations
es: Optimizaciones

source: The Python interpreter now uses a 16-bit wordcode instead of bytecode which made a number of opcode optimizations possible. (Contributed by Demur Rumed with input and reviews from Serhiy Storchaka and Victor Stinner in :issue:`26647` and :issue:`28050`.)
es: El intérprete de Python ahora usa un código de palabra de 16 bits en lugar de un código de bytes, lo que hizo posible una serie de optimizaciones de código de operación. (Contribuido por Demur Rumed con aportes y reseñas de Serhiy Storchaka y Victor Stinner en :issue:`26647` y :issue:`28050`.)

source: The :class:`asyncio.Future` class now has an optimized C implementation. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26081`.)
es: La clase :class:`asyncio.Future` ahora tiene una implementación C optimizada. (Contribuido por Yury Selivanov e INADA Naoki en :issue:`26081`.)

source: The :class:`asyncio.Task` class now has an optimized C implementation. (Contributed by Yury Selivanov in :issue:`28544`.)
es: La clase :class:`asyncio.Task` ahora tiene una implementación C optimizada. (Contribuido por Yury Selivanov en :issue:`28544`.)

source: Various implementation improvements in the :mod:`typing` module (such as caching of generic types) allow up to 30 times performance improvements and reduced memory footprint.
es: Varias mejoras de implementación en el módulo :mod:`typing` (como el almacenamiento en caché de tipos genéricos) permiten mejoras de rendimiento hasta 30 veces mayores y una huella de memoria reducida.

source: The ASCII decoder is now up to 60 times as fast for error handlers ``surrogateescape``, ``ignore`` and ``replace`` (Contributed by Victor Stinner in :issue:`24870`).
es: El decodificador ASCII ahora es hasta 60 veces más rápido para los controladores de errores ``surrogateescape``, ``ignore`` y ``replace`` (Contribuido por Victor Stinner en :issue:`24870`).

source: The ASCII and the Latin1 encoders are now up to 3 times as fast for the error handler ``surrogateescape`` (Contributed by Victor Stinner in :issue:`25227`).
es: Los codificadores ASCII y Latin1 ahora son hasta 3 veces más rápidos para el controlador de errores ``surrogateescape`` (Contribuido por Victor Stinner en :issue:`25227`).

source: The UTF-8 encoder is now up to 75 times as fast for error handlers ``ignore``, ``replace``, ``surrogateescape``, ``surrogatepass`` (Contributed by Victor Stinner in :issue:`25267`).
es: El codificador UTF-8 ahora es hasta 75 veces más rápido para los controladores de errores ``ignore``, ``replace``, ``surrogateescape``, ``surrogatepass`` (Contribuido por Victor Stinner en :issue:`25267`).

source: The UTF-8 decoder is now up to 15 times as fast for error handlers ``ignore``, ``replace`` and ``surrogateescape`` (Contributed by Victor Stinner in :issue:`25301`).
es: El decodificador UTF-8 ahora es hasta 15 veces más rápido para los controladores de errores ``ignore``, ``replace`` y ``surrogateescape`` (Contribuido por Victor Stinner en :issue:`25301`).

source: ``bytes % args`` is now up to 2 times faster. (Contributed by Victor Stinner in :issue:`25349`).
es: ``bytes % args`` ahora es hasta 2 veces más rápido. (Contribuido por Victor Stinner en :issue:`25349`).

source: ``bytearray % args`` is now between 2.5 and 5 times faster. (Contributed by Victor Stinner in :issue:`25399`).
es: ``bytearray % args`` es ahora entre 2,5 y 5 veces más rápido. (Contribuido por Victor Stinner en :issue:`25399`).

source: Optimize :meth:`bytes.fromhex` and :meth:`bytearray.fromhex`: they are now between 2x and 3.5x faster. (Contributed by Victor Stinner in :issue:`25401`).
es: Optimice :meth:`bytes.fromhex` y :meth:`bytearray.fromhex`: ahora son entre 2 y 3,5 veces más rápidos. (Contribuido por Victor Stinner en :issue:`25401`).

source: Optimize ``bytes.replace(b'', b'.')`` and ``bytearray.replace(b'', b'.')``: up to 80% faster. (Contributed by Josh Snider in :issue:`26574`).
es: Optimice ``bytes.replace(b'', b'.')`` y ``bytearray.replace(b'', b'.')``: hasta un 80% más rápido. (Contribuido por Josh Snider en :issue:`26574`).

source: :func:`pickle.load` and :func:`pickle.loads` are now up to 10% faster when deserializing many small objects (Contributed by Victor Stinner in :issue:`27056`).
es: :func:`pickle.load` y :func:`pickle.loads` ahora son hasta un 10% más rápidos al deserializar muchos objetos pequeños (contribución de Victor Stinner en :issue:`27056`).

source: Passing :term:`keyword arguments <keyword argument>` to a function has an overhead in comparison with passing :term:`positional arguments <positional argument>`. Now in extension functions implemented with using Argument Clinic this overhead is significantly decreased. (Contributed by Serhiy Storchaka in :issue:`27574`).
es: Pasar :term:`keyword arguments <keyword argument>` a una función tiene una sobrecarga en comparación con pasar :term:`positional arguments <positional argument>`. Ahora, en las funciones de extensión implementadas con el uso de Argument Clinic, esta sobrecarga se reduce significativamente. (Contribuido por Serhiy Storchaka en :issue:`27574`).

source: Optimized :func:`~glob.glob` and :func:`~glob.iglob` functions in the :mod:`glob` module; they are now about 3--6 times faster. (Contributed by Serhiy Storchaka in :issue:`25596`).
es: Funciones :func:`~glob.glob` y :func:`~glob.iglob` optimizadas en el módulo :mod:`glob`; ahora son unas 3 a 6 veces más rápidas. (Contribuido por Serhiy Storchaka en :issue:`25596`).

source: Optimized globbing in :mod:`pathlib` by using :func:`os.scandir`; it is now about 1.5--4 times faster. (Contributed by Serhiy Storchaka in :issue:`26032`).
es: Globbing optimizado en :mod:`pathlib` mediante :func:`os.scandir`; ahora es alrededor de 1,5 a 4 veces más rápido. (Contribuido por Serhiy Storchaka en :issue:`26032`).

source: :class:`xml.etree.ElementTree` parsing, iteration and deepcopy performance has been significantly improved. (Contributed by Serhiy Storchaka in :issue:`25638`, :issue:`25873`, and :issue:`25869`.)
es: Se ha mejorado significativamente el rendimiento de análisis, iteración y copia profunda de :class:`xml.etree.ElementTree`. (Contribuido por Serhiy Storchaka en :issue:`25638`, :issue:`25873` y :issue:`25869`.)

source: Creation of :class:`fractions.Fraction` instances from floats and decimals is now 2 to 3 times faster. (Contributed by Serhiy Storchaka in :issue:`25971`.)
es: La creación de instancias de :class:`fractions.Fraction` a partir de flotantes y decimales es ahora de 2 a 3 veces más rápida. (Contribuido por Serhiy Storchaka en :issue:`25971`.)

source: Build and C API Changes
es: Cambios en la API de Build y C

source: Python now requires some C99 support in the toolchain to build. Most notably, Python now uses standard integer types and macros in place of custom macros like ``PY_LONG_LONG``. For more information, see :pep:`7` and :issue:`17884`.
es: Python ahora requiere algo de compatibilidad con C99 en la cadena de herramientas para compilarse. En particular, Python ahora usa macros y tipos de enteros estándar en lugar de macros personalizadas como ``PY_LONG_LONG``. Para obtener más información, consulte :pep:`7` y :issue:`17884`.

source: Cross-compiling CPython with the Android NDK and the Android API level set to 21 (Android 5.0 Lollipop) or greater runs successfully. While Android is not yet a supported platform, the Python test suite runs on the Android emulator with only about 16 tests failures. See the Android meta-issue :issue:`26865`.
es: La compilación cruzada de CPython con el NDK de Android y el nivel de API de Android establecido en 21 (Android 5.0 Lollipop) o superior se ejecuta correctamente. Si bien Android aún no es una plataforma compatible, el conjunto de pruebas de Python se ejecuta en el emulador de Android con solo alrededor de 16 fallas en las pruebas. Consulte el meta-problema de Android :issue:`26865`.

source: The ``--enable-optimizations`` configure flag has been added. Turning it on will activate expensive optimizations like PGO. (Original patch by Alecsandru Patrascu of Intel in :issue:`26359`.)
es: Se ha agregado el indicador de configuración ``--enable-optimizations``. Activarlo activará optimizaciones costosas como PGO. (Parche original de Alecsandru Patrascu de Intel en :issue:`26359`.)

source: New :c:func:`Py_FinalizeEx` API which indicates if flushing buffered data failed. (Contributed by Martin Panter in :issue:`5319`.)
es: Nueva API :c:func:`Py_FinalizeEx` que indica si fallaron los datos almacenados en búfer. (Contribuido por Martin Panter en :issue:`5319`.)

source: :c:func:`PyArg_ParseTupleAndKeywords` now supports :ref:`positional-only parameters <positional-only_parameter>`. Positional-only parameters are defined by empty names. (Contributed by Serhiy Storchaka in :issue:`26282`).
es: :c:func:`PyArg_ParseTupleAndKeywords` ahora es compatible con :ref:`positional-only parameters <positional-only_parameter>`. Los parámetros solo posicionales se definen mediante nombres vacíos. (Contribuido por Serhiy Storchaka en :issue:`26282`).

source: ``PyTraceback_Print`` method now abbreviates long sequences of repeated lines as ``"[Previous line repeated {count} more times]"``. (Contributed by Emanuel Barry in :issue:`26823`.)
es: El método ``PyTraceback_Print`` ahora abrevia secuencias largas de líneas repetidas como ``"[Previous line repeated {count} more times]"``. (Contribuido por Emanuel Barry en :issue:`26823`.)
