Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: The Settings dialog (Options, Configure IDLE) has been partly rewritten to improve both appearance and function. (Contributed by Cheryl Sabella and Terry Jan Reedy in multiple issues.)
es_ec: El cuadro de diálogo Configuración (Opciones, Configurar IDLE) se ha reescrito parcialmente para mejorar tanto la apariencia como la función. (Contribuido por *Cheryl Sabella* y *Terry Jan Reedy* en múltiple issues.)

source: The font sample now includes a selection of non-Latin characters so that users can better see the effect of selecting a particular font. (Contributed by Terry Jan Reedy in :issue:`13802`.) The sample can be edited to include other characters. (Contributed by Serhiy Storchaka in :issue:`31860`.)
es_ec: La muestra de fuente ahora incluye una selección de caracteres no latinos para que los usuarios puedan ver mejor el efecto de seleccionar una fuente en particular. (Contribuido por *Terry Jan Reedy* en :issue:`13802`.). La muestra se puede editar para incluir otros caracteres. (Contribuido por *Serhiy Storchaka* en :issue:`31860`.)

source: The IDLE features formerly implemented as extensions have been reimplemented as normal features. Their settings have been moved from the Extensions tab to other dialog tabs. (Contributed by Charles Wohlganger and Terry Jan Reedy in :issue:`27099`.)
es_ec: Las funciones IDLE implementadas anteriormente como extensiones se han vuelto a implementar como funciones normales. Su configuración se ha movido de la pestaña Extensiones a otras pestañas de diálogo. (Contribuido por *Charles Wohlganger* y *Terry Jan Reedy* en :issue:`27099`.)

source: Editor code context option revised. Box displays all context lines up to maxlines. Clicking on a context line jumps the editor to that line. Context colors for custom themes is added to Highlights tab of Settings dialog. (Contributed by Cheryl Sabella and Terry Jan Reedy in :issue:`33642`, :issue:`33768`, and :issue:`33679`.)
es_ec: Se revisó la opción de contexto del código del editor. El cuadro muestra todas las líneas de contexto hasta las líneas máximas. Al hacer clic en una línea de contexto, el editor pasa a esa línea. Los colores de contexto para temas personalizados se agregan a la pestaña Destacados del cuadro de diálogo Configuración. (Contribuido por *Cheryl Sabella* y *Terry Jan Reedy* en :issue:`33642`, :issue:`33768`, y :issue:`33679`.)

source: On Windows, a new API call tells Windows that tk scales for DPI. On Windows 8.1+ or 10, with DPI compatibility properties of the Python binary unchanged, and a monitor resolution greater than 96 DPI, this should make text and lines sharper. It should otherwise have no effect. (Contributed by Terry Jan Reedy in :issue:`33656`.)
es_ec: En Windows, una nueva llamada a la API le dice a Windows que tk escala para DPI. En Windows 8.1+ o 10, con las propiedades de compatibilidad de DPI del binario de Python sin cambios y una resolución de monitor superior a 96 DPI, esto debería hacer que el texto y las líneas sean más nítidos. De lo contrario, no debería tener ningún efecto. (Contribuido por *Terry Jan Reedy* en :issue:`33656`.)

source: New in 3.7.1:
es_ec: Nuevo en 3.7.1:

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
es_ec: La salida sobre N líneas (50 por defecto) se reduce a un botón. N se puede cambiar en la sección PyShell de la página General del cuadro de diálogo Configuración. Se pueden comprimir menos líneas, pero posiblemente más largas, haciendo clic derecho en la salida. La salida comprimida se puede expandir en su lugar haciendo doble clic en el botón o en el portapapeles o en una ventana separada haciendo clic derecho en el botón. (Contribuido por *Tal Einat* en :issue:`1529353`.)

source: The changes above have been backported to 3.6 maintenance releases.
es_ec: Los cambios anteriores se han actualizado a las versiones de mantenimiento 3.6.

source: NEW in 3.7.4:
es_ec: Nuevo en 3.7.4:

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
es_ec: Agregado “Run Customized” al menú Correr para ejecutar un módulo con configuraciones personalizadas. Cualquier argumento de línea de comando ingresado se agrega a sys.argv. Vuelven a aparecer en el cuadro para la siguiente ejecución personalizada. También se puede suprimir el reinicio normal del módulo principal de Shell. (Contribuidor por *Cheryl Sabella*, *Terry Jan Reedy*, y otros en :issue:`5680` y :issue:`37627`.)

source: New in 3.7.5:
es_ec: Nuevo en 3.7.5:

source: Add optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
es_ec: Agregue números de línea opcionales para las ventanas del editor IDLE. Las ventanas se abren sin números de línea a menos que se establezca lo contrario en la pestaña General del cuadro de diálogo de configuración. Los números de línea de una ventana existente se muestran y ocultan en el menú Opciones. (Contribuido por *Tal Einat* y *Saimadhav Heblikar* en :issue:`17535`.)

source: The :class:`importlib.abc.ResourceReader` ABC was introduced to support the loading of resources from packages. See also :ref:`whatsnew37_importlib_resources`. (Contributed by Barry Warsaw, Brett Cannon in :issue:`32248`.)
es_ec: El :class:`importlib.abc.ResourceReader` ABC se introdujo para admitir la carga de recursos desde paquetes. Ver también :ref:`whatsnew37_importlib_resources`. (Contribuido por *Barry Warsaw*, *Brett Cannon* en :issue:`32248`.)

source: :func:`importlib.reload` now raises :exc:`ModuleNotFoundError` if the module lacks a spec. (Contributed by Garvit Khatri in :issue:`29851`.)
es_ec: :func:`importlib.reload` ahora mejora :exc:`ModuleNotFoundError` si el módulo carece de especificación. (Contribuido por *Garvit Khatri* en :issue:`29851`.)

source: :func:`importlib.find_spec` now raises :exc:`ModuleNotFoundError` instead of :exc:`AttributeError` if the specified parent module is not a package (i.e. lacks a ``__path__`` attribute). (Contributed by Milan Oberkirch in :issue:`30436`.)
es_ec: :func:`importlib.find_spec` ahora mejora :exc:`ModuleNotFoundError` en lugar de :exc:`AttributeError` si el modulo principal especifico no ese un paquete (es decir, carece de un atributo ``__path__``). (Contribuido por *Milan Oberkirch* en :issue:`30436`.)

source: The new :func:`importlib.source_hash` can be used to compute the hash of the passed source. A :ref:`hash-based .pyc file <whatsnew37-pep552>` embeds the value returned by this function.
es_ec: La nueva :func:`importlib.source_hash` se puede utilizar para calcular el hash de la fuente pasada. Un :ref:`archivo .pyc basado en hash <whatsnew37-pep552>` incrusta el valor devuelto por esta función.

source: The new :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` method can be used to reconfigure the text stream with the new settings. (Contributed by Antoine Pitrou in :issue:`30526` and INADA Naoki in :issue:`15216`.)
es_ec: El nuevo método :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` se puede utilizar para reconfigurar el flujo de texto con la nueva configuración. (Contribuido por *Antoine Pitrou* en :issue:`30526` y *INADA Naoki* en :issue:`15216`.)

source: The new ``subnet_of()`` and ``supernet_of()`` methods of :class:`ipaddress.IPv6Network` and :class:`ipaddress.IPv4Network` can be used for network containment tests. (Contributed by Michel Albert and Cheryl Sabella in :issue:`20825`.)
es_ec: Los nuevos métodos ``subnet_of()`` y ``supernet_of()`` de :class:`ipaddress.IPv6Network` y :class:`ipaddress.IPv4Network` pueden ser usados para pruebas de contención de redes. (Contribuido por *Michel Albert* y *Cheryl Sabella* en :issue:`20825`.)

source: :func:`itertools.islice` now accepts :meth:`integer-like objects <object.__index__>` as start, stop, and slice arguments. (Contributed by Will Roberts in :issue:`30537`.)
es_ec: :func:`itertools.islice` ahora acepta :meth:`integer-like objects <object.__index__>` como argumentos de inicio, parada y corte. (Contribuido por *Will Roberts* en :issue:`30537`.)

source: The new *monetary* argument to :func:`locale.format_string` can be used to make the conversion use monetary thousands separators and grouping strings. (Contributed by Garvit in :issue:`10379`.)
es_ec: El nuevo argumento * monetario * para :func:`locale.format_string` se puede utilizar para hacer que la conversión utilice separadores de miles monetarios y cadenas de agrupación. (Contribuido por *Garvit* en :issue:`10379`.)

source: The :func:`locale.getpreferredencoding` function now always returns ``'UTF-8'`` on Android or when in the :ref:`forced UTF-8 mode <whatsnew37-pep540>`.
es_ec: La función :func:`locale.getpreferredencoding` ahora siempre devuelve ``’UTF-8’`` en Android o cuando está en el :ref:`modo UTF-8 forzado <whatsnew37-pep540>`.

source: :class:`~logging.Logger` instances can now be pickled. (Contributed by Vinay Sajip in :issue:`30520`.)
es_ec: :class:`~logging.Logger` instancias ahora pueden ser decapadas. (Contribuido por *Vinay Sajip* en :issue:`30520`.)

source: The new :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` method can be used to replace the logger stream after handler creation. (Contributed by Vinay Sajip in :issue:`30522`.)
es_ec: El nuevo método :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` se puede utilizar para reemplazar la secuencia del registrador después de la creación del controlador. (Contribuido por *Vinay Sajip* en :issue:`30522`.)

source: It is now possible to specify keyword arguments to handler constructors in configuration passed to :func:`logging.config.fileConfig`. (Contributed by Preston Landers in :issue:`31080`.)
es_ec: Ahora es posible especificar argumentos de palabras clave para los constructores de manejadores en la configuración pasada a :func:`logging.config.fileConfig`. (Contribuido por *Preston Landers* en :issue:`31080`.)

source: The new :func:`math.remainder` function implements the IEEE 754-style remainder operation. (Contributed by Mark Dickinson in :issue:`29962`.)
es_ec: La nueva función :func:`math.remainder` implementa la operación de resto de estilo IEEE 754. (Contribuido por *Mark Dickinson* en :issue:`29962`.)

source: The MIME type of .bmp has been changed from ``'image/x-ms-bmp'`` to ``'image/bmp'``. (Contributed by Nitish Chandra in :issue:`22589`.)
es_ec: El tipo MIME de .bmp se ha cambiado de ``’image/x-ms-bmp’`` a ``’image/bmp’``. (Contribuido por *Nitish Chandra* en :issue:`22589`.)

source: The new :meth:`Database.Close() <msilib.Database.Close>` method can be used to close the :abbr:`MSI` database. (Contributed by Berker Peksag in :issue:`20486`.)
es_ec: El nuevo método :meth:`Database.Close() <msilib.Database.Close>` se puede utilizar para cerrar la base de datos :abbr:`MSI`. (Contribuido por *Berker Peksag* en :issue:`20486`.)

source: The new :meth:`Process.close() <multiprocessing.Process.close>` method explicitly closes the process object and releases all resources associated with it. :exc:`ValueError` is raised if the underlying process is still running. (Contributed by Antoine Pitrou in :issue:`30596`.)
es_ec: El nuevo método :meth:`Process.close() <multiprocessing.Process.close>` cierra explícitamente el objeto de proceso y libera todos los recursos asociados con él. :exc:`ValueError` se genera si el proceso subyacente aún se está ejecutando. (Contribuido por *Antoine Pitrou* en :issue:`30596`.)

source: The new :meth:`Process.kill() <multiprocessing.Process.kill>` method can be used to terminate the process using the :data:`SIGKILL` signal on Unix. (Contributed by Vitor Pereira in :issue:`30794`.)
es_ec: El nuevo método :meth:`Process.kill() <multiprocessing.Process.kill>` se puede usar para terminar el proceso usando la señal :data:`SIGKILL` en Unix. (Contribuido por *Vitor Pereira* en :issue:`30794`.)

source: Non-daemonic threads created by :class:`~multiprocessing.Process` are now joined on process exit. (Contributed by Antoine Pitrou in :issue:`18966`.)
es_ec: Subprocesos no demoníacos creados por :class:`~multiprocessing.Process` ahora se unen al salir del proceso. (Contribuido por *Antoine Pitrou* en :issue:`18966`.)

source: :func:`os.fwalk` now accepts the *path* argument as :class:`bytes`. (Contributed by Serhiy Storchaka in :issue:`28682`.)
es_ec: :func:`os.fwalk` ahora acepta el argumento *path* como :class:`bytes`. (Contribuido por *Serhiy Storchaka* en :issue:`28682`.)

source: :func:`os.scandir` gained support for :ref:`file descriptors <path_fd>`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
es_ec: :func:`os.scandir` obtuvo soporte de :ref:`descriptores de archivo <path_fd>`. (Contribuido por *Serhiy Storchaka* en :issue:`25996`.)

source: The new :func:`~os.register_at_fork` function allows registering Python callbacks to be executed at process fork. (Contributed by Antoine Pitrou in :issue:`16500`.)
es_ec: La nueva función :func:`~os.register_at_fork` permite registrar devoluciones de llamada de Python para que se ejecuten en la bifurcación del proceso. (Contribuido por *Antoine Pitrou* en :issue:`16500`.)

source: Added :func:`os.preadv` (combine the functionality of :func:`os.readv` and :func:`os.pread`) and :func:`os.pwritev` functions (combine the functionality of :func:`os.writev` and :func:`os.pwrite`). (Contributed by Pablo Galindo in :issue:`31368`.)
es_ec: Agrega funciones :func:`os.preadv` (combinando la funcionalidad de :func:`os.readv` y :func:`os.pread`) y :func:`os.pwritev` (combinando la funcionalidad de :func:`os.writev` y :func:`os.pwrite`). (Contribuido por *Pablo Galindo* en :issue:`31368`.)

source: The mode argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. (Contributed by Serhiy Storchaka in :issue:`19930`.)
es_ec: El argumento de modo de :func:`os.makedirs` ya no afecta los bits de permiso de archivo de los directorios de nivel intermedio recién creados. (Aportado por Serhiy Storchaka en :issue:`19930`.)

source: :func:`os.dup2` now returns the new file descriptor. Previously, ``None`` was always returned. (Contributed by Benjamin Peterson in :issue:`32441`.)
es_ec: :func:`os.dup2` ahora retorna el nuevo descriptor de archivo. Previamente, ``None`` siempre fue retornado. (Contribuido por *Benjamin Peterson* en :issue:`32441`.)

source: The structure returned by :func:`os.stat` now contains the :attr:`~os.stat_result.st_fstype` attribute on Solaris and its derivatives. (Contributed by Jesús Cea Avión in :issue:`32659`.)
es_ec: La estructura retornada por :func:`os.stat` ahora contiene el atributo :attr:`~os.stat_result.st_fstype` en Solaris y sus derivados. (Contribuido por *Jesús Cea Avión* en :issue:`32659`.)

source: The new :meth:`Path.is_mount() <pathlib.Path.is_mount>` method is now available on POSIX systems and can be used to determine whether a path is a mount point. (Contributed by Cooper Ry Lees in :issue:`30897`.)
es_ec: El nuevo método :meth:`Path.is_mount() <pathlib.Path.is_mount>` ahora está disponible en los sistemas POSIX y se puede utilizar para determinar si una ruta es un punto de montaje. (Contribuido por *Cooper Ry Lees* en :issue:`30897`.)

source: :func:`pdb.set_trace` now takes an optional *header* keyword-only argument. If given, it is printed to the console just before debugging begins. (Contributed by Barry Warsaw in :issue:`31389`.)
es_ec: :func:`pdb.set_trace` ahora toma un argumento opcional *header* solo de palabra clave. Si se proporciona, se imprime en la consola justo antes de que comience la depuración. (Contribuido por *Barry Warsaw* en :issue:`31389`.)

source: :mod:`pdb` command line now accepts ``-m module_name`` as an alternative to script file. (Contributed by Mario Corchero in :issue:`32206`.)
es_ec: :mod:`pdb` la línea de comando ahora acepta ``-m module_name`` como una alternativa al archivo de script. (Contribuido por *Mario Corchero* en :issue:`32206`.)

source: :func:`py_compile.compile` -- and by extension, :mod:`compileall` -- now respects the :envvar:`SOURCE_DATE_EPOCH` environment variable by unconditionally creating ``.pyc`` files for hash-based validation. This allows for guaranteeing `reproducible builds <https://reproducible-builds.org/>`_ of ``.pyc`` files when they are created eagerly. (Contributed by Bernhard M. Wiedemann in :issue:`29708`.)
es_ec: :func:`py_compile.compile` — y por extensión, :mod:`compileall` — ahora respeta la variable de entorno :envvar:`SOURCE_DATE_EPOCH` creando incondicionalmente archivos ``.pyc`` para la validación basada en hash. Esto permite garantizar `compilaciones reproducibles <https://reproducible-builds.org/>`_ de archivos ``.pyc`` cuando se crean con entusiasmo. (Contribuido por *Bernhard M. Wiedemann* en :issue:`29708`.)

source: The pydoc server can now bind to an arbitrary hostname specified by the new ``-n`` command-line argument. (Contributed by Feanil Patel in :issue:`31128`.)
es_ec: El servidor *pydoc* ahora puede vincularse a un nombre de host arbitrario especificado por el nuevo argumento de línea de comandos ``-n``. (Contribuido por *Feanil Patel* en :issue:`31128`.)

source: The new :class:`~queue.SimpleQueue` class is an unbounded :abbr:`FIFO` queue. (Contributed by Antoine Pitrou in :issue:`14976`.)
es_ec: La nueva clase :class:`~queue.SimpleQueue` es una cola ilimitada :abbr:`FIFO`. (Contribuido por *Antoine Pitrou* en :issue:`14976`.)

source: The flags :const:`re.ASCII`, :const:`re.LOCALE` and :const:`re.UNICODE` can be set within the scope of a group. (Contributed by Serhiy Storchaka in :issue:`31690`.)
es_ec: Las banderas :const:`re.ASCII`, :const:`re.LOCALE` y :const:`re.UNICODE` se pueden establecer dentro del alcance de un grupo. (Contribuido por *Serhiy Storchaka* en :issue:`31690`.)

source: :func:`re.split` now supports splitting on a pattern like ``r'\b'``, ``'^$'`` or ``(?=-)`` that matches an empty string. (Contributed by Serhiy Storchaka in :issue:`25054`.)
es_ec: :func:`re.split` ahora admite la división en un patrón como ``r’\b’``, ``’^$’`` or ``(?=-)`` que coincide con una cadena vacía. (Contribuido por *Serhiy Storchaka* en :issue:`25054`.)

source: Regular expressions compiled with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Locale settings are applied only when the compiled regular expression is used. (Contributed by Serhiy Storchaka in :issue:`30215`.)
es_ec: Las expresiones regulares compiladas con el indicador :const:`re.LOCALE` ya no dependen de la configuración regional en el momento de la compilación. La configuración regional se aplica solo cuando se utiliza la expresión regular compilada. (Contribuido por *Serhiy Storchaka* en :issue:`30215`.)

source: :exc:`FutureWarning` is now emitted if a regular expression contains character set constructs that will change semantically in the future, such as nested sets and set operations. (Contributed by Serhiy Storchaka in :issue:`30349`.)
es_ec: :exc:`FutureWarning` ahora se emite si una expresión regular contiene construcciones de conjuntos de caracteres que cambiarán semánticamente en el futuro, como conjuntos anidados y operaciones de conjuntos. (Contribuido por *Serhiy Storchaka* en :issue:`30349`.)

source: Compiled regular expression and match objects can now be copied using :func:`copy.copy` and :func:`copy.deepcopy`. (Contributed by Serhiy Storchaka in :issue:`10076`.)
es_ec: Las expresiones regulares compiladas y los objetos coincidentes ahora se pueden copiar usando :func:`copy.copy` y :func:`copy.deepcopy`. (Contribuido por *Serhiy Storchaka* en :issue:`10076`.)

source: The new *warn_on_full_buffer* argument to the :func:`signal.set_wakeup_fd` function makes it possible to specify whether Python prints a warning on stderr when the wakeup buffer overflows. (Contributed by Nathaniel J. Smith in :issue:`30050`.)
es_ec: El nuevo argumento * warn_on_full_buffer * para la función :func:`signal.set_wakeup_fd` permite especificar si Python imprime una advertencia en *stderr* cuando el búfer de activación se desborda. (Contribuido por *Nathaniel J. Smith* en :issue:`30050`.)

source: The new :func:`socket.getblocking() <socket.socket.getblocking>` method returns ``True`` if the socket is in blocking mode and ``False`` otherwise. (Contributed by Yury Selivanov in :issue:`32373`.)
es_ec: El nuevo método :func:`socket.getblocking() <socket.socket.getblocking>` retorna ``True`` si el socket esta en modo bloqueo y ``False`` en caso contrario. (Contribuido por *Yury Selivanov* en :issue:`32373`.)

source: The new :func:`socket.close` function closes the passed socket file descriptor. This function should be used instead of :func:`os.close` for better compatibility across platforms. (Contributed by Christian Heimes in :issue:`32454`.)
es_ec: La nueva función :func:`socket.close` cierra el descriptor de archivo de socket pasado. Esta función debe usarse en lugar de :func:`os.close` para una mejor compatibilidad entre plataformas. (Contribuido por *Christian Heimes* en :issue:`32454`.)

source: Sockets now auto-detect family, type and protocol from file descriptor by default. (Contributed by Christian Heimes in :issue:`28134`.)
es_ec: Los sockets ahora detectan automáticamente la familia, el tipo y el protocolo del descriptor de archivo de forma predeterminada. (Contribuido por *Christian Heimes* en :issue:`28134`.)

source: :meth:`socketserver.ThreadingMixIn.server_close` now waits until all non-daemon threads complete. :meth:`socketserver.ForkingMixIn.server_close` now waits until all child processes complete.
es_ec: :meth:`socketserver.ThreadingMixIn.server_close` ahora espera hasta que se completen todos los subprocesos que no son demonios. :meth:`socketserver.ForkingMixIn.server_close` ahora espera hasta que se completen todos los procesos secundarios.

source: Add a new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to :class:`socketserver.ForkingMixIn` and :class:`socketserver.ThreadingMixIn` classes. Set the class attribute to ``False`` to get the pre-3.7 behaviour.
es_ec: Agregue un nuevo atributo de clase :attr:`socketserver.ForkingMixIn.block_on_close` a las clases :class:`socketserver.ForkingMixIn` y :class:`socketserver.ThreadingMixIn`. Establece el atributo de clase en ``False`` para obtener el comportamiento anterior a 3.7.

source: :class:`sqlite3.Connection` now exposes the :meth:`~sqlite3.Connection.backup` method when the underlying SQLite library is at version 3.6.11 or higher. (Contributed by Lele Gaifax in :issue:`27645`.)
es_ec: :class:`sqlite3.Connection` ahora expone el método :meth:`~sqlite3.Connection.backup` cuando la biblioteca SQLite subyacente está en la versión 3.6.11 o superior. (Contribuido por *Lele Gaifax* en :issue:`27645`.)
