Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: The :func:`locals` dictionary now displays in the lexical order that variables were defined. Previously, the order was undefined. (Contributed by Raymond Hettinger in :issue:`32690`.)
es_ec: El diccionario :func:`locals` ahora se muestra en el orden léxico en que se definieron las variables. Anteriormente, el orden no estaba definido. (Contribuido por *Raymond Hettinger* en :issue:`32690`.)

source: Deprecated Python Behavior
es_ec: Comportamiento obsoleto de Python

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now deprecated in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). This ensures that comprehensions always immediately return a container of the appropriate type (rather than potentially returning a :term:`generator iterator` object), while generator expressions won't attempt to interleave their implicit output with the output from any explicit yield expressions. In Python 3.7, such expressions emit :exc:`DeprecationWarning` when compiled, in Python 3.8 this will be a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :issue:`10544`.)
es_ec: Las expresiones de rendimiento (tanto las cláusulas ``yield`` como las cláusulas ``yield from``) ahora están en desuso en las comprensiones y las expresiones generadoras (aparte de la expresión iterable en la cláusula más a la izquierda :keyword:`!for`). Esto asegura que las comprensiones siempre devuelvan inmediatamente un contenedor del tipo apropiado (en lugar de potencialmente devolver un objeto :term:`generator iterator`), mientras que las expresiones generadoras no intentarán intercalar su salida implícita con la salida de ninguna expresión de rendimiento explícita. En Python 3.7, tales expresiones emiten :exc:`DeprecationWarning` cuando se compilan, en Python 3.8 será un :exc:`SyntaxError`. (Contribuido por *Serhiy Storchaka* en :issue:`10544`.)

source: Returning a subclass of :class:`complex` from :meth:`object.__complex__` is deprecated and will be an error in future Python versions. This makes ``__complex__()`` consistent with :meth:`object.__int__` and :meth:`object.__float__`. (Contributed by Serhiy Storchaka in :issue:`28894`.)
es_ec: Devolviendo una subclase de :class:`complex` desde :meth:`object.__complex__` está obsoleto y será un error en futuras versiones de Python. Esto hace que ``__complex__()`` se compatible con :meth:`object.__int__` y :meth:`object.__float__`. (Contribuido por *Serhiy Storchaka* en :issue:`28894`.)

source: Deprecated Python modules, functions and methods
es_ec: Módulos, funciones y métodos de Python obsoletos

source: :func:`aifc.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`aifc.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
es_ec: :func:`aifc.openfp` ha quedado obsoleto y se eliminará en Python 3.9. En su lugar use :func:`aifc.open`. (Contribuido por *Brian Curtin* en :issue:`31985`.)

source: Support for directly ``await``-ing instances of :class:`asyncio.Lock` and other asyncio synchronization primitives has been deprecated. An asynchronous context manager must be used in order to acquire and release the synchronization resource. (Contributed by Andrew Svetlov in :issue:`32253`.)
es_ec: Se ha desaprobado el soporte para instancias en ``await`` de :class:`asyncio.Lock` y otras primitivas de sincronización asyncio directamente. Se debe utilizar un administrador de contexto asincrónico para adquirir y liberar el recurso de sincronización. (Contribuido por *Andrew Svetlov* en :issue:`32253`.)

source: The :meth:`asyncio.Task.current_task` and :meth:`asyncio.Task.all_tasks` methods have been deprecated. (Contributed by Andrew Svetlov in :issue:`32250`.)
es_ec: Los métodos :meth:`asyncio.Task.current_task` y :meth:`asyncio.Task.all_tasks` han quedado obsoletos. (Contribuido por *Andrew Svetlov* en :issue:`32250`.)

source: In Python 3.8, the abstract base classes in :mod:`collections.abc` will no longer be exposed in the regular :mod:`collections` module. This will help create a clearer distinction between the concrete classes and the abstract base classes. (Contributed by Serhiy Storchaka in :issue:`25988`.)
es_ec: En Python 3.8, las clases base abstractas en :mod:`collections.abc` ya no estará expuesto en el módulo regular :mod:`collections`. Esto ayudará a crear una distinción más clara entre las clases concretas y las clases base abstractas. (Contribuido por *Serhiy Storchaka* en :issue:`25988`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed. A deprecation warning is now emitted if the index file is missing and recreated in the ``'r'`` and ``'w'`` modes (this will be an error in future Python releases). (Contributed by Serhiy Storchaka in :issue:`28847`.)
es_ec: :mod:`dbm.dumb` ahora admite la lectura de archivos de solo lectura y ya no escribe el archivo de índice cuando no se cambia. Ahora se emite una advertencia de obsolescencia si falta el archivo de índice y se recrea en los modos ``’r’`` y ``’w’`` (esto será un error en futuras versiones de Python). (Contribuido por *Serhiy Storchaka* en :issue:`28847`.)

source: In Python 3.8, attempting to check for non-Enum objects in :class:`Enum` classes will raise a :exc:`TypeError` (e.g. ``1 in Color``); similarly, attempting to check for non-Flag objects in a :class:`Flag` member will raise :exc:`TypeError` (e.g. ``1 in Perm.RW``); currently, both operations return :const:`False` instead. (Contributed by Ethan Furman in :issue:`33217`.)
es_ec: En Python 3.8, intentar buscar objetos que no sean Enum en clases :class:`Enum` lanzará un :exc:`TypeError` (por ejemplo, ``1 in Color``); de manera similar, si se intenta buscar objetos que no sean miembro de la :class:`Flag` se lanzará :exc:`TypeError` (por ejemplo, ``1 in Perm.RW``); actualmente, ambas operaciones devuelven :const:`False` en su lugar.

source: Using non-integer value for selecting a plural form in :mod:`gettext` is now deprecated. It never correctly worked. (Contributed by Serhiy Storchaka in :issue:`28692`.)
es_ec: Usando un valor no entero para seleccionar una forma plural en :mod:`gettext` ahora está en desuso. Nunca funcionó correctamente. (Contribuido por *Serhiy Storchaka* en :issue:`28692`.)

source: The :class:`importlib.abc.ResourceLoader` ABC has been deprecated in favour of :class:`importlib.abc.ResourceReader`.
es_ec: El :class:`importlib.abc.ResourceLoader` ABC ha quedado obsoleto en favor de :class:`importlib.abc.ResourceReader`.

source: :func:`locale.format` has been deprecated, use :meth:`locale.format_string` instead. (Contributed by Garvit in :issue:`10379`.)
es_ec: :func:`locale.format` ha sido obsoleto, en su lugar use :meth:`locale.format_string`. (Contribuido por *Garvit* en :issue:`10379`.)

source: The :mod:`macpath` is now deprecated and will be removed in Python 3.8. (Contributed by Chi Hsuan Yen in :issue:`9850`.)
es_ec: El :mod:`macpath` esta ahora en desuso y se eliminará en Python 3.8. (Contribuido por *Chi Hsuan Yen* en :issue:`9850`.)

source: :mod:`dummy_threading` and :mod:`_dummy_thread` have been deprecated. It is no longer possible to build Python with threading disabled. Use :mod:`threading` instead. (Contributed by Antoine Pitrou in :issue:`31370`.)
es_ec: :mod:`dummy_threading` y :mod:`_dummy_thread` han quedado en desuso. ya no es posible compilar Python con el subproceso desactivado. En lugar use :mod:`threading`. (Contribuido por *Antoine Pitrou* en :issue:`31370`.)

source: The silent argument value truncation in :func:`socket.htons` and :func:`socket.ntohs` has been deprecated. In future versions of Python, if the passed argument is larger than 16 bits, an exception will be raised. (Contributed by Oren Milman in :issue:`28332`.)
es_ec: El truncamiento del valor del argumento silencioso en :func:`socket.htons` y :func:`socket.ntohs` ha quedado en desuso. En futuras versiones de Python, si el argumento pasado es mayor de 16 bits, se lanzará una excepción. (Contribuido por *Oren Milman* en :issue:`28332`.)

source: :func:`ssl.wrap_socket` is deprecated. Use :meth:`ssl.SSLContext.wrap_socket` instead. (Contributed by Christian Heimes in :issue:`28124`.)
es_ec: :func:`ssl.wrap_socket` esta en desuso. En su lugar use :meth:`ssl.SSLContext.wrap_socket`. (Contribuido por *Christian Heimes* en :issue:`28124`.)

source: :func:`sunau.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`sunau.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
es_ec: :func:`sunau.openfp` ha quedado obsoleto y se eliminará en Python 3.9. En lugar use :func:`sunau.open`. (Contribuido por *Brian Curtin* en :issue:`31985`.)

source: Deprecated :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper`.
es_ec: :func:`sys.set_coroutine_wrapper` y :func:`sys.get_coroutine_wrapper` en desuso.

source: The undocumented ``sys.callstats()`` function has been deprecated and will be removed in a future Python version. (Contributed by Victor Stinner in :issue:`28799`.)
es_ec: La función indocumentada ``sys.callstats()`` ha quedado obsoleto y se eliminará en una futura versión de Python. (Contribuido por *Victor Stinner* en :issue:`28799`.)

source: :func:`wave.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`wave.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
es_ec: :func:`wave.openfp` ha quedado obsoleta y sera removida en Python 3.9. En su lugar use :func:`wave.open`. (Contribuido por *Brian Curtin* en :issue:`31985`.)

source: Deprecated functions and types of the C API
es_ec: Funciones y tipos obsoletos de la API C

source: Function :c:func:`PySlice_GetIndicesEx` is deprecated and replaced with a macro if ``Py_LIMITED_API`` is not set or set to a value in the range between ``0x03050400`` and ``0x03060000`` (not inclusive), or is ``0x03060100`` or higher. (Contributed by Serhiy Storchaka in :issue:`27867`.)
es_ec: Función :c:func:`PySlice_GetIndicesEx` está en desuso y se reemplaza con una macro si ``Py_LIMITED_API`` no está configurado o configurado en un valor en el rango entre ``0x03050400`` y ``0x03060000`` (no incluido), o es ``0x03060100`` o superior. (Contribuido por *Serhiy Storchaka* en :issue:`27867`.)

source: :c:func:`PyOS_AfterFork` has been deprecated. Use :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` or :c:func:`PyOS_AfterFork_Child()` instead. (Contributed by Antoine Pitrou in :issue:`16500`.)
es_ec: :c:func:`PyOS_AfterFork` ha quedado obsoleto. En su lugar usar :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` o :c:func:`PyOS_AfterFork_Child()`. (Contribuido por *Antoine Pitrou* en :issue:`16500`.)

source: Platform Support Removals
es_ec: Eliminación de soporte de plataforma

source: FreeBSD 9 and older are no longer officially supported.
es_ec: *FreeBSD* 9 y las versiones anteriores ya no son compatibles oficialmente.

source: For full Unicode support, including within extension modules, \*nix platforms are now expected to provide at least one of ``C.UTF-8`` (full locale), ``C.utf8`` (full locale) or ``UTF-8`` (``LC_CTYPE``-only locale) as an alternative to the legacy ``ASCII``-based ``C`` locale.
es_ec: Para una compatibilidad total con Unicode, incluso dentro de los módulos de extensión, ahora se espera que las plataformas \*nix proporcionen al menos uno de ``C.UTF-8`` (configuración regional completa), ``C.utf8`` (configuración regional completa) o ``UTF-8`` (configuración regional exclusiva de ``LC_CTYPE``) como una alternativa a la configuración regional ``C`` heredada basada en ``ASCII``.

source: OpenSSL 0.9.8 and 1.0.1 are no longer supported, which means building CPython 3.7 with SSL/TLS support on older platforms still using these versions requires custom build options that link to a more recent version of OpenSSL.
es_ec: OpenSSL 0.9.8 y 1.0.1 ya no son compatibles, lo que significa que la compilación de CPython 3.7 con compatibilidad con SSL / TLS en plataformas más antiguas que aún usan estas versiones requiere opciones de compilación personalizadas que se vinculan a una versión más reciente de OpenSSL.

source: Notably, this issue affects the Debian 8 (aka "jessie") and Ubuntu 14.04 (aka "Trusty") LTS Linux distributions, as they still use OpenSSL 1.0.1 by default.
es_ec: En particular, este problema afecta a las distribuciones LTS Linux Debian 8 (también conocido como “jessie”) y *Ubuntu* 14.04 (también conocido como “Trusty”), ya que todavía usan OpenSSL 1.0.1 por defecto.

source: Debian 9 ("stretch") and Ubuntu 16.04 ("xenial"), as well as recent releases of other LTS Linux releases (e.g. RHEL/CentOS 7.5, SLES 12-SP3), use OpenSSL 1.0.2 or later, and remain supported in the default build configuration.
es_ec: Debian 9 (“stretch”) y *Ubuntu* 16.04 (“xenial”), así como las versiones recientes de otras versiones de LTS Linux (por ejemplo, RHEL / CentOS 7.5, SLES 12-SP3), usan OpenSSL 1.0.2 o posterior y siguen siendo compatibles en la configuración de compilación predeterminada.

source: CPython's own `CI configuration file <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ provides an example of using the SSL :source:`compatibility testing infrastructure <Tools/ssl/multissltests.py>` in CPython's test suite to build and link against OpenSSL 1.1.0 rather than an outdated system provided OpenSSL.
es_ec: El propio `CI configuration file <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ de CPython proporciona un ejemplo del uso de SSL :source:`compatibility testing infrastructure <Tools/ssl/multissltests.py>` en el conjunto de pruebas de CPython para crear y vincular OpenSSL 1.1.0 en lugar de un sistema obsoleto proporcionado por OpenSSL.

source: API and Feature Removals
es_ec: Eliminaciones de API y funciones

source: The following features and APIs have been removed from Python 3.7:
es_ec: Las siguientes funciones y API se han eliminado de Python 3.7:

source: The ``os.stat_float_times()`` function has been removed. It was introduced in Python 2.3 for backward compatibility with Python 2.2, and was deprecated since Python 3.1.
es_ec: La función ``os.stat_float_times()`` ha sido removida. Se introdujo en Python 2.3 por compatibilidad con versiones anteriores de Python 2.2 y quedó obsoleto desde Python 3.1.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in replacement templates for :func:`re.sub` were deprecated in Python 3.5, and will now cause an error.
es_ec: Los escapes desconocidos que consisten en ``’\’`` y una letra ASCII en las plantillas de reemplazo para :func:`re.sub` quedaron obsoletos en Python 3.5 y ahora causarán un error.

source: Removed support of the *exclude* argument in :meth:`tarfile.TarFile.add`. It was deprecated in Python 2.7 and 3.2. Use the *filter* argument instead.
es_ec: Se eliminó el soporte del argumento * exclude * en :meth:`tarfile.TarFile.add`. Fue obsoleto en Python 2.7 y 3.2. Utilice el argumento * filtro * en su lugar.

source: The ``splitunc()`` function in the :mod:`ntpath` module was deprecated in Python 3.1, and has now been removed. Use the :func:`~os.path.splitdrive` function instead.
es_ec: La función ``splitunc()`` en el módulo :mod:`ntpath` quedó obsoleto en Python 3.1 y ahora se ha eliminado. Utilice la función :func:`~os.path.splitdrive` en su lugar.

source: :func:`collections.namedtuple` no longer supports the *verbose* parameter or ``_source`` attribute which showed the generated source code for the named tuple class. This was part of an optimization designed to speed-up class creation. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
es_ec: :func:`collections.namedtuple` ya no admite el parámetro *verbose* o el atributo ``_source`` que mostraba el código fuente generado para la clase de tupla nombrada. Esto fue parte de una optimización diseñada para acelerar la creación de clases. (Contribuido por *Jelle Zijlstra* con nuevas mejoras de *INADA Naoki*, *Serhiy Storchaka*, y *Raymond Hettinger* en :issue:`28638`.)

source: Functions :func:`bool`, :func:`float`, :func:`list` and :func:`tuple` no longer take keyword arguments. The first argument of :func:`int` can now be passed only as positional argument.
es_ec: Funciones :func:`bool`, :func:`float`, :func:`list` y :func:`tuple` ya no aceptan argumentos de palabras clave. El primer argumento de :func:`int` ahora solo se puede pasar como argumento posicional.

source: Removed previously deprecated in Python 2.4 classes ``Plist``, ``Dict`` and ``_InternalDict`` in the :mod:`plistlib` module. Dict values in the result of functions :func:`~plistlib.readPlist` and :func:`~plistlib.readPlistFromBytes` are now normal dicts. You no longer can use attribute access to access items of these dictionaries.
es_ec: Eliminado anteriormente en desuso en las clases de Python 2.4 ``Plist``, ``Dict`` y ``_InternalDict`` en el módulo :mod:`plistlib`. Dictar valores en el resultado de funciones :func:`~plistlib.readPlist` y :func:`~plistlib.readPlistFromBytes` ahora son dictados normales. Ya no puede utilizar el acceso a atributos para acceder a elementos de estos diccionarios.

source: The ``asyncio.windows_utils.socketpair()`` function has been removed. Use the :func:`socket.socketpair` function instead, it is available on all platforms since Python 3.5. ``asyncio.windows_utils.socketpair`` was just an alias to ``socket.socketpair`` on Python 3.5 and newer.
es_ec: La función ``asyncio.windows_utils.socketpair()`` ha sido removida. En su lugar use la función :func:`socket.socketpair`, está disponible en todas las plataformas desde Python 3.5. ``asyncio.windows_utils.socketpair`` era un alias para ``socket.socketpair`` en Python 3.5 y mas nuevo.

source: :mod:`asyncio` no longer exports the :mod:`selectors` and :mod:`_overlapped` modules as ``asyncio.selectors`` and ``asyncio._overlapped``. Replace ``from asyncio import selectors`` with ``import selectors``.
es_ec: :mod:`asyncio` ya no exporta el :mod:`selectors` y módulos como :mod:`_overlapped` ``asyncio.selectors`` y ``asyncio._overlapped``. reemplazar por ``from asyncio import selectors`` y ``import selectors``.

source: Direct instantiation of :class:`ssl.SSLSocket` and :class:`ssl.SSLObject` objects is now prohibited. The constructors were never documented, tested, or designed as public constructors. Users were supposed to use :func:`ssl.wrap_socket` or :class:`ssl.SSLContext`. (Contributed by Christian Heimes in :issue:`32951`.)
es_ec: Instanciación directa de objetos :class:`ssl.SSLSocket` y :class:`ssl.SSLObject` ahora está prohibido. Los constructores nunca fueron documentados, probados o diseñados como constructores públicos. Se suponía que los usuarios usaban :func:`ssl.wrap_socket` o :class:`ssl.SSLContext`. (Contribuido por *Christian Heimes* en :issue:`32951`.)

source: Module Removals
es_ec: Eliminaciones de módulos

source: The ``fpectl`` module has been removed. It was never enabled by default, never worked correctly on x86-64, and it changed the Python ABI in ways that caused unexpected breakage of C extensions. (Contributed by Nathaniel J. Smith in :issue:`29137`.)
es_ec: El modulo ``fpectl`` ha sido removido. Nunca se habilitó de forma predeterminada, nunca funcionó correctamente en x86-64 y cambió la ABI de Python de manera que causó la rotura inesperada de las extensiones C. (Contribuido por *Nathaniel J. Smith* en :issue:`29137`.)

source: Windows-only Changes
es_ec: Cambios solo en Windows

source: The python launcher, (py.exe), can accept 32 & 64 bit specifiers **without** having to specify a minor version as well. So ``py -3-32`` and ``py -3-64`` become valid as well as ``py -3.7-32``, also the -*m*-64 and -*m.n*-64 forms are now accepted to force 64 bit python even if 32 bit would have otherwise been used. If the specified version is not available py.exe will error exit. (Contributed by Steve Barnes in :issue:`30291`.)
es_ec: El lanzador de python, (py.exe), puede aceptar especificadores de 32 y 64 bits **sin** tener que especificar también una versión secundaria. Entonces, ``py -3-32`` y ``py -3-64`` se vuelven válidos, así como ``py -3.7-32``, también los -*m*-64 and -*m.n*-64. Los formularios ahora se aceptan para forzar Python de 64 bits incluso si de otro modo se hubieran utilizado 32 bits. Si la versión especificada no está disponible, py.exe saldrá del error. (Contribuido por *Steve Barnes* en :issue:`30291`.)

source: The launcher can be run as ``py -0`` to produce a list of the installed pythons, *with default marked with an asterisk*. Running ``py -0p`` will include the paths. If py is run with a version specifier that cannot be matched it will also print the *short form* list of available specifiers. (Contributed by Steve Barnes in :issue:`30362`.)
es_ec: El lanzador se puede ejecutar como ``py -0`` para producir una lista de las pitones instaladas, *con las marcas predeterminadas con un asterisco*. La ejecución de ``py -0p`` incluirá las rutas. Si py se ejecuta con un especificador de versión que no puede coincidir, también imprimirá la *forma corta* lista de especificadores disponibles. (Contribuido por *Steve Barnes* en :issue:`30362`.)

source: Porting to Python 3.7
es_ec: Portando a Python 3.7

source: This section lists previously described changes and other bugfixes that may require changes to your code.
es_ec: Esta sección enumera los cambios descritos anteriormente y otras correcciones de errores que pueden requerir cambios en su código.

source: Changes in Python Behavior
es_ec: Cambios en el comportamiento de Python

source: :keyword:`async` and :keyword:`await` names are now reserved keywords. Code using these names as identifiers will now raise a :exc:`SyntaxError`. (Contributed by Jelle Zijlstra in :issue:`30406`.)
es_ec: :keyword:`async` y :keyword:`await` los nombres ahora son palabras clave reservadas. El código que usa estos nombres como identificadores lanzará ahora un :exc:`SyntaxError`. (Contribuido por *Jelle Zijlstra* en :issue:`30406`.)

source: :pep:`479` is enabled for all code in Python 3.7, meaning that :exc:`StopIteration` exceptions raised directly or indirectly in coroutines and generators are transformed into :exc:`RuntimeError` exceptions. (Contributed by Yury Selivanov in :issue:`32670`.)
es_ec: :pep:`479` está habilitado para todo el código en Python 3.7, lo que significa que las excepciones de :exc:`StopIteration` generadas directa o indirectamente en corutinas y generadores se transforman en excepciones de :exc:`RuntimeError`. (Contribuido por *Yury Selivanov* en :issue:`32670`.)

source: :meth:`object.__aiter__` methods can no longer be declared as asynchronous. (Contributed by Yury Selivanov in :issue:`31709`.)
es_ec: Los métodos :meth:`object.__aiter__` ya no se pueden declarar cómo asincrónicos. (Contribuido por *Yury Selivanov* en :issue:`31709`.)

source: Due to an oversight, earlier Python versions erroneously accepted the following syntax::
es_ec: Debido a un descuido, las versiones anteriores de Python aceptaron erróneamente la siguiente sintaxis:

source: Python 3.7 now correctly raises a :exc:`SyntaxError`, as a generator expression always needs to be directly inside a set of parentheses and cannot have a comma on either side, and the duplication of the parentheses can be omitted only on calls. (Contributed by Serhiy Storchaka in :issue:`32012` and :issue:`32023`.)
es_ec: Python 3.7 ahora lanza correctamente una :exc:`SyntaxError`, como una expresión generadora siempre debe estar directamente dentro de un conjunto de paréntesis y no puede tener una coma a ambos lados, y la duplicación de los paréntesis solo se puede omitir en las llamadas. (Contribuido por *Serhiy Storchaka* en :issue:`32012` y :issue:`32023`.)
