Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: What's New In Python 3.7
es_ec: Qué hay de nuevo en Python 3.7

source: This article explains the new features in Python 3.7, compared to 3.6. Python 3.7 was released on June 27, 2018. For full details, see the :ref:`changelog <changelog>`.
es_ec: El artículo explica las nuevas características en Python 3.7, comparado con 3.6. Python 3.7 fue lanzado el 27, Junio, 2018. Para más detalles, consultar la :ref:`changelog <changelog>`.

source: Summary -- Release Highlights
es_ec: Resumen -- Lanzamientos Destacados

source: New syntax features:
es_ec: Sintaxis de nuevas características:

source: :ref:`PEP 563 <whatsnew37-pep563>`, postponed evaluation of type annotations.
es_ec: :ref:`PEP 563 <whatsnew37-pep563>`, evaluación pospuesta de anotaciones de tipo.

source: Backwards incompatible syntax changes:
es_ec: Cambios de sintaxis incompatibles hacia atrás:

source: :keyword:`async` and :keyword:`await` are now reserved keywords.
es_ec: :keyword:`async` y :keyword:`await` ahora son palabras clave reservadas.

source: New library modules:
es_ec: Nuevos módulos de biblioteca:

source: :mod:`contextvars`: :ref:`PEP 567 -- Context Variables <whatsnew37-pep567>`
es_ec: :mod:`contextvars`: :ref:`PEP 567 -- Variables de Contexto <whatsnew37-pep567>`

source: :mod:`dataclasses`: :ref:`PEP 557 -- Data Classes <whatsnew37-pep557>`
es_ec: :mod:`dataclasses`: :ref:`PEP 557 -- Clases de Datos <whatsnew37-pep557>`

source: New built-in features:
es_ec: Nuevas funciones integradas:

source: :ref:`PEP 553 <whatsnew37-pep553>`, the new :func:`breakpoint` function.
es_ec: :ref:`PEP 553 <whatsnew37-pep553>`, la nueva función :func:`breakpoint`.

source: Python data model improvements:
es_ec: Mejoras en el modelo de datos de Python:

source: :ref:`PEP 562 <whatsnew37-pep562>`, customization of access to module attributes.
es_ec: :ref:`PEP 562 <whatsnew37-pep562>`, personalización del acceso a los atributos del módulo.

source: :ref:`PEP 560 <whatsnew37-pep560>`, core support for typing module and generic types.
es_ec: :ref:`PEP 560 <whatsnew37-pep560>`, soporte básico para módulo de mecanografía y tipos genéricos.

source: the insertion-order preservation nature of :ref:`dict <typesmapping>` objects `has been declared`_ to be an official part of the Python language spec.
es_ec: la naturaleza de conservación del orden de inserción de objetos :ref:`dict <typesmapping>` `han sido declarado`_ para ser una parte oficial de la especificación del lenguaje Python.

source: Significant improvements in the standard library:
es_ec: Mejoras significativas in la librería estándar:

source: The :mod:`asyncio` module has received new features, significant :ref:`usability and performance improvements <whatsnew37_asyncio>`.
es_ec: El modulo :mod:`asyncio` ha recibido nuevas funciones, significativas :ref:`mejoras de usabilidad y rendimiento <whatsnew37_asyncio>`.

source: The :mod:`time` module gained support for :ref:`functions with nanosecond resolution <whatsnew37-pep564>`.
es_ec: El modulo :mod:`time` adquirió soporte de :ref:`funciones con resolución de nanosegundos <whatsnew37-pep564>`.

source: CPython implementation improvements:
es_ec: Mejoras en la implementación de CPython:

source: Avoiding the use of ASCII as a default text encoding:
es_ec: Evitando el uso de ASCII como codificación de texto predeterminada:

source: :ref:`PEP 538 <whatsnew37-pep538>`, legacy C locale coercion
es_ec: :ref:`PEP 538 <whatsnew37-pep538>`, coerción de configuración regional de C heredada

source: :ref:`PEP 540 <whatsnew37-pep540>`, forced UTF-8 runtime mode
es_ec: :ref:`PEP 540 <whatsnew37-pep540>`, modo de tiempo de ejecución UTF-8 forzado

source: :ref:`PEP 552 <whatsnew37-pep552>`, deterministic .pycs
es_ec: :ref:`PEP 552 <whatsnew37-pep552>`, determinista *.pycs*

source: :ref:`New Python Development Mode <whatsnew37-devmode>`
es_ec: :ref:`El nuevo modo de ejecución de desarrollo <whatsnew37-devmode>`

source: :ref:`PEP 565 <whatsnew37-pep565>`, improved :exc:`DeprecationWarning` handling
es_ec: :ref:`PEP 565 <whatsnew37-pep565>`, manejo mejorado :exc:`DeprecationWarning`

source: C API improvements:
es_ec: Mejoras en la API de C:

source: :ref:`PEP 539 <whatsnew37-pep539>`, new C API for thread-local storage
es_ec: :ref:`PEP 539 <whatsnew37-pep539>`, nueva API de C para almacenamiento local de subprocesos

source: Documentation improvements:
es_ec: Mejoras de Documentación:

source: :ref:`PEP 545 <whatsnew37-pep545>`, Python documentation translations
es_ec: :ref:`PEP 545 <whatsnew37-pep545>`, Traducción de documentación de Python

source: New documentation translations: `Japanese <https://docs.python.org/ja/>`_, `French <https://docs.python.org/fr/>`_, and `Korean <https://docs.python.org/ko/>`_.
es_ec: Nuevas traducciones de documentación: `Japonés <https://docs.python.org/ja/>`_, `Francés <https://docs.python.org/fr/>`_, y `Coreano <https://docs.python.org/ko/>`_.

source: This release features notable performance improvements in many areas. The :ref:`whatsnew37-perf` section lists them in detail.
es_ec: Esta versión presenta notables mejoras de rendimiento en muchas áreas. La sección :ref:`whatsnew37-perf` los enumera en detalle.

source: For a list of changes that may affect compatibility with previous Python releases please refer to the :ref:`porting-to-python-37` section.
es_ec: Para obtener una lista de cambios que pueden afectar la compatibilidad con versiones anteriores de Python por favor consultar la sección :ref:`porting-to-python-37`.

source: New Features
es_ec: Nuevas Características

source: PEP 563: Postponed Evaluation of Annotations
es_ec: PEP 563: Evaluación pospuesta de anotaciones

source: The advent of type hints in Python uncovered two glaring usability issues with the functionality of annotations added in :pep:`3107` and refined further in :pep:`526`:
es_ec: La llegada de las sugerencias de tipo en Python descubrió dos problemas de usabilidad evidentes con la funcionalidad de las anotaciones agregadas en :pep:`3107` y mas refinado en :pep:`526`:

source: annotations could only use names which were already available in the current scope, in other words they didn't support forward references of any kind; and
es_ec: las anotaciones solo podían usar nombres que ya estaban disponibles en el alcance actual, en otras palabras, no admitían referencias futuras de ningún tipo; y

source: annotating source code had adverse effects on startup time of Python programs.
es_ec: anotar el código fuente tuvo efectos adversos en el tiempo de inicio de los programas Python.

source: Both of these issues are fixed by postponing the evaluation of annotations. Instead of compiling code which executes expressions in annotations at their definition time, the compiler stores the annotation in a string form equivalent to the AST of the expression in question. If needed, annotations can be resolved at runtime using :func:`typing.get_type_hints`. In the common case where this is not required, the annotations are cheaper to store (since short strings are interned by the interpreter) and make startup time faster.
es_ec: Ambos problemas se solucionan posponiendo la evaluación de anotaciones. En lugar de compilar código que ejecuta expresiones en anotaciones en su momento de definición, el compilador almacena la anotación en forma de cadena equivalente al AST de la expresión en cuestión. Si es necesario, las anotaciones se pueden resolver en tiempo de ejecución usando :func:`typing.get_type_hints`. En el común de los casos esto no es necesario, las anotaciones son más fáciles de almacenar (dado que las cadenas cortas son internadas por el intérprete.) y hacen que el tiempo de inicio sea mas rápido.

source: Usability-wise, annotations now support forward references, making the following syntax valid::
es_ec: En términos de usabilidad, las anotaciones ahora admiten referencias hacia adelante, lo que hace que la siguiente sintaxis sea válida:

source: Since this change breaks compatibility, the new behavior needs to be enabled on a per-module basis in Python 3.7 using a :mod:`__future__` import::
es_ec: Dado que este cambio rompe la compatibilidad, el nuevo comportamiento debe habilitarse por modulo en Python 3.7 usando una importación :mod:`__future__`:

source: It will become the default in Python 3.10.
es_ec: Se convertirá en el predeterminado en Python 3.10.

source: :pep:`563` -- Postponed evaluation of annotations
es_ec: :pep:`563` -- Evaluación aplazada de anotaciones

source: PEP written and implemented by Łukasz Langa.
es_ec: PEP escrito y implementado por *Łukasz Langa*.

source: PEP 538: Legacy C Locale Coercion
es_ec: PEP 538: Coerción de configuración regional del Legado de C

source: An ongoing challenge within the Python 3 series has been determining a sensible default strategy for handling the "7-bit ASCII" text encoding assumption currently implied by the use of the default C or POSIX locale on non-Windows platforms.
es_ec: Un desafío continuo dentro de la serie Python 3 ha sido determinar una estrategia predeterminada sensata para manejar el supuesto de codificación de texto “ASCII de 7 bits” implícito actualmente en el uso de la configuración regional C o POSIX predeterminada en plataformas que no son Windows.

source: :pep:`538` updates the default interpreter command line interface to automatically coerce that locale to an available UTF-8 based locale as described in the documentation of the new :envvar:`PYTHONCOERCECLOCALE` environment variable. Automatically setting ``LC_CTYPE`` this way means that both the core interpreter and locale-aware C extensions (such as :mod:`readline`) will assume the use of UTF-8 as the default text encoding, rather than ASCII.
es_ec: :pep:`538` actualiza la interfaz de línea de comandos del intérprete predeterminada para convertir automáticamente esa configuración regional en una configuración regional basada en UTF-8 disponible, como se describe en la documentación de la nueva variable de entorno :envvar:`PYTHONCOERCECLOCALE`. Configurar automáticamente ``LC_CTYPE`` de esta manera significa que tanto el intérprete central como las extensiones C que reconocen la configuración regional (por ejemplo :mod:`readline`) asumirá el uso de UTF-8 como codificación de texto predeterminada, en lugar de ASCII.

source: The platform support definition in :pep:`11` has also been updated to limit full text handling support to suitably configured non-ASCII based locales.
es_ec: La definición de soporte de plataforma en :pep:`11` también se ha actualizado para limitar la compatibilidad con el manejo de texto completo a configuraciones regionales no basadas en ASCII configuradas adecuadamente.

source: As part of this change, the default error handler for :data:`~sys.stdin` and :data:`~sys.stdout` is now ``surrogateescape`` (rather than ``strict``) when using any of the defined coercion target locales (currently ``C.UTF-8``, ``C.utf8``, and ``UTF-8``). The default error handler for :data:`~sys.stderr` continues to be ``backslashreplace``, regardless of locale.
es_ec: Como parte de este cambio, el controlador de errores predeterminado para :data:`~sys.stdin` y :data:`~sys.stdout` es ahora ``surrogateescape`` (antes que ``strict``) al usar cualquiera de las configuraciones regionales de destino de coerción definidas (actualmente ``C.UTF-8``, ``C.utf8``, y ``UTF-8``). El controlador de errores predeterminado para :data:`~sys.stderr` continua siendo ``backslashreplace``, independientemente de local.

source: Locale coercion is silent by default, but to assist in debugging potentially locale related integration problems, explicit warnings (emitted directly on :data:`~sys.stderr`) can be requested by setting ``PYTHONCOERCECLOCALE=warn``. This setting will also cause the Python runtime to emit a warning if the legacy C locale remains active when the core interpreter is initialized.
es_ec: La coerción local es silenciosa de forma predeterminada, pero para ayudar a depurar problemas de integración potencialmente relacionados con la configuración regional, advertencias explícitas (emitido directamente en :data:`~sys.stderr`) se puede solicitar configurando ``PYTHONCOERCECLOCALE=warn``. Esta configuración también hará que el tiempo de ejecución de Python emita una advertencia si la configuración regional C heredada permanece activa cuando se inicializa el intérprete principal.

source: While :pep:`538`'s locale coercion has the benefit of also affecting extension modules (such as GNU ``readline``), as well as child processes (including those running non-Python applications and older versions of Python), it has the downside of requiring that a suitable target locale be present on the running system. To better handle the case where no suitable target locale is available (as occurs on RHEL/CentOS 7, for example), Python 3.7 also implements :ref:`whatsnew37-pep540`.
es_ec: Mientras la coerción local :pep:`538` tiene la ventaja de afectar también a los módulos de extensión (como GNU ``readline``), así como procesos secundarios (incluidos los que ejecutan aplicaciones que no son de Python y versiones anteriores de Python), tiene la desventaja de requerir que esté presente una ubicación de destino adecuada en el sistema en ejecución. Para manejar mejor el caso en el que no hay una configuración regional de destino adecuada disponible (como ocurre en RHEL / CentOS 7, por ejemplo), Python 3.7 también implementa :ref:`whatsnew37-pep540`.

source: :pep:`538` -- Coercing the legacy C locale to a UTF-8 based locale
es_ec: :pep:`538` -- Coaccionar la configuración regional C heredada a una configuración regional basada en UTF-8

source: PEP written and implemented by Nick Coghlan.
es_ec: PEP escrito y implementado por *Nick Coghlan*.

source: PEP 540: Forced UTF-8 Runtime Mode
es_ec: PEP 540: Modo de tiempo de ejecución UTF-8 forzado

source: The new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable can be used to enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
es_ec: La nueva opción de lineas de comando :option:`-X` ``utf8`` y la variable de entorno :envvar:`PYTHONUTF8` se puede utilizar para habilitar el :ref:`modo Python UTF-8 <utf8-mode>`.

source: When in UTF-8 mode, CPython ignores the locale settings, and uses the UTF-8 encoding by default. The error handlers for :data:`sys.stdin` and :data:`sys.stdout` streams are set to ``surrogateescape``.
es_ec: Cuando está en modo UTF-8, CPython ignora la configuración regional y usa la codificación UTF-8 de forma predeterminada. Los controladores de errores para los flujos :data:`sys.stdin` y :data:`sys.stdout` se establecen en ``surrogateescape``.

source: The forced UTF-8 mode can be used to change the text handling behavior in an embedded Python interpreter without changing the locale settings of an embedding application.
es_ec: El modo UTF-8 forzado se puede usar para cambiar el comportamiento de manejo de texto en un intérprete de Python integrado sin cambiar la configuración regional de una aplicación de inserción.

source: While :pep:`540`'s UTF-8 mode has the benefit of working regardless of which locales are available on the running system, it has the downside of having no effect on extension modules (such as GNU ``readline``), child processes running non-Python applications, and child processes running older versions of Python. To reduce the risk of corrupting text data when communicating with such components, Python 3.7 also implements :ref:`whatsnew37-pep540`).
es_ec: Mientras el modo UTF-8 :pep:`540` tiene la ventaja de funcionar independientemente de las configuraciones regionales disponibles en el sistema en ejecución, tiene la desventaja de no tener ningún efecto en los módulos de extensión (como GNU ``readline``), procesos secundarios que ejecutan aplicaciones que no son de Python y procesos secundarios que ejecutan versiones anteriores de Python. Para reducir el riesgo de dañar los datos de texto al comunicarse con dichos componentes, Python 3.7 también implementa :ref:`whatsnew37-pep540`.

source: The UTF-8 mode is enabled by default when the locale is ``C`` or ``POSIX``, and the :pep:`538` locale coercion feature fails to change it to a UTF-8 based alternative (whether that failure is due to ``PYTHONCOERCECLOCALE=0`` being set, ``LC_ALL`` being set, or the lack of a suitable target locale).
es_ec: El modo UTF-8 está habilitado de forma predeterminada cuando la configuración regional es ``C`` o ``POSIX``, y la función de coerción local :pep:`538` no lo cambia a una alternativa basada en UTF-8 (si ese fallo se debe a que se ha establecido ``PYTHONCOERCECLOCALE=0``, ``LC_ALL`` se esta configurando, o la falta de un lugar de destino adecuado).

source: :pep:`540` -- Add a new UTF-8 mode
es_ec: :pep:`540` -- Agrega un nuevo modo UTF-8

source: PEP written and implemented by Victor Stinner
es_ec: PEP escrito y implementado por *Victor Stinner*

source: PEP 553: Built-in ``breakpoint()``
es_ec: PEP 553: Incorporada en ``breakpoint()``

source: Python 3.7 includes the new built-in :func:`breakpoint` function as an easy and consistent way to enter the Python debugger.
es_ec: Python 3.7 incluye la nueva función incorporada :func:`breakpoint` como una forma fácil y consistente de ingresar al depurador de Python.

source: Built-in ``breakpoint()`` calls :func:`sys.breakpointhook`. By default, the latter imports :mod:`pdb` and then calls ``pdb.set_trace()``, but by binding ``sys.breakpointhook()`` to the function of your choosing, ``breakpoint()`` can enter any debugger. Additionally, the environment variable :envvar:`PYTHONBREAKPOINT` can be set to the callable of your debugger of choice. Set ``PYTHONBREAKPOINT=0`` to completely disable built-in ``breakpoint()``.
es_ec: Llamadas ``breakpoint()`` incorporadas en :func:`sys.breakpointhook`. Por defecto, este último importa :mod:`pdb` y luego llama ``pdb.set_trace()``, pero vinculando ``sys.breakpointhook()`` a la función de su elección, ``breakpoint()`` puede entrar en cualquier depurador. Adicionalmente, la variable de entorno :envvar:`PYTHONBREAKPOINT` se puede configurar como el depurador que elija. Configure ``PYTHONBREAKPOINT=0`` para deshabilitar completamente el ``breakpoint()``.

source: :pep:`553` -- Built-in breakpoint()
es_ec: :pep:`553` -- Incorporada en *breakpoint()*

source: PEP written and implemented by Barry Warsaw
es_ec: PEP escrito y implementado por *Barry Warsaw*

source: PEP 539: New C API for Thread-Local Storage
es_ec: PEP 539: Nueva API C para almacenamiento local de subprocesos

source: While Python provides a C API for thread-local storage support; the existing :ref:`Thread Local Storage (TLS) API <thread-local-storage-api>` has used :c:expr:`int` to represent TLS keys across all platforms. This has not generally been a problem for officially support platforms, but that is neither POSIX-compliant, nor portable in any practical sense.
es_ec: Mientras que Python proporciona una API C para soporte de almacenamiento local de subprocesos; el :ref:`Thread Local Storage (TLS) API <thread-local-storage-api>` existente ha usado :c:expr:`int` para representar claves TLS en todas las plataformas. En general, esto no ha sido un problema para las plataformas de soporte oficial, pero no es compatible con POSIX ni portátil en ningún sentido práctico.

source: :pep:`539` changes this by providing a new :ref:`Thread Specific Storage (TSS) API <thread-specific-storage-api>` to CPython which supersedes use of the existing TLS API within the CPython interpreter, while deprecating the existing API. The TSS API uses a new type :c:type:`Py_tss_t` instead of :c:expr:`int` to represent TSS keys--an opaque type the definition of which may depend on the underlying TLS implementation. Therefore, this will allow to build CPython on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`.
es_ec: :pep:`539` cambia esto al proporcionar un nuevo :ref:`Thread Specific Storage (TSS) API <thread-specific-storage-api>` a CPython que reemplaza el uso de la API TLS existente dentro del intérprete de CPython, al tiempo que deja obsoleta la API existente. La API de TSS utiliza un nuevo tipo :c:type:`Py_tss_t` en lugar de :c:expr:`int` para representar claves TSS, un tipo opaco cuya definición puede depender de la implementación de TLS subyacente. Por lo tanto, esto permitirá compilar CPython en plataformas donde la clave TLS nativa se define de una manera que no se puede convertir de manera segura a :c:expr:`int`.

source: Note that on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`, all functions of the existing TLS API will be no-op and immediately return failure. This indicates clearly that the old API is not supported on platforms where it cannot be used reliably, and that no effort will be made to add such support.
es_ec: Tenga en cuenta que en las plataformas en las que la clave TLS nativa se define de una manera que no se puede convertir de forma segura a :c:expr:`int`, todas las funciones de la API de TLS existente no funcionarán e inmediatamente devolverán un error. Esto indica claramente que la antigua API no es compatible con plataformas en las que no se puede usar de manera confiable y que no se hará ningún esfuerzo para agregar dicho soporte.

source: :pep:`539` -- A New C-API for Thread-Local Storage in CPython
es_ec: :pep:`539` -- Un nueva *API-C* para almacenamiento local de subprocesos en *CPython*

source: PEP written by Erik M. Bray; implementation by Masayuki Yamamoto.
es_ec: PEP escrito por *Erik M. Bray*; implementación por *Masayuki Yamamoto*.

source: PEP 562: Customization of Access to Module Attributes
es_ec: PEP 562: Personalización del acceso a los atributos del módulo

source: Python 3.7 allows defining :meth:`__getattr__` on modules and will call it whenever a module attribute is otherwise not found. Defining :meth:`__dir__` on modules is now also allowed.
es_ec: Python 3.7 permite definir :meth:`__getattr__` en módulos y lo llamará siempre que no se encuentre un atributo de módulo. Definir :meth:`__dir__` en modules ahora también esta permitido.

source: A typical example of where this may be useful is module attribute deprecation and lazy loading.
es_ec: Un ejemplo típico de dónde esto puede ser útil es la desaprobación de los atributos del módulo y la carga diferida.

source: :pep:`562` -- Module ``__getattr__`` and ``__dir__``
es_ec: :pep:`562` -- Módulo ``__getattr__`` y ``__dir__``

source: PEP written and implemented by Ivan Levkivskyi
es_ec: PEP escrito y implementado por *Ivan Levkivskyi*

source: PEP 564: New Time Functions With Nanosecond Resolution
es_ec: PEP 564: Nuevas funciones de tiempo con resolución de nanosegundos

source: The resolution of clocks in modern systems can exceed the limited precision of a floating point number returned by the :func:`time.time` function and its variants. To avoid loss of precision, :pep:`564` adds six new "nanosecond" variants of the existing timer functions to the :mod:`time` module:
es_ec: La resolución de los relojes en los sistemas modernos puede exceder la precisión limitada de un número de punto flotante devuelto por la función :func:`time.time` y sus variantes. Para evitar la pérdida de precisión, :pep:`564` agrega seis nuevas variantes de “nanosegundos” de las funciones de temporizador existentes para el módulo :mod:`time`:

source: The new functions return the number of nanoseconds as an integer value.
es_ec: Las nuevas funciones devuelven el número de nanosegundos como un valor entero.
