Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: A new API for thread-local storage has been implemented. See :ref:`whatsnew37-pep539` for an overview and :ref:`thread-specific-storage-api` for a complete reference. (Contributed by Masayuki Yamamoto in :issue:`25658`.)
es_ec: Se implementó una nueva API para el almacenamiento local de subprocesos. Ver :ref:`whatsnew37-pep539` para una descripción general y :ref:`thread-specific-storage-api` para una referencia completa. (Contribuido por *Masayuki Yamamoto* en :issue:`25658`.)

source: The new :ref:`context variables <whatsnew37-pep567>` functionality exposes a number of :ref:`new C APIs <contextvarsobjects>`.
es_ec: La nueva funcionalidad :ref:`variables de contexto <whatsnew37-pep567>` expone un numero de :ref:`nuevas APIs C <contextvarsobjects>`.

source: The new :c:func:`PyImport_GetModule` function returns the previously imported module with the given name. (Contributed by Eric Snow in :issue:`28411`.)
es_ec: La nueva función :c:func:`PyImport_GetModule` devuelve el módulo previamente importado con el nombre dado. (Contribuido por *Eric Snow* en :issue:`28411`.)

source: The new :c:macro:`Py_RETURN_RICHCOMPARE` macro eases writing rich comparison functions. (Contributed by Petr Victorin in :issue:`23699`.)
es_ec: El nuevo macro :c:macro:`Py_RETURN_RICHCOMPARE` facilita la escritura de funciones de comparación enriquecidas. (Contribuido por *Petr Victorin* en :issue:`23699`.)

source: The new :c:macro:`Py_UNREACHABLE` macro can be used to mark unreachable code paths. (Contributed by Barry Warsaw in :issue:`31338`.)
es_ec: El nuevo macro :c:macro:`Py_UNREACHABLE` se puede utilizar para marcar rutas de código inalcanzables. (Contribuido por *Barry Warsaw* en :issue:`31338`.)

source: The :mod:`tracemalloc` now exposes a C API through the new :c:func:`PyTraceMalloc_Track` and :c:func:`PyTraceMalloc_Untrack` functions. (Contributed by Victor Stinner in :issue:`30054`.)
es_ec: El :mod:`tracemalloc` ahora expone una API C a través de las nuevas funciones :c:func:`PyTraceMalloc_Track` y :c:func:`PyTraceMalloc_Untrack`. (Contribuido por *Victor Stinner* en :issue:`30054`.)

source: The new :c:func:`import__find__load__start` and :c:func:`import__find__load__done` static markers can be used to trace module imports. (Contributed by Christian Heimes in :issue:`31574`.)
es_ec: Los nuevos marcadores estáticos :c:func:`import__find__load__start` y :c:func:`import__find__load__done` se pueden usar para rastrear las importaciones de módulos. (Contribuido por *Christian Heimes* en :issue:`31574`.)

source: The result of :c:func:`PyUnicode_AsUTF8AndSize` and :c:func:`PyUnicode_AsUTF8` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`28769`.)
es_ec: El resultado de :c:func:`PyUnicode_AsUTF8AndSize` y :c:func:`PyUnicode_AsUTF8` es ahora de tipo ``const char *`` en lugar de ``char *``. (Contribuido por *Serhiy Storchaka* en :issue:`28769`.)

source: The result of :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` and :c:func:`PyMapping_Items` is now always a list, rather than a list or a tuple. (Contributed by Oren Milman in :issue:`28280`.)
es_ec: El resultado de :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` y :c:func:`PyMapping_Items` ahora es siempre una lista, en lugar de una lista o una tupla. (Contribuido por *Oren Milman* en :issue:`28280`.)

source: Added functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
es_ec: Funciones agregadas :c:func:`PySlice_Unpack` y :c:func:`PySlice_AdjustIndices`. (Contribuido por *Serhiy Storchaka* en :issue:`27867`.)

source: :c:func:`PyOS_AfterFork` is deprecated in favour of the new functions :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`. (Contributed by Antoine Pitrou in :issue:`16500`.)
es_ec: :c:func:`PyOS_AfterFork` está en desuso en favor de las nuevas funciones :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` y :c:func:`PyOS_AfterFork_Child`. (Contribuido por *Antoine Pitrou* en :issue:`16500`.)

source: The ``PyExc_RecursionErrorInst`` singleton that was part of the public API has been removed as its members being never cleared may cause a segfault during finalization of the interpreter. Contributed by Xavier de Gaye in :issue:`22898` and :issue:`30697`.
es_ec: El único ``PyExc_RecursionErrorInst`` que formaba parte de la API pública se ha eliminado ya que sus miembros nunca borrados pueden causar un error de segmentación durante la finalización del intérprete. Contribuido por *Xavier de Gaye* en :issue:`22898` y :issue:`30697`.

source: Added C API support for timezones with timezone constructors :c:func:`PyTimeZone_FromOffset` and :c:func:`PyTimeZone_FromOffsetAndName`, and access to the UTC singleton with :c:data:`PyDateTime_TimeZone_UTC`. Contributed by Paul Ganssle in :issue:`10381`.
es_ec: Se agregó compatibilidad con C API para zonas horarias con constructores de zonas horarias :c:func:`PyTimeZone_FromOffset` and :c:func:`PyTimeZone_FromOffsetAndName`, y acceso único al UTC con :c:data:`PyDateTime_TimeZone_UTC`. Contribuido por *Paul Ganssle* en :issue:`10381`.

source: The type of results of :c:func:`PyThread_start_new_thread` and :c:func:`PyThread_get_thread_ident`, and the *id* parameter of :c:func:`PyThreadState_SetAsyncExc` changed from :c:expr:`long` to :c:expr:`unsigned long`. (Contributed by Serhiy Storchaka in :issue:`6532`.)
es_ec: El tipo de resultados de :c:func:`PyThread_start_new_thread` y :c:func:`PyThread_get_thread_ident`, y el parámetro *id* de :c:func:`PyThreadState_SetAsyncExc` cambió de :c:expr:`long` a :c:expr:`unsigned long`. (Aportado por Serhiy Storchaka en :issue:`6532`.)

source: :c:func:`PyUnicode_AsWideCharString` now raises a :exc:`ValueError` if the second argument is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters. (Contributed by Serhiy Storchaka in :issue:`30708`.)
es_ec: :c:func:`PyUnicode_AsWideCharString` ahora genera un :exc:`ValueError` si el segundo argumento es ``NULL`` y la cadena :c:expr:`wchar_t*` contiene caracteres nulos. (Aportado por Serhiy Storchaka en :issue:`30708`.)

source: Changes to the startup sequence and the management of dynamic memory allocators mean that the long documented requirement to call :c:func:`Py_Initialize` before calling most C API functions is now relied on more heavily, and failing to abide by it may lead to segfaults in embedding applications. See the :ref:`porting-to-python-37` section in this document and the :ref:`pre-init-safe` section in the C API documentation for more details.
es_ec: Los cambios en la secuencia de inicio y la gestión de los asignadores de memoria dinámica significan que el requisito documentado durante mucho tiempo de llamar :c:func:`Py_Initialize` antes de llamar a la mayoría de las funciones de la API de C, ahora se confía más en él, y no cumplirlo puede provocar errores de segmentación en las aplicaciones integradas. Ver la sección :ref:`porting-to-python-37` en este documento y en la sección :ref:`pre-init-safe` en la documentación de la API de C para obtener más detalles.

source: The new :c:func:`PyInterpreterState_GetID` returns the unique ID for a given interpreter. (Contributed by Eric Snow in :issue:`29102`.)
es_ec: El nuevo: c: func :c:func:`PyInterpreterState_GetID` devuelve él ID único para un intérprete dado. (Contribuido por *Eric Snow* en :issue:`29102`.)

source: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` now use the UTF-8 encoding when the :ref:`UTF-8 mode <whatsnew37-pep540>` is enabled. (Contributed by Victor Stinner in :issue:`29240`.)
es_ec: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` ahora usa la codificación UTF-8 cuando el :ref:`modo UTF-8 <whatsnew37-pep540>` esta habilitado. (Contribuido por *Victor Stinner* en :issue:`29240`.)

source: :c:func:`PyUnicode_DecodeLocaleAndSize` and :c:func:`PyUnicode_EncodeLocale` now use the current locale encoding for ``surrogateescape`` error handler. (Contributed by Victor Stinner in :issue:`29240`.)
es_ec: :c:func:`PyUnicode_DecodeLocaleAndSize` y :c:func:`PyUnicode_EncodeLocale` ahora usan la codificación local actual para el controlador de errores ``surrogateescape``. (Contribuido por *Victor Stinner* en :issue:`29240`.)

source: The *start* and *end* parameters of :c:func:`PyUnicode_FindChar` are now adjusted to behave like string slices. (Contributed by Xiang Zhang in :issue:`28822`.)
es_ec: Los parámetros *start* y *end* de :c:func:`PyUnicode_FindChar` ahora se ajustan para comportarse como cortes de cuerda. (Contribuido por *Xiang Zhang* en :issue:`28822`.)

source: Build Changes
es_ec: Construir cambios

source: Support for building ``--without-threads`` has been removed. The :mod:`threading` module is now always available. (Contributed by Antoine Pitrou in :issue:`31370`.).
es_ec: Se ha eliminado el soporte para construir ``—without-threads``. El módulo :mod:`threading` ahora está siempre disponible. (Contribuido por *Antoine Pitrou* en :issue:`31370`.).

source: A full copy of libffi is no longer bundled for use when building the :mod:`_ctypes <ctypes>` module on non-OSX UNIX platforms. An installed copy of libffi is now required when building ``_ctypes`` on such platforms. (Contributed by Zachary Ware in :issue:`27979`.)
es_ec: Ya no se incluye una copia completa de *libffi* para su uso al compilar el módulo :mod:`_ctypes <ctypes>` en plataformas que no son OSX UNIX. Ahora se requiere una copia instalada de *libffi* al construir ``_ctypes`` en tales plataformas. (Contribuido por *Zachary Ware* en :issue:`27979`.)

source: The Windows build process no longer depends on Subversion to pull in external sources, a Python script is used to download zipfiles from GitHub instead. If Python 3.6 is not found on the system (via ``py -3.6``), NuGet is used to download a copy of 32-bit Python for this purpose. (Contributed by Zachary Ware in :issue:`30450`.)
es_ec: El proceso de compilación de Windows ya no depende de una sub versión para extraer fuentes externas; en su lugar, se usa un script de Python para descargar archivos zip desde GitHub. Si no se encuentra Python 3.6 en el sistema (a través de ``py -3.6``), *NuGet* se usa para descargar una copia de Python de 32 bits para este propósito. (Contribuido por *Zachary Ware* en :issue:`30450`.)

source: The :mod:`ssl` module requires OpenSSL 1.0.2 or 1.1 compatible libssl. OpenSSL 1.0.1 has reached end of lifetime on 2016-12-31 and is no longer supported. LibreSSL is temporarily not supported as well. LibreSSL releases up to version 2.6.4 are missing required OpenSSL 1.0.2 APIs.
es_ec: El módulo :mod:`ssl` requiere *libssl* compatible con OpenSSL 1.0.2 o 1.1. OpenSSL 1.0.1 llegó al final de su vida útil el 31 de diciembre de 2016 y ya no es compatible. LibreSSL tampoco es compatible temporalmente. Las versiones de LibreSSL hasta la versión 2.6.4 carecen de las API de OpenSSL 1.0.2 necesarias.

source: Optimizations
es_ec: Optimizaciones

source: The overhead of calling many methods of various standard library classes implemented in C has been significantly reduced by porting more code to use the ``METH_FASTCALL`` convention. (Contributed by Victor Stinner in :issue:`29300`, :issue:`29507`, :issue:`29452`, and :issue:`29286`.)
es_ec: La sobrecarga de llamar a muchos métodos de varias clases de biblioteca estándar implementadas en C se ha reducido significativamente al portar más código para usar la convención ``METH_FASTCALL``. (Contribuido por *Victor Stinner* en :issue:`29300`, :issue:`29507`, :issue:`29452`, y :issue:`29286`.)

source: Various optimizations have reduced Python startup time by 10% on Linux and up to 30% on macOS. (Contributed by Victor Stinner, INADA Naoki in :issue:`29585`, and Ivan Levkivskyi in :issue:`31333`.)
es_ec: Varias optimizaciones han reducido el tiempo de inicio de Python en un 10% en Linux y hasta en un 30% en macOS. (Contribuido por *Victor Stinner*, *INADA Naoki* en :issue:`29585`, y *Ivan Levkivskyi* en :issue:`31333`.)

source: Method calls are now up to 20% faster due to the bytecode changes which avoid creating bound method instances. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26110`.)
es_ec: Las llamadas a métodos ahora son hasta un 20% más rápidas debido a los cambios de código de bytes que evitan la creación de instancias de métodos enlazados. (Contribuidos por *Yury Selivanov* y *INADA Naoki* en :issue:`26110`.)

source: The :mod:`asyncio` module received a number of notable optimizations for commonly used functions:
es_ec: El módulo :mod:`asyncio` recibió una serie de optimizaciones notables para funciones de uso común:

source: The :func:`asyncio.get_event_loop` function has been reimplemented in C to make it up to 15 times faster. (Contributed by Yury Selivanov in :issue:`32296`.)
es_ec: La función :func:`asyncio.get_event_loop` se ha vuelto a implementar en C para hacerlo hasta 15 veces más rápido. (Contribuido por *Yury Selivanov* en :issue:`32296`.)

source: :class:`asyncio.Future` callback management has been optimized. (Contributed by Yury Selivanov in :issue:`32348`.)
es_ec: Se ha optimizado la gestión de devolución de llamada :class:`asyncio.Future`. (Contribuido por *Yury Selivanov* en :issue:`32348`.)

source: :func:`asyncio.gather` is now up to 15% faster. (Contributed by Yury Selivanov in :issue:`32355`.)
es_ec: :func:`asyncio.gather` ahora es hasta un 15% más rápido. (Contribuido por *Yury Selivanov* en :issue:`32355`.)

source: :func:`asyncio.sleep` is now up to 2 times faster when the *delay* argument is zero or negative. (Contributed by Andrew Svetlov in :issue:`32351`.)
es_ec: :func:`asyncio.sleep` ahora es hasta 2 veces más rápido cuando el argumento *delay* es cero o negativo. (Contribuido por *Andrew Svetlov* en :issue:`32351`.)

source: The performance overhead of asyncio debug mode has been reduced. (Contributed by Antoine Pitrou in :issue:`31970`.)
es_ec: Se ha reducido la sobrecarga de rendimiento del modo de depuración asyncio. (Contribuido por *Antoine Pitrou* en :issue:`31970`.)

source: As a result of :ref:`PEP 560 work <whatsnew37-pep560>`, the import time of :mod:`typing` has been reduced by a factor of 7, and many typing operations are now faster. (Contributed by Ivan Levkivskyi in :issue:`32226`.)
es_ec: Como resultado de :ref:`PEP 560 trabajo <whatsnew37-pep560>`, el tiempo de importación de :mod:`typing` se ha reducido en un factor de 7, y muchas operaciones de mecanografía ahora son más rápidas. (Contribuido por *Ivan Levkivskyi* en :issue:`32226`.)

source: :func:`sorted` and :meth:`list.sort` have been optimized for common cases to be up to 40-75% faster. (Contributed by Elliot Gorokhovsky in :issue:`28685`.)
es_ec: :func:`sorted` y :meth:`list.sort` se han optimizado para que los casos comunes sean hasta un 40-75% más rápidos. (Contribuido por *Elliot Gorokhovsky* en :issue:`28685`.)

source: :meth:`dict.copy` is now up to 5.5 times faster. (Contributed by Yury Selivanov in :issue:`31179`.)
es_ec: :meth:`dict.copy` es ahora 5.5 veces más rápido. (Contribuido por *Yury Selivanov* en :issue:`31179`.)

source: :func:`hasattr` and :func:`getattr` are now about 4 times faster when *name* is not found and *obj* does not override :meth:`object.__getattr__` or :meth:`object.__getattribute__`. (Contributed by INADA Naoki in :issue:`32544`.)
es_ec: :func:`hasattr` y :func:`getattr` ahora son aproximadamente 4 veces más rápidos cuando *name* no se encuentra y *obj* no se anula :meth:`object.__getattr__` o :meth:`object.__getattribute__`. (Contribuido por *INADA Naoki* en :issue:`32544`.)

source: Searching for certain Unicode characters (like Ukrainian capital "Є") in a string was up to 25 times slower than searching for other characters. It is now only 3 times slower in the worst case. (Contributed by Serhiy Storchaka in :issue:`24821`.)
es_ec: La búsqueda de ciertos caracteres Unicode (como la mayúscula ucraniana “Є”) en una cadena fue hasta 25 veces más lenta que la búsqueda de otros caracteres. Ahora es solo 3 veces más lento en el peor de los casos. (Contribuido por *Serhiy Storchaka* en :issue:`24821`.)

source: The :func:`collections.namedtuple` factory has been reimplemented to make the creation of named tuples 4 to 6 times faster. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
es_ec: La fábrica :func:`collections.namedtuple` ha sido re-implementada para hacer que la creación de tuplas con nombre sea de 4 a 6 veces más rápida. (Contribuido por *Jelle Zijlstra* con nuevas mejoras de *INADA Naoki*, *Serhiy Storchaka*, y *Raymond Hettinger* en :issue:`28638`.)

source: :meth:`date.fromordinal` and :meth:`date.fromtimestamp` are now up to 30% faster in the common case. (Contributed by Paul Ganssle in :issue:`32403`.)
es_ec: :meth:`date.fromordinal` y :meth:`date.fromtimestamp` ahora son hasta un 30% más rápidos en el caso común. (Contribuido por *Paul Ganssle* en :issue:`32403`.)

source: The :func:`os.fwalk` function is now up to 2 times faster thanks to the use of :func:`os.scandir`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
es_ec: La función :func:`os.fwalk` es ahora 2 veces mas rápida gracias al uso de :func:`os.scandir`. (Contribuido por *Serhiy Storchaka* en :issue:`25996`.)

source: The speed of the :func:`shutil.rmtree` function has been improved by 20--40% thanks to the use of the :func:`os.scandir` function. (Contributed by Serhiy Storchaka in :issue:`28564`.)
es_ec: La rapidez de la función :func:`shutil.rmtree` se ha mejorado en un 20-40% gracias al uso de la función :func:`os.scandir`. (Contribuido por *Serhiy Storchaka* en :issue:`28564`.)

source: Optimized case-insensitive matching and searching of :mod:`regular expressions <re>`. Searching some patterns can now be up to 20 times faster. (Contributed by Serhiy Storchaka in :issue:`30285`.)
es_ec: Búsqueda y coincidencia optimizadas que no distinguen entre mayúsculas y minúsculas de :mod:`expresiones regulares <re>`. La búsqueda de algunos patrones ahora puede ser hasta 20 veces más rápida. (Contribuido por *Serhiy Storchaka* en :issue:`30285`.)

source: :func:`re.compile` now converts ``flags`` parameter to int object if it is ``RegexFlag``. It is now as fast as Python 3.5, and faster than Python 3.6 by about 10% depending on the pattern. (Contributed by INADA Naoki in :issue:`31671`.)
es_ec: :func:`re.compile` ahora convierte el parámetro ``flags`` en un objeto int si es ``RegexFlag``. Ahora es tan rápido como Python 3.5 y más rápido que Python 3.6 en aproximadamente un 10% dependiendo del patrón. (Contribuido por *INADA Naoki* en :issue:`31671`.)

source: The :meth:`~selectors.BaseSelector.modify` methods of classes :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` and :class:`selectors.DevpollSelector` may be around 10% faster under heavy loads. (Contributed by Giampaolo Rodola' in :issue:`30014`)
es_ec: El método :meth:`~selectors.BaseSelector.modify` de la clase :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` y :class:`selectors.DevpollSelector` puede ser alrededor de un 10% más rápido bajo cargas pesadas. (Contribuido por *Giampaolo Rodola* en :issue:`30014`)

source: Constant folding has been moved from the peephole optimizer to the new AST optimizer, which is able perform optimizations more consistently. (Contributed by Eugene Toder and INADA Naoki in :issue:`29469` and :issue:`11549`.)
es_ec: El plegado constante se ha movido del optimizador de mirilla al nuevo optimizador AST, que puede realizar optimizaciones de manera más consistente. (Contribuid por *Eugene Toder* y *INADA Naoki* en :issue:`29469` y :issue:`11549`.)

source: Most functions and methods in :mod:`abc` have been rewritten in C. This makes creation of abstract base classes, and calling :func:`isinstance` and :func:`issubclass` on them 1.5x faster. This also reduces Python start-up time by up to 10%. (Contributed by Ivan Levkivskyi and INADA Naoki in :issue:`31333`)
es_ec: La mayoría de funciones y métodos en :mod:`abc` se han reescrito en C. Esto hace que la creación de clases base abstractas y la llamada a :func:`isinstance` y :func:`issubclass` en ellas sean 1.5 veces más rápidas. Esto también reduce el tiempo de inicio de Python hasta en un 10%. (Contribuido por *Ivan Levkivskyi* y *INADA Naoki* en :issue:`31333`)

source: Significant speed improvements to alternate constructors for :class:`datetime.date` and :class:`datetime.datetime` by using fast-path constructors when not constructing subclasses. (Contributed by Paul Ganssle in :issue:`32403`)
es_ec: Mejoras significativas de velocidad para constructores alternativos para :class:`datetime.date` y :class:`datetime.datetime` mediante el uso de constructores de ruta rápida cuando no se construyen subclases. (Contribuido por *Paul Ganssle* en :issue:`32403`)

source: The speed of comparison of :class:`array.array` instances has been improved considerably in certain cases. It is now from 10x to 70x faster when comparing arrays holding values of the same integer type. (Contributed by Adrian Wielgosik in :issue:`24700`.)
es_ec: La velocidad de comparación de instancias de :class:`array.array` se ha mejorado considerablemente en determinados casos. Ahora es de 10 a 70 veces más rápido cuando se comparan matrices que contienen valores del mismo tipo de entero. (Contribuido por *Adrian Wielgosik* en :issue:`24700`.)

source: The :func:`math.erf` and :func:`math.erfc` functions now use the (faster) C library implementation on most platforms. (Contributed by Serhiy Storchaka in :issue:`26121`.)
es_ec: Las funciones :func:`math.erf` y :func:`math.erfc` ahora use la implementación de la biblioteca C (más rápida) en la mayoría de las plataformas. (Contribuido por *Serhiy Storchaka* en :issue:`26121`.)

source: Other CPython Implementation Changes
es_ec: Otros cambios de implementación de CPython

source: Trace hooks may now opt out of receiving the ``line`` and opt into receiving the ``opcode`` events from the interpreter by setting the corresponding new ``f_trace_lines`` and ``f_trace_opcodes`` attributes on the frame being traced. (Contributed by Nick Coghlan in :issue:`31344`.)
es_ec: Los ganchos de seguimiento ahora pueden optar por no recibir la ``linea`` y optar por recibir los eventos ``opcode`` del intérprete configurando los nuevos atributos correspondientes ``f_trace_lines`` y ``f_trace_opcodes`` en el marco que se está rastreando . (Contribuido por *Nick Coghlan* en :issue:`31344`.)

source: Fixed some consistency problems with namespace package module attributes. Namespace module objects now have an ``__file__`` that is set to ``None`` (previously unset), and their ``__spec__.origin`` is also set to ``None`` (previously the string ``"namespace"``). See :issue:`32305`. Also, the namespace module object's ``__spec__.loader`` is set to the same value as ``__loader__`` (previously, the former was set to ``None``). See :issue:`32303`.
es_ec: Se corrigieron algunos problemas de coherencia con los atributos del módulo del paquete de espacio de nombres. Los objetos del módulo de espacio de nombres ahora tienen un ``__file__`` que está configurado como ``None`` (previamente no configurado), y su ``__spec__.origin`` también está configurado como ``None`` (anteriormente la cadena ``"namespace"``). Ver :issue:`32305`. Además, el ``__spec__.loader`` del objeto del módulo de espacio de nombres se establece en el mismo valor que ``__loader__`` (anteriormente, el primero se estableció en ``None``). Ver :issue:`32303`.
