Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: The *database* argument of :func:`sqlite3.connect` now accepts any :term:`path-like object`, instead of just a string. (Contributed by Anders Lorentsen in :issue:`31843`.)
es_ec: El argumento * base de datos * de :func:`sqlite3.connect` ahora acepta cualquier :term:`path-like object`, en lugar de solo una cadena. (Contribuido por *Anders Lorentsen* en :issue:`31843`.)

source: The :mod:`ssl` module now uses OpenSSL's builtin API instead of :func:`~ssl.match_hostname` to check a host name or an IP address. Values are validated during TLS handshake. Any certificate validation error including failing the host name check now raises :exc:`~ssl.SSLCertVerificationError` and aborts the handshake with a proper TLS Alert message. The new exception contains additional information. Host name validation can be customized with :attr:`SSLContext.hostname_checks_common_name <ssl.SSLContext.hostname_checks_common_name>`. (Contributed by Christian Heimes in :issue:`31399`.)
es_ec: El módulo :mod:`ssl` ahora usa la API integrada de OpenSSL en lugar de :func:`~ssl.match_hostname` para comprobar un nombre de host o una dirección IP. Los valores se validan durante el protocolo de enlace TLS. Cualquier error de validación de certificado, incluida la falla en la verificación del nombre de host, ahora aumenta :exc:`~ssl.SSLCertVerificationError` y aborta el protocolo de enlace con un mensaje de alerta TLS adecuado. La nueva excepción contiene información adicional. La validación del nombre de host se puede personalizar con :attr:`SSLContext.hostname_checks_common_name <ssl.SSLContext.hostname_checks_common_name>`. (Contribuido por *Christian Heimes* en :issue:`31399`.)

source: The improved host name check requires a *libssl* implementation compatible with OpenSSL 1.0.2 or 1.1. Consequently, OpenSSL 0.9.8 and 1.0.1 are no longer supported (see :ref:`37-platform-support-removals` for more details). The ssl module is mostly compatible with LibreSSL 2.7.2 and newer.
es_ec: La verificación mejorada del nombre de host requiere una implementación *libssl* compatible con OpenSSL 1.0.2 o 1.1. En consecuencia, OpenSSL 0.9.8 y 1.0.1 ya no son compatibles (consulte :ref:`37-platform-support-removals` para más detalles). El módulo ssl es principalmente compatible con LibreSSL 2.7.2 y versiones posteriores.

source: The ``ssl`` module no longer sends IP addresses in SNI TLS extension. (Contributed by Christian Heimes in :issue:`32185`.)
es_ec: El módulo ``ssl`` ya no envía direcciones IP en la extensión SNI TLS. (Contribuido por *Christian Heimes* en :issue:`32185`.)

source: :func:`~ssl.match_hostname` no longer supports partial wildcards like ``www*.example.org``. (Contributed by Mandeep Singh in :issue:`23033` and Christian Heimes in :issue:`31399`.)
es_ec: :func:`~ssl.match_hostname` ya no admite comodines parciales como ``www*.example.org``. (Contribuido por *Mandeep Singh* en :issue:`23033` y *Christian Heimes* en :issue:`31399`.)

source: The default cipher suite selection of the ``ssl`` module now uses a blacklist approach rather than a hard-coded whitelist. Python no longer re-enables ciphers that have been blocked by OpenSSL security updates. Default cipher suite selection can be configured at compile time. (Contributed by Christian Heimes in :issue:`31429`.)
es_ec: La selección del conjunto de cifrado predeterminado del módulo ``ssl`` ahora usa un enfoque de lista negra en lugar de una lista blanca codificada. Python ya no vuelve a habilitar los cifrados que han sido bloqueados por las actualizaciones de seguridad de OpenSSL. La selección del conjunto de cifrado predeterminado se puede configurar en tiempo de compilación. (Contribuido por *Christian Heimes* en :issue:`31429`.)

source: Validation of server certificates containing internationalized domain names (IDNs) is now supported. As part of this change, the :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` attribute now stores the expected hostname in A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``). (Contributed by Nathaniel J. Smith and Christian Heimes in :issue:`28414`.)
es_ec: Ahora se admite la validación de certificados de servidor que contienen nombres de dominio internacionalizados (IDN). Como parte de este cambio, el atributo :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` ahora almacena el nombre de host esperado en forma de etiqueta A (``”xn--pythn-mua.org”``), en lugar de la forma de etiqueta U (``”pythön.org”``). (Contribuido por *Nathaniel J. Smith* y *Christian Heimes* en :issue:`28414`.)

source: The ``ssl`` module has preliminary and experimental support for TLS 1.3 and OpenSSL 1.1.1. At the time of Python 3.7.0 release, OpenSSL 1.1.1 is still under development and TLS 1.3 hasn't been finalized yet. The TLS 1.3 handshake and protocol behaves slightly differently than TLS 1.2 and earlier, see :ref:`ssl-tlsv1_3`. (Contributed by Christian Heimes in :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` and :issue:`33618`)
es_ec: El módulo ``ssl`` tiene soporte preliminar y experimental para TLS 1.3 y OpenSSL 1.1.1. En el momento del lanzamiento de Python 3.7.0, OpenSSL 1.1.1 todavía está en desarrollo y TLS 1.3 aún no se ha finalizado. El protocolo y el protocolo de enlace TLS 1.3 se comportan de forma ligeramente diferente a TLS 1.2 y versiones anteriores, consulte :ref:`ssl-tlsv1_3`. (Contribuido por *Christian Heimes* en :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` y :issue:`33618`)

source: :class:`~ssl.SSLSocket` and :class:`~ssl.SSLObject` no longer have a public constructor. Direct instantiation was never a documented and supported feature. Instances must be created with :class:`~ssl.SSLContext` methods :meth:`~ssl.SSLContext.wrap_socket` and :meth:`~ssl.SSLContext.wrap_bio`. (Contributed by Christian Heimes in :issue:`32951`)
es_ec: :class:`~ssl.SSLSocket` y :class:`~ssl.SSLObject` ya no tiene un constructor público. La creación de instancias directa nunca fue una característica documentada y compatible. Las instancias deben crearse con métodos :class:`~ssl.SSLContext` :meth:`~ssl.SSLContext.wrap_socket` y :meth:`~ssl.SSLContext.wrap_bio`. (Contribuido por *Christian Heimes* en :issue:`32951`)

source: OpenSSL 1.1 APIs for setting the minimum and maximum TLS protocol version are available as :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` and :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Supported protocols are indicated by several new flags, such as :data:`~ssl.HAS_TLSv1_1`. (Contributed by Christian Heimes in :issue:`32609`.)
es_ec: Las API de OpenSSL 1.1 para configurar la versión mínima y máxima del protocolo TLS están disponibles como :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` y :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Los protocolos admitidos se indican mediante varios indicadores nuevos, como :data:`~ssl.HAS_TLSv1_1`. (Contribuido por *Christian Heimes* en :issue:`32609`.)

source: :class:`string.Template` now lets you to optionally modify the regular expression pattern for braced placeholders and non-braced placeholders separately. (Contributed by Barry Warsaw in :issue:`1198569`.)
es_ec: :class:`string.Template` ahora le permite modificar opcionalmente el patrón de expresión regular para marcadores de posición reforzados y marcadores de posición no reforzados por separado. (Contribuido por *Barry Warsaw* en :issue:`1198569`.)

source: The ``subprocess.run`` function and the :class:`subprocess.Popen` constructor now accept the *text* keyword argument as an alias to *universal_newlines*. (Contributed by Andrew Clegg in :issue:`31756`.)
es_ec: La función ``subprocess.run`` y el constructor :class:`subprocess.Popen` ahora aceptan la palabra clave del argumento *text* como un alias para *universal_newlines*. (Contribuido por *Andrew Clegg* en :issue:`31756`.)

source: On Windows the default for *close_fds* was changed from ``False`` to ``True`` when redirecting the standard handles. It's now possible to set *close_fds* to true when redirecting the standard handles. See :class:`subprocess.Popen`. This means that *close_fds* now defaults to ``True`` on all supported platforms. (Contributed by Segev Finer in :issue:`19764`.)
es_ec: En Windows, el valor predeterminado de *close_fds* se cambió de ``False`` a ``True`` al redirigir los identificadores estándar. Ahora es posible establecer *close_fds* en verdadero al redirigir los identificadores estándar. Ver :class:`subprocess.Popen`. Esto significa que *close_fds* ahora tiene el valor predeterminado de ``True`` en todas las plataformas compatibles. (Contribuido por *Segev Finer* en :issue:`19764`.)

source: The subprocess module is now more graceful when handling :exc:`KeyboardInterrupt` during :func:`subprocess.call`, :func:`subprocess.run`, or in a :class:`~subprocess.Popen` context manager. It now waits a short amount of time for the child to exit, before continuing the handling of the ``KeyboardInterrupt`` exception. (Contributed by Gregory P. Smith in :issue:`25942`.)
es_ec: El módulo de subproceso ahora es más elegante al manejar :exc:`KeyboardInterrupt` durante: :func:`subprocess.call`, :func:`subprocess.run`, o en un administrador de contexto :class:`~subprocess.Popen`. Ahora espera un corto período de tiempo para que el niño salga, antes de continuar con el manejo de la excepción ``KeyboardInterrupt``. (Contribuido por *Gregory P. Smith* en :issue:`25942`.)

source: The new :func:`sys.breakpointhook` hook function is called by the built-in :func:`breakpoint`. (Contributed by Barry Warsaw in :issue:`31353`.)
es_ec: La nueva función de enganche :func:`sys.breakpointhook` es llamada por la incorporada :func:`breakpoint`. (Contribuido por *Barry Warsaw* en :issue:`31353`.)

source: On Android, the new :func:`sys.getandroidapilevel` returns the build-time Android API version. (Contributed by Victor Stinner in :issue:`28740`.)
es_ec: En Android, la nueva :func:`sys.getandroidapilevel` devuelve la versión de la API de Android en tiempo de compilación. (Contribuido por *Victor Stinner* en :issue:`28740`.)

source: The new :func:`sys.get_coroutine_origin_tracking_depth` function returns the current coroutine origin tracking depth, as set by the new :func:`sys.set_coroutine_origin_tracking_depth`. :mod:`asyncio` has been converted to use this new API instead of the deprecated :func:`sys.set_coroutine_wrapper`. (Contributed by Nathaniel J. Smith in :issue:`32591`.)
es_ec: La nueva función :func:`sys.get_coroutine_origin_tracking_depth` devuelve la profundidad de seguimiento del origen de la corrutina actual, según lo establecido por el nuevo :func:`sys.set_coroutine_origin_tracking_depth`. :mod:`asyncio` se ha convertido para usar esta nueva API en lugar de la obsoleta :func:`sys.set_coroutine_wrapper`. (Contribuido por *Nathaniel J. Smith* en :issue:`32591`.)

source: :pep:`564` adds six new functions with nanosecond resolution to the :mod:`time` module:
es_ec: :pep:`564` añade seis nuevas funciones con resolución de nanosegundos al modulo :mod:`time`:

source: New clock identifiers have been added:
es_ec: Se han agregado nuevos identificadores de reloj:

source: The new :func:`time.thread_time` and :func:`time.thread_time_ns` functions can be used to get per-thread CPU time measurements. (Contributed by Antoine Pitrou in :issue:`32025`.)
es_ec: La nuevas funciones :func:`time.thread_time` y :func:`time.thread_time_ns` se puede utilizar para obtener medidas de tiempo de CPU por subproceso. (Contribuido por *Antoine Pitrou* en :issue:`32025`.)

source: The new :func:`time.pthread_getcpuclockid` function returns the clock ID of the thread-specific CPU-time clock.
es_ec: La nueva función :func:`time.pthread_getcpuclockid` devuelve el ID de reloj del reloj de tiempo de CPU específico del subproceso.

source: The new :class:`tkinter.ttk.Spinbox` class is now available. (Contributed by Alan Moore in :issue:`32585`.)
es_ec: La nueva clase :class:`tkinter.ttk.Spinbox` esta disponible ahora. (Contribuido por *Alan Moore* en :issue:`32585`.)

source: :class:`tracemalloc.Traceback` behaves more like regular tracebacks, sorting the frames from oldest to most recent. :meth:`Traceback.format() <tracemalloc.Traceback.format>` now accepts negative *limit*, truncating the result to the ``abs(limit)`` oldest frames. To get the old behaviour, use the new *most_recent_first* argument to ``Traceback.format()``. (Contributed by Jesse Bakker in :issue:`32121`.)
es_ec: :class:`tracemalloc.Traceback` se comporta más como rastreos regulares, ordenando los fotogramas del más antiguo al más reciente. :meth:`Traceback.format() <tracemalloc.Traceback.format>` ahora acepta *límite* negativo, truncando el resultado a los marcos más antiguos de ``abs(limit)``. Para obtener el comportamiento anterior, use el nuevo argumento *most_recent_first* para ``Traceback.format()``. (Contribuido por *Jesse Bakker* en :issue:`32121`.)

source: The new :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType`, and :class:`~types.ClassMethodDescriptorType` classes are now available. (Contributed by Manuel Krebber and Guido van Rossum in :issue:`29377`, and Serhiy Storchaka in :issue:`32265`.)
es_ec: Las nuevas clases :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType`, y :class:`~types.ClassMethodDescriptorType` ahora están disponibles. (Contribuido por *Manuel Krebber* y *Guido van Rossum* en :issue:`29377`, y *Serhiy Storchaka* en :issue:`32265`.)

source: The new :func:`types.resolve_bases` function resolves MRO entries dynamically as specified by :pep:`560`. (Contributed by Ivan Levkivskyi in :issue:`32717`.)
es_ec: La nueva función :func:`types.resolve_bases` resuelve las entradas MRO dinámicamente según lo especificado por :pep:`560`. (Contribuido por *Ivan Levkivskyi* en :issue:`32717`.)

source: The internal :mod:`unicodedata` database has been upgraded to use `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Contributed by Benjamin Peterson.)
es_ec: La base de datos interna :mod:`unicodedata` se actualizó para usar `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Aportado por Benjamín Peterson.)

source: The new ``-k`` command-line option allows filtering tests by a name substring or a Unix shell-like pattern. For example, ``python -m unittest -k foo`` runs ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``. (Contributed by Jonas Haag in :issue:`32071`.)
es_ec: La nueva opción de la linea de comandos ``-k`` permite filtrar pruebas por una subcadena de nombre o un patrón similar a un shell de Unix. Por ejemplo, ``python -m unittest -k foo`` ejecuta ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, pero no ``bar_tests.FooTest.test_something``. (Contribuido por *Jonas Haag* en :issue:`32071`.)

source: The :const:`~unittest.mock.sentinel` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`. (Contributed by Serhiy Storchaka in :issue:`20804`.)
es_ec: Los atributos :const:`~unittest.mock.sentinel` ahora preservan su identidad cuando están :mod:`copied <copy>` o :mod:`pickled <pickle>`. (Contribuido por *Serhiy Storchaka* en :issue:`20804`.)

source: The new :func:`~unittest.mock.seal` function allows sealing :class:`~unittest.mock.Mock` instances, which will disallow further creation of attribute mocks. The seal is applied recursively to all attributes that are themselves mocks. (Contributed by Mario Corchero in :issue:`30541`.)
es_ec: La nueva función :func:`~unittest.mock.seal` permite sellar instancias :class:`~unittest.mock.Mock`, que no permitirá la creación de simulacros de atributos. El sello se aplica de forma recursiva a todos los atributos que en sí mismos son burlas. (Contribuido por *Mario Corchero* en :issue:`30541`.)

source: :func:`urllib.parse.quote` has been updated from :rfc:`2396` to :rfc:`3986`, adding ``~`` to the set of characters that are never quoted by default. (Contributed by Christian Theune and Ratnadeep Debnath in :issue:`16285`.)
es_ec: :func:`urllib.parse.quote` ha sido actualizada desde :rfc:`2396` a :rfc:`3986`, agregado ``~`` para el conjunto de caracteres que nunca se cotizan por defecto. (Contribuido por *Christian Theune* y *Ratnadeep Debnath* en :issue:`16285`.)

source: The :func:`uu.encode` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
es_ec: La nueva función :func:`uu.encode` ahora acepta un argumento opcional de palabra clave *backtick*. Mientras esto se verdadero, los ceros son representados por ``’`’`` en lugar de espacios. (Contribuido por *Xiang Zhang* en :issue:`30103`.)

source: The new :attr:`UUID.is_safe <uuid.UUID.is_safe>` attribute relays information from the platform about whether generated UUIDs are generated with a multiprocessing-safe method. (Contributed by Barry Warsaw in :issue:`22807`.)
es_ec: El nuevo atributo :attr:`UUID.is_safe <uuid.UUID.is_safe>` transmite información de la plataforma sobre si los UUID generados se generan con un método seguro para multiprocesamiento. (Contribuido por *Barry Warsaw* en :issue:`22807`.)

source: :func:`uuid.getnode` now prefers universally administered MAC addresses over locally administered MAC addresses. This makes a better guarantee for global uniqueness of UUIDs returned from :func:`uuid.uuid1`. If only locally administered MAC addresses are available, the first such one found is returned. (Contributed by Barry Warsaw in :issue:`32107`.)
es_ec: :func:`uuid.getnode` ahora prefiere las direcciones MAC administradas universalmente a las direcciones MAC administradas localmente. Esto ofrece una mejor garantía de la unicidad global de los UUID devueltos desde :func:`uuid.uuid1`. Si solo hay disponibles direcciones MAC administradas localmente, se devuelve la primera que se encuentre. (Contribuido por *Barry Warsaw* en :issue:`32107`.)

source: The initialization of the default warnings filters has changed as follows:
es_ec: La inicialización de los filtros de advertencias predeterminados ha cambiado de la siguiente manera:

source: warnings enabled via command line options (including those for :option:`-b` and the new CPython-specific :option:`-X` ``dev`` option) are always passed to the warnings machinery via the :data:`sys.warnoptions` attribute.
es_ec: advertencias habilitadas a través de opciones de línea de comando (incluidos los de :option:`-b` y la nueva opción específica de CPython :option:`-X` ``dev``) siempre se pasan a la maquinaria de advertencias a través del atributo :data:`sys.warnoptions`.

source: warnings filters enabled via the command line or the environment now have the following order of precedence:
es_ec: los filtros de advertencias habilitados a través de la línea de comandos o el entorno ahora tienen el siguiente orden de prioridad:

source: the ``BytesWarning`` filter for :option:`-b` (or ``-bb``)
es_ec: el filtro ``BytesWarning`` para :option:`-b` (o ``-bb``)

source: any filters specified with the :option:`-W` option
es_ec: cualquier filtro especificado con la opción :option:`-W`

source: any filters specified with the :envvar:`PYTHONWARNINGS` environment variable
es_ec: cualquier filtro especificado con la variable de entorno :envvar:`PYTHONWARNINGS`

source: any other CPython specific filters (e.g. the ``default`` filter added for the new ``-X dev`` mode)
es_ec: cualquier otro filtro específico de CPython (por ejemplo, el filtro ``default`` agregado para el nuevo modo ``-X dev``)

source: any implicit filters defined directly by the warnings machinery
es_ec: cualquier filtro implícito definido directamente por la maquinaria de advertencias

source: in :ref:`CPython debug builds <debug-build>`, all warnings are now displayed by default (the implicit filter list is empty)
es_ec: en las :ref:`compilaciones de depuración de CPython <debug-build>`, ahora todas las advertencias se muestran de forma predeterminada (la lista de filtros implícitos está vacía)

source: (Contributed by Nick Coghlan and Victor Stinner in :issue:`20361`, :issue:`32043`, and :issue:`32230`.)
es_ec: (Contribuido por *Nick Coghlan* y *Victor Stinner* en :issue:`20361`, :issue:`32043`, and :issue:`32230`.)

source: Deprecation warnings are once again shown by default in single-file scripts and at the interactive prompt. See :ref:`whatsnew37-pep565` for details. (Contributed by Nick Coghlan in :issue:`31975`.)
es_ec: Las advertencias de obsolescencia se muestran una vez más de forma predeterminada en scripts de un solo archivo y en el indicador interactivo. Consultar :ref:`whatsnew37-pep565` para mas detalles. (Contribuido por *Nick Coghlan* en :issue:`31975`.)

source: :ref:`ElementPath <elementtree-xpath>` predicates in the :meth:`find` methods can now compare text of the current node with ``[. = "text"]``, not only text in children. Predicates also allow adding spaces for better readability. (Contributed by Stefan Behnel in :issue:`31648`.)
es_ec: :ref:`ElementPath <elementtree-xpath>` predicados en los métodos :meth:`find` ahora pueden comparar el texto del nodo actual con ```[. = “text”]``, no solo texto en niños. Los predicados también permiten agregar espacios para una mejor legibilidad. (Contribuido por *Stefan Behnel* en :issue:`31648`.)

source: :meth:`SimpleXMLRPCDispatcher.register_function <xmlrpc.server.SimpleXMLRPCDispatcher>` can now be used as a decorator. (Contributed by Xiang Zhang in :issue:`7769`.)
es_ec: :meth:`SimpleXMLRPCDispatcher.register_function <xmlrpc.server.SimpleXMLRPCDispatcher>` ahora puede ser usado como un decorador. (Contribuido por *Xiang Zhang* en :issue:`7769`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *filter* argument to allow the user to select which files should be included in the archive. (Contributed by Irmen de Jong in :issue:`31072`.)
es_ec: Función :func:`~zipapp.create_archive` ahora acepta un argumento opcional *filter* para permitir al usuario seleccionar que archivos deben incluirse en el

source: Function :func:`~zipapp.create_archive` now accepts an optional *compressed* argument to generate a compressed archive. A command line option ``--compress`` has also been added to support compression. (Contributed by Zhiming Wang in :issue:`31638`.)
es_ec: Función :func:`~zipapp.create_archive` ahora acepta un argumento opcional * comprimido * para generar un archivo comprimido. También se ha agregado una opción de línea de comando ``—compress`` para admitir la compresión. (Contribuido por *Zhiming Wang* en :issue:`31638`.)

source: :class:`~zipfile.ZipFile` now accepts the new *compresslevel* parameter to control the compression level. (Contributed by Bo Bayles in :issue:`21417`.)
es_ec: :class:`~zipfile.ZipFile` ahora acepta el nuevo parámetro *compresslevel* para controlar el nivel de compresión. (Contribuido por *Bo Bayles* en :issue:`21417`.)

source: Subdirectories in archives created by ``ZipFile`` are now stored in alphabetical order. (Contributed by Bernhard M. Wiedemann in :issue:`30693`.)
es_ec: Subdirectorios en archivos creados por ``ZipFile`` ahora son guardados en orden alfabético. (Contribuido por *Bernhard M. Wiedemann* en :issue:`30693`.)

source: C API Changes
es_ec: Cambios en la API C
