Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: When using the :option:`-m` switch, the initial working directory is now added to :data:`sys.path`, rather than an empty string (which dynamically denoted the current working directory at the time of each import). Any programs that are checking for the empty string, or otherwise relying on the previous behaviour, will need to be updated accordingly (e.g. by also checking for ``os.getcwd()`` or ``os.path.dirname(__main__.__file__)``, depending on why the code was checking for the empty string in the first place).
es_ec: Al usar el interruptor :option:`-m`, el directorio de trabajo inicial ahora se agrega a: data :data:`sys.path`, en lugar de una cadena vacía (que denota dinámicamente el directorio de trabajo actual en el momento de cada importación). Cualquier programa que esté comprobando la cadena vacía, o que dependa de otro modo del comportamiento anterior, deberá actualizarse en consecuencia (por ejemplo, comprobando también si hay ``os.getcwd()`` o ``os.path.dirname(__main__.__file__)``, dependiendo de por qué el código buscaba la cadena vacía en primer lugar).

source: Changes in the Python API
es_ec: Cambios en la API Python

source: :meth:`socketserver.ThreadingMixIn.server_close` now waits until all non-daemon threads complete. Set the new :attr:`socketserver.ThreadingMixIn.block_on_close` class attribute to ``False`` to get the pre-3.7 behaviour. (Contributed by Victor Stinner in :issue:`31233` and :issue:`33540`.)
es_ec: :meth:`socketserver.ThreadingMixIn.server_close` ahora espera hasta que se completen todos los subprocesos que no son demonios. Establezca el nuevo atributo de clase :attr:`socketserver.ThreadingMixIn.block_on_close` en ``False`` para obtener el comportamiento anterior a 3.7. (Contribuido por *Victor Stinner* en :issue:`31233` y :issue:`33540`.)

source: :meth:`socketserver.ForkingMixIn.server_close` now waits until all child processes complete. Set the new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to ``False`` to get the pre-3.7 behaviour. (Contributed by Victor Stinner in :issue:`31151` and :issue:`33540`.)
es_ec: :meth:`socketserver.ForkingMixIn.server_close` ahora espera hasta que se completen todos los procesos secundarios. Establezca el nuevo atributo de clase :attr:`socketserver.ForkingMixIn.block_on_close` en ``False`` para obtener el comportamiento anterior a 3.7. (Contribuido por *Victor Stinner* en :issue:`31151` y :issue:`33540`.)

source: The :func:`locale.localeconv` function now temporarily sets the ``LC_CTYPE`` locale to the value of ``LC_NUMERIC`` in some cases. (Contributed by Victor Stinner in :issue:`31900`.)
es_ec: La función :func:`locale.localeconv` ahora establece temporalmente la configuración regional ``LC_CTYPE`` en el valor de ```LC_NUMERIC`` en algunos casos. (Contribuido por *Victor Stinner* en :issue:`31900`.)

source: :meth:`pkgutil.walk_packages` now raises a :exc:`ValueError` if *path* is a string. Previously an empty list was returned. (Contributed by Sanyam Khurana in :issue:`24744`.)
es_ec: :meth:`pkgutil.walk_packages` ahora genera un :exc:`ValueError` si la* ruta * es una cadena. Anteriormente se devolvió una lista vacía. (Contribuido por *Sanyam Khurana* en :issue:`24744`.)

source: A format string argument for :meth:`string.Formatter.format` is now :ref:`positional-only <positional-only_parameter>`. Passing it as a keyword argument was deprecated in Python 3.5. (Contributed by Serhiy Storchaka in :issue:`29193`.)
es_ec: Un argumento de cadena de formato para :meth:`string.Formatter.format` es ahora :ref:`solo posicional <positional-only_parameter>`. Pasarlo como un argumento de palabra clave quedó obsoleto en Python 3.5. (Contribuido por *Serhiy Storchaka* en :issue:`29193`.)

source: Attributes :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` and :attr:`~http.cookies.Morsel.coded_value` of class :class:`http.cookies.Morsel` are now read-only. Assigning to them was deprecated in Python 3.5. Use the :meth:`~http.cookies.Morsel.set` method for setting them. (Contributed by Serhiy Storchaka in :issue:`29192`.)
es_ec: Atributos :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` y :attr:`~http.cookies.Morsel.coded_value` de la clase :class:`http.cookies.Morsel` ahora son de solo lectura. La asignación a ellos quedó obsoleta en Python 3.5. Utilizar el método :meth:`~http.cookies.Morsel.set` para configurarlos. (Contribuido por *Serhiy Storchaka* en :issue:`29192`.)

source: The *mode* argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. To set their file permission bits you can set the umask before invoking ``makedirs()``. (Contributed by Serhiy Storchaka in :issue:`19930`.)
es_ec: El argumento *mode* de :func:`os.makedirs` ya no afecta los bits de permiso de archivo de los directorios de nivel intermedio recién creados. Para configurar sus bits de permiso de archivo, puede configurar umask antes de invocar ``makedirs()``. (Aportado por Serhiy Storchaka en :issue:`19930`.)

source: The :attr:`struct.Struct.format` type is now :class:`str` instead of :class:`bytes`. (Contributed by Victor Stinner in :issue:`21071`.)
es_ec: El tipo :attr:`struct.Struct.format` ahora es :class:`str` en lugar de: class :class:`bytes`. (Contribuido por *Victor Stinner* en :issue:`21071`.)

source: :func:`~cgi.parse_multipart` now accepts the *encoding* and *errors* arguments and returns the same results as :class:`~FieldStorage`: for non-file fields, the value associated to a key is a list of strings, not bytes. (Contributed by Pierre Quentel in :issue:`29979`.)
es_ec: :func:`~cgi.parse_multipart` ahora acepta los argumentos * codificación * y * errores * y devuelve los mismos resultados que :class:`~FieldStorage`: para campos que no son de archivo, el valor asociado a una clave es una lista de cadenas, no bytes. (Contribuido por *Pierre Quentel* en :issue:`29979`.)

source: Due to internal changes in :mod:`socket`, calling :func:`socket.fromshare` on a socket created by :func:`socket.share <socket.socket.share>` in older Python versions is not supported.
es_ec: Debido a cambios internos en :mod:`socket`, llamar :func:`socket.fromshare` en un socket creado por :func:`socket.share <socket.socket.share>` en versiones anteriores de Python no es compatible.

source: ``repr`` for :exc:`BaseException` has changed to not include the trailing comma. Most exceptions are affected by this change. (Contributed by Serhiy Storchaka in :issue:`30399`.)
es_ec: ``repr`` para :exc:`BaseException` ha cambiado para no incluir la coma final. La mayoría de las excepciones se ven afectadas por este cambio. (Contribuido por *Serhiy Storchaka* en :issue:`30399`.)

source: ``repr`` for :class:`datetime.timedelta` has changed to include the keyword arguments in the output. (Contributed by Utkarsh Upadhyay in :issue:`30302`.)
es_ec: ``repr`` para :class:`datetime.timedelta` ha cambiado para incluir los argumentos de palabras clave en la salida. (Contribuido por *Utkarsh Upadhyay* en :issue:`30302`.)

source: Because :func:`shutil.rmtree` is now implemented using the :func:`os.scandir` function, the user specified handler *onerror* is now called with the first argument ``os.scandir`` instead of ``os.listdir`` when listing the directory is failed.
es_ec: Debido a que :func:`shutil.rmtree` ahora se implementa usando la función :func:`os.scandir`, el controlador especificado por el usuario *onerror* ahora se llama con el primer argumento ``os.scandir`` en lugar de ``os.listdir`` cuando falla el listado del directorio.

source: Support for nested sets and set operations in regular expressions as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax. To facilitate this future change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That include sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning, escape them with a backslash. (Contributed by Serhiy Storchaka in :issue:`30349`.)
es_ec: Es posible que en el futuro se agregue soporte para conjuntos anidados y operaciones de conjuntos en expresiones regulares como en `Unicode Technical Standard #18`_. Esto cambiaría la sintaxis. Para facilitar este cambio futuro, por el momento, se planteará un :exc:`FutureWarning` en casos ambiguos. Que incluyen conjuntos que comienzan con un literal ``’[‘`` o que contienen secuencias de caracteres literales ``’—‘``, ``’&&’``, ``’~~’``, and ``’||’``. Para evitar una advertencia, escapa de ellos con una barra invertida. (Contribuido por *Serhiy Storchaka* en :issue:`30349`.)

source: The result of splitting a string on a :mod:`regular expression <re>` that could match an empty string has been changed. For example splitting on ``r'\s*'`` will now split not only on whitespaces as it did previously, but also on empty strings before all non-whitespace characters and just before the end of the string. The previous behavior can be restored by changing the pattern to ``r'\s+'``. A :exc:`FutureWarning` was emitted for such patterns since Python 3.5.
es_ec: El resultado de dividir una cuerda en un :mod:`expresión regular <re>` que podría coincidir con una cadena vacía. Por ejemplo, dividir en ``r’\s*’`` ahora dividirá no solo en espacios en blanco como lo hizo anteriormente, sino también en cadenas vacías antes de todos los caracteres que no sean espacios en blanco y justo antes del final de la cadena. El comportamiento anterior se puede restaurar cambiando el patrón a ``r’\s+’``. Una :exc:`FutureWarning` se emitió para tales patrones desde Python 3.5.

source: For patterns that match both empty and non-empty strings, the result of searching for all matches may also be changed in other cases. For example in the string ``'a\n\n'``, the pattern ``r'(?m)^\s*?$'`` will not only match empty strings at positions 2 and 3, but also the string ``'\n'`` at positions 2--3. To match only blank lines, the pattern should be rewritten as ``r'(?m)^[^\S\n]*$'``.
es_ec: Para patrones que coinciden con cadenas vacías y no vacías, el resultado de la búsqueda de todas las coincidencias también puede cambiarse en otros casos. Por ejemplo en la cadena ``'a\n\n'``, el patrón ``’\n'`` no solo coincidirá con cadenas vacías en las posiciones 2 y 3, sino también la cadena ``'\n'`` en las posiciones 2–3. Para hacer coincidir solo líneas en blanco, el patrón debe reescribirse como ``r'(?m)^[^\S\n]*$'``.

source: :func:`re.sub()` now replaces empty matches adjacent to a previous non-empty match. For example ``re.sub('x*', '-', 'abxd')`` returns now ``'-a-b--d-'`` instead of ``'-a-b-d-'`` (the first minus between 'b' and 'd' replaces 'x', and the second minus replaces an empty string between 'x' and 'd').
es_ec: :func:`re.sub()` ahora reemplaza las coincidencias vacías adyacentes a una coincidencia anterior no vacía. Por ejemplo ``re.sub(‘x*’, ‘-‘, ‘abxd’)`` retorno ahora ``’-a-b—d-‘`` en lugar de ``’-a-b-d-‘`` (el primer signo menos entre ‘b’ y ‘d’ reemplaza a ‘x’, y el segundo signo menos reemplaza una cadena vacía entre ‘x’ y ‘d’).

source: (Contributed by Serhiy Storchaka in :issue:`25054` and :issue:`32308`.)
es_ec: (Contribuido por *Serhiy Storchaka* en :issue:`25054` y :issue:`32308`.)

source: Change :func:`re.escape` to only escape regex special characters instead of escaping all characters other than ASCII letters, numbers, and ``'_'``. (Contributed by Serhiy Storchaka in :issue:`29995`.)
es_ec: Cambie :func:`re.escape` para escapar solo de los caracteres especiales regex en lugar de escapar de todos los caracteres que no sean letras ASCII, números y ``’_’``. (Contribuido por *Serhiy Storchaka* en :issue:`29995`.)

source: :class:`tracemalloc.Traceback` frames are now sorted from oldest to most recent to be more consistent with :mod:`traceback`. (Contributed by Jesse Bakker in :issue:`32121`.)
es_ec: Los marcos :class:`tracemalloc.Traceback` ahora se ordenan del más antiguo al más reciente para ser más coherentes con :mod:`traceback`. (Contribuido por *Jesse Bakker* en :issue:`32121`.)

source: On OSes that support :const:`socket.SOCK_NONBLOCK` or :const:`socket.SOCK_CLOEXEC` bit flags, the :attr:`socket.type <socket.socket.type>` no longer has them applied. Therefore, checks like ``if sock.type == socket.SOCK_STREAM`` work as expected on all platforms. (Contributed by Yury Selivanov in :issue:`32331`.)
es_ec: En sistemas operativos que admiten banderas de bits :const:`socket.SOCK_NONBLOCK` o :const:`socket.SOCK_CLOEXEC`, el :attr:`socket.type <socket.socket.type>` ya no los tiene aplicados. Por lo tanto, comprobaciones como ``if sock.type == socket.SOCK_STREAM`` funcionan como se espera en todas las plataformas. (Contribuido por *Yury Selivanov* en :issue:`32331`.)

source: On Windows the default for the *close_fds* argument of :class:`subprocess.Popen` was changed from :const:`False` to :const:`True` when redirecting the standard handles. If you previously depended on handles being inherited when using :class:`subprocess.Popen` with standard io redirection, you will have to pass ``close_fds=False`` to preserve the previous behaviour, or use :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.
es_ec: En Windows, el valor predeterminado para el argumento *close_fds* de :class:`subprocess.Popen` se cambió de :const:`False` a :const:`True` al redirigir los identificadores estándar. Si anteriormente dependía de que los identificadores fueran heredados al usar :class:`subprocess.Popen` con la redirección estándar de io, tendrá que pasar ``close_fds=False`` para preservar el comportamiento anterior, o usar :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.

source: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- which implicitly affects :func:`importlib.invalidate_caches` -- now deletes entries in :data:`sys.path_importer_cache` which are set to ``None``. (Contributed by Brett Cannon in :issue:`33169`.)
es_ec: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- que afecta implícitamente a :func:`importlib.invalidate_caches` -- ahora borra entradas en :data:`sys.path_importer_cache` que están configuradas en ``None``. (Contribuido por *Brett Cannon* en :issue:`33169`.)

source: In :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` have been changed to be proper coroutine methods to match their documentation. Previously, these methods returned :class:`asyncio.Future` instances. (Contributed by Yury Selivanov in :issue:`32327`.)
es_ec: En :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` se han cambiado para que sean métodos de rutina adecuados para que coincidan con su documentación. Anteriormente, estos métodos devolvían instancias :class:`asyncio.Future`. (Contribuido por *Yury Selivanov* en :issue:`32327`.)

source: :attr:`asyncio.Server.sockets` now returns a copy of the internal list of server sockets, instead of returning it directly. (Contributed by Yury Selivanov in :issue:`32662`.)
es_ec: :attr:`asyncio.Server.sockets` ahora devuelve una copia de la lista interna de sockets del servidor, en lugar de devolverla directamente. (Contribuido por *Yury Selivanov* en :issue:`32662`.)

source: :attr:`Struct.format <struct.Struct.format>` is now a :class:`str` instance instead of a :class:`bytes` instance. (Contributed by Victor Stinner in :issue:`21071`.)
es_ec: :attr:`Struct.format <struct.Struct.format>` es ahora una instancia :class:`str` en lugar de una instancia :class:`bytes`. (Contribuido por *Victor Stinner* en :issue:`21071`.)

source: :mod:`argparse` subparsers can now be made mandatory by passing ``required=True`` to :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Contributed by Anthony Sottile in :issue:`26510`.)
es_ec: :mod:`argparse` *subparsers* ahora pueden hacerse obligatorios pasando ``required=True`` a :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Contribuido por *Anthony Sottile* en :issue:`26510`.)

source: :meth:`ast.literal_eval()` is now stricter. Addition and subtraction of arbitrary numbers are no longer allowed. (Contributed by Serhiy Storchaka in :issue:`31778`.)
es_ec: :meth:`ast.literal_eval()` ahora es más estricto. Ya no se permiten sumas y restas de números arbitrarios. (Contribuido por *Serhiy Storchaka* en :issue:`31778`.)

source: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` will now consistently raise an exception when a date falls outside of the ``0001-01-01`` through ``9999-12-31`` range. To support applications that cannot tolerate such exceptions, the new :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` and :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>` can be used. The new methods return tuples and are not restricted by the range supported by :class:`datetime.date`. (Contributed by Alexander Belopolsky in :issue:`28292`.)
es_ec: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` ahora lanzará una excepción cuando una fecha cae fuera del rango de ``0001-01-01`` a ``9999-12-31``. Para admitir aplicaciones que no pueden tolerar tales excepciones, se puede utilizar el nuevo :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` y :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>`. Los nuevos métodos devuelven tuplas y no están restringidos por el rango admitido por :class:`datetime.date`. (Contribuido por *Alexander Belopolsky* en :issue:`28292`.)

source: :class:`collections.ChainMap` now preserves the order of the underlying mappings. (Contributed by Raymond Hettinger in :issue:`32792`.)
es_ec: :class:`collections.ChainMap` ahora conserva el orden de las asignaciones subyacentes. (Contribuido por *Raymond Hettinger* en :issue:`32792`.)

source: The ``submit()`` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor` now raises a :exc:`RuntimeError` if called during interpreter shutdown. (Contributed by Mark Nemec in :issue:`33097`.)
es_ec: El método ``submit()`` de :class:`concurrent.futures.ThreadPoolExecutor` y :class:`concurrent.futures.ProcessPoolExecutor` ahora genera un :exc:`RuntimeError` si se llama durante el cierre del intérprete. (Contribuido por *Mark Nemec* en :issue:`33097`.)

source: The :class:`configparser.ConfigParser` constructor now uses ``read_dict()`` to process the default values, making its behavior consistent with the rest of the parser. Non-string keys and values in the defaults dictionary are now being implicitly converted to strings. (Contributed by James Tocknell in :issue:`23835`.)
es_ec: El constructor :class:`configparser.ConfigParser` ahora usa ``read_dict()`` para procesar los valores predeterminados, haciendo que su comportamiento sea coherente con el resto del analizador. Las claves y los valores que no son cadenas en el diccionario de valores predeterminados ahora se están convirtiendo implícitamente en cadenas. (Contribuido por *James Tocknell* en :issue:`23835`.)

source: Several undocumented internal imports were removed. One example is that ``os.errno`` is no longer available; use ``import errno`` directly instead. Note that such undocumented internal imports may be removed any time without notice, even in micro version releases.
es_ec: Se eliminaron varias importaciones internas indocumentadas. Un ejemplo es que ``os.errno`` ya no está disponible; use ``import errno`` directamente en su lugar. Tenga en cuenta que estas importaciones internas no documentadas pueden eliminarse en cualquier momento sin previo aviso, incluso en las versiones micro.

source: Changes in the C API
es_ec: Cambios en la API de C

source: The function :c:func:`PySlice_GetIndicesEx` is considered unsafe for resizable sequences. If the slice indices are not instances of :class:`int`, but objects that implement the :meth:`!__index__` method, the sequence can be resized after passing its length to :c:func:`!PySlice_GetIndicesEx`. This can lead to returning indices out of the length of the sequence. For avoiding possible problems use new functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
es_ec: La función :c:func:`PySlice_GetIndicesEx` se considera insegura para secuencias de tamaño variable. Si los índices de corte no son instancias de :class:`int`, sino objetos que implementan el método :meth:`!__index__`, la secuencia se puede cambiar de tamaño después de pasar su longitud a :c:func:`!PySlice_GetIndicesEx`. Esto puede llevar a que se devuelvan índices fuera de la longitud de la secuencia. Esto puede llevar a devolver índices fuera de la longitud de la secuencia. Para evitar posibles problemas, use las nuevas funciones :c:func:`PySlice_Unpack` y :c:func:`PySlice_AdjustIndices`. (Contribuido por *Serhiy Storchaka* en :issue:`27867`.)

source: CPython bytecode changes
es_ec: Cambios en el código de bytes de CPython

source: There are two new opcodes: :opcode:`LOAD_METHOD` and :opcode:`CALL_METHOD`. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26110`.)
es_ec: Hay dos nuevos códigos de operación: :opcode:`LOAD_METHOD` y :opcode:`CALL_METHOD`. (Contribuido por *Yury Selivanov* y *INADA Naoki* en :issue:`26110`.)

source: The :opcode:`STORE_ANNOTATION` opcode has been removed. (Contributed by Mark Shannon in :issue:`32550`.)
es_ec: El código de operación :opcode:`STORE_ANNOTATION` ha sido removido. (Contribuido por *Mark Shannon* en :issue:`32550`.)

source: The file used to override :data:`sys.path` is now called ``<python-executable>._pth`` instead of ``'sys.path'``. See :ref:`windows_finding_modules` for more information. (Contributed by Steve Dower in :issue:`28137`.)
es_ec: El archivo utilizado para anular :data:`sys.path` ahora se llama ``<python-executable>._pth`` en lugar de ``'sys.path'``. Consulte :ref:`windows_finding_modules` para obtener más información. (Aportado por Steve Dower en :issue:`28137`.)

source: Other CPython implementation changes
es_ec: Otra implementación de cambios en CPython
