Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: `Measurements <https://peps.python.org/pep-0564/#annex-clocks-resolution-in-python>`_ show that on Linux and Windows the resolution of :func:`time.time_ns` is approximately 3 times better than that of :func:`time.time`.
es_ec: `Measurements <https://peps.python.org/pep-0564/#annex-clocks-resolution-in-python>`_ muestra que en Linux y Windows la resolución de :func:`time.time_ns` es aproximadamente 3 veces mejor que la de :func:`time.time`.

source: :pep:`564` -- Add new time functions with nanosecond resolution
es_ec: :pep:`564` -- Agrega nuevas funciones de tiempo y resolución de nanosegundos

source: PEP 565: Show DeprecationWarning in ``__main__``
es_ec: PEP 565: Mostrar *DeprecationWarning* en ``__main__``

source: The default handling of :exc:`DeprecationWarning` has been changed such that these warnings are once more shown by default, but only when the code triggering them is running directly in the :mod:`__main__` module. As a result, developers of single file scripts and those using Python interactively should once again start seeing deprecation warnings for the APIs they use, but deprecation warnings triggered by imported application, library and framework modules will continue to be hidden by default.
es_ec: El manejo predeterminado de :exc:`DeprecationWarning` Se ha cambiado de modo que estas advertencias se muestren una vez más de forma predeterminada, pero solo cuando el código que las activa se ejecuta directamente en el módulo :mod:`__main__`. Como resultado, los desarrolladores de scripts de un solo archivo y aquellos que usan Python de forma interactiva deberían comenzar a ver una vez más advertencias de desaprobación para las API que usan, pero las advertencias de desaprobación activadas por la aplicación importada, la biblioteca y los módulos de marco seguirán ocultos de forma predeterminada.

source: As a result of this change, the standard library now allows developers to choose between three different deprecation warning behaviours:
es_ec: Como resultado de este cambio, la biblioteca estándar ahora permite a los desarrolladores elegir entre tres comportamientos de advertencia de obsolescencia diferentes:

source: :exc:`FutureWarning`: always displayed by default, recommended for warnings intended to be seen by application end users (e.g. for deprecated application configuration settings).
es_ec: :exc:`FutureWarning`: siempre se muestra por defecto, recomendado para las advertencias destinadas a los usuarios finales de la aplicación (por ejemplo, para los ajustes de configuración de la aplicación obsoletos).

source: :exc:`DeprecationWarning`: displayed by default only in :mod:`__main__` and when running tests, recommended for warnings intended to be seen by other Python developers where a version upgrade may result in changed behaviour or an error.
es_ec: :exc:`DeprecationWarning`: se muestra por defecto solo en :mod:`__main__` y cuando se ejecutan pruebas, se recomienda para advertencias destinadas a ser vistas por otros desarrolladores de Python donde una actualización de la versión puede resultar en un cambio de comportamiento o un error.

source: :exc:`PendingDeprecationWarning`: displayed by default only when running tests, intended for cases where a future version upgrade will change the warning category to :exc:`DeprecationWarning` or :exc:`FutureWarning`.
es_ec: :exc:`PendingDeprecationWarning`: se muestra de forma predeterminada solo cuando se ejecutan pruebas, diseñado para casos en los que una actualización de versión futura cambiará la categoría de advertencia a :exc:`DeprecationWarning` o :exc:`FutureWarning`.

source: Previously both :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning` were only visible when running tests, which meant that developers primarily writing single file scripts or using Python interactively could be surprised by breaking changes in the APIs they used.
es_ec: Anteriormente ambos :exc:`DeprecationWarning` y :exc:`PendingDeprecationWarning` solo eran visibles cuando se ejecutaban pruebas, lo que significaba que los desarrolladores que escribían principalmente scripts de un solo archivo o usaban Python de forma interactiva podrían sorprenderse al ver cambios importantes en las API que usaban.

source: :pep:`565` -- Show DeprecationWarning in ``__main__``
es_ec: :pep:`565` -- Muestra *DeprecationWarning* en ``__main__``

source: PEP written and implemented by Nick Coghlan
es_ec: PEP escrito y implementado por *Nick Coghlan*

source: PEP 560: Core Support for ``typing`` module and Generic Types
es_ec: PEP 560: Soporte básico para el módulo de ``typing`` y tipos genéricos

source: Initially :pep:`484` was designed in such way that it would not introduce *any* changes to the core CPython interpreter. Now type hints and the :mod:`typing` module are extensively used by the community, so this restriction is removed. The PEP introduces two special methods :meth:`__class_getitem__` and ``__mro_entries__``, these methods are now used by most classes and special constructs in :mod:`typing`. As a result, the speed of various operations with types increased up to 7 times, the generic types can be used without metaclass conflicts, and several long standing bugs in :mod:`typing` module are fixed.
es_ec: Inicialmente :pep:`484` fue diseñado de tal manera que no introduciría * ningún * cambio en el intérprete principal de CPython. Ahora escriba sugerencias y el módulo :mod:`typing` son ampliamente utilizados por la comunidad, por lo que se elimina esta restricción. El PEP introduce dos métodos especiales :meth:`__class_getitem__` y ``__mro_entries__``, estos métodos ahora son utilizados por la mayoría de las clases y construcciones especiales en :mod:`typing`. Como resultado, la velocidad de varias operaciones con tipos aumentó hasta 7 veces, los tipos genéricos se pueden usar sin conflictos de metaclase, y varios errores de larga data en el módulo :mod:`typing` han sido arreglados.

source: :pep:`560` -- Core support for typing module and generic types
es_ec: :pep:`560` -- Soporte básico para el modulo de escritura y tipos genéricos

source: PEP 552: Hash-based .pyc Files
es_ec: PEP 552: Archivos .pyc basados en hash

source: Python has traditionally checked the up-to-dateness of bytecode cache files (i.e., ``.pyc`` files) by comparing the source metadata (last-modified timestamp and size) with source metadata saved in the cache file header when it was generated. While effective, this invalidation method has its drawbacks. When filesystem timestamps are too coarse, Python can miss source updates, leading to user confusion. Additionally, having a timestamp in the cache file is problematic for `build reproducibility <https://reproducible-builds.org/>`_ and content-based build systems.
es_ec: Python ha verificado tradicionalmente la actualización de los archivos de caché de código de bytes (es decir, archivos ``.pyc``) comparando los metadatos de origen (marca de tiempo y tamaño de última modificación) con la fuente de metadatos guardados en el encabezado del archivo de caché cuando se generó. Si bien es efectivo, este método de invalidación tiene sus inconvenientes. Cuando las marcas de tiempo del sistema de archivos son demasiado burdas, Python puede perder las actualizaciones de origen, lo que genera confusión en el usuario. Además, tener una marca de tiempo en el archivo de caché es problemático para `construir reproducibilidad <https://reproducible-builds.org/>`_ y sistemas de construcción basados en contenido.

source: :pep:`552` extends the pyc format to allow the hash of the source file to be used for invalidation instead of the source timestamp. Such ``.pyc`` files are called "hash-based". By default, Python still uses timestamp-based invalidation and does not generate hash-based ``.pyc`` files at runtime. Hash-based ``.pyc`` files may be generated with :mod:`py_compile` or :mod:`compileall`.
es_ec: :pep:`552` extendiendo el formato *ppc* para permitir que el hash del archivo de origen se utilice para invalidación en lugar de la marca de tiempo de origen. Estos archivos ``.pyc`` se denominan “hash-based”. Por defecto, Python todavía usa la invalidación basada en la marca de tiempo y no genera archivos ``.pyc`` basados en has de tiempos de ejecución. Los archivos ``.pyc`` basados en hash se pueden generar con :mod:`py_compile` o :mod:`compileall`.

source: Hash-based ``.pyc`` files come in two variants: checked and unchecked. Python validates checked hash-based ``.pyc`` files against the corresponding source files at runtime but doesn't do so for unchecked hash-based pycs. Unchecked hash-based ``.pyc`` files are a useful performance optimization for environments where a system external to Python (e.g., the build system) is responsible for keeping ``.pyc`` files up-to-date.
es_ec: Archivos ``.pyc`` basados en hash Vienen en dos variantes: marcada y no marcada. Python valida los archivos ``.pyc`` basados en hash comprobados con los archivos de origen correspondientes en tiempo de ejecución, pero no lo hace para *pycs* basados en hash no verificados. Archivos ``.pyc`` no comprobados son una optimización de rendimiento útil para entornos donde un sistema externo a Python (por ejemplo, el sistema de compilación) es responsable de mantener actualizados los archivos ``.pyc``.

source: See :ref:`pyc-invalidation` for more information.
es_ec: Consultar :ref:`pyc-invalidation` para mas información.

source: :pep:`552` -- Deterministic pycs
es_ec: :pep:`552` -- *Pycs* deterministas

source: PEP written and implemented by Benjamin Peterson
es_ec: PEP escrito y implementado por *Benjamin Peterson*

source: PEP 545: Python Documentation Translations
es_ec: PEP 545: Traducciones de Documentaciones de Python

source: :pep:`545` describes the process of creating and maintaining Python documentation translations.
es_ec: :pep:`545` describe el proceso de creación y mantenimiento de traducciones de documentación de Python.

source: Three new translations have been added:
es_ec: Tres nuevas traducciones han sido agregadas:

source: Japanese: https://docs.python.org/ja/
es_ec: Japonés: https://docs.python.org/ja/

source: French: https://docs.python.org/fr/
es_ec: Francés: https://docs.python.org/fr/

source: Korean: https://docs.python.org/ko/
es_ec: Coreano: https://docs.python.org/ko/

source: :pep:`545` -- Python Documentation Translations
es_ec: :pep:`545` -- Traducciones de Documentación de *Python*

source: PEP written and implemented by Julien Palard, Inada Naoki, and Victor Stinner.
es_ec: PEP escrito y implementado por *Julien Palard*, *Inada Naoki* y *Victor Stinner*.

source: Python Development Mode (-X dev)
es_ec: Modo de desarrollo de Python (-X dev)

source: The new :option:`-X` ``dev`` command line option or the new :envvar:`PYTHONDEVMODE` environment variable can be used to enable :ref:`Python Development Mode <devmode>`. When in development mode, Python performs additional runtime checks that are too expensive to be enabled by default. See :ref:`Python Development Mode <devmode>` documentation for the full description.
es_ec: La nueva opción :option:`-X` ``dev`` opción de línea de comando o la nueva variable de entorno :envvar:`PYTHONDEVMODE` se puede usar para habilitar :ref:`Python Development Mode <devmode>`. Cuando está en modo de desarrollo, Python realiza comprobaciones de tiempo de ejecución adicionales que son demasiado caras para habilitarse de forma predeterminada. Ver :ref:`Python Development Mode <devmode>` documentación para la descripción completa.

source: Other Language Changes
es_ec: Otros cambios en el lenguaje

source: An :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in :ref:`formatted string literals <f-strings>` due to a problem with the implementation. In Python 3.7 this restriction was lifted.
es_ec: Una expresión :keyword:`await` y compresiones que contienen una cláusula :keyword:`async for` eran ilegales en las expresiones en :ref:`formatted string literals <f-strings>` debido a un problema con la implementación. En Python 3.7 se eliminó esta restricción.

source: More than 255 arguments can now be passed to a function, and a function can now have more than 255 parameters. (Contributed by Serhiy Storchaka in :issue:`12844` and :issue:`18896`.)
es_ec: Ahora se pueden pasar más de 255 argumentos a una función y una función ahora puede tener más de 255 parámetros. (Contribuido por *Serhiy Storchaka* en :issue:`12844` y :issue:`18896`.)

source: :meth:`bytes.fromhex` and :meth:`bytearray.fromhex` now ignore all ASCII whitespace, not only spaces. (Contributed by Robert Xiao in :issue:`28927`.)
es_ec: :meth:`bytes.fromhex` y :meth:`bytearray.fromhex` ahora ignore todos los espacios en blanco ASCII, no solo los espacios. (Contribuido por *Robert Xiao* en :issue:`28927`.)

source: :class:`str`, :class:`bytes`, and :class:`bytearray` gained support for the new :meth:`isascii() <str.isascii>` method, which can be used to test if a string or bytes contain only the ASCII characters. (Contributed by INADA Naoki in :issue:`32677`.)
es_ec: :class:`str`, :class:`bytes`, y :class:`bytearray` adquirió soporte para el nuevo método :meth:`isascii() <str.isascii>`, que se puede usar para probar si una cadena o bytes contienen solo los caracteres ASCII. (Contribuido por *INADA Naoki* en :issue:`32677`.)

source: :exc:`ImportError` now displays module name and module ``__file__`` path when ``from ... import ...`` fails. (Contributed by Matthias Bussonnier in :issue:`29546`.)
es_ec: :exc:`ImportError` ahora muestra el nombre del módulo y la ruta del módulo ``__file__`` cuando falla ``from … import …``. (Contribuido por *Matthias Bussonnier* en :issue:`29546`.)

source: Circular imports involving absolute imports with binding a submodule to a name are now supported. (Contributed by Serhiy Storchaka in :issue:`30024`.)
es_ec: Ahora se admiten las importaciones circulares que involucran importaciones absolutas con un submódulo vinculado a un nombre. (Contribuido por *Serhiy Storchaka* en :issue:`30024`.)

source: ``object.__format__(x, '')`` is now equivalent to ``str(x)`` rather than ``format(str(self), '')``. (Contributed by Serhiy Storchaka in :issue:`28974`.)
es_ec: ``object.__format__(x, ‘’)`` ahora es equivalente a ``str(x)`` antes que ``format(str(self), ‘’)``. (Contribuido por *Serhiy Storchaka* en :issue:`28974`.)

source: In order to better support dynamic creation of stack traces, :class:`types.TracebackType` can now be instantiated from Python code, and the ``tb_next`` attribute on :ref:`tracebacks <traceback-objects>` is now writable. (Contributed by Nathaniel J. Smith in :issue:`30579`.)
es_ec: Para soportar mejor la creación dinámica de seguimientos de pila, :class:`types.TracebackType` ahora se puede crear una instancia desde el código Python, y el atributo ``tb_next`` en on :ref:`rastreos <traceback-objects>` ahora se puede escribir. (Contribuido por *Nathaniel J. Smith* en :issue:`30579`.)

source: When using the :option:`-m` switch, ``sys.path[0]`` is now eagerly expanded to the full starting directory path, rather than being left as the empty directory (which allows imports from the *current* working directory at the time when an import occurs) (Contributed by Nick Coghlan in :issue:`33053`.)
es_ec: Al usar la :option:`-m` switch, ``sys.path[0]`` ahora se expande con entusiasmo a la ruta completa del directorio de inicio, en lugar de dejarse como el directorio vacío (que permite importaciones desde el directorio de trabajo * actual * en el momento en que ocurre una importación) (Contribuido por *Nick Coghlan* en :issue:`33053`.)

source: The new :option:`-X` ``importtime`` option or the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable can be used to show the timing of each module import. (Contributed by Inada Naoki in :issue:`31415`.)
es_ec: La nueva opción :option:`-X` ``importtime`` o la variable de entorno :envvar:`PYTHONPROFILEIMPORTTIME` pueden usarse para mostrar el tiempo de cada importación de módulos. (Contribuido por Inada Naoki en :issue:`31415`.)

source: New Modules
es_ec: Nuevos módulos

source: The new :mod:`contextvars` module and a set of :ref:`new C APIs <contextvarsobjects>` introduce support for *context variables*. Context variables are conceptually similar to thread-local variables. Unlike TLS, context variables support asynchronous code correctly.
es_ec: El nuevo módulo :mod:`contextvars` y un conjunto de :ref:`nuevas APIs C <contextvarsobjects>` introducir soporte para *variables de contexto*. Las variables de contexto son conceptualmente similares a las variables locales del proceso. A diferencia de TLS, las variables de contexto admiten l código asincrónico correctamente.

source: The :mod:`asyncio` and :mod:`decimal` modules have been updated to use and support context variables out of the box. Particularly the active decimal context is now stored in a context variable, which allows decimal operations to work with the correct context in asynchronous code.
es_ec: Los módulos :mod:`asyncio` y :mod:`decimal` se han actualizado para utilizar y admitir variables de contexto listas para usar. En particular, el contexto decimal activo ahora se almacena en una variable de contexto, lo que permite que las operaciones decimales funcionen con el contexto correcto en código asincrónico.

source: :pep:`567` -- Context Variables
es_ec: :pep:`567` -- Variables de Contexto

source: PEP written and implemented by Yury Selivanov
es_ec: PEP escrito y implementado por *Yury Selivanov*

source: The new :func:`~dataclasses.dataclass` decorator provides a way to declare *data classes*. A data class describes its attributes using class variable annotations. Its constructor and other magic methods, such as :meth:`~object.__repr__`, :meth:`~object.__eq__`, and :meth:`~object.__hash__` are generated automatically.
es_ec: El nuevo decorador :func:`~dataclasses.dataclass` proporciona una forma de declarar *data classes*. Una clase de datos describe sus atributos usando anotaciones de variables de clase. Su constructor y otros métodos mágicos, como :meth:`~object.__repr__`, :meth:`~object.__eq__`, y :meth:`~object.__hash__` se generan automáticamente.

source: Example::
es_ec: Ejemplo:

source: :pep:`557` -- Data Classes
es_ec: :pep:`557` -- Clases de Datos

source: PEP written and implemented by Eric V. Smith
es_ec: PEP escrito y implementado por *Eric V. Smith*

source: The new :mod:`importlib.resources` module provides several new APIs and one new ABC for access to, opening, and reading *resources* inside packages. Resources are roughly similar to files inside packages, but they needn't be actual files on the physical file system. Module loaders can provide a :meth:`get_resource_reader()` function which returns a :class:`importlib.abc.ResourceReader` instance to support this new API. Built-in file path loaders and zip file loaders both support this.
es_ec: El nuevo módulo :mod:`importlib.resources` proporciona varias API nuevas y un ABC nuevo para acceder, abrir y leer * recursos * dentro de los paquetes. Los recursos son más o menos similares a los archivos dentro de los paquetes, pero no es necesario que sean archivos reales en el sistema de archivos físico. Los cargadores de módulos proporcionar una función :meth:`get_resource_reader()` que devuelve una instancia :class:`importlib.abc.ResourceReader` para admitir esta nueva API. Los cargadores de ruta de archivo integrados y los cargadores de archivos zip admiten esto.

source: Contributed by Barry Warsaw and Brett Cannon in :issue:`32248`.
es_ec: Contribuido por *Barry Warsaw* y *Brett Cannon* en :issue:`32248`.

source: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ -- a PyPI backport for earlier Python versions.
es_ec: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_: un backport de PyPI para versiones anteriores de Python.

source: Improved Modules
es_ec: Módulos mejorados

source: The new :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` method allows intermixing options and positional arguments. (Contributed by paul.j3 in :issue:`14191`.)
es_ec: El nuevo método :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` permite permite entremezclar opciones y argumentos posicionales. (Contribuido por *paul.j3* en :issue:`14191`.)

source: The :mod:`asyncio` module has received many new features, usability and :ref:`performance improvements <whatsnew37-asyncio-perf>`. Notable changes include:
es_ec: El modulo :mod:`asyncio` ha recibido muchas funciones nuevas, usabilidad y :ref:`mejoras de rendimiento <whatsnew37-asyncio-perf>`. Los cambios notables incluyen:

source: The new :term:`provisional <provisional API>` :func:`asyncio.run` function can be used to run a coroutine from synchronous code by automatically creating and destroying the event loop. (Contributed by Yury Selivanov in :issue:`32314`.)
es_ec: La nueva función :term:`provisional <provisional API>` :func:`asyncio.run` se puede utilizar para ejecutar una corrutina desde código síncrono creando y destruyendo automáticamente el bucle de eventos. (Contribuido por *Yury Selivanov* en :issue:`32314`.)

source: asyncio gained support for :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop.call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>`, and :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` have a new optional keyword-only *context* parameter. :class:`Tasks <asyncio.Task>` now track their context automatically. See :pep:`567` for more details. (Contributed by Yury Selivanov in :issue:`32436`.)
es_ec: asyncio adquirió soporte para :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop.call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>`, y :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` tener un nuevo parámetro opcional * de contexto * solo de palabras clave. :class:`Tasks <asyncio.Task>` ahora rastrea su contexto automáticamente. Ver :pep:`567` para mas detalles. (Contribuido por *Yury Selivanov* en :issue:`32436`.)

source: The new :func:`asyncio.create_task` function has been added as a shortcut to ``asyncio.get_event_loop().create_task()``. (Contributed by Andrew Svetlov in :issue:`32311`.)
es_ec: La nueva función :func:`asyncio.create_task`se ha agregado como un atajo a ``asyncio.get_event_loop().create_task()``. (Contribuido por *Andrew Svetlov* en :issue:`32311`.)

source: The new :meth:`loop.start_tls() <asyncio.loop.start_tls>` method can be used to upgrade an existing connection to TLS. (Contributed by Yury Selivanov in :issue:`23749`.)
es_ec: El nuevo método :meth:`loop.start_tls() <asyncio.loop.start_tls>` puede ser usado para actualizar una conexión existente para TLS. (Contribuido por *Yury Selivanov* en :issue:`23749`.)

source: The new :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` method allows reading data from a socket directly into a provided buffer making it possible to reduce data copies. (Contributed by Antoine Pitrou in :issue:`31819`.)
es_ec: El nuevo método :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` permite leer datos de un socket directamente en un búfer proporcionado, lo que permite reducir las copias de datos. (Contribuido por *Antoine Pitrou* en :issue:`31819`.)
