Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: In preparation for potential future changes to the public CPython runtime initialization API (see :pep:`432` for an initial, but somewhat outdated, draft), CPython's internal startup and configuration management logic has been significantly refactored. While these updates are intended to be entirely transparent to both embedding applications and users of the regular CPython CLI, they're being mentioned here as the refactoring changes the internal order of various operations during interpreter startup, and hence may uncover previously latent defects, either in embedding applications, or in CPython itself. (Initially contributed by Nick Coghlan and Eric Snow as part of :issue:`22257`, and further updated by Nick, Eric, and Victor Stinner in a number of other issues). Some known details affected:
es_ec: En preparación para posibles cambios futuros en la API pública de inicialización del tiempo de ejecución de CPython (ver :pep:`432` para un borrador inicial, pero algo desactualizado), La lógica de gestión de configuración y puesta en marcha interna de CPython se ha re-factorizado significativamente. Si bien estas actualizaciones están destinadas a ser completamente transparentes tanto para las aplicaciones integradas como para los usuarios de la CLI de CPython normal, se mencionan aquí ya que la refactorización cambia el orden interno de varias operaciones durante el inicio del intérprete y, por lo tanto, pueden descubrir defectos previamente latentes, ya sea en aplicaciones incrustadas, o en el propio CPython. ( Inicialmente contribuido por *Nick Coghlan* y *Eric Snow* como parte de :issue:`22257`, y actualizado por *Nick*, *Eric*, y *Victor Stinner* en varios otros números). Algunos detalles conocidos afectados:

source: :c:func:`PySys_AddWarnOptionUnicode` is not currently usable by embedding applications due to the requirement to create a Unicode object prior to calling ``Py_Initialize``. Use :c:func:`PySys_AddWarnOption` instead.
es_ec: Actualmente, :c:func:`PySys_AddWarnOptionUnicode` no se puede usar mediante la incorporación de aplicaciones debido al requisito de crear un objeto Unicode antes de llamar a ``Py_Initialize``. Utilice :c:func:`PySys_AddWarnOption` en su lugar.

source: warnings filters added by an embedding application with :c:func:`PySys_AddWarnOption` should now more consistently take precedence over the default filters set by the interpreter
es_ec: filtros de advertencias agregados por una aplicación de incrustación con :c:func:`PySys_AddWarnOption` ahora debería tener prioridad sobre los filtros predeterminados establecidos por el intérprete

source: Due to changes in the way the default warnings filters are configured, setting :c:data:`Py_BytesWarningFlag` to a value greater than one is no longer sufficient to both emit :exc:`BytesWarning` messages and have them converted to exceptions. Instead, the flag must be set (to cause the warnings to be emitted in the first place), and an explicit ``error::BytesWarning`` warnings filter added to convert them to exceptions.
es_ec: Debido a cambios en la forma en que se configuran los filtros de advertencias predeterminados, establecer :c:data:`Py_BytesWarningFlag` en un valor mayor que uno ya no es suficiente para que ambos emitan mensajes :exc:`BytesWarning` y los conviertan en excepciones. En su lugar, se debe establecer la bandera (para hacer que las advertencias se emitan en primer lugar) y se debe agregar un filtro de advertencias explícito ``error::BytesWarning`` para convertirlas en excepciones.

source: Due to a change in the way docstrings are handled by the compiler, the implicit ``return None`` in a function body consisting solely of a docstring is now marked as occurring on the same line as the docstring, not on the function's header line.
es_ec: Debido a un cambio en la forma en que el compilador maneja las cadenas de documentos, el implícito ``return None`` en el cuerpo de una función que consiste únicamente en una cadena de documentos ahora se marca como ocurriendo en la misma línea que la cadena de documentos, no en la línea de encabezado de la función.

source: The current exception state has been moved from the frame object to the co-routine. This simplified the interpreter and fixed a couple of obscure bugs caused by having swap exception state when entering or exiting a generator. (Contributed by Mark Shannon in :issue:`25612`.)
es_ec: El estado de excepción actual se ha movido del objeto de trama a la co-rutina. Esto simplificó el intérprete y corrigió un par de errores oscuros causados por tener un estado de excepción de intercambio al ingresar o salir de un generador. (Contribuido por *Mark Shannon* en :issue:`25612`.)

source: Notable changes in Python 3.7.1
es_ec: Cambios notables en Python 3.7.1

source: Starting in 3.7.1, :c:func:`Py_Initialize` now consistently reads and respects all of the same environment settings as :c:func:`Py_Main` (in earlier Python versions, it respected an ill-defined subset of those environment variables, while in Python 3.7.0 it didn't read any of them due to :issue:`34247`). If this behavior is unwanted, set :c:data:`Py_IgnoreEnvironmentFlag` to 1 before calling :c:func:`Py_Initialize`.
es_ec: A partir de 3.7.1, :c:func:`Py_Initialize` ahora lee y respeta constantemente todos los mismos ajustes de entorno que :c:func:`Py_Main` (en versiones anteriores de Python, respetaba un subconjunto mal definido de esas variables de entorno, mientras que en Python 3.7.0 no leyó ninguna de ellas debido a :issue:`34247`). Si este comportamiento no es deseado, establezca :c:data:`Py_IgnoreEnvironmentFlag` en 1 antes de llamar a :c:func:`Py_Initialize`.

source: In 3.7.1 the C API for Context Variables :ref:`was updated <contextvarsobjects_pointertype_change>` to use :c:type:`PyObject` pointers. See also :issue:`34762`.
es_ec: En 3.7.1 la API C para las variables de Contexto :ref:`ha sido actualizada <contextvarsobjects_pointertype_change>` para usar punteros :c:type:`PyObject`. Ver también :issue:`34762`.

source: In 3.7.1 the :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
es_ec: En 3.7.1 el módulo :mod:`tokenize` ahora emite un token ``NEWLINE`` cuando se le proporciona una entrada que no tiene una nueva línea al final. Este comportamiento ahora coincide con lo que hace el tokenizador C internamente. (Contribuido por *Ammar Askar* en :issue:`33899`.)

source: Notable changes in Python 3.7.2
es_ec: Cambios notables en Python 3.7.2

source: In 3.7.2, :mod:`venv` on Windows no longer copies the original binaries, but creates redirector scripts named ``python.exe`` and ``pythonw.exe`` instead. This resolves a long standing issue where all virtual environments would have to be upgraded or recreated with each Python update. However, note that this release will still require recreation of virtual environments in order to get the new scripts.
es_ec: En 3.7.2, :mod:`venv` en Windows ya no copia los binarios originales, sino que crea scripts de redireccionamiento llamados ``python.exe`` y ``pythonw.exe`` en su lugar. Esto resuelve un problema de larga data en el que todos los entornos virtuales tendrían que actualizarse o recrearse con cada actualización de Python. Sin embargo, tenga en cuenta que esta versión aún requerirá la recreación de entornos virtuales para obtener los nuevos scripts.

source: Notable changes in Python 3.7.6
es_ec: Cambios notables en Python 3.7.6

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
es_ec: Debido a importantes problemas de seguridad, el parámetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` ya no es compatible. Esto se debe al comportamiento de la opción socket ``SO_REUSEADDR`` en UDP. Para obtener más detalles, consulte la documentación de ``loop.create_datagram_endpoint()``. (Contribuido por *Kyle Stanley*, *Antoine Pitrou*, y *Yury Selivanov* en :issue:`37228`.)

source: Notable changes in Python 3.7.10
es_ec: Cambios notables en Python 3.7.10

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
es_ec: Las versiones anteriores de Python permitían usar tanto ``;`` como ``&`` como separadores de parámetros de consulta en :func:`urllib.parse.parse_qs` y :func:`urllib.parse.parse_qsl`. Debido a problemas de seguridad y para cumplir con las recomendaciones más recientes del W3C, esto se ha cambiado para permitir solo una clave separadora, con ``&`` como valor predeterminado. Este cambio también afecta a :func:`cgi.parse` y :func:`cgi.parse_multipart` ya que utilizan las funciones afectadas internamente. Para obtener más detalles, consulte su documentación respectiva. (Contribuido por Adam Goldschmidt, Senthil Kumaran y Ken Jin en :issue:`42967`.)
