Repository: python/python-docs-es
Catalog: whatsnew/3.7.po
Languages: es_ec

source: The new :func:`asyncio.current_task` function returns the currently running :class:`~asyncio.Task` instance, and the new :func:`asyncio.all_tasks` function returns a set of all existing ``Task`` instances in a given loop. The :meth:`Task.current_task() <asyncio.Task.current_task>` and :meth:`Task.all_tasks() <asyncio.Task.all_tasks>` methods have been deprecated. (Contributed by Andrew Svetlov in :issue:`32250`.)
es_ec: La nueva función :func:`asyncio.current_task` devuelve la instancia actual en ejecución :class:`~asyncio.Task`, y la nueva función :func:`asyncio.all_tasks` devuelve un conjunto de todas las instancias de ``Task`` existentes en un bucle determinado. Los métodos :meth:`Task.current_task() <asyncio.Task.current_task>` y :meth:`Task.all_tasks() <asyncio.Task.all_tasks>` han quedado obsoletos. (Contribuido por *Andrew Svetlov* en :issue:`32250`.)

source: The new *provisional* :class:`~asyncio.BufferedProtocol` class allows implementing streaming protocols with manual control over the receive buffer. (Contributed by Yury Selivanov in :issue:`32251`.)
es_ec: La nueva clase *provisional* :class:`~asyncio.BufferedProtocol` permite implementar protocolos de transmisión con control manual sobre el búfer de recepción. (Contribuido por *Yury Selivanov* en :issue:`32251`.)

source: The new :func:`asyncio.get_running_loop` function returns the currently running loop, and raises a :exc:`RuntimeError` if no loop is running. This is in contrast with :func:`asyncio.get_event_loop`, which will *create* a new event loop if none is running. (Contributed by Yury Selivanov in :issue:`32269`.)
es_ec: La nueva función :func:`asyncio.get_running_loop` devuelve el bucle que se está ejecutando actualmente, y genera un :exc:`RuntimeError` si el bucle esta corriendo. Esto contrasta con :func:`asyncio.get_event_loop`, que * creará * un nuevo bucle de eventos si no se está ejecutando ninguno. (Contribuido por *Yury Selivanov* en :issue:`32269`.)

source: The new :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` coroutine method allows waiting until the stream writer is closed. The new :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` method can be used to determine if the writer is closing. (Contributed by Andrew Svetlov in :issue:`32391`.)
es_ec: El nuevo método de rutina :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` permite esperar hasta que se cierre el escritor de secuencias. El nuevo método :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` puede ser usado para determinar si el escritor esta cerrando. (Contribuido por *Andrew Svetlov* en :issue:`32391`.)

source: The new :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` coroutine method allows sending files using :mod:`os.sendfile` when possible. (Contributed by Andrew Svetlov in :issue:`32410`.)
es_ec: El nuevo método de rutina :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` permite enviar archivos usando :mod:`os.sendfile` cuando sea posible. (Contribuido por *Andrew Svetlov* en :issue:`32410`.)

source: The new :meth:`Future.get_loop() <asyncio.Future.get_loop>` and ``Task.get_loop()`` methods return the instance of the loop on which a task or a future were created. :meth:`Server.get_loop() <asyncio.Server.get_loop>` allows doing the same for :class:`asyncio.Server` objects. (Contributed by Yury Selivanov in :issue:`32415` and Srinivas Reddy Thatiparthy in :issue:`32418`.)
es_ec: El nuevo método :meth:`Future.get_loop() <asyncio.Future.get_loop>` y ``Task.get_loop()`` devuelve la instancia del bucle en el que se creó una tarea o un futuro. :meth:`Server.get_loop() <asyncio.Server.get_loop>` permite hacer lo mismo para objetos de :class:`asyncio.Server`. (Contribuido por *Yury Selivanov* en :issue:`32415` y *Srinivas Reddy Thatiparthy* en :issue:`32418`.)

source: It is now possible to control how instances of :class:`asyncio.Server` begin serving. Previously, the server would start serving immediately when created. The new *start_serving* keyword argument to :meth:`loop.create_server() <asyncio.loop.create_server>` and :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, as well as :meth:`Server.start_serving() <asyncio.Server.start_serving>`, and :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` can be used to decouple server instantiation and serving. The new :meth:`Server.is_serving() <asyncio.Server.is_serving>` method returns ``True`` if the server is serving. :class:`~asyncio.Server` objects are now asynchronous context managers::
es_ec: Ahora es posible controlar las instancias de :class:`asyncio.Server` cuando comienzan. Anteriormente, el servidor comenzaba a funcionar inmediatamente cuando se creaba. El nuevo argumento de palabra clave *start_serving* para :meth:`loop.create_server() <asyncio.loop.create_server>` y :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, así como :meth:`Server.start_serving() <asyncio.Server.start_serving>`, y :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` se puede usar para desacoplar la instanciación y el servicio de servidor. El nuevo método :meth:`Server.is_serving() <asyncio.Server.is_serving>` devuelve ``True`` si el servidor esta iniciando. :class:`~asyncio.Server` los objetos ahora son administradores de contexto asíncronos:

source: (Contributed by Yury Selivanov in :issue:`32662`.)
es_ec: (Contribuido por *Yury Selivanov* en :issue:`32662`.)

source: Callback objects returned by :func:`loop.call_later() <asyncio.loop.call_later>` gained the new :meth:`when() <asyncio.TimerHandle.when>` method which returns an absolute scheduled callback timestamp. (Contributed by Andrew Svetlov in :issue:`32741`.)
es_ec: Objetos de devolución de llamada devueltos por :func:`loop.call_later() <asyncio.loop.call_later>` conseguir el nuevo método :meth:`when() <asyncio.TimerHandle.when>` que devuelve una marca de tiempo de devolución de llamada programada absoluta. (Contribuido por *Andrew Svetlov* en :issue:`32741`.)

source: The :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` method gained support for Unix sockets. (Contributed by Quentin Dawans in :issue:`31245`.)
es_ec: El método :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` adquirió soporte para *sockets* *UNIX*.(Contribuido por *Quentin Dawans* en :issue:`31245`.)

source: The :func:`asyncio.open_connection`, :func:`asyncio.start_server` functions, :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` methods and their corresponding UNIX socket variants now accept the *ssl_handshake_timeout* keyword argument. (Contributed by Neil Aspinall in :issue:`29970`.)
es_ec: Los métodos :func:`asyncio.open_connection`, :func:`asyncio.start_server` functions, :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>`y sus correspondientes variantes de socket UNIX ahora aceptan el argumento de palabra clave *ssl_handshake_timeout*. (Contribuido por *Neil Aspinall* en :issue:`29970`.)

source: The new :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` method returns ``True`` if the callback was cancelled. (Contributed by Marat Sharafutdinov in :issue:`31943`.)
es_ec: El nuevo método :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` devuelve ``True`` si se canceló la devolución de llamada. (Contribuido por *Marat Sharafutdinov* en :issue:`31943`.)

source: The asyncio source has been converted to use the :keyword:`async`/:keyword:`await` syntax. (Contributed by Andrew Svetlov in :issue:`32193`.)
es_ec: La fuente asyncio se ha convertido para utilizar la sintaxis :keyword:`async`/:keyword:`await`. (Contribuido por *Andrew Svetlov* en :issue:`32193`.)

source: The new :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` method can be used to determine the reading state of the transport. Additionally, calls to :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` and :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` are now idempotent. (Contributed by Yury Selivanov in :issue:`32356`.)
es_ec: El nuevo método :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` puede ser usado para determinar el estado de lectura del transporte. Adicionalmente, las llamadas a :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` y :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` ahora son idempotentes. (Contribuido por *Yury Selivanov* en :issue:`32356`.)

source: Loop methods which accept socket paths now support passing :term:`path-like objects <path-like object>`. (Contributed by Yury Selivanov in :issue:`32066`.)
es_ec: Los métodos de bucle que aceptan rutas de socket ahora admiten el paso :term:`objetos con forma de ruta <path-like object>`. (Contribuido por *Yury Selivanov* en :issue:`32066`.)

source: In :mod:`asyncio` TCP sockets on Linux are now created with ``TCP_NODELAY`` flag set by default. (Contributed by Yury Selivanov and Victor Stinner in :issue:`27456`.)
es_ec: En :mod:`asyncio`, los sockets TCP en Linux ahora son creados con el indicador ``TCP_NODELAY`` configurado por defecto. (Contribuido por *Yury Selivanov* y *Victor Stinner* en :issue:`27456`.)

source: Exceptions occurring in cancelled tasks are no longer logged. (Contributed by Yury Selivanov in :issue:`30508`.)
es_ec: Las excepciones que ocurren en tareas canceladas ya no se registran. (Contribuido por *Yury Selivanov* en :issue:`30508`.)

source: New ``WindowsSelectorEventLoopPolicy`` and ``WindowsProactorEventLoopPolicy`` classes. (Contributed by Yury Selivanov in :issue:`33792`.)
es_ec: Nuevas clases ``WindowsSelectorEventLoopPolicy`` y ``WindowsProactorEventLoopPolicy``. (Contribuido por *Yury Selivanov* en :issue:`33792`.)

source: Several ``asyncio`` APIs have been :ref:`deprecated <whatsnew37-asyncio-deprecated>`.
es_ec: Varias APIs ``asyncio`` se han :ref:`obsoleta <whatsnew37-asyncio-deprecated>`.

source: The :func:`~binascii.b2a_uu` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
es_ec: La función :func:`~binascii.b2a_uu` ahora acepta un argumento de palabra clave opcional *backtick*. Cuando es cierto, los ceros están representados por ``’`’`` en lugar de espacios. (Contribuido por *Xiang Zhang* en :issue:`30103`.)

source: The :class:`~calendar.HTMLCalendar` class has new class attributes which ease the customization of CSS classes in the produced HTML calendar. (Contributed by Oz Tiram in :issue:`30095`.)
es_ec: La clase :class:`~calendar.HTMLCalendar`tiene nuevos atributos de clase que facilitan la personalización de clases CSS en el calendario HTML producido. (Contribuido por *Oz Tiram* en :issue:`30095`.)

source: ``collections.namedtuple()`` now supports default values. (Contributed by Raymond Hettinger in :issue:`32320`.)
es_ec: ``collections.namedtuple()`` ahora soporta valores por defecto. (Contribuido por *Raymond Hettinger* en :issue:`32320`.)

source: :func:`compileall.compile_dir` learned the new *invalidation_mode* parameter, which can be used to enable :ref:`hash-based .pyc invalidation <whatsnew37-pep552>`. The invalidation mode can also be specified on the command line using the new ``--invalidation-mode`` argument. (Contributed by Benjamin Peterson in :issue:`31650`.)
es_ec: :func:`compileall.compile_dir` aprendió el nuevo parámetro *invalidation_mode*, que se puede utilizar para habilitar :ref:`invalidación de .pyc basada en hash <whatsnew37-pep552>`. El modo de invalidación también se puede especificar en la línea de comando usando el nuevo argumento ``—invalidation-mode``. (Contribuido por *Benjamin Peterson* en :issue:`31650`.)

source: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` and :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` now support the new *initializer* and *initargs* constructor arguments. (Contributed by Antoine Pitrou in :issue:`21423`.)
es_ec: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` y :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` ahora soporta los nuevos argumentos de constructor *initializer* y *initargs*. (Contribuido por *Antoine Pitrou* en :issue:`21423`.)

source: The :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` can now take the multiprocessing context via the new *mp_context* argument. (Contributed by Thomas Moreau in :issue:`31540`.)
es_ec: La :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` puede ahora tomar el contexto de multiprocesamiento a través del nuevo argumento *mp_context*. (Contribuido por *Thomas Moreau* en :issue:`31540`.)

source: The new :func:`~contextlib.nullcontext` is a simpler and faster no-op context manager than :class:`~contextlib.ExitStack`. (Contributed by Jesse-Bakker in :issue:`10049`.)
es_ec: El nuevo :func:`~contextlib.nullcontext` es un administrador de contexto sin operaciones simple y rápido que :class:`~contextlib.ExitStack`. (Contribuido por *Jesse-Bakker* en :issue:`10049`.)

source: The new :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager`, and :class:`~contextlib.AsyncExitStack` have been added to complement their synchronous counterparts. (Contributed by Jelle Zijlstra in :issue:`29679` and :issue:`30241`, and by Alexander Mohr and Ilya Kulakov in :issue:`29302`.)
es_ec: Se han añadido los nuevos :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager`, y :class:`~contextlib.AsyncExitStack` para complementar sus partes sincronicas. (Contribuido por *Jelle Zijlstra* en :issue:`29679` y :issue:`30241`, y por *Alexander Mohr* y *Ilya Kulakov* en :issue:`29302`.)

source: The :mod:`cProfile` command line now accepts ``-m module_name`` as an alternative to script path. (Contributed by Sanyam Khurana in :issue:`21862`.)
es_ec: La linea de comandos :mod:`cProfile` ahora acepta ``-m module_name`` como alternativa a la ruta del *script*. (Contribuido por *Sanyam Khurana* en :issue:`21862`.)

source: The :mod:`crypt` module now supports the Blowfish hashing method. (Contributed by Serhiy Storchaka in :issue:`31664`.)
es_ec: El módulo :mod:`crypt` ahora es compatible con el método de hash Blowfish. (Contribuido por *Serhiy Storchaka* en :issue:`31664`.)

source: The :func:`~crypt.mksalt` function now allows specifying the number of rounds for hashing. (Contributed by Serhiy Storchaka in :issue:`31702`.)
es_ec: La función :func:`~crypt.mksalt` ahora permite especificar el número de rondas para el hash. (Contribuido por *Serhiy Storchaka* en :issue:`31702`.)

source: The new :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` method constructs a :class:`~datetime.datetime` object from a string in one of the formats output by :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Contributed by Paul Ganssle in :issue:`15873`.)
es_ec: Los nuevos objetos :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` un método constructor :class:`~datetime.datetime` de una cadena en uno de los formatos de salida de :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Contribuido por *Paul Ganssle* en :issue:`15873`.)

source: The :class:`tzinfo <datetime.tzinfo>` class now supports sub-minute offsets. (Contributed by Alexander Belopolsky in :issue:`5288`.)
es_ec: La clase :class:`tzinfo <datetime.tzinfo>` ahora admite compensaciones de subminutos. (Contribuido por *Alexander Belopolsky* en :issue:`5288`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed.
es_ec: :mod:`dbm.dumb` ahora admite la lectura de archivos de solo lectura y ya no escribe el archivo de índice cuándo no se cambia.

source: The :mod:`decimal` module now uses :ref:`context variables <whatsnew37-pep567>` to store the decimal context. (Contributed by Yury Selivanov in :issue:`32630`.)
es_ec: El módulo :mod:`decimal` ahora usa :ref:`variables de contexto <whatsnew37-pep567>` para almacenar el contexto decimal. (Contribuido por *Yury Selivanov* en :issue:`32630`.)

source: The :func:`~dis.dis` function is now able to disassemble nested code objects (the code of comprehensions, generator expressions and nested functions, and the code used for building nested classes). The maximum depth of disassembly recursion is controlled by the new *depth* parameter. (Contributed by Serhiy Storchaka in :issue:`11822`.)
es_ec: La función :func:`~dis.dis` ahora puede desensamblar objetos de código anidados (el código de comprensiones, expresiones generadoras y funciones anidadas, y el código utilizado para construir clases anidadas). La profundidad máxima de la recursividad de desmontaje se controla mediante el nuevo parámetro * profundidad *. (Contribuido por *Serhiy Storchaka* en :issue:`11822`.)

source: ``README.rst`` is now included in the list of distutils standard READMEs and therefore included in source distributions. (Contributed by Ryan Gonzalez in :issue:`11913`.)
es_ec: ``README.rst`` ahora se incluye en la lista de READMEs estándar de distutils y, por lo tanto, se incluye en las distribuciones de código fuente. (Contribuido por *Ryan Gonzalez* en :issue:`11913`.)

source: The :class:`Enum <enum.Enum>` learned the new ``_ignore_`` class property, which allows listing the names of properties which should not become enum members. (Contributed by Ethan Furman in :issue:`31801`.)
es_ec: La :class:`Enum <enum.Enum>` aprendió la nueva propiedad de clase ``_ignore_``, que permite enumerar los nombres de propiedades que no deben convertirse en miembros de enumeración. (Contribuido por *Ethan Furman* en :issue:`31801`.)

source: In Python 3.8, attempting to check for non-Enum objects in :class:`Enum` classes will raise a :exc:`TypeError` (e.g. ``1 in Color``); similarly, attempting to check for non-Flag objects in a :class:`Flag` member will raise :exc:`TypeError` (e.g. ``1 in Perm.RW``); currently, both operations return :const:`False` instead and are deprecated. (Contributed by Ethan Furman in :issue:`33217`.)
es_ec: En Python 3.8, intentar buscar objetos que no sean Enum en :class:`Enum` lanzará un :exc:`TypeError` (por ejemplo, ``1 in Color``); de manera similar, si se intenta buscar objetos que no sean Flag en un miembro :class:`Flag` se lanzará :exc:`TypeError` (por ejemplo, ``1 in Perm.RW``); actualmente, ambas operaciones devuelven :const:`False` en su lugar y están obsoletas.

source: :func:`functools.singledispatch` now supports registering implementations using type annotations. (Contributed by Łukasz Langa in :issue:`32227`.)
es_ec: :func:`functools.singledispatch` ahora admite el registro de implementaciones mediante anotaciones de tipo. (Contribuido por *Łukasz Langa* en :issue:`32227`.)

source: The new :func:`gc.freeze` function allows freezing all objects tracked by the garbage collector and excluding them from future collections. This can be used before a POSIX ``fork()`` call to make the GC copy-on-write friendly or to speed up collection. The new :func:`gc.unfreeze` functions reverses this operation. Additionally, :func:`gc.get_freeze_count` can be used to obtain the number of frozen objects. (Contributed by Li Zekun in :issue:`31558`.)
es_ec: La nueva función :func:`gc.freeze` permite congelar todos los objetos rastreados por el recolector de basura y excluirlos de colecciones futuras. Esto se puede utilizar antes de llamar POSIX ``fork()`` para hacer que la copia en escritura de GC sea amigable o para acelerar la recopilación. La nuevas funciones :func:`gc.unfreeze` revierten esta operación. Además, :func:`gc.get_freeze_count` se puede utilizar para obtener el número de objetos congelados. (Contribuido por *Li Zekun* en :issue:`31558`.)

source: The :mod:`hmac` module now has an optimized one-shot :func:`~hmac.digest` function, which is up to three times faster than :func:`~hmac.HMAC`. (Contributed by Christian Heimes in :issue:`32433`.)
es_ec: El módulo :mod:`hmac` ahora tiene una función one-shot optimizada :func:`~hmac.digest`, que es hasta tres veces más rápida que :func:`~hmac.HMAC`.

source: :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` now support the new *blocksize* argument for improved upload throughput. (Contributed by Nir Soffer in :issue:`31945`.)
es_ec: :class:`~http.client.HTTPConnection` y :class:`~http.client.HTTPSConnection` ahora admite el nuevo argumento * tamaño de bloque * para mejorar el rendimiento de carga. (Contribuido por *Nir Soffer* en :issue:`31945`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` now supports the HTTP ``If-Modified-Since`` header. The server returns the 304 response status if the target file was not modified after the time specified in the header. (Contributed by Pierre Quentel in :issue:`29654`.)
es_ec: :class:`~http.server.SimpleHTTPRequestHandler` ahora admite el encabezado HTTP ``If-Modified-Since``. El servidor devuelve el estado de respuesta 304 si el archivo de destino no se modificó después del tiempo especificado en el encabezado. (Contribuido por *Pierre Quentel* en :issue:`29654`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` accepts the new *directory* argument, in addition to the new ``--directory`` command line argument. With this parameter, the server serves the specified directory, by default it uses the current working directory. (Contributed by Stéphane Wirtel and Julien Palard in :issue:`28707`.)
es_ec: :class:`~http.server.SimpleHTTPRequestHandler` acepta el nuevo argumento *directorio*, además del nuevo argumento de línea de comando ``—directory``. Con este parámetro, el servidor sirve el directorio especificado, por defecto usa el directorio de trabajo actual. (Contribuido por *Stéphane Wirtel* y *Julien Palard* en :issue:`28707`.)

source: The new :class:`ThreadingHTTPServer <http.server.ThreadingHTTPServer>` class uses threads to handle requests using :class:`~socketserver.ThreadingMixin`. It is used when ``http.server`` is run with ``-m``. (Contributed by Julien Palard in :issue:`31639`.)
es_ec: La nueva clase :class:`ThreadingHTTPServer <http.server.ThreadingHTTPServer>` usa procesos para manejar solicitudes usando :class:`~socketserver.ThreadingMixin`. Se usa cuando se ejecuta ``http.server`` con ``-m``. (Contribuido por *Julien Palard* en :issue:`31639`.)

source: Multiple fixes for autocompletion. (Contributed by Louie Lu in :issue:`15786`.)
es_ec: Varias correcciones para autocompletar. (Contribuido por *Louie Lu* en :issue:`15786`.)

source: Module Browser (on the File menu, formerly called Class Browser), now displays nested functions and classes in addition to top-level functions and classes. (Contributed by Guilherme Polo, Cheryl Sabella, and Terry Jan Reedy in :issue:`1612262`.)
es_ec: El Explorador de módulos (en el menú Archivo, antes llamado Explorador de clases), ahora muestra funciones y clases anidadas además de funciones y clases de nivel superior. (Contribuido por *Guilherme Polo*, *Cheryl Sabella*, y *Terry Jan Reedy* en :issue:`1612262`.)
