Repository: python/python-docs-es
Catalog: whatsnew/3.8.po
Languages: es_es

source: Added :func:`statistics.quantiles` that divides data or a distribution in to equiprobable intervals (e.g. quartiles, deciles, or percentiles). (Contributed by Raymond Hettinger in :issue:`36546`.)
es_es: Se ha agregado :func:`statistics.quantiles` que divide datos o una distribución en intervalos equiprobables (por ejemplo, cuartiles, deciles o percentiles). (Contribución de Raymond Hettinger en :issue:`36546`.)

source: Added :class:`statistics.NormalDist`, a tool for creating and manipulating normal distributions of a random variable. (Contributed by Raymond Hettinger in :issue:`36018`.)
es_es: Se ha agregado :class:`statistics.NormalDist`, una herramienta para crear y manipular distribuciones normales de una variable aleatoria. (Contribución de Raymond Hettinger en :issue:`36018`.)

source: Add new :func:`sys.unraisablehook` function which can be overridden to control how "unraisable exceptions" are handled. It is called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`). (Contributed by Victor Stinner in :issue:`36829`.)
es_es: Se ha agregado la nueva función :func:`sys.unraisablehook` que se puede anular para controlar cómo se manejan las "excepciones no lanzables". Se llama cuando se ha producido una excepción, pero Python no tiene forma de manejarla. Por ejemplo, cuando un destructor lanza una excepción o durante la recolección de basura (:func:`gc.collect`). (Contribución de Victor Stinner en :issue:`36829`.)

source: The :mod:`tarfile` module now defaults to the modern pax (POSIX.1-2001) format for new archives, instead of the previous GNU-specific one. This improves cross-platform portability with a consistent encoding (UTF-8) in a standardized and extensible format, and offers several other benefits. (Contributed by C.A.M. Gerlach in :issue:`36268`.)
es_es: El módulo :mod:`tarfile` ahora tiene por defecto el formato pax moderno (POSIX.1-2001) para nuevos archivos, en lugar del anterior específico de GNU. Esto mejora la portabilidad multiplataforma con una codificación consistente (UTF-8) en un formato estandarizado y extensible, y ofrece otros varios beneficios. (Contribución de C.A.M. Gerlach en :issue:`36268`.)

source: Add a new :func:`threading.excepthook` function which handles uncaught :meth:`threading.Thread.run` exception. It can be overridden to control how uncaught :meth:`threading.Thread.run` exceptions are handled. (Contributed by Victor Stinner in :issue:`1230540`.)
es_es: Se ha agregado una nueva función :func:`threading.excepthook` que maneja las excepciones :meth:`threading.Thread.run` no capturadas. Se puede anular para controlar cómo se manejan las excepciones :meth:`threading.Thread.run` no capturadas. (Contribución de Victor Stinner en :issue:`1230540`.)

source: Add a new :func:`threading.get_native_id` function and a :data:`~threading.Thread.native_id` attribute to the :class:`threading.Thread` class. These return the native integral Thread ID of the current thread assigned by the kernel. This feature is only available on certain platforms, see :func:`get_native_id <threading.get_native_id>` for more information. (Contributed by Jake Tesler in :issue:`36084`.)
es_es: Se han agregado una nueva función :func:`threading.get_native_id` y un atributo :data:`~threading.Thread.native_id` a la clase :class:`threading.Thread`. Estos retornan el Thread ID nativo integral del hilo actual asignado por el kernel. Esta función solo está disponible en determinadas plataformas, consulta :func:`get_native_id <threading.get_native_id>` para obtener más información. (Contribución de Jake Tesler en :issue:`36084`.)

source: The :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
es_es: El módulo :mod:`tokenize` ahora emite implícitamente un token ``NEWLINE`` cuando se le proporciona una entrada sin una nueva línea al final. Este comportamiento ahora coincide con lo que hace internamente el tokenizador de C. (Contribución de Ammar Askar en :issue:`33899`.)

source: Added methods :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` and :meth:`~tkinter.Spinbox.selection_to` in the :class:`tkinter.Spinbox` class. (Contributed by Juliette Monsel in :issue:`34829`.)
es_es: Se han agregado los métodos :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` y :meth:`~tkinter.Spinbox.selection_to` a la clase :class:`tkinter.Spinbox`. (Contribución de Juliette Monsel en :issue:`34829`.)

source: Added method :meth:`~tkinter.Canvas.moveto` in the :class:`tkinter.Canvas` class. (Contributed by Juliette Monsel in :issue:`23831`.)
es_es: Se ha agregado el método :meth:`~tkinter.Canvas.moveto` a la clase :class:`tkinter.Canvas`. (Contribución de Juliette Monsel en :issue:`23831`.)

source: The :class:`tkinter.PhotoImage` class now has :meth:`~tkinter.PhotoImage.transparency_get` and :meth:`~tkinter.PhotoImage.transparency_set` methods. (Contributed by Zackery Spytz in :issue:`25451`.)
es_es: La clase :class:`tkinter.PhotoImage` ahora dispone de los métodos :meth:`~tkinter.PhotoImage.transparency_get` y :meth:`~tkinter.PhotoImage.transparency_set`. (Contribución de Zackery Spytz en :issue:`25451`.)

source: Added new clock :const:`~time.CLOCK_UPTIME_RAW` for macOS 10.12. (Contributed by Joannah Nanjekye in :issue:`35702`.)
es_es: Se ha agregado el nuevo reloj :const:`~time.CLOCK_UPTIME_RAW` para macOS 10.12. (Contribución de Joannah Nanjekye en :issue:`35702`.)

source: The :mod:`typing` module incorporates several new features:
es_es: Se han incorporado varias características al módulo :mod:`typing`:

source: A dictionary type with per-key types. See :pep:`589` and :class:`typing.TypedDict`. TypedDict uses only string keys. By default, every key is required to be present. Specify "total=False" to allow keys to be optional::
es_es: Un tipo de diccionario con tipos para cada clave. Consultar :pep:`589` y :class:`typing.TypedDict`. TypedDict usa solo claves de cadenas de caracteres. De forma predeterminada, se requiere que todas las claves estén presentes. Especifica "total=False" para permitir que las claves sean opcionales::

source: Literal types. See :pep:`586` and :class:`typing.Literal`. Literal types indicate that a parameter or return value is constrained to one or more specific literal values::
es_es: Tipos literales. Consultar :pep:`586` y :class:`typing.Literal`. Los tipos literales indican que un parámetro o valor de retorno está restringido a uno o más valores literales específicos::

source: "Final" variables, functions, methods and classes. See :pep:`591`, :class:`typing.Final` and :func:`typing.final`. The final qualifier instructs a static type checker to restrict subclassing, overriding, or reassignment::
es_es: Variables, funciones, métodos y clases "finales". Consultar :pep:`591`, :class:`typing.Final` y :func:`typing.final`. El clasificador final instruye a un validador estático de tipos para restringir la subclasificación, anulación o reasignación::

source: Protocol definitions. See :pep:`544`, :class:`typing.Protocol` and :func:`typing.runtime_checkable`. Simple ABCs like :class:`typing.SupportsInt` are now ``Protocol`` subclasses.
es_es: Definiciones de protocolo. Consultar :pep:`544`, :class:`typing.Protocol` y :func:`typing.runtime_checkable`. ABCs simples como :class:`typing.SupportsInt` ahora son subclases de ``Protocol`` .

source: New protocol class :class:`typing.SupportsIndex`.
es_es: Nueva clase protocolo :class:`typing.SupportsIndex`.

source: New functions :func:`typing.get_origin` and :func:`typing.get_args`.
es_es: Nuevas funciones :func:`typing.get_origin` y :func:`typing.get_args`.

source: The :mod:`unicodedata` module has been upgraded to use the `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ release.
es_es: El módulo :mod:`unicodedata` se ha actualizado para usar la versión `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_.

source: New function :func:`~unicodedata.is_normalized` can be used to verify a string is in a specific normal form, often much faster than by actually normalizing the string. (Contributed by Max Belanger, David Euresti, and Greg Price in :issue:`32285` and :issue:`37966`).
es_es: La nueva función :func:`~unicodedata.is_normalized` puede usarse para verificar que una cadena está en una forma normal específica, lo que es a menudo mucho más rápido que normalizar la cadena. (Contribución de Max Belanger, David Euresti y Greg Price en :issue:`32285` y :issue:`37966`).

source: Added :class:`~unittest.mock.AsyncMock` to support an asynchronous version of :class:`~unittest.mock.Mock`. Appropriate new assert functions for testing have been added as well. (Contributed by Lisa Roach in :issue:`26467`).
es_es: Se ha agregado :class:`~unittest.mock.AsyncMock` para admitir una versión asincrónica de :class:`~unittest.mock.Mock`. También se han agregado nuevas funciones de aserción apropiadas para las pruebas. (Contribución de Lisa Roach en :issue:`26467`).

source: Added :func:`~unittest.addModuleCleanup()` and :meth:`~unittest.TestCase.addClassCleanup()` to unittest to support cleanups for :func:`~unittest.setUpModule()` and :meth:`~unittest.TestCase.setUpClass()`. (Contributed by Lisa Roach in :issue:`24412`.)
es_es: Se ha agregado :func:`~unittest.addModuleCleanup()` y :meth:`~unittest.TestCase.addClassCleanup()` a unittest para admitir limpiezas para :func:`~unittest.setUpModule()` y :meth:`~unittest .TestCase.setUpClass()`. (Contribución de Lisa Roach en :issue:`24412`.)

source: Several mock assert functions now also print a list of actual calls upon failure. (Contributed by Petter Strandmark in :issue:`35047`.)
es_es: Varias funciones de aserción simulada ahora también imprimen una lista de llamadas reales en caso de fallo. (Contribución de Petter Strandmark en :issue:`35047`.)

source: :mod:`unittest` module gained support for coroutines to be used as test cases with :class:`unittest.IsolatedAsyncioTestCase`. (Contributed by Andrew Svetlov in :issue:`32972`.)
es_es: El módulo :mod:`unittest` ha obtenido soporte para corrutinas que se utilizarán como casos de prueba con :class:`unittest.IsolatedAsyncioTestCase`. (Contribución de Andrew Svetlov en :issue:`32972`.)

source: Example::
es_es: Ejemplo::

source: :mod:`venv` now includes an ``Activate.ps1`` script on all platforms for activating virtual environments under PowerShell Core 6.1. (Contributed by Brett Cannon in :issue:`32718`.)
es_es: :mod:`venv` ahora incluye un script ``Activate.ps1`` en todas las plataformas para activar entornos virtuales en PowerShell Core 6.1. (Contribución de Brett Cannon en :issue:`32718`.)

source: The proxy objects returned by :func:`weakref.proxy` now support the matrix multiplication operators ``@`` and ``@=`` in addition to the other numeric operators. (Contributed by Mark Dickinson in :issue:`36669`.)
es_es: Los objetos proxy retornados por :func:`debilref.proxy` ahora admiten los operadores de multiplicación de matrices ``@`` y ``@=``, además de los otros operadores numéricos. (Contribución de Mark Dickinson en :issue:`36669`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
es_es: Como mitigación contra DTD y recuperación de entidades externas, los módulos :mod:`xml.dom.minidom` y :mod:`xml.sax` ya no procesan entidades externas de forma predeterminada. (Contribución de Christian Heimes en :issue:`17239`.)

source: The ``.find*()`` methods in the :mod:`xml.etree.ElementTree` module support wildcard searches like ``{*}tag`` which ignores the namespace and ``{namespace}*`` which returns all tags in the given namespace. (Contributed by Stefan Behnel in :issue:`28238`.)
es_es: Los métodos ``.find*()`` del módulo :mod:`xml.etree.ElementTree` admiten búsquedas con comodines, como ``{*}tag``, que ignora el espacio de nombres, y ``{namespace}*``, que retorna todas las etiquetas en el espacio de nombres dado. (Contribución de Stefan Behnel en :issue:`28238`.)

source: The :mod:`xml.etree.ElementTree` module provides a new function :func:`–xml.etree.ElementTree.canonicalize()` that implements C14N 2.0. (Contributed by Stefan Behnel in :issue:`13611`.)
es_es: El módulo :mod:`xml.etree.ElementTree` proporciona una nueva función :func:`–xml.etree.ElementTree.canonicalize()` que implementa C14N 2.0. (Contribución de Stefan Behnel en :issue:`13611`.)

source: The target object of :class:`xml.etree.ElementTree.XMLParser` can receive namespace declaration events through the new callback methods ``start_ns()`` and ``end_ns()``. Additionally, the :class:`xml.etree.ElementTree.TreeBuilder` target can be configured to process events about comments and processing instructions to include them in the generated tree. (Contributed by Stefan Behnel in :issue:`36676` and :issue:`36673`.)
es_es: El objeto de destino de :class:`xml.etree.ElementTree.XMLParser` puede recibir eventos de declaración de espacio de nombres a través de los nuevos métodos de retrollamada ``start_ns()`` y ``end_ns()``. Además, el destino :class:`xml.etree.ElementTree.TreeBuilder` se puede configurar para procesar eventos sobre comentarios e instrucciones de procesamiento para incluirlos en el árbol generado. (Contribución de Stefan Behnel en :issue:`36676` y :issue:`36673`.)

source: :class:`xmlrpc.client.ServerProxy` now supports an optional *headers* keyword argument for a sequence of HTTP headers to be sent with each request. Among other things, this makes it possible to upgrade from default basic authentication to faster session authentication. (Contributed by Cédric Krier in :issue:`35153`.)
es_es: :class:`xmlrpc.client.ServerProxy` ahora admite un argumento por palabra clave *headers* opcional para una secuencia de encabezados HTTP que se enviarán con cada solicitud. Entre otras cosas, esto permite actualizar desde la autenticación básica predeterminada a una autenticación de sesión más rápida. (Contribución de Cédric Krier en :issue:`35153`.)

source: Optimizations
es_es: Optimizaciones

source: The :mod:`subprocess` module can now use the :func:`os.posix_spawn` function in some cases for better performance. Currently, it is only used on macOS and Linux (using glibc 2.24 or newer) if all these conditions are met:
es_es: El módulo :mod:`subprocess` ahora puede usar en ciertos casos la función :func:`os.posix_spawn` para mejorar el rendimiento. Actualmente, solo se usa en macOS y Linux (usando glibc 2.24 o una versión más reciente) y siempre que se cumplan todas estas condiciones:

source: *close_fds* is false;
es_es: *close_fds* es falso;

source: *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* parameters are not set;
es_es: los parámetros *preexec_fn*, *pass_fds*, *cwd* y *start_new_session* no están establecidos;

source: the *executable* path contains a directory.
es_es: la ruta *executable* contiene un directorio.

source: (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
es_es: (Contribución de Joannah Nanjekye y Victor Stinner en :issue:`35537`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls on Linux and macOS in order to copy the file more efficiently. "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``". On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 16 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used. The speedup for copying a 512 MiB file within the same partition is about +26% on Linux, +50% on macOS and +40% on Windows. Also, much less CPU cycles are consumed. See :ref:`shutil-platform-dependent-efficient-copy-operations` section. (Contributed by Giampaolo Rodolà in :issue:`33671`.)
es_es: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` y :func:`shutil.move` usan llamadas al sistema de "copia-rápida" específicas de la plataforma en Linux y macOS, con la finalidad de copiar ficheros más eficientemente. "copia-rápida" significa que la operación de copiado tiene lugar en el propio kernel, evitando que Python haga uso de búferes en el espacio de usuario como "``outfd.write(infd.read())``". En Windows, :func:`shutil.copyfile` usa un tamaño de búfer predeterminado más grande (1 MiB en lugar de 16 KiB) y se usa una variante de :func:`shutil.copyfileobj` basada en :func:`memoryview`. La aceleración al copiar un archivo de 512 MiB dentro de la misma partición es de aproximadamente +26% en Linux, +50% en macOS y +40% en Windows. Además, se consumen muchos menos ciclos de CPU. Consultar la sección :ref:`shutil-platform-dependent-efficient-copy-operations`. (Contribución de Giampaolo Rodolà en :issue:`33671`.)

source: :func:`shutil.copytree` uses :func:`os.scandir` function and all copy functions depending from it use cached :func:`os.stat` values. The speedup for copying a directory with 8000 files is around +9% on Linux, +20% on Windows and +30% on a Windows SMB share. Also the number of :func:`os.stat` syscalls is reduced by 38% making :func:`shutil.copytree` especially faster on network filesystems. (Contributed by Giampaolo Rodolà in :issue:`33695`.)
es_es: Ahora :func:`shutil.copytree` usa la función :func:`os.scandir` y todas las funciones de copia que dependen de ella usan el valor en caché de :func:`os.stat`. Al copiar un directorio con 8000 archivos, la mejora de velocidad es de +9% en Linux, +20% en Windows y +30% en recursos compartidos de Windows SMB. Además, el número de llamadas al sistema de :func:`os.stat` se reduce en un 38%, lo que hace que :func:`shutil.copytree` sea más rápida especialmente en sistemas de archivos de red. (Contribución de Giampaolo Rodolà en :issue:`33695`.)

source: The default protocol in the :mod:`pickle` module is now Protocol 4, first introduced in Python 3.4. It offers better performance and smaller size compared to Protocol 3 available since Python 3.0.
es_es: El protocolo por defecto del módulo :mod:`pickle` es ahora el Protocolo 4, introducido por primera vez en Python 3.4. Ofrece un mejor desempeño y un menor tamaño, en comparación con el Protocolo 3 disponible desde Python 3.0.

source: Removed one :c:type:`Py_ssize_t` member from ``PyGC_Head``. All GC tracked objects (e.g. tuple, list, dict) size is reduced 4 or 8 bytes. (Contributed by Inada Naoki in :issue:`33597`.)
es_es: Se eliminó un miembro :c:type:`Py_ssize_t` de ``PyGC_Head``. El tamaño de todos los objetos rastreados de GC (por ejemplo, tupla, lista, dict) se reduce en 4 u 8 bytes. (Aportado por Inada Naoki en :issue:`33597`.)

source: :class:`uuid.UUID` now uses ``__slots__`` to reduce its memory footprint. (Contributed by Wouter Bolsterlee and Tal Einat in :issue:`30977`)
es_es: La clase :class:`uuid.UUID` ahora usa ``__slots__`` para reducir su impacto en la memoria. (Contribución de Wouter Bolsterlee y Tal Einat en :issue:`30977`.)

source: Improved performance of :func:`operator.itemgetter` by 33%. Optimized argument handling and added a fast path for the common case of a single non-negative integer index into a tuple (which is the typical use case in the standard library). (Contributed by Raymond Hettinger in :issue:`35664`.)
es_es: Mejorado el rendimiento de :func:`operator.itemgetter` en un 33%. Se ha optimizado el manejo de argumentos y se ha agregado una ruta rápida al caso común de índices enteros no negativos únicos en tuplas (que constituye un caso de uso común en la biblioteca estándar). (Contribución de Raymond Hettinger en :issue:`35664`.)

source: Sped-up field lookups in :func:`collections.namedtuple`. They are now more than two times faster, making them the fastest form of instance variable lookup in Python. (Contributed by Raymond Hettinger, Pablo Galindo, and Joe Jevnik, Serhiy Storchaka in :issue:`32492`.)
es_es: Se han acelerado las búsquedas de campos en :func:`collections.namedtuple`. Ahora son más del doble de rápidas, lo que las convierte en la forma más rápida de búsqueda de variables de instancia en Python. (Contribución de Raymond Hettinger, Pablo Galindo, Joe Jevnik y Serhiy Storchaka en :issue:`32492`.)

source: The :class:`list` constructor does not overallocate the internal item buffer if the input iterable has a known length (the input implements ``__len__``). This makes the created list 12% smaller on average. (Contributed by Raymond Hettinger and Pablo Galindo in :issue:`33234`.)
es_es: El constructor de :class:`list` no sobre-asignará el búfer del elemento interno si se conoce la longitud de la entrada iterable (es decir, si la entrada implementa ``__len__``). Esto hace que la lista generada sea, en promedio, un 12% más pequeña. (Contribución de Raymond Hettinger y Pablo Galindo en :issue:`33234`.)

source: Doubled the speed of class variable writes. When a non-dunder attribute was updated, there was an unnecessary call to update slots. (Contributed by Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, and Serhiy Storchaka in :issue:`36012`.)
es_es: De ha duplicado la velocidad de escritura de variables de clase. Antes, cuando se actualizaba un atributo non-dunder, había una llamada innecesaria para actualizar slots. (Contribución de Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer y Serhiy Storchaka en :issue:`36012`.)

source: Reduced an overhead of converting arguments passed to many builtin functions and methods. This sped up calling some simple builtin functions and methods up to 20--50%. (Contributed by Serhiy Storchaka in :issue:`23867`, :issue:`35582` and :issue:`36127`.)
es_es: Se ha reducido la sobrecarga de conversión de argumentos pasados a muchas funciones y métodos integrados. Esto acelera la llamada a algunas funciones y métodos incorporados simples hasta un 20-50%. (Contribución de Serhiy Storchaka en :issue:`23867`, :issue:`35582` y :issue:`36127`.)

source: ``LOAD_GLOBAL`` instruction now uses new "per opcode cache" mechanism. It is about 40% faster now. (Contributed by Yury Selivanov and Inada Naoki in :issue:`26219`.)
es_es: La instrucción ``LOAD_GLOBAL`` ahora utiliza el nuevo mecanismo "per opcode cache". Ahora es aproximadamente un 40% más rápida. (Contribución de Yury Selivanov e Inada Naoki en :issue:`26219`.)

source: Build and C API Changes
es_es: Cambios en la compilación y la API de C

source: Default :data:`sys.abiflags` became an empty string: the ``m`` flag for pymalloc became useless (builds with and without pymalloc are ABI compatible) and so has been removed. (Contributed by Victor Stinner in :issue:`36707`.)
es_es: El valor predeterminado para :data:`sys.abiflags` es ahora una cadena vacía: el flag ``m`` para pymalloc se ha vuelto innecesario (las compilaciones con y sin pymalloc son ABI compatibles) y por lo tanto se ha eliminado. (Contribución de Victor Stinner en :issue:`36707`.)

source: Example of changes:
es_es: Ejemplos del cambio:

source: Only ``python3.8`` program is installed, ``python3.8m`` program is gone.
es_es: Solo el programa ``python3.8`` es instalado, el programa ``python3.8m`` se ha eliminado.
