Repository: python/python-docs-es
Catalog: whatsnew/3.8.po
Languages: es_es

source: Only ``python3.8-config`` script is installed, ``python3.8m-config`` script is gone.
es_es: Solo el script ``python3.8-config`` es instalado, el script ``python3.8m-config`` se ha eliminado.

source: The ``m`` flag has been removed from the suffix of dynamic library filenames: extension modules in the standard library as well as those produced and installed by third-party packages, like those downloaded from PyPI. On Linux, for example, the Python 3.7 suffix ``.cpython-37m-x86_64-linux-gnu.so`` became ``.cpython-38-x86_64-linux-gnu.so`` in Python 3.8.
es_es: El flag ``m`` se ha eliminado del sufijo de los nombres de archivo de las bibliotecas dinámicas: los módulos de extensión de la biblioteca estándar, así como los producidos e instalados por paquetes de terceros, como los descargados desde PyPI. En Linux, por ejemplo, el sufijo ``.cpython-37m-x86_64-linux-gnu.so`` en Python 3.7 se ha convertido en ``.cpython-38-x86_64-linux-gnu.so`` en Python 3.8.

source: The header files have been reorganized to better separate the different kinds of APIs:
es_es: Los archivos de cabeceras se han reorganizado para separar mejor los diferentes tipos de APIs:

source: ``Include/*.h`` should be the portable public stable C API.
es_es: ``Include/*.h`` debe ser la API de C portable, pública y estable.

source: ``Include/cpython/*.h`` should be the unstable C API specific to CPython; public API, with some private API prefixed by ``_Py`` or ``_PY``.
es_es: ``Include/cpython/*.h`` debe ser la API de C inestable específica de CPython. Una API pública, con alguna API privada marcada con los prefijos ``_Py`` o ``_PY``.

source: ``Include/internal/*.h`` is the private internal C API very specific to CPython. This API comes with no backward compatibility warranty and should not be used outside CPython. It is only exposed for very specific needs like debuggers and profiles which has to access to CPython internals without calling functions. This API is now installed by ``make install``.
es_es: ``Include/internal/*.h`` es la API de C interna privada, muy específica de CPython. Esta API no tiene retro-compatibilidad garantizada con versiones anteriores y no debe ser usada fuera de CPython. Solo está expuesta para cubrir necesidades muy específicas, como es el caso de depuradores y perfiladores, que necesitan acceder a los componentes internos de CPython sin llamar directamente a las funciones. Esta API es ahora instalada por ``make install``.

source: (Contributed by Victor Stinner in :issue:`35134` and :issue:`35081`, work initiated by Eric Snow in Python 3.7.)
es_es: (Contribución de Victor Stinner en :issue:`35134` y :issue:`35081`, trabajo iniciado por Eric Snow en Python 3.7.)

source: Some macros have been converted to static inline functions: parameter types and return type are well defined, they don't have issues specific to macros, variables have a local scopes. Examples:
es_es: Algunas macros se han convertido a funciones inline estáticas: los tipos de los parámetros y el tipo de retorno están bien definidos, no entrañan cuestiones que precisen el uso específico de macros y las variables tienen ámbito local. Algunos ejemplos:

source: Private functions: :c:func:`!_PyObject_GC_TRACK`, :c:func:`!_PyObject_GC_UNTRACK`, :c:func:`!_Py_Dealloc`
es_es: Funciones privadas: :c:func:`!_PyObject_GC_TRACK`, :c:func:`!_PyObject_GC_UNTRACK`, :c:func:`!_Py_Dealloc`

source: (Contributed by Victor Stinner in :issue:`35059`.)
es_es: (Contribución de Victor Stinner en :issue:`35059`.)

source: The :c:func:`!PyByteArray_Init` and :c:func:`!PyByteArray_Fini` functions have been removed. They did nothing since Python 2.7.4 and Python 3.2.0, were excluded from the limited API (stable ABI), and were not documented. (Contributed by Victor Stinner in :issue:`35713`.)
es_es: Las funciones :c:func:`!PyByteArray_Init` y :c:func:`!PyByteArray_Fini` se han eliminado. No eran de utilidad desde Python 2.7.4 y Python 3.2.0, cuando fueron excluidas de la API limitada (ABI estable) y dejaron de estar documentadas. (Contribución de Victor Stinner en :issue:`35713`.)

source: The result of :c:func:`PyExceptionClass_Name` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`33818`.)
es_es: El resultado de :c:func:`PyExceptionClass_Name` es ahora de tipo ``const char *`` en vez de ``char *``. (Contribución de Serhiy Storchaka en :issue:`33818`.)

source: The duality of ``Modules/Setup.dist`` and ``Modules/Setup`` has been removed. Previously, when updating the CPython source tree, one had to manually copy ``Modules/Setup.dist`` (inside the source tree) to ``Modules/Setup`` (inside the build tree) in order to reflect any changes upstream. This was of a small benefit to packagers at the expense of a frequent annoyance to developers following CPython development, as forgetting to copy the file could produce build failures.
es_es: La dualidad conformada por ``Modules/Setup.dist`` y ``Modules/Setup`` ha sido eliminada. Anteriormente, al actualizar el árbol de fuentes de CPython, se tenía que copiar manualmente ``Modules/Setup.dist`` (dentro del árbol de fuentes) a ``Modules/Setup`` (dentro del árbol de compilación) para reflejar cualquier cambio en sentido ascendente. Esto suponía un pequeño beneficio para los empaquetadores, a expensas de una frecuente molestia para los desarrolladores de CPython, ya que olvidarse de copiar el archivo podía ocasionar fallos de compilación.

source: Now the build system always reads from ``Modules/Setup`` inside the source tree. People who want to customize that file are encouraged to maintain their changes in a git fork of CPython or as patch files, as they would do for any other change to the source tree.
es_es: Ahora el sistema de compilación siempre lee desde ``Modules/Setup`` dentro del árbol de fuentes. Se recomienda a las personas que deseen personalizar este archivo que mantengan sus cambios en un fork de git de CPython o como archivos de parche, como harían con cualquier otro cambio en el árbol de fuentes.

source: (Contributed by Antoine Pitrou in :issue:`32430`.)
es_es: (Contribución de Antoine Pitrou en :issue:`32430`.)

source: Functions that convert Python number to C integer like :c:func:`PyLong_AsLong` and argument parsing functions like :c:func:`PyArg_ParseTuple` with integer converting format units like ``'i'`` will now use the :meth:`~object.__index__` special method instead of :meth:`~object.__int__`, if available. The deprecation warning will be emitted for objects with the ``__int__()`` method but without the ``__index__()`` method (like :class:`~decimal.Decimal` and :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` will now return ``1`` for objects implementing ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` and :c:func:`PyFloat_AsDouble` also now use the ``__index__()`` method if available. (Contributed by Serhiy Storchaka in :issue:`36048` and :issue:`20092`.)
es_es: Las funciones que convierten un número de Python a un entero de C, como :c:func:`PyLong_AsLong`, y las funciones de análisis de argumentos como :c:func:`PyArg_ParseTuple` con unidades de formato de conversión de enteros como ``'i'``, ahora usarán el método especial :meth:`~object.__index__` si está disponible, en lugar de :meth:`~object.__int__`. Una advertencia de deprecación se emitirá para aquellos objetos que tengan el método ``__int__()`` pero no el método ``__index__()`` (como :class:`~decimal.Decimal` y :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` ahora retornará ``1`` para los objetos que implementen ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` y :c:func:`PyFloat_AsDouble` ahora también usan el método ``__index__()`` si está disponible. (Contribución de Serhiy Storchaka en :issue:`36048` y :issue:`20092`.)

source: Heap-allocated type objects will now increase their reference count in :c:func:`PyObject_Init` (and its parallel macro ``PyObject_INIT``) instead of in :c:func:`PyType_GenericAlloc`. Types that modify instance allocation or deallocation may need to be adjusted. (Contributed by Eddie Elizondo in :issue:`35810`.)
es_es: Los objetos de tipo asignados al montículo ahora aumentarán su recuento de referencias en :c:func:`PyObject_Init` (y en su macro paralela ``PyObject_INIT``) en lugar de en :c:func:`PyType_GenericAlloc`. Es posible que deban ajustarse los tipos que modifican la asignación o desasignación de instancias. (Contribución de Eddie Elizondo en :issue:`35810`.)

source: The new function :c:func:`PyCode_NewWithPosOnlyArgs` allows to create code objects like :c:func:`PyCode_New`, but with an extra *posonlyargcount* parameter for indicating the number of positional-only arguments. (Contributed by Pablo Galindo in :issue:`37221`.)
es_es: La nueva función :c:func:`PyCode_NewWithPosOnlyArgs` permite crear objetos de código, al igual que :c:func:`PyCode_New`, pero con un parámetro *posonlyargcount* extra, que permite indicar el número de argumentos solo posicionales.

source: :c:func:`!Py_SetPath` now sets :data:`sys.executable` to the program full path (:c:func:`Py_GetProgramFullPath`) rather than to the program name (:c:func:`Py_GetProgramName`). (Contributed by Victor Stinner in :issue:`38234`.)
es_es: :c:func:`!Py_SetPath` ahora establece :data:`sys.executable` en la ruta completa del programa (:c:func:`Py_GetProgramFullPath`), en vez de en el nombre del programa (:c:func:`Py_GetProgramName`). (Contribución de Victor Stinner en :issue:`38234`.)

source: Deprecated
es_es: Obsoleto

source: The distutils ``bdist_wininst`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Victor Stinner in :issue:`37481`.)
es_es: El comando ``bdist_wininst`` de distutils está ahora obsoleto, usar ``bdist_wheel`` (paquetes wheel) en su lugar. (Contribución de Victor Stinner en :issue:`37481`.)

source: Deprecated methods ``getchildren()`` and ``getiterator()`` in the :mod:`~xml.etree.ElementTree` module now emit a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`. They will be removed in Python 3.9. (Contributed by Serhiy Storchaka in :issue:`29209`.)
es_es: Los métodos ``getchildren()`` y ``getiterator()`` del módulo :mod:`~xml.etree.ElementTree` ahora emiten una advertencia :exc:`DeprecationWarning`, en lugar de :exc:`PendingDeprecationWarning`. Serán eliminados en Python 3.9. (Contribución de Serhiy Storchaka en :issue:`29209`.)

source: Passing an object that is not an instance of :class:`concurrent.futures.ThreadPoolExecutor` to :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` is deprecated and will be prohibited in Python 3.9. (Contributed by Elvis Pranskevichus in :issue:`34075`.)
es_es: Pasar un objeto a :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` que no sea una instancia de :class:`concurrent.futures.ThreadPoolExecutor` está obsoleto y será prohibido en Python 3.9. (Contribución de Elvis Pranskevichus en :issue:`34075`.)

source: The :meth:`__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput` have been deprecated.
es_es: Los métodos :meth:`__getitem__` pertenecientes a las clases :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` y :class:`fileinput.FileInput` están obsoletos a partir de ahora.

source: Implementations of these methods have been ignoring their *index* parameter, and returning the next item instead. (Contributed by Berker Peksag in :issue:`9372`.)
es_es: Las implementaciones de estos métodos han estado ignorando su parámetro *index* y retornando el siguiente item en su lugar. (Contribución de Berker Peksag en :issue:`9372`.)

source: The :class:`typing.NamedTuple` class has deprecated the ``_field_types`` attribute in favor of the ``__annotations__`` attribute which has the same information. (Contributed by Raymond Hettinger in :issue:`36320`.)
es_es: El atributo ``_field_types`` de la clase :class:`typing.NamedTuple` está ahora obsoleto en favor del atributo ``__annotations__``, que contiene la misma información. (Contribución de Raymond Hettinger en :issue:`36320`.)

source: :mod:`ast` classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` are considered deprecated and will be removed in future Python versions. :class:`~ast.Constant` should be used instead. (Contributed by Serhiy Storchaka in :issue:`32892`.)
es_es: Las clases ``Num``, ``Str``, ``Bytes``, ``NameConstant`` y ``Ellipsis`` del módulo :mod:`ast` están consideradas obsoletas y serán eliminadas en versiones futuras de Python. La clase :class:`~ast.Constant` debe ser usada en su lugar. (Contribución de Serhiy Storchaka en :issue:`32892`.)

source: :class:`ast.NodeVisitor` methods ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` and ``visit_Ellipsis()`` are deprecated now and will not be called in future Python versions. Add the :meth:`~ast.NodeVisitor.visit_Constant` method to handle all constant nodes. (Contributed by Serhiy Storchaka in :issue:`36917`.)
es_es: Los métodos ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` y ``visit_Ellipsis()`` de la clase :class:`ast.NodeVisitor` están obsoletos ahora y serán invocados en versiones futuras de Python. Agregar el método :meth:`~ast.NodeVisitor.visit_Constant` para manejar todos los nodos constantes. (Contribución de Serhiy Storchaka en :issue:`36917`.)

source: The :func:`asyncio.coroutine` :term:`decorator` is deprecated and will be removed in version 3.10. Instead of ``@asyncio.coroutine``, use :keyword:`async def` instead. (Contributed by Andrew Svetlov in :issue:`36921`.)
es_es: El :term:`decorator` :func:`asyncio.coroutine` está obsoleto y será eliminado en Python 3.10. En lugar de ``@asyncio.coroutine``, se debe usar :keyword:`async def`. (Contribución de Andrew Svetlov en :issue:`36921`.)

source: In :mod:`asyncio`, the explicit passing of a *loop* argument has been deprecated and will be removed in version 3.10 for the following: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, and :func:`asyncio.create_subprocess_shell`.
es_es: En :mod:`asyncio`, pasar un argumento *loop* de forma explícita está ahora obsoleto y será eliminado en Python 3.10 para las siguientes funciones y constructores: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec` y :func:`asyncio.create_subprocess_shell`.

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov in :issue:`34790`.)
es_es: El paso explícito de objetos corrutina a :func:`asyncio.wait` está ahora obsoleto y será eliminado en Python 3.11. (Contribución de Yury Selivanov en :issue:`34790`.)

source: The following functions and methods are deprecated in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`. They return encoded bytes, and it's possible that you will get unexpected Unicode-related exceptions if there are encoding problems with the translated strings. It's much better to use alternatives which return Unicode strings in Python 3. These functions have been broken for a long time.
es_es: Las siguientes funciones y métodos del módulo :mod:`gettext` están obsoletos para: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` y :func:`~gettext.ldngettext`. Retornan bytes codificados y es posible obtener excepciones inesperadas relacionadas con Unicode si hay problemas de codificación con las cadenas traducidas. En Python 3 es mucho mejor usar alternativas que retornen cadenas Unicode. Estas funciones han estado rotas durante mucho tiempo.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also deprecated, since they are only used for the ``l*gettext()`` functions. (Contributed by Serhiy Storchaka in :issue:`33710`.)
es_es: Función :func:`~gettext.bind_textdomain_codeset`, métodos :meth:`~gettext.NullTranslations.output_charset` y :meth:`~gettext.NullTranslations.set_output_charset`, y el parámetro *codeset* de las funciones :func:`~gettext .translation` y :func:`~gettext.install` también están en desuso, ya que solo se usan para las funciones ``l*gettext()``. (Contribución de Serhiy Storchaka en :issue:`33710`.)

source: The :meth:`~threading.Thread.isAlive()` method of :class:`threading.Thread` has been deprecated. (Contributed by Donghee Na in :issue:`35283`.)
es_es: El método :meth:`~threading.Thread.isAlive()` de la clase :class:`threading.Thread` está ahora obsoleto. (Contribución de Donghee Na en :issue:`35283`.)

source: Many builtin and extension functions that take integer arguments will now emit a deprecation warning for :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and any other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). In future version they will be errors. (Contributed by Serhiy Storchaka in :issue:`36048`.)
es_es: Muchas funciones incorporadas y de extensión que toman argumentos enteros ahora emitirán una advertencia de deprecación para :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s y cualquier otro objeto que se pueda convertir a enteros solamente con pérdida (por ejemplo, aquellos que tienen el método :meth:`~object .__int__` pero no el método :meth:`~object .__index__`). En una versión futura, esto constituirá un error. (Contribución de Serhiy Storchaka en :issue:`36048`.)

source: Deprecated passing the following arguments as keyword arguments:
es_es: El paso de los siguientes argumentos como argumentos por palabra clave está ahora obsoleto:

source: *func* in :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` and :func:`curses.wrapper`.
es_es: *func* en :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` y :func:`curses.wrapper`.

source: *function* in :meth:`unittest.TestCase.addCleanup`.
es_es: *function* en :meth:`unittest.TestCase.addCleanup`.

source: *fn* in the :meth:`~concurrent.futures.Executor.submit` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor`.
es_es: *fn* en el método :meth:`~concurrent.futures.Executor.submit` de las clases :class:`concurrent.futures.ThreadPoolExecutor` y :class:`concurrent.futures.ProcessPoolExecutor`.

source: *callback* in :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` and :meth:`contextlib.AsyncExitStack.push_async_callback`.
es_es: *callback* en :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` y :meth:`contextlib.AsyncExitStack.push_async_callback`.

source: *c* and *typeid* in the :meth:`~multiprocessing.managers.Server.create` method of :class:`multiprocessing.managers.Server` and :class:`multiprocessing.managers.SharedMemoryServer`.
es_es: *c* y *typeid* en el método :meth:`~multiprocessing.managers.Server.create` de las clases :class:`multiprocessing.managers.Server` y :class:`multiprocessing.managers.SharedMemoryServer`.

source: *obj* in :func:`weakref.finalize`.
es_es: *obj* en :func:`weakref.finalize`.

source: In future releases of Python, they will be :ref:`positional-only <positional-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`36492`.)
es_es: En futuros lanzamientos de Python, todos ellos serán :ref:`argumentos solo posicionales <positional-only_parameter>`. (Contribución de Serhiy Storchaka en :issue:`36492`.)

source: API and Feature Removals
es_es: APIs y características eliminadas

source: The following features and APIs have been removed from Python 3.8:
es_es: Las siguientes características y APIs se han eliminado de Python 3.8:

source: Starting with Python 3.3, importing ABCs from :mod:`collections` was deprecated, and importing should be done from :mod:`collections.abc`. Being able to import from collections was marked for removal in 3.8, but has been delayed to 3.9. (See :issue:`36952`.)
es_es: A partir de Python 3.3, la importación de ABC desde el módulo :mod:`collections` quedó obsoleta y la importación debe realizarse desde el módulo :mod:`collections.abc`. La posibilidad de importar desde collections se marcó para su eliminación en Python 3.8, pero se ha retrasado a Python 3.9. (Consultar :issue:`36952`.)

source: The :mod:`macpath` module, deprecated in Python 3.7, has been removed. (Contributed by Victor Stinner in :issue:`35471`.)
es_es: El módulo :mod:`macpath`, obsoleto desde Python 3.7, ha sido eliminado. (Contribución de Victor Stinner en :issue:`35471`.)

source: The function :func:`platform.popen` has been removed, after having been deprecated since Python 3.3: use :func:`os.popen` instead. (Contributed by Victor Stinner in :issue:`35345`.)
es_es: La función :func:`platform.popen` ha sido eliminada, después de haber estado obsoleta desde Python 3.3: usa :func:`os.popen` en su lugar. (Contribución de Victor Stinner en :issue:`35345`.)

source: The function :func:`time.clock` has been removed, after having been deprecated since Python 3.3: use :func:`time.perf_counter` or :func:`time.process_time` instead, depending on your requirements, to have well-defined behavior. (Contributed by Matthias Bussonnier in :issue:`36895`.)
es_es: La función :func:`time.clock` ha sido eliminada, después de haber quedado obsoleta desde Python 3.3: usa :func:`time.perf_counter` o :func:`time.process_time` en su lugar, dependiendo de tus requisitos, para tener un comportamiento bien definido. (Contribución de Matthias Bussonnier en :issue:`36895`.)

source: The ``pyvenv`` script has been removed in favor of ``python3.8 -m venv`` to help eliminate confusion as to what Python interpreter the ``pyvenv`` script is tied to. (Contributed by Brett Cannon in :issue:`25427`.)
es_es: El script ``pyvenv`` se ha eliminado, en favor de ``python3.8 -m venv``, para ayudar a eliminar la confusión sobre a qué intérprete de Python está vinculado el script ``pyvenv``. (Contribución de Brett Cannon en :issue:`25427`.)

source: ``parse_qs``, ``parse_qsl``, and ``escape`` are removed from the :mod:`cgi` module. They are deprecated in Python 3.2 or older. They should be imported from the ``urllib.parse`` and ``html`` modules instead.
es_es: Las funciones ``parse_qs``, ``parse_qsl`` y ``escape`` se han eliminado del módulo :mod:`cgi`. Estaban obsoletas desde Python 3.2 o versiones anteriores. En su lugar, deberían ser importadas desde los módulos ``urllib.parse`` y ``html``.
