Repository: python/python-docs-es
Catalog: whatsnew/3.8.po
Languages: es_es

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They also re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
es_es: Se ha agregado "Run Customized" al menú Run para ejecutar un módulo con configuraciones personalizadas. Cualquier argumento de la línea de comandos ingresado se agrega a sys.argv. Además, vuelven a aparecer en el cuadro para la próxima ejecución personalizada. También se puede suprimir el reinicio normal del módulo principal de la Shell. (Contribución de Cheryl Sabella, Terry Jan Reedy y otros en :issue:`5680` y :issue:`37627`.)

source: Added optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
es_es: Se agregaron números de línea opcionales para las ventanas del editor IDLE. Las ventanas se abren sin números de línea, a menos que se establezca lo contrario en la pestaña General del cuadro de diálogo de configuración. Los números de línea de una ventana existente se muestran y ocultan en el menú Options. (Contribución de Tal Einat y Saimadhav Heblikar en :issue:`17535`.)

source: OS native encoding is now used for converting between Python strings and Tcl objects. This allows IDLE to work with emoji and other non-BMP characters. These characters can be displayed or copied and pasted to or from the clipboard. Converting strings from Tcl to Python and back now never fails. (Many people worked on this for eight years but the problem was finally solved by Serhiy Storchaka in :issue:`13153`.)
es_es: La codificación nativa del sistema operativo ahora se usa para convertir entre cadenas de Python y objetos Tcl. Esto permite que el IDLE funcione con emoji y otros caracteres que no son BMP. Estos caracteres se pueden mostrar o copiar y pegar en ,o desde, el portapapeles. Convertir cadenas de Tcl a Python y viceversa ahora nunca falla. (Mucha gente trabajó en esto durante ocho años, pero el problema finalmente lo resolvió Serhiy Storchaka en :issue:`13153`.)

source: New in 3.8.1:
es_es: Nuevo en 3.8.1:

source: Add option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
es_es: Agregue la opción para desactivar el parpadeo del cursor. (Contribuido por Zackery Spytz en :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
es_es: La tecla Escape ahora cierra las ventanas de finalización IDLE. (Contribuido por Johnny Najera en :issue:`38944`.)

source: The changes above have been backported to 3.7 maintenance releases.
es_es: Los cambios anteriores se han portado a las versiones de mantenimiento de Python 3.7.

source: Add keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
es_es: Agrega palabras clave a la lista de finalización del nombre del módulo. (Contribución de Terry J. Reedy en :issue:`37765`.)

source: The :func:`inspect.getdoc` function can now find docstrings for ``__slots__`` if that attribute is a :class:`dict` where the values are docstrings. This provides documentation options similar to what we already have for :func:`property`, :func:`classmethod`, and :func:`staticmethod`::
es_es: La función :func:`inspect.getdoc` puede ahora encontrar cadenas de documentación para ``__slots__`` si el este atributo es un :class:`dict` cuyos valores son las cadenas de documentación. Esto proporciona opciones de documentación similares a las que ya tenemos para :func:`property`, :func:`classmethod` y :func:`staticmethod`::

source: (Contributed by Raymond Hettinger in :issue:`36326`.)
es_es: (Contribución de Raymond Hettinger en :issue:`36326`.)

source: In development mode (:option:`-X` ``env``) and in :ref:`debug build <debug-build>`, the :class:`io.IOBase` finalizer now logs the exception if the ``close()`` method fails. The exception is ignored silently by default in release build. (Contributed by Victor Stinner in :issue:`18748`.)
es_es: En el modo de desarrollo (:option:`-X` ``env``) y en :ref:`debug build <debug-build>`, el finalizador :class:`io.IOBase` ahora registra la excepción si falla el método ``close()``. La excepción se ignora de forma silenciosa de forma predeterminada en la versión de la versión. (Contribuido por Victor Stinner en :issue:`18748`.)

source: The :func:`itertools.accumulate` function added an option *initial* keyword argument to specify an initial value::
es_es: Se ha agregado un argumento por palabra clave opcional *initial* a la función :func:`itertools.accumulate` para permitir especificar un valor inicial::

source: (Contributed by Lisa Roach in :issue:`34659`.)
es_es: (Contribución de Lisa Roach en :issue:`34659`.)

source: Add option ``--json-lines`` to parse every input line as a separate JSON object. (Contributed by Weipeng Hong in :issue:`31553`.)
es_es: Agregadas las opciones ``--json-lines`` para analizar sintácticamente cada línea de entrada como un objeto JSON separado. (Contribución de Weipeng Hong en :issue:`31553`.)

source: Added a *force* keyword argument to :func:`logging.basicConfig()` When set to true, any existing handlers attached to the root logger are removed and closed before carrying out the configuration specified by the other arguments.
es_es: Agregado un argumento por palabra clave *force* a la función :func:`logging.basicConfig()`. Cuando se establece en verdadero, cualquier controlador existente adjunto al registrador (logger) raíz se elimina y se cierra antes de realizar la configuración especificada por los otros argumentos.

source: This solves a long-standing problem. Once a logger or *basicConfig()* had been called, subsequent calls to *basicConfig()* were silently ignored. This made it difficult to update, experiment with, or teach the various logging configuration options using the interactive prompt or a Jupyter notebook.
es_es: Esto resuelve un problema de larga data. Una vez que se había invocado a un registrador o a *basicConfig()*, las invocaciones posteriores a *basicConfig()* se ignoraban en silencio. Esto dificultaba la actualización, la experimentación o la instrucción de las diversas opciones de configuración de registro mediante el interprete interactivo o el bloc de notas de Jupyter.

source: (Suggested by Raymond Hettinger, implemented by Donghee Na, and reviewed by Vinay Sajip in :issue:`33897`.)
es_es: (Sugerencia de Raymond Hettinger, implementación de Dong-hee Na y revisión de Vinay Sajip en :issue:`33897`.)

source: Added new function :func:`math.dist` for computing Euclidean distance between two points. (Contributed by Raymond Hettinger in :issue:`33089`.)
es_es: Se ha agregado la nueva función :func:`math.dist` para calcular la distancia euclidiana entre dos puntos. (Contribución de Raymond Hettinger en :issue:`33089`.)

source: Expanded the :func:`math.hypot` function to handle multiple dimensions. Formerly, it only supported the 2-D case. (Contributed by Raymond Hettinger in :issue:`33089`.)
es_es: Se ha expandido la función :func:`math.hypot` para manejar múltiples dimensiones. Anteriormente, solo admitía dos dimensiones. (Contribución de Raymond Hettinger en :issue:`33089`.)

source: Added new function, :func:`math.prod`, as analogous function to :func:`sum` that returns the product of a 'start' value (default: 1) times an iterable of numbers::
es_es: Agregada una nueva función, :func:`math.prod`, como función análoga a :func:`sum`, que retorna el producto de todos los elementos de un iterable de números partiendo de un valor de inicio (*start*) (por defecto: 1)::

source: (Contributed by Pablo Galindo in :issue:`35606`.)
es_es: (Contribución de Pablo Galindo en :issue:`35606`.)

source: Added two new combinatoric functions :func:`math.perm` and :func:`math.comb`::
es_es: Agregadas dos nuevas funciones combinatorias, :func:`math.perm` y :func:`math.comb`::

source: (Contributed by Yash Aggarwal, Keller Fuchs, Serhiy Storchaka, and Raymond Hettinger in :issue:`37128`, :issue:`37178`, and :issue:`35431`.)
es_es: (Contribución de Yash Aggarwal, Keller Fuchs, Serhiy Storchaka y Raymond Hettinger en :issue:`37128`, :issue:`37178` y :issue:`35431`.)

source: Added a new function :func:`math.isqrt` for computing accurate integer square roots without conversion to floating point. The new function supports arbitrarily large integers. It is faster than ``floor(sqrt(n))`` but slower than :func:`math.sqrt`::
es_es: Se ha agregada una nueva función :func:`math.isqrt` para calcular raíces cuadradas enteras precisas sin conversión a coma flotante. La nueva función admite números enteros arbitrariamente grandes. Es más rápida que ``floor(sqrt(n))`` pero más lenta que :func:`math.sqrt`::

source: (Contributed by Mark Dickinson in :issue:`36887`.)
es_es: (Contribución de Mark Dickinson en :issue:`36887`.)

source: The function :func:`math.factorial` no longer accepts arguments that are not int-like. (Contributed by Pablo Galindo in :issue:`33083`.)
es_es: La función :func:`math.factorial` ya no acepta argumentos que no sean similares a enteros. (Contribución de Pablo Galindo en :issue:`33083`.)

source: The :class:`mmap.mmap` class now has an :meth:`~mmap.mmap.madvise` method to access the ``madvise()`` system call. (Contributed by Zackery Spytz in :issue:`32941`.)
es_es: La clase :class:`mmap.mmap` ahora tiene un método :meth:`~mmap.mmap.madvise` para acceder a la llamada al sistema ``madvise()``. (Contribución de Zackery Spytz en :issue:`32941`.)

source: Added new :mod:`multiprocessing.shared_memory` module. (Contributed by Davin Potts in :issue:`35813`.)
es_es: Agregado el nuevo módulo :mod:`multiprocessing.shared_memory`. (Contribución de Davin Potts en :issue:`35813`.)

source: On macOS, the *spawn* start method is now used by default. (Contributed by Victor Stinner in :issue:`33725`.)
es_es: En macOS, el método de inicio *spawn* se usa ahora por defecto. (Contribución de Victor Stinner en :issue:`33725`.)

source: Added new function :func:`~os.add_dll_directory` on Windows for providing additional search paths for native dependencies when importing extension modules or loading DLLs using :mod:`ctypes`. (Contributed by Steve Dower in :issue:`36085`.)
es_es: Se agregó una nueva función :func:`~os.add_dll_directory` en Windows para proporcionar rutas de búsqueda adicionales para las dependencias nativas al importar módulos de extensión o al cargar archivos DLL utilizando :mod:`ctypes`. (Contribución de Steve Dower en :issue:`36085`.)

source: A new :func:`os.memfd_create` function was added to wrap the ``memfd_create()`` syscall. (Contributed by Zackery Spytz and Christian Heimes in :issue:`26836`.)
es_es: Se agregó una nueva función :func:`os.memfd_create` para envolver la llamada al sistema ``memfd_create()``. (Contribución de Zackery Spytz y Christian Heimes en :issue:`26836`.)

source: On Windows, much of the manual logic for handling reparse points (including symlinks and directory junctions) has been delegated to the operating system. Specifically, :func:`os.stat` will now traverse anything supported by the operating system, while :func:`os.lstat` will only open reparse points that identify as "name surrogates" while others are opened as for :func:`os.stat`. In all cases, :attr:`stat_result.st_mode` will only have ``S_IFLNK`` set for symbolic links and not other kinds of reparse points. To identify other kinds of reparse point, check the new :attr:`stat_result.st_reparse_tag` attribute.
es_es: En Windows, gran parte de la lógica manual para manejar los puntos de reinterpretación (incluidos los enlaces simbólicos y las uniones de directorios) se ha delegado al sistema operativo. Específicamente, :func:`os.stat` ahora se encargará de todo lo que sea compatible con el sistema operativo, mientras que :func:`os.lstat` solo abrirá puntos de reinterpretación que se identifican como "sustitutos de nombre" y el resto se abrirán mediante :func:`os.stat`. En todos los casos, :attr:`stat_result.st_mode` solo tendrá establecido ``S_IFLNK`` para enlaces simbólicos y no para otros tipos de puntos de reinterpretación. Para identificar otros tipos de puntos de reinterpretación, verifica el nuevo atributo :attr:`stat_result.st_reparse_tag`.

source: On Windows, :func:`os.readlink` is now able to read directory junctions. Note that :func:`~os.path.islink` will return ``False`` for directory junctions, and so code that checks ``islink`` first will continue to treat junctions as directories, while code that handles errors from :func:`os.readlink` may now treat junctions as links.
es_es: En Windows, :func:`os.readlink` ahora puede leer uniones de directorio. Ten en cuenta que :func:`~os.path.islink` retornará ``False`` para las uniones de directorios, por lo que el código que comprueba en primer lugar ``islink`` continuará tratando las uniones como directorios, mientras que el código que maneja los errores de :func:`os.readlink` ahora puede tratar las uniones como enlaces.

source: (Contributed by Steve Dower in :issue:`37834`.)
es_es: (Contribución de Steve Dower en :issue:`37834`.)

source: :mod:`os.path` functions that return a boolean result like :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink`, and :func:`~os.path.ismount` now return ``False`` instead of raising :exc:`ValueError` or its subclasses :exc:`UnicodeEncodeError` and :exc:`UnicodeDecodeError` for paths that contain characters or bytes unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
es_es: Las funciones de :mod:`os.path` que retornan un resultado booleano como :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink` e :func:`~os.path.ismount` ahora retornan ``False`` en lugar de lanzar una excepción :exc:`ValueError`, o sus subclases :exc:`UnicodeEncodeError` y :exc:`UnicodeDecodeError`, para rutas que contienen caracteres o bytes irrepresentables a nivel del sistema operativo. (Contribución de Serhiy Storchaka en :issue:`33721`.)

source: :func:`~os.path.expanduser` on Windows now prefers the :envvar:`USERPROFILE` environment variable and does not use :envvar:`HOME`, which is not normally set for regular user accounts. (Contributed by Anthony Sottile in :issue:`36264`.)
es_es: :func:`~os.path.expanduser` en Windows ahora usa preferentemente la variable de entorno :envvar:`USERPROFILE` y no usa :envvar:`HOME`, que normalmente no está establecido para cuentas de usuario normales. (Contribución de Anthony Sottile en :issue:`36264`.)

source: :func:`~os.path.isdir` on Windows no longer returns ``True`` for a link to a non-existent directory.
es_es: :func:`~os.path.isdir` en Windows ya no retorna ``True`` para un enlace a un directorio no existente.

source: :func:`~os.path.realpath` on Windows now resolves reparse points, including symlinks and directory junctions.
es_es: :func:`~os.path.realpath` en Windows ahora resuelve puntos de reinterpretación (reparse points), incluidos enlaces simbólicos y uniones de directorio.

source: :mod:`pathlib.Path` methods that return a boolean result like :meth:`~pathlib.Path.exists()`, :meth:`~pathlib.Path.is_dir()`, :meth:`~pathlib.Path.is_file()`, :meth:`~pathlib.Path.is_mount()`, :meth:`~pathlib.Path.is_symlink()`, :meth:`~pathlib.Path.is_block_device()`, :meth:`~pathlib.Path.is_char_device()`, :meth:`~pathlib.Path.is_fifo()`, :meth:`~pathlib.Path.is_socket()` now return ``False`` instead of raising :exc:`ValueError` or its subclass :exc:`UnicodeEncodeError` for paths that contain characters unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
es_es: Los métodos del módulo :mod:`pathlib.Path` que retornan un resultado booleano, como :meth:`~pathlib.Path.exists()`, :meth:`~pathlib.Path.is_dir()`, :meth:`~pathlib.Path.is_file()`, :meth:`~pathlib.Path.is_mount()`, :meth:`~pathlib.Path.is_symlink()`, :meth:`~pathlib.Path.is_block_device()`, :meth:`~pathlib.Path.is_char_device()`, :meth:`~pathlib.Path.is_fifo()` o :meth:`~pathlib.Path.is_socket()`, ahora retornan ``False`` en vez de lanzar una excepción :exc:`ValueError` o su subclase :exc:`UnicodeEncodeError` para rutas que contienen caracteres no representables a nivel del sistema operativo. (Contribución de Serhiy Storchaka en :issue:`33721`.)

source: Added :meth:`pathlib.Path.link_to()` which creates a hard link pointing to a path. (Contributed by Joannah Nanjekye in :issue:`26978`) Note that ``link_to`` was deprecated in 3.10 and removed in 3.12 in favor of a ``hardlink_to`` method added in 3.10 which matches the semantics of the existing ``symlink_to`` method.
es_es: Se agregó :meth:`pathlib.Path.link_to()` que crea un vínculo físico que apunta a una ruta. (Contribución de Joannah Nanjekye en :issue:`26978`) Tenga en cuenta que ``link_to`` quedó obsoleto en 3.10 y se eliminó en 3.12 en favor de un método ``hardlink_to`` agregado en 3.10 que coincide con la semántica del método ``symlink_to`` existente.

source: :mod:`pickle` extensions subclassing the C-optimized :class:`~pickle.Pickler` can now override the pickling logic of functions and classes by defining the special :meth:`~pickle.Pickler.reducer_override` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
es_es: Las extensiones de :mod:`pickle` que subclasifican la clase optimizada de C :class:`~pickle.Pickler` ahora pueden anular la lógica de pickling de funciones y clases definiendo el método especial :meth:`~pickle.Pickler.reducer_override`. (Contribución de Pierre Glaser y Olivier Grisel en :issue:`35900`.)

source: Added new :class:`plistlib.UID` and enabled support for reading and writing NSKeyedArchiver-encoded binary plists. (Contributed by Jon Janzen in :issue:`26707`.)
es_es: Se ha agregado la nueva clase :class:`plistlib.UID` y se ha habilitado el soporte para leer y escribir plists binarios codificados por NSKeyedArchiver. (Contribución de Jon Janzen en :issue:`26707`.)

source: The :mod:`pprint` module added a *sort_dicts* parameter to several functions. By default, those functions continue to sort dictionaries before rendering or printing. However, if *sort_dicts* is set to false, the dictionaries retain the order that keys were inserted. This can be useful for comparison to JSON inputs during debugging.
es_es: Se ha agregado el parámetro *sort_dicts* a varias funciones del módulo :mod:`pprint`. De forma predeterminada, esas funciones continúan ordenando los diccionarios antes de procesarlos o imprimirlos. Sin embargo, si *sort_dicts* se establece en falso, los diccionarios conservan el orden en que se insertaron las claves. Esto puede resultar útil para la comparación con entradas JSON durante la depuración.

source: In addition, there is a convenience new function, :func:`pprint.pp` that is like :func:`pprint.pprint` but with *sort_dicts* defaulting to ``False``::
es_es: Además, hay una nueva función de conveniencia, :func:`pprint.pp`, que es igual que :func:`pprint.pprint` pero con *sort_dicts* establecido en ``False`` por defecto::

source: (Contributed by Rémi Lapeyre in :issue:`30670`.)
es_es: (Contribución de Rémi Lapeyre en :issue:`30670`.)

source: :func:`py_compile.compile` now supports silent mode. (Contributed by Joannah Nanjekye in :issue:`22640`.)
es_es: :func:`py_compile.compile` ahora admite el modo silencioso. (Contribución de Joannah Nanjekye en :issue:`22640`.)

source: The new :func:`shlex.join` function acts as the inverse of :func:`shlex.split`. (Contributed by Bo Bayles in :issue:`32102`.)
es_es: La nueva función :func:`shlex.join` actúa a la inversa de :func:`shlex.split`. (Contribución de Bo Bayles en :issue:`32102`.)

source: :func:`shutil.copytree` now accepts a new ``dirs_exist_ok`` keyword argument. (Contributed by Josh Bronson in :issue:`20849`.)
es_es: :func:`shutil.copytree` ahora acepta el nuevo argumento por palabra clave ``dirs_exist_ok``. (Contribución de Josh Bronson en :issue:`20849`.)

source: :func:`shutil.make_archive` now defaults to the modern pax (POSIX.1-2001) format for new archives to improve portability and standards conformance, inherited from the corresponding change to the :mod:`tarfile` module. (Contributed by C.A.M. Gerlach in :issue:`30661`.)
es_es: :func:`shutil.make_archive` ahora usa por defecto el formato pax moderno (POSIX.1-2001) para nuevos archivos para mejorar la portabilidad y la conformidad con los estándares, heredado el cambio correspondiente del módulo :mod:`tarfile`. (Contribución de C.A.M. Gerlach en :issue:`30661`.)

source: :func:`shutil.rmtree` on Windows now removes directory junctions without recursively removing their contents first. (Contributed by Steve Dower in :issue:`37834`.)
es_es: :func:`shutil.rmtree` en Windows ahora elimina las uniones de directorio sin eliminar recursivamente su contenido primero. (Contribución de Steve Dower en :issue:`37834`.)

source: Added :meth:`~socket.create_server()` and :meth:`~socket.has_dualstack_ipv6()` convenience functions to automate the necessary tasks usually involved when creating a server socket, including accepting both IPv4 and IPv6 connections on the same socket. (Contributed by Giampaolo Rodolà in :issue:`17561`.)
es_es: Se han agregado las funciones de conveniencia :meth:`~ socket.create_server()` y :meth:`~socket.has_dualstack_ipv6()` para automatizar las tareas necesarias involucradas al crear un socket servidor, incluida la aceptación de conexiones IPv4 e IPv6 en el mismo socket . (Contribución de Giampaolo Rodolà en :issue:`17561`.)

source: The :func:`socket.if_nameindex()`, :func:`socket.if_nametoindex()`, and :func:`socket.if_indextoname()` functions have been implemented on Windows. (Contributed by Zackery Spytz in :issue:`37007`.)
es_es: Las funciones :func:`socket.if_nameindex()`, :func:`socket.if_nametoindex()` y :func:`socket.if_indextoname()` se han implementado en Windows. (Contribución de Zackery Spytz en :issue:`37007`.)

source: Added :attr:`~ssl.SSLContext.post_handshake_auth` to enable and :meth:`~ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :issue:`34670`.)
es_es: Se ha agregado :attr:`~ssl.SSLContext.post_handshake_auth` para habilitar y :meth:`~ssl.SSLSocket.verify_client_post_handshake` para iniciar la autenticación tras el establecimiento de la comunicación en TLS 1.3. (Contribución de Christian Heimes en :issue:`34670`.)

source: Added :func:`statistics.fmean` as a faster, floating point variant of :func:`statistics.mean()`. (Contributed by Raymond Hettinger and Steven D'Aprano in :issue:`35904`.)
es_es: Se ha agregado :func:`statistics.fmean` como una variante de punto flotante más rápida de :func:`statistics.mean()`. (Contribución de Raymond Hettinger y Steven D'Aprano en :issue:`35904`.)

source: Added :func:`statistics.geometric_mean()` (Contributed by Raymond Hettinger in :issue:`27181`.)
es_es: Se ha agregado :func:`statistics.geometric_mean()` (Contribución de Raymond Hettinger en :issue:`27181`.)

source: Added :func:`statistics.multimode` that returns a list of the most common values. (Contributed by Raymond Hettinger in :issue:`35892`.)
es_es: Se ha agregado :func:`statistics.multimode` que retorna una lista con los valores más comunes. (Contribución de Raymond Hettinger en :issue:`35892`.)
