Repository: python/python-docs-es
Catalog: whatsnew/3.9.po
Languages: es

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
es: Los valores constantes de los indicadores futuros en el módulo :mod:`__future__` se actualizan para evitar la colisión con los indicadores del compilador. Anteriormente, ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` chocaba con ``CO_FUTURE_DIVISION``. (Contribuido por Batuhan Taskaya en :issue:`39562`)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
es: La API :func:`logging.getLogger` ahora devuelve el registrador raíz cuando se le pasó el nombre ``'root'``, mientras que anteriormente devolvía un registrador no raíz llamado ``'root'``. Esto podría afectar los casos en los que el código de usuario desea explícitamente un registrador no root llamado ``'root'``, o crea una instancia de un registrador usando ``logging.getLogger(__name__)`` en algún módulo de nivel superior llamado ``'root.py'``. (Contribuido por Vinay Sajip en :issue:`37742`.)

source: Division handling of :class:`~pathlib.PurePath` now returns ``NotImplemented`` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
es: El manejo de división de :class:`~pathlib.PurePath` ahora devuelve ``NotImplemented`` en lugar de lanzar un :exc:`TypeError` cuando se pasa algo que no sea una instancia de ``str`` o :class:`~pathlib.PurePath`. Esto permite crear clases compatibles que no hereden de esos tipos mencionados. (Contribución de Roger Aiudi en :issue:`34775`).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
es: A partir de Python 3.9.5, el módulo :mod:`ipaddress` ya no acepta ceros a la izquierda en las cadenas de direcciones IPv4. Los ceros iniciales son ambiguos y algunas bibliotecas los interpretan como notación octal. Por ejemplo, la función heredada :func:`socket.inet_aton` trata los ceros iniciales como una notación octal. La implementación glibc del :func:`~socket.inet_pton` moderno no acepta ceros a la izquierda. (Contribuido por Christian Heimes en :issue:`36384`).

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
es: :func:`codecs.lookup` ahora normaliza el nombre de codificación de la misma manera que :func:`encodings.normalize_encoding`, excepto que :func:`codecs.lookup` también convierte el nombre a minúsculas. Por ejemplo, el nombre de codificación ``"latex+latin1"`` ahora está normalizado a ``"latex_latin1"``. (Contribuido por Jordon Xu en :issue:`37751`.)

source: Changes in the C API
es: Cambios en la API de C

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
es: Las instancias de :ref:`heap-allocated types <heap-types>` (como las creadas con :c:func:`PyType_FromSpec` y API similares) contienen una referencia a su objeto de tipo desde Python 3.8. Como se indica en los "Cambios en la API C" de Python 3.8, para la gran mayoría de los casos, no debería haber efectos secundarios, pero para los tipos que tienen una función personalizada :c:member:`~PyTypeObject.tp_traverse`, asegúrese de que todas las funciones ``tp_traverse`` personalizadas de los tipos asignados al montón visitan el tipo del objeto.

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
es: Si su función transversal delega en ``tp_traverse`` de su clase base (u otro tipo), asegúrese de que ``Py_TYPE(self)`` se visite solo una vez. Tenga en cuenta que solo se espera que :ref:`heap type <heap-types>` visite el tipo en ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
es: Por ejemplo, si su función ``tp_traverse`` incluye:

source: then add:
es: Luego añade:

source: (See :issue:`35810` and :issue:`40217` for more information.)
es: (Consulte :issue:`35810` y :issue:`40217` para obtener más información).

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
es: Las funciones ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` y ``PyEval_CallObjectWithKeywords`` están en desuso. Utilice :c:func:`PyObject_Call` y sus variantes en su lugar. (Ver más detalles en :issue:`29548`.)

source: CPython bytecode changes
es: Cambios en el código de bytes de CPython

source: The :opcode:`LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
es: Se agregó el código de operación :opcode:`LOAD_ASSERTION_ERROR` para manejar la declaración :keyword:`assert`. Anteriormente, la declaración de aserción no funcionaría correctamente si la excepción :exc:`AssertionError` estuviera siendo sombreada. (Contribuido por Zackery Spytz en :issue:`34880`.)

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
es: El código de operación :opcode:`COMPARE_OP` se dividió en cuatro instrucciones distintas:

source: ``COMPARE_OP`` for rich comparisons
es: ``COMPARE_OP`` para comparaciones enriquecidas

source: ``IS_OP`` for 'is' and 'is not' tests
es: ``IS_OP`` para pruebas 'es' y 'no es'

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
es: ``CONTAINS_OP`` para pruebas 'in' y 'not in'

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
es: ``JUMP_IF_NOT_EXC_MATCH`` para verificar las excepciones en las declaraciones 'try-except'.

source: (Contributed by Mark Shannon in :issue:`39156`.)
es: (Contribuido por Mark Shannon en :issue:`39156`.)

source: Build Changes
es: Construir cambios

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
es: Se ha eliminado la macro de compilación especial ``COUNT_ALLOCS``. (Contribuido por Victor Stinner en :issue:`39489`.)

source: On non-Windows platforms, the :c:func:`setenv` and :c:func:`unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
es: En plataformas que no son de Windows, ahora se requieren las funciones :c:func:`setenv` y :c:func:`unsetenv` para compilar Python. (Contribuido por Victor Stinner en :issue:`39395`.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
es: En plataformas que no son de Windows, la creación de instaladores ``bdist_wininst`` ahora no es compatible oficialmente. (Consulte :issue:`10945` para obtener más detalles).

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with ``--with-tcltk-includes`` and ``--with-tcltk-libs``. (Contributed by Ned Deily in :issue:`34956`.)
es: Al compilar Python en macOS desde la fuente, ``_tkinter`` ahora se vincula con marcos Tcl y Tk que no son del sistema si están instalados en ``/Library/Frameworks``, como había sido el caso en versiones anteriores de macOS. Si un SDK de macOS está configurado explícitamente, mediante :option:`--enable-universalsdk` o ``-isysroot``, solo se busca en el SDK. El comportamiento predeterminado aún se puede anular con `--with-tcltk-includes` y `--with-tcltk-libs`. (Contribuido por Ned Deily en :issue:`34956`.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
es: Python ahora se puede construir para Windows 10 ARM64. (Contribuido por Steve Dower en :issue:`33125`.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
es: Algunas pruebas individuales ahora se omiten cuando se usa ``--pgo``. Las pruebas en cuestión aumentaron significativamente el tiempo de la tarea PGO y probablemente no ayudaron a mejorar la optimización del ejecutable final. Esto acelera la tarea en un factor de aproximadamente 15 veces. La ejecución del conjunto de pruebas unitarias completo es lenta. Este cambio puede resultar en una compilación ligeramente menos optimizada ya que no se ejecutarán tantas ramas de código. Si está dispuesto a esperar la compilación mucho más lenta, el comportamiento anterior se puede restaurar usando ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. No garantizamos qué conjunto de tareas de PGO produce una compilación más rápida. Los usuarios interesados deben ejecutar sus propios puntos de referencia relevantes, ya que los resultados pueden depender del entorno, la carga de trabajo y la cadena de herramientas del compilador. (Consulte :issue:`36044` y :issue:`37707` para obtener más detalles).

source: C API Changes
es: Cambios en la API de C

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
es: Se agregó la función :c:func:`PyFrame_GetCode`: obtenga un código de marco. Se agregó la función :c:func:`PyFrame_GetBack`: obtenga el siguiente marco exterior del marco. (Contribuido por Victor Stinner en :issue:`40421`.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
es: Se agregó :c:func:`PyFrame_GetLineNumber` a la API C limitada. (Contribuido por Victor Stinner en :issue:`40421`.)

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
es: Se agregaron funciones :c:func:`PyThreadState_GetInterpreter` y :c:func:`PyInterpreterState_Get` para obtener el intérprete. Se agregó la función :c:func:`PyThreadState_GetFrame` para obtener el marco actual de un estado de subproceso de Python. Se agregó la función :c:func:`PyThreadState_GetID`: obtenga el identificador único de un estado de subproceso de Python. (Contribuido por Victor Stinner en :issue:`39947`.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
es: Se agregó una nueva función pública :c:func:`PyObject_CallNoArgs` a la API de C, que llama a un objeto de Python invocable sin ningún argumento. Es la forma más eficiente de llamar a un objeto de Python invocable sin ningún argumento. (Contribuido por Victor Stinner en :issue:`37194`.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
es: Cambios en la API C limitada (si se define la macro ``Py_LIMITED_API``):

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
es: Proporcione :c:func:`Py_EnterRecursiveCall` y :c:func:`Py_LeaveRecursiveCall` como funciones regulares para la API limitada. Anteriormente, se definían como macros, pero estas macros no se compilaban con la API C limitada que no puede acceder al campo ``PyThreadState.recursion_depth`` (la estructura es opaca en la API C limitada).

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
es: ``PyObject_INIT()`` y ``PyObject_INIT_VAR()`` se convierten en funciones "opacas" habituales para ocultar los detalles de la implementación.

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
es: (Contribuido por Victor Stinner en :issue:`38644` y :issue:`39542`.)

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
es: Se agregaron las funciones :c:func:`PyObject_GC_IsTracked` y :c:func:`PyObject_GC_IsFinalized` a la API pública para permitir consultar si los objetos de Python se están rastreando actualmente o si ya han sido finalizados por el recolector de basura, respectivamente. (Contribuido por Pablo Galindo Salgado en :issue:`40241`.)

source: Added :c:func:`_PyObject_FunctionStr` to get a user-friendly string representation of a function-like object. (Patch by Jeroen Demeyer in :issue:`37645`.)
es: Se agregó :c:func:`_PyObject_FunctionStr` para obtener una representación de cadena fácil de usar de un objeto similar a una función. (Parche de Jeroen Demeyer en :issue:`37645`.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
es: Se agregó :c:func:`PyObject_CallOneArg` para llamar a un objeto con un argumento posicional (parche de Jeroen Demeyer en :issue:`37483`).

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
es: ``PyInterpreterState.eval_frame`` (:pep:`523`) ahora requiere un nuevo parámetro *tstate* obligatorio (``PyThreadState*``). (Contribuido por Victor Stinner en :issue:`38500`.)

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
es: Módulos de extensión: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` y :c:member:`~PyModuleDef.m_free` Las funciones de :c:type:`PyModuleDef` ya no se llaman si el estado del módulo era solicitado pero aún no asignado. Este es el caso inmediatamente después de que se crea el módulo y antes de que se ejecute (función :c:data:`Py_mod_exec`). Más precisamente, estas funciones no se llaman si :c:member:`~PyModuleDef.m_size` es mayor que 0 y el estado del módulo (como lo devuelve :c:func:`PyModule_GetState`) es ``NULL``.

source: Extension modules without module state (``m_size <= 0``) are not affected.
es: Los módulos de extensión sin estado de módulo (``m_size <= 0``) no se ven afectados.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
es: Si se llama a :c:func:`Py_AddPendingCall` en un subinterpretador, la función ahora está programada para ser llamada desde el subinterpretador, en lugar de ser llamada desde el intérprete principal. Cada subinterpretador ahora tiene su propia lista de llamadas programadas. (Contribuido por Victor Stinner en :issue:`39984`.)

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
es: El registro de Windows ya no se usa para inicializar :data:`sys.path` cuando se usa la opción ``-E`` (si :c:member:`PyConfig.use_environment` está configurado en ``0``). Esto es importante al incrustar Python en Windows. (Contribuido por Zackery Spytz en :issue:`8901`.)

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
es: La variable global :c:data:`PyStructSequence_UnnamedField` ahora es una constante y se refiere a una cadena constante. (Contribuido por Serhiy Storchaka en :issue:`38650`.)

source: The :c:type:`PyGC_Head` structure is now opaque. It is only defined in the internal C API (``pycore_gc.h``). (Contributed by Victor Stinner in :issue:`40241`.)
es: La estructura :c:type:`PyGC_Head` ahora es opaca. Solo se define en la API C interna (``pycore_gc.h``). (Contribuido por Victor Stinner en :issue:`40241`.)

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
es: La función :c:func:`Py_FatalError` se reemplaza con una macro que registra automáticamente el nombre de la función actual, a menos que se defina la macro ``Py_LIMITED_API``. (Contribuido por Victor Stinner en :issue:`39882`.)

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
es: El protocolo vectorcall ahora requiere que la persona que llama solo pase cadenas como nombres de palabras clave. (Consulte :issue:`37540` para obtener más información).

source: Implementation details of a number of macros and functions are now hidden:
es: Los detalles de implementación de una serie de macros y funciones ahora están ocultos:

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
es: La macro :c:func:`PyObject_IS_GC` se convirtió en una función.

source: :c:func:`PyObject_GET_WEAKREFS_LISTPTR` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_weaklistoffset` member.
es: La macro :c:func:`PyObject_GET_WEAKREFS_LISTPTR` se convirtió en una función: la macro accedió directamente al miembro :c:member:`PyTypeObject.tp_weaklistoffset`.

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
es: La macro :c:func:`PyObject_CheckBuffer` se convirtió en una función: la macro accedió directamente al miembro :c:member:`PyTypeObject.tp_as_buffer`.

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
es: :c:func:`PyIndex_Check` ahora siempre se declara como una función opaca para ocultar los detalles de implementación: se eliminó la macro ``PyIndex_Check()``. La macro accedió directamente al miembro :c:member:`PyTypeObject.tp_as_number`.

source: (See :issue:`40170` for more details.)
es: (Consulte :issue:`40170` para obtener más detalles).

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
es: Se excluyeron las macros ``PyFPE_START_PROTECT()`` y ``PyFPE_END_PROTECT()`` de ``pyfpe.h`` de la API C limitada. (Contribuido por Victor Stinner en :issue:`38835`.)

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
es: Se ha eliminado la ranura ``tp_print`` de :ref:`PyTypeObject <type-structs>`. Se usó para imprimir objetos en archivos en Python 2.7 y antes. Desde Python 3.0, se ha ignorado y no se ha utilizado. (Contribuido por Jeroen Demeyer en :issue:`36974`.)

source: Excluded the following functions from the limited C API:
es: Se excluyeron las siguientes funciones de la API C limitada:

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
es: ``PyThreadState_DeleteCurrent()`` (Contribuido por Joannah Nanjekye en :issue:`37878`.)

source: The trashcan mechanism which never worked in the limited C API.
es: El mecanismo de papelera que nunca funcionó en la API C limitada.

source: Moved following functions and definitions to the internal C API:
es: Se movieron las siguientes funciones y definiciones a la API de C interna:

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
es: ``_Py_AddToAllObjects()`` (específico para ``Py_TRACE_REFS`` acumulación)
