Repository: python/python-docs-es
Catalog: whatsnew/3.9.po
Languages: es

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
es: Se eliminó el gancho ``_PyRuntime.getframe`` y se eliminó la macro ``_PyThreadState_GetFrame``, que era un alias de ``_PyRuntime.getframe``. Solo fueron expuestos por la API C interna. También se eliminó el tipo ``PyThreadFrameGetter``. (Contribuido por Victor Stinner en :issue:`39946`.)

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
es: Se eliminaron las siguientes funciones de la API de C. Llame a :c:func:`PyGC_Collect` explícitamente para borrar todas las listas libres. (Contribuido por Inada Naoki y Victor Stinner en :issue:`37340`, :issue:`38896` y :issue:`40428`.)

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
es: ``PyMethod_ClearFreeList()`` y ``PyCFunction_ClearFreeList()``: se han eliminado las listas libres de objetos de método enlazados.

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
es: ``PySet_ClearFreeList()``: la lista de conjuntos libres se ha eliminado en Python 3.4.

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
es: ``PyUnicode_ClearFreeList()``: la lista libre de Unicode se ha eliminado en Python 3.3.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
es: Función ``_PyUnicode_ClearStaticStrings()`` eliminada. (Contribuido por Victor Stinner en :issue:`39465`.)

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
es: Eliminado ``Py_UNICODE_MATCH``. Ha sido obsoleto por :pep:`393` y roto desde Python 3.3. En su lugar, se puede utilizar la función :c:func:`PyUnicode_Tailmatch`. (Contribuido por Inada Naoki en :issue:`36346`.)

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
es: Archivos de encabezado limpios de interfaces definidas pero sin implementación. Los símbolos API públicos que se eliminan son: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contribuido por Pablo Galindo Salgado en :issue:`39372`.)

source: Notable changes in Python 3.9.1
es: Cambios notables en Python 3.9.1

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
es: El comportamiento de :class:`typing.Literal` se modificó para cumplir con :pep:`586` y para coincidir con el comportamiento de los verificadores de tipo estático especificados en el PEP.

source: ``Literal`` now de-duplicates parameters.
es: ``Literal`` ahora elimina los parámetros duplicados.

source: Equality comparisons between ``Literal`` objects are now order independent.
es: Las comparaciones de igualdad entre objetos ``Literal`` ahora son independientes del orden.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
es: Las comparaciones de ``Literal`` ahora respetan los tipos. Por ejemplo, ``Literal[0] == Literal[False]`` evaluado previamente como ``True``. Ahora es ``False``. Para respaldar este cambio, la caché de tipos utilizada internamente ahora admite tipos diferenciados.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
es: Los objetos ``Literal`` ahora lanzarán una excepción :exc:`TypeError` durante las comparaciones de igualdad si alguno de sus parámetros no es :term:`hashable`. Tenga en cuenta que declarar ``Literal`` con parámetros mutables no arrojará un error:

source: (Contributed by Yurii Karabas in :issue:`42345`.)
es: (Contribuido por Yurii Karabas en :issue:`42345`.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
es: Compatibilidad con macOS 11.0 (Big Sur) y Apple Silicon Mac

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
es: A partir de 3.9.1, Python ahora es totalmente compatible con la construcción y ejecución en macOS 11.0 (Big Sur) y en Apple Silicon Macs (basado en la arquitectura ``ARM64``). Una nueva variante de compilación universal, ``universal2``, ahora está disponible para admitir de forma nativa tanto ``ARM64`` como ``Intel 64`` en un conjunto de ejecutables. Los binarios ahora también se pueden construir en versiones actuales de macOS para ser implementados en una variedad de versiones anteriores de macOS (probadas a 10.9) mientras hacen que algunas funciones y opciones más nuevas del sistema operativo estén disponibles condicionalmente según la versión del sistema operativo en uso en tiempo de ejecución ("vinculación débil" ).

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
es: (Contribuido por Ronald Oussoren y Lawrence D'Anna en :issue:`41100`.)

source: Notable changes in Python 3.9.2
es: Cambios notables en Python 3.9.2

source: collections.abc
es: colecciones.abc

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. A :exc:`DeprecationWarning` may be emitted for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9.1. This :exc:`DeprecationWarning` will become a :exc:`TypeError` in Python 3.10. (Contributed by Ken Jin in :issue:`42195`.)
es: :class:`collections.abc.Callable` genérico ahora aplana los parámetros de tipo, similar a lo que hace actualmente :data:`typing.Callable`. Esto significa que ``collections.abc.Callable[[int, str], str]`` tendrá ``__args__`` de ``(int, str, str)``; anteriormente esto era ``([int, str], str)``. Para permitir este cambio, :class:`types.GenericAlias` ahora puede ser subclasificado, y se devolverá una subclase al subíndice el tipo :class:`collections.abc.Callable`. El código que accede a los argumentos a través de :func:`typing.get_args` o ``__args__`` debe tener en cuenta este cambio. Se puede emitir un :exc:`DeprecationWarning` para formas no válidas de parametrizar :class:`collections.abc.Callable` que pueden haber pasado silenciosamente en Python 3.9.1. Este :exc:`DeprecationWarning` se convertirá en un :exc:`TypeError` en Python 3.10. (Contribuido por Ken Jin en :issue:`42195`.)

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
es: Las versiones anteriores de Python permitían el uso de ``;`` y ``&`` como separadores de parámetros de consulta en :func:`urllib.parse.parse_qs` y :func:`urllib.parse.parse_qsl`. Debido a problemas de seguridad y para cumplir con las recomendaciones más recientes del W3C, esto se ha cambiado para permitir solo una clave separadora, con ``&`` como predeterminado. Este cambio también afecta a :func:`cgi.parse` y :func:`cgi.parse_multipart` ya que utilizan las funciones afectadas internamente. Para obtener más detalles, consulte su documentación respectiva. (Contribuido por Adam Goldschmidt, Senthil Kumaran y Ken Jin en :issue:`42967`.)
