Repository: python/python-docs-es
Catalog: whatsnew/3.9.po
Languages: es

source: Optimized :func:`~set.difference_update` for the case when the other set is much larger than the base set. (Suggested by Evgeny Kapun with code contributed by Michele Orrù in :issue:`8425`.)
es: :func:`~set.difference_update` optimizado para el caso en el que el otro conjunto es mucho más grande que el conjunto base. (Sugerido por Evgeny Kapun con código aportado por Michele Orrù en :issue:`8425`.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
es: El asignador de objetos pequeños de Python (``obmalloc.c``) ahora permite (no más de) que una arena vacía permanezca disponible para su reutilización inmediata, sin devolverla al sistema operativo. Esto evita la paliza en bucles simples donde una arena podría crearse y destruirse de nuevo en cada iteración. (Contribuido por Tim Peters en :issue:`37257`.)

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Donghee Na in :issue:`39434`.)
es: :term:`floor division` de operación flotante ahora tiene un mejor rendimiento. También se actualiza el mensaje de :exc:`ZeroDivisionError` para esta operación. (Contribuido por Donghee Na en :issue:`39434`.)

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
es: La decodificación de cadenas cortas ASCII con códecs UTF-8 y ascii ahora es aproximadamente un 15% más rápida. (Contribuido por Inada Naoki en :issue:`37348`.)

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
es: A continuación, se muestra un resumen de las mejoras de rendimiento desde Python 3.4 hasta Python 3.9:

source: Deprecated
es: Obsoleto

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
es: El comando distutils ``bdist_msi`` ahora está en desuso, use ``bdist_wheel`` (paquetes de ruedas) en su lugar. (Contribuido por Hugo van Kemenade en :issue:`39586`.)

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
es: Actualmente, :func:`math.factorial` acepta instancias de :class:`float` con valores enteros no negativos (como ``5.0``). Sube un :exc:`ValueError` para flotadores no integrales y negativos. Ahora está en desuso. En futuras versiones de Python, lanzará un :exc:`TypeError` para todos los flotadores. (Contribuido por Serhiy Storchaka en :issue:`37315`.)

source: The :mod:`parser` and :mod:`symbol` modules are deprecated and will be removed in future versions of Python. For the majority of use cases, users can leverage the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
es: Los módulos :mod:`parser` y :mod:`symbol` están obsoletos y se eliminarán en futuras versiones de Python. Para la mayoría de los casos de uso, los usuarios pueden aprovechar la etapa de generación y compilación del árbol de sintaxis abstracta (AST), utilizando el módulo :mod:`ast`.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
es: El uso de :data:`NotImplemented` en un contexto booleano ha quedado obsoleto, ya que es casi exclusivamente el resultado de implementaciones incorrectas de comparadores ricos. Se convertirá en :exc:`TypeError` en una versión futura de Python. (Contribuido por Josh Rosenberg en :issue:`35712`.)

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
es: El módulo :mod:`random` actualmente acepta cualquier tipo hash como posible valor semilla. Desafortunadamente, no se garantiza que algunos de esos tipos tengan un valor hash determinista. Después de Python 3.9, el módulo restringirá sus semillas a :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` y :class:`bytearray`.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
es: Abrir el archivo :class:`~gzip.GzipFile` para escritura sin especificar el argumento *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* para abrirlo para escribir y silenciar una advertencia. (Contribuido por Serhiy Storchaka en :issue:`28286`.)

source: Deprecated the ``split()`` method of :class:`_tkinter.TkappType` in favour of the ``splitlist()`` method which has more consistent and predicable behavior. (Contributed by Serhiy Storchaka in :issue:`38371`.)
es: En desuso del método ``split ()`` de :class:`_tkinter.TkappType` en favor del método ``splitlist()`` que tiene un comportamiento más consistente y predecible. (Contribuido por Serhiy Storchaka en :issue:`38371`.)

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
es: El paso explícito de objetos de rutina a :func:`asyncio.wait` ha quedado obsoleto y se eliminará en la versión 3.11. (Contribuido por Yury Selivanov y Kyle Stanley en :issue:`34790`.)

source: binhex4 and hexbin4 standards are now deprecated. The :mod:`binhex` module and the following :mod:`binascii` functions are now deprecated:
es: Los estándares binhex4 y hexbin4 ahora están en desuso. El módulo :mod:`binhex` y las siguientes funciones :mod:`binascii` ahora están en desuso:

source: (Contributed by Victor Stinner in :issue:`39353`.)
es: (Contribuido por Victor Stinner en :issue:`39353`.)

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
es: Las clases :mod:`ast` ``slice``, ``Index`` y ``ExtSlice`` se consideran obsoletas y se eliminarán en futuras versiones de Python. El propio ``value`` debe utilizarse en lugar de ``Index(value)``. Se debe utilizar ``Tuple(slices, Load())`` en lugar de ``ExtSlice(slices)``. (Contribuido por Serhiy Storchaka en :issue:`34822`.)

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
es: Las clases :mod:`ast` ``Suite``, ``Param``, ``AugLoad`` y ``AugStore`` se consideran obsoletas y se eliminarán en futuras versiones de Python. No fueron generados por el analizador y no aceptados por el generador de código en Python 3. (Contribuido por Batuhan Taskaya en :issue:`39639` y :issue:`39969` y Serhiy Storchaka en :issue:`39988`).

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
es: Pasar ``None`` como primer argumento a la función :func:`shlex.split` ha quedado obsoleto. (Contribuido por Zackery Spytz en :issue:`33262`.)

source: :func:`smtpd.MailmanProxy` is now deprecated as it is unusable without an external module, ``mailman``. (Contributed by Samuel Colvin in :issue:`35800`.)
es: :func:`smtpd.MailmanProxy` ahora está en desuso porque no se puede utilizar sin un módulo externo, ``mailman``. (Contribuido por Samuel Colvin en :issue:`35800`.)

source: The :mod:`lib2to3` module now emits a :exc:`PendingDeprecationWarning`. Python 3.9 switched to a PEG parser (see :pep:`617`), and Python 3.10 may include new language syntax that is not parsable by lib2to3's LL(1) parser. The ``lib2to3`` module may be removed from the standard library in a future Python version. Consider third-party alternatives such as `LibCST`_ or `parso`_. (Contributed by Carl Meyer in :issue:`40360`.)
es: El módulo :mod:`lib2to3` ahora emite un :exc:`PendingDeprecationWarning`. Python 3.9 cambió a un analizador PEG (consulte :pep:`617`), y Python 3.10 puede incluir una nueva sintaxis de lenguaje que no es analizable por el analizador LL (1) de lib2to3. El módulo ``lib2to3`` puede eliminarse de la biblioteca estándar en una versión futura de Python. Considere alternativas de terceros como `LibCST`_ o `parso`_. (Contribuido por Carl Meyer en :issue:`40360`.)

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
es: El parámetro *random* de :func:`random.shuffle` ha quedado obsoleto. (Contribuido por Raymond Hettinger en :issue:`40465`)

source: Removed
es: Remoto

source: The erroneous version at :data:`unittest.mock.__version__` has been removed.
es: Se ha eliminado la versión errónea en :data:`unittest.mock.__version__`.

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
es: :class:`array.array`: Se han eliminado los métodos ``tostring()`` y ``fromstring()``. Eran alias de ``tobytes()`` y ``frombytes()``, obsoletos desde Python 3.2. (Contribuido por Victor Stinner en :issue:`38916`.)

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
es: Se ha eliminado la función ``sys.callstats()`` sin documentar. Desde Python 3.7, quedó obsoleto y siempre devolvió :const:`None`. Requería una opción de compilación especial ``CALL_PROFILE`` que ya se eliminó en Python 3.7. (Contribuido por Victor Stinner en :issue:`37414`.)

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
es: Se han eliminado las funciones ``sys.getcheckinterval()`` y ``sys.setcheckinterval()``. Fueron obsoletos desde Python 3.2. Utilice :func:`sys.getswitchinterval` y :func:`sys.setswitchinterval` en su lugar. (Contribuido por Victor Stinner en :issue:`37392`.)

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
es: Se ha eliminado la función C ``PyImport_Cleanup()``. Se documentó como: "Vacíe la tabla del módulo. Solo para uso interno". (Contribuido por Victor Stinner en :issue:`36710`.)

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
es: Se han eliminado los módulos ``_dummy_thread`` y ``dummy_threading``. Estos módulos quedaron obsoletos desde Python 3.7, que requiere compatibilidad con subprocesos. (Contribuido por Victor Stinner en :issue:`37312`.)

source: ``aifc.openfp()`` alias to ``aifc.open()``, ``sunau.openfp()`` alias to ``sunau.open()``, and ``wave.openfp()`` alias to :func:`wave.open()` have been removed. They were deprecated since Python 3.7. (Contributed by Victor Stinner in :issue:`37320`.)
es: Se han eliminado el alias de ``aifc.openfp()`` a ``aifc.open()``, el alias de ``sunau.openfp()`` a ``sunau.open()`` y el alias de ``wave.openfp()`` a :func:`wave.open()`. Fueron obsoletos desde Python 3.7. (Contribuido por Victor Stinner en :issue:`37320`.)

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
es: Se han eliminado los métodos ``getchildren()`` y ``getiterator()`` de las clases :class:`~xml.etree.ElementTree.ElementTree` y :class:`~xml.etree.ElementTree.Element` en el módulo :mod:`~xml.etree.ElementTree`. Fueron obsoletos en Python 3.2. Utilice ``iter(x)`` o ``list(x)`` en lugar de ``x.getchildren()`` y ``x.iter()`` o ``list(x.iter())`` en lugar de ``x.getiterator()``. (Contribuido por Serhiy Storchaka en :issue:`36543`.)

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
es: Se eliminó la antigua API :mod:`plistlib`, quedó en desuso desde Python 3.4. Utilice las funciones :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` y :func:`~plistlib.dumps`. Además, se eliminó el parámetro *use_builtin_types*; en su lugar, siempre se utilizan objetos :class:`bytes` estándar. (Contribuido por Jon Janzen en :issue:`36409`.)

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
es: Se ha eliminado la función C ``PyGen_NeedsFinalizing``. No se documentó, probó ni usó en ningún lugar dentro de CPython después de la implementación de :pep:`442`. Parche de Joannah Nanjekye. (Contribuido por Joannah Nanjekye en :issue:`15088`)

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
es: ``base64.encodestring()`` y ``base64.decodestring()``, los alias obsoletos desde Python 3.1, se han eliminado: utilice :func:`base64.encodebytes` y :func:`base64.decodebytes` en su lugar. (Contribuido por Victor Stinner en :issue:`39351`.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
es: La función ``fractions.gcd()`` se ha eliminado, está obsoleta desde Python 3.5 (:issue:`22486`): utilice :func:`math.gcd` en su lugar. (Contribuido por Victor Stinner en :issue:`39350`.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
es: Se ha eliminado el parámetro *buffering* de :class:`bz2.BZ2File`. Desde Python 3.0, se ignoró y su uso emitió un :exc:`DeprecationWarning`. Pase un objeto de archivo abierto para controlar cómo se abre el archivo. (Contribuido por Victor Stinner en :issue:`39357`.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
es: Se ha eliminado el parámetro *encoding* de :func:`json.loads`. A partir de Python 3.1, fue obsoleto e ignorado; su uso ha emitido un :exc:`DeprecationWarning` desde Python 3.8. (Contribuido por Inada Naoki en :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
es: Las declaraciones ``with (await asyncio.lock):`` y ``with (yield from asyncio.lock):`` ya no son compatibles, utilice ``async with lock`` en su lugar. Lo mismo es correcto para ``asyncio.Condition`` y ``asyncio.Semaphore``. (Contribuido por Andrew Svetlov en :issue:`34793`.)

source: The :func:`sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
es: Se han eliminado la función :func:`sys.getcounts`, la opción de línea de comando ``-X showalloccount`` y el campo ``show_alloc_count`` de la estructura C :c:type:`PyConfig`. Necesitaban una compilación especial de Python definiendo la macro ``COUNT_ALLOCS``. (Contribuido por Victor Stinner en :issue:`39489`.)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
es: Se ha eliminado el atributo ``_field_types`` de la clase :class:`typing.NamedTuple`. Quedó en desuso desde Python 3.8. En su lugar, utilice el atributo ``__annotations__``. (Contribuido por Serhiy Storchaka en :issue:`40182`.)

source: The :meth:`symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
es: Se ha eliminado el método :meth:`symtable.SymbolTable.has_exec`. Quedó en desuso desde 2006 y solo devuelve ``False`` cuando se llama. (Contribuido por Batuhan Taskaya en :issue:`40208`)

source: The :meth:`asyncio.Task.current_task` and :meth:`asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
es: Se han eliminado :meth:`asyncio.Task.current_task` y :meth:`asyncio.Task.all_tasks`. Fueron obsoletos desde Python 3.7 y puede usar :func:`asyncio.current_task` y :func:`asyncio.all_tasks` en su lugar. (Contribución de Rémi Lapeyre en :issue:`40967`)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
es: El método ``unescape()`` en la clase :class:`html.parser.HTMLParser` se ha eliminado (quedó obsoleto desde Python 3.4). :func:`html.unescape` debe usarse para convertir referencias de caracteres a los caracteres Unicode correspondientes.

source: Porting to Python 3.9
es: Portar a Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
es: Esta sección enumera los cambios descritos anteriormente y otras correcciones de errores que pueden requerir cambios en su código.

source: Changes in the Python API
es: Cambios en la API de Python

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
es: :func:`__import__` y :func:`importlib.util.resolve_name` ahora lanzan :exc:`ImportError` donde anteriormente lanzaban :exc:`ValueError`. Las personas que llaman que detectan el tipo de excepción específico y son compatibles con Python 3.9 y versiones anteriores deberán detectar ambas usando ``except (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
es: Los scripts de activación de :mod:`venv` ya no son casos especiales cuando ``__VENV_PROMPT__`` se establece en ``""``.

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
es: Se ha eliminado el parámetro *compresslevel* :class:`bz2.BZ2File` se convirtió solo en un parámetro de llave, ya que *buffering* se quitó. (Contribuido por Victor Stinner en :issue:`39357`.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
es: AST simplificado para suscripción. Los índices simples se representarán por su valor, los segmentos extendidos se representarán como tuplas. ``Index(value)`` devolverá un ``value`` en sí mismo, ``ExtSlice(slices)`` devolverá ``Tuple(slices, Load())``. (Contribuido por Serhiy Storchaka en :issue:`34822`.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
es: El módulo :mod:`importlib` ahora ignora la variable de entorno :envvar:`PYTHONCASEOK` cuando se utilizan las opciones de línea de comando :option:`-E` o :option:`-I`.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
es: El parámetro *encoding* se ha agregado a las clases :class:`ftplib.FTP` y :class:`ftplib.FTP_TLS` como un parámetro de solo palabra clave, y la codificación predeterminada se cambia de Latin-1 a UTF-8 para seguir: rfc: `2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
es: :meth:`asyncio.loop.shutdown_default_executor` se ha agregado a :class:`~asyncio.AbstractEventLoop`, lo que significa que los bucles de eventos alternativos que heredan de él deben tener definido este método. (Contribuido por Kyle Stanley en :issue:`34037`.)
