Repository: python/python-docs-es
Catalog: whatsnew/3.9.po
Languages: es

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
es: Se agregó un nuevo :term:`coroutine` :func:`asyncio.to_thread`. Se utiliza principalmente para ejecutar funciones vinculadas a IO en un hilo separado para evitar bloquear el bucle de eventos, y esencialmente funciona como una versión de alto nivel de :meth:`~asyncio.loop.run_in_executor` que puede tomar directamente argumentos de palabras clave. (Contribuido por Kyle Stanley y Yury Selivanov en :issue:`32309`.)

source: When cancelling the task due to a timeout, :meth:`asyncio.wait_for` will now wait until the cancellation is complete also in the case when *timeout* is <= 0, like it does with positive timeouts. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
es: Al cancelar la tarea debido a un tiempo de espera, :meth:`asyncio.wait_for` ahora esperará hasta que se complete la cancelación también en el caso de que *timeout* sea <= 0, como ocurre con los tiempos de espera positivos. (Contribuido por Elvis Pranskevichus en :issue:`32751`.)

source: :mod:`asyncio` now raises :exc:`TyperError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. (Contributed by Ido Michael in :issue:`37404`.)
es: :mod:`asyncio` ahora lanza :exc:`TyperError` al llamar a métodos incompatibles con un socket :class:`ssl.SSLSocket`. (Contribuido por Ido Michael en :issue:`37404`.)

source: compileall
es: compilar todo

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
es: Se agregó una nueva posibilidad de usar enlaces duros para archivos ``.pyc`` duplicados: parámetro *hardlink_dupes* y opción de línea de comando --hardlink-dupes. (Contribuido por Lumír 'Frenzy' Balhar en :issue:`40495`.)

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
es: Se agregaron nuevas opciones para la manipulación de rutas en los archivos ``.pyc`` resultantes: parámetros *stripdir*, *prependdir*, *limit_sl_dest* y opciones de línea de comando -s, -p, -e. Se agregó la posibilidad de especificar la opción para un nivel de optimización varias veces. (Contribuido por Lumír 'Frenzy' Balhar en :issue:`38112`.)

source: concurrent.futures
es: Futuros concurrentes

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
es: Se agregó un nuevo parámetro *cancel_futures* a :meth:`concurrent.futures.Executor.shutdown` que cancela todos los futuros pendientes que no han comenzado a ejecutarse, en lugar de esperar a que se completen antes de apagar el ejecutor. (Contribuido por Kyle Stanley en :issue:`39349`.)

source: Removed daemon threads from :class:`~concurrent.futures.ThreadPoolExecutor` and :class:`~concurrent.futures.ProcessPoolExecutor`. This improves compatibility with subinterpreters and predictability in their shutdown processes. (Contributed by Kyle Stanley in :issue:`39812`.)
es: Se eliminaron los subprocesos del demonio de :class:`~concurrent.futures.ThreadPoolExecutor` y :class:`~concurrent.futures.ProcessPoolExecutor`. Esto mejora la compatibilidad con los subinterpretadores y la previsibilidad en sus procesos de cierre. (Contribuido por Kyle Stanley en :issue:`39812`.)

source: Workers in :class:`~concurrent.futures.ProcessPoolExecutor` are now spawned on demand, only when there are no available idle workers to reuse. This optimizes startup overhead and reduces the amount of lost CPU time to idle workers. (Contributed by Kyle Stanley in :issue:`39207`.)
es: Los trabajadores en :class:`~concurrent.futures.ProcessPoolExecutor` ahora se generan a pedido, solo cuando no hay trabajadores inactivos disponibles para reutilizar. Esto optimiza la sobrecarga de inicio y reduce la cantidad de tiempo de CPU perdido para los trabajadores inactivos. (Contribuido por Kyle Stanley en :issue:`39207`.)

source: curses
es: maldiciones

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
es: Se agregaron funciones :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize` y :func:`curses.set_tabsize`. (Contribuido por Anthony Sottile en :issue:`38312`.)

source: datetime
es: fecha y hora

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
es: El comando: command: `upload` ahora crea resúmenes de hash SHA2-256 y Blake2b-256. Omite MD5 en plataformas que bloquean el resumen de MD5. (Contribuido por Christian Heimes en :issue:`40698`.)

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
es: Cuando el recolector de basura realiza una recolección en la que resucitan algunos objetos (se puede acceder a ellos desde fuera de los ciclos aislados después de que se hayan ejecutado los finalizadores), no bloquee la recolección de todos los objetos que aún no se pueden alcanzar. (Contribuido por Pablo Galindo y Tim Peters en :issue:`38379`.)

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
es: Se agregó una nueva función :func:`gc.is_finalized` para verificar si el recolector de basura ha finalizado un objeto. (Contribuido por Pablo Galindo en :issue:`39322`.)

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
es: El módulo :mod:`hashlib` ahora puede usar hashes SHA3 y SHAKE XOF de OpenSSL cuando esté disponible. (Contribuido por Christian Heimes en :issue:`37630`.)

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
es: Los módulos hash incorporados ahora pueden desactivarse con ``./configure --without-builtin-hashlib-hashes`` o activarse selectivamente con p. Ej. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` para forzar el uso de la implementación basada en OpenSSL. (Contribuido por Christian Heimes en :issue:`40479`)

source: IDLE and idlelib
es: IDLE e idlelib

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
es: Opción agregada para apagar el cursor parpadeando. (Contribuido por Zackery Spytz en :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
es: La tecla Escape ahora cierra las ventanas de finalización IDLE. (Contribuido por Johnny Najera en :issue:`38944`.)

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
es: Se agregaron palabras clave a la lista de finalización del nombre del módulo. (Contribuido por Terry J. Reedy en :issue:`37765`.)

source: New in 3.9 maintenance releases
es: Novedades de la versión de mantenimiento 3.9

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
es: Hacer que IDLE invoque :func:`sys.excepthook` (cuando se inicia sin '-n'). Anteriormente se ignoraban los hooks de usuario. (Contribuido por Ken Hilton en :issue:`43008`.)

source: The changes above have been backported to 3.8 maintenance releases.
es: Los cambios anteriores se han actualizado a las versiones de mantenimiento 3.8.

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
es: Reorganizar el diálogo de configuración. Dividir la pestaña General en Windows y Shell/Ed. Mover las fuentes de ayuda, que amplían el menú Ayuda, a la pestaña Extensiones. Hacer espacio para nuevas opciones y acortar el diálogo. Esto último hace que el diálogo se adapte mejor a las pantallas pequeñas. (Contribuido por Terry Jan Reedy en :issue:`40468`.) Mover la configuración del espacio de sangría de la pestaña Fuente a la nueva pestaña Windows. (Contribuido por Mark Roseman y Terry Jan Reedy en :issue:`33962`.)

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
es: Aplicar el resaltado de sintaxis a los archivos ``.pyi``. (Contribución de Alex Waygood y Terry Jan Reedy en :issue:`45447`)

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
es: Para mejorar la coherencia con las declaraciones de importación, :func:`importlib.util.resolve_name` ahora lanza :exc:`ImportError` en lugar de :exc:`ValueError` para intentos de importación relativa no válidos. (Contribuido por Ngalim Siregar en :issue:`37444`.)

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
es: Los cargadores de importación que publican objetos de módulo inmutables ahora pueden publicar paquetes inmutables además de módulos individuales. (Contribuido por Dino Viehland en :issue:`39336`.)

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
es: Se agregó la función :func:`importlib.resources.files` con soporte para subdirectorios en los datos del paquete, compatible con el backport en ``importlib_resources`` versión 1.5. (Contribuido por Jason R. Coombs en :issue:`39791`.)

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
es: ``importlib.metadata`` actualizado de ``importlib_metadata`` versión 1.6.1.

source: inspect
es: inspeccionar

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
es: :attr:`inspect.BoundArguments.arguments` se cambia de ``OrderedDict`` a dictado regular. (Contribuido por Inada Naoki en :issue:`36350` y :issue:`39775`.)

source: ipaddress
es: dirección IP

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
es: :mod:`ipaddress` ahora admite direcciones de ámbito IPv6 (dirección IPv6 con sufijo ``%<scope_id>``).

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
es: Las direcciones IPv6 con alcance se pueden analizar mediante :class:`ipaddress.IPv6Address`. Si está presente, la identificación de la zona del alcance está disponible a través del atributo :attr:`~ipaddress.IPv6Address.scope_id`. (Contribuido por Oleksandr Pavliuk en :issue:`34788`.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
es: A partir de Python 3.9.5, el módulo :mod:`ipaddress` ya no acepta ceros a la izquierda en cadenas de direcciones IPv4. (Contribuido por Christian Heimes en :issue:`36384`).

source: math
es: Matemáticas

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
es: Se amplió la función :func:`math.gcd` para manejar múltiples argumentos. Anteriormente, solo respaldaba dos argumentos. (Contribuido por Serhiy Storchaka en :issue:`39648`.)

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
es: :func:`math.lcm` agregado: devuelve el mínimo común múltiplo de argumentos especificados. (Contribuido por Mark Dickinson, Ananthakrishnan y Serhiy Storchaka en :issue:`39479` y :issue:`39648`.)

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
es: :func:`math.nextafter` agregado: devuelve el siguiente valor de punto flotante después de *x* towards *y*. (Contribuido por Victor Stinner en :issue:`39288`.)

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
es: :func:`math.ulp` agregado: devuelve el valor del bit menos significativo de un flotador. (Contribuido por Victor Stinner en :issue:`39310`.)

source: multiprocessing
es: multiprocesamiento

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
es: La clase :class:`multiprocessing.SimpleQueue` tiene un nuevo método :meth:`~multiprocessing.SimpleQueue.close` para cerrar explícitamente la cola. (Contribuido por Victor Stinner en :issue:`30966`.)

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
es: La función :func:`os.unsetenv` ahora también está disponible en Windows. (Contribuido por Victor Stinner en :issue:`39413`.)

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
es: Las funciones :func:`os.putenv` y :func:`os.unsetenv` ahora están siempre disponibles. (Contribuido por Victor Stinner en :issue:`39395`.)

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
es: Función :func:`os.waitstatus_to_exitcode` agregada: convierte un estado de espera en un código de salida. (Contribuido por Victor Stinner en :issue:`40094`.)

source: Added :meth:`pathlib.Path.readlink()` which acts similarly to :func:`os.readlink`. (Contributed by Girts Folkmanis in :issue:`30618`)
es: Se agregó :meth:`pathlib.Path.readlink()` que actúa de manera similar a :func:`os.readlink`. (Contribuido por Girts Folkmanis en :issue:`30618`)

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
es: En Windows, ahora :class:`~pdb.Pdb` es compatible con ``~/.pdbrc``. (Contribuido por Tim Hopper y Dan Lidral-Porter en :issue:`20523`.)

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
es: :mod:`pprint` ahora puede imprimir :class:`types.SimpleNamespace` de forma bonita. (Contribuido por Carl Bordum Hansen en :issue:`37376`.)

source: The documentation string is now shown not only for class, function, method etc, but for any object that has its own ``__doc__`` attribute. (Contributed by Serhiy Storchaka in :issue:`40257`.)
es: La cadena de documentación ahora se muestra no solo para la clase, función, método, etc., sino para cualquier objeto que tenga su propio atributo ``__doc__``. (Contribuido por Serhiy Storchaka en :issue:`40257`.)

source: random
es: aleatorio

source: Added a new :attr:`random.Random.randbytes` method: generate random bytes. (Contributed by Victor Stinner in :issue:`40286`.)
es: Se agregó un nuevo método :attr:`random.Random.randbytes`: generar bytes aleatorios. (Contribuido por Victor Stinner en :issue:`40286`.)

source: signal
es: señal

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
es: Expuso el :func:`signal.pidfd_send_signal` específico de Linux para enviar señales a un proceso utilizando un descriptor de archivo en lugar de un pid. (:issue:`38712`)

source: socket
es: enchufe

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
es: El módulo de enchufe ahora tiene las funciones :func:`socket.send_fds` y :func:`socket.recv_fds`. (Contribuido por Joannah Nanjekye, Shinya Okano y Victor Stinner en :issue:`28724`.)

source: time
es: tiempo

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 milliseconds. (Contributed by Batuhan Taskaya in :issue:`40192`)
es: En AIX, :func:`~time.thread_time` ahora se implementa con ``thread_cputime()`` que tiene una resolución de nanosegundos, en lugar de ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` que tiene una resolución de 10 ms. (Contribuido por Batuhan Taskaya en :issue:`40192`)

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
es: Se agregó :func:`tracemalloc.reset_peak` para establecer el tamaño máximo de los bloques de memoria rastreados al tamaño actual, para medir el pico de piezas de código específicas. (Contribuido por Huon Wilson en :issue:`40630`.)

source: typing
es: mecanografía

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
es: :pep:`593` introdujo un tipo :data:`typing.Annotated` para decorar tipos existentes con metadatos específicos del contexto y el nuevo parámetro ``include_extras`` en :func:`typing.get_type_hints` para acceder a los metadatos en tiempo de ejecución. (Contribuido por Till Varoquaux y Konstantin Kashin.)

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
es: La base de datos Unicode se ha actualizado a la versión 13.0.0. (:issue:`39926`).

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
es: Los scripts de activación proporcionados por :mod:`venv` ahora especifican su personalización de solicitud de manera consistente utilizando siempre el valor especificado por ``__VENV_PROMPT__``. Anteriormente, algunos scripts usaban ``__VENV_PROMPT__`` incondicionalmente, otros solo si estaba configurado (que era el caso predeterminado) y uno usaba ``__VENV_NAME__`` en su lugar. (Contribuido por Brett Cannon en :issue:`37663`.)

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
es: Los caracteres de espacio en blanco dentro de los atributos ahora se conservan al serializar :mod:`xml.etree.ElementTree` en un archivo XML. Los EOLN ya no se normalizan a "\ n". Este es el resultado de la discusión sobre cómo interpretar la sección 2.11 de la especificación XML. (Contribuido por Mefistotelis en :issue:`39011`.)

source: Optimizations
es: Optimizaciones

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
es: Optimización del idioma para la asignación de una variable temporal en las comprensiones. Ahora ``for y in [expr]`` en comprensiones es tan rápido como una simple asignación ``y = expr``. Por ejemplo:

source: sums = [s for s in [0] for x in data for s in [s + x]]
es: sumas = [s para s en [0] para x en datos para s en [s + x]]

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
es: A diferencia del operador ``:=``, este idioma no filtra una variable al alcance externo.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
es: (Contribuido por Serhiy Storchaka en :issue:`32856`.)

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
es: Manejo de señal optimizado en aplicaciones multiproceso. Si un subproceso diferente al subproceso principal recibe una señal, el bucle de evaluación del código de bytes ya no se interrumpe en cada instrucción de código de bytes para verificar si hay señales pendientes que no se pueden manejar. Solo el hilo principal del intérprete principal puede manejar señales.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
es: Anteriormente, el ciclo de evaluación del código de bytes se interrumpía en cada instrucción hasta que el hilo principal manejaba las señales. (Contribuido por Victor Stinner en :issue:`40010`.)

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
es: Optimicé el módulo :mod:`subprocess` en FreeBSD usando ``closefrom()``. (Contribuido por Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak y Victor Stinner en :issue:`38061`.)

source: :c:func:`PyLong_FromDouble` is now up to 1.87x faster for values that fit into :c:expr:`long`. (Contributed by Sergey Fedoseev in :issue:`37986`.)
es: :c:func:`PyLong_FromDouble` ahora es hasta 1,87 veces más rápido para valores que se ajustan a :c:expr:`long`. (Contribuido por Sergey Fedoseev en :issue:`37986`.)
