Repository: python/python-docs-es
Catalog: whatsnew/3.9.po
Languages: es

source: What's New In Python 3.9
es: Qué hay de nuevo en Python 3.9

source: :pep:`596` - Python 3.9 Release Schedule
es: :pep:`596` - Programa de lanzamiento de Python 3.9

source: Summary -- Release highlights
es: Resumen: aspectos destacados de la versión

source: New syntax features:
es: Nuevas funciones de sintaxis:

source: :pep:`584`, union operators added to ``dict``;
es: :pep:`584`, operadores unión agregados a ``dict``;

source: :pep:`585`, type hinting generics in standard collections;
es: :pep:`585`, genéricos de sugerencia de tipo en colecciones estándar;

source: :pep:`614`, relaxed grammar restrictions on decorators.
es: :pep:`614`, restricciones gramaticales relajadas para los decoradores.

source: New built-in features:
es: Nuevas funciones integradas:

source: :pep:`616`, string methods to remove prefixes and suffixes.
es: :pep:`616`, métodos de cadena para eliminar prefijos y sufijos.

source: New features in the standard library:
es: Nuevas funciones en la biblioteca estándar:

source: :pep:`593`, flexible function and variable annotations;
es: :pep:`593`, función flexible y anotaciones variables;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
es: Se agregó :func:`os.pidfd_open` que permite la gestión de procesos sin razas ni señales.

source: Interpreter improvements:
es: Mejoras en el intérprete:

source: :pep:`573`, fast access to module state from methods of C extension types;
es: :pep:`573`, acceso rápido al estado del módulo desde métodos de tipos de extensión C;

source: :pep:`617`, CPython now uses a new parser based on PEG;
es: :pep:`617`, CPython ahora usa un nuevo analizador basado en PEG;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
es: varias incorporaciones de Python (rango, tupla, conjunto, conjunto frozenset, lista, dict) ahora se aceleran usando :pep:`590` vectorcall;

source: garbage collection does not block on resurrected objects;
es: la recolección de basura no bloquea los objetos resucitados;

source: a number of Python modules (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) now use multiphase initialization as defined by PEP 489;
es: varios módulos de Python (:mod:`_abc`, :mod:`audioop`, :mod:`_bz2`, :mod:`_codecs`, :mod:`_contextvars`, :mod:`_crypt`, :mod:`_functools`, :mod:`_json`, :mod:`_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`_weakref`) ahora utilizan la inicialización multifase según lo definido por PEP 489;

source: a number of standard library modules (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
es: varios módulos de biblioteca estándar (:mod:`audioop`, :mod:`ast`, :mod:`grp`, :mod:`_hashlib`, :mod:`pwd`, :mod:`_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) ahora utilizan la ABI estable definida por PEP 384.

source: New library modules:
es: Nuevos módulos de biblioteca:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
es: :pep:`615`, la base de datos de zona horaria de IANA ahora está presente en la biblioteca estándar en el módulo :mod:`zoneinfo`;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
es: ahora se proporciona una implementación de una especie de gráfico topológico en el nuevo módulo :mod:`graphlib`.

source: Release process changes:
es: Cambios en el proceso de lanzamiento:

source: :pep:`602`, CPython adopts an annual release cycle.
es: :pep:`602`, CPython adopta un ciclo de lanzamiento anual.

source: You should check for DeprecationWarning in your code
es: Debe verificar DeprecationWarning en su código

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
es: Cuando todavía se admitía Python 2.7, se conservaba una gran cantidad de funciones en Python 3 por compatibilidad con versiones anteriores de Python 2.7. Con el fin de la compatibilidad con Python 2, estas capas de compatibilidad con versiones anteriores se eliminaron o se eliminarán pronto. La mayoría de ellos emitió una advertencia :exc:`DeprecationWarning` durante varios años. Por ejemplo, usar ``collections.Mapping`` en lugar de ``collections.abc.Mapping`` emite un :exc:`DeprecationWarning` desde Python 3.3, lanzado en 2012.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
es: Pruebe su aplicación con la opción de línea de comandos :option:`-W` ``default`` para ver :exc:`DeprecationWarning` y :exc:`PendingDeprecationWarning`, o incluso con :option:`-W` ``error`` para tratarlos como errores. :ref:`Warnings Filter <warning-filter>` se puede utilizar para ignorar las advertencias del código de terceros.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
es: Python 3.9 es la última versión que proporciona esas capas de compatibilidad con versiones anteriores de Python 2, para dar más tiempo a los mantenedores de proyectos de Python para organizar la eliminación del soporte de Python 2 y agregar soporte para Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
es: Los alias de :ref:`Abstract Base Classes <collections-abstract-base-classes>` en el módulo :mod:`collections`, como el alias de ``collections.Mapping`` de :class:`collections.abc.Mapping`, se mantienen para una última versión por compatibilidad con versiones anteriores. Se eliminarán de Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
es: De manera más general, intente ejecutar sus pruebas en el :ref:`Python Development Mode <devmode>`, lo que ayuda a preparar su código para que sea compatible con la próxima versión de Python.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
es: Nota: también se eliminaron varias obsoletas en esta versión de Python. Consulte la sección :ref:`removed-in-python-39`.

source: New Features
es: Nuevas características

source: Dictionary Merge & Update Operators
es: Operadores de combinación y actualización de diccionarios

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
es: Los operadores de fusión (``|``) y actualización (``|=``) se han agregado a la clase :class:`dict` incorporada. Estos complementan los métodos ``dict.update`` y ``{**d1, **d2}`` existentes para fusionar diccionarios.

source: Example::
es: Ejemplo::

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
es: Consulte :pep:`584` para obtener una descripción completa. (Contribuido por Brandt Bucher en :issue:`36144`.)

source: New String Methods to Remove Prefixes and Suffixes
es: Nuevos métodos de cadena para eliminar prefijos y sufijos

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
es: Se han agregado :meth:`str.removeprefix(prefix)<str.removeprefix>` y :meth:`str.removesuffix(suffix)<str.removesuffix>` para eliminar fácilmente un prefijo o sufijo innecesario de una cadena. También se han agregado los métodos correspondientes ``bytes``, ``bytearray`` y ``collections.UserString``. Consulte :pep:`616` para obtener una descripción completa. (Contribuido por Dennis Sweeney en :issue:`39939`.)

source: Type Hinting Generics in Standard Collections
es: Tipos genéricos de sugerencia en colecciones estándar

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
es: En las anotaciones de tipo, ahora puede usar tipos de colección integrados como ``list`` y ``dict`` como tipos genéricos en lugar de importar los tipos en mayúsculas correspondientes (por ejemplo, ``List`` o ``Dict``) desde ``typing``. Algunos otros tipos de la biblioteca estándar ahora también son genéricos, por ejemplo, ``queue.Queue``.

source: Example:
es: Ejemplo:

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
es: Consulte :pep:`585` para obtener más detalles. (Contribuido por Guido van Rossum, Ethan Smith y Batuhan Taşkaya en :issue:`39481`.)

source: New Parser
es: Nuevo analizador

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
es: Python 3.9 usa un nuevo analizador, basado en `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ en lugar de `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. El rendimiento del analizador nuevo es aproximadamente comparable al del analizador anterior, pero el formalismo PEG es más flexible que LL (1) cuando se trata de diseñar nuevas funciones de lenguaje. Comenzaremos a usar esta flexibilidad en Python 3.10 y versiones posteriores.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
es: El módulo :mod:`ast` usa el nuevo analizador y produce el mismo AST que el analizador anterior.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
es: En Python 3.10, el analizador anterior se eliminará y también lo hará toda la funcionalidad que depende de él (principalmente el módulo :mod:`parser`, que ha estado en desuso durante mucho tiempo). En Python 3.9 *only*, puede volver al analizador LL (1) utilizando un modificador de línea de comando (``-X oldparser``) o una variable de entorno (``PYTHONOLDPARSER=1``).

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
es: Consulte :pep:`617` para obtener más detalles. (Contribuido por Guido van Rossum, Pablo Galindo y Lysandros Nikolaou en :issue:`40334`.)

source: Other Language Changes
es: Otros cambios de idioma

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
es: :func:`__import__` ahora lanza :exc:`ImportError` en lugar de :exc:`ValueError`, que solía ocurrir cuando una importación relativa pasaba de su paquete de nivel superior. (Contribuido por Ngalim Siregar en :issue:`37444`.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
es: Python ahora obtiene la ruta absoluta del nombre de archivo del script especificado en la línea de comando (por ejemplo: ``python3 script.py``): el módulo ``__file__`` attribute of the :mod:`__main__` se convirtió en una ruta absoluta, en lugar de una ruta relativa. Estas rutas ahora siguen siendo válidas después de que las tramas del módulo :func:`os.chdir`. Como efecto alterno, la traza también muestra la ruta absoluta para los marcos del módulo :mod:`__main__` en este caso. (Contribuido por Victor Stinner en :issue:`20443`.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
es: En :ref:`Python Development Mode <devmode>` y en :ref:`debug build <debug-build>`, los argumentos de *encoding* and *errors* ahora se comprueban para las operaciones de codificación y decodificación de cadenas. Ejemplos: :func:`open`, :meth:`str.encode` y :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
es: De forma predeterminada, para un mejor rendimiento, el argumento *errors* argument is only checked at the first encoding/decoding error and the *encoding* a veces se ignora para cadenas vacías. (Contribuido por Victor Stinner en :issue:`37388`.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
es: ``"".replace("", s, n)`` ahora devuelve ``s`` en lugar de una cadena vacía para todos los ``n`` distintos de cero. Ahora es compatible con ``"".replace("", s)``. Hay cambios similares para los objetos :class:`bytes` y :class:`bytearray`. (Contribuido por Serhiy Storchaka en :issue:`28029`.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
es: Cualquier expresión válida ahora se puede utilizar como :term:`decorator`. Anteriormente, la gramática era mucho más restrictiva. Consulte :pep:`614` para obtener más detalles. (Contribuido por Brandt Bucher en :issue:`39702`.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
es: Ayuda mejorada para el módulo :mod:`typing`. Las cadenas de documentos ahora se muestran para todas las formas especiales y alias genéricos especiales (como ``Union`` y ``List``). El uso de :func:`help` con un alias genérico como ``List[int]`` mostrará la ayuda para el tipo concreto correspondiente (``list`` en este caso). (Contribuido por Serhiy Storchaka en :issue:`40257`.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
es: La ejecución en paralelo de :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` ahora está prohibida, y ``ag_running`` ahora refleja el estado de ejecución real del generador asíncrono. (Contribuido por Yury Selivanov en :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
es: Los errores inesperados al llamar al método ``__iter__`` ya no están enmascarados por ``TypeError`` en el operador :keyword:`in` y funciones :func:`~operator.contains`, :func:`~operator.indexOf` y :func:`~operator.countOf` del módulo :mod:`operator`. (Contribuido por Serhiy Storchaka en :issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
es: Las expresiones lambda sin paréntesis ya no pueden ser la parte de expresión en una cláusula ``if`` en comprensiones y expresiones generadoras. Consulte :issue:`41848` y :issue:`43755` para obtener más detalles.

source: New Modules
es: Nuevos módulos

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
es: El módulo :mod:`zoneinfo` brinda soporte para la base de datos de zona horaria de IANA a la biblioteca estándar. Agrega :class:`zoneinfo.ZoneInfo`, una implementación de :class:`datetime.tzinfo` concreta respaldada por los datos de la zona horaria del sistema.

source: As a fall-back source of data for platforms that don't ship the IANA database, the |tzdata|_ module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
es: Como fuente de datos alternativa para las plataformas que no envían la base de datos de la IANA, el módulo |tzdata|_ se lanzó como un paquete propio, distribuido a través de PyPI y mantenido por el equipo central de CPython.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
es: :pep:`615`: compatibilidad con la base de datos de zona horaria de IANA en la biblioteca estándar

source: PEP written and implemented by Paul Ganssle
es: PEP escrito e implementado por Paul Ganssle

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
es: Se agregó un nuevo módulo, :mod:`graphlib`, que contiene la clase :class:`graphlib.TopologicalSorter` para ofrecer funcionalidad para realizar la clasificación topológica de gráficos. (Contribuido por Pablo Galindo, Tim Peters y Larry Hastings en :issue:`17005`.)

source: Improved Modules
es: Módulos mejorados

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
es: Se agregó la opción *indent* a :func:`~ast.dump` que le permite producir una salida con sangría de varias líneas. (Contribuido por Serhiy Storchaka en :issue:`37995`.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
es: Se agregó :func:`ast.unparse` como una función en el módulo :mod:`ast` que se puede usar para descomprimir un objeto :class:`ast.AST` y producir una cadena con código que produciría un objeto :class:`ast.AST` equivalente cuando se analiza. (Contribuido por Pablo Galindo y Batuhan Taskaya en :issue:`38870`.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
es: Se agregaron cadenas de documentación a los nodos AST que contienen la firma ASDL utilizada para construir ese nodo. (Contribuido por Batuhan Taskaya en :issue:`39638`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
es: Debido a importantes problemas de seguridad, el parámetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` ya no es compatible. Esto se debe al comportamiento de la opción de socket ``SO_REUSEADDR`` en UDP. Para obtener más detalles, consulte la documentación de ``loop.create_datagram_endpoint()``. (Contribuido por Kyle Stanley, Antoine Pitrou y Yury Selivanov en :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
es: Se agregó un nuevo :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` que programa un apagado para el ejecutor predeterminado que espera en el :class:`~concurrent.futures.ThreadPoolExecutor` para finalizar el cierre. Además, :func:`asyncio.run` se ha actualizado para utilizar el nuevo :term:`coroutine`. (Contribuido por Kyle Stanley en :issue:`34037`.)

source: Added :class:`asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
es: Se agregó :class:`asyncio.PidfdChildWatcher`, una implementación de observador de niños específica de Linux que sondea los descriptores de archivos de proceso. (:issue:`38692`)
