Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-36917 <https://bugs.python.org/issue36917>`__: Add default implementation of the :meth:`ast.NodeVisitor.visit_Constant` method which emits a deprecation warning and calls corresponding methody ``visit_Num()``, ``visit_Str()``, etc.
es: `bpo-36917 <https://bugs.python.org/issue36917>`__: Agregue la implementación predeterminada del método:meth:`ast.nodevisitor.visit_constant 'que emite una advertencia de deprecación y llama a la correspondiente Metodo`` Visit_num()``, ``visite_str()``, etc.

source: `bpo-37798 <https://bugs.python.org/issue37798>`__: Update test_statistics.py to verify that the statistics module works well for both C and Python implementations. Patch by Dong-hee Na
es: `bpo-37798 <https://bugs.python.org/issue37798>`__: Actualice test_statistics.py Para verificar que el módulo de estadísticas funciona bien para las implementaciones de C y Python. Parche por dong-hee na

source: `bpo-26589 <https://bugs.python.org/issue26589>`__: Added a new status code to the http module: 451 UNAVAILABLE_FOR_LEGAL_REASONS
es: `bpo-26589 <https://bugs.python.org/issue26589>`__: agregó un nuevo código de estado al módulo HTTP: 451 noavailable_for_legal_reasons

source: `bpo-37915 <https://bugs.python.org/issue37915>`__: Fix a segmentation fault that appeared when comparing instances of ``datetime.timezone`` and ``datetime.tzinfo`` objects. Patch by Pablo Galindo.
es: `bpo-37915 <https://bugs.python.org/issue37915>`__: Funciona una falla de segmentación que apareció al comparar las instancias de los objetos ``dateTime.timezone` y `datetime.tzinfo`. Parche de Pablo Galindo.

source: `bpo-37868 <https://bugs.python.org/issue37868>`__: Fix dataclasses.is_dataclass when given an instance that never raises AttributeError in __getattr__. That is, an object that returns something for __dataclass_fields__ even if it's not a dataclass.
es: `bpo-37868 <https://bugs.python.org/issue37868>`__: Fix Dataclasses.is_dataclass Cuando se le da una instancia que nunca lanza a atributeError en __getattr__.Es decir, un objeto que retorna algo para __dataclass_fields__ incluso si no es una dataclass.

source: `bpo-37811 <https://bugs.python.org/issue37811>`__: Fix ``socket`` module's ``socket.connect(address)`` function being unable to establish connection in case of interrupted system call. The problem was observed on all OSes which ``poll(2)`` system call can take only non-negative integers and -1 as a timeout value.
es: `bpo-37811 <https://bugs.python.org/issue37811>`__: Arregla la función ``socket.connect(address)`` del módulo ``socket`` que no puede establecer la conexión en caso de llamada de sistema interrumpido.El problema se observó en todos los OSEs que ``poll(2)`` La llamada del sistema puede tomar solo enteros no negativos y -1 como un valor de tiempo de espera.

source: `bpo-21131 <https://bugs.python.org/issue21131>`__: Fix ``faulthandler.register(chain=True)`` stack. faulthandler now allocates a dedicated stack of ``SIGSTKSZ*2`` bytes, instead of just ``SIGSTKSZ`` bytes. Calling the previous signal handler in faulthandler signal handler uses more than ``SIGSTKSZ`` bytes of stack memory on some platforms.
es: `bpo-21131 <https://bugs.python.org/issue21131>`__: Arregla ``faultthandler.register(chain=True)`` pila.FaulThandler ahora asigna una pila dedicada de bytes ``SIGSTKSZ*2``, en lugar de solo ``SIGSTKSZ`` bytes. Llamando al manejador de señales anterior en faulthandler signal Handler utiliza más de ``SIGSTSZ`` bytes de memoria de pila en algunas plataformas.

source: `bpo-37798 <https://bugs.python.org/issue37798>`__: Add C fastpath for statistics.NormalDist.inv_cdf() Patch by Dong-hee Na
es: `bpo-37798 <https://bugs.python.org/issue37798>`__: Agregado c Fastpath para statistics.NormalDist.inv_cdf() Parche por Dong-hee Na

source: `bpo-37819 <https://bugs.python.org/issue37819>`__: Add Fraction.as_integer_ratio() to match the corresponding methods in bool, int, float, and decimal.
es: `bpo-37819 <https://bugs.python.org/issue37819>`__: Agregado Fraction.as_integer_ratio() para que coincida con los métodos correspondientes en bool, int, flotan y decimal.

source: `bpo-37810 <https://bugs.python.org/issue37810>`__: Fix :mod:`difflib` ``?`` hint in diff output when dealing with tabs. Patch by Anthony Sottile.
es: `bpo-37810 <https://bugs.python.org/issue37810>`__: Arregla la sugenrencia ``?`` de :mod:`difflib` en la salida de diff cuando se trata de tabulaciones. Parche por Anthony Sottile.

source: `bpo-37772 <https://bugs.python.org/issue37772>`__: In ``zipfile.Path``, when adding implicit dirs, ensure that ancestral directories are added and that duplicates are excluded.
es: `bpo-37772 <https://bugs.python.org/issue37772>`__: En ``zipfile.Path``, al agregar dirs implícitos, asegúrese de que se agreguen los directorios ancestrales y que se excluyan los duplicados.

source: `bpo-28292 <https://bugs.python.org/issue28292>`__: Mark calendar.py helper functions as being private. The follows PEP 8 guidance to maintain the style conventions in the module and it addresses a known case of user confusion.
es: `bpo-28292 <https://bugs.python.org/issue28292>`__: Marca calendar.py Helper funciona como privado.La siguiente orientación PEP 8 para mantener las convenciones de estilo en el módulo y aborda un caso conocido de confusión del usuario.

source: `bpo-18049 <https://bugs.python.org/issue18049>`__: Add definition of THREAD_STACK_SIZE for AIX in Python/thread_pthread.h The default thread stacksize caused crashes with the default recursion limit Patch by M Felt
es: `bpo-18049 <https://bugs.python.org/issue18049>`__: Agrega definición de hilo_stack_size para AIX en Python / Thread_PThread.h El stacksIZE de hilo predeterminado causó fallas con el parche de límite de recursión predeterminado por M FIERT

source: `bpo-37738 <https://bugs.python.org/issue37738>`__: Fix the implementation of curses ``addch(str, color_pair)``: pass the color pair to ``setcchar()``, instead of always passing 0 as the color pair.
es: `bpo-37738 <https://bugs.python.org/issue37738>`__: Arregla la implementación de las maldiciones ``addch(str, color_pair)``: Pase el par de color a ``setcchar()``, en vezde pasar siempre 0 como el par de color.

source: `bpo-37723 <https://bugs.python.org/issue37723>`__: Fix performance regression on regular expression parsing with huge character sets. Patch by Yann Vaginay.
es: `bpo-37723 <https://bugs.python.org/issue37723>`__: Arregla la regresión de rendimiento en la expresión regular que analiza con enormes conjuntos de caracteres. Parche por yann vaginay.

source: `bpo-32178 <https://bugs.python.org/issue32178>`__: Fix IndexError in :mod:`email` package when trying to parse invalid address fields starting with ``:``.
es: `bpo-32178 <https://bugs.python.org/issue32178>`__: Fix indexError In:mod:`Correo electrónico 'Paquete Al intentar analizar los campos de direcciones no válidos que comienzan con" `:``.

source: `bpo-37685 <https://bugs.python.org/issue37685>`__: Fixed comparisons of :class:`datetime.timedelta` and :class:`datetime.timezone`.
es: `bpo-37685 <https://bugs.python.org/issue37685>`__: Comparaciones fijas de:class:`DateTime.Timedelta` y: Class:`DateTime.timezone`.

source: `bpo-37695 <https://bugs.python.org/issue37695>`__: Correct :func:`curses.unget_wch` error message. Patch by Anthony Sottile.
es: `bpo-37695 <https://bugs.python.org/issue37695>`__: Correcto:func:`Curses.unget_wch` Mensaje de error. Parche por Anthony Sottile.

source: `bpo-37354 <https://bugs.python.org/issue37354>`__: Make Activate.ps1 Powershell script static to allow for signing it.
es: `bpo-37354 <https://bugs.python.org/issue37354>`__: Haz que active.ps1 Powershell Script estática para permitir la firma.

source: `bpo-37664 <https://bugs.python.org/issue37664>`__: Update wheels bundled with ensurepip (pip 19.2.3 and setuptools 41.2.0)
es: `bpo-37664 <https://bugs.python.org/issue37664>`__: Ruedas de actualización con garantines (PIP 19.2.3 y setuptOols 41.2.0)

source: `bpo-37642 <https://bugs.python.org/issue37642>`__: Allowed the pure Python implementation of :class:`datetime.timezone` to represent sub-minute offsets close to minimum and maximum boundaries, specifically in the ranges (23:59, 24:00) and (-23:59, 24:00). Patch by Ngalim Siregar
es: `bpo-37642 <https://bugs.python.org/issue37642>`__: permitió la implementación python pura de :class:`DateTime.Timezone` para representar las compensaciones de subminutos cerca de los límites mínimo y máximo, específicamente en elRangos (23:59, 24:00) y (-23: 59, 24:00). Parche por ngalim siregar

source: `bpo-16970 <https://bugs.python.org/issue16970>`__: Adding a value error when an invalid value in passed to nargs Patch by Robert Leenders
es: `bpo-16970 <https://bugs.python.org/issue16970>`__: Agregar un error de valor cuando se pasa un valor no válido en Patch de Nargs por Robert Leenders

source: `bpo-37587 <https://bugs.python.org/issue37587>`__: Make json.loads faster for long strings. (Patch by Marco Paolini)
es: `bpo-37587 <https://bugs.python.org/issue37587>`__: Haga JSON.LaLas más rápido para largas cadenas.(Parche By Marco Paolini)

source: `bpo-18378 <https://bugs.python.org/issue18378>`__: Recognize "UTF-8" as a valid value for LC_CTYPE in locale._parse_localename.
es: `bpo-18378 <https://bugs.python.org/issue18378>`__: Reconozca "UTF-8" como un valor válido para LC_CTYPE en LOCALE._PARSE_LOCALENAME.

source: `bpo-37531 <https://bugs.python.org/issue37531>`__: "python3 -m test -jN --timeout=TIMEOUT" now kills a worker process if it runs longer than *TIMEOUT* seconds.
es: `bpo-37531 <https://bugs.python.org/issue37531>`__: "Python3 -m Test -JN --TimeOut = TimeOut" Ahora mata a un proceso de trabajador si se ejecuta más tiempo que * Tiempo de tiempo * segundos.

source: `bpo-37482 <https://bugs.python.org/issue37482>`__: Fix serialization of display name in originator or destination address fields with both encoded words and special chars.
es: `bpo-37482 <https://bugs.python.org/issue37482>`__: Arregla la serialización del nombre de la pantalla en los campos de direcciones de originador o de destino con palabras codificadas y caracteres especiales.

source: `bpo-37372 <https://bugs.python.org/issue37372>`__: Fix error unpickling datetime.time objects from Python 2 with seconds>=24. Patch by Justin Blanchard.
es: `bpo-37372 <https://bugs.python.org/issue37372>`__: Fix Error PapeTime DateTime.time objetos de Python 2 con segundos> = 24. Parche por Justin Blanchard.

source: `bpo-37085 <https://bugs.python.org/issue37085>`__: Add the optional Linux SocketCAN Broadcast Manager constants, used as flags to configure the BCM behaviour, in the socket module. Patch by Karl Ding.
es: `bpo-37085 <https://bugs.python.org/issue37085>`__: Agregue las constantes opcionales de administrador de transmisión de Linux Socketcan, usadas como flags para configurar el comportamiento de BCM, en el módulo de zócalo.Parche por karl ding.

source: `bpo-36871 <https://bugs.python.org/issue36871>`__: Ensure method signature is used instead of constructor signature of a class while asserting mock object against method calls. Patch by Karthikeyan Singaravelan.
es: `bpo-36871 <https://bugs.python.org/issue36871>`__: Asegúrese de que se usa la firma del método en lugar de la firma del constructor de una clase mientras se afirma un objeto simulado contra las llamadas del método. Parche por karthikeyan singaravelan.

source: `bpo-36582 <https://bugs.python.org/issue36582>`__: Fix ``UserString.encode()`` to correctly return ``bytes`` rather than a ``UserString`` instance.
es: `bpo-36582 <https://bugs.python.org/issue36582>`__: Arregla ``UserString.encode()`` para retornar correctamente ``bytes`` en lugar de una instancia de ``UserString``.

source: `bpo-34775 <https://bugs.python.org/issue34775>`__: Division handling of PurePath now returns NotImplemented instead of raising a TypeError when passed something other than an instance of str or PurePath. Patch by Roger Aiudi.
es: `bpo-34775 <https://bugs.python.org/issue34775>`__: El manejo de la división de Purpath ahora regresa notimplemente en lugar de elevar un TypeError cuando se pasa algo que no sea una instancia de STR o Purpate. Parche de Roger Aiudi.

source: `bpo-37979 <https://bugs.python.org/issue37979>`__: Added a link to dateutil.parser.isoparse in the datetime.fromisoformat documentation. Patch by Paul Ganssle
es: `bpo-37979 <https://bugs.python.org/issue37979>`__: agregó un enlace a datetil.parser.isoparse en la documentación de DateTime.fromisoformat. Parche por paul ganssle

source: `bpo-37759 <https://bugs.python.org/issue37759>`__: Beginning edits to Whatsnew 3.8
es: `bpo-37759 <https://bugs.python.org/issue37759>`__: Ediciones comenzando a lo que sí 3.8

source: `bpo-37726 <https://bugs.python.org/issue37726>`__: Stop recommending getopt in the tutorial for command line argument parsing and promote argparse.
es: `bpo-37726 <https://bugs.python.org/issue37726>`__: Deja de recomendar Recomendar GetOPT en el tutorial para el argumento de la línea de comando que analiza y promueve a ArgParse.

source: `bpo-37256 <https://bugs.python.org/issue37256>`__: Fix wording of arguments for :class:`Request` in :mod:`urllib.request`
es: `bpo-37256 <https://bugs.python.org/issue37256>`__: Arregla la redacción de los argumentos para :class:`Request` en :mod:`urllib.request`

source: `bpo-37004 <https://bugs.python.org/issue37004>`__: In the documentation for difflib, a note was added explicitly warning that the results of SequenceMatcher's ratio method may depend on the order of the input strings.
es: `bpo-37004 <https://bugs.python.org/issue37004>`__: En la documentación de Difflib, se agregó una nota que advierte explícitamente que los resultados del método de la relación de secuestro pueden depender del orden de las cadenas de entrada.

source: `bpo-36487 <https://bugs.python.org/issue36487>`__: Make C-API docs clear about what the "main" interpreter is.
es: `bpo-36487 <https://bugs.python.org/issue36487>`__: Haga que los documentos C-API sean claros sobre lo que es el intérprete "principal".

source: `bpo-37805 <https://bugs.python.org/issue37805>`__: Add tests for json.dump(..., skipkeys=True). Patch by Dong-hee Na.
es: `bpo-37805 <https://bugs.python.org/issue37805>`__: Agregar pruebas para JSON.Dump (..., Skipkeys = True). Parche por dong-hee na.

source: `bpo-37707 <https://bugs.python.org/issue37707>`__: Mark some individual tests to skip when --pgo is used. The tests marked increase the PGO task time significantly and likely don't help improve optimization of the final executable.
es: `bpo-37707 <https://bugs.python.org/issue37707>`__: Marque algunas pruebas individuales para saltar cuando se usa --pgo.Las pruebas marcadas aumentan el tiempo de la tarea PGO significativamente y es probable que no ayude a mejorar la optimización del ejecutable final.

source: `bpo-37549 <https://bugs.python.org/issue37549>`__: :func:`os.dup` no longer fails for standard streams on Windows 7.
es: `bpo-37549 <https://bugs.python.org/issue37549>`__: :func:`os.dup` ya no falla para secuencias estándar en Windows 7.

source: `bpo-1311 <https://bugs.python.org/issue1311>`__: The ``nul`` file on Windows now returns True from :func:`~os.path.exists` and a valid result from :func:`os.stat` with ``S_IFCHR`` set.
es: `bpo-1311 <https://bugs.python.org/issue111>`__: El archivo ``nul`` en Windows ahora retorna True de :func:`~os.path.exists` y un resultado válido de :func:`os.stat` con ``S_IFCHR`` establecido.

source: `bpo-9949 <https://bugs.python.org/issue9949>`__: Enable support for following symlinks in :func:`os.realpath`.
es: `bpo-9949 <https://bugs.python.org/issue9949>`__: Habilitar soporte para seguir SymLinks en:func:`OS.REALPATH`.

source: `bpo-37834 <https://bugs.python.org/issue37834>`__: Treat all name surrogate reparse points on Windows in :func:`os.lstat` and other reparse points as regular files in :func:`os.stat`.
es: `bpo-37834 <https://bugs.python.org/issue37834>`__: Trate todo nombre Puntos de repartes sustitutos en Windows en:func:`OS.LSTAT` y otros puntos reparados como archivos regulares en:func:`OS.STAT`.

source: `bpo-36266 <https://bugs.python.org/issue36266>`__: Add the module name in the formatted error message when DLL load fail happens during module import in ``_PyImport_FindSharedFuncptrWindows()``. Patch by Srinivas Nyayapati.
es: `bpo-36266 <https://bugs.python.org/issue36266>`__: Agregue el nombre del módulo en el mensaje de error formateado cuando la carga de la DLL falla durante la importación del módulo en ``_pyimport_findsharedfuncptrwindows() ``. Parche por srinivas nyayapati.

source: `bpo-25172 <https://bugs.python.org/issue25172>`__: Trying to import the :mod:`crypt` module on Windows will result in an :exc:`ImportError` with a message explaining that the module isn't supported on Windows. On other platforms, if the underlying ``_crypt`` module is not available, the ImportError will include a message explaining the problem.
es: `bpo-25172 <https://bugs.python.org/issue25172>`__: Tratando de importar el módulo :mod:`crypt` en Windows resultará en :exc:`ImportError` con un mensaje que explica que el módulo no es compatible con Windows. En otras plataformas, si el módulo ``_crypt`` subyacente no está disponible, el ImportError incluirá un mensaje que explique el problema.

source: `bpo-37778 <https://bugs.python.org/issue37778>`__: Fixes the icons used for file associations to the Microsoft Store package.
es: `bpo-37778 <https://bugs.python.org/issue37778>`__: Corrige los iconos utilizados para las asociaciones de archivos en el paquete de Microsoft Store.

source: `bpo-37734 <https://bugs.python.org/issue37734>`__: Fix use of registry values to launch Python from Microsoft Store app.
es: `bpo-37734 <https://bugs.python.org/issue37734>`__: Arregla el uso de los valores del registro para iniciar la aplicación Python desde Microsoft Store.

source: `bpo-28269 <https://bugs.python.org/issue28269>`__: Replace use of :c:func:`strcasecmp` for the system function :c:func:`_stricmp`. Patch by Minmin Gong.
es: `bpo-28269 <https://bugs.python.org/issue28269>`__: Reemplace el uso de:c:func:`STRCASECMP` para la función del sistema:c:func:`_stricmp`. Parche por minmin Gong.

source: `bpo-18049 <https://bugs.python.org/issue18049>`__: Increase the default stack size of threads from 5MB to 16MB on macOS, to match the stack size of the main thread. This avoids crashes on deep recursion in threads.
es: `bpo-18049 <https://bugs.python.org/issue18049>`__: Aumente el tamaño de pila predeterminado de las roscas de 5 MB a 16 MB en MacOS, para que coincida con el tamaño de la pila del hilo principal.Esto evita choques en la recursión profunda en hilos.

source: `bpo-37824 <https://bugs.python.org/issue37824>`__: Properly handle user input warnings in IDLE shell. Cease turning SyntaxWarnings into SyntaxErrors.
es: `bpo-37824 <https://bugs.python.org/issue37824>`__: maneja adecuadamente las advertencias de entrada del usuario en Shell inactivo.Deja de dar vuelta a SyntaxWarnings en Syntaxerrors.

source: `bpo-37929 <https://bugs.python.org/issue37929>`__: IDLE Settings dialog now closes properly when there is no shell window.
es: `bpo-37929 <https://bugs.python.org/issue37929>`__: La configuración de configuración de inactividad ahora se cierra correctamente cuando no hay ventana de concha.

source: `bpo-37849 <https://bugs.python.org/issue37849>`__: Fixed completions list appearing too high or low when shown above the current line.
es: `bpo-37849 <https://bugs.python.org/issue37849>`__: Lista de finalización fija que aparece demasiado alto o bajo cuando se muestra arriba de la línea actual.

source: `bpo-36419 <https://bugs.python.org/issue36419>`__: Refactor IDLE autocomplete and improve testing.
es: `bpo-36419 <https://bugs.python.org/issue36419>`__: Refactor inactivo autocompletar y mejorar las pruebas.

source: `bpo-37748 <https://bugs.python.org/issue37748>`__: Reorder the Run menu. Put the most common choice, Run Module, at the top.
es: `bpo-37748 <https://bugs.python.org/issue37748>`__: reordenar el menú Ejecutar.Ponga la opción más común, ejecute el módulo, en la parte superior.

source: `bpo-37942 <https://bugs.python.org/issue37942>`__: Improve ArgumentClinic converter for floats.
es: `bpo-37942 <https://bugs.python.org/issue37942>`__: Mejorar el convertidor argumentlínico para los flotadores.

source: `bpo-37034 <https://bugs.python.org/issue37034>`__: Argument Clinic now uses the argument name on errors with keyword-only argument instead of their position. Patch contributed by Rémi Lapeyre.
es: `bpo-37034 <https://bugs.python.org/issue37034>`__: Argument Clinic ahora usa el nombre de argumento en errores con el argumento solo de la palabra clave en lugar de su posición.Patch aportado por Rémi Lapeyre.

source: `bpo-36763 <https://bugs.python.org/issue36763>`__: Options added by ``PySys_AddXOption()`` are now handled the same way than ``PyConfig.xoptions`` and command line ``-X`` options.
es: `bpo-36763 <https://bugs.python.org/issue36763>`__: Opciones agregadas por ``PySys_AddXOption()`` ahora se manejan de la misma manera que ``PyConfig.xoptions`` y las opciones de línea de comandos ``-X``.

source: `bpo-37926 <https://bugs.python.org/issue37926>`__: Fix a crash in ``PySys_SetArgvEx(0, NULL, 0)``.
es: `bpo-37926 <https://bugs.python.org/issue37926>`__: Arregla un choque en ``PySys_SetArgvEx(0, NULL, 0)``.

source: *Release date: 2019-07-29*
es: * Fecha de lanzamiento: 2019-07-29 *

source: `bpo-37461 <https://bugs.python.org/issue37461>`__: Fix an infinite loop when parsing specially crafted email headers. Patch by Abhilash Raj.
es: `bpo-37461 <https://bugs.python.org/issue37461>`__: Arregla un bucle infinito al analizar los encabezados de correo electrónico especialmente diseñados. Parche por abhilash raj.

source: `bpo-37593 <https://bugs.python.org/issue37593>`__: Swap the positions of the *posonlyargs* and *args* parameters in the constructor of :class:`ast.parameters` nodes.
es: `bpo-37593 <https://bugs.python.org/issue37593>`__: Cambie las posiciones de los parámetros de * posonlyargs * y * args * en el constructor de :class:`ast.parameters` nodos.

source: `bpo-36974 <https://bugs.python.org/issue36974>`__: Implemented separate vectorcall functions for every calling convention of builtin functions and methods. This improves performance for calls.
es: `bpo-36974 <https://bugs.python.org/issue36974>`__: Implementó funciones de vector separado para cada convenio de las funciones y métodos integrados.Esto mejora el rendimiento para las llamadas.

source: `bpo-37697 <https://bugs.python.org/issue37697>`__: Syncronize ``importlib.metadata`` with `importlib_metadata 0.19 <https://gitlab.com/python-devs/importlib_metadata/-/milestones/20>`_, improving handling of EGG-INFO files and fixing a crash when entry point names contained colons.
es: `bpo-37697 <https://bugs.python.org/issue37697>`__: Sincroniza ``importlib.metadata`` con `importlib_metadata 0.19 <https://gitlab.com/python-devs/importlib_metadata/-/milestones/ 20>`_, mejorando el manejo de archivos de información de huevo y fijando un choque cuando los nombres de los puntos de entrada contenían los dos puntos.

source: `bpo-37691 <https://bugs.python.org/issue37691>`__: Let math.dist() accept coordinates as sequences (or iterables) rather than just tuples.
es: `bpo-37691 <https://bugs.python.org/issue37691>`__: Permita que Math.dist() acepte coordenadas como secuencias (o Iterables) en lugar de solo tuplas.

source: `bpo-37664 <https://bugs.python.org/issue37664>`__: Update wheels bundled with ensurepip (pip 19.2.1 and setuptools 41.0.1)
es: `bpo-37664 <https://bugs.python.org/issue37664>`__: Ruedas de actualización con garantía de garantía (PIP 19.2.1 y setuptOols 41.0.1)
