Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-35763 <https://bugs.python.org/issue35763>`__: Make calltip reminder about '/' meaning positional-only less obtrusive by only adding it when there is room on the first line.
es: `bpo-35763 <https://bugs.python.org/issued35763>`__: Haz que el recordatorio de CallTip sobre "/" significado posicional, solo menos molesto, lo que agrega solo cuando hay espacio en la primera línea.

source: `bpo-5680 <https://bugs.python.org/issue5680>`__: Add 'Run... Customized' to the Run menu to run a module with customized settings. Any 'command line arguments' entered are added to sys.argv. One can suppress the normal Shell main module restart.
es: `bpo-5680 <https://bugs.python.org/issue5680>`__: agregue 'Ejecutar ... personalizado' al menú Ejecutar para ejecutar un módulo con ajustes personalizados.Cualquier 'argumentos de línea de comando' ingresados se agregan a SYS.ARGV.Uno puede suprimir el reinicio del módulo principal de la cubierta normal.

source: `bpo-36763 <https://bugs.python.org/issue36763>`__: Add :func:`PyConfig_SetWideStringList` function.
es: `bpo-36763 <https://bugs.python.org/issue36763>`__: Agregar:func:`PYCONFIG_SETWIDESTRINGLIST 'FUNCIÓN.

source: `bpo-28805 <https://bugs.python.org/issue28805>`__: The :const:`METH_FASTCALL` calling convention has been documented.
es: `bpo-28805 <https://bugs.python.org/issue28805>`__: el: Const: 'MethShefastCall' Convención de llamadas ha sido documentada.

source: `bpo-37221 <https://bugs.python.org/issue37221>`__: ``tp_print`` is put back at the end of the ``PyTypeObject`` structure to restore support for old code (in particular generated by Cython) setting ``tp_print = 0``. Note that ``tp_print`` will be removed entirely in Python 3.9.
es: `bpo-37221 <https://bugs.python.org/issue37221>`__: ``tp_print`` se coloca en el extremo de la estructura ``PyTypeObject`` para restaurar el soporte para el código anterior (en particular generado por Cython) Configuración ``tp_print = 0``.Tenga en cuenta que ``tp_print`` se eliminará por completo en Python 3.9.

source: `bpo-37221 <https://bugs.python.org/issue37221>`__: The new function :c:func:`PyCode_NewWithPosOnlyArgs` allows to create code objects like :c:func:`PyCode_New`, but with an extra *posonlyargcount* parameter for indicating the number of positonal-only arguments.
es: `bpo-37221 <https://bugs.python.org/issue37221>`__: la nueva función:c:func:`Pycode_newwithPoSonlyargs` Permite crear objetos de código como:c:func:`Pycode_new`, pero con un extra* PosonlyArgcount * Parámetro para indicar el número de argumentos positonales.

source: `bpo-37215 <https://bugs.python.org/issue37215>`__: Fix dtrace issue introduce by `bpo-36842 <https://bugs.python.org/issue36842>`__
es: `bpo-37215 <https://bugs.python.org/issue37215>`__: Fix Dtrace Problema introducir por `bpo-36842 <https://bugs.python.org/issue36842>`__

source: `bpo-37191 <https://bugs.python.org/issue37191>`__: Python.h does not need compiler support for intermingled declarations (GCC's ``-Wdeclaration-after-statement``), which were added in 3.8.0 Beta 1. Note that in Python 3.9, intermingled declarations will be needed again.
es: `bpo-37191 <https://bugs.python.org/issue37191>`__: Python.h no necesita soporte de compilador para las declaraciones entremezcladas (``-Wdeclaration-after-statement`` de GCC), que se agregaron en 3.8.0 Beta 1. Tenga en cuenta que en Python 3.9, se necesitarán nuevamente las declaraciones entremezcladas.

source: `bpo-37170 <https://bugs.python.org/issue37170>`__: Fix the cast on error in :c:func:`PyLong_AsUnsignedLongLongMask()`.
es: `bpo-37170 <https://bugs.python.org/issue37170>`__: Arregla el molde en el error en:c:func:`pylong_asunsignedlonglongmask()`.

source: *Release date: 2019-06-04*
es: * Fecha de lanzamiento: 2019-06-04 *

source: `bpo-35907 <https://bugs.python.org/issue35907>`__: CVE-2019-9948: Avoid file reading by disallowing ``local-file://`` and ``local_file://`` URL schemes in ``URLopener().open()`` and ``URLopener().retrieve()`` of :mod:`urllib.request`.
es: `bpo-35907 <https://bugs.python.org/issue35907>`__: cve-2019-9948: Evite la lectura de archivos al desinumitir ``local-file://`` y ``local_file://`` esquemas de URL en ``URLopener().open()`` y ``URLopener().retrieve()`` de :mod:`urllib.request`.

source: `bpo-33529 <https://bugs.python.org/issue33529>`__: Prevent fold function used in email header encoding from entering infinite loop when there are too many non-ASCII characters in a header.
es: `bpo-33529 <https://bugs.python.org/issue33529>`__: Evite la función de plegado utilizada en el encabezado de correo electrónico que codifica desde la introducción de un bucle infinito cuando hay demasiados caracteres no ASCII en un encabezado.

source: `bpo-33164 <https://bugs.python.org/issue33164>`__: Updated blake2 implementation which uses secure memset implementation provided by platform.
es: `bpo-33164 <https://bugs.python.org/issue33164>`__: Actualizado la implementación de Blake2 que utiliza la implementación de Memset Secure proporcionada por la plataforma.

source: `bpo-35814 <https://bugs.python.org/issue35814>`__: Allow unpacking in the right hand side of annotated assignments. In particular, ``t: Tuple[int, ...] = x, y, *z`` is now allowed.
es: `bpo-35814 <https://bugs.python.org/issue35814>`__: Permita desempacar en el lado derecho de las tareas anotadas.En particular, ``t: Tuple[int, ...] = x, y, *z`` ahora está permitido.

source: `bpo-37126 <https://bugs.python.org/issue37126>`__: All structseq objects are now tracked by the garbage collector. Patch by Pablo Galindo.
es: `bpo-37126 <https://bugs.python.org/issue37126>`__: Todos los objetos de Structseq ahora son rastreados por el recolector de basura. Parche de Pablo Galindo.

source: `bpo-37122 <https://bugs.python.org/issue37122>`__: Make the *co_argcount* attribute of code objects represent the total number of positional arguments (including positional-only arguments). The value of *co_posonlyargcount* can be used to distinguish which arguments are positional only, and the difference (*co_argcount* - *co_posonlyargcount*) is the number of positional-or-keyword arguments. Patch by Pablo Galindo.
es: `bpo-37122 <https://bugs.python.org/issue37122>`__: Hacer el atributo * co_argcount * El atributo de los objetos del código representan el número total de argumentos posicionales (incluidos los argumentos posicionales).El valor de * co_posonlyargcount * se puede usar para distinguir qué argumentos solo son posicionales, y la diferencia (* co_argcount * - * co_posonlyargcount *) es el número de argumentos de posicionamiento o palabra clave. Parche de Pablo Galindo.

source: `bpo-20092 <https://bugs.python.org/issue20092>`__: Constructors of :class:`int`, :class:`float` and :class:`complex` will now use the :meth:`~object.__index__` special method, if available and the corresponding method :meth:`~object.__int__`, :meth:`~object.__float__` or :meth:`~object.__complex__` is not available.
es: `bpo-20092 <https://bugs.python.org/issue20092>`__: constructores de :class:`int` , :class:`float` y :class:`complex` ahora usará el :meth:`~objeto.__index__`, si está disponible y el método correspondiente :meth:`~objeto.__int__`, :meth:`~objeto.__float__` o :meth:`~objeto.__complex__` no está disponible.

source: `bpo-37087 <https://bugs.python.org/issue37087>`__: Add native thread ID (TID) support to OpenBSD.
es: `bpo-37087 <https://bugs.python.org/issue37087>`__: agregue el soporte de ID de hilo nativo (TID) a OpenBSD.

source: `bpo-26219 <https://bugs.python.org/issue26219>`__: Implemented per opcode cache mechanism and ``LOAD_GLOBAL`` instruction use it. ``LOAD_GLOBAL`` is now about 40% faster. Contributed by Yury Selivanov, and Inada Naoki.
es: 'bpo-26219 <https://bugs.python.org/issue26219>'__: Implementado por mecanismo de caché de código de operación e instrucción ''LOAD_GLOBAL'' lo usan. ''LOAD_GLOBAL'' es ahora de unos 40% faster. Contribución de Yury Selivanov, e Inada Naoki.

source: `bpo-37072 <https://bugs.python.org/issue37072>`__: Fix crash in PyAST_FromNodeObject() when flags is NULL.
es: `bpo-37072 <https://bugs.python.org/issue37072>`__: corregir un choque en pyast_fromnodeobject() Cuando las flags son nulos.

source: `bpo-37029 <https://bugs.python.org/issue37029>`__: Freeing a great many small objects could take time quadratic in the number of arenas, due to using linear search to keep ``obmalloc.c``'s list of usable arenas sorted by order of number of free memory pools. This is accomplished without search now, leaving the worst-case time linear in the number of arenas. For programs where this quite visibly matters (typically with more than 100 thousand small objects alive simultaneously), this can greatly reduce the time needed to release their memory.
es: `bpo-37029 <https://bugs.python.org/issue37029>`__: liberar a muchos pequeños objetos pequeños podría tomar el tiempo cuadrático en el número de arenas, debido a la búsqueda lineal para mantener al ``obmalloc.c`` la lista de arenas utilizables ordenada por orden de número de grupos de memoria libre.Esto se logra sin buscar ahora, dejando el peor caso lineal en el número de arenas.Para los programas donde esto es bastante visible (típicamente con más de 100 mil objetos pequeños con vida simultáneamente), esto puede reducir enormemente el tiempo necesario para liberar su memoria.

source: `bpo-26423 <https://bugs.python.org/issue26423>`__: Fix possible overflow in ``wrap_lenfunc()`` when ``sizeof(long) < sizeof(Py_ssize_t)`` (e.g., 64-bit Windows).
es: `bpo-26423 <https://bugs.python.org/issue26423>`__: Arregla el posible desbordamiento posible en ``wrap_lenfunc()`` cuando ``sizeof(long) < sizeof(Py_ssize_t)`` (por ejemplo, 64-ventanas de bits).

source: `bpo-37050 <https://bugs.python.org/issue37050>`__: Improve the AST for "debug" f-strings, which use '=' to print out the source of the expression being evaluated. Delete expr_text from the FormattedValue node, and instead use a Constant string node (possibly merged with adjacent constant expressions inside the f-string).
es: `bpo-37050 <https://bugs.python.org/issue37050>`__: Mejore el AST para "depurar" F-Strings, que usan '=' para imprimir la fuente de la expresión que se está evaluando.Eliminar Expr_Text del nodo FormatTevalue, y en su lugar, use un nodo de cadena constante (posiblemente se fusiona con expresiones constantes adyacentes dentro de la cadena F).

source: `bpo-22385 <https://bugs.python.org/issue22385>`__: The `bytes.hex`, `bytearray.hex`, and `memoryview.hex` methods as well as the `binascii.hexlify` and `b2a_hex` functions now have the ability to include an optional separator between hex bytes. This functionality was inspired by MicroPython's hexlify implementation.
es: `bpo-22385 <https://bugs.python.org/issue22385>`__: the 'bytes.hex`,' bytearray.hex ', y `memoryview.hex' métodos, así como el` binascii.hexlify "yLas funciones `B2A_HEX` ahora tienen la capacidad de incluir un separador opcional entre los bytes hexagonales.Esta funcionalidad se inspiró en la implementación de HEXIFICACIÓN DE MICROPYTHON.

source: `bpo-26836 <https://bugs.python.org/issue26836>`__: Add :func:`os.memfd_create`.
es: `bpo-26836 <https://bugs.python.org/issue26836>`__: Añadir:func:`OS.MEMFD_CREATE`.

source: `bpo-37032 <https://bugs.python.org/issue37032>`__: Added new ``replace()`` method to the code type (:class:`types.CodeType`).
es: `bpo-37032 <https://bugs.python.org/issue37032>`__: Agregado nuevo ``replace()`` método al tipo de código (:class:`types.CodeType`).

source: `bpo-37007 <https://bugs.python.org/issue37007>`__: Implement :func:`socket.if_nameindex()`, :func:`socket.if_nametoindex()`, and :func:`socket.if_indextoname()` on Windows.
es: `bpo-37007 <https://bugs.python.org/issue37007>`__: Implementar:func:`socket.if_nameindex() ',:func:`socket.if_napetoindex() `, y:func:`Socket.if_indextoname() `en Windows.

source: `bpo-36829 <https://bugs.python.org/issue36829>`__: :c:func:`PyErr_WriteUnraisable` now creates a traceback object if there is no current traceback. Moreover, call :c:func:`PyErr_NormalizeException` and :c:func:`PyException_SetTraceback` to normalize the exception value. Ignore any error.
es: `bpo-36829 <https://bugs.python.org/issue36829>`__: :c:func:`PyErr_WriteUnraisable` ahora crea un objeto de rastreo si no hay rastreo actual. Además, llame a :c:func:`PyErr_NormalizeException` y :c:func:`PyException_SetTraceback` para normalizar el valor de la excepción. Ignorar cualquier error.

source: `bpo-36878 <https://bugs.python.org/issue36878>`__: Only accept text after `# type: ignore` if the first character is ASCII. This is to disallow things like `# type: ignoreé`.
es: `bpo-36878 <https://bugs.python.org/issue36878>`__: Solo acepta texto después de `# Tipo: Ignorar` Si el primer carácter es ASCII.Esto es para rechazar cosas como '# Tipo: Ignoreé`.

source: `bpo-36878 <https://bugs.python.org/issue36878>`__: Store text appearing after a `# type: ignore` comment in the AST. For example a type ignore like `# type: ignore[E1000]` will have the string `"[E1000]"` stored in its AST node.
es: `bpo-36878 <https://bugs.python.org/issue36878>`__: Tienda de texto que aparece después de un 'tipo #: ignorar' comentario en el ast.Por ejemplo, un tipo ignore como `# Tipo: Ignorar [E1000]` tendrá la cadena `" [E1000] "" almacenada en su nodo AST.

source: `bpo-2180 <https://bugs.python.org/issue2180>`__: Treat line continuation at EOF as a ``SyntaxError`` by Anthony Sottile.
es: `bpo-2180 <https://bugs.python.org/issue2180>`__: Traje de la continuación Continuación en EOF como "SyntaxError". Por Anthony Sottile.

source: `bpo-36907 <https://bugs.python.org/issue36907>`__: Fix a crash when calling a C function with a keyword dict (``f(**kwargs)``) and changing the dict ``kwargs`` while that function is running.
es: `bpo-36907 <https://bugs.python.org/issue36907>`__: Arregla un choque al llamar a una función C con una palabra clave DICT (`` F (** Kwargs) ``) y cambiando el DICT ``Kwargs`` Mientras que esa función se está ejecutando.

source: `bpo-36946 <https://bugs.python.org/issue36946>`__: Fix possible signed integer overflow when handling slices.
es: `bpo-36946 <https://bugs.python.org/issue36946>`__: Arregla el posible desbordamiento de entero firmado al manejar las rebanadas.

source: `bpo-36826 <https://bugs.python.org/issue36826>`__: Add NamedExpression kind support to ast_unparse.c
es: `bpo-36826 <https://bugs.python.org/issue36826>`__: Añadir NamedExpressy Kind Soporte a AST_UNPARSE.C

source: `bpo-1875 <https://bugs.python.org/issue1875>`__: A :exc:`SyntaxError` is now raised if a code blocks that will be optimized away (e.g. if conditions that are always false) contains syntax errors. Patch by Pablo Galindo.
es: `bpo-1875 <https://bugs.python.org/issue1875>`__: a: exc exc: `syntaxerror` ahora se lanza si se optimizan los bloques de código (por ejemplo, si las condiciones que siempre son falsas) contienen sintaxiserrores. Parche de Pablo Galindo.

source: `bpo-36027 <https://bugs.python.org/issue36027>`__: Allow computation of modular inverses via three-argument ``pow``: the second argument is now permitted to be negative in the case where the first and third arguments are relatively prime.
es: `bpo-36027 <https://bugs.python.org/issue36027>`__: Permitir el cálculo de inversos modulares a través de tres argumentos ``POW`: El segundo argumento ahora está permitido ser negativo en el caso de que la primeraY los terceros argumentos son relativamente primos.

source: `bpo-36861 <https://bugs.python.org/issue36861>`__: Update the Unicode database to version 12.1.0.
es: `bpo-36861 <https://bugs.python.org/issue36861>`__: Actualice la base de datos de Unicode a la versión 12.1.0.

source: `bpo-28866 <https://bugs.python.org/issue28866>`__: Avoid caching attributes of classes which type defines mro() to avoid a hard cache invalidation problem.
es: `bpo-28866 <https://bugs.python.org/issue28866>`__: Evite los atributos de almacenamiento en caché de las clases que tipo define a MRO() para evitar un problema de invalidación de caché duro.

source: `bpo-36851 <https://bugs.python.org/issue36851>`__: The ``FrameType`` stack is now correctly cleaned up if the execution ends with a return and the stack is not empty.
es: `bpo-36851 <https://bugs.python.org/issue36851>`__: La pila ``FrameType`` ahora se limpia correctamente si la ejecución termina con una devolución y la pila no está vacía.

source: `bpo-34616 <https://bugs.python.org/issue34616>`__: The ``compile()`` builtin functions now support the ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` flag, which allow to compile sources that contains top-level ``await``, ``async with`` or ``async for``. This is useful to evaluate async-code from with an already async functions; for example in a custom REPL.
es: `bpo-34616 <https://bugs.python.org/issue34616>`__: Las funciones ``compile()`` integradas ahora son compatibles con la flag ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT``, que permite compilar fuentes que contenga las fuentes que contiene la parte superior ``await``, ``async with`` o ``async for``.Esto es útil para evaluar el código de async desde con las funciones ya async; por ejemplo en un REPL personalizada.

source: `bpo-36842 <https://bugs.python.org/issue36842>`__: Implement PEP 578, adding sys.audit, io.open_code and related APIs.
es: `bpo-36842 <https://bugs.python.org/issue36842>`__: Implementar PEP 578, agregando sys.audit, io.open_code y API relacionadas.

source: `bpo-27639 <https://bugs.python.org/issue27639>`__: Correct return type for UserList slicing operations. Patch by Michael Blahay, Erick Cervantes, and vaultah
es: `bpo-27639 <https://bugs.python.org/issue27639>`__: Tipo de devolución correcto para operaciones de rebanado de la lista de usuarios. Parche por Michael Blahay, Erick Cervantes y Vaultá

source: `bpo-36737 <https://bugs.python.org/issue36737>`__: Move PyRuntimeState.warnings into per-interpreter state (via "module state").
es: `bpo-36737 <https://bugs.python.org/issue36737>`__: Mover PyRuntimestate.Warnings en estado por intérprete (a través del estado del módulo ").

source: `bpo-36793 <https://bugs.python.org/issue36793>`__: Removed ``__str__`` implementations from builtin types :class:`bool`, :class:`int`, :class:`float`, :class:`complex` and few classes from the standard library. They now inherit ``__str__()`` from :class:`object`.
es: `bpo-36793 <https://bugs.python.org/issue36793>`__: eliminado ``__str__`` Implementaciones de tipos integrados :class:`bool`, :class:`int`, :class:`float`, :class:`complex` y pocas clases de la biblioteca estándar.Ahora heredan ``__str__()`` de :class:`object`.

source: `bpo-36817 <https://bugs.python.org/issue36817>`__: Add a ``=`` feature f-strings for debugging. This can precede ``!s``, ``!r``, or ``!a``. It produces the text of the expression, followed by an equal sign, followed by the repr of the value of the expression. So ``f'{3*9+15=}``` would be equal to the string ``'3*9+15=42```. If ``=`` is specified, the default conversion is set to ``!r``, unless a format spec is given, in which case the formatting behavior is unchanged, and __format__ will be used.
es: `bpo-36817 <https://bugs.python.org/issue36817>`__: Agregue un ``=` `Funciones F-Strings para la depuración.Esto puede preceder a ``!s``, ``!r``, o ``!a``.Produce el texto de la expresión, seguido de un signo igual, seguido de la RepRamiento del valor de la expresión.Por lo que ``f'{3*9+15=}'`` sería igual a la cadena ``'3*9+15=42'``. Si se especifica ``=`` se especifica, la conversión predeterminada se establece en ``!R``, a menos que se dé una especificación de formato, en cuyo caso el comportamiento de formato no se modifica, y se utilizará __format__.

source: `bpo-24048 <https://bugs.python.org/issue24048>`__: Save the live exception during import.c's ``remove_module()``.
es: `bpo-24048 <https://bugs.python.org/issued24048>`__: Guarde la excepción en vivo durante el '' remove_module() '' ".

source: `bpo-27987 <https://bugs.python.org/issue27987>`__: pymalloc returns memory blocks aligned by 16 bytes, instead of 8 bytes, on 64-bit platforms to conform x86-64 ABI. Recent compilers assume this alignment more often. Patch by Inada Naoki.
es: `bpo-27987 <https://bugs.python.org/issue27987>`__: Pymalloc retorna los bloques de memoria alineados por 16 bytes, en lugar de 8 bytes, en plataformas de 64 bits para conformar X86-64 ABI.Los compiladores recientes asumen esta alineación más a menudo. Parche por inada naoki.

source: `bpo-36601 <https://bugs.python.org/issue36601>`__: A long-since-meaningless check for ``getpid() == main_pid`` was removed from Python's internal C signal handler.
es: `bpo-36601 <https://bugs.python.org/issue36601>`__: Una verificación de larga distancia sin sentido para ``getpid() == main_pid`` se eliminó del controlador interno de la señal C de Python.

source: `bpo-36594 <https://bugs.python.org/issue36594>`__: Fix incorrect use of ``%p`` in format strings. Patch by Zackery Spytz.
es: `bpo-36594 <https://bugs.python.org/issue36594>`__: Arregla el uso incorrecto de ``% p`` en las cadenas de formato. Parche by Zackery Spytz.

source: `bpo-36045 <https://bugs.python.org/issue36045>`__: builtins.help() now prefixes `async` for async functions
es: `bpo-36045 <https://bugs.python.org/issue36045>`__: banderins.help() ahora prefije 'async` para las funciones de ASYNC

source: `bpo-36084 <https://bugs.python.org/issue36084>`__: Add native thread ID (TID) to threading.Thread objects (supported platforms: Windows, FreeBSD, Linux, macOS)
es: `bpo-36084 <https://bugs.python.org/issue36084>`__: Agregue la ID de hilo nativo (TID) a los objetos de roscado (plataformas compatibles: Windows, FreeBSD, Linux, MacOS)

source: `bpo-36035 <https://bugs.python.org/issue36035>`__: Added fix for broken symlinks in combination with pathlib
es: `bpo-36035 <https://bugs.python.org/issue36035>`__: Se agregó la solución para los simballices rotos en combinación con Pathlib

source: `bpo-35983 <https://bugs.python.org/issue35983>`__: Added new trashcan macros to deal with a double deallocation that could occur when the `tp_dealloc` of a subclass calls the `tp_dealloc` of a base class and that base class uses the trashcan mechanism. Patch by Jeroen Demeyer.
es: `bpo-35983 <https://bugs.python.org/issue35983>`__: agregó nuevas macros de basura para lidiar con una doble desasignación que podría ocurrir cuando el `tp_dealloc` de una subclase llama al` tp_dealloc` de una clase baseY esa clase base usa el mecanismo de basura. Parche por Jeroen Demeyer.

source: `bpo-20602 <https://bugs.python.org/issue20602>`__: Do not clear :data:`sys.flags` and :data:`sys.float_info` during shutdown. Patch by Zackery Spytz.
es: `bpo-20602 <https://bugs.python.org/issue20602>`__: No borre: Datos: `sys.flags` y: Datos:`sys.float_info` durante el apagado. Parche by Zackery Spytz.

source: `bpo-26826 <https://bugs.python.org/issue26826>`__: Expose :func:`copy_file_range` as a low level API in the :mod:`os` module.
es: `bpo-26826 <https://bugs.python.org/issue26826>`__: exponer:func:`Copy_File_Range 'como una API de bajo nivel en el módulo de :mod:`OS`.

source: `bpo-32388 <https://bugs.python.org/issue32388>`__: Remove cross-version binary compatibility requirement in tp_flags.
es: `bpo-32388 <https://bugs.python.org/issue32388>`__: Retire el requisito de compatibilidad binaria de la versión cruzada en TP_FLAGS.

source: `bpo-31862 <https://bugs.python.org/issue31862>`__: Port binascii to PEP 489 multiphase initialization. Patch by Marcel Plch.
es: `bpo-31862 <https://bugs.python.org/issue31862>`__: Puerto BinAscii a PEP 489 Inicialización multifase. Parche de Marcel PlCh.

source: `bpo-37128 <https://bugs.python.org/issue37128>`__: Added :func:`math.perm`.
es: `bpo-37128 <https://bugs.python.org/issue37128>`__: Añadido:func:`MATH.PERM`.
