Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-36025 <https://bugs.python.org/issue36025>`__: Fixed an accidental change to the datetime C API where the arguments to the :c:func:`PyDate_FromTimestamp` function were incorrectly interpreted as a single timestamp rather than an arguments tuple, which causes existing code to start raising :exc:`TypeError`. The backwards-incompatible change was only present in alpha releases of Python 3.8. Patch by Paul Ganssle.
es: `bpo-36025 <https://bugs.python.org/issue36025>`__: Se corrigió un cambio accidental a la API de DateTime C donde los argumentos a la función:c:func:`PYDATE_FROMTIMESTAMP 'FUNCIÓN FUERA INTERRECTAMENTE INTERPRETADA COMO UN SOLA TI TIPOEn lugar de un argumento tupla, lo que hace que el código existente comience a subir:exc:'TypeError`.El cambio incompatible al revés solo estaba presente en las liberaciones alfa de Python 3.8. Parche por Paul Ganssle.

source: `bpo-35810 <https://bugs.python.org/issue35810>`__: Modify ``PyObject_Init`` to correctly increase the refcount of heap- allocated Type objects. Also fix the refcounts of the heap-allocated types that were either doing this manually or not decreasing the type's refcount in tp_dealloc
es: `bpo-35810 <https://bugs.python.org/issue35810>`__: modify ``PyObject_Init`` para aumentar correctamente el refugio de los objetos de tipo asignado por el montón.También fije los refcesorios de los tipos asignados por el montón que hicieron esto manualmente o no disminuyendo el refchount del tipo en TP_DEALLOC

source: *Release date: 2019-03-25*
es: * Fecha de lanzamiento: 2019-03-25 *

source: `bpo-36216 <https://bugs.python.org/issue36216>`__: Changes urlsplit() to raise ValueError when the URL contains characters that decompose under IDNA encoding (NFKC-normalization) into characters that affect how the URL is parsed.
es: `bpo-36216 <https://bugs.python.org/issue36216>`__: Cambios urlsplit() para lanzar ValueError cuando la URL contenga caracteres que se descomponen en codificación de IDNA (normalización NFKC) en caracteres que afectan la URL es analizada.

source: `bpo-35121 <https://bugs.python.org/issue35121>`__: Don't send cookies of domain A without Domain attribute to domain B when domain A is a suffix match of domain B while using a cookiejar with :class:`http.cookiejar.DefaultCookiePolicy` policy. Patch by Karthikeyan Singaravelan.
es: `bpo-35121 <https://bugs.python.org/issue35121>`__: No envíe las cookies de dominio A sin el atributo de dominio al dominio B cuando el dominio A es una coincidencia de sufijo de dominio B mientras usa un cookiejar con:Clase: `http.cookiejar.defaultcookiepolicy` Política. Parche por karthikeyan singaravelan.

source: `bpo-36421 <https://bugs.python.org/issue36421>`__: Fix a possible double decref in _ctypes.c's ``PyCArrayType_new()``.
es: `bpo-36421 <https://bugs.python.org/issue36421>`__: Arregla un posible doble decref en _ctypes.c ``pycarraytype_new()` ``.

source: `bpo-36412 <https://bugs.python.org/issue36412>`__: Fix a possible crash when creating a new dictionary.
es: `bpo-36412 <https://bugs.python.org/issue36412>`__: Arregla un posible caída al crear un nuevo diccionario.

source: `bpo-36398 <https://bugs.python.org/issue36398>`__: Fix a possible crash in ``structseq_repr()``.
es: `bpo-36398 <https://bugs.python.org/issue36398>`__: Arregla un posible caída en ``structseq_repr()``.

source: `bpo-36256 <https://bugs.python.org/issue36256>`__: Fix bug in parsermodule when parsing a state in a DFA that has two or more arcs with labels of the same type. Patch by Pablo Galindo.
es: `bpo-36256 <https://bugs.python.org/issue36256>`__: Arregla el error en Parsermodule al analizar un estado en un DFA que tiene dos o más arcos con etiquetas del mismo tipo. Parche de Pablo Galindo.

source: `bpo-36365 <https://bugs.python.org/issue36365>`__: repr(structseq) is no longer limited to 512 bytes.
es: `bpo-36365 <https://bugs.python.org/issue36365>`__: rep (structseq) ya no se limita a 512 bytes.

source: `bpo-36374 <https://bugs.python.org/issue36374>`__: Fix a possible null pointer dereference in ``merge_consts_recursive()``. Patch by Zackery Spytz.
es: `bpo-36374 <https://bugs.python.org/issue36374>`__: Arregla una posible distensión de puntero nulo en ``merge_consts_recursive()``. Parche by Zackery Spytz.

source: `bpo-36236 <https://bugs.python.org/issue36236>`__: At Python initialization, the current directory is no longer prepended to :data:`sys.path` if it has been removed.
es: `bpo-36236 <https://bugs.python.org/issue36236>`__: En la inicialización de Python, el directorio actual ya no se prepende para: Datos: `sys.path` si se ha eliminado.

source: `bpo-36352 <https://bugs.python.org/issue36352>`__: Python initialization now fails with an error, rather than silently truncating paths, if a path is too long.
es: `bpo-36352 <https://bugs.python.org/issue36352>`__: La inicialización de Python ahora falla con un error, en lugar de truncar silenciosamente caminos, si un camino es demasiado largo.

source: `bpo-36301 <https://bugs.python.org/issue36301>`__: Python initialization now fails if decoding ``pybuilddir.txt`` configuration file fails at startup.
es: `bpo-36301 <https://bugs.python.org/issue36301>`__: la inicialización de Python ahora falla si decodifica el archivo de configuración ``pybuilddir.txt``.

source: `bpo-36333 <https://bugs.python.org/issue36333>`__: Fix leak in _PyRuntimeState_Fini. Contributed by Stéphane Wirtel.
es: `bpo-36333 <https://bugs.python.org/issue36333>`__: Arregla la fuga en _pyruntimestate_fini.Contribuido por Stéphane Wirtel.

source: `bpo-36332 <https://bugs.python.org/issue36332>`__: The builtin :func:`compile` can now handle AST objects that contain assignment expressions. Patch by Pablo Galindo.
es: `bpo-36332 <https://bugs.python.org/issue36332>`__: FUNCIN:func:`Compile 'ahora puede manejar los objetos AST que contienen expresiones de asignación.Parche de Pablo Galindo.

source: `bpo-36282 <https://bugs.python.org/issue36282>`__: Improved error message for too much positional arguments in some builtin functions.
es: `bpo-36282 <https://bugs.python.org/issue36282>`__: Mensaje de error mejorado para detectar demasiados argumentos posicionales en algunas funciones integradas.

source: `bpo-30040 <https://bugs.python.org/issue30040>`__: New empty dict uses fewer memory for now. It used more memory than empty dict created by ``dict.clear()``. And empty dict creation and deletion is about 2x faster. Patch by Inada Naoki.
es: `bpo-30040 <https://bugs.python.org/issue30040>`__: Nuevo DICT vacío usa menos memoria por ahora.Utilizó más memoria que el dict vacío creado por ``dict.clear()``. Y la creación y eliminación de dict vacíos son aproximadamente 2 veces más rápido. Parche por inada naoki.

source: `bpo-36262 <https://bugs.python.org/issue36262>`__: Fix an unlikely memory leak on conversion from string to float in the function ``_Py_dg_strtod()`` used by ``float(str)``, ``complex(str)``, :func:`pickle.load`, :func:`marshal.load`, etc.
es: `bpo-36262 <https://bugs.python.org/issue36262>`__: Arregla una pérdida improbable de la conversión de la cadena para flotar en la función ``_Py_dg_strtod()`` usado por ``float(str)``, ``complex(str)``, :func:`pickle.load`, :func:`marshal.load`, etc.

source: `bpo-36252 <https://bugs.python.org/issue36252>`__: Update Unicode databases to version 12.0.0.
es: `bpo-36252 <https://bugs.python.org/issue36252>`__: Actualice las bases de datos de Unicode a la versión 12.0.0.

source: `bpo-36218 <https://bugs.python.org/issue36218>`__: Fix a segfault occurring when sorting a list of heterogeneous values. Patch contributed by Rémi Lapeyre and Elliot Gorokhovsky.
es: `bpo-36218 <https://bugs.python.org/issue36218>`__: Arregla un segfault que se produce al ordenar una lista de valores heterogéneos.Patch aportado por Rémi Lapeyre y Elliot Gorokhovsky.

source: `bpo-36188 <https://bugs.python.org/issue36188>`__: Cleaned up left-over vestiges of Python 2 unbound method handling in method objects and documentation. Patch by Martijn Pieters
es: `bpo-36188 <https://bugs.python.org/issue36188>`__: limpió los vestigios de sobras de Python 2 Método no unido Manejo en los objetos del método y la documentación. Parche por martijn pieters

source: `bpo-36124 <https://bugs.python.org/issue36124>`__: Add a new interpreter-specific dict and expose it in the C-API via PyInterpreterState_GetDict(). This parallels PyThreadState_GetDict(). However, extension modules should continue using PyModule_GetState() for their own internal per-interpreter state.
es: `bpo-36124 <https://bugs.python.org/issue36124>`__: Agregue un nuevo dict específico del intérprete y expónelo en la C-API a través de PyinterPretState_GetDict().Esto es paralelo pythreadstate_getdict().Sin embargo, los módulos de extensión deben continuar usando Pymodule_GetState() para su propio estado interno por intérprete.

source: `bpo-35975 <https://bugs.python.org/issue35975>`__: Add a ``feature_version`` flag to ``ast.parse()`` (documented) and ``compile()`` (hidden) that allows tweaking the parser to support older versions of the grammar. In particular, if ``feature_version`` is 5 or 6, the hacks for the ``async`` and ``await`` keyword from PEP 492 are reinstated. (For 7 or higher, these are unconditionally treated as keywords, but they are still special tokens rather than ``NAME`` tokens that the parser driver recognizes.)
es: `bpo-35975 <https://bugs.python.org/issued35975>`__: Agregue una flag ``feature_version`` ``ast.parse()`` (documentado) y ``compile()`` (oculto) que permite ajustar el analizador para apoyar las versiones anteriores de la gramática.En particular, si ``feature_version`` es 5 o 6, se restablecen los hacks para la palabra clave ``async`` y ``await``. (Para 7 o más, estos se tratan incondicionalmente como palabras clave, pero aún son tokens especiales en lugar de ``NAME`` tokens que el controlador del analizador reconoce.)

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Use UTF-8 as the system encoding on VxWorks.
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: Use UTF-8 como el sistema que codifica en VXWorks.

source: `bpo-36048 <https://bugs.python.org/issue36048>`__: The :meth:`~object.__index__` special method will be used instead of :meth:`~object.__int__` for implicit conversion of Python numbers to C integers. Using the ``__int__()`` method in implicit conversions has been deprecated.
es: `bpo-36048 <https://bugs.python.org/issue36048>`__: THE:meth:`~ Objeto .__ ÍNITE__` Método especial Se usará en lugar de:meth:`~ Objeto .__ int__ 'para la conversión implícita deNúmeros de Python a los enteros de C.Usando el método ``__int__()`` en conversiones implícitas ha sido en desuso.

source: `bpo-35808 <https://bugs.python.org/issue35808>`__: Retire pgen and use a modified version of pgen2 to generate the parser. Patch by Pablo Galindo.
es: `bpo-35808 <https://bugs.python.org/issue35808>`__: Retire Pgen y use una versión modificada de Pgen2 para generar el analizador. Parche de Pablo Galindo.

source: `bpo-36401 <https://bugs.python.org/issue36401>`__: The class documentation created by pydoc now has a separate section for readonly properties.
es: `bpo-36401 <https://bugs.python.org/issue36401>`__: La documentación de la clase creada por Pydoc ahora tiene una sección separada para propiedades readonly.

source: `bpo-36320 <https://bugs.python.org/issue36320>`__: The typing.NamedTuple() class has deprecated the _field_types attribute in favor of the __annotations__ attribute which carried the same information. Also, both attributes were converted from OrderedDict to a regular dict.
es: `bpo-36320 <https://bugs.python.org/issue36320>`__: La clase Typing.namedtuple() ha desaprobado el atributo _field_types a favor del atributo __annotations__ que llevó la misma información.Además, ambos atributos se convirtieron de ordenados a un DICT regular.

source: `bpo-34745 <https://bugs.python.org/issue34745>`__: Fix :mod:`asyncio` ssl memory issues caused by circular references
es: `bpo-34745 <https://bugs.python.org/issue34745>`__: Arregla :mod:`asyncio` SSL Memory Problemas causados por referencias circulares

source: `bpo-36324 <https://bugs.python.org/issue36324>`__: Add method to statistics.NormalDist for computing the inverse cumulative normal distribution.
es: `bpo-36324 <https://bugs.python.org/issue36324>`__: Agregue el método a las estadísticas.normaldista para computar la distribución normal acumulativa inversa.

source: `bpo-36321 <https://bugs.python.org/issue36321>`__: collections.namedtuple() misspelled the name of an attribute. To be consistent with typing.NamedTuple, the attribute name should have been "_field_defaults" instead of "_fields_defaults". For backwards compatibility, both spellings are now created. The misspelled version may be removed in the future.
es: `bpo-36321 <https://bugs.python.org/issue36321>`__: collection.namedtuple() mal escrita el nombre de un atributo.Para ser consistente con la tipificación.namedtuple, el nombre del atributo debería haber sido "_field_defaults" en lugar de "_Fields_Defaults".Para la compatibilidad con versiones anteriores, se crean ambas ortografías.La versión mal escrita puede ser eliminada en el futuro.

source: `bpo-36297 <https://bugs.python.org/issue36297>`__: "unicode_internal" codec is removed. It was deprecated since Python 3.3. Patch by Inada Naoki.
es: `bpo-36297 <https://bugs.python.org/issue36297>`__: "Unicode_internal" codec se elimina.Fue desaprobado desde Python 3.3. Parche por inada naoki.

source: `bpo-36298 <https://bugs.python.org/issue36298>`__: Raise ModuleNotFoundError in pyclbr when a module can't be found. Thanks to 'mental' for the bug report.
es: `bpo-36298 <https://bugs.python.org/issue36298>`__: Levante ModulenotFounDror en PYCLBR cuando se puede encontrar un módulo.Gracias a 'Mental' para el informe de errores.

source: `bpo-36268 <https://bugs.python.org/issue36268>`__: Switch the default format used for writing tars with mod:`tarfile` to the modern POSIX.1-2001 pax standard, from the vendor-specific GNU. Contributed by C.A.M. Gerlach.
es: `bpo-36268 <https://bugs.python.org/issue36268>`__: Cambie el formato predeterminado utilizado para escribir alquitres con MOD: `Tarfile` a la Modern Posix.1-2001 Pax Standard, del vendedor específicoÑU.Contribuido por C.A.M.Gerlach.

source: `bpo-36285 <https://bugs.python.org/issue36285>`__: Fix integer overflows in the array module. Patch by Stephan Hohe.
es: `bpo-36285 <https://bugs.python.org/issue36285>`__: Arregla los desbordamientos enteros en el módulo de matriz. Parche de Stephan Hohe.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Add _signal module support for VxWorks.
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: Agregar _signal Módulo Soporte para VXWORKS.

source: `bpo-36272 <https://bugs.python.org/issue36272>`__: :mod:`logging` does not silently ignore RecursionError anymore. Patch contributed by Rémi Lapeyre.
es: `bpo-36272 <https://bugs.python.org/issue36272>`__: :mod:`logging` ya no ignora silenciosamente el recursionerror. Parche aportado por Rémi Lapeyre.

source: `bpo-36280 <https://bugs.python.org/issue36280>`__: Add a kind field to ast.Constant. It is 'u' if the literal has a 'u' prefix (i.e. a Python 2 style unicode literal), else None.
es: `bpo-36280 <https://bugs.python.org/issue36280>`__: Agregue un campo amable a AST.CONSTANT.Es 'u' si el literal tiene un prefijo 'u' (es decir, un literal de unicode estilo Python 2), de lo contrario, None.

source: `bpo-35931 <https://bugs.python.org/issue35931>`__: The :mod:`pdb` ``debug`` command now gracefully handles all exceptions.
es: `bpo-35931 <https://bugs.python.org/issue35931>`__: The :mod:`pdb` ``debug`` Command ahora maneja con gracia todas las excepciones.

source: `bpo-36251 <https://bugs.python.org/issue36251>`__: Fix format strings used for stderrprinter and re.Match reprs. Patch by Stephan Hohe.
es: `bpo-36251 <https://bugs.python.org/issue36251>`__: Arregla las cadenas de formato utilizadas para StvertrPrinter y Re.Match Reprs. Parche de Stephan Hohe.

source: `bpo-36235 <https://bugs.python.org/issue36235>`__: Fix ``CFLAGS`` in ``customize_compiler()`` of ``distutils.sysconfig``: when the ``CFLAGS`` environment variable is defined, don't override ``CFLAGS`` variable with the ``OPT`` variable anymore. Initial patch written by David Malcolm.
es: `bpo-36235 <https://bugs.python.org/issue36235>`__: Arregla ``CFLAGS`` en ``customize_compiler()`` de ``disttratils.sysconfig``: Cuando los ``CFLAGS`` la variable de entorno se define, no anula la variable ``CFLAGS`` con la variable ``opt`` Parche inicial escrito por David Malcolm.

source: `bpo-35807 <https://bugs.python.org/issue35807>`__: Update ensurepip to install pip 19.0.3 and setuptools 40.8.0.
es: `bpo-35807 <https://bugs.python.org/issue35807>`__: Actualizar Asegúrese de instalar PIP 19.0.3 y setuptools 40.8.0.

source: `bpo-36139 <https://bugs.python.org/issue36139>`__: Release GIL when closing :class:`~mmap.mmap` objects.
es: `bpo-36139 <https://bugs.python.org/issue36139>`__: Lanzamiento Gil al cerrar :class:`~mmap.mmap` objetos.

source: `bpo-36179 <https://bugs.python.org/issue36179>`__: Fix two unlikely reference leaks in _hashopenssl. The leaks only occur in out-of-memory cases.
es: `bpo-36179 <https://bugs.python.org/issue36179>`__: Arregla dos fugas de referencia poco probables en _hashopenssl.Las fugas solo ocurren en casos fuera de la memoria.

source: `bpo-36169 <https://bugs.python.org/issue36169>`__: Add overlap() method to statistics.NormalDist. Computes the overlapping coefficient for two normal distributions.
es: `bpo-36169 <https://bugs.python.org/issue36169>`__: agregue el método de superposición() a las estadísticas.normaldista.Calcula el coeficiente superpuesto para dos distribuciones normales.

source: `bpo-36103 <https://bugs.python.org/issue36103>`__: Default buffer size used by ``shutil.copyfileobj()`` is changed from 16 KiB to 64 KiB on non-Windows platform to reduce system call overhead. Contributed by Inada Naoki.
es: `bpo-36103 <https://bugs.python.org/issue36103>`__: Tamaño de tampón predeterminado utilizado por ``stlutil.copyfileobj()`` se cambia de 16 kIB a 64 kIB en la plataforma no con Windows para reducir el sistemaLlame a la cabeza.Contribuido por Inadla Naoki.

source: `bpo-36130 <https://bugs.python.org/issue36130>`__: Fix ``pdb`` with ``skip=...`` when stepping into a frame without a ``__name__`` global. Patch by Anthony Sottile.
es: `bpo-36130 <https://bugs.python.org/issue36130>`__: Arregla ``pdb`` con ``skip=...`` cuando se sube a un marco sin un global "__name__``. Parche por Anthony Sottile.

source: `bpo-35652 <https://bugs.python.org/issue35652>`__: shutil.copytree(copy_function=...) erroneously pass DirEntry instead of a path string.
es: `bpo-35652 <https://bugs.python.org/issue35652>`__: stlutil.copytree (copy_function = ...) Pase erróneamente Direntry en lugar de una cadena de ruta.

source: `bpo-35178 <https://bugs.python.org/issue35178>`__: Ensure custom :func:`warnings.formatwarning` function can receive `line` as positional argument. Based on patch by Tashrif Billah.
es: `bpo-35178 <https://bugs.python.org/issue35178>`__: Asegurarse:func:`Warnings.Formatwarning 'Function puede recibir' línea 'como argumento posicional.Basado en el parche de Tashrif Ballah.

source: `bpo-36106 <https://bugs.python.org/issue36106>`__: Resolve potential name clash with libm's sinpi(). Patch by Dmitrii Pasechnik.
es: `bpo-36106 <https://bugs.python.org/issue36106>`__: resolver el nombre de potencial choque con el SINPI de Libm(). Parche por dmitrii Pasechnik.

source: `bpo-36091 <https://bugs.python.org/issue36091>`__: Clean up reference to async generator in Lib/types. Patch by Henry Chen.
es: `bpo-36091 <https://bugs.python.org/issue36091>`__: Limpie la referencia al generador de ASYNC en lib / tipos. Parche por Henry Chen.

source: `bpo-36043 <https://bugs.python.org/issue36043>`__: :class:`FileCookieJar` supports :term:`path-like object`. Contributed by Stéphane Wirtel
es: `bpo-36043 <https://bugs.python.org/issue36043>`__: :class:`FileCookiejar` Soporta :term:`path-like object`. Contribuido por Stéphane Wirtel

source: `bpo-35899 <https://bugs.python.org/issue35899>`__: Enum has been fixed to correctly handle empty strings and strings with non-Latin characters (ie. 'α', 'א') without crashing. Original patch contributed by Maxwell. Assisted by Stéphane Wirtel.
es: `bpo-35899 <https://bugs.python.org/issue35899>`__: Enum se ha fijado para manejar correctamente las cadenas y las cuerdas vacías con caracteres no latinos (es decir, 'α', 'א') sin estrellarse.Patch original aportado por Maxwell.Asistido por Stéphane Wirtel.

source: `bpo-21269 <https://bugs.python.org/issue21269>`__: Add ``args`` and ``kwargs`` properties to mock call objects. Contributed by Kumar Akshay.
es: `bpo-21269 <https://bugs.python.org/issue21269>`__: Agregar `'Args`` y` `kwargs`` Properties para burlarse de los objetos de llamada.Contribuido por Kumar Akshay.

source: `bpo-30670 <https://bugs.python.org/issue30670>`__: `pprint.pp` has been added to pretty-print objects with dictionary keys being sorted with their insertion order by default. Parameter *sort_dicts* has been added to `pprint.pprint`, `pprint.pformat` and `pprint.PrettyPrinter`. Contributed by Rémi Lapeyre.
es: `bpo-30670 <https://bugs.python.org/issue30670>`__: `pprint.pp 'se ha agregado a objetos bonitos con las claves de diccionario que se ordenan con su orden de inserción de forma predeterminada.Parámetro * Sort_dicts * se ha agregado a `PPRINT.PPRINT`,` PPRINT.PFORMAT` y `PPRint.PrettyPrinter`.Contribuido por Rémi Lapeyre.

source: `bpo-35843 <https://bugs.python.org/issue35843>`__: Implement ``__getitem__`` for ``_NamespacePath``. Patch by Anthony Sottile.
es: `bpo-35843 <https://bugs.python.org/issue35843>`__: Implementar ``__getitem__`` para ``_namespacepath``. Parche por Anthony Sottile.

source: `bpo-35802 <https://bugs.python.org/issue35802>`__: Clean up code which checked presence of ``os.stat`` / ``os.lstat`` / ``os.chmod`` which are always present. Patch by Anthony Sottile.
es: `bpo-35802 <https://bugs.python.org/issue35802>`__: Limpiar el código que revisó la presencia de ``os.stat`` / ``os.lstat`` / ``os.chmod`` que siempre están presentes. Parche por Anthony Sottile.

source: `bpo-35715 <https://bugs.python.org/issue35715>`__: Librates the return value of a ProcessPoolExecutor _process_worker after it's no longer needed to free memory
es: `bpo-35715 <https://bugs.python.org/issue35715>`__: LIBRADA EL VALOR DE DEVOLUCIÓN DE UN PROCESOPOOLEXECUTOR _PROCESS_WORTER Después de que ya no sea necesario para la memoria libre

source: `bpo-35493 <https://bugs.python.org/issue35493>`__: Use :func:`multiprocessing.connection.wait` instead of polling each 0.2 seconds for worker updates in :class:`multiprocessing.Pool`. Patch by Pablo Galindo.
es: `bpo-35493 <https://bugs.python.org/issued35493>`__: Uso:func:`multiprocessing.connection.wait 'en lugar de sondear cada 0.2 segundos para las actualizaciones de los trabajadores en :class:`multiprocessing.pool`.Parche de Pablo Galindo.

source: `bpo-35661 <https://bugs.python.org/issue35661>`__: Store the venv prompt in pyvenv.cfg.
es: `bpo-35661 <https://bugs.python.org/issue35661>`__: Tienda el indicador VENV en pyvenv.cfg.

source: `bpo-35121 <https://bugs.python.org/issue35121>`__: Don't set cookie for a request when the request path is a prefix match of the cookie's path attribute but doesn't end with "/". Patch by Karthikeyan Singaravelan.
es: `bpo-35121 <https://bugs.python.org/issue35121>`__: No establezca cookie para una solicitud cuando la ruta de solicitud es una coincidencia de prefijo del atributo de ruta de la cookie pero no termina con "/". Parche por karthikeyan singaravelan.
