Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-33110 <https://bugs.python.org/issue33110>`__: Handle exceptions raised by functions added by concurrent.futures add_done_callback correctly when the Future has already completed.
es: `bpo-33110 <https://bugs.python.org/issue33110>`__: Manejar excepciones planteadas por funciones agregadas por concurrentes.futuras add_done_callback correctamente cuando el futuro ya ha completado.

source: `bpo-26903 <https://bugs.python.org/issue26903>`__: Limit `max_workers` in `ProcessPoolExecutor` to 61 to work around a WaitForMultipleObjects limitation.
es: `bpo-26903 <https://bugs.python.org/issue26903>`__: Límite 'max_workers` en' processpoolexecutor` a 61 para trabajar alrededor de una limitación de WaitFormultipleObjects.

source: `bpo-36813 <https://bugs.python.org/issue36813>`__: Fix :class:`~logging.handlers.QueueListener` to call ``queue.task_done()`` upon stopping. Patch by Bar Harel.
es: `bpo-36813 <https://bugs.python.org/issue36813>`__: Arreglado :class:`~logging.handlers.QueueListener` para llamar a ``queue.task_done()`` al detenerse. Parche by Bar Harel.

source: `bpo-36806 <https://bugs.python.org/issue36806>`__: Forbid creation of asyncio stream objects like StreamReader, StreamWriter, Process, and their protocols outside of asyncio package.
es: `bpo-36806 <https://bugs.python.org/issue36806>`__: prohíbe la creación de objetos de Stream de Asyncio como StreamReader, StreamEtwriter, Process y sus protocolos fuera del paquete Asyncio.

source: `bpo-36802 <https://bugs.python.org/issue36802>`__: Provide both sync and async calls for StreamWriter.write() and StreamWriter.close()
es: `bpo-36802 <https://bugs.python.org/issue36802>`__: Proporcione las llamadas de Sincronización y Async para StreamWriter.Write() y StreamErtiter.close()

source: `bpo-36801 <https://bugs.python.org/issue36801>`__: Properly handle SSL connection closing in asyncio StreamWriter.drain() call.
es: `bpo-36801 <https://bugs.python.org/issue36801>`__: Cierre de conexión SSL de manera adecuada en Asyncio StreamWriter.drain() Llame.

source: `bpo-36785 <https://bugs.python.org/issue36785>`__: Implement PEP 574 (pickle protocol 5 with out-of-band buffers).
es: `bpo-36785 <https://bugs.python.org/issue36785>`__: Implementar PEP 574 (protocolo de pepinillo 5 con buffers fuera de banda).

source: `bpo-36772 <https://bugs.python.org/issue36772>`__: functools.lru_cache() can now be used as a straight decorator in addition to its existing usage as a function that returns a decorator.
es: `bpo-36772 <https://bugs.python.org/issue36772>`__: funttools.lru_cache() ahora se puede usar como un decorador recto además de su uso existente como una función que retorna un decorador.

source: `bpo-6584 <https://bugs.python.org/issue6584>`__: Add a :exc:`~gzip.BadGzipFile` exception to the :mod:`gzip` module.
es: `bpo-6584 <https://bugs.python.org/issuen6584>`__: Añadir A: EXC: `~ gzip.badgzipfile` Excepción a la :mod:`GZIP 'Módulo.

source: `bpo-36748 <https://bugs.python.org/issue36748>`__: Optimized write buffering in C implementation of ``TextIOWrapper``. Writing ASCII string to ``TextIOWrapper`` with ascii, latin1, or utf-8 encoding is about 20% faster. Patch by Inada Naoki.
es: `bpo-36748 <https://bugs.python.org/issue36748>`__: Búfer de escritura optimizada en la implementación de C ``TextIOWrapper``. Escribir una cadena ASCII a ``TextIOWrapper`` con la codificación ASCII, Latin1, o UTF-8 es aproximadamente un 20% más rápido. Parche por Inada Naoki.

source: `bpo-8138 <https://bugs.python.org/issue8138>`__: Don't mark ``wsgiref.simple_server.SimpleServer`` as multi-threaded since ``wsgiref.simple_server.WSGIServer`` is single-threaded.
es: `bpo-8138 <https://bugs.python.org/issue8138>`__: no marque ``wsgiref.simple_server.SimpleServer`` como multi-roscado desde ``wsgiref.simple_server.WSGIServer`` es un soloroscado.

source: `bpo-22640 <https://bugs.python.org/issue22640>`__: :func:`py_compile.compile` now supports silent mode. Patch by Joannah Nanjekye
es: `bpo-22640 <https://bugs.python.org/issue22640>`__: :func:`py_compile.compile` ahora admite el modo silencioso. Parche de Joannah Nanjekye

source: `bpo-29183 <https://bugs.python.org/issue29183>`__: Fix double exceptions in :class:`wsgiref.handlers.BaseHandler` by calling its :meth:`~wsgiref.handlers.BaseHandler.close` method only when no exception is raised.
es: `bpo-29183 <https://bugs.python.org/issue29183>`__: Arregla las excepciones dobles en :class:`wsgiref.handlers.basehandler` al llamar a su :meth:`~wsgiref.handlers.BaseHandler.close` método solo cuando no se plantea ninguna excepción.

source: `bpo-36548 <https://bugs.python.org/issue36548>`__: Improved the repr of regular expression flags.
es: `bpo-36548 <https://bugs.python.org/issue36548>`__: Mejora la Reproche de las indicadoras de expresión regular.

source: `bpo-36542 <https://bugs.python.org/issue36542>`__: The signature of Python functions can now be overridden by specifying the ``__text_signature__`` attribute.
es: `bpo-36542 <https://bugs.python.org/issue36542>`__: La firma de las funciones de Python ahora puede ser anulado al especificar el atributo ``__Text_Signature__``.

source: `bpo-36533 <https://bugs.python.org/issue36533>`__: Reinitialize logging.Handler locks in forked child processes instead of attempting to acquire them all in the parent before forking only to be released in the child process. The acquire/release pattern was leading to deadlocks in code that has implemented any form of chained logging handlers that depend upon one another as the lock acquisition order cannot be guaranteed.
es: `bpo-36533 <https://bugs.python.org/issue36533>`__: Reinicialice las cerraduras de logging.Handler en procesos infantiles bifurcados en lugar de intentar adquirirlos a todos en el padre antes de que se lleven solo a la bifurcación en el proceso secundario.El patrón de adquisición / liberación que conducía a puntos muertos en el código que ha implementado cualquier forma de manejadores de registro encadenados que dependen entre sí, ya que la orden de adquisición de bloqueo no se puede garantizar.

source: `bpo-35252 <https://bugs.python.org/issue35252>`__: Throw a TypeError instead of an AssertionError when using an invalid type annotation with singledispatch.
es: `bpo-35252 <https://bugs.python.org/issue35252>`__: Lanza un TypeError en lugar de una aserción cuando se usa una anotación de tipo no válida con Singledispatch.

source: `bpo-35900 <https://bugs.python.org/issue35900>`__: Allow reduction methods to return a 6-item tuple where the 6th item specifies a custom state-setting method that's called instead of the regular ``__setstate__`` method.
es: `bpo-35900 <https://bugs.python.org/issue35900>`__: Permitir que los métodos de reducción retornen una tupla de 6 elementos donde el 6º elemento especifica un método de configuración de estado personalizada que se llama en lugar del "__setstate__ regular"`` MÉTODO.

source: `bpo-35900 <https://bugs.python.org/issue35900>`__: enable custom reduction callback registration for functions and classes in _pickle.c, using the new Pickler's attribute ``reducer_override``
es: `bpo-35900 <https://bugs.python.org/issue35900>`__: Habilitar el registro de devolución de llamada de reducción personalizada para funciones y clases en _pickle.c, utilizando el atributo de New Pickler ``reducer_override``

source: `bpo-36368 <https://bugs.python.org/issue36368>`__: Fix a bug crashing SharedMemoryManager instances in interactive sessions after a ctrl-c (KeyboardInterrupt) was sent
es: `bpo-36368 <https://bugs.python.org/issue36368>`__: Arregla un error que se bloquee un error que se bloquea las instancias de MemoryManager en sesiones interactivas después de que se envió un CTRL-C (tecladointerrupt)

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Fix mmap fail for VxWorks
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: Fix MMAP Fallo para VXWORKS

source: `bpo-27497 <https://bugs.python.org/issue27497>`__: :meth:`csv.DictWriter.writeheader` now returns the return value of the underlying :meth:`csv.Writer.writerow` method. Patch contributed by Ashish Nitin Patil.
es: `bpo-27497 <https://bugs.python.org/issued27497>`__: :meth:`csv.DictWriter.writeheader` ahora retorna el valor de retorno del método subyacente :meth:`csv.Writer.writerow`. Patch aportado por Ashish Nitin Patil.

source: `bpo-36239 <https://bugs.python.org/issue36239>`__: Parsing .mo files now ignores comments starting and ending with #-#-#-#-#.
es: `bpo-36239 <https://bugs.python.org/issue36239>`__: Análisis de archivos .MO ahora ignora los comentarios que comienzan y terminan con # - # # # - # - #.

source: `bpo-26707 <https://bugs.python.org/issue26707>`__: Enable plistlib to read and write binary plist files that were created as a KeyedArchive file. Specifically, this allows the plistlib to process 0x80 tokens as UID objects.
es: `bpo-26707 <https://bugs.python.org/issue26707>`__: Habilita PLISTLIB para leer y escribir archivos de plist binary que se crearon como un archivo clave.Específicamente, esto permite al plistlib procesar tokens 0x80 como objetos UID.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Add posix module support for VxWorks.
es: `bpo-31904 <https://bugs.python.org/issue 31904>`__: Añadir Soporte de módulo POSIX PARA VXWORKS.

source: `bpo-35125 <https://bugs.python.org/issue35125>`__: Asyncio: Remove inner callback on outer cancellation in shield
es: `bpo-35125 <https://bugs.python.org/issue35125>`__: Asyncio: Retire la devolución de llamada interna en la cancelación exterior en escudo

source: `bpo-35721 <https://bugs.python.org/issue35721>`__: Fix :meth:`asyncio.SelectorEventLoop.subprocess_exec()` leaks file descriptors if ``Popen`` fails and called with ``stdin=subprocess.PIPE``. Patch by Niklas Fiekas.
es: `bpo-35721 <https://bugs.python.org/issue35721>`__: FIX:meth:`asyncio.selectoreventloop.subprocess_exec() 'Fugs Los descriptores de archivos si`` POPEN`` falla y se llama con ``stdin=subproceso.PIPE``. Parche por niklas fiekas.

source: `bpo-31855 <https://bugs.python.org/issue31855>`__: :func:`unittest.mock.mock_open` results now respects the argument of read([size]). Patch contributed by Rémi Lapeyre.
es: `bpo-31855 <https://bugs.python.org/issue31855>`__: :func:`unittest.mock.mock_open` resultados ahora respeta el argumento de read([size]). Parche aportado por Rémi Lapeyre.

source: `bpo-35431 <https://bugs.python.org/issue35431>`__: Implement :func:`math.comb` that returns binomial coefficient, that computes the number of ways to choose k items from n items without repetition and without order. Patch by Yash Aggarwal and Keller Fuchs.
es: `bpo-35431 <https://bugs.python.org/issue35431>`__: Implementar:func:`math.comb 'que retorna el coeficiente binomial, que calcula la cantidad de formas de elegir los artículos K de n elementos sin repetición ySin orden. Parche por Yash Aggarwal y Keller Fuchs.

source: `bpo-26660 <https://bugs.python.org/issue26660>`__: Fixed permission errors in :class:`~tempfile.TemporaryDirectory` clean up. Previously ``TemporaryDirectory.cleanup()`` failed when non-writeable or non-searchable files or directories were created inside a temporary directory.
es: `bpo-26660 <https://bugs.python.org/issued26660>`__: Errores de permiso fijo en limmpieza :class:`~tempfile.TemporaryDirectory`. Previamente ``TemporalDirectory.cleanUp()`` falló cuando se crearon archivos o directorios no escritos o no de búsqueda o directorios dentro de un directorio temporal.

source: `bpo-34271 <https://bugs.python.org/issue34271>`__: Add debugging helpers to ssl module. It's now possible to dump key material and to trace TLS protocol. The default and stdlib contexts also support SSLKEYLOGFILE env var.
es: `bpo-34271 <https://bugs.python.org/issue34271>`__: Agregue a los ayudantes de depuración al módulo SSL.Ahora es posible volcar el material clave y para rastrear el protocolo TLS.Los contextos predeterminados y STDLIB también admiten SSLKEYLOGFILE ENV VAR.

source: `bpo-26467 <https://bugs.python.org/issue26467>`__: Added AsyncMock to support using unittest to mock asyncio coroutines. Patch by Lisa Roach.
es: `bpo-26467 <https://bugs.python.org/issue26467>`__: agregó a Asyncmock para apoyar usando unittest para burlarse de Asyncio Coroutines. Parche de Lisa Roach.

source: `bpo-33569 <https://bugs.python.org/issue33569>`__: dataclasses.InitVar: Exposes the type used to create the init var.
es: `bpo-33569 <https://bugs.python.org/issue33569>`__: dataclasses.initvar: expone el tipo utilizado para crear el var.

source: `bpo-34424 <https://bugs.python.org/issue34424>`__: Fix serialization of messages containing encoded strings when the policy.linesep is set to a multi-character string. Patch by Jens Troeger.
es: `bpo-34424 <https://bugs.python.org/issue34424>`__: Arregla la serialización de los mensajes que contienen cadenas codificadas cuando la política.LineSEP se establece en una cadena de caracteres múltiples. Parche por Jens Trouger.

source: `bpo-34303 <https://bugs.python.org/issue34303>`__: Performance of :func:`functools.reduce` is slightly improved. Patch by Sergey Fedoseev.
es: `bpo-34303 <https://bugs.python.org/issue34303>`__: Rendimiento de:func:`Functools.reduce 'se mejora ligeramente. Parche por Sergey FedSeev.

source: `bpo-33361 <https://bugs.python.org/issue33361>`__: Fix a bug in :class:`codecs.StreamRecoder` where seeking might leave old data in a buffer and break subsequent read calls. Patch by Ammar Askar.
es: `bpo-33361 <https://bugs.python.org/issue33361>`__: Arregla un error en:class:`codecs.streamRecoder` Donde la búsqueda podría dejar datos antiguos en un búfer y romper las llamadas de lectura posteriores. Parche de Ammar Askar.

source: `bpo-22454 <https://bugs.python.org/issue22454>`__: The :mod:`shlex` module now exposes :func:`shlex.join`, the inverse of :func:`shlex.split`. Patch by Bo Bayles.
es: `bpo-22454 <https://bugs.python.org/issue22454>`__: :mod:`shlex` Módulo ahora expone :func:`shlex.join`, la inversa de :func:`shlex.split`. Parche por bo bayles.

source: `bpo-31922 <https://bugs.python.org/issue31922>`__: :meth:`asyncio.AbstractEventLoop.create_datagram_endpoint`: Do not connect UDP socket when broadcast is allowed. This allows to receive replies after a UDP broadcast.
es: `bpo-31922 <https://bugs.python.org/issue 31922>`__: :meth:`asyncio.AbstractEventLoop.create_datagram_endpoint`: No conecte el zócalo UDP cuando se permite la transmisión.Esto permite recibir respuestas después de una transmisión de UDP.

source: `bpo-24882 <https://bugs.python.org/issue24882>`__: Change ThreadPoolExecutor to use existing idle threads before spinning up new ones.
es: `bpo-24882 <https://bugs.python.org/issued24882>`__: Cambie la línea de roscaExecutor para usar los hilos inactivos existentes antes de girar los nuevos nuevos.

source: `bpo-31961 <https://bugs.python.org/issue31961>`__: Added support for bytes and path-like objects in :func:`subprocess.Popen` on Windows. The *args* parameter now accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing bytes and path-like objects. The *executable* parameter now accepts a bytes and :term:`path-like object`. The *cwd* parameter now accepts a bytes object. Based on patch by Anders Lorentsen.
es: `bpo-31961 <https://bugs.python.org/issue31961>`__: Añadido soporte para bytes y objetos similares en:func:`Subprocess.Popen` en Windows.El parámetro * Args * ahora acepta A: Término: 'objeto similar a la ruta' si * shell * es ``False`` y una secuencia que contiene bytes y objetos similares a la ruta.El parámetro * ejecutable * ahora acepta un bytes y: término: 'objeto similar a la ruta`.El parámetro * CWD * ahora acepta un objeto de bytes.Basado en el parche por Anders Lorentsen.

source: `bpo-33123 <https://bugs.python.org/issue33123>`__: :class:`pathlib.Path.unlink` now accepts a *missing_ok* parameter to avoid a :exc:`FileNotFoundError` from being raised. Patch by Robert Buchholz.
es: `bpo-33123 <https://bugs.python.org/issue33123>`__: :class:`pathlib.Path.unlink` ahora acepta un parámetro *missing_ok* para evitar un :exc:`FileNotFoundError` de siendo elevado. Parche por Robert Buchholz.

source: `bpo-32941 <https://bugs.python.org/issue32941>`__: Allow :class:`mmap.mmap` objects to access the madvise() system call (through :meth:`mmap.mmap.madvise`).
es: `bpo-32941 <https://bugs.python.org/issue32941>`__: Permitir :class:`mmap.mmap` objetos para acceder a la llamada del sistema madvise() (A través de :meth:`mmap.mmap.madvise`).

source: `bpo-22102 <https://bugs.python.org/issue22102>`__: Added support for ZIP files with disks set to 0. Such files are commonly created by builtin tools on Windows when use ZIP64 extension. Patch by Francisco Facioni.
es: `bpo-22102 <https://bugs.python.org/issue22102>`__: Añadido soporte para archivos zip con discos establecidos en 0. Dichos archivos se crean comúnmente mediante herramientas integradas en Windows cuando se usa Zip64 Extension. Parche por Francisco Facioni.

source: `bpo-32515 <https://bugs.python.org/issue32515>`__: trace.py can now run modules via python3 -m trace -t --module module_name
es: `bpo-32515 <https://bugs.python.org/issue32515>`__: trace.py ahora puede ejecutar módulos a través de python3 -m trace -t - módulo module_name

source: `bpo-32299 <https://bugs.python.org/issue32299>`__: Changed :func:`unittest.mock.patch.dict` to return the patched dictionary when used as context manager. Patch by Vadim Tsander.
es: `bpo-32299 <https://bugs.python.org/issue32299>`__: cambiado:func:`Unittest.mock.patch.dict` para retornar el parcheado diccionario cuando se utiliza como administrador de contexto. Parche por Vadim Tsander.

source: `bpo-27141 <https://bugs.python.org/issue27141>`__: Added a ``__copy__()`` to ``collections.UserList`` and ``collections.UserDict`` in order to correctly implement shallow copying of the objects. Patch by Bar Harel.
es: `bpo-27141 <https://bugs.python.org/issue27141>`__: agregó un ``__copy__()`` a ``collection.userlist.userlist`` y` `colecciones.userdict`` para implementar correctamenteCopia baja de los objetos. Parche by Bar Harel.

source: `bpo-31829 <https://bugs.python.org/issue31829>`__: ``\r``, ``\0`` and ``\x1a`` (end-of-file on Windows) are now escaped in protocol 0 pickles of Unicode strings. This allows to load them without loss from files open in text mode in Python 2.
es: `bpo-31829 <https://bugs.python.org/issue31829>`__: ``'\r``, ``\0`` y ``\x1a`` (Fin-of-file en Windows) esAhora se escapó en el protocolo 0 Pickles of Unicode Strings.Esto permite cargarlos sin pérdida de archivos abiertos en modo de texto en Python 2.

source: `bpo-23395 <https://bugs.python.org/issue23395>`__: ``_thread.interrupt_main()`` now avoids setting the Python error status if the ``SIGINT`` signal is ignored or not handled by Python.
es: `bpo-23395 <https://bugs.python.org/issue23395>`__: ``_thread.interrupt_main()`` Ahora evita configurar el estado de error de Python si se ignora o no se maneja la señal ``SIGINT`` de Python.

source: `bpo-36896 <https://bugs.python.org/issue36896>`__: Clarify that some types have unstable constructor signature between Python versions.
es: `bpo-36896 <https://bugs.python.org/issue36896>`__: Aclare que algunos tipos tienen firma constructora inestable entre las versiones de Python.

source: `bpo-36686 <https://bugs.python.org/issue36686>`__: Improve documentation of the stdin, stdout, and stderr arguments of of the ``asyncio.subprocess_exec`` function to specify which values are supported. Also mention that decoding as text is not supported.
es: `bpo-36686 <https://bugs.python.org/issue36686>`__: Mejorar la documentación de los argumentos de STDIN, STdout y STDERR de la función ``asyncio.subprocess_exec`` para especificar qué valores son compatibles.También mencione que la decodificación de texto no es compatible.

source: Add a few tests to verify that the various values passed to the std* arguments actually work.
es: Agregue algunas pruebas para verificar que los distintos valores pasen a los argumentos STD * en realidad funcionan.

source: `bpo-36984 <https://bugs.python.org/issue36984>`__: Improve version added references in ``typing`` module - by Anthony Sottile.
es: `bpo-36984 <https://bugs.python.org/issue36984>`__: Mejorar la versión Se agregó referencias en el módulo ``typing`` - de Anthony SOTTILE.

source: `bpo-36868 <https://bugs.python.org/issue36868>`__: What's new now mentions SSLContext.hostname_checks_common_name instead of SSLContext.host_flags.
es: `bpo-36868 <https://bugs.python.org/issue36868>`__: Qué hay de nuevo ahora menciona ahora sslcontext.hostname_checks_common_name en lugar de sslcontext.host_flags.

source: `bpo-35924 <https://bugs.python.org/issue35924>`__: Add a note to the ``curses.addstr()`` documentation to warn that multiline strings can cause segfaults because of an ncurses bug.
es: `bpo-35924 <https://bugs.python.org/issue35924>`__: Agregue una nota a la "curses.addstr()` `documentación para advertir que las cadenas multilíneas pueden causar SEGFAULTS debido a un error de NCURSES.

source: `bpo-36783 <https://bugs.python.org/issue36783>`__: Added C API Documentation for Time_FromTimeAndFold and PyDateTime_FromDateAndTimeAndFold as per PEP 495. Patch by Edison Abahurire.
es: `bpo-36783 <https://bugs.python.org/issue36783>`__: Añadida C API Documentación para Time_FromTimeAndfold y PyDateTime_FomDateAndTimeAdfold como PEP 495. Patch de Edison Abrahurire.

source: `bpo-36797 <https://bugs.python.org/issue36797>`__: More of the legacy distutils documentation has been either pruned, or else more clearly marked as being retained solely until the setuptools documentation covers it independently.
es: `bpo-36797 <https://bugs.python.org/issue36797>`__: Más de la documentación de los distintivos heredados se ha podido, o bien más claramente marcado como retenido únicamente hasta que la documentación de SetuptOols lo cubra de manera independiente.

source: `bpo-22865 <https://bugs.python.org/issue22865>`__: Add detail to the documentation on the `pty.spawn` function.
es: `bpo-22865 <https://bugs.python.org/issue22865>`__: Agregue detalle a la documentación de la función `pty.pawn`.

source: `bpo-35397 <https://bugs.python.org/issue35397>`__: Remove deprecation and document urllib.parse.unwrap(). Patch contributed by Rémi Lapeyre.
es: `bpo-35397 <https://bugs.python.org/issue35397>`__: Retire la deprecación y documente urllib.Parse.unwrap().Patch aportado por Rémi Lapeyre.

source: `bpo-32995 <https://bugs.python.org/issue32995>`__: Added the context variable in glossary.
es: `bpo-32995 <https://bugs.python.org/issue32995>`__: agregó la variable de contexto en el glosario.

source: `bpo-33519 <https://bugs.python.org/issue33519>`__: Clarify that `copy()` is not part of the `MutableSequence` ABC.
es: `bpo-33519 <https://bugs.python.org/issue33519>`__: Aclare que `Copiar()` no es parte del ABC de `mutablesequese '.

source: `bpo-33482 <https://bugs.python.org/issue33482>`__: Make `codecs.StreamRecoder.writelines` take a list of bytes.
es: `bpo-33482 <https://bugs.python.org/issue33482>`__: haz 'codecs.streamrecoder.writelines` Tome una lista de bytes.

source: `bpo-25735 <https://bugs.python.org/issue25735>`__: Added documentation for func factorial to indicate that returns integer values
es: `bpo-25735 <https://bugs.python.org/issue25735>`__: Documentación agregada para FUNC Factorial para indicar que retorna los valores enteros
