Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-38237 <https://bugs.python.org/issue38237>`__: The arguments for the builtin pow function are more descriptive. They can now also be passed in as keywords.
es: `bpo-38237 <https://bugs.python.org/issue38237>`__: Los argumentos para la función POW integrados son más descriptivos.Ahora también se pueden pasar como palabras clave.

source: `bpo-38191 <https://bugs.python.org/issue38191>`__: Constructors of :class:`~typing.NamedTuple` and :class:`~typing.TypedDict` types now accept arbitrary keyword argument names, including "cls", "self", "typename", "_typename", "fields" and "_fields". Passing positional arguments by keyword is deprecated.
es: `bpo-38191 <https://bugs.python.org/issue38191>`__: constructores de :class:`~tiping.namedtuple` y :class:`~typing.typeddict` tipos ahora acepta nombres de argumentos de palabras clave arbitrarias, incluyendo"CLS", "Auto", "typename", "_typename", "campos" y "_fields".Pasar los argumentos posicionales por palabra clave está en desuso.

source: `bpo-38185 <https://bugs.python.org/issue38185>`__: Fixed case-insensitive string comparison in :class:`sqlite3.Row` indexing.
es: `bpo-38185 <https://bugs.python.org/issue38185>`__: Comparación de cadenas insensibles a la caja fija en :class:`sqlite3.row` indexing.

source: `bpo-38136 <https://bugs.python.org/issue38136>`__: Changes AsyncMock call count and await count to be two different counters. Now await count only counts when a coroutine has been awaited, not when it has been called, and vice-versa. Update the documentation around this.
es: `bpo-38136 <https://bugs.python.org/issue38136>`__: Cambios de CAMBIOS ASYNCMOCK CLAME CUENTA Y AWAIT CUENTA PARA SER DOS CONTADORES DIFERENTES.Ahora espera el recuento solo cuenta cuando se ha esperado una coroutina, no cuando se ha llamado, y viceversa.Actualiza la documentación alrededor de esto.

source: `bpo-37828 <https://bugs.python.org/issue37828>`__: Fix default mock name in :meth:`unittest.mock.Mock.assert_called` exceptions. Patch by Abraham Toriz Cruz.
es: `bpo-37828 <https://bugs.python.org/issue37828>`__: Arregla el nombre de simulacro predeterminado en :meth:`unittest.mock.Mock.assert_called` excepciones. Parche de Abraham Toriz Cruz.

source: `bpo-38175 <https://bugs.python.org/issue38175>`__: Fix a memory leak in comparison of :class:`sqlite3.Row` objects.
es: `bpo-38175 <https://bugs.python.org/issue38175>`__: Arregla una fuga de memoria en comparación de :class:`sqlite3.row` objetos.

source: `bpo-33936 <https://bugs.python.org/issue33936>`__: _hashlib no longer calls obsolete OpenSSL initialization function with OpenSSL 1.1.0+.
es: `bpo-33936 <https://bugs.python.org/issue33936>`__: _hashlib Ya no llama a la función de inicialización obsoleta OpenSSL con OpenSSL 1.1.0+.

source: `bpo-34706 <https://bugs.python.org/issue34706>`__: Preserve subclassing in inspect.Signature.from_callable.
es: `bpo-34706 <https://bugs.python.org/issue34706>`__: preserva la subclasificación en inspección. Signature.from_callable.

source: `bpo-38153 <https://bugs.python.org/issue38153>`__: Names of hashing algorithms frome OpenSSL are now normalized to follow Python's naming conventions. For example OpenSSL uses sha3-512 instead of sha3_512 or blake2b512 instead of blake2b.
es: `bpo-38153 <https://bugs.python.org/issue38153>`__: Los nombres de los algoritmos de hashing de OPENSL ahora están normalizados para seguir las convenciones de nomenclatura de Python.Por ejemplo, OpenSSL utiliza SHA3-512 en lugar de SHA3_512 o Blake2B512 en lugar de Blake2b.

source: `bpo-38115 <https://bugs.python.org/issue38115>`__: Fix a bug in dis.findlinestarts() where it would return invalid bytecode offsets. Document that a code object's co_lnotab can contain invalid bytecode offsets.
es: `bpo-38115 <https://bugs.python.org/issue38115>`__: Arregla un error en Dis.FindLinAstArts() donde retornaría las compensaciones de byTecode inválido.Documento que el CO_LNOTAB de un objeto de código puede contener compensaciones de byTecode inválido.

source: `bpo-38148 <https://bugs.python.org/issue38148>`__: Add slots to :mod:`asyncio` transport classes, which can reduce memory usage.
es: `bpo-38148 <https://bugs.python.org/issue38148>`__: Agregar tragamonedas a:mod:`Asyncio` Clases de transporte, que pueden reducir el uso de la memoria.

source: `bpo-36991 <https://bugs.python.org/issue36991>`__: Fixes a potential incorrect AttributeError exception escaping ZipFile.extract() in some unsupported input error situations.
es: `bpo-36991 <https://bugs.python.org/issue36991>`__: Corrige una posibilidad de excepción incorrecta de AtributeError que escapa a ZipFile.Extract() en algunas situaciones de error de entrada no compatibles.

source: `bpo-38134 <https://bugs.python.org/issue38134>`__: Remove obsolete copy of PBKDF2_HMAC_fast. All supported OpenSSL versions contain a fast implementation.
es: `bpo-38134 <https://bugs.python.org/issue38134>`__: Eliminar la copia obsoleta de pbkdf2_hmac_fast.Todas las versiones de OpenSSL compatibles contienen una implementación rápida.

source: `bpo-38132 <https://bugs.python.org/issue38132>`__: The OpenSSL hashlib wrapper uses a simpler implementation. Several Macros and pointless caches are gone. The hash name now comes from OpenSSL's EVP. The algorithm name stays the same, except it is now always lower case.
es: `bpo-38132 <https://bugs.python.org/issue38132>`__: El wrapper de OpenSSL Hashlib usa una implementación más simple.Varias macros y cachés sin sentido se han ido.El nombre de hash ahora proviene de EVP de OpenSSL.El nombre del algoritmo permanece igual, excepto que ahora siempre es minúsculas.

source: `bpo-38008 <https://bugs.python.org/issue38008>`__: Fix parent class check in protocols to correctly identify the module that provides a builtin protocol, instead of assuming they all come from the :mod:`collections.abc` module
es: `bpo-38008 <https://bugs.python.org/issue38008>`__: Arregla los protocolos de la clase de los padres en los protocolos para identificar correctamente el módulo que proporciona un protocolo integrado, en lugar de asumir que todos provienen de:mod:`coleccionesMódulo .ABC

source: `bpo-37405 <https://bugs.python.org/issue37405>`__: Fixed regression bug for socket.getsockname() for non-CAN_ISOTP AF_CAN address family sockets by returning a 1-tuple instead of string.
es: `bpo-37405 <https://bugs.python.org/issue37405>`__: Error de regresión fija para Socket.getSockName() para los sockets de la familia de direcciones no CAN_ISOTP AF_CAN al retornar un 1-tuple en lugar de cadena.

source: `bpo-38121 <https://bugs.python.org/issue38121>`__: Update parameter names on functions in importlib.metadata matching the changes in the 0.22 release of importlib_metadata.
es: `bpo-38121 <https://bugs.python.org/issue38121>`__: Actualice los nombres de los parámetros en funciones en importlib.metadata que coinciden con los cambios en la versión 0.22 de importlib_metadata.

source: `bpo-38110 <https://bugs.python.org/issue38110>`__: The os.closewalk() implementation now uses the libc fdwalk() API on platforms where it is available.
es: `bpo-38110 <https://bugs.python.org/issue38110>`__: la implementación OS.CLOSEWALK() ahora utiliza la API de LIBC FDWALK() en las plataformas donde está disponible.

source: `bpo-38093 <https://bugs.python.org/issue38093>`__: Fixes AsyncMock so it doesn't crash when used with AsyncContextManagers or AsyncIterators.
es: `bpo-38093 <https://bugs.python.org/issue38093>`__: Corrige AsyncMock para que no se bloquee cuando se usa con AsyncContextManagers o AsyncIterators.

source: `bpo-37488 <https://bugs.python.org/issue37488>`__: Add warning to :meth:`datetime.utctimetuple`, :meth:`datetime.utcnow` and :meth:`datetime.utcfromtimestamp` .
es: `bpo-37488 <https://bugs.python.org/issue37488>`__: agregue advertencia a: met: `DateTime.utctimetuple`,:meth:`DateTime.utcNow` y:meth:`DateTime.utCfromTimestamp`.

source: `bpo-38086 <https://bugs.python.org/issue38086>`__: Update importlib.metadata with changes from `importlib_metadata 0.21 <https://gitlab.com/python-devs/importlib_metadata/blob/0.21/importlib_metadata/docs/changelog.rst>`_.
es: `bpo-38086 <https://bugs.python.org/issuen38086>`__: Actualice importlib.metadata con cambios de `importlib_metadata 0.21 <https://gitlab.com/python-devs/importlib_metadata/blob/0.21/importlib_metadata/docs/changelog.rst>`_.

source: `bpo-37251 <https://bugs.python.org/issue37251>`__: Remove `__code__` check in AsyncMock that incorrectly evaluated function specs as async objects but failed to evaluate classes with `__await__` but no `__code__` attribute defined as async objects.
es: `bpo-37251 <https://bugs.python.org/issue37251>`__: __: __code__ 'compruebe en Asyncmock que evaluó incorrectamente las especificaciones de la función como objetos de ASYNC, pero no pudo evaluar las clases con el atributo "__await__` pero no`__code__`Definido como objetos de Async.

source: `bpo-38037 <https://bugs.python.org/issue38037>`__: Fix reference counters in the :mod:`signal` module.
es: `bpo-38037 <https://bugs.python.org/issue38037>`__: Arregla los contadores de referencia en el módulo:mod:'señal'.

source: `bpo-38066 <https://bugs.python.org/issue38066>`__: Hide internal asyncio.Stream methods: feed_eof(), feed_data(), set_exception() and set_transport().
es: `bpo-38066 <https://bugs.python.org/issue38066>`__: Ocultar métodos internos de asencio.stream: feed_eof(), feed_data(), set_exception() y set_transport().

source: `bpo-38059 <https://bugs.python.org/issue38059>`__: inspect.py now uses sys.exit() instead of exit()
es: `bpo-38059 <https://bugs.python.org/issue38059>`__: inspect.py ahora usa sys.exit() en lugar de salir()

source: `bpo-37953 <https://bugs.python.org/issue37953>`__: In :mod:`typing`, improved the ``__hash__`` and ``__eq__`` methods for :class:`ForwardReferences`.
es: `bpo-37953 <https://bugs.python.org/issue37953>`__: en:mod:`Methiesting ', mejorado el` `__hash__`` y` `__eq__`` Methods: Class:`Forwardreferences`.

source: `bpo-38026 <https://bugs.python.org/issue38026>`__: Fixed :func:`inspect.getattr_static` used ``isinstance`` while it should avoid dynamic lookup.
es: `bpo-38026 <https://bugs.python.org/issue38026>`__: Arreglado :func:`inspect.getattr_static` usó ``isinstance`` Si bien debería evitar la búsqueda dinámica.

source: `bpo-38010 <https://bugs.python.org/issue38010>`__: In ``importlib.metadata`` sync with ``importlib_metadata`` 0.20, clarifying behavior of ``files()`` and fixing issue where only one requirement was returned for ``requires()`` on ``dist-info`` packages.
es: `bpo-38010 <https://bugs.python.org/issue38010>`__: en ``importlib.metadata`` sincronizada con ``importlib_metadata`` 0.20, clarificando el comportamiento de ``files()`` y la emisión de fijaciónDonde solo se devolvió un requisito para ``requiere()`` en los paquetes 'Dist-info-info``.

source: `bpo-38006 <https://bugs.python.org/issue38006>`__: weakref.WeakValueDictionary defines a local remove() function used as callback for weak references. This function was created with a closure. Modify the implementation to avoid the closure.
es: `bpo-38006 <https://bugs.python.org/issue38006>`__: weekref.weakvaluedictiony Define una función de eliminación local() utilizada como devolución de llamada para referencias débiles.Esta función fue creada con un cierre.Modificar la implementación para evitar el cierre.

source: `bpo-34410 <https://bugs.python.org/issue34410>`__: Fixed a crash in the :func:`tee` iterator when re-enter it. RuntimeError is now raised in this case.
es: `bpo-34410 <https://bugs.python.org/issue34410>`__: Se corrigió un choque en:func:'Tee' iterator cuando vuelve a ingresarlo.RunTimeError ahora se plantea en este caso.

source: `bpo-37140 <https://bugs.python.org/issue37140>`__: Fix a ctypes regression of Python 3.8. When a ctypes.Structure is passed by copy to a function, ctypes internals created a temporary object which had the side effect of calling the structure finalizer (__del__) twice. The Python semantics requires a finalizer to be called exactly once. Fix ctypes internals to no longer call the finalizer twice.
es: `bpo-37140 <https://bugs.python.org/issue37140>`__: Arregla una regresión de CTYPES de Python 3.8.Cuando se pasa una estructura de ctypes. Copia a una función, los internos de CTYPES crearon un objeto temporal que tenía el efecto secundario de llamar al finalizador de la estructura (__del__) dos veces.La semántica de Python requiere que un finalizador se llame exactamente una vez.Arregla los internos de CTYPES para que ya no llame al finalizador dos veces.

source: `bpo-37972 <https://bugs.python.org/issue37972>`__: Subscripts to the `unittest.mock.call` objects now receive the same chaining mechanism as any other custom attributes, so that the following usage no longer raises a `TypeError`:
es: `bpo-37972 <https://bugs.python.org/issue37972>`__: Los objetos de "unittest.mock.call` ahora reciben el mismo mecanismo de encadenamiento que cualquier otro atributo personalizado, para que el siguiente uso ya no sealanza un 'TypeError`:

source: Patch by blhsing
es: Parche por blhsing

source: `bpo-22347 <https://bugs.python.org/issue22347>`__: Update mimetypes.guess_type to allow proper parsing of URLs with only a host name. Patch by Dong-hee Na.
es: `bpo-22347 <https://bugs.python.org/issue22347>`__: Actualice mimetypes.guess_type para permitir el análisis adecuado de las URL con solo un nombre de host. Parche por dong-hee na.

source: `bpo-37885 <https://bugs.python.org/issue37885>`__: venv: Don't generate unset variable warning on deactivate.
es: `bpo-37885 <https://bugs.python.org/issue37885>`__: venv: no genere la advertencia de la variable de desactivación desactivada.

source: `bpo-37785 <https://bugs.python.org/issue37785>`__: Fix xgettext warnings in :mod:`argparse`.
es: `bpo-37785 <https://bugs.python.org/issue37785>`__: Arregla las advertencias de XGetText en:mod:`Armarpare`.

source: `bpo-11953 <https://bugs.python.org/issue11953>`__: Completing WSA* error codes in :mod:`socket`.
es: `bpo-11953 <https://bugs.python.org/issue11953>`__: completando WSA * Códigos de error en:mod:`Socket`.

source: `bpo-37424 <https://bugs.python.org/issue37424>`__: Fixes a possible hang when using a timeout on `subprocess.run()` while capturing output. If the child process spawned its own children or otherwise connected its stdout or stderr handles with another process, we could hang after the timeout was reached and our child was killed when attempting to read final output from the pipes.
es: `bpo-37424 <https://bugs.python.org/issue37424>`__: fija una posible colgar cuando se usa un tiempo de espera en `subprocess.run() 'mientras se captura la salida.Si el proceso del niño engendró a sus propios hijos o, de lo contrario, se conectaron sus asas de STdout o STDERR con otro proceso, podríamos colgarnos después de que se alcanzó el tiempo de espera y nuestro hijo fue asesinado al intentar leer la producción final de las tuberías.

source: `bpo-37212 <https://bugs.python.org/issue37212>`__: :func:`unittest.mock.call` now preserves the order of keyword arguments in repr output. Patch by Karthikeyan Singaravelan.
es: `bpo-37212 <https://bugs.python.org/issue37212>`__: :func:`Unittest.mock.call` ahora conserva el orden de los argumentos de la palabra clave en la salida repr. Parche por karthikeyan singaravelan.

source: `bpo-37305 <https://bugs.python.org/issue37305>`__: Add .webmanifest -> application/manifest+json to list of recognized file types and content type headers
es: `bpo-37305 <https://bugs.python.org/issue37305>`__: Añadir .WebManifest -> Aplicación / Manifiesto + JSON Para la lista de tipos de archivos reconocidos y encabezados tipo de contenido

source: `bpo-21872 <https://bugs.python.org/issue21872>`__: Fix :mod:`lzma`: module decompresses data incompletely. When decompressing a FORMAT_ALONE format file, and it doesn't have the end marker, sometimes the last one to dozens bytes can't be output. Patch by Ma Lin.
es: `bpo-21872 <https://bugs.python.org/issue21872>`__: FIX:mod:`LZMA`: El módulo descomprime los datos de forma incompleta.Cuando descomprime un archivo Format_alone Format, y no tiene el marcador final, a veces el último para docenas de bytes no se puede emitir. Parche por ma lin.

source: `bpo-37206 <https://bugs.python.org/issue37206>`__: Default values which cannot be represented as Python objects no longer improperly represented as ``None`` in function signatures.
es: `bpo-37206 <https://bugs.python.org/issue37206>`__: Valores predeterminados que no se pueden representar como objetos de Python ya no están representados incorrectamente como ``None`` en las firmas de la función.

source: `bpo-12144 <https://bugs.python.org/issue12144>`__: Ensure cookies with ``expires`` attribute are handled in :meth:`CookieJar.make_cookies`.
es: `bpo-12144 <https://bugs.python.org/issue12144>`__: Asegúrese de que las cookies con el atributo ``expires`` se manejan en:meth:`cookiejar.make_cookies`.

source: `bpo-31163 <https://bugs.python.org/issue31163>`__: pathlib.Path instance's rename and replace methods now return the new Path instance.
es: `bpo-31163 <https://bugs.python.org/issue31163>`__: PATHLIB.PATH Cambiar nombre y reemplazar los métodos Ahora retorne la nueva instancia de ruta.

source: `bpo-25068 <https://bugs.python.org/issue25068>`__: :class:`urllib.request.ProxyHandler` now lowercases the keys of the passed dictionary.
es: `bpo-25068 <https://bugs.python.org/issued25068>`__: :class:`urllib.request.ProxyHandler` ahora baja las llaves del diccionario pasado.

source: `bpo-21315 <https://bugs.python.org/issue21315>`__: Email headers containing RFC2047 encoded words are parsed despite the missing whitespace, and a defect registered. Also missing trailing whitespace after encoded words is now registered as a defect.
es: `bpo-21315 <https://bugs.python.org/issue21315>`__: Los encabezados de correo electrónico que contienen las palabras codificadas RFC2047 se analizan a pesar de la espacios en blanco que falta, y un defecto registrado.También falta el espacio en blanco de arrastre después de que las palabras codificadas ahora están registradas como un defecto.

source: `bpo-36250 <https://bugs.python.org/issue36250>`__: Ignore ``ValueError`` from ``signal`` with ``interaction`` in non-main thread.
es: `bpo-36250 <https://bugs.python.org/issue36250>`__: ignore ``ValueError`` de ``signal`` con ``interaction`` en el hilo no principal.

source: `bpo-35168 <https://bugs.python.org/issue35168>`__: :attr:`shlex.shlex.punctuation_chars` is now a read-only property.
es: `bpo-35168 <https://bugs.python.org/issue35168>`__: :attr:`shlex.shlex.punctuation_chars` es ahora una propiedad de solo lectura.

source: `bpo-20504 <https://bugs.python.org/issue20504>`__: Fixes a bug in :mod:`cgi` module when a multipart/form-data request has no `Content-Length` header.
es: `bpo-20504 <https://bugs.python.org/issue20504>`__: corrige un error en:mod:`CGI 'Módulo cuando una solicitud Multipart / Form de datos no tiene un encabezado" de longitud de contenido ".

source: `bpo-34519 <https://bugs.python.org/issue34519>`__: Add additional aliases for HP Roman 8. Patch by Michael Osipov.
es: `bpo-34519 <https://bugs.python.org/issue34519>`__: Agregar alias adicionales para HP Roman 8. Parche de Michael Osipov.

source: `bpo-26868 <https://bugs.python.org/issue26868>`__: Fix example usage of :c:func:`PyModule_AddObject` to properly handle errors.
es: `bpo-26868 <https://bugs.python.org/issue26868>`__: Fix Ejemplo de uso de:c:func:`pymodule_addobject 'para manejar adecuadamente los errores.

source: `bpo-36797 <https://bugs.python.org/issue36797>`__: Fix a dead link in the distutils API Reference.
es: `bpo-36797 <https://bugs.python.org/issue36797>`__: Arregla un enlace muerto en la referencia de la API Distutils.

source: `bpo-37977 <https://bugs.python.org/issue37977>`__: Warn more strongly and clearly about pickle insecurity
es: `bpo-37977 <https://bugs.python.org/issue37977>`__: Advierte más fuerte y claramente sobre la inseguridad de los pepinillos

source: `bpo-37937 <https://bugs.python.org/issue37937>`__: Mention ``frame.f_trace`` in :func:`sys.settrace` docs.
es: `bpo-37937 <https://bugs.python.org/issue37937>`__: Mencione ``frame.f_trace`` en :func:`sys.settrace` docs.

source: `bpo-36260 <https://bugs.python.org/issue36260>`__: Add decompression pitfalls to zipfile module documentation.
es: `bpo-36260 <https://bugs.python.org/issue36260>`__: Agregue los trampos de descompresión a la documentación del módulo de módulo ZIPFILE.

source: `bpo-36960 <https://bugs.python.org/issue36960>`__: Restructured the :mod:`datetime` docs in the interest of making them more user-friendly and improving readability. Patch by Brad Solomon.
es: `bpo-36960 <https://bugs.python.org/issue36960>`__: Reestructured The:mod:`DateTime` Docs en interés de hacerlos más fácil de usar y mejorar la legibilidad. Parche por Brad Solomon.

source: `bpo-23460 <https://bugs.python.org/issue23460>`__: The documentation for decimal string formatting using the `:g` specifier has been updated to reflect the correct exponential notation cutoff point. Original patch contributed by Tuomas Suutari.
es: `bpo-23460 <https://bugs.python.org/issue23460>`__: La documentación para el formato de cadena decimal usando el especificador `: g` se ha actualizado para reflejar el punto de corte de notación exponencial correcto.Patch original aportado por Tuomas Suutari.

source: `bpo-35803 <https://bugs.python.org/issue35803>`__: Document and test that ``tempfile`` functions may accept a :term:`path-like object` for the ``dir`` argument. Patch by Anthony Sottile.
es: `bpo-35803 <https://bugs.python.org/issue35803>`__: Documento y prueba que ``tempfile`` funciones puede aceptar un :term:`path-like object` para el argumento ``dir``. Parche por Anthony Sottile.

source: `bpo-33944 <https://bugs.python.org/issue33944>`__: Added a note about the intended use of code in .pth files.
es: `bpo-33944 <https://bugs.python.org/issue33944>`__: agregó una nota sobre el uso previsto del código en archivos .pth.

source: `bpo-34293 <https://bugs.python.org/issue34293>`__: Fix the Doc/Makefile regarding PAPER environment variable and PDF builds
es: `bpo-34293 <https://bugs.python.org/issue34293>`__: Arregla el documento DOC / Makefile con respecto a la variable de entorno de papel y las compilaciones PDF

source: `bpo-38239 <https://bugs.python.org/issue38239>`__: Fix test_gdb for Link Time Optimization (LTO) builds.
es: `bpo-38239 <https://bugs.python.org/issue38239>`__: Fix test_gdb para la optimización del tiempo de enlace (LTO) se basa.

source: `bpo-38275 <https://bugs.python.org/issue38275>`__: test_ssl now handles disabled TLS/SSL versions better. OpenSSL's crypto policy and run-time settings are recognized and tests for disabled versions are skipped. Tests also accept more TLS minimum_versions for platforms that override OpenSSL's default with strict settings.
es: `bpo-38275 <https://bugs.python.org/issue38275>`__: test_ssl ahora maneja mejor las versiones TLS / SSL.Se reconocen las configuraciones de la Política de Crypto y Tiempo de ejecución de OpenSSL y se saltan las pruebas para las versiones deshabilitadas.Las pruebas también aceptan más TLS Mínimo_versions para plataformas que anulan el valor predeterminado de OpensSL con configuraciones estrictas.
