Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-35581 <https://bugs.python.org/issue35581>`__: @typing.type_check_only now allows type stubs to mark functions and classes not available during runtime.
es: `bpo-35581 <https://bugs.python.org/issue35581>`__: @ typing.type_check_only ahora permite que los tiendas de tipo marcan funciones y clases no disponibles durante el tiempo de ejecución.

source: `bpo-33832 <https://bugs.python.org/issue33832>`__: Add glossary entry for 'magic method'.
es: `bpo-33832 <https://bugs.python.org/issue33832>`__: Agregar entrada Glosario para 'Método Mágico'.

source: `bpo-32913 <https://bugs.python.org/issue32913>`__: Added re.Match.groupdict example to regex HOWTO.
es: `bpo-32913 <https://bugs.python.org/issue32913>`__: agregó re.match.groupDict Ejemplo a la regularidad.

source: `bpo-36719 <https://bugs.python.org/issue36719>`__: regrtest now always detects uncollectable objects. Previously, the check was only enabled by ``--findleaks``. The check now also works with ``-jN/--multiprocess N``. ``--findleaks`` becomes a deprecated alias to ``--fail-env-changed``.
es: `bpo-36719 <https://bugs.python.org/issue36719>`__: Regrese ahora siempre detecta objetos incollectables.Anteriormente, el cheque solo estaba habilitado por ``--findleaks``.El cheque ahora también funciona con ``-jN/--multiprocess N``. ``--findleaks`` se convierte en un alias desaprobado a ``--fail-env-cambied``.

source: `bpo-36725 <https://bugs.python.org/issue36725>`__: When using mulitprocessing mode (-jN), regrtest now better reports errors if a worker process fails, and it exits immediately on a worker thread failure or when interrupted.
es: `bpo-36725 <https://bugs.python.org/issue36725>`__: Cuando utilice Modo MulitProcessing (-JN), regrándose ahora en mejores informes de errores si un proceso de trabajador falla, y sale inmediatamente en una falla del hilo de los trabajadores ocuando se interrumpe.

source: `bpo-36454 <https://bugs.python.org/issue36454>`__: Change test_time.test_monotonic() to test only the lower bound of elapsed time after a sleep command rather than the upper bound. This prevents unnecessary test failures on slow buildbots. Patch by Victor Stinner.
es: `bpo-36454 <https://bugs.python.org/issue36454>`__: Cambiar test_time.test_moMonotonic() para probar solo el límite inferior de tiempo transcurrido después de un comando de suspensión en lugar del límite superior.Esto evita fallas de prueba innecesarias en Buildbots lentos. Parche por Victor Stinner.

source: `bpo-32424 <https://bugs.python.org/issue32424>`__: Improve test coverage for xml.etree.ElementTree. Patch by Gordon P. Hemsley.
es: `bpo-32424 <https://bugs.python.org/issue32424>`__: Mejorar la cobertura de prueba para XML.Etrae.ElementTree. Parche de Gordon P. Hemsley.

source: `bpo-32424 <https://bugs.python.org/issue32424>`__: Fix typo in test_cyclic_gc() test for xml.etree.ElementTree. Patch by Gordon P. Hemsley.
es: `bpo-32424 <https://bugs.python.org/issue32424>`__: FIX TIPO TIPO EN TEST_CYCLIC_GC() PRUEBA PARA XML.ETREE.ELENTETREE. Parche de Gordon P. Hemsley.

source: `bpo-36635 <https://bugs.python.org/issue36635>`__: Add a new :mod:`_testinternalcapi` module to test the internal C API.
es: `bpo-36635 <https://bugs.python.org/issue36635>`__: Agregue un nuevo :mod:`_testinternalcapi` módulo para probar la API interna.

source: `bpo-36629 <https://bugs.python.org/issue36629>`__: Fix ``test_imap4_host_default_value()`` of ``test_imaplib``: catch also :data:`errno.ENETUNREACH` error.
es: `bpo-36629 <https://bugs.python.org/issue36629>`__: Arregla ``test_imap4_host_default_value()`` de ``test_imaplib`: Catch también: Datos: `errno.EntunReach` Error.

source: `bpo-36611 <https://bugs.python.org/issue36611>`__: Fix ``test_sys.test_getallocatedblocks()`` when :mod:`tracemalloc` is enabled.
es: `bpo-36611 <https://bugs.python.org/issue36611>`__: corregir ``test_sys.test_getallocatedblocks()`` cuando :mod:`tracemalloc` está habilitado.

source: `bpo-36560 <https://bugs.python.org/issue36560>`__: Fix reference leak hunting in regrtest: compute also deltas (of reference count, allocated memory blocks, file descriptor count) during warmup, to ensure that everything is initialized before starting to hunt reference leaks.
es: `bpo-36560 <https://bugs.python.org/issue36560>`__: Arreglar la caza de fugas de referencia en regañas: calcule también Deltas (del recuento de referencia, bloques de memoria asignados, recuento del descriptor de archivo) durante el calentamiento, para asegurarse de que todose inicializa antes de comenzar a cazar fugas de referencia.

source: `bpo-36565 <https://bugs.python.org/issue36565>`__: Fix reference hunting (``python3 -m test -R 3:3``) when Python has no built-in abc module.
es: `bpo-36565 <https://bugs.python.org/issue36565>`__: Arregla la caza de referencia (`` Python3 -m prueba -R 3: 3``) Cuando Python no tiene un módulo ABC incorporado.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Port test_resource to VxWorks: skip tests cases setting RLIMIT_FSIZE and RLIMIT_CPU.
es: `bpo-31904 <https://bugs.python.org/issue 31904>`__: PORT TEST_RESOURCE A VXWORKS: Omitir casos de pruebas Configuración de RLIMIT_FSIZE y RLIMIT_CPU.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Fix test_tabnanny on VxWorks: adjust ENOENT error message.
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: Fix test_tabnanny on vxworks: Ajuste el mensaje de error en Enoent.

source: `bpo-36436 <https://bugs.python.org/issue36436>`__: Fix ``_testcapi.pymem_buffer_overflow()``: handle memory allocation failure.
es: `bpo-36436 <https://bugs.python.org/issue36436>`__: Arregla ``_testcapi.pymym_buffer_overflow() ``: Manejar el fallo de asignación de memoria.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Fix test_utf8_mode on VxWorks: Python always use UTF-8 on VxWorks.
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: Fix test_utf8_mode on vxworks: Python siempre usa UTF-8 en VXWorks.

source: `bpo-36341 <https://bugs.python.org/issue36341>`__: Fix tests that may fail with PermissionError upon calling bind() on AF_UNIX sockets.
es: `bpo-36341 <https://bugs.python.org/issue36341>`__: Arregla las pruebas que pueden fallar con permisoError al llamar a BIND() en los sockets AF_Unix.

source: `bpo-36747 <https://bugs.python.org/issue36747>`__: Remove the stale scriptsinstall Makefile target.
es: `bpo-36747 <https://bugs.python.org/issue36747>`__: Retire el objetivo de makefile de ScriptsInstall Stale.

source: `bpo-21536 <https://bugs.python.org/issue21536>`__: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin.
es: `bpo-21536 <https://bugs.python.org/issue21536>`__: En UNIX, las extensiones C ya no están vinculadas a Libpython, excepto en Android y Cygwin.

source: It is now possible for a statically linked Python to load a C extension built using a shared library Python.
es: Ahora es posible que un python establezca enlazado cargue una extensión C construida utilizando una biblioteca compartida Python.

source: When Python is embedded, ``libpython`` must not be loaded with ``RTLD_LOCAL``, but ``RTLD_GLOBAL`` instead. Previously, using ``RTLD_LOCAL``, it was already not possible to load C extensions which were not linked to ``libpython``, such as C extensions of the standard library built by the ``*shared*`` section of ``Modules/Setup``.
es: Cuando Python está incrustado, ``libpython`` no debe cargarse con ``RTLD_LOCAL``, pero ``RTLD_GLOBAL`` en su lugar.Anteriormente, usando ``RTLD_LOCAL``, ya no era posible cargar las extensiones C que no estaban vinculadas a ``libpython``, como las extensiones C de la biblioteca estándar construida por la sección ``*shared`` ``Modules/Setup``.

source: distutils, python-config and python-config.py have been modified.
es: distutils, python-config y python-config.py han sido modificados.

source: `bpo-36707 <https://bugs.python.org/issue36707>`__: ``./configure --with-pymalloc`` no longer adds the ``m`` flag to SOABI (sys.implementation.cache_tag). Enabling or disabling pymalloc has no impact on the ABI.
es: `bpo-36707 <https://bugs.python.org/issue36707>`__: ``./configure --with-pymalloc`` ya no agrega el flag ``m`` a SOABI (sys.implementation.cache_tag). Habilitar o deshabilitar pymalloc no tiene impacto en el ABI.

source: `bpo-36635 <https://bugs.python.org/issue36635>`__: Change ``PyAPI_FUNC(type)``, ``PyAPI_DATA(type)`` and ``PyMODINIT_FUNC`` macros of ``pyport.h`` when ``Py_BUILD_CORE_MODULE`` is defined. The ``Py_BUILD_CORE_MODULE`` define must be now be used to build a C extension as a dynamic library accessing Python internals: export the PyInit_xxx() function in DLL exports on Windows.
es: `bpo-36635 <https://bugs.python.org/issue36635>`__: Cambiar ``PyAPI_FUNC(type)``, ``PyAPI_DATA(type)`` y ``PyMODINIT_FUNC`` macros de ``pyport.h`` cuando se define ``Py_BUILD_CORE_MODULE`` definir el ``Py_BUILD_CORE_MODULE`` se debe usar ahora para crear una extensión C como una biblioteca dinámica que accede a Python Internals: Exportar la función Pyinit_xxx() en DLL Exports en Windows.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Don't build the ``_crypt`` extension on VxWorks.
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: No construya la extensión ``_crypt`` en vxworks.

source: `bpo-36618 <https://bugs.python.org/issue36618>`__: Add ``-fmax-type-align=8`` to CFLAGS when clang compiler is detected. The pymalloc memory allocator aligns memory on 8 bytes. On x86-64, clang expects alignment on 16 bytes by default and so uses MOVAPS instruction which can lead to segmentation fault. Instruct clang that Python is limited to alignment on 8 bytes to use MOVUPS instruction instead: slower but don't trigger a SIGSEGV if the memory is not aligned on 16 bytes. Sadly, the flag must be added to ``CFLAGS`` and not just ``CFLAGS_NODIST``, since third party C extensions can have the same issue.
es: `bpo-36618 <https://bugs.python.org/issue36618>`__: agregue ``-fmax-type-align=8`` a cflags cuando se detecta el compilador de clang.El asignador de memoria Pymalloc alinea la memoria en 8 bytes.En X86-64, Clang espera la alineación en 16 bytes de forma predeterminada y, por lo tanto, utiliza la instrucción MOVAPS que puede llevar a la falla de segmentación.Instruct clang que Python se limita a la alineación en 8 bytes para usar la instrucción de los movimientos: más lento, pero no active un SIGSEGV si la memoria no está alineada en 16 bytes.Lamentablemente, la flag debe agregarse a ``cflags`` y no solo ``cflags_nodist``, ya que los extensiones de terceros C pueden tener el mismo problema.

source: `bpo-36605 <https://bugs.python.org/issue36605>`__: ``make tags`` and ``make TAGS`` now also parse ``Modules/_io/*.c`` and ``Modules/_io/*.h``.
es: `bpo-36605 <https://bugs.python.org/issue36605>`__: ``make tags`` y``make TAGS`` ahora también analizan ``Modules/_io/*.c`` y ``Modules/_io/*.h``.

source: `bpo-36465 <https://bugs.python.org/issue36465>`__: Release builds and debug builds are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro, which introduces the only ABI incompatibility. The ``Py_TRACE_REFS`` macro, which adds the :func:`sys.getobjects` function and the :envvar:`PYTHONDUMPREFS` environment variable, can be set using the new ``./configure --with-trace-refs`` build option.
es: `bpo-36465 <https://bugs.python.org/issue36465>`__: Las compilaciones de liberación y las compilaciones de depuración ahora son compatibles con ABI: definiendo la macro ``Py_DEBUG`` ya no implica la macro ``Py_TRACE_REFS``, queIntroduce la única incompatibilidad de ABI.La macro ``Py_TRACE_REFS``, que agrega el:func:`Sys.GetObjects` Función y la :envvar:`PythondumPrefs 'Variable de entorno, se puede configurar usando el nuevo ``./configure --with-trace-refs`` opción de construcción.

source: `bpo-36577 <https://bugs.python.org/issue36577>`__: setup.py now correctly reports missing OpenSSL headers and libraries again.
es: `bpo-36577 <https://bugs.python.org/issue36577>`__: setup.py ahora informa correctamente que faltan los encabezados y las bibliotecas de OpenSSL nuevamente.

source: `bpo-36544 <https://bugs.python.org/issue36544>`__: Fix regression introduced in `bpo-36146 <https://bugs.python.org/issue36146>`__ refactoring setup.py
es: `bpo-36544 <https://bugs.python.org/issue36544>`__: corrección de regresión introducida en `bpo-36146 <https://bugs.python.org/issue36146>`__ Refactoring Setup.py

source: `bpo-36508 <https://bugs.python.org/issue36508>`__: ``python-config --ldflags`` no longer includes flags of the ``LINKFORSHARED`` variable. The ``LINKFORSHARED`` variable must only be used to build executables.
es: `bpo-36508 <https://bugs.python.org/issue36508>`__: ``python-config --ldflags`` ya no incluye flags de la variable ``LINKFORSHARED``. La variable ``LINKFORSHARED`` debe utilizarse solo para construir ejecutables.

source: `bpo-36503 <https://bugs.python.org/issue36503>`__: Remove references to "aix3" and "aix4". Patch by M. Felt.
es: `bpo-36503 <https://bugs.python.org/issue36503>`__: Retire las referencias a "AIX3" y "AIX4". Parche por M. fieltro.

source: `bpo-35920 <https://bugs.python.org/issue35920>`__: Added platform.win32_edition() and platform.win32_is_iot(). Added support for cross-compiling packages for Windows ARM32. Skip tests that are not expected to work on Windows IoT Core ARM32.
es: `bpo-35920 <https://bugs.python.org/issue35920>`__: agregó la plataforma.win32_edition() y la plataforma.win32_is_iot().Añadido soporte para paquetes de compilación cruzada para Windows ARM32.Omitir pruebas que no se espera que funcionen en Windows Iot Core ARM32.

source: `bpo-36649 <https://bugs.python.org/issue36649>`__: Remove trailing spaces for registry keys when installed via the Store.
es: `bpo-36649 <https://bugs.python.org/issue36649>`__: Retire los espacios finales para las claves de registro cuando se instala a través de la tienda.

source: `bpo-34144 <https://bugs.python.org/issue34144>`__: Fixed activate.bat to correctly update codepage when chcp.com returns dots in output. Patch by Lorenz Mende.
es: `bpo-34144 <https://bugs.python.org/issue34144>`__: Se corrigió Activate.bat para actualizar correctamente el código de códigos cuando CHCP.com retorna puntos en la salida. Parche por Lorenz Mende.

source: `bpo-36509 <https://bugs.python.org/issue36509>`__: Added preset-iot layout for Windows IoT ARM containers. This layout doesn't contain UI components like tkinter or IDLE. It also doesn't contain files to support on-target builds since Windows ARM32 builds must be cross-compiled when using MSVC.
es: `bpo-36509 <https://bugs.python.org/issue36509>`__: Se agregó un diseño predefinido para los contenedores de ARM de Windows IOT.Este diseño no contiene componentes de UI como Tkinter o inactiva.Tampoco contiene archivos para admitir las compilaciones en destino, ya que las compilaciones de Windows ARM32 deben ser compiladas de forma cruzada cuando se usan MSVC.

source: `bpo-35941 <https://bugs.python.org/issue35941>`__: enum_certificates function of the ssl module now returns certificates from all available certificate stores inside windows in a query instead of returning only certificates from the system wide certificate store. This includes certificates from these certificate stores: local machine, local machine enterprise, local machine group policy, current user, current user group policy, services, users. ssl.enum_crls() function is changed in the same way to return all certificate revocation lists inside the windows certificate revocation list stores.
es: `bpo-35941 <https://bugs.python.org/issue35941>`__: enum_certificate Función del módulo SSL ahora retorna los certificados de todas las tiendas de certificados disponibles dentro de Windows en una consulta en lugar de retornar los certificados de la tienda de certificados de ancho.Esto incluye certificados de estas tiendas de certificados: Máquina local, Empresa local de máquinas, Política de grupo de máquinas local, Usuario actual, Política de grupos de usuarios actuales, Servicios, usuarios.La función SSL.ENUM_CRLS() se cambia de la misma manera para retornar todas las listas de revocación de certificados dentro de las tiendas de revocación de certificados de Windows.

source: `bpo-36441 <https://bugs.python.org/issue36441>`__: Fixes creating a venv when debug binaries are installed.
es: `bpo-36441 <https://bugs.python.org/issue36441>`__: corrige la creación de un VENV cuando se instalan los binarios de depuración.

source: `bpo-36085 <https://bugs.python.org/issue36085>`__: Enable better DLL resolution on Windows by using safe DLL search paths and adding :func:`os.add_dll_directory`.
es: `bpo-36085 <https://bugs.python.org/issue36085>`__: Habilite una mejor resolución de DLL en Windows usando rutas de búsqueda DLL seguras y agregando:func:`os.add_dll_directory`.

source: `bpo-36010 <https://bugs.python.org/issue36010>`__: Add the venv standard library module to the nuget distribution for Windows.
es: `bpo-36010 <https://bugs.python.org/issue36010>`__: agregue el módulo de la biblioteca estándar VENV a la distribución de Nuget para Windows.

source: `bpo-29515 <https://bugs.python.org/issue29515>`__: Add the following socket module constants on Windows: IPPROTO_AH IPPROTO_CBT IPPROTO_DSTOPTS IPPROTO_EGP IPPROTO_ESP IPPROTO_FRAGMENT IPPROTO_GGP IPPROTO_HOPOPTS IPPROTO_ICLFXBM IPPROTO_ICMPV6 IPPROTO_IDP IPPROTO_IGMP IPPROTO_IGP IPPROTO_IPV4 IPPROTO_IPV6 IPPROTO_L2TP IPPROTO_MAX IPPROTO_ND IPPROTO_NONE IPPROTO_PGM IPPROTO_PIM IPPROTO_PUP IPPROTO_RDP IPPROTO_ROUTING IPPROTO_SCTP IPPROTO_ST
es: `bpo-29515<https://bugs.python.org/issue29515>`__:Añadirlas siguientes constantesdel módulotomaen Windows:IPPROTO_AHIPPROTO_CBTIPPROTO_DSTOPTSIPPROTO_EGPIPPROTO_ESPIPPROTO_FRAGMENTIPPROTO_GGPIPPROTO_HOPOPTSIPPROTO_ICLFXBMIPPROTO_ICMPV6IPPROTO_IDPIPPROTO_IGMPIPPROTO_IGPIPPROTO_IPV4IPPROTO_IPV6IPPROTO_L2TPIPPROTO_MAXIPPROTO_NDIPPROTO_NONEIPPROTO_PGMIPPROTO_PIMIpproto_pup ipproto_rdp ipproto_routing ipproto_sctp ipproto_st

source: `bpo-35947 <https://bugs.python.org/issue35947>`__: Added current version of libffi to cpython-source-deps. Change _ctypes to use current version of libffi on Windows.
es: `bpo-35947 <https://bugs.python.org/issue35947>`__: Se agregó la versión actual de Libffi a Cypython-Source-Deps.Cambie _ctypes para utilizar la versión actual de Libffi en Windows.

source: `bpo-34060 <https://bugs.python.org/issue34060>`__: Report system load when running test suite on Windows. Patch by Ammar Askar. Based on prior work by Jeremy Kloth.
es: `bpo-34060 <https://bugs.python.org/issue34060>`__: Informe de carga del sistema al ejecutar la suite de prueba en Windows. Parche de Ammar Askar.Basado en el trabajo previo de Jeremy Kloth.

source: `bpo-31512 <https://bugs.python.org/issue31512>`__: With the Windows 10 Creators Update, non-elevated users can now create symlinks as long as the computer has Developer Mode enabled.
es: `bpo-31512 <https://bugs.python.org/issued31512>`__: Con la actualización de Windows 10 Creators, los usuarios no elevados ahora pueden crear enlaces simbólicos siempre que la computadora tenga habilitado el modo de desarrollador.

source: `bpo-34602 <https://bugs.python.org/issue34602>`__: Avoid failures setting macOS stack resource limit with resource.setrlimit. This reverts an earlier fix for `bpo-18075 <https://bugs.python.org/issue18075>`__ which forced a non-default stack size when building the interpreter executable on macOS.
es: `bpo-34602 <https://bugs.python.org/issue34602>`__: Evite fallas Configuración de Límite de recursos de pila de macos con recursos.setrlimit.Esto revierte una solución anterior para `bpo-18075 <https://bugs.python.org/issue18075>`__ que obligó a un tamaño de pila no predeterminado al crear el intérprete ejecutable en MacOS.

source: `bpo-36429 <https://bugs.python.org/issue36429>`__: Fix starting IDLE with pyshell. Add idlelib.pyshell alias at top; remove pyshell alias at bottom. Remove obsolete __name__=='__main__' command.
es: `bpo-36429 <https://bugs.python.org/issue36429>`__: Arreglo del comienzo de IDLE con pyshell. Añadir idlelib.pyshell alias en la parte superior;retire el alias de pyshell en la parte inferior. Eliminar el obsoleto __name__=='__main__'.

source: `bpo-14546 <https://bugs.python.org/issue14546>`__: Fix the argument handling in Tools/scripts/lll.py.
es: `bpo-14546 <https://bugs.python.org/issue14546>`__: Arregla el manejo del argumento en herramientas / scripts / lll.py.

source: `bpo-36763 <https://bugs.python.org/issue36763>`__: Fix memory leak in :c:func:`Py_SetStandardStreamEncoding`: release memory if the function is called twice.
es: `bpo-36763 <https://bugs.python.org/issue36763>`__: FIX FIGHT FOUT IN:c:func:`py_setstandststreamencoDing`: libere la función si la función se llama dos veces.

source: `bpo-36641 <https://bugs.python.org/issue36641>`__: :c:macro:`PyDoc_VAR(name)` and :c:macro:`PyDoc_STRVAR(name,str)` now create ``static const char name[]`` instead of ``static char name[]``. Patch by Inada Naoki.
es: `bpo-36641 <https://bugs.python.org/issue36641>`__: :c:macro:`PyDoc_VAR(name)` y :c:macro:`PyDoc_STRVAR(name,str)` Cree ``static const char name[]`` en lugar de ``static char name[]``. Parche por Inada Naoki.

source: `bpo-36389 <https://bugs.python.org/issue36389>`__: Change the value of ``CLEANBYTE``, ``DEADDYTE`` and ``FORBIDDENBYTE`` internal constants used by debug hooks on Python memory allocators (:c:func:`PyMem_SetupDebugHooks` function). Byte patterns ``0xCB``, ``0xDB`` and ``0xFB`` have been replaced with ``0xCD``, ``0xDD`` and ``0xFD`` to use the same values than Windows CRT debug ``malloc()`` and ``free()``.
es: `bpo-36389 <https://bugs.python.org/issue36389>`__: Cambie el valor de ``CLEANBYTE``, ``DEADDYTE`` y ``FORBIDDENBYTE`` asignadores (función :c:func:`PyMem_SetupDebugHooks`). Patrones de byte ``0xCB``, ``0xDB`` y ``0xFB`` ha sido reemplazado con ``0xCD``, ``0xDD`` y ``0xfd`` ``0xfd`` para usar los mismos valores que la depuración de Windows CRT ``malloc()`` y ``free()``.

source: `bpo-36443 <https://bugs.python.org/issue36443>`__: Since Python 3.7.0, calling :c:func:`Py_DecodeLocale` before :c:func:`Py_Initialize` produces mojibake if the ``LC_CTYPE`` locale is coerced and/or if the UTF-8 Mode is enabled by the user configuration. The LC_CTYPE coercion and UTF-8 Mode are now disabled by default to fix the mojibake issue. They must now be enabled explicitly (opt-in) using the new :c:func:`_Py_PreInitialize` API with ``_PyPreConfig``.
es: `bpo-36443 <https://bugs.python.org/issue36443>`__: desde Python 3.7.0, llamando:c:func:`PY_DECOTELOCIALE` ANTES:c:func:`PY_INITIALIZE` Produce Mojibake si el ``La configuración regional de LC_CTYPE` se coacciona y / o si el modo UTF-8 está habilitado por la configuración del usuario.El modo LC_CTYPE COERCION y UTF-8 ahora están deshabilitados de forma predeterminada para solucionar el problema del mojibake.Ahora deben estar habilitados explícitamente (Opt-in) utilizando el nuevo:c:func:`_py_preinitialize 'API con` `_pypreconfig``.
