Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-1613500 <https://bugs.python.org/issue1613500>`__: :class:`fileinput.FileInput` now uses the input file mode to correctly set the output file mode (previously it was hardcoded to ``'w```) when ``inplace=True`` is passed to its constructor.
es: `bpo-1613500 <https://bugs.python.org/issue113500>`__: :class:`fileinput.FileInput` ahora usa el modo de archivo de entrada para configurar correctamente el modo de archivo de salida (anteriormente fue codificado para ``'W'``) Cuando se ``inplace=True`` se pasa a su constructor.

source: `bpo-36734 <https://bugs.python.org/issue36734>`__: Fix compilation of ``faulthandler.c`` on HP-UX. Initialize ``stack_t current_stack`` to zero using ``memset()``.
es: `bpo-36734 <https://bugs.python.org/issue36734>`__: Arregla la compilación de ``faulthandler.c`` en HP-UX. Inicialice ``stack_t current_stack`` a cero usando ``memset()``.

source: `bpo-13611 <https://bugs.python.org/issue13611>`__: The xml.etree.ElementTree packages gained support for C14N 2.0 serialisation. Patch by Stefan Behnel.
es: `bpo-13611 <https://bugs.python.org/issue11611>`__: Los paquetes XML.Etrae.ElementTree ganaron soporte para la serialización C14N 2.0. Parche por Stefan Behons.

source: `bpo-36669 <https://bugs.python.org/issue36669>`__: Add missing matrix multiplication operator support to weakref.proxy.
es: `bpo-36669 <https://bugs.python.org/issue36669>`__: Añadir el soporte de operador de multiplicación de matriz faltante a WeeLREF.Proxy.

source: `bpo-36676 <https://bugs.python.org/issue36676>`__: The XMLParser() in xml.etree.ElementTree provides namespace prefix context to the parser target if it defines the callback methods "start_ns()" and/or "end_ns()". Patch by Stefan Behnel.
es: `bpo-36676 <https://bugs.python.org/issue36676>`__: xmlparser() en xml.etree.elementtree proporciona un contexto de prefijo de espacio de nombres al objetivo del analizador si define los métodos de devolución de llamada "START_NS()" y/ o "end_ns()". Parche por Stefan Behons.

source: `bpo-36673 <https://bugs.python.org/issue36673>`__: The TreeBuilder and XMLPullParser in xml.etree.ElementTree gained support for parsing comments and processing instructions. Patch by Stefan Behnel.
es: `bpo-36673 <https://bugs.python.org/issue36673>`__: The TreeBuilder y XmlpullParser en XML.Etrae.ElementTree ganó soporte para analizar comentarios y procesamiento de instrucciones. Parche por Stefan Behons.

source: `bpo-36650 <https://bugs.python.org/issue36650>`__: The C version of functools.lru_cache() was treating calls with an empty ``**kwargs`` dictionary as being distinct from calls with no keywords at all. This did not result in an incorrect answer, but it did trigger an unexpected cache miss.
es: `bpo-36650 <https://bugs.python.org/issue36650>`__: la versión C de functcools.lru_cache() estaba tratando las llamadas con un diccionario vacío ``**kwargs`` siendo distinto de las llamadas sinPalabras clave en absoluto.Esto no resultó en una respuesta incorrecta, pero desencadenó una falla de caché inesperada.

source: `bpo-28552 <https://bugs.python.org/issue28552>`__: Fix :mod:`distutils.sysconfig` if :data:`sys.executable` is ``None`` or an empty string: use :func:`os.getcwd` to initialize ``project_base``. Fix also the distutils build command: don't use :data:`sys.executable` if it is ``None`` or an empty string.
es: `bpo-28552 <https://bugs.python.org/issue28552>`__: Arreglada :mod:`distutils.sysconfig` si :data:`sys.executable` es ``None`` o una cadena vacía: use :func:`os.getcwd` para inicializar ``project_base``. Arregla también el comando de construcción de distectivos: no use :data:`sys.executable`. Si es ``None``. O una cadena vacía.

source: `bpo-35755 <https://bugs.python.org/issue35755>`__: :func:`shutil.which` and :func:`distutils.spawn.find_executable` now use ``os.confstr("CS_PATH")`` if available instead of :data:`os.defpath`, if the ``PATH`` environment variable is not set. Moreover, don't use ``os.confstr("CS_PATH")`` nor :data:`os.defpath` if the ``PATH`` environment variable is set to an empty string.
es: `bpo-35755 <https://bugs.python.org/issue35755>`__: :func:`shutil.which` y :func:`distutils.spawn.find_executable` ahora use ``os.confstr("CS_PATH")`` si está disponible en lugar de :data:`os.defpath`, si no se establece la variable de entorno, no use ``os.confstr("CS_PATH")`` y tampoco :data:`os.defpath` si la variable de entorno ``PATH`` se establece en una cadena vacía.

source: `bpo-25430 <https://bugs.python.org/issue25430>`__: improve performance of ``IPNetwork.__contains__()``
es: `bpo-25430 <https://bugs.python.org/issue25430>`__: Mejorar el rendimiento de ``IPNetwork.__contains__()``

source: `bpo-30485 <https://bugs.python.org/issue30485>`__: Path expressions in xml.etree.ElementTree can now avoid explicit namespace prefixes for tags (or the "{namespace}tag" notation) by passing a default namespace with an empty string prefix.
es: `bpo-30485 <https://bugs.python.org/issue30485>`__: Expresiones de ruta en XML.Etrae.elementTree ahora puede evitar los prefijos explícitos del espacio de nombres para las etiquetas (o la notación "{{espacio de nombres}") Pasando unespacio de nombres predeterminado con un prefijo de cadena vacía.

source: `bpo-36613 <https://bugs.python.org/issue36613>`__: Fix :mod:`asyncio` wait() not removing callback if exception
es: `bpo-36613 <https://bugs.python.org/issue36613>`__: corregir :mod:`asyncio` wait() no quitando la devolución de llamada si la excepción

source: `bpo-36598 <https://bugs.python.org/issue36598>`__: Fix ``isinstance`` check for Mock objects with spec when the code is executed under tracing. Patch by Karthikeyan Singaravelan.
es: `bpo-36598 <https://bugs.python.org/issue36598>`__: Arregla ``isinstance`` Compruebe si hay objetos simulados con especificaciones cuando el código se ejecuta bajo trazado. Parche por karthikeyan singaravelan.

source: `bpo-18748 <https://bugs.python.org/issue18748>`__: In development mode (:option:`-X` ``dev``) and in debug build, the :class:`io.IOBase` destructor now logs ``close()`` exceptions. These exceptions are silent by default in release mode.
es: `bpo-18748 <https://bugs.python.org/issue18748>`__: En el modo de desarrollo (: opción: `-x`` `dev.`) y en la construcción de depuración, la clase:`io.iobase'Destructor ahora registra' `Cerrar()` `excepciones.Estas excepciones están en silencio por defecto en el modo de liberación.

source: `bpo-36575 <https://bugs.python.org/issue36575>`__: The ``_lsprof`` module now uses internal timer same to ``time.perf_counter()`` by default. ``gettimeofday(2)`` was used on Unix. New timer has better resolution on most Unix platforms and timings are no longer impacted by system clock updates since ``perf_counter()`` is monotonic. Patch by Inada Naoki.
es: `bpo-36575 <https://bugs.python.org/issue36575>`__: el módulo ``_lsprof`` ahora usa el temporizador interno igual a ``time.perf_counter()`` de forma predeterminada.``gettimeofday(2)`` se usó en UNIX.El nuevo temporizador tiene una mejor resolución en la mayoría de las plataformas y los tiempos de la UNIX ya no se ven afectados por las actualizaciones del reloj del sistema ya que ``perf_counter()`` es monotónico. Parche por inada naoki.

source: `bpo-33461 <https://bugs.python.org/issue33461>`__: ``json.loads`` now emits ``DeprecationWarning`` when ``encoding`` option is specified. Patch by Matthias Bussonnier.
es: `bpo-33461 <https://bugs.python.org/issue33461>`__: ``json.loads`` ahora se emite ``deprecationwarning`` cuando se especifica la opción` `codificación".Parche por Matthias Bussonnier.

source: `bpo-36559 <https://bugs.python.org/issue36559>`__: The random module now prefers the lean internal _sha512 module over hashlib for seed(version=2) to optimize import time.
es: `bpo-36559 <https://bugs.python.org/issue36559>`__: El módulo aleatorio ahora prefiere el módulo _SHA512 interno Lean sobre Hashlib para semillas (versión = 2) para optimizar el tiempo de importación.

source: `bpo-17561 <https://bugs.python.org/issue17561>`__: Set backlog=None as the default for socket.create_server.
es: `bpo-17561 <https://bugs.python.org/issue17561>`__: Set Backlog=None como predeterminado para socket.create_server.

source: `bpo-34373 <https://bugs.python.org/issue34373>`__: Fix :func:`time.mktime` error handling on AIX for year before 1970.
es: `bpo-34373 <https://bugs.python.org/issue34373>`__: FIX:func:`Time.Mktime` Manejo de errores en AIX durante el año anterior a 1970.

source: `bpo-36232 <https://bugs.python.org/issue36232>`__: Improve error message when trying to open existing DBM database that actually doesn't exist. Patch by Marco Rougeth.
es: `bpo-36232 <https://bugs.python.org/issue36232>`__: Mejorar el mensaje de error al intentar abrir la base de datos DBM existente que en realidad no existe. Parche de Marco Rougeth.

source: `bpo-36546 <https://bugs.python.org/issue36546>`__: Add statistics.quantiles()
es: `bpo-36546 <https://bugs.python.org/issue36546>`__: Añadir estadísticas.Quantiles()

source: `bpo-36050 <https://bugs.python.org/issue36050>`__: Optimized ``http.client.HTTPResponse.read()`` for large response. Patch by Inada Naoki.
es: `bpo-36050 <https://bugs.python.org/issue36050>`__: optimizado ``http.client.HTTPResponse.read()`` para una gran respuesta. Parche por inada naoki.

source: `bpo-36522 <https://bugs.python.org/issue36522>`__: If *debuglevel* is set to >0 in :mod:`http.client`, print all values for headers with multiple values for the same header name. Patch by Matt Houglum.
es: `bpo-36522 <https://bugs.python.org/issue36522>`__: si *debuglevel* se establece en >0 en :mod:`http.client`, imprima todos los valores para encabezados con múltiples valores para el mismoNombre del encabezado. Parche por matt houglum.

source: `bpo-36492 <https://bugs.python.org/issue36492>`__: Deprecated passing required arguments like *func* as keyword arguments in functions which should accept arbitrary keyword arguments and pass them to other function. Arbitrary keyword arguments (even with names "self" and "func") can now be passed to these functions if the required arguments are passed as positional arguments.
es: `bpo-36492 <https://bugs.python.org/issue36492>`__: Apreciación de los argumentos requeridos como * FUNC * como argumentos de palabras clave en funciones que deben aceptar argumentos de palabras clave arbitrarias y pasarlas a otra función.Los argumentos de palabras clave arbitrarias (incluso con los nombres "y" FUNC ") ahora se pueden pasar a estas funciones si los argumentos requeridos se aprueban como argumentos posicionales.

source: `bpo-27181 <https://bugs.python.org/issue27181>`__: Add statistics.geometric_mean().
es: `bpo-27181 <https://bugs.python.org/issue27181>`__: Añadir estadísticas.geometric_mean().

source: `bpo-30427 <https://bugs.python.org/issue30427>`__: ``os.path.normcase()`` relies on ``os.fspath()`` to check the type of its argument. Redundant checks have been removed from its ``posixpath.normcase()`` and ``ntpath.normcase()`` implementations. Patch by Wolfgang Maier.
es: `bpo-30427 <https://bugs.python.org/issue30427>`__: ``os.path.normcase()`` se basa en ``os.fspath()`` Para verificar el tipo de su argumento.Los controles redundantes se han eliminado de su ``posixpath.normcase()`` y ``ntpath.normcase()`` implementaciones. Parche de Wolfgang Maier.

source: `bpo-36385 <https://bugs.python.org/issue36385>`__: Stop rejecting IPv4 octets for being ambiguously octal. Leading zeros are ignored, and no longer are assumed to specify octal octets. Octets are always decimal numbers. Octets must still be no more than three digits, including leading zeroes.
es: `bpo-36385 <https://bugs.python.org/issue36385>`__: Deja de rechazar los octetos IPv4 por ser ambiguo octal.Los ceros iniciales se ignoran, y ya no se supone que especifican octetos octales.Los octetos son siempre números decimales.Los octetos aún deben ser más de tres dígitos, incluidos los principales ceros.

source: `bpo-36434 <https://bugs.python.org/issue36434>`__: Errors during writing to a ZIP file no longer prevent to properly close it.
es: `bpo-36434 <https://bugs.python.org/issue36434>`__: Los errores durante la escritura en un archivo zip ya no evitan que la cierre correctamente.

source: `bpo-36407 <https://bugs.python.org/issue36407>`__: Fixed wrong indentation writing for CDATA section in xml.dom.minidom. Patch by Vladimir Surjaninov.
es: `bpo-36407 <https://bugs.python.org/issue36407>`__: Sección de sangría incorrecta fija para la sección CDATA en XML.DOMR.MINIDOM. Parche por vladimir surjaninov.

source: `bpo-36326 <https://bugs.python.org/issue36326>`__: inspect.getdoc() can now find docstrings for member objects when __slots__ is a dictionary.
es: `bpo-36326 <https://bugs.python.org/issue36326>`__: inspect.getdoc() ahora puede encontrar doces deductos para objetos miembros cuando __slots__ es un diccionario.

source: `bpo-36366 <https://bugs.python.org/issue36366>`__: Calling ``stop()`` on an unstarted or stopped :func:`unittest.mock.patch` object will now return `None` instead of raising :exc:`RuntimeError`, making the method idempotent. Patch by Karthikeyan Singaravelan.
es: `bpo-36366 <https://bugs.python.org/issue36366>`__: llamando ``parada()` `en un objeto inestable o detenido:func:`Unittest.mock.patch` Object ahora retornará `None` en lugar de elevar:exc:`RunTimeError`, haciendo el método Idempotente. Parche por karthikeyan singaravelan.

source: `bpo-36348 <https://bugs.python.org/issue36348>`__: The :meth:`imap.IMAP4.logout` method no longer ignores silently arbitrary exceptions.
es: `bpo-36348 <https://bugs.python.org/issue36348>`__: THE:meth:`imap.imap4.logout 'Método ya no ignora las excepciones arbitrarias en silencio.

source: `bpo-31904 <https://bugs.python.org/issue31904>`__: Add time module support and fix test_time faiures for VxWorks.
es: `bpo-31904 <https://bugs.python.org/issue31904>`__: Añadir el soporte del módulo de tiempo y corregir Faiures Test_Time para VXWORKS.

source: `bpo-36227 <https://bugs.python.org/issue36227>`__: Added support for keyword arguments `default_namespace` and `xml_declaration` in functions ElementTree.tostring() and ElementTree.tostringlist().
es: `bpo-36227 <https://bugs.python.org/issue36227>`__: Añadido soporte para los argumentos de la palabra 'default_namespace` y `xml_declaration` en funciones elementtree.tostring() y elementtree.tostringlist().

source: `bpo-36004 <https://bugs.python.org/issue36004>`__: Added new alternate constructors :meth:`datetime.date.fromisocalendar` and :meth:`datetime.datetime.fromisocalendar`, which construct date objects from ISO year, week number and weekday; these are the inverse of each class's ``isocalendar`` method. Patch by Paul Ganssle.
es: `bpo-36004 <https://bugs.python.org/issue36004>`__: Añadido nuevos constructores alternativos:meth:`DateTime.date.Date.fromisocalendar` y:meth:`DateTime.DateTime.fromisocalendar`, que construye objetos de fechade ISO Año, número de semana y semana laborable;Estos son los inversos del método ``isocalendar`` de cada clase. Parche por Paul Ganssle.

source: `bpo-35936 <https://bugs.python.org/issue35936>`__: :mod:`modulefinder` no longer depends on the deprecated :mod:`imp` module, and the initializer for :class:`modulefinder.ModuleFinder` now has immutable default arguments. Patch by Brandt Bucher.
es: `bpo-35936 <https://bugs.python.org/issue35936>`__: :mod:`modulefinder` ya no depende de la módulo en desuso :mod:`imp`, y el inicializador para :class:`Modulefinder.ModuleFinder` ahora tiene argumentos predeterminados inmutables. Parche por Brandt Bucher.

source: `bpo-35376 <https://bugs.python.org/issue35376>`__: :mod:`modulefinder` correctly handles modules that have the same name as a bad package. Patch by Brandt Bucher.
es: `bpo-35376 <https://bugs.python.org/issue35376>`__: :mod:`modulefinder` maneja correctamente los módulos que tienen el mismo nombre que un paquete incorrecto. Parche por Brandt Bucher.

source: `bpo-17396 <https://bugs.python.org/issue17396>`__: :mod:`modulefinder` no longer crashes when encountering syntax errors in followed imports. Patch by Brandt Bucher.
es: `bpo-17396 <https://bugs.python.org/issue17396>`__: :mod:`modulefinder` ya no se bloquea al encontrar los errores de sintaxis en las importaciones seguidas. Parche por Brandt Bucher.

source: `bpo-35934 <https://bugs.python.org/issue35934>`__: Added :meth:`~socket.create_server()` and :meth:`~socket.has_dualstack_ipv6()` convenience functions to automate the necessary tasks usually involved when creating a server socket, including accepting both IPv4 and IPv6 connections on the same socket. (Contributed by Giampaolo Rodola in :issue:`17561`.)
es: `bpo-35934 <https://bugs.python.org/issue35934>`__: Añadido:meth:`~ socket.create_server() 'y: methute:`~ socket.has_dualstack_ipv6()' Funciones de conveniencia para automatizar lo necesarioLas tareas generalmente involucradas al crear un socket de servidor, incluida la aceptación de conexiones IPv4 e IPv6 en el mismo socket.(Contribuido por Giampaolo Rodola en: Número: `17561.).

source: `bpo-23078 <https://bugs.python.org/issue23078>`__: Add support for :func:`classmethod` and :func:`staticmethod` to :func:`unittest.mock.create_autospec`. Initial patch by Felipe Ochoa.
es: `bpo-23078 <https://bugs.python.org/issue23078>`__: Añadir soporte para:func:`ClassMethod` y:func:`STATICMETHOD` a:func:`Unittest.mock.create_autospec`.Parche inicial por Felipe Ochoa.

source: `bpo-35416 <https://bugs.python.org/issue35416>`__: Fix potential resource warnings in distutils. Patch by Mickaël Schoentgen.
es: `bpo-35416 <https://bugs.python.org/issue35416>`__: Arregla las posibles advertencias de recursos en disturbios. Parche por Mickaël Schoentgen.

source: `bpo-25451 <https://bugs.python.org/issue25451>`__: Add transparency methods to :class:`tkinter.PhotoImage`. Patch by Zackery Spytz.
es: `bpo-25451 <https://bugs.python.org/issue25451>`__: Agregar métodos de transparencia a :class:`tkinter.photoimage`. Parche by Zackery Spytz.

source: `bpo-35082 <https://bugs.python.org/issue35082>`__: Don't return deleted attributes when calling dir on a :class:`unittest.mock.Mock`.
es: `bpo-35082 <https://bugs.python.org/issue35082>`__: No retorne los atributos eliminados cuando llame dir en una clase: 'Unittest.mock.mock`.

source: `bpo-34547 <https://bugs.python.org/issue34547>`__: :class:`wsgiref.handlers.BaseHandler` now handles abrupt client connection terminations gracefully. Patch by Petter Strandmark.
es: `bpo-34547 <https://bugs.python.org/issue34547>`__: :class:`wsgiref.handlers.basehandler` ahora maneja las terminaciones de conexión del cliente abrupto con gracia. Parche por Petter Strandmark.

source: `bpo-31658 <https://bugs.python.org/issue31658>`__: :func:`xml.sax.parse` now supports :term:`path-like <path-like object>`. Patch by Mickaël Schoentgen.
es: `bpo-31658 <https://bugs.python.org/issue31658>`__: :func:`xml.sax.parse` ahora Supports :term:`path-like <path-like object>`. Parche por Mickaël Schoentgen.

source: `bpo-34139 <https://bugs.python.org/issue34139>`__: Remove stale unix datagram socket before binding
es: `bpo-34139 <https://bugs.python.org/issue34139>`__: Retire la toma de datagramas Rancho Unix antes de la encuadernación

source: `bpo-33530 <https://bugs.python.org/issue33530>`__: Implemented Happy Eyeballs in `asyncio.create_connection()`. Added two new arguments, *happy_eyeballs_delay* and *interleave*, to specify Happy Eyeballs behavior.
es: `bpo-33530 <https://bugs.python.org/issue33530>`__: Implementó globos oculares felices en `asyncio.create_connection()`.Se agregaron dos nuevos argumentos, * happy_eyeballs_delay * y * intercaleado *, para especificar el comportamiento de los globos oculares.

source: `bpo-33291 <https://bugs.python.org/issue33291>`__: Do not raise AttributeError when calling the inspect functions isgeneratorfunction, iscoroutinefunction, isasyncgenfunction on a method created from an arbitrary callable. Instead, return False.
es: `bpo-33291 <https://bugs.python.org/issue33291>`__: No levante AtributeError cuando llame a las funciones de inspección ISEGENERATORFUNCIÓN, ISCOROutineFunction, IsaSyncgenFunction en un método creado a partir de un artículo árbitro.En su lugar, retorna falso.

source: `bpo-31310 <https://bugs.python.org/issue31310>`__: Fix the multiprocessing.semaphore_tracker so it is reused by child processes
es: `bpo-31310 <https://bugs.python.org/issue31310>`__: Arregla el multiprocesamiento.semaphore_tracker para que se reutilice los procesos secundarios

source: `bpo-31292 <https://bugs.python.org/issue31292>`__: Fix ``setup.py check --restructuredtext`` for files containing ``include`` directives.
es: `bpo-31292 <https://bugs.python.org/issue31292>`__: Arregla ``setup.py check --restructuredtext`` para archivos que contienen ``include``.

source: `bpo-36625 <https://bugs.python.org/issue36625>`__: Remove obsolete comments from docstrings in fractions.Fraction
es: `bpo-36625 <https://bugs.python.org/issue36625>`__: Eliminar los comentarios obsoletos de los doctras en Fractions.fraction

source: `bpo-30840 <https://bugs.python.org/issue30840>`__: Document relative imports
es: `bpo-30840 <https://bugs.python.org/issue30840>`__: Documento Importaciones relativas

source: `bpo-36523 <https://bugs.python.org/issue36523>`__: Add docstring for io.IOBase.writelines().
es: `bpo-36523 <https://bugs.python.org/issue36523>`__: Agregue Docstring para io.iobase.writelines().

source: `bpo-36425 <https://bugs.python.org/issue36425>`__: New documentation translation: `Simplified Chinese <https://docs.python.org/zh-cn/>`_.
es: `bpo-36425 <https://bugs.python.org/issue36425>`__: Nueva traducción de documentación: `Simplified Chinese <https://docs.python.org/zh-cn/>`_.

source: `bpo-36345 <https://bugs.python.org/issue36345>`__: Avoid the duplication of code from ``Tools/scripts/serve.py`` in using the :rst:dir:`literalinclude` directive for the basic wsgiref-based web server in the documentation of :mod:`wsgiref`. Contributed by Stéphane Wirtel.
es: `bpo-36345 <https://bugs.python.org/issue36345>`__: Evite la duplicación del código de ``Tools/scripts/serve.py`` en uso :rst:dir:`literalinclude` directiva para el servidor web basado en WSGIREF básico en la documentación de :mod:`WSGIREF`.Contribuido por Stéphane Wirtel.

source: `bpo-36345 <https://bugs.python.org/issue36345>`__: Using the code of the ``Tools/scripts/serve.py`` script as an example in the :mod:`wsgiref` documentation. Contributed by Stéphane Wirtel.
es: `bpo-36345 <https://bugs.python.org/issue36345>`__: Uso del código de la secuencia de comandos ``Herramientas / Scripts / SERVE.py`` como ejemplo en el :mod:`WSGIREF` Documentation.Contribuido por Stéphane Wirtel.

source: `bpo-36157 <https://bugs.python.org/issue36157>`__: Added Documention for PyInterpreterState_Main().
es: `bpo-36157 <https://bugs.python.org/issue36157>`__: Documentación agregada para PyntorRPretstate Main().

source: `bpo-33043 <https://bugs.python.org/issue33043>`__: Updates the docs.python.org page with the addition of a 'Contributing to Docs' link at the end of the page (between 'Reporting Bugs' and 'About Documentation'). Updates the 'Found a Bug' page with additional links and information in the Documentation Bugs section.
es: `bpo-33043 <https://bugs.python.org/issue33043>`__: actualiza la página Docs.python.org con la adición de un enlace 'Contribuyendo a Docs' al final de la página (entre 'informar errores'y' sobre la documentación ').Actualiza la página 'Encontrada un error' con enlaces y información adicionales en la sección de errores de documentación.
