Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-37420 <https://bugs.python.org/issue37420>`__: :func:`os.sched_setaffinity` now correctly handles errors that arise during iteration over its ``mask`` argument. Patch by Brandt Bucher.
es: `bpo-37420 <https://bugs.python.org/issue37420>`__: :func:`os.sched_setaffinity` ahora maneja correctamente los errores que surgen durante la iteración sobre su argumento ``mask``. Parche por Brandt Bucher.

source: `bpo-37412 <https://bugs.python.org/issue37412>`__: The :func:`os.getcwdb` function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows.
es: `bpo-37412 <https://bugs.python.org/issue37412>`__: la función:func:`OS.GETCWDB 'ahora usa la codificación UTF-8 en Windows, en lugar de la página de códigos ANSI: Consulte:pep:`529` para la justificación.La función ya no está en desuso en Windows.

source: `bpo-29412 <https://bugs.python.org/issue29412>`__: Fix IndexError in parsing a header value ending unexpectedly. Patch by Abhilash Raj.
es: `bpo-29412 <https://bugs.python.org/issue29412>`__: Fix indexError al analizar un valor de encabezado que termina inesperadamente. Parche por abhilash raj.

source: `bpo-36546 <https://bugs.python.org/issue36546>`__: The *dist* argument for statistics.quantiles() is now positional only. The current name doesn't reflect that the argument can be either a dataset or a distribution. Marking the parameter as positional avoids confusion and makes it possible to change the name later.
es: `bpo-36546 <https://bugs.python.org/issue36546>`__: el argumento * dist * para estadísticas.quantiles() ahora es posicional solamente.El nombre actual no refleja que el argumento puede ser un conjunto de datos o una distribución.Marcar el parámetro como posicional evita la confusión y hace posible cambiar el nombre más adelante.

source: `bpo-37394 <https://bugs.python.org/issue37394>`__: Fix a bug that was causing the :mod:`queue` module to fail if the accelerator module was not available. Patch by Pablo Galindo.
es: `bpo-37394 <https://bugs.python.org/issue37394>`__: Arregla un error que estaba causando el módulo de :mod:`queue` para fallar si el módulo de acelerador no estaba disponible. Parche de Pablo Galindo.

source: `bpo-33972 <https://bugs.python.org/issue33972>`__: Email with single part but content-type set to ``multipart/*`` doesn't raise AttributeError anymore.
es: `bpo-33972 <https://bugs.python.org/issue33972>`__: Correo electrónico con una parte sola, pero el tipo de contenido establecido en ``multipart/*`` no se levanta AtributeError.

source: `bpo-37280 <https://bugs.python.org/issue37280>`__: Use threadpool for reading from file for sendfile fallback mode.
es: `bpo-37280 <https://bugs.python.org/issue37280>`__: Use Threadpool para leer del archivo para el modo Fallback Sendfile.

source: `bpo-37279 <https://bugs.python.org/issue37279>`__: Fix asyncio sendfile support when sendfile sends extra data in fallback mode.
es: `bpo-37279 <https://bugs.python.org/issue37279>`__: Fix Asyncio Sendfile Soporte cuando SendFile envía datos adicionales en el modo Fallback.

source: `bpo-19865 <https://bugs.python.org/issue19865>`__: :func:`ctypes.create_unicode_buffer()` now also supports non-BMP characters on platforms with 16-bit :c:type:`wchar_t` (for example, Windows and AIX).
es: `bpo-19865 <https://bugs.python.org/issue19865>`__: :func:`ctypes.create_unicode_buffer()` Ahora también admite caracteres no BMP en plataformas con 16 bits :c:type:`wchar_t` (por ejemplo, Windows y AIX).

source: `bpo-37210 <https://bugs.python.org/issue37210>`__: Allow pure Python implementation of :mod:`pickle` to work even when the C :mod:`_pickle` module is unavailable.
es: `bpo-37210 <https://bugs.python.org/issue37210>`__: Permitir la implementación pura python de :mod:`pickle` para funcionar incluso cuando el módulo C :mod:`_pickle` no está disponible.

source: `bpo-35922 <https://bugs.python.org/issue35922>`__: Fix :meth:`RobotFileParser.crawl_delay` and :meth:`RobotFileParser.request_rate` to return ``None`` rather than raise :exc:`AttributeError` when no relevant rule is defined in the robots.txt file. Patch by Rémi Lapeyre.
es: `bpo-35922 <https://bugs.python.org/issued35922>`__: Fix:meth:`robotfilparser.crawl_delay` y: met:`robotfileparser.request_rate` para retornar ``None`` en lugar de subir: exc: `AttributeError` cuando no se define ninguna regla relevante en el archivo robots.txt. Parche por Rémi Lapeyre.

source: `bpo-35766 <https://bugs.python.org/issue35766>`__: Change the format of feature_version to be a (major, minor) tuple.
es: `bpo-35766 <https://bugs.python.org/issue35766>`__: Cambie el formato de Featur_version para ser una tupla (mayor, menor).

source: `bpo-36607 <https://bugs.python.org/issue36607>`__: Eliminate :exc:`RuntimeError` raised by :func:`asyncio.all_tasks()` if internal tasks weak set is changed by another thread during iteration.
es: `bpo-36607 <https://bugs.python.org/issue36607>`__: eliminate: excepto: `RunTeTimeError 'planteado por:func:`Asyncio.All_Tasks() `Si las tareas internas se cambian el conjunto.iteración.

source: `bpo-18748 <https://bugs.python.org/issue18748>`__: :class:`_pyio.IOBase` destructor now does nothing if getting the ``closed`` attribute fails to better mimick :class:`_io.IOBase` finalizer.
es: `bpo-18748 <https://bugs.python.org/issue18748>`__: :class:`_pyio.iobase` Destructor ahora no hace nada si obtener el atributo ``closed`` falla en imitar mejor :class:`_io.IOBase` finalizador.

source: `bpo-36402 <https://bugs.python.org/issue36402>`__: Fix a race condition at Python shutdown when waiting for threads. Wait until the Python thread state of all non-daemon threads get deleted (join all non-daemon threads), rather than just wait until non-daemon Python threads complete.
es: `bpo-36402 <https://bugs.python.org/issue36402>`__: Arregla una condición de carrera en Python Apagado al esperar hilos.Espere hasta que se elimine el estado de hilo de Python de todos los hilos no demonios (Únase a todos los hilos no demonios), en lugar de esperar hasta que se completen los hilos de Python de Daemon.

source: `bpo-34886 <https://bugs.python.org/issue34886>`__: Fix an unintended ValueError from :func:`subprocess.run` when checking for conflicting `input` and `stdin` or `capture_output` and `stdout` or `stderr` args when they were explicitly provided but with `None` values within a passed in `**kwargs` dict rather than as passed directly by name. Patch contributed by Rémi Lapeyre.
es: `bpo-34886 <https://bugs.python.org/issue34886>`__: Arregla un ValueError no deseado de:func:`Subprocess.Run` al verificar la entrada en conflicto `input` y `stdin` o` capture_output` y`stdout` o 'stderr' argina cuando se proporcionaron explícitamente, pero con los valores de `None` se les pasa en "** kwargs` DICT en lugar de que se pase directamente por su nombre.Patch aportado por Rémi Lapeyre.

source: `bpo-37173 <https://bugs.python.org/issue37173>`__: The exception message for ``inspect.getfile()`` now correctly reports the passed class rather than the builtins module.
es: `bpo-37173 <https://bugs.python.org/issue37173>`__: El mensaje de excepción para ``inspect.getfile()`` ahora informa correctamente la clase aprobada en lugar del módulo incorporado.

source: `bpo-37178 <https://bugs.python.org/issue37178>`__: Give math.perm() a one argument form that means the same as math.factorial().
es: `bpo-37178 <https://bugs.python.org/issue37178>`__: Dale matemath.perm() una forma de argumento que significa lo mismo que Matemáticas. Factorial().

source: `bpo-37178 <https://bugs.python.org/issue37178>`__: For math.perm(n, k), let k default to n, giving the same result as factorial.
es: `bpo-37178 <https://bugs.python.org/issue37178>`__: para math.perm (n, k), permita que K dedefa n, dando el mismo resultado que factorial.

source: `bpo-37163 <https://bugs.python.org/issue37163>`__: Deprecated passing ``obj`` argument of :func:`dataclasses.replace` as keyword argument.
es: `bpo-37163 <https://bugs.python.org/issue37163>`__: Pasaje desaprobado ``obj`` argumento de:func:`DataClasses.replace` como argumento de la palabra clave.

source: `bpo-37165 <https://bugs.python.org/issue37165>`__: Converted _collections._count_elements to use the Argument Clinic.
es: `bpo-37165 <https://bugs.python.org/issue37165>`__: convertido _collections._count_elements para usar la clínica argument.

source: `bpo-34767 <https://bugs.python.org/issue34767>`__: Do not always create a :class:`collections.deque` in :class:`asyncio.Lock`.
es: `bpo-34767 <https://bugs.python.org/issue34767>`__: No siempre creas una clase :class:`colecciones.deque` en :class:`asyncio.Lock`.

source: `bpo-37158 <https://bugs.python.org/issue37158>`__: Speed-up statistics.fmean() by switching from a function to a generator.
es: `bpo-37158 <https://bugs.python.org/issue37158>`__: statistics.fmean() cambiando de una función a un generador.

source: `bpo-37150 <https://bugs.python.org/issue37150>`__: `argparse._ActionsContainer.add_argument` now throws error, if someone accidentally pass FileType class object instead of instance of FileType as `type` argument
es: `bpo-37150 <https://bugs.python.org/issue37150>`__: 'argparse._actionscontainer.add_argument' ahora lanza un error, si alguien pasa accidentalmente el objeto de clase FileType en lugar de instancia de FileType como argumento "Tipo"

source: `bpo-35621 <https://bugs.python.org/issue35621>`__: Support running asyncio subprocesses when execution event loop in a thread on UNIX.
es: `bpo-35621 <https://bugs.python.org/issue35621>`__: Soporte ejecutando subprocesos de asyncio cuando la ejecución del evento se basa en un hilo en UNIX.

source: `bpo-36520 <https://bugs.python.org/issue36520>`__: Lengthy email headers with UTF-8 characters are now properly encoded when they are folded. Patch by Jeffrey Kintscher.
es: `bpo-36520 <https://bugs.python.org/issue36520>`__: Los encabezados de correo electrónico largos con los caracteres UTF-8 ahora están correctamente codificados cuando están plegados. Parche por jeffrey kintscher.

source: `bpo-30835 <https://bugs.python.org/issue30835>`__: Fixed a bug in email parsing where a message with invalid bytes in content-transfer-encoding of a multipart message can cause an AttributeError. Patch by Andrew Donnellan.
es: `bpo-30835 <https://bugs.python.org/issue3835>`__: Se corrigió un error en el análisis de correo electrónico donde un mensaje con bytes inválidos en la codificación de transferencia de contenido de un mensaje multipart puede causar un AtributeError. Parche por Andrew Donnellan.

source: `bpo-35805 <https://bugs.python.org/issue35805>`__: Add parser for Message-ID header and add it to default HeaderRegistry. This should prevent folding of Message-ID using RFC 2048 encoded words.
es: `bpo-35805 <https://bugs.python.org/issue35805>`__: Agregue el analizador para el encabezado de ID de mensaje y agréguelo al encabezado predeterminado.Esto debe evitar el plegado del mensaje de mensaje utilizando las palabras codificadas RFC 2048.

source: `bpo-35070 <https://bugs.python.org/issue35070>`__: posix.getgrouplist() now works correctly when the user belongs to NGROUPS_MAX supplemental groups. Patch by Jeffrey Kintscher.
es: `bpo-35070 <https://bugs.python.org/issue35070>`__: posix.getgroupplist() ahora funciona correctamente cuando el usuario pertenece a los grupos suplementarios ngroups_max. Parche por jeffrey kintscher.

source: `bpo-32627 <https://bugs.python.org/issue32627>`__: Fix compile error when ``_uuid`` headers conflicting included.
es: `bpo-32627 <https://bugs.python.org/issue32627>`__: Arregla el error de compilación cuando ``_UUID`` Encabezados encabezados incluidos.

source: `bpo-11122 <https://bugs.python.org/issue11122>`__: Distutils won't check for rpmbuild in specified paths only.
es: `bpo-11122 <https://bugs.python.org/issue1122>`__: Los distectivos no verifican para RPMBuild solo en rutas específicas.

source: `bpo-4963 <https://bugs.python.org/issue4963>`__: Fixed non-deterministic behavior related to mimetypes extension mapping and module reinitialization.
es: `bpo-4963 <https://bugs.python.org/issue4963>`__: Comportamiento no determinista fijo relacionado con Mimetypes Mapeo de extensión y reinicialización del módulo.

source: `bpo-34903 <https://bugs.python.org/issue34903>`__: Documented that in :meth:`datetime.datetime.strptime()`, the leading zero in some two-digit formats is optional. Patch by Mike Gleen.
es: `bpo-34903 <https://bugs.python.org/issue34903>`__: Documentó que en:meth:`DateTime.DateTime.treptime()`, el cero inicial en algunos formatos de dos dígitos es opcional. Parche por mike gleen.

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_distutils.test_build_ext() is now able to remove the temporary directory on Windows: don't import the newly built C extension ("xx") in the current process, but test it in a separated process.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_distutils.test_build_ext() ahora puede eliminar el directorio temporal en Windows: no importe la extensión C de nueva construcción ("XX")En el proceso actual, pero la prueba en un proceso separado.

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_concurrent_futures now cleans up multiprocessing to remove immediately temporary directories created by multiprocessing.util.get_temp_dir().
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_concurrent_futures ahora limpia multiprocesamiento para eliminar los directorios temporales inmediatamente creados por multiprocessing.util.get_temp_dir().

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_winconsoleio doesn't leak a temporary file anymore: use tempfile.TemporaryFile() to remove it when the test completes.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_winconsoleo no fuge un archivo temporal: use tempfile.temporaryfile() para eliminarlo cuando se completa la prueba.

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: multiprocessing tests now explicitly call ``_run_finalizers()`` to immediately remove temporary directories created by tests.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: Las pruebas de multiprocesamiento ahora llaman explícitamente ``_run_finalizers()`` Para eliminar inmediatamente los directorios temporales creados por las pruebas.

source: `bpo-37199 <https://bugs.python.org/issue37199>`__: Fix test failures when IPv6 is unavailable or disabled.
es: `bpo-37199 <https://bugs.python.org/issue37199>`__: Fallas de prueba de reparación cuando IPv6 no está disponible o deshabilitada.

source: `bpo-37335 <https://bugs.python.org/issue37335>`__: Remove no longer necessary code from c locale coercion tests
es: `bpo-37335 <https://bugs.python.org/issue37335>`__: Eliminar ya no sea necesario el código de las pruebas de coerción de Cifale

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: Fix test_shutil to no longer leak temporary files.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: Fix test_shutil para que ya no filtran archivos temporales.

source: `bpo-37411 <https://bugs.python.org/issue37411>`__: Fix test_wsgiref.testEnviron() to no longer depend on the environment variables (don't fail if "X" variable is set).
es: `bpo-37411 <https://bugs.python.org/issue37411>`__: Fix test_wsgiref.testenviron() ya no depende de las variables de entorno (no fallan si se establece la variable "x").

source: `bpo-37400 <https://bugs.python.org/issue37400>`__: Fix test_os.test_chown(): use os.getgroups() rather than grp.getgrall() to get groups. Rename also the test to test_chown_gid().
es: `bpo-37400 <https://bugs.python.org/issue37400>`__: Fix test_os.test_chown(): use os.getgroups() en lugar de grip.getgrall() para obtener grupos.Cambie el nombre también la prueba de test_chown_gid().

source: `bpo-37359 <https://bugs.python.org/issue37359>`__: Add --cleanup option to python3 -m test to remove ``test_python_*`` directories of previous failed jobs. Add "make cleantest" to run ``python3 -m test --cleanup``.
es: `bpo-37359 <https://bugs.python.org/issue37359> '__: Agregar opción --cleanup a python3 -m test para eliminar directorios ``test_python_*`` de trabajos fallidos anteriormente. Agrega "make cleantest" para ejecutar ``python3 -m test --cleanup``.

source: `bpo-37362 <https://bugs.python.org/issue37362>`__: test_gdb no longer fails if it gets an "unexpected" message on stderr: it now ignores stderr. The purpose of test_gdb is to test that python-gdb.py commands work as expected, not to test gdb.
es: `bpo-37362 <https://bugs.python.org/issue37362>`__: test_gdb Ya no falla si obtiene un mensaje "inesperado" en STDERR: ahora ignora el STDERR.El propósito de Test_GDB es probar que los comandos de Python-gdb.py funcionan como se esperan, no para probar GDB.

source: `bpo-35998 <https://bugs.python.org/issue35998>`__: Avoid TimeoutError in test_asyncio: test_start_tls_server_1()
es: `bpo-35998 <https://bugs.python.org/issue35998>`__: Evite el tiempo de espera en test_asyncio: test_start_tls_server_1()

source: `bpo-37278 <https://bugs.python.org/issue37278>`__: Fix test_asyncio ProactorLoopCtrlC: join the thread to prevent leaking a running thread and leaking a reference.
es: `bpo-37278 <https://bugs.python.org/issue37278>`__: Fix test_asyncio proactorloopctrlc: Únase al hilo para evitar fugarse de un hilo en funcionamiento y fugarse de una referencia.

source: `bpo-37261 <https://bugs.python.org/issue37261>`__: Fix :func:`test.support.catch_unraisable_exception`: its __exit__() method now ignores unraisable exception raised when clearing its ``unraisable`` attribute.
es: `bpo-37261 <https://bugs.python.org/issue37261>`__: corregir: func: `test.support.catch_unraisable_exception`: su método __exit__() ahora ignora la excepción unraisable elevada al borrar su" unrano ".atributo.

source: `bpo-37169 <https://bugs.python.org/issue37169>`__: Rewrite ``_PyObject_IsFreed()`` unit tests.
es: `bpo-37169 <https://bugs.python.org/issue37169>`__: reescribe ``_PyObject_IsFreed()`` Pruebas de unidad.

source: `bpo-37153 <https://bugs.python.org/issue37153>`__: ``test_venv.test_mutiprocessing()`` now explicitly calls ``pool.terminate()`` to wait until the pool completes.
es: `bpo-37153 <https://bugs.python.org/issue37153>`__: ``test_venv.test_mutiprocessing()`` ahora llama explícitamente ``pool.terminate()`` Para esperar hasta que se complete la piscina.

source: `bpo-28009 <https://bugs.python.org/issue28009>`__: Modify the test_uuid logic to test when a program is available AND can be used to obtain a MACADDR as basis for an UUID. Patch by M. Felt
es: `bpo-28009 <https://bugs.python.org/issue28009>`__: Modifique la lógica Test_uuid para probar cuando hay un programa disponible y se puede usar para obtener un MacAdDR como base para un UUID. Parche por M. fieltro

source: `bpo-37189 <https://bugs.python.org/issue37189>`__: Many ``PyRun_XXX()`` functions like :c:func:`PyRun_String` were no longer exported in ``libpython38.dll`` by mistake. Export them again to fix the ABI compatibiliy.
es: `bpo-37189 <https://bugs.python.org/issue37189>`__: muchos ``PyRun_XXX()`` Funciones como :c:func:`PyRun_String` ya no se exportaron en ``libpython38.dll`` por error. Explícalos de nuevo para arreglar el ABI Compatibiliy.

source: `bpo-10945 <https://bugs.python.org/issue10945>`__: Officially drop support for creating bdist_wininst installers on non-Windows systems.
es: `bpo-10945 <https://bugs.python.org/issue10945>`__: Drop Support Oficial para crear instaladores BDIST_WININST en sistemas que no son de Windows.

source: `bpo-37369 <https://bugs.python.org/issue37369>`__: Fixes path for :data:`sys.executable` when running from the Microsoft Store.
es: `bpo-37369 <https://bugs.python.org/issue37369>`__: corrige la ruta para: Datos: `sys.executable` cuando se ejecuta desde la tienda de Microsoft.

source: `bpo-37351 <https://bugs.python.org/issue37351>`__: Removes libpython38.a from standard Windows distribution.
es: `bpo-37351 <https://bugs.python.org/issue37351>`__: elimina a libpython38.a de la distribución estándar de Windows.

source: `bpo-35360 <https://bugs.python.org/issue35360>`__: Update Windows builds to use SQLite 3.28.0.
es: `bpo-35360 <https://bugs.python.org/issue35360>`__: Actualizar Windows se basa en usar SQLite 3.28.0.

source: `bpo-37267 <https://bugs.python.org/issue37267>`__: On Windows, :func:`os.dup` no longer creates an inheritable fd when handling a character file.
es: `bpo-37267 <https://bugs.python.org/issue37267>`__: en Windows,:func:`OS.DUP 'ya no crea un FD heredable al manejar un archivo de caracteres.

source: `bpo-36779 <https://bugs.python.org/issue36779>`__: Ensure ``time.tzname`` is correct on Windows when the active code page is set to CP_UTF7 or CP_UTF8.
es: `bpo-36779 <https://bugs.python.org/issue36779>`__: Asegúrese de ``time.tzname`` es correcto en Windows cuando la página de códigos activa se establece en CP_UTF7 o CP_UTF8.

source: `bpo-34602 <https://bugs.python.org/issue34602>`__: Avoid test suite failures on macOS by no longer calling resource.setrlimit to increase the process stack size limit at runtime. The runtime change is no longer needed since the interpreter is being built with a larger default stack size.
es: `bpo-34602 <https://bugs.python.org/issue34602>`__: Evite las fallas de la suite de prueba en MacOS ya que no llame a los recursos.setrlimit para aumentar el límite de tamaño de la pila de procesos en tiempo de ejecución.El cambio de tiempo de ejecución ya no es necesario, ya que el intérprete se está construyendo con un tamaño de pila predeterminado más grande.

source: `bpo-35360 <https://bugs.python.org/issue35360>`__: Update macOS installer to use SQLite 3.28.0.
es: `bpo-35360 <https://bugs.python.org/issue35360>`__: Actualice MacOS Installer para usar SQLite 3.28.0.

source: `bpo-34631 <https://bugs.python.org/issue34631>`__: Updated OpenSSL to 1.1.1c in macOS installer.
es: `bpo-34631 <https://bugs.python.org/issue34631>`__: Actualizado OpenSSL a 1.1.1C en el instalador de MacOS.

source: `bpo-37325 <https://bugs.python.org/issue37325>`__: Fix tab focus traversal order for help source and custom run dialogs.
es: `bpo-37325 <https://bugs.python.org/issue37325>`__: Fix Pesta Focus Focus Traversal Pedido para obtener información sobre la fuente de ayuda y los cuadros de diálogos de ejecución personalizada.

source: `bpo-37321 <https://bugs.python.org/issue37321>`__: Both subprocess connection error messages now refer to the 'Startup failure' section of the IDLE doc.
es: `bpo-37321 <https://bugs.python.org/issue37321>`__: ambos mensajes de error de conexión de subproceso ahora se refieren a la sección 'Fallo de inicio' del DOC inactivo.

source: `bpo-37177 <https://bugs.python.org/issue37177>`__: Properly 'attach' search dialogs to their main window so that they behave like other dialogs and do not get hidden behind their main window.
es: `bpo-37177 <https://bugs.python.org/issue37177>`__: Ajuste correctamente 'Adjuntar' cuadros de búsqueda a su ventana principal para que se comporten como otros cuadros de diálogos y no se oculten detrás de su ventana principal.

source: `bpo-37039 <https://bugs.python.org/issue37039>`__: Adjust "Zoom Height" to individual screens by momemtarily maximizing the window on first use with a particular screen. Changing screen settings may invalidate the saved height. While a window is maximized, "Zoom Height" has no effect.
es: `bpo-37039 <https://bugs.python.org/issue37039>`__: Ajuste "Altura de zoom" a las pantallas individuales al maximizar momementariamente la ventana en primer uso con una pantalla en particular.Cambiar la configuración de la pantalla puede invalidar la altura guardada.Mientras se maximiza una ventana, "zoom altura" no tiene efecto.
