Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-37120 <https://bugs.python.org/issue37120>`__: Add SSLContext.num_tickets to control the number of TLSv1.3 session tickets.
es: `bpo-37120 <https://bugs.python.org/issue37120>`__: Agregue sslcontext.num_tickets para controlar el número de boletos de sesión TLSV1.3.

source: `bpo-12202 <https://bugs.python.org/issue12202>`__: Fix the error handling in :meth:`msilib.SummaryInformation.GetProperty`. Patch by Zackery Spytz.
es: `bpo-12202 <https://bugs.python.org/issue12202>`__: Arregla el manejo de errores en:meth:`MSilib.SummaryInformation.getProperty`. Parche by Zackery Spytz.

source: `bpo-26835 <https://bugs.python.org/issue26835>`__: The fcntl module now contains file sealing constants for sealing of memfds.
es: `bpo-26835 <https://bugs.python.org/issue26835>`__: El módulo FCNTL ahora contiene constantes de sellado de archivos para sellar de MMAFDS.

source: `bpo-29262 <https://bugs.python.org/issue29262>`__: Add ``get_origin()`` and ``get_args()`` introspection helpers to ``typing`` module.
es: `bpo-29262 <https://bugs.python.org/issue29262>`__: Agrega ``get_origin()`` y ``get_args()`` ayudantes de la introspección al módulo ``typing``.

source: `bpo-12639 <https://bugs.python.org/issue12639>`__: :meth:`msilib.Directory.start_component()` no longer fails if *keyfile* is not ``None``.
es: `bpo-12639 <https://bugs.python.org/issued12639>`__: :meth:`msilib.Directory.sart_component()` Ya no falla si *keyfile* no es ``None``.

source: `bpo-36999 <https://bugs.python.org/issue36999>`__: Add the ``asyncio.Task.get_coro()`` method to publicly expose the tasks's coroutine object.
es: `bpo-36999 <https://bugs.python.org/issue36999>`__: Agrega el método ``asyncio.Task.get_coro()`` para exponer públicamente el objeto coroutine de las tareas.

source: `bpo-35246 <https://bugs.python.org/issue35246>`__: Make :func:`asyncio.create_subprocess_exec` accept path-like arguments.
es: `bpo-35246 <https://bugs.python.org/issue35246>`__: HAGA:func:`asyncio.create_subprocess_exec` acepta argumentos similares a la ruta.

source: `bpo-35279 <https://bugs.python.org/issue35279>`__: Change default *max_workers* of ``ThreadPoolExecutor`` from ``cpu_count() * 5`` to ``min(32, cpu_count() + 4))``. Previous value was unreasonably large on many cores machines.
es: `bpo-35279 <https://bugs.python.org/issue35279>`__: Cambio predeterminado *max_workers* de ``ThreadPoolExecutor`` de ``cpu_count() * 5`` a ``min(32, cpu_count() + 4))``.El valor anterior fue injustificadamente grande en muchas máquinas de núcleos.

source: `bpo-37076 <https://bugs.python.org/issue37076>`__: :func:`_thread.start_new_thread` now logs uncaught exception raised by the function using :func:`sys.unraisablehook`, rather than :func:`sys.excepthook`, so the hook gets access to the function which raised the exception.
es: `bpo-37076 <https://bugs.python.org/issue37076>`__: :func:`_thread.sart_new_thread` ahora registra la excepción no captada planteada por la función usando :func:`sys.unraisablehook`, en lugar de :func:'sys.excepthook`, por lo que el gancho obtiene acceso a la función que elevó la excepción.

source: `bpo-33725 <https://bugs.python.org/issue33725>`__: On macOS, the :mod:`multiprocessing` module now uses *spawn* start method by default.
es: `bpo-33725 <https://bugs.python.org/issue33725>`__: en MacOS, el módulo :mod:`multiprocessing` ahora usa *spawn* start Methody de forma predeterminada.

source: `bpo-37054 <https://bugs.python.org/issue37054>`__: Fix destructor :class:`_pyio.BytesIO` and :class:`_pyio.TextIOWrapper`: initialize their ``_buffer`` attribute as soon as possible (in the class body), because it's used by ``__del__()`` which calls ``close()``.
es: `bpo-37054 <https://bugs.python.org/issue37054>`__: Fix destructor :class:`_pyio.BytesIO` y :class:`_pyio.textiowrapper`: Inicialice su atributo ``_buffer`` lo más posible (en el cuerpo de la clase), porque se usa por ``__del__()`` que llama ``close()``.

source: `bpo-37058 <https://bugs.python.org/issue37058>`__: PEP 544: Add ``Protocol`` and ``@runtime_checkable`` to the ``typing`` module.
es: `bpo-37058 <https://bugs.python.org/issue37058>`__: PEP 544: Agregar ``Protocol`` y ``@runtime_checkable`` al módulo ``typing``.

source: `bpo-36933 <https://bugs.python.org/issue36933>`__: The functions ``sys.set_coroutine_wrapper`` and ``sys.get_coroutine_wrapper`` that were deprecated and marked for removal in 3.8 have been removed.
es: `bpo-36933 <https://bugs.python.org/issue36933>`__: Las funciones ``sys.set_coroutine_wrapper`` y ``sys.get_coroutine_wrapper`` que estaban desaprobados y marcados para la eliminación en 3.8 se han eliminado.

source: `bpo-37047 <https://bugs.python.org/issue37047>`__: Handle late binding and attribute access in :class:`unittest.mock.AsyncMock` setup for autospeccing. Document newly implemented async methods in :class:`unittest.mock.MagicMock`.
es: `bpo-37047 <https://bugs.python.org/issue37047>`__: maneje la encuadernación tardía y el acceso a los atributos en :class:`unittest.mock.AsyncMock` Configuración de autofaccing.Documento Nuevamente implementado Métodos ASYNC en :class:`unittest.Mock.MagicMock`.

source: `bpo-37049 <https://bugs.python.org/issue37049>`__: PEP 589: Add ``TypedDict`` to the ``typing`` module.
es: `bpo-37049 <https://bugs.python.org/issue37049>`__: PEP 589: Agregue '' TypeedDict`` al módulo ``typing``.

source: `bpo-37046 <https://bugs.python.org/issue37046>`__: PEP 586: Add ``Literal`` to the ``typing`` module.
es: `bpo-37046 <https://bugs.python.org/issue37046>`__: PEP 586: Agregue ``Literal`` al módulo ``typing``.

source: `bpo-37045 <https://bugs.python.org/issue37045>`__: PEP 591: Add ``Final`` qualifier and ``@final`` decorator to the ``typing`` module.
es: `bpo-37045 <https://bugs.python.org/issue37045>`__: PEP 591: Agregar ``Final`` calificador y ``@final`` decorator al módulo ``typing``.

source: `bpo-37035 <https://bugs.python.org/issue37035>`__: Don't log OSError based exceptions if a fatal error has occurred in asyncio transport. Peer can generate almost any OSError, user cannot avoid these exceptions by fixing own code. Errors are still propagated to user code, it's just logging them is pointless and pollute asyncio logs.
es: `bpo-37035 <https://bugs.python.org/issue37035>`__: no registre las excepciones basadas en oserror si se ha producido un error fatal en el transporte de asyncio.Peer puede generar casi cualquier Oserror, el usuario no puede evitar estas excepciones al reparar el código propio.Los errores aún se propagan con el código de usuario, solo se está registrando es inútil y contaminar los registros de Asyncio.

source: `bpo-37001 <https://bugs.python.org/issue37001>`__: :func:`symtable.symtable` now accepts the same input types for source code as the built-in :func:`compile` function. Patch by Dino Viehland.
es: `bpo-37001 <https://bugs.python.org/issue37001>`__: :func:`symtable.symtable` ahora acepta los mismos tipos de entrada para el código fuente que la función incorporada función :func:`compile`. Parche por Dino Viehland.

source: `bpo-37028 <https://bugs.python.org/issue37028>`__: Implement asyncio REPL
es: `bpo-37028 <https://bugs.python.org/issue37028>`__: implementar asyncio rewl

source: `bpo-37027 <https://bugs.python.org/issue37027>`__: Return safe to use proxy socket object from transport.get_extra_info('socket')
es: `bpo-37027 <https://bugs.python.org/issue37027>`__: retorne a ser seguro para usar el objeto de socket proxy de TRANSPER.GET_EXTRA_INFO ('SOCKET')

source: This will address the common mistake many asyncio users make: an "except Exception" clause breaking Tasks cancellation.
es: Esto abordará el error común que los usuarios de Asyncio hacen: una cláusula "excepto excepto" de la cancelación de las tareas.

source: In addition to this change, we stop inheriting asyncio.TimeoutError and asyncio.InvalidStateError from their concurrent.futures.* counterparts. There's no point for these exceptions to share the inheritance chain.
es: Además de este cambio, dejamos de herir a Asyncio.TimeOuterRor y Asyncio.InvalidStateError de su concurrente. * Contrapartes.No tiene sentido estas excepciones compartir la cadena de herencia.

source: `bpo-1230540 <https://bugs.python.org/issue1230540>`__: Add a new :func:`threading.excepthook` function which handles uncaught :meth:`threading.Thread.run` exception. It can be overridden to control how uncaught :meth:`threading.Thread.run` exceptions are handled.
es: `bpo-1230540 <https://bugs.python.org/issue1230540>`__: Agregar un nuevo:func:`THRINKING.EXCEPHOOK 'FUNCIÓN QUE SE MANA UNA HACIENDOTE:meth:`Threading.Thread.run` Except.Puede ser anulado para controlar lo desconocido:methThread.Thing.Thing.Rad.Run 'excepciones.

source: `bpo-36996 <https://bugs.python.org/issue36996>`__: Handle :func:`unittest.mock.patch` used as a decorator on async functions.
es: `bpo-36996 <https://bugs.python.org/issue36996>`__: Manija:func:`Unittest.mock.patch 'se usa como decorador en las funciones de Async.

source: `bpo-37008 <https://bugs.python.org/issue37008>`__: Add support for calling :func:`next` with the mock resulting from :func:`unittest.mock.mock_open`
es: `bpo-37008 <https://bugs.python.org/issue37008>`__: Agregar soporte para llamar:func:`Siguiente 'con el burno resultante de:func:`Unittest.mock.mock_open`

source: `bpo-27737 <https://bugs.python.org/issue27737>`__: Allow whitespace only header encoding in ``email.header`` - by Batuhan Taskaya
es: `bpo-27737 <https://bugs.python.org/issue27737>`__: Permitir que el espacio en blanco solo codifican en ``email.header`` - by Batuhan Taskaya

source: `bpo-36969 <https://bugs.python.org/issue36969>`__: PDB command `args` now display positional only arguments. Patch contributed by Rémi Lapeyre.
es: `bpo-36969 <https://bugs.python.org/issue36969>`__: comando PDB 'ARGS' AHORA Muestra solo los argumentos posicionales.Patch aportado por Rémi Lapeyre.

source: `bpo-36969 <https://bugs.python.org/issue36969>`__: PDB command `args` now display keyword only arguments. Patch contributed by Rémi Lapeyre.
es: `bpo-36969 <https://bugs.python.org/issue36969>`__: comando PDB 'ARGS' AHORA Mostrar los argumentos de solo palabra clave.Patch aportado por Rémi Lapeyre.

source: `bpo-36983 <https://bugs.python.org/issue36983>`__: Add missing names to ``typing.__all__``: ``ChainMap``, ``ForwardRef``, ``OrderedDict`` - by Anthony Sottile.
es: `bpo-36983 <https://bugs.python.org/issue36983>`__: Agregue nombres que faltan a ``typing.__all__``: ``ChainMap``, ``Forwardref``, ``OrderedDict`` - por Anthony Sottile.

source: `bpo-36972 <https://bugs.python.org/issue36972>`__: Add SupportsIndex protocol to the typing module to allow type checking to detect classes that can be passed to `hex()`, `oct()` and `bin()`.
es: `bpo-36972 <https://bugs.python.org/issue36972>`__: Agregue el protocolo SupportsIndex al módulo de mecanografía para permitir la comprobación de tipo para detectar las clases que se pueden pasar a `HEX() ',` OCT() `y `bin()`.

source: `bpo-32972 <https://bugs.python.org/issue32972>`__: Implement ``unittest.IsolatedAsyncioTestCase`` to help testing asyncio-based code.
es: `bpo-32972 <https://bugs.python.org/issue32972>`__: Implementar ``unittest.IsolatedAsyncioTestCase`` para ayudar a probar el código basado en Asyncio.

source: `bpo-36952 <https://bugs.python.org/issue36952>`__: :func:`fileinput.input` and :class:`fileinput.FileInput` **bufsize** argument has been removed (was deprecated and ignored since Python 3.6), and as a result the **mode** and **openhook** arguments have been made keyword-only.
es: `bpo-36952 <https://bugs.python.org/issue36952>`__: :func:`fileinput.input` y :class:`fileinput.FileInput` **bufsize** se ha eliminado el argumento (fue desaprobado yignorado desde Python 3.6), y como resultado el **mode** y **openhook** Los argumentos se han hecho solo por palabra clave.

source: `bpo-36952 <https://bugs.python.org/issue36952>`__: Starting with Python 3.3, importing ABCs from :mod:`collections` is deprecated, and import should be done from :mod:`collections.abc`. Still being able to import from :mod:`collections` was marked for removal in 3.8, but has been delayed to 3.9; documentation and ``DeprecationWarning`` clarified.
es: `bpo-36952 <https://bugs.python.org/issue36952>`__: Comenzando con Python 3.3, importando ABCs de :mod:`colections` está en desuso e imprecisión debe hacerse de :mod:`collections.abc`. Aún poder importar de :mod:`colections` se marcó para la eliminación en 3.8, pero se ha retrasado en 3.9;Documentación y ``DeprecationWarning`` aclarado.

source: `bpo-36949 <https://bugs.python.org/issue36949>`__: Implement __repr__ for WeakSet objects.
es: `bpo-36949 <https://bugs.python.org/issue36949>`__: Implementar __repr__ para objetos delegados de débiles.

source: `bpo-36948 <https://bugs.python.org/issue36948>`__: Fix :exc:`NameError` in :meth:`urllib.request.URLopener.retrieve`. Patch by Karthikeyan Singaravelan.
es: `bpo-36948 <https://bugs.python.org/issue36948>`__: Fix:exc:`NameError` en:meth:`urllib.Request.Urlopener.reever`Parche por karthikeyan singaravelan.

source: `bpo-33524 <https://bugs.python.org/issue33524>`__: Fix the folding of email header when the max_line_length is 0 or None and the header contains non-ascii characters. Contributed by Licht Takeuchi (@Licht-T).
es: `bpo-33524 <https://bugs.python.org/issue33524>`__: Arregla el plegado del encabezado de correo electrónico cuando la longitud de max_line_length es 0 o ninguna y el encabezado contiene caracteres no ASCII.Contribuido por Licht Takeuchi (@ Licht-T).

source: `bpo-24564 <https://bugs.python.org/issue24564>`__: :func:`shutil.copystat` now ignores :const:`errno.EINVAL` on :func:`os.setxattr` which may occur when copying files on filesystems without extended attributes support.
es: `bpo-24564 <https://bugs.python.org/issue24564>`__: :func:`shutil.copystat` ahora ignora :const:`errno.EINVAL` en :func:`os.setxattr` que puede ocurrir al copiar archivos en sistemas de archivos sin apoyo de atributos extendidos.

source: Original patch by Giampaolo Rodola, updated by Ying Wang.
es: Patch original de Giampaolo Rodola, actualizado por Ying Wang.

source: `bpo-36888 <https://bugs.python.org/issue36888>`__: Python child processes can now access the status of their parent process using multiprocessing.process.parent_process
es: `bpo-36888 <https://bugs.python.org/issue36888>`__: Los procesos infantiles de Python ahora pueden acceder al estado de su proceso padre utilizando multiprocesamiento.process.Parent_process

source: `bpo-36921 <https://bugs.python.org/issue36921>`__: Deprecate ``@coroutine`` for sake of ``async def``.
es: `bpo-36921 <https://bugs.python.org/issue36921>`__: deprecate ``@coroutine``. por el bien de ``async def``.

source: `bpo-25652 <https://bugs.python.org/issue25652>`__: Fix bug in ``__rmod__`` of ``UserString`` - by Batuhan Taskaya.
es: `bpo-25652 <https://bugs.python.org/issue25652>`__: corrige el error en ``__rmod__`` de ``UserString`` - de Batuhan Taskaya.

source: `bpo-36916 <https://bugs.python.org/issue36916>`__: Remove a message about an unhandled exception in a task when writer.write() is used without await and writer.drain() fails with an exception.
es: `bpo-36916 <https://bugs.python.org/issue36916>`__: Eliminar un mensaje sobre una excepción no controlada en una tarea cuando se usa Writer.Write() sin esperar y escritor.drain() falla con una excepción.

source: `bpo-36889 <https://bugs.python.org/issue36889>`__: Introduce :class:`asyncio.Stream` class that merges :class:`asyncio.StreamReader` and :class:`asyncio.StreamWriter` functionality. :class:`asyncio.Stream` can work in readonly, writeonly and readwrite modes. Provide :func:`asyncio.connect`, :func:`asyncio.connect_unix`, :func:`asyncio.connect_read_pipe` and :func:`asyncio.connect_write_pipe` factories to open :class:`asyncio.Stream` connections. Provide :class:`asyncio.StreamServer` and :class:`UnixStreamServer` to serve servers with asyncio.Stream API. Modify :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` to use :class:`asyncio.Stream` instead of deprecated :class:`StreamReader` and :class:`StreamWriter`. Deprecate :class:`asyncio.StreamReader` and :class:`asyncio.StreamWriter`. Deprecate usage of private classes, e.g. :class:`asyncio.FlowControlMixing` and :class:`asyncio.StreamReaderProtocol` outside of asyncio package.
es: `bpo-36889 <https://bugs.python.org/issue36889>`__: introducir :class:`asyncio.stream` Class que fusiona :class:`Asyncio.StreamReader` y :class:`Asyncio.streamwriter` funcionality. :class:`asyncio.stream` puede funcionar en los modos readwey, escritas y readreves.Proporcionar:func:`Asyncio.Connect`,:func:`asyncio.connect_unix` ,: func: `asyncio.connect_read_pipe` y:func:`asyncio.connect_write_pipe` Fábricas para abrir :class:`Asyncio.stream 'Conexiones.Proporcionar :class:`Asyncio.Streamserver` y :class:`UnixStreamServer` para servir servidores con asyncio.stream API.Modificar:func:`asyncio.create_subprocess_shell` y: func:`asyncio.create_subprocess_exec` para usar :class:`asyncio.stream` en lugar de desaprobado :class:`StreamReader` y :class:`StreamEtriter`.Desprecate :class:`Asyncio.StreamReader` y :class:`asyncio.strewriter`.Desprecate de uso de clases privadas, por ejemplo. :class:`asyncio.flowcontrolmixing` y :class:`asyncio.streamreaderprotocol` fuera del paquete Asyncio.

source: `bpo-36845 <https://bugs.python.org/issue36845>`__: Added validation of integer prefixes to the construction of IP networks and interfaces in the ipaddress module.
es: `bpo-36845 <https://bugs.python.org/issue36845>`__: agregó la validación de prefijos enteros a la construcción de redes e interfaces IP en el módulo iPAddress.

source: `bpo-23378 <https://bugs.python.org/issue23378>`__: Add an extend action to argparser.
es: `bpo-23378 <https://bugs.python.org/issue23378>`__: Agregue una acción de extensión a argparser.

source: `bpo-36867 <https://bugs.python.org/issue36867>`__: Fix a bug making a SharedMemoryManager instance and its parent process use two separate resource_tracker processes.
es: `bpo-36867 <https://bugs.python.org/issue36867>`__: Arregla un error que realice una instancia de SharedMemoryManager y su proceso padre Use dos procesos de recursos_tracker separados.

source: `bpo-23896 <https://bugs.python.org/issue23896>`__: Adds a grammar to lib2to3.pygram that contains exec as a function not as statement.
es: `bpo-23896 <https://bugs.python.org/issue23896>`__: agrega una gramática a lib2to3.pygram que contiene ejecutivo como una función no como declaración.

source: `bpo-36895 <https://bugs.python.org/issue36895>`__: The function ``time.clock()`` was deprecated in 3.3 in favor of ``time.perf_counter()`` and marked for removal in 3.8, it has removed.
es: `bpo-36895 <https://bugs.python.org/issue36895>`__: la función ``time.clock()`` se desaprobó en 3.3 a favor de ``time.perf_counter()`` y marcado paraEliminación en 3.8, ha eliminado.

source: `bpo-35545 <https://bugs.python.org/issue35545>`__: Fix asyncio discarding IPv6 scopes when ensuring hostname resolutions internally
es: `bpo-35545 <https://bugs.python.org/issue35545>`__: FIX ASYNCIO Deseche los ámbitos de IPv6 al garantizar las resoluciones del nombre de host internamente

source: `bpo-36887 <https://bugs.python.org/issue36887>`__: Add new function :func:`math.isqrt` to compute integer square roots.
es: `bpo-36887 <https://bugs.python.org/issue36887>`__: Agregar nueva función:func:`math.isqrt` para calcular las raíces cuadradas de enteros.

source: `bpo-34632 <https://bugs.python.org/issue34632>`__: Introduce the ``importlib.metadata`` module with (provisional) support for reading metadata from third-party packages.
es: `bpo-34632 <https://bugs.python.org/issue34632>`__: Introduce el módulo ``importlib.metadata`` Soporte con (provisional) para leer metadatos de paquetes de terceros.

source: `bpo-36878 <https://bugs.python.org/issue36878>`__: When using `type_comments=True` in `ast.parse`, treat `# type: ignore` followed by a non-alphanumeric character and then arbitrary text as a type ignore, instead of requiring nothing but whitespace or another comment. This is to permit formations such as `# type: ignore[E1000]`.
es: `bpo-36878 <https://bugs.python.org/issue36878>`__: Cuando use 'type_comments = true' en `AST.Parse`, Trate" # Tipo: Ignorar` seguido de un carácter no alfanumérico y luegoEl texto arbitrario como tipo ignore, en lugar de no requerir nada más que espacio en blanco u otro comentario.Esto es para permitir formaciones como '# Tipo: Ignorar [E1000] `.

source: `bpo-36778 <https://bugs.python.org/issue36778>`__: ``cp65001`` encoding (Windows code page 65001) becomes an alias to ``utf_8`` encoding.
es: `bpo-36778 <https://bugs.python.org/issue36778>`__: ``cp65001`` Coding (código de Windows Página 65001) se convierte en un alias a la codificación ``utf_8``.

source: `bpo-36867 <https://bugs.python.org/issue36867>`__: The multiprocessing.resource_tracker replaces the multiprocessing.semaphore_tracker module. Other than semaphores, resource_tracker also tracks shared_memory segments.
es: `bpo-36867 <https://bugs.python.org/issue36867>`__: La multiprocessing.resource_tracker reemplaza el módulo multiprocessing.semaphore_tracker.Aparte de Semaprárese, Resource_Tracker también rastrea a Shared_Memory Segments.

source: `bpo-30262 <https://bugs.python.org/issue30262>`__: The ``Cache`` and ``Statement`` objects of the :mod:`sqlite3` module are not exposed to the user. Patch by Aviv Palivoda.
es: `bpo-30262 <https://bugs.python.org/issue30262>`__: ``Cache`` y ``Statement`` Los objetos de :mod:`sqlite3` módulo no están expuestos al usuario. Parche de Aviv Palivoda.

source: `bpo-24538 <https://bugs.python.org/issue24538>`__: In `shutil.copystat()`, first copy extended file attributes and then file permissions, since extended attributes can only be set on the destination while it is still writeable.
es: `bpo-24538 <https://bugs.python.org/issue24538>`__: en 'en' stlutil.copystat() `, primero copie los atributos de archivos extendidos y luego los permisos de archivos, ya que los atributos extendidos solo se pueden configurar en el destino mientras queTodavía es escrito.

source: `bpo-36829 <https://bugs.python.org/issue36829>`__: Add new :func:`sys.unraisablehook` function which can be overridden to control how "unraisable exceptions" are handled. It is called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`).
es: `bpo-36829 <https://bugs.python.org/issue36829>`__: Añadir Nuevo:func:`sys.unraisablehook 'función que puede ser anulado para controlar cómo se manejan las" excepciones insuficientes ".Se llama cuando se ha producido una excepción, pero no hay forma de que Python lo maneje.Por ejemplo, cuando un destructor aumenta una excepción o durante la recolección de basura (:func:`GC.Collect`).

source: `bpo-36832 <https://bugs.python.org/issue36832>`__: Introducing ``zipfile.Path``, a pathlib-compatible wrapper for traversing zip files.
es: `bpo-36832 <https://bugs.python.org/issue36832>`__: introduciendo ``zipfile.Path``, una envoltura compatible con PathLib para atravesar archivos ZIP.

source: `bpo-36814 <https://bugs.python.org/issue36814>`__: Fix an issue where os.posix_spawnp() would incorrectly raise a TypeError when file_actions is None.
es: `bpo-36814 <https://bugs.python.org/issue36814>`__: Solucionar un problema donde OS.POSIX_SPAWNP() elevaría incorrectamente un TypeError cuando File_acciones no sea.
