Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-36324 <https://bugs.python.org/issue36324>`__: Make internal attributes for statistics.NormalDist() private.
es: `bpo-36324 <https://bugs.python.org/issue36324>`__: Haz atributos internos para estadísticas.normaldista() privado.

source: `bpo-37491 <https://bugs.python.org/issue37491>`__: Fix ``IndexError`` when parsing email headers with unexpectedly ending bare-quoted string value. Patch by Abhilash Raj.
es: `bpo-37491 <https://bugs.python.org/issue37491>`__: Arregla ``indexError`` al analizar los encabezados de correo electrónico con un valor de cadena de caracteres inesperado en el cierre de citas. Parche de Abhilash Raj.

source: `bpo-37579 <https://bugs.python.org/issue37579>`__: Return :exc:`NotImplemented` in Python implementation of ``__eq__`` for :class:`~datetime.timedelta` and :class:`~datetime.time` when the other object being compared is not of the same type to match C implementation. Patch by Karthikeyan Singaravelan.
es: `bpo-37579 <https://bugs.python.org/issue37579>`__: Retorna :exc:`NotImplemented` en la implementación de Python de ``__eq__`` para :class:`~DateTime.Timedetla` y :class:`~datetime.time` cuando se compara el otro objeto no es del mismo tipo para coincidir con la implementación de C. Parche por karthikeyan singaravelan.

source: `bpo-21478 <https://bugs.python.org/issue21478>`__: Record calls to parent when autospecced object is attached to a mock using :func:`unittest.mock.attach_mock`. Patch by Karthikeyan Singaravelan.
es: `bpo-21478 <https://bugs.python.org/issue21478>`__: Llamadas de registro a los padres cuando el objeto autoespecado se adjunta a un simulacro usando:func:`Unittest.mock.attach_mock`. Parche por karthikeyan singaravelan.

source: `bpo-37502 <https://bugs.python.org/issue37502>`__: pickle.loads() no longer raises TypeError when the buffers argument is set to None
es: `bpo-37502 <https://bugs.python.org/issue37502>`__: Pickle.loads() Ya no lanza a TypeError cuando el argumento de los buffers se establece en None

source: `bpo-37520 <https://bugs.python.org/issue37520>`__: Correct behavior for zipfile.Path.parent when the path object identifies a subdirectory.
es: `bpo-37520 <https://bugs.python.org/issue37520>`__: correcto comportamiento para zipfile.path.Parent cuando el objeto Ruta identifica un subdirectorio.

source: `bpo-18374 <https://bugs.python.org/issue18374>`__: Fix the ``.col_offset`` attribute of nested :class:`ast.BinOp` instances which had a too large value in some situations.
es: `bpo-18374 <https://bugs.python.org/issue18374>`__: Arregla el atributo ``.col_offset`` de la instancia anidad :class:`ast.BinOp`, que tuvo un valor demasiado grande en algunas situaciones.

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: Fix :func:`multiprocessing.util.get_temp_dir` finalizer: clear also the 'tempdir' configuration of the current process, so next call to ``get_temp_dir()`` will create a new temporary directory, rather than reusing the removed temporary directory.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: FIX:func:`multiprocessing.util.get_temp_dir` finalizer: Borre también la configuración 'Tempdir' del proceso actual, por lo que la siguiente llamada a``get_temp_dir()` `creará un nuevo directorio temporal, en lugar de reutilizar el directorio temporal eliminado.

source: `bpo-37481 <https://bugs.python.org/issue37481>`__: The distutils ``bdist_wininst`` command is deprecated in Python 3.8, use ``bdist_wheel`` (wheel packages) instead.
es: `bpo-37481 <https://bugs.python.org/issue37481>`__: El comando Distutils ``bdist_wininst`` está desaprobado en Python 3.8, use ``bdist_wheel`` (paquetes de ruedas) (paquetes de ruedas).

source: `bpo-26967 <https://bugs.python.org/issue26967>`__: An :class:`~argparse.ArgumentParser` with ``allow_abbrev=False`` no longer disables grouping of short flags, such as ``-vv``, but only disables abbreviation of long flags as documented. Patch by Zac Hatfield-Dodds.
es: `bpo-26967 <https://bugs.python.org/issue26967>`__: Un :class:`~argparse.ArgumentParser` con ``allow_abbrev=False`` ya no deshabilita la agrupación de flags cortas, como ``-vv``, pero solo desactiva la abreviatura de flags largas como documentadas. Parche de Zac Hatfield-Dodds.

source: `bpo-37347 <https://bugs.python.org/issue37347>`__: :meth:`sqlite3.Connection.create_aggregate`, :meth:`sqlite3.Connection.create_function`, :meth:`sqlite3.Connection.set_authorizer`, :meth:`sqlite3.Connection.set_progress_handler` :meth:`sqlite3.Connection.set_trace_callback` methods lead to segfaults if some of these methods are called twice with an equal object but not the same. Now callbacks are stored more carefully. Patch by Aleksandr Balezin.
es: `bpo-37347 <https://bugs.python.org/issue37347>`__::meth:`sqlite3.connection.create_aggregate`,:meth:`sqlite3.connection.create_function`,:meth:`sqlite3.connection.Set_Authorizer`,:meth:'sqlite3.connection.set_progress_handler`:meth:`sqlite3.connection.set_trace_callback` Methotels conduce a segfaults si algunos de estos métodos se llaman dos veces con un objeto igualo, pero no lo mismo.Ahora las devoluciones de llamada se almacenan con más cuidado.Parche de Aleksandr Balezin.

source: `bpo-36564 <https://bugs.python.org/issue36564>`__: Fix infinite loop in email header folding logic that would be triggered when an email policy's max_line_length is not long enough to include the required markup and any values in the message. Patch by Paul Ganssle
es: `bpo-36564 <https://bugs.python.org/issue36564>`__: Arregla el bucle infinito en la lógica plegable del encabezado de correo electrónico que se activaría cuando la política de correo electrónico MAX_LINE_LENGH no es lo suficientemente larga como para incluir el marcado requerido y cualquier valor enel mensaje. Parche por paul ganssle

source: `bpo-32910 <https://bugs.python.org/issue32910>`__: Remove implementation-specific behaviour of how venv's Deactivate works.
es: `bpo-32910 <https://bugs.python.org/issue32910>`__: Eliminar el comportamiento específico de la implementación de cómo las obras de desactivación de Venv.

source: `bpo-37284 <https://bugs.python.org/issue37284>`__: Add a brief note to indicate that any new ``sys.implementation`` required attributes must go through the PEP process.
es: `bpo-37284 <https://bugs.python.org/issue37284>`__: Agregue una breve nota para indicar que los atributos requeridos de nuevo ``sys.implementation`` deben pasar por el proceso PEP.

source: `bpo-30088 <https://bugs.python.org/issue30088>`__: Documented that :class:`mailbox.Maildir` constructor doesn't attempt to verify the maildir folder layout correctness. Patch by Sviatoslav Sydorenko.
es: `bpo-30088 <https://bugs.python.org/issue30088>`__: Documentado que :class:`mailbox.Maildir` constructor no intenta verificar la corrección de diseño de la carpeta Maildir. Parche por sviatoslav Sydorenko.

source: `bpo-37521 <https://bugs.python.org/issue37521>`__: Fix `importlib` examples to insert any newly created modules via importlib.util.module_from_spec() immediately into sys.modules instead of after calling loader.exec_module().
es: `bpo-37521 <https://bugs.python.org/issue37521>`__: fix 'ImportLib` Ejemplos para insertar cualquier módulo recién creado a través de importlib.util.module_from_spec() inmediatamente en SYS.modules en lugar de después de llamar al cargador.exec_module().

source: Thanks to Benjamin Mintz for finding the bug.
es: Gracias a Benjamin Mintz por encontrar el error.

source: `bpo-37456 <https://bugs.python.org/issue37456>`__: Slash ('/') is now part of syntax.
es: `bpo-37456 <https://bugs.python.org/issue37456>`__: slash ('/') ahora es parte de la sintaxis.

source: `bpo-37487 <https://bugs.python.org/issue37487>`__: Fix PyList_GetItem index description to include 0.
es: `bpo-37487 <https://bugs.python.org/issue37487>`__: Fix Pylist_GetItem Índice Descripción para incluir 0.

source: `bpo-37149 <https://bugs.python.org/issue37149>`__: Replace the dead link to the Tkinter 8.5 reference by John Shipman, New Mexico Tech, with a link to the archive.org copy.
es: `bpo-37149 <https://bugs.python.org/issue37149>`__: Reemplace el enlace muerto a la referencia de Tkinter 8.5 por John Shipman, Nuevo México Tech, con un enlace a la copia Archive.org.

source: `bpo-37478 <https://bugs.python.org/issue37478>`__: Added possible exceptions to the description of os.chdir().
es: `bpo-37478 <https://bugs.python.org/issue37478>`__: Agregue las posibles excepciones a la descripción de OS.CHDIR().

source: `bpo-37558 <https://bugs.python.org/issue37558>`__: Fix test_shared_memory_cleaned_after_process_termination name handling
es: `bpo-37558 <https://bugs.python.org/issue37558>`__: Fix test_shared_memory_cleaned_after_process_termination Nombre Manipulación

source: `bpo-37526 <https://bugs.python.org/issue37526>`__: Add :func:`test.support.catch_threading_exception`: context manager catching :class:`threading.Thread` exception using :func:`threading.excepthook`.
es: `bpo-37526 <https://bugs.python.org/issue37526>`__: Añadir :func:`test.support.catch_threading_exception`: context manager catching :class:`threading.Tread` excepción usando :func:`threading.excepthook`.

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_concurrent_futures now explicitly stops the ForkServer instance if it's running.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: test_concurrent_futures ahora detiene explícitamente la instancia de Forkserver si se está ejecutando.

source: `bpo-37421 <https://bugs.python.org/issue37421>`__: multiprocessing tests now stop the ForkServer instance if it's running: close the "alive" file descriptor to ask the server to stop and then remove its UNIX address.
es: `bpo-37421 <https://bugs.python.org/issue37421>`__: Las pruebas de multiprocesamiento ahora detengan la instancia de FORKSERVER Si se está ejecutando: Cierre el descriptor de archivos "ALIVE" para solicitar al servidor que se detenga y luego retire su dirección UNIX.

source: `bpo-36044 <https://bugs.python.org/issue36044>`__: Reduce the number of unit tests run for the PGO generation task. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using './configure [..] PROFILE_TASK="-m test --pgo-extended"'. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain.
es: `bpo-36044 <https://bugs.python.org/issue36044>`__: Reduzca el número de pruebas unitarias que se ejecutan para la tarea de generación de PGO.Esto acelera la tarea por un factor de aproximadamente 15x.Ejecutar el suite de prueba de unidad completa es lento.Este cambio puede resultar en una compilación ligeramente menos optimizada, ya que no se ejecutarán tantas sucursales de código.Si está dispuesto a esperar a la construcción mucho más lenta, el comportamiento anterior se puede restaurar usando './configure [.]] Perfil_Task = "- M Test --Pgo-Extended".No hacemos garantías en cuanto a qué conjunto de tareas PGO produce una construcción más rápida.Los usuarios que se preocupan deben ejecutar sus propios puntos de referencia relevantes, ya que los resultados pueden depender del entorno, la carga de trabajo y la cadena de herramientas del compilador.

source: `bpo-37672 <https://bugs.python.org/issue37672>`__: Switch Windows Store package's pip to use bundled :file:`pip.ini` instead of :envvar:`PIP_USER` variable.
es: `bpo-37672 <https://bugs.python.org/issue37672>`__: Switch Windows Store Pape's Pip to Use Bundled: Archivo: `Pip.ini 'en lugar de :envvar:`PIP_USER` Variable.

source: `bpo-37692 <https://bugs.python.org/issue37692>`__: Improve highlight config sample with example shell interaction and better labels for shell elements.
es: `bpo-37692 <https://bugs.python.org/issue37692>`__: Mejorar la muestra de configuración de resalte con la interacción de la cubierta de ejemplo y mejores etiquetas para los elementos de la cáscara.

source: `bpo-37628 <https://bugs.python.org/issue37628>`__: Settings dialog no longer expands with font size.
es: `bpo-37628 <https://bugs.python.org/issue37628>`__: El diálogo de configuración ya no se expande con el tamaño de la fuente.

source: `bpo-37627 <https://bugs.python.org/issue37627>`__: Initialize the Customize Run dialog with the command line arguments most recently entered before. The user can optionally edit before submitting them.
es: `bpo-37627 <https://bugs.python.org/issue37627>`__: Inicialice el cuadro de diálogo Ejecutar de personalizar con los argumentos de la línea de comandos ingresados más recientemente.El usuario puede editar opcionalmente antes de enviarlos.

source: `bpo-33610 <https://bugs.python.org/issue33610>`__: Fix code context not showing the correct context when first toggled on.
es: `bpo-33610 <https://bugs.python.org/issue33610>`__: Arreglar el contexto del código que no muestra el contexto correcto cuando se enciende por primera vez.

source: `bpo-37530 <https://bugs.python.org/issue37530>`__: Optimize code context to reduce unneeded background activity. Font and highlight changes now occur along with text changes instead of after a random delay.
es: `bpo-37530 <https://bugs.python.org/issue37530>`__: Optimice el contexto del código para reducir la actividad de fondo innecesario.Fuente y resaltar los cambios ahora ocurren junto con los cambios de texto en lugar de después de un retraso aleatorio.

source: `bpo-27452 <https://bugs.python.org/issue27452>`__: Cleanup ``config.py`` by inlining ``RemoveFile`` and simplifying the handling of ``file`` in ``CreateConfigHandlers``.
es: `bpo-27452 <https://bugs.python.org/issue27452>`__: limpieza ``config.py`` al inlining ``RemoveFile`` y simplificando el manejo de ``file`` en ``CreateConfigHandlers``.

source: `bpo-17535 <https://bugs.python.org/issue17535>`__: Add optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog.
es: `bpo-17535 <https://bugs.python.org/issue17535>`__: Agregue números de línea opcionales para Windows Editor inactivo.Windows abierto sin números de línea a menos que se configure de lo contrario en la pestaña General del cuadro de diálogo Configuración.

source: `bpo-26806 <https://bugs.python.org/issue26806>`__: To compensate for stack frames added by IDLE and avoid possible problems with low recursion limits, add 30 to limits in the user code execution process. Subtract 30 when reporting recursion limits to make this addition mostly transparent.
es: `bpo-26806 <https://bugs.python.org/issue26806>`__: Para compensar los marcos de pila agregada por inactividad y evite posibles problemas con los límites de baja recursión, agregue 30 a límites en el proceso de ejecución del código de usuario.Restar 30 al informar los límites de recursión para hacer que esta adición sea mayormente transparente.

source: `bpo-36390 <https://bugs.python.org/issue36390>`__: Gather Format menu functions into format.py. Combine paragraph.py, rstrip.py, and format methods from editor.py.
es: `bpo-36390 <https://bugs.python.org/issue36390>`__: Recopilación de funciones de menú de formato en format.py.Combine los métodos de combinación de párrafos.py, rstrip.py y formatear de editor.py.

source: `bpo-37675 <https://bugs.python.org/issue37675>`__: 2to3 now works when run from a zipped standard library.
es: `bpo-37675 <https://bugs.python.org/issue37675>`__: 2to3 ahora funciona cuando se ejecuta desde una biblioteca estándar con cremallera.

source: *Release date: 2019-07-04*
es: * Fecha de lanzamiento: 2019-07-04 *

source: `bpo-37363 <https://bugs.python.org/issue37363>`__: Adds audit events for the range of supported run commands (see :ref:`using-on-general`).
es: `bpo-37363 <https://bugs.python.org/issue37363>`__: agrega eventos de auditoría para la gama de comandos de ejecución compatibles (consulte :ref:`using-on-general`).

source: `bpo-37463 <https://bugs.python.org/issue37463>`__: ssl.match_hostname() no longer accepts IPv4 addresses with additional text after the address and only quad-dotted notation without trailing whitespaces. Some inet_aton() implementations ignore whitespace and all data after whitespace, e.g. '127.0.0.1 whatever'.
es: `bpo-37463 <https://bugs.python.org/issue37463>`__: ssl.match_hostname() Ya no acepta las direcciones IPv4 con texto adicional después de la dirección y solo una notación cuádruple sin espacios en plancha.Algunas implementaciones inet_aton() ignoran el espacio en blanco y todos los datos después del espacio en blanco, por ejemplo.'127.0.0.1 Lo que sea'.

source: `bpo-37363 <https://bugs.python.org/issue37363>`__: Adds audit events for :mod:`ensurepip`, :mod:`ftplib`, :mod:`glob`, :mod:`imaplib`, :mod:`nntplib`, :mod:`pdb`, :mod:`poplib`, :mod:`shutil`, :mod:`smtplib`, :mod:`sqlite3`, :mod:`subprocess`, :mod:`telnetlib`, :mod:`tempfile` and :mod:`webbrowser`, as well as :func:`os.listdir`, :func:`os.scandir` and :func:`breakpoint`.
es: `bpo-37363 <https://bugs.python.org/issue37363>`__: agrega eventos de auditoría para :mod:`ensurepip ', :mod:`ftplib`, :mod:`glob` , :mod:`imaplib`, :mod:`nntplib`, :mod:`pdb` , :mod:`poplib`, :mod:`stlib`, :mod:`smtplib`, :mod:`sqlite3`, :mod:`Subprocess`, :mod:`Telnetlib`, :mod:`TempFile` y :mod:`WebBrowser`, así como :func:`os.listdir`, :func:`os.scandir` y :func:`breakpoint`.

source: `bpo-37364 <https://bugs.python.org/issue37364>`__: :func:`io.open_code` is now used when reading :file:`.pth` files.
es: `bpo-37364 <https://bugs.python.org/issue37364>`__: :func:`io.open_code` ahora se usa al leer :file::`.pth` Files.

source: `bpo-34631 <https://bugs.python.org/issue34631>`__: Updated OpenSSL to 1.1.1c in Windows installer
es: `bpo-34631 <https://bugs.python.org/issue34631>`__: openssl actualizado a 1.1.1c en Windows Installer

source: `bpo-37467 <https://bugs.python.org/issue37467>`__: Fix :func:`sys.excepthook` and :c:func:`PyErr_Display` if a filename is a bytes string. For example, for a SyntaxError exception where the filename attribute is a bytes string.
es: `bpo-37467 <https://bugs.python.org/issue37467>`__: FIX:func:`sys.excepthook 'y:c:func:`Pyerr_display` Si un nombre de archivo es una cadena de bytes.Por ejemplo, para una excepción de SyntaxArror donde el atributo de nombre de archivo es una cadena de bytes.

source: `bpo-37417 <https://bugs.python.org/issue37417>`__: :meth:`bytearray.extend` now correctly handles errors that arise during iteration. Patch by Brandt Bucher.
es: `bpo-37417 <https://bugs.python.org/issue37417>`__: :meth:`bytearray.extend` ahora maneja correctamente los errores que surgen durante la iteración.Parche por Brandt Bucher.

source: `bpo-24214 <https://bugs.python.org/issue24214>`__: Improved support of the surrogatepass error handler in the UTF-8 and UTF-16 incremental decoders.
es: `bpo-24214 <https://bugs.python.org/issue24214>`__: APOYO Mejor en el controlador de errores de SurrogatePass en los decodificadores incrementales UTF-8 y UTF-16.

source: `bpo-35224 <https://bugs.python.org/issue35224>`__: Reverse evaluation order of key: value in dict comprehensions as proposed in PEP 572. I.e. in ``{k: v for ...}``, ``k`` will be evaluated before ``v``.
es: `bpo-35224 <https://bugs.python.org/issue 35224>`__: Orancia de evaluación inversa de la clave: valor en las comprensiones del dict que se propone en PEP 572. I.E.En ``k: v para ...}` `,` `k`` será evaluado antes de" `v``.

source: `bpo-37316 <https://bugs.python.org/issue37316>`__: Fix the :c:func:`PySys_Audit` call in :class:`mmap.mmap`.
es: `bpo-37316 <https://bugs.python.org/issue37316>`__: corregir el:c:func:`Pissys_Audit 'Llama en :class:`mmap.mmap`.

source: `bpo-37269 <https://bugs.python.org/issue37269>`__: Fix a bug in the peephole optimizer that was not treating correctly constant conditions with binary operators. Patch by Pablo Galindo.
es: `bpo-37269 <https://bugs.python.org/issue37269>`__: Arregla un error en el optimizador de la mirilla que no fue el tratamiento de condiciones correctamente constantes con los operadores binarios. Parche de Pablo Galindo.

source: `bpo-37213 <https://bugs.python.org/issue37213>`__: Handle correctly negative line offsets in the peephole optimizer. Patch by Pablo Galindo.
es: `bpo-37213 <https://bugs.python.org/issue37213>`__: Maneje las compensaciones de línea correctivamente negativas en el optimizador de la metro. Parche de Pablo Galindo.

source: `bpo-37219 <https://bugs.python.org/issue37219>`__: Remove errorneous optimization for empty set differences.
es: `bpo-37219 <https://bugs.python.org/issue37219>`__: Retire la optimización errórica de las diferencias de conjunto vacío.

source: `bpo-36922 <https://bugs.python.org/issue36922>`__: Slot functions optimize any callable with ``Py_TPFLAGS_METHOD_DESCRIPTOR`` instead of only instances of ``function``.
es: `bpo-36922 <https://bugs.python.org/issue36922>`__: Funciones de ranura Optimiza cualquier llamada con ``Py_TPFLAGS_METHOD_DESCRIPTOR`` en lugar de solo instancias de ``function``.

source: `bpo-36974 <https://bugs.python.org/issue36974>`__: The slot ``tp_vectorcall_offset`` is inherited unconditionally to support ``super().__call__()`` when the base class uses vectorcall.
es: `bpo-36974 <https://bugs.python.org/issue36974>`__: la ranura ``tp_vectorcall_offset`` se hereda incondicionalmente para admitir ``super().__call__()`` cuando la clase base usa vectorcall.

source: `bpo-37160 <https://bugs.python.org/issue37160>`__: :func:`threading.get_native_id` now also supports NetBSD.
es: `bpo-37160 <https://bugs.python.org/issue37160>`__: :func:`Threading.get_native_id` ahora también es compatible con NetBSD.

source: `bpo-37077 <https://bugs.python.org/issue37077>`__: Add :func:`threading.get_native_id` support for AIX. Patch by M. Felt
es: `bpo-37077 <https://bugs.python.org/issue37077>`__: Añadir:func:`THRYING.GET_NATIVER_ID` Soporte para AIX. Parche por M. fieltro

source: `bpo-37440 <https://bugs.python.org/issue37440>`__: http.client now enables TLS 1.3 post-handshake authentication for default context or if a cert_file is passed to HTTPSConnection.
es: `bpo-37440 <https://bugs.python.org/issue37440>`__: http.client ahora permite la autenticación de TLS 1.3 Post-ApreterShake para el contexto predeterminado o si se pasa un archivo CERT_FILE a HTTPSCONNEYECTORETE.

source: `bpo-37437 <https://bugs.python.org/issue37437>`__: Update vendorized expat version to 2.2.7.
es: `bpo-37437 <https://bugs.python.org/issue37437>`__: Actualizar versión expatriada vendorrizada a 2.2.7.

source: `bpo-37428 <https://bugs.python.org/issue37428>`__: SSLContext.post_handshake_auth = True no longer sets SSL_VERIFY_POST_HANDSHAKE verify flag for client connections. Although the option is documented as ignored for clients, OpenSSL implicitly enables cert chain validation when the flag is set.
es: `bpo-37428 <https://bugs.python.org/issue37428>`__: sslcontext.post_handshake_auth = verdadero ya no más se establece ssl_verify_post_handshake Verifique la flag para las conexiones del cliente.Aunque la opción está documentada como se ignore para los clientes, OpenSSL permite la validación de la cadena certificada de forma implícitamente cuando se establece la flag.
