Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-38271 <https://bugs.python.org/issue38271>`__: The private keys for test_ssl were encrypted with 3DES in traditional PKCS#5 format. 3DES and the digest algorithm of PKCS#5 are blocked by some strict crypto policies. Use PKCS#8 format with AES256 encryption instead.
es: `bpo-38271 <https://bugs.python.org/issue38271>`__: Las claves privadas para Test_SSL se cifraron con 3DES en formato tradicional PKCS # 5.3DES y el algoritmo de digestión de PKCS # 5 están bloqueados por algunas políticas estrictas de criptografía.Use formato PKCS # 8 con cifrado AES256 en su lugar.

source: `bpo-38270 <https://bugs.python.org/issue38270>`__: test.support now has a helper function to check for availibility of a hash digest function. Several tests are refactored avoid MD5 and use SHA256 instead. Other tests are marked to use MD5 and skipped when MD5 is disabled.
es: `bpo-38270 <https://bugs.python.org/issue38270>`__: test.support ahora tiene una función de ayuda para verificar la disponibilidad de una función de digestión de hash.Varias pruebas se refactoran para evitar MD5 y use SHA256 en su lugar.Otras pruebas están marcadas para usar MD5 y se saltan cuando MD5 está deshabilitado.

source: `bpo-37123 <https://bugs.python.org/issue37123>`__: Multiprocessing test test_mymanager() now also expects -SIGTERM, not only exitcode 0. BaseManager._finalize_manager() sends SIGTERM to the manager process if it takes longer than 1 second to stop, which happens on slow buildbots.
es: `bpo-37123 <https://bugs.python.org/issue37123>`__: prueba de Multiprocesamiento test_mymanager() ahora también espera -SIGTERM, no solo exitcode 0. BaseManager._finalize_manager() envía a SIGTERM al proceso del administrador si se necesitaMás de 1 segundo para detener, lo que sucede en la builtería lenta.

source: `bpo-38212 <https://bugs.python.org/issue38212>`__: Multiprocessing tests: increase test_queue_feeder_donot_stop_onexc() timeout from 1 to 60 seconds.
es: `bpo-38212 <https://bugs.python.org/issue38212>`__: Pruebas multiprocesador: Aumente test_queue_feededer_donot_stop_onexc() Tiempo de espera de 1 a 60 segundos.

source: `bpo-38117 <https://bugs.python.org/issue38117>`__: Test with OpenSSL 1.1.1d
es: `bpo-38117 <https://bugs.python.org/issue38117>`__: prueba con openssl 1.1.1d

source: `bpo-37531 <https://bugs.python.org/issue37531>`__: Enhance regrtest multiprocess timeout: write a message when killing a worker process, catch popen.kill() and popen.wait() exceptions, put a timeout on the second call to popen.communicate().
es: `bpo-37531 <https://bugs.python.org/issue37531>`__: mejora el tiempo de espera multiprocesado de regañas: escriba un mensaje al matar a un proceso de trabajador, atrape a POPEN.KILL() y POPEN.WAIT() excepciones, ponga unaTiempo de espera en la segunda llamada a popen.comMunicate().

source: `bpo-37876 <https://bugs.python.org/issue37876>`__: Add tests for ROT-13 codec.
es: `bpo-37876 <https://bugs.python.org/issue37876>`__: Agregue las pruebas para la codec de ROT-13.

source: `bpo-37252 <https://bugs.python.org/issue37252>`__: Fix assertions in ``test_close`` and ``test_events_mask_overflow`` devpoll tests.
es: `bpo-37252 <https://bugs.python.org/issue37252>`__: Arreglada las aserciones en ``test_close`` y ``test_events_mask_overflow`` de las pruebas devpoll.

source: `bpo-34001 <https://bugs.python.org/issue34001>`__: Make test_ssl pass with LibreSSL. LibreSSL handles minimum and maximum TLS version differently than OpenSSL.
es: `bpo-34001 <https://bugs.python.org/issue34001>`__: Haz que Test_SSL pase con Libressl.Libressl maneja la versión mínima y máxima de TLS de manera diferente a OPENSSL.

source: `bpo-36919 <https://bugs.python.org/issue36919>`__: Make ``test_source_encoding.test_issue2301`` implementation independent. The test will work now for both CPython and IronPython.
es: `bpo-36919 <https://bugs.python.org/issue36919>`__: haz ``test_source_encoding.test_ise2301'. Implementación independiente.La prueba funcionará ahora para CPYTHON e IRONPYTHON.

source: `bpo-34596 <https://bugs.python.org/issue34596>`__: Fallback to a default reason when :func:`unittest.skip` is uncalled. Patch by Naitree Zhu.
es: `bpo-34596 <https://bugs.python.org/issue34596>`__: Fallback a una razón por defecto cuando:func:`Unittest.skip` está fuera de lugar. Parche por naitree zhu.

source: `bpo-38301 <https://bugs.python.org/issue38301>`__: In Solaris family, we must be sure to use ``-D_REENTRANT``. Patch by Jesús Cea Avión.
es: `bpo-38301 <https://bugs.python.org/issue38301>`__: En la familia Solaris, debemos estar seguros de usar ``-D_REENTRANT``. Parche de Jesús Cea Agión.

source: `bpo-36210 <https://bugs.python.org/issue36210>`__: Update optional extension module detection for AIX. ossaudiodev and spwd are not applicable for AIX, and are no longer reported as missing. 3rd-party packaging of ncurses (with ASIS support) conflicts with officially supported AIX curses library, so configure AIX to use libcurses.a. However, skip trying to build _curses_panel.
es: `bpo-36210 <https://bugs.python.org/issue36210>`__: Actualice la detección de módulos de extensión opcional para AIX.Ossaudiodev y SPWD no son aplicables para AIX, y ya no se reportan como faltan.Embalaje de terceros de las NCURSES (con soporte de ASIS) Conflictos con la biblioteca de curses AIX con compatibilidad oficialmente, por lo que configure AIX para usar Libcurses.a.Sin embargo, omita intentando construir _curses_panel.

source: patch by M Felt
es: parche por m fieltro

source: `bpo-36002 <https://bugs.python.org/issue36002>`__: Locate ``llvm-profdata`` and ``llvm-ar`` binaries using ``AC_PATH_TOOL`` rather than ``AC_PATH_TARGET_TOOL``.
es: `bpo-36002 <https://bugs.python.org/issue36002>`__: localice ``llvm-profdata`` y binarios ``llvm-ar`` usando ``AC_PATH_TOOL`` en lugar de ``AC_PATH_TARGET_TOOL``.

source: `bpo-37936 <https://bugs.python.org/issue37936>`__: The :file:`.gitignore` file systematically keeps "rooted", with a non-trailing slash, all the rules that are meant to apply to files in a specific place in the repo. Previously, when the intended file to ignore happened to be at the root of the repo, we'd most often accidentally also ignore files and directories with the same name anywhere in the tree.
es: `bpo-37936 <https://bugs.python.org/issue37936>`__: el archivo: `.gitignore 'se mantiene sistemáticamente" rooted ", con una barra sin arrastramiento, todas las reglas que están destinadas a aplicara los archivos en un lugar específico en el repositorio.Anteriormente, cuando el archivo previsto para ignorar sucedió en la raíz del repo, a menudo también ignoramos accidentalmente los archivos y los directorios con el mismo nombre en cualquier lugar del árbol.

source: `bpo-37936 <https://bugs.python.org/issue37936>`__: The :file:`.gitignore` file no longer applies to any files that are in fact tracked in the Git repository. Patch by Greg Price.
es: `bpo-37936 <https://bugs.python.org/issue37936>`__: el archivo: `.gitignore 'no se aplica más a cualquier archivo que de hecho se rastree en el repositorio GIT. Parche por Greg Price.

source: `bpo-38117 <https://bugs.python.org/issue38117>`__: Update bundled OpenSSL to 1.1.1d
es: `bpo-38117 <https://bugs.python.org/issue38117>`__: Actualizar OPENSSL a 1.1.1D

source: `bpo-38092 <https://bugs.python.org/issue38092>`__: Reduce overhead when using multiprocessing in a Windows virtual environment.
es: `bpo-38092 <https://bugs.python.org/issue38092>`__: Reduzca la sobrecarga al usar multiprocesamiento en un entorno virtual de Windows.

source: `bpo-38133 <https://bugs.python.org/issue38133>`__: Allow py.exe launcher to locate installations from the Microsoft Store and improve display of active virtual environments.
es: `bpo-38133 <https://bugs.python.org/issue38133>`__: Permitir que Py.exe Lanzador localice las instalaciones de la tienda Microsoft y mejore la visualización de entornos virtuales activos.

source: `bpo-38114 <https://bugs.python.org/issue38114>`__: The ``pip.ini`` is no longer included in the Nuget package.
es: `bpo-38114 <https://bugs.python.org/issue38114>`__: El ``pip.ini`` ya no se incluye en el paquete Nuget.

source: `bpo-36634 <https://bugs.python.org/issue36634>`__: :func:`os.cpu_count` now returns active processors rather than maximum processors.
es: `bpo-36634 <https://bugs.python.org/issue36634>`__: :func:`os.cpu_count` ahora retorna los procesadores activos en lugar de los procesadores máximos.

source: `bpo-36634 <https://bugs.python.org/issue36634>`__: venv activate.bat now works when the existing variables contain double quote characters.
es: `bpo-36634 <https://bugs.python.org/issue36634>`__: venv activate.bat ahora funciona cuando las variables existentes contienen caracteres de doble cotización.

source: `bpo-38081 <https://bugs.python.org/issue38081>`__: Prevent error calling :func:`os.path.realpath` on ``'NUL```.
es: `bpo-38081 <https://bugs.python.org/issue38081>`__: Evite la llamada de error :func:`os.path.realpath` en ``'NUL'``.

source: `bpo-38087 <https://bugs.python.org/issue38087>`__: Fix case sensitivity in test_pathlib and test_ntpath.
es: `bpo-38087 <https://bugs.python.org/issue38087>`__: Arregla la sensibilidad de la caja en test_pathlib y test_ntpath.

source: `bpo-38088 <https://bugs.python.org/issue38088>`__: Fixes distutils not finding vcruntime140.dll with only the v142 toolset installed.
es: `bpo-38088 <https://bugs.python.org/issue38088>`__: fija distutes que no encuentran vcruntime140.dll con solo el conjunto de herramientas V142 instalado.

source: `bpo-37283 <https://bugs.python.org/issue37283>`__: Ensure command-line and unattend.xml setting override previously detected states in Windows installer.
es: `bpo-37283 <https://bugs.python.org/issue37283>`__: Asegúrese de que la línea de comandos y los estados de configuración que se detallan anteriormente en Windows Installer.

source: `bpo-38030 <https://bugs.python.org/issue38030>`__: Fixes :func:`os.stat` failing for block devices on Windows
es: `bpo-38030 <https://bugs.python.org/issue38030>`__: correcciones:func:`OS.Stat 'Fallando para dispositivos de bloques en Windows

source: `bpo-38020 <https://bugs.python.org/issue38020>`__: Fixes potential crash when calling :func:`os.readlink` (or indirectly through :func:`~os.path.realpath`) on a file that is not a supported link.
es: `bpo-38020 <https://bugs.python.org/issue38020>`__: Corrige el fallo potencial al llamar:func:`OS.READLINK` (o indirectamente a través de:func:`~ os.path.realpath`) enUn archivo que no es un enlace compatible.

source: `bpo-37705 <https://bugs.python.org/issue37705>`__: Improve the implementation of ``winerror_to_errno()``.
es: `bpo-37705 <https://bugs.python.org/issue37705>`__: Mejore la implementación de ``winError_to_errno()``.

source: `bpo-37702 <https://bugs.python.org/issue37702>`__: Fix memory leak on Windows in creating an SSLContext object or running urllib.request.urlopen('https://...').
es: `bpo-37702 <https://bugs.python.org/issue37702>`__: Arregla la pérdida de memoria en Windows para crear un objeto SSLContext o ejecutar urllib.request.urlopen ('https: // ...').

source: `bpo-37445 <https://bugs.python.org/issue37445>`__: Include the ``FORMAT_MESSAGE_IGNORE_INSERTS`` flag in ``FormatMessageW()`` calls.
es: `bpo-37445 <https://bugs.python.org/issue37445>`__: Incluya la flag ``FORMAT_MESSAGE_IGNORE_INSERTS`` en ``FormatMessageW()`` llamadas.

source: `bpo-37380 <https://bugs.python.org/issue37380>`__: Don't collect unfinished processes with ``subprocess._active`` on Windows to cleanup later. Patch by Ruslan Kuprieiev.
es: `bpo-37380 <https://bugs.python.org/issue37380>`__: No recopile procesos sin terminar con ``subprocess._active`` en Windows para limpiar más tarde. Parche por Ruslan Kuprieiev.

source: `bpo-32587 <https://bugs.python.org/issue32587>`__: Make :data:`winreg.REG_MULTI_SZ` support zero-length strings.
es: `bpo-32587 <https://bugs.python.org/issue32587>`__: HAGA :data: `winreg.reg_multi_sz 'Soporta cadenas de longitud cero.

source: `bpo-38117 <https://bugs.python.org/issue38117>`__: Updated OpenSSL to 1.1.1d in macOS installer.
es: `bpo-38117 <https://bugs.python.org/issue38117>`__: APENSH actualizado a 1.1.1d en el instalador de MacOS.

source: `bpo-38089 <https://bugs.python.org/issue38089>`__: Move Azure Pipelines to latest VM versions and make macOS tests optional
es: `bpo-38089 <https://bugs.python.org/issue38089>`__: Mueva las tuberías de Azure a las versiones de VM y haz que las pruebas de MacOS opcional

source: `bpo-35379 <https://bugs.python.org/issue35379>`__: When exiting IDLE, catch any AttributeError. One happens when EditorWindow.close is called twice. Printing a traceback, when IDLE is run from a terminal, is useless and annoying.
es: `bpo-35379 <https://bugs.python.org/issue35379>`__: Cuando sale inactivo, atrapa cualquier AtributeError.Uno sucede cuando editorwindow.close se llama dos veces.Imprimiendo un rastreo, cuando el inactivo se ejecuta desde un terminal, es inútil y molesto.

source: `bpo-38183 <https://bugs.python.org/issue38183>`__: To avoid problems, test_idle ignores the user config directory. It no longer tries to create or access .idlerc or any files within. Users must run IDLE to discover problems with saving settings.
es: `bpo-38183 <https://bugs.python.org/issue38183>`__: Para evitar problemas, Test_idle ignora el directorio de configuración del usuario.Ya no intenta crear o acceder a .idlerc o cualquier archivo dentro.Los usuarios deben ejecutarse inactivos para descubrir problemas con la configuración de guardado.

source: `bpo-38077 <https://bugs.python.org/issue38077>`__: IDLE no longer adds 'argv' to the user namespace when initializing it. This bug only affected 3.7.4 and 3.8.0b2 to 3.8.0b4.
es: `bpo-38077 <https://bugs.python.org/issue38077>`__: inactivo ya no agrega 'argv' al espacio de nombres de usuario al inicializarlo. Este error solo afectó 3.7.4 y 3.8.0B2 a 3.8.0B4.

source: `bpo-38041 <https://bugs.python.org/issue38041>`__: Shell restart lines now fill the window width, always start with '=', and avoid wrapping unnecessarily. The line will still wrap if the included file name is long relative to the width.
es: `bpo-38041 <https://bugs.python.org/issue38041>`__: Líneas de reinicio de Shell Ahora llenan el ancho de la ventana, siempre comience con '=', y evite envolver innecesariamente.La línea aún se envolverá si el nombre de archivo incluido es largo en relación con el ancho.

source: `bpo-35771 <https://bugs.python.org/issue35771>`__: To avoid occasional spurious test_idle failures on slower machines, increase the ``hover_delay`` in test_tooltip.
es: `bpo-35771 <https://bugs.python.org/issue35771>`__: Para evitar fallas de test_idle espurias ocasionales en máquinas más lentas, aumente el ``hover_delay`` en Test_Tooltip.

source: `bpo-37902 <https://bugs.python.org/issue37902>`__: Add mousewheel scrolling for IDLE module, path, and stack browsers. Patch by George Zhang.
es: `bpo-37902 <https://bugs.python.org/issue37902>`__: Agregue el desplazamiento de la rueda de mouse para el módulo inactivo, la ruta y los navegadores de pila. Parche por george zhang.

source: `bpo-37803 <https://bugs.python.org/issue37803>`__: pdb's ``--help`` and ``--version`` long options now work.
es: `bpo-37803 <https://bugs.python.org/issue37803>`__: ``--help`` y ``--version`` de pdb opciones largas ahora funcionan.

source: `bpo-37064 <https://bugs.python.org/issue37064>`__: Add option -k to pathscript.py script: preserve shebang flags. Add option -a to pathscript.py script: add flags.
es: `bpo-37064 <https://bugs.python.org/issue37064>`__: Agregar opción -k a shypscript.py script: preservar flags de shebang.Agregar la opción -A a PathScript.py Script: Agregar flags.

source: `bpo-38234 <https://bugs.python.org/issue38234>`__: :c:func:`Py_SetPath` now sets :data:`sys.executable` to the program full path (:c:func:`Py_GetProgramFullPath`) rather than to the program name (:c:func:`Py_GetProgramName`).
es: `bpo-38234 <https://bugs.python.org/issue38234>`__: :c:func:`Py_SetPath` ahora se establece :data:`sys.executable` a la ruta completa del programa (:c:func:`Py_getProgramfullpath`) En lugar de al nombre del programa (:c:func:`Py_GetProgramName`).

source: `bpo-38234 <https://bugs.python.org/issue38234>`__: Python ignored arguments passed to :c:func:`Py_SetPath`, :c:func:`Py_SetPythonHome` and :c:func:`Py_SetProgramName`: fix Python initialization to use specified arguments.
es: `bpo-38234 <https://bugs.python.org/issue38234>`__: Python ignorado los argumentos pasados a:c:func:`PY_SETPATH` ,:c:func:`PY_SETPYPHONHOME` y:c:func:`PY_SETPROGRAMNAME`: Arreglar la inicialización de Python para usar argumentos especificados.

source: `bpo-38205 <https://bugs.python.org/issue38205>`__: The :c:func:`Py_UNREACHABLE` macro now calls :c:func:`Py_FatalError`.
es: `bpo-38205 <https://bugs.python.org/issue38205>`__:c:func:`PY_UNRECKABLE 'MACRO ahora llama:c:func:`PY_FATALERROR`.

source: `bpo-37879 <https://bugs.python.org/issue37879>`__: Fix subtype_dealloc to suppress the type decref when the base type is a C heap type
es: `bpo-37879 <https://bugs.python.org/issue37879>`__: Fix Subtype_Dealloc para suprimir el tipo Decref cuando el tipo base es un tipo C MONES

source: *Release date: 2019-08-29*
es: * Fecha de lanzamiento: 2019-08-29 *

source: `bpo-34155 <https://bugs.python.org/issue34155>`__: Fix parsing of invalid email addresses with more than one ``@`` (e.g. a@b@c.com.) to not return the part before 2nd ``@`` as valid email address. Patch by maxking & jpic.
es: `bpo-34155 <https://bugs.python.org/issue34155>`__: Arregla el análisis de las direcciones de correo electrónico no válidas con más de uno` `@ '(por ejemplo, A @ b @ c.com) para no retornar elParte antes de 2nd ``@` `como dirección de correo electrónico válida. Parche por maxking & jpic.

source: `bpo-37947 <https://bugs.python.org/issue37947>`__: Adjust correctly the recursion level in the symtable generation for named expressions. Patch by Pablo Galindo.
es: `bpo-37947 <https://bugs.python.org/issue37947>`__: Ajuste correctamente el nivel de recursión en la generación simbática para expresiones nombradas.Parche de Pablo Galindo.

source: `bpo-37830 <https://bugs.python.org/issue37830>`__: Fixed compilation of :keyword:`break` and :keyword:`continue` in the :keyword:`finally` block when the corresponding :keyword:`try` block contains :keyword:`return` with a non-constant value.
es: `bpo-37830 <https://bugs.python.org/issue37830>`__: Compilación fija de :keyword:`break` y :keyword:`continue` en un bloque :keyword:`finally` cuando el correspondiente :keyword:`try correspondiente:: `Try` Block Contiene: Palabra clave:`retorna` con un valor no constante.

source: `bpo-32912 <https://bugs.python.org/issue32912>`__: Reverted :issue:`32912`: emitting :exc:`SyntaxWarning` instead of :exc:`DeprecationWarning` for invalid escape sequences in string and bytes literals.
es: `bpo-32912 <https://bugs.python.org/issue32912>`__: revertido :issue: `32912`: Emisión: EXC:`Syntaxwarning 'en lugar de:exc:`deprecationwarning` para secuencias de escape no válidas en cadena yBytes literales.

source: `bpo-37757 <https://bugs.python.org/issue37757>`__: :pep:`572`: As described in the PEP, assignment expressions now raise :exc:`SyntaxError` when their interaction with comprehension scoping results in an ambiguous target scope.
es: `bpo-37757 <https://bugs.python.org/issue37757>`__: :pep:`572`: Como se describe en la PEP, las expresiones de asignación ahora aumentan :exc:`SyntaxError` Cuando su interacción con los resultados de comprensión de comprensión en un ámbito objetivo ambiguo.

source: The ``TargetScopeError`` subclass originally proposed by the PEP has been removed in favour of just raising regular syntax errors for the disallowed cases.
es: La subclase ``TargetScopeError`` originalmente propuesto por el PEP se ha eliminado a favor de simplemente elevar los errores de sintaxis regular para los casos no permitidos.

source: `bpo-36311 <https://bugs.python.org/issue36311>`__: Decoding bytes objects larger than 2GiB is faster and no longer fails when a multibyte characters spans a chunk boundary.
es: `bpo-36311 <https://bugs.python.org/issue36311>`__: Decodificación Los objetos de bytes más grandes que 2GIB son más rápidos y ya no falla cuando los caracteres multibyte aumentan un límite de un trozo.

source: `bpo-37433 <https://bugs.python.org/issue37433>`__: Fix ``SyntaxError`` indicator printing too many spaces for multi-line strings - by Anthony Sottile.
es: `bpo-37433 <https://bugs.python.org/issue37433>`__: Arregla ``SyntaxArror`` Indicator Indicator imprime demasiados espacios para cadenas de múltiples líneas: por Anthony Sottile.

source: `bpo-20523 <https://bugs.python.org/issue20523>`__: ``pdb.Pdb`` supports ~/.pdbrc in Windows 7. Patch by Tim Hopper and Dan Lidral-Porter.
es: `bpo-20523 <https://bugs.python.org/issue20523>`__: ``pdb.pdb`` sports ~ / .pdbrc en Windows 7. Parche por Tim Hopper y Dan Lidral-Porter.

source: `bpo-37834 <https://bugs.python.org/issue37834>`__: Prevent shutil.rmtree exception when built on non-Windows system without fd system call support, like older versions of macOS.
es: `bpo-37834 <https://bugs.python.org/issue37834>`__: Evite la excepción de Stildil.RmTree cuando se construye en el sistema no con Windows sin soporte de llamada de sistema FD, como versiones anteriores de MacOS.

source: `bpo-37965 <https://bugs.python.org/issue37965>`__: Fix C compiler warning caused by distutils.ccompiler.CCompiler.has_function.
es: `bpo-37965 <https://bugs.python.org/issue37965>`__: FIX C Compiler Advertencia causada por Distutils.ccompiler.ccompiler.has_function.

source: `bpo-37960 <https://bugs.python.org/issue37960>`__: ``repr()`` of buffered and text streams now silences only expected exceptions when get the value of "name" and "mode" attributes.
es: `bpo-37960 <https://bugs.python.org/issue37960>`__: ``repr()`` de flujos tamponados y de texto ahora los silencios solo los silencies solo se esperan excepciones cuando obtiene el valor de los atributos "Nombre" y "MODO".

source: `bpo-37951 <https://bugs.python.org/issue37951>`__: Most features of the subprocess module now work again in subinterpreters. Only *preexec_fn* is restricted in subinterpreters.
es: `bpo-37951 <https://bugs.python.org/issue37951>`__: La mayoría de las características del módulo de subproceso ahora funcionan nuevamente en los subnterrenes.SOLO * PREEXEC_FN * está restringido en subinterpretadores.

source: `bpo-36205 <https://bugs.python.org/issue36205>`__: Fix the rusage implementation of time.process_time() to correctly report the sum of the system and user CPU time.
es: `bpo-36205 <https://bugs.python.org/issue36205>`__: Arregla la implementación de la rusage de tiempo.process_time() para informar correctamente la suma del sistema y el tiempo de la CPU del usuario.

source: `bpo-37950 <https://bugs.python.org/issue37950>`__: Fix :func:`ast.dump` when call with incompletely initialized node.
es: `bpo-37950 <https://bugs.python.org/issue37950>`__: FIX:func:`AST.Dump` cuando llame con un nodo inicializado incompletamente.

source: `bpo-34679 <https://bugs.python.org/issue34679>`__: Restores instantiation of Windows IOCP event loops from the non-main thread.
es: `bpo-34679 <https://bugs.python.org/issue34679>`__: restaura la instancia de los bucles de eventos de Windows IOCP del hilo no principal.
