Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: Python next
es: Python Siguiente

source: *Release date: XXXX-XX-XX*
es: * Fecha de lanzamiento: xxxx-xx-xx *

source: Core and Builtins
es: Núcleo e integrados

source: `bpo-39562 <https://bugs.python.org/issue39562>`__: The constant values of future flags in the :mod:`__future__` module are updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``.
es: `bpo-39562 <https://bugs.python.org/issue39562>`__: Los valores constantes de futuras flags en el módulo :mod:`__future__` se actualizan para evitar la colisión con las flags del compilador. Anteriormente ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` se enfrentó con ``CO_FUTURE_DIVISION``.

source: Library
es: Biblioteca

source: `bpo-40398 <https://bugs.python.org/issue40398>`__: :func:`typing.get_args` now always returns an empty tuple for special generic aliases.
es: `bpo-40398 <https://bugs.python.org/issue40398>`__: :func:`typing.get_args` ahora siempre retorna una tupla vacía para alias genéricos especiales.

source: Documentation
es: Documentación

source: `bpo-39435 <https://bugs.python.org/issue39435>`__: Fix an incorrect signature for :func:`pickle.loads` in the docs
es: `bpo-39435 <https://bugs.python.org/issue39435>`__: Arregla una firma incorrecta para :func:`pickle.loads` en los documentos

source: `bpo-40412 <https://bugs.python.org/issue40412>`__: Nullify inittab_copy during finalization, preventing future interpreter initializations in an embedded situation from crashing. Patch by Gregory Szorc.
es: `bpo-40412 <https://bugs.python.org/issue40412>`__: nulify inittab_copy durante la finalización, evitando las iniciales futuras del intérprete en una situación incrustada de choque. Parche por Gregory Szorc.

source: Python 3.8.3 release candidate 1
es: Python 3.8.3 Liberación candidata 1

source: *Release date: 2020-04-29*
es: * Fecha de lanzamiento: 2020-04-29 *

source: Security
es: Seguridad

source: `bpo-40121 <https://bugs.python.org/issue40121>`__: Fixes audit events raised on creating a new socket.
es: `bpo-40121 <https://bugs.python.org/issue40121>`__: corrige los eventos de auditoría levantados en la creación de un nuevo socket.

source: `bpo-38576 <https://bugs.python.org/issue38576>`__: Disallow control characters in hostnames in http.client, addressing CVE-2019-18348. Such potentially malicious header injection URLs now cause a InvalidURL to be raised.
es: `bpo-38576 <https://bugs.python.org/issue38576>`__: rechazó los caracteres de control en los nombres de host en http.client, diríjase a CVE-2019-18348.Tales URL de inyección de encabezado potencialmente malintencionadas ahora hacen que se genere un InvalidURL.

source: `bpo-39503 <https://bugs.python.org/issue39503>`__: CVE-2020-8492: The :class:`~urllib.request.AbstractBasicAuthHandler` class of the :mod:`urllib.request` module uses an inefficient regular expression which can be exploited by an attacker to cause a denial of service. Fix the regex to prevent the catastrophic backtracking. Vulnerability reported by Ben Caller and Matt Schwager.
es: `bpo-39503 <https://bugs.python.org/issue39503>`__: CVE-2020-8492: la :clase:`~urllib.request.AbstractBasicAuthHandller` de módulo :mod:`urllib.request` Utiliza una expresión regular ineficiente que puede ser explotada por un atacante para causar una denegación de servicio.Arregla la regularización para evitar el retroceso catastrófico. Vulnerabilidad reportada por Ben Caller y Matt Schwager.

source: `bpo-20526 <https://bugs.python.org/issue20526>`__: Fix :c:func:`PyThreadState_Clear()`. ``PyThreadState.frame`` is a borrowed reference, not a strong reference: ``PyThreadState_Clear()`` must not call ``Py_CLEAR(tstate->frame)``.
es: `bpo-20526 <https://bugs.python.org/issue20526>`__: Arregla :c:func:`PyThreadState_Clear()`. ``PyThreadState.frame`` es una referencia prestada, no una referencia fuerte: ``PyThreadState_Clear()`` no debe llamar a ``Py_CLEAR(tstate->frame)``.

source: `bpo-39965 <https://bugs.python.org/issue39965>`__: Correctly raise ``SyntaxError`` if *await* is used inside non-async functions and ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` is set (like in the asyncio REPL). Patch by Pablo Galindo.
es: `bpo-39965 <https://bugs.python.org/issue39965>`__: Levanta correctamente ``SyntaxError`` if *await* se usa dentro de las funciones no async y ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` se establece (como en el asyncio REPL). Parche de Pablo Galindo.

source: `bpo-39562 <https://bugs.python.org/issue39562>`__: Allow executing asynchronous comprehensions on the top level when the ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` flag is given. Patch by Batuhan Taskaya.
es: `bpo-39562 <https://bugs.python.org/issue39562>`__: Permitir ejecutar las comprensiones asíncronas en el nivel superior cuando se da la flag ``PyCF_ALLOW_TOP_LEVEL_AWAIT``. Parche de Batuhan Taskaya.

source: `bpo-38894 <https://bugs.python.org/issue38894>`__: Fix a bug that was causing incomplete results when calling ``pathlib.Path.glob`` in the presence of symlinks that point to files where the user does not have read access. Patch by Pablo Galindo and Matt Wozniski.
es: `bpo-38894 <https://bugs.python.org/issue38894>`__: Arregla un error que estaba causando resultados incompletos al llamar ``pathlib.Path.glob`` en la presencia de simlinks que apuntan a los archivos donde elEl usuario no tiene acceso de lectura.Patch de Pablo Galindo y Matt Wozniski.

source: `bpo-39871 <https://bugs.python.org/issue39871>`__: Fix a possible :exc:`SystemError` in ``math.{atan2,copysign,remainder}()`` when the first argument cannot be converted to a :class:`float`. Patch by Zachary Spytz.
es: `bpo-39871 <https://bugs.python.org/issue39871>`__: Fix A Posible :exc:`SystemError` en ``math.{atan2,copysign,remainder}()`` cuando el primer argumento no puede ser convertido a :class:`float`. Parche de Zachary Spytz.

source: `bpo-39776 <https://bugs.python.org/issue39776>`__: Fix race condition where threads created by PyGILState_Ensure() could get a duplicate id.
es: `bpo-39776 <https://bugs.python.org/issue39776>`__: Arregla la condición de carrera donde los hilos creados por Pygilstate_ensure() podrían obtener una identificación duplicada.

source: This affects consumers of tstate->id like the contextvar caching machinery, which could return invalid cached objects under heavy thread load (observed in embedded scenarios).
es: Esto afecta a los consumidores de Tstate-> id como la maquinaria de almacenamiento en caché de contextvar, que podría retornar objetos en caché no válidos bajo carga de hilo pesado (observado en escenarios incrustados).

source: `bpo-39778 <https://bugs.python.org/issue39778>`__: Fixed a crash due to incorrect handling of weak references in ``collections.OrderedDict`` classes. Patch by Pablo Galindo.
es: `bpo-39778 <https://bugs.python.org/issue39778>`__: Se corrigió un choque debido al manejo incorrecto de las referencias débiles en las clases de ``collection.OrderedDict``. Parche de Pablo Galindo.

source: `bpo-39520 <https://bugs.python.org/issue39520>`__: Fix unparsing of ext slices with no items (``foo[:,]``). Patch by Batuhan Taskaya.
es: `bpo-39520 <https://bugs.python.org/issue39520>`__: Arregla el deshielo de las rebanadas externas sin elementos (``foo[:,]``). Parche de Batuhan Taskaya.

source: `bpo-22490 <https://bugs.python.org/issue22490>`__: Don't leak environment variable ``__PYVENV_LAUNCHER__`` into the interpreter session on macOS.
es: `bpo-22490 <https://bugs.python.org/issue22490>`__: No fugas la variable de ambiente ``__pyvenvenv_launcher__`` en la sesión del intérprete en MacOS.

source: `bpo-40138 <https://bugs.python.org/issue40138>`__: Fix the Windows implementation of :func:`os.waitpid` for exit code larger than ``INT_MAX >> 8``. The exit status is now interpreted as an unsigned number.
es: `bpo-40138 <https://bugs.python.org/issue40138>`__: Arregla la implementación de Windows de:func:`OS.WAITPID` para el código de salida más grande que`` int_max >> 8``.El estado de salida ahora se interpreta como un número sin firmar.

source: `bpo-39942 <https://bugs.python.org/issue39942>`__: Set "__main__" as the default module name when "__name__" is missing in :class:`typing.TypeVar`. Patch by Weipeng Hong.
es: `bpo-39942 <https://bugs.python.org/issue39942>`__: se establece "__main__" como el nombre de módulo predeterminado cuando falta "__name__" en:class:`typing.typevar`. Parche por weipeng hong.

source: `bpo-40330 <https://bugs.python.org/issue40330>`__: In :meth:`ShareableList.__setitem__`, check the size of a new string item after encoding it to utf-8, not before.
es: `bpo-40330 <https://bugs.python.org/issue40330>`__: en:meth:`Shareabelist .__ SetItem__`, verifique el tamaño de un nuevo elemento de cadena después de codificarlo a UTF-8, no antes.

source: `bpo-40287 <https://bugs.python.org/issue40287>`__: Fixed ``SpooledTemporaryFile.seek()`` to return the position.
es: `bpo-40287 <https://bugs.python.org/issue40287>`__: fijo ``SpooledTemporaryFile.seek()`` para retornar la posición.

source: `bpo-40260 <https://bugs.python.org/issue40260>`__: Ensure :mod:`modulefinder` uses :func:`io.open_code` and respects coding comments.
es: `bpo-40260 <https://bugs.python.org/issue40260>`__: Asegúrese:mod:`ModuleFinder` usa:func:`io.open_code` y respetan los comentarios de codificación.

source: `bpo-40196 <https://bugs.python.org/issue40196>`__: Fix a bug in the :mod:`symtable` module that was causing incorrectly report global variables as local. Patch by Pablo Galindo.
es: `bpo-40196 <https://bugs.python.org/issue40196>`__: Arregla un error en :mod:`symtable` módulo que estaba causando reportar incorrectamente las variables globales como local. Parche de Pablo Galindo.

source: `bpo-40126 <https://bugs.python.org/issue40126>`__: Fixed reverting multiple patches in unittest.mock. Patcher's ``__exit__()`` is now never called if its ``__enter__()`` is failed. Returning true from ``__exit__()`` silences now the exception.
es: `bpo-40126 <https://bugs.python.org/issue40126>`__: Se corrigió el reversión de múltiples parches en unittest.mock. El ``__exit __()`` del parche ahora nunca se llama si se ha fallado ``__enter__()``. Retornando verdadero desde ``__exit__()`` silencia ahora la excepción.

source: `bpo-40089 <https://bugs.python.org/issue40089>`__: Fix threading._after_fork(): if fork was not called by a thread spawned by threading.Thread, threading._after_fork() now creates a _MainThread instance for _main_thread, instead of a _DummyThread instance.
es: `bpo-40089 <https://bugs.python.org/issue40089>`__: Arregla threading._after_fork(): si el hilo no fue llamado por un hilo lanzado por threading.Thread, threading._after_fork() ahora crea una instancia _MainThread para _main_thread, en lugar de una instancia _DummyThread.

source: `bpo-39503 <https://bugs.python.org/issue39503>`__: :class:`~urllib.request.AbstractBasicAuthHandler` of :mod:`urllib.request` now parses all WWW-Authenticate HTTP headers and accepts multiple challenges per header: use the realm of the first Basic challenge.
es: `bpo-39503 <https://bugs.python.org/issue39503>`__: :class:`~urllib.request.AbstractBasicAuthHandler` de :mod:`urllib.request` ahora analiza todos los encabezados HTTP y aceptan WWW-múltiples desafíos por encabezado: use el realm del primer desafío básico.

source: `bpo-40014 <https://bugs.python.org/issue40014>`__: Fix ``os.getgrouplist()``: if ``getgrouplist()`` function fails because the group list is too small, retry with a larger group list. On failure, the glibc implementation of ``getgrouplist()`` sets ``ngroups`` to the total number of groups. For other implementations, double the group list size.
es: `bpo-40014 <https://bugs.python.org/issue40014>`__: fix ``os.getgroupplist()``: Si ``getgroupplist()`` la función falla porque la lista de grupos es demasiado pequeña, vuelva a intentarlo con una lista de grupos más grandes. En el fracaso, la implementación de GLIBC de ``getgroupplist()`` establece ``ngroups`` del número total de grupos. Para otras implementaciones, doble el tamaño de la lista de grupos.

source: `bpo-40016 <https://bugs.python.org/issue40016>`__: In re docstring, clarify the relationship between inline and argument compile flags.
es: `bpo-40016 <https://bugs.python.org/issue40016>`__: en Re Docstring, aclare la relación entre las flags de compilación en línea y argumento.

source: `bpo-39953 <https://bugs.python.org/issue39953>`__: Update internal table of OpenSSL error codes in the ``ssl`` module.
es: `bpo-39953 <https://bugs.python.org/issue39953>`__: Actualiza la tabla interna de códigos de error OpenSSL en el módulo ``ssl``.

source: `bpo-39360 <https://bugs.python.org/issue39360>`__: Ensure all workers exit when finalizing a :class:`multiprocessing.Pool` implicitly via the module finalization handlers of multiprocessing. This fixes a deadlock situation that can be experienced when the Pool is not properly finalized via the context manager or a call to ``multiprocessing.Pool.terminate``. Patch by Batuhan Taskaya and Pablo Galindo.
es: `bpo-39360 <https://bugs.python.org/issue39360>`__: Asegúrese de que todos los trabajadores salgan al finalizar una :class:`multiprocessing.Pool` implícitamente a través de los manipuladores de finalización del módulo de multiprocesamiento. Esto corrige una situación de interbloqueo que se puede experimentar cuando la piscina no se finaliza correctamente a través del administrador de contexto o una llamada a ``multiprocessing.pool.terminate``. Parche de Batuhan Taskaya y Pablo Galindo.

source: `bpo-39652 <https://bugs.python.org/issue39652>`__: The column name found in ``sqlite3.Cursor.description`` is now truncated on the first '[' only if the PARSE_COLNAMES option is set.
es: `bpo-39652 <https://bugs.python.org/issue39652>`__: El nombre de la columna encontrado en ``sqlite3.cursor.description`` ahora se trunca en la primera '[' solo si la opción parse_colnames se establece.

source: `bpo-39915 <https://bugs.python.org/issue39915>`__: Ensure :attr:`unittest.mock.AsyncMock.await_args_list` has call objects in the order of awaited arguments instead of using :attr:`unittest.mock.Mock.call_args` which has the last value of the call. Patch by Karthikeyan Singaravelan.
es: `bpo-39915 <https://bugs.python.org/issue39915>`__: Asegúrese: attr: `Unittest.mock.asyncmock.await_args_list` ha llamado a objetos en el orden de los argumentos esperados en lugar de usar: attr:`unittest.mock.mock.call_args` que tiene el último valor de la llamada. Parche por karthikeyan singaravelan.

source: `bpo-38662 <https://bugs.python.org/issue38662>`__: The ``ensurepip`` module now invokes ``pip`` via the ``runpy`` module. Hence it is no longer tightly coupled with the internal API of the bundled ``pip`` version, allowing easier updates to a newer ``pip`` version both internally and for distributors.
es: `bpo-38662 <https://bugs.python.org/issue38662>`__: el módulo ``ensurepip`` ahora invoca ``pip`` a través del módulo ``runpy``. Por lo tanto, ya no se ve estrechamente acoplado con la API interna de la versión de ``pip``, permitiendo actualizaciones más fáciles de una versión más reciente ``pip`` internamente internamente y para los distribuidores.

source: `bpo-39916 <https://bugs.python.org/issue39916>`__: More reliable use of ``os.scandir()`` in ``Path.glob()``. It no longer emits a ResourceWarning when interrupted.
es: `bpo-39916 <https://bugs.python.org/issue39916>`__: Uso más confiable de ``os.scandir()`` en ``Path.glob()``.Ya no emite un avance de recursos cuando se interrumpe.

source: `bpo-39850 <https://bugs.python.org/issue39850>`__: :mod:`multiprocessing` now supports abstract socket addresses (if abstract sockets are supported in the running platform). Patch by Pablo Galindo.
es: `bpo-39850 <https://bugs.python.org/issue39850>`__: :mod:`multiprocessing` ahora es compatible con las direcciones de socket abstracta (si se admiten tomas abstractas en la plataforma de ejecución). Parche de Pablo Galindo.

source: `bpo-39828 <https://bugs.python.org/issue39828>`__: Fix :mod:`json.tool` to catch :exc:`BrokenPipeError`. Patch by Dong-hee Na.
es: `bpo-39828 <https://bugs.python.org/issue39828>`__: corregir:mod:`json.tool` para atrapar: Exc:`BrokenPipeError`. Parche por dong-hee na.

source: `bpo-13487 <https://bugs.python.org/issue13487>`__: Avoid a possible *"RuntimeError: dictionary changed size during iteration"* from :func:`inspect.getmodule` when it tried to loop through :attr:`sys.modules`.
es: `bpo-13487 <https://bugs.python.org/issue13487>`__: Evite un posible * "RunTimeError: Diccionario cambiado de tamaño durante la iteración" * desde:func:`inspect.getmodule` cuando intentó volver a subir:attr: `sys.modules`.

source: `bpo-39794 <https://bugs.python.org/issue39794>`__: Add --without-decimal-contextvar build option. This enables a thread-local rather than a coroutine local context.
es: `bpo-39794 <https://bugs.python.org/issue39794>`__: Añade la opción de construir --without-decimal-contextvar. Esto permite un índice local en lugar de un contexto local de Coroutine.

source: `bpo-39769 <https://bugs.python.org/issue39769>`__: The :func:`compileall.compile_dir` function's *ddir* parameter and the compileall command line flag `-d` no longer write the wrong pathname to the generated pyc file for submodules beneath the root of the directory tree being compiled. This fixes a regression introduced with Python 3.5.
es: `bpo-39769 <https://bugs.python.org/issue39769>`__: la :func:`compileall.compile_dir` *ddir* parámetro y el indicador de línea de comandos compileal'-D 'ya no escribe el nombre de ruta incorrectaal archivo PYC generado para submódulos debajo de la raíz del árbol de directorios que se está compilando. Esto corrige una regresión introducida con Python 3.5.

source: `bpo-39517 <https://bugs.python.org/issue39517>`__: Fix runpy.run_path() when using pathlike objects
es: `bpo-39517 <https://bugs.python.org/issue39517>`__: Arregla runpy.run_path() cuando se usa objetos en forma de ruta

source: `bpo-39764 <https://bugs.python.org/issue39764>`__: Fix AttributeError when calling get_stack on a PyAsyncGenObject Task
es: `bpo-39764 <https://bugs.python.org/issue39764>`__: Fix AttributeError al llamar a Get_Stack en una tarea PyasyncgenObject

source: `bpo-30566 <https://bugs.python.org/issue30566>`__: Fix :exc:`IndexError` when trying to decode an invalid string with punycode codec.
es: `bpo-30566 <https://bugs.python.org/issue30566>`__: FIX: EXC: 'indexError` al intentar decodificar una cadena no válida con el códec dominycode.

source: `bpo-39667 <https://bugs.python.org/issue39667>`__: Correct performance degradation in ``zipfile.Path`` as found in zipp 3.0. While retaining compatibility, this change discourages the use of ``zipfile.Path.open`` due to the signature change in Python 3.9. For compatibility across Python 3.8 and later versions, consider using ``zipp.Path`` on Python 3.8.x and earlier.
es: `bpo-39667 <https://bugs.python.org/issue39667>`__: Degradación correcta del rendimiento en ``zipfile.Path`` como se encuentra en ZIPP 3.0.Mientras mantiene la compatibilidad, este cambio desalienta el uso de ``zipfile.Path.Open``, debido al cambio de firma en Python 3.9.Para compatibilidad a través de Python 3.8 y versiones posteriores, considere usar ``zipp.Path`` en Python 3.8.x y anteriormente.

source: `bpo-39548 <https://bugs.python.org/issue39548>`__: Fix handling of header in :class:`urllib.request.AbstractDigestAuthHandler` when the optional ``qop`` parameter is not present.
es: `bpo-39548 <https://bugs.python.org/issue39548>`__: Fix Manipulación del encabezado en :class:`urllib.request.AbstractDigestAuthHandler` Cuando el parámetro opcional ``qop`` está presente.

source: `bpo-38971 <https://bugs.python.org/issue38971>`__: Open issue in the BPO indicated a desire to make the implementation of codecs.open() at parity with io.open(), which implements a try/except to assure file stream gets closed before an exception is raised.
es: `bpo-38971 <https://bugs.python.org/issue38971>`__: El problema abierto en el BPO indicó el deseo de hacer la implementación de los códecmos. ABOEN() en paridad con io.open(), que implementa unaintente / excepto para asegurar que el flujo de archivos se cierra antes de que se levante una excepción.

source: `bpo-38410 <https://bugs.python.org/issue38410>`__: Properly handle :func:`sys.audit` failures in :func:`sys.set_asyncgen_hooks`. Based on patch by Zackery Spytz.
es: `bpo-38410 <https://bugs.python.org/issue38410>`__: maneja adecuadamente fallas :func:`sys.audit` en :func:`sys.set_asyncgen_hooks`. Basado en el parche por Zackery Spytz.

source: `bpo-36541 <https://bugs.python.org/issue36541>`__: lib2to3 now recognizes named assignment expressions (the walrus operator, ``:=``)
es: `bpo-36541 <https://bugs.python.org/issue36541>`__: lib2to3 ahora reconoce las expresiones de asignación nombrada (el operador de la mora, ``:=``)

source: `bpo-31758 <https://bugs.python.org/issue31758>`__: Prevent crashes when using an uninitialized ``_elementtree.XMLParser`` object. Patch by Oren Milman.
es: `bpo-31758 <https://bugs.python.org/issue31758>`__: Evite los choques al usar un objeto no inicializado ``_ElementTree.xmlparser``. Parche por oren milman.

source: `bpo-27635 <https://bugs.python.org/issue27635>`__: The pickle documentation incorrectly claimed that ``__new__`` isn't called by default when unpickling.
es: `bpo-27635 <https://bugs.python.org/issue27635>`__: La documentación de Pickle afirmó incorrectamente que ``__New__`` no se llama de forma predeterminada cuando no se ponen en contacto.

source: `bpo-39879 <https://bugs.python.org/issue39879>`__: Updated :ref:`datamodel` docs to include :func:`dict` insertion order preservation. Patch by Furkan Onder and Samy Lahfa.
es: `bpo-39879 <https://bugs.python.org/issue39879>`__: Actualizado :ref:`datamodel` Docs para incluir :func:`dict` pedido de inserción de la preservación. Parche de Furkan Onder y Samy Lahfa.

source: `bpo-39868 <https://bugs.python.org/issue39868>`__: Updated the Language Reference for :pep:`572`.
es: `bpo-39868 <https://bugs.python.org/issue39868>`__: Actualizado la referencia del idioma para:pep:`572`.

source: `bpo-13790 <https://bugs.python.org/issue13790>`__: Change 'string' to 'specification' in format doc.
es: `bpo-13790 <https://bugs.python.org/issue11790>`__: Cambiar 'cadena' a 'especificación' en formato doc.

source: `bpo-17422 <https://bugs.python.org/issue17422>`__: The language reference no longer restricts default class namespaces to dicts only.
es: `bpo-17422 <https://bugs.python.org/issue17422>`__: La referencia del idioma ya no restringe los espacios de nombres de clase predeterminados a los dicts solamente.

source: `bpo-39530 <https://bugs.python.org/issue39530>`__: Fix misleading documentation about mixed-type numeric comparisons.
es: `bpo-39530 <https://bugs.python.org/issue39530>`__: Arregla la documentación engañosa sobre las comparaciones numéricas de tipo mixto.

source: `bpo-39718 <https://bugs.python.org/issue39718>`__: Update :mod:`token` documentation to reflect additions in Python 3.8
es: `bpo-39718 <https://bugs.python.org/issue39718>`__: Actualización:mod:`token` Documentation para reflejar las adiciones en Python 3.8

source: `bpo-39677 <https://bugs.python.org/issue39677>`__: Changed operand name of **MAKE_FUNCTION** from *argc* to *flags* for module :mod:`dis`
es: `bpo-39677 <https://bugs.python.org/issue39677>`__: cambio de operando modificado ** make_function ** de * argc * a * flags * para módulo:mod:`dis`

source: `bpo-38387 <https://bugs.python.org/issue38387>`__: Document :c:macro:`PyDoc_STRVAR` macro in the C-API reference.
es: `bpo-38387 <https://bugs.python.org/issue38387>`__: Documento: C: Macro: `PyDOC_STRVAR` Macro en la referencia C-API.

source: Tests
es: Pruebas
