Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-37228 <https://bugs.python.org/issue37228>`__: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
es: `bpo-37228 <https://bugs.python.org/issue37228>`__: Debido a las preocupaciones significativas de seguridad, el parámetro * reuss_address * de:meth:`asyncio.loop.create_datagram_endpoint` ya no es compatible.Esto se debe al comportamiento de ``SO_REUSEADDR`` en UDP.Para obtener más detalles, consulte la documentación de ``loop.create_datagram_endpoint()``. (Contribuyó por Kyle Stanley, Antoine Pitrou, y Yury Selivanov en :issue:`37228`.)

source: `bpo-38722 <https://bugs.python.org/issue38722>`__: :mod:`runpy` now uses :meth:`io.open_code` to open code files. Patch by Jason Killen.
es: `bpo-38722 <https://bugs.python.org/issue38722>`__: :mod:`runpy` ahora usa :meth:`io.open_code` para abrir archivos de código. Parche por Jason Killen.

source: `bpo-38804 <https://bugs.python.org/issue38804>`__: Fixes a ReDoS vulnerability in :mod:`http.cookiejar`. Patch by Ben Caller.
es: `bpo-38804 <https://bugs.python.org/issue38804>`__: corrige una vulnerabilidad de redes en:mod:`http.cookiejar`. Parche por Ben Caller.

source: `bpo-38622 <https://bugs.python.org/issue38622>`__: Add additional audit events for the :mod:`ctypes` module.
es: `bpo-38622 <https://bugs.python.org/issue38622>`__: Agregar eventos de auditoría adicionales para el módulo de:mod:`ctypes`.

source: `bpo-38418 <https://bugs.python.org/issue38418>`__: Fixes audit event for :func:`os.system` to be named ``os.system``.
es: `bpo-38418 <https://bugs.python.org/issue38418>`__: corrige el evento de auditoría para:func:`OS.System` se llamará` `OS.system``.

source: `bpo-38673 <https://bugs.python.org/issue38673>`__: In REPL mode, don't switch to PS2 if the line starts with comment or whitespace. Based on work by Batuhan Taşkaya.
es: `bpo-38673 <https://bugs.python.org/issue38673>`__: En el modo de respuesta, no cambie a PS2 si la línea comienza con comentarios o espacios en blanco.Basado en el trabajo de Batuhan Taşkaya.

source: `bpo-38922 <https://bugs.python.org/issue38922>`__: Calling ``replace`` on a code object now raises the ``code.__new__`` audit event.
es: `bpo-38922 <https://bugs.python.org/issue38922>`__: Llamar ``Reemplazar`` en un objeto de código ahora lanza el evento de auditoría`` código .__ New__``.

source: `bpo-38920 <https://bugs.python.org/issue38920>`__: Add audit hooks for when :func:`sys.excepthook` and :func:`sys.unraisablehook` are invoked
es: `bpo-38920 <https://bugs.python.org/issue38920>`__: Agregue los ganchos de auditoría para cuando:func:`Sys.Exceptchook 'y: Func:`sys.unraisablehook` se invoca

source: `bpo-38892 <https://bugs.python.org/issue38892>`__: Improve documentation for audit events table and functions.
es: `bpo-38892 <https://bugs.python.org/issue38892>`__: Mejorar la documentación de la tabla y las funciones de los eventos de auditoría.

source: `bpo-38707 <https://bugs.python.org/issue38707>`__: ``MainThread.native_id`` is now correctly reset in child processes spawned using :class:`multiprocessing.Process`, instead of retaining the parent's value.
es: `bpo-38707 <https://bugs.python.org/issue38707>`__: ``MainThead.native_id`` ahora se reinicia correctamente en los procesos infantiles generados con:class:`multiprocessing.Process`, en lugar de retener los padresvalor.

source: `bpo-38640 <https://bugs.python.org/issue38640>`__: Fixed a bug in the compiler that was causing to raise in the presence of break statements and continue statements inside always false while loops. Patch by Pablo Galindo.
es: `bpo-38640 <https://bugs.python.org/issue38640>`__: Se corrigió un error en el compilador que estaba causando plantear en presencia de declaraciones de descanso y continuar las declaraciones dentro siempre falsas mientras los bucles. Parche de Pablo Galindo.

source: `bpo-38535 <https://bugs.python.org/issue38535>`__: Fixed line numbers and column offsets for AST nodes for calls without arguments in decorators.
es: `bpo-38535 <https://bugs.python.org/issue38535>`__: Números de línea fija y compensaciones de columna para los nodos ATT para llamadas sin argumentos en decoradores.

source: `bpo-38525 <https://bugs.python.org/issue38525>`__: Fix a segmentation fault when using reverse iterators of empty ``dict`` objects. Patch by Dong-hee Na and Inada Naoki.
es: `bpo-38525 <https://bugs.python.org/issue38525>`__: Arregla una falla de segmentación cuando se usa los iteradores inversos de los objetos vacíos ``dict``. Parche por dong-hee na y inada naoki.

source: `bpo-35409 <https://bugs.python.org/issue35409>`__: Ignore GeneratorExit exceptions when throwing an exception into the aclose coroutine of an asynchronous generator.
es: `bpo-35409 <https://bugs.python.org/issue35409>`__: Ignore las excepciones generadores de generación al lanzar una excepción a la Coroutina de ACLOSE de un generador asíncrono.

source: `bpo-39006 <https://bugs.python.org/issue39006>`__: Fix asyncio when the ssl module is missing: only check for ssl.SSLSocket instance if the ssl module is available.
es: `bpo-39006 <https://bugs.python.org/issue39006>`__: Fix Asyncio Cuando faltan el módulo SSL: solo compruebe si hay disponible la instancia SSL.SSLSocket si el módulo SSL está disponible.

source: `bpo-38708 <https://bugs.python.org/issue38708>`__: Fix a potential IndexError in email parser when parsing an empty msg-id.
es: `bpo-38708 <https://bugs.python.org/issue38708>`__: Arregla un potencial IndexError en el analizador de correo electrónico al analizar un MSG-ID vacío.

source: `bpo-38698 <https://bugs.python.org/issue38698>`__: Add a new ``InvalidMessageID`` token to email parser to represent invalid Message-ID headers. Also, add defects when there is remaining value after parsing the header.
es: `bpo-38698 <https://bugs.python.org/issue38698>`__: Agregue un nuevo `" InvalidMessageID`` token a la analizador de correo electrónico para representar los encabezados de identificación de mensajes no válidos.Además, agregue defectos cuando haya valor restante después de analizar el encabezado.

source: `bpo-38979 <https://bugs.python.org/issue38979>`__: Return class from ``ContextVar.__class_getitem__`` to simplify subclassing.
es: `bpo-38979 <https://bugs.python.org/issue38979>`__: clase de retorno de ``ContextVar.__class_getitem__`` para simplificar la subclasificación.

source: `bpo-38986 <https://bugs.python.org/issue38986>`__: Make repr of C accelerated TaskWakeupMethWrapper the same as of pure Python version.
es: `bpo-38986 <https://bugs.python.org/issue38986>`__: Haga REP DE C ACCIDENTE ACCIDENTEWAKETHUPMETHWETHWAPPER LO MISMO A LA VERSIÓN PURA PYTHON.

source: `bpo-38529 <https://bugs.python.org/issue38529>`__: Drop too noisy asyncio warning about deletion of a stream without explicit ``.close()`` call.
es: `bpo-38529 <https://bugs.python.org/issue38529>`__: gota demasiado ruidoso advertencia de Asyncio sobre la eliminación de una corriente sin explícito ``.close()`` Llamada.

source: `bpo-38634 <https://bugs.python.org/issue38634>`__: The :mod:`readline` module now detects if Python is linked to libedit at runtime on all platforms. Previously, the check was only done on macOS.
es: `bpo-38634 <https://bugs.python.org/issue38634>`__: El módulo :mod:`readline` ahora detecta si Python está vinculado a LiBedit en tiempo de ejecución en todas las plataformas. Anteriormente, el chequeo solo se realizó en MacOS.

source: `bpo-33684 <https://bugs.python.org/issue33684>`__: Fix ``json.tool`` failed to read a JSON file with non-ASCII characters when locale encoding is not UTF-8.
es: `bpo-33684 <https://bugs.python.org/issue33684>`__: Arregla ``json.tool`` no se leyó un archivo JSON con caracteres no ASCII cuando la codificación de la configuración regional no es UTF-8.

source: `bpo-38698 <https://bugs.python.org/issue38698>`__: Prevent UnboundLocalError to pop up in parse_message_id
es: `bpo-38698 <https://bugs.python.org/issue38698>`__: Evite que el unboundlocalerror se aparezca en parse_message_id

source: parse_message_id() was improperly using a token defined inside an exception handler, which was raising `UnboundLocalError` on parsing an invalid value. Patch by Claudiu Popa.
es: parse_message_id() estaba usando incorrectamente un token definido dentro de un controlador de excepciones, que estaba recaudando "sin límite, al analizar un valor no válido. Parche por claudiu POPA.

source: `bpo-26730 <https://bugs.python.org/issue26730>`__: Fix ``SpooledTemporaryFile.rollover()`` might corrupt the file when it is in text mode. Patch by Serhiy Storchaka.
es: `bpo-26730 <https://bugs.python.org/issue26730>`__: Arreglado``SpooledTemporaryFile.rollover()`` podría corromper el archivo cuando está en modo de texto. Parche por Serhiy Storchaka.

source: `bpo-38668 <https://bugs.python.org/issue38668>`__: Calling func:`shutil.copytree` to copy a directory tree from one directory to another subdirectory resulted in an endless loop and a RecursionError. A fix was added to consume an iterator and create the list of the entries to be copied, avoiding the recursion for newly created directories. Patch by Bruno P. Kinoshita.
es: `bpo-38668 <https://bugs.python.org/issue38668>`__: llamando a Func: `Stirlil.CopyTree` Copiar un árbol de directorio de un directorio a otro subdirectorio resultó en un bucle sin fin y un recursionError.Se agregó una solución para consumir un iterador y crear la lista de las entradas que se copiarán, evitando la recursión para los directorios recién creados. Parche por Bruno P. Kinoshita.

source: `bpo-37838 <https://bugs.python.org/issue37838>`__: :meth:`typing.get_type_hints` properly handles functions decorated with :meth:`functools.wraps`.
es: `bpo-37838 <https://bugs.python.org/issue37838>`__: :meth:`typing.get_type_hints` maneja correctamente las funciones decoradas con :meth:`functools.wraps`.

source: `bpo-38859 <https://bugs.python.org/issue38859>`__: AsyncMock now returns StopAsyncIteration on the exaustion of a side_effects iterable. Since PEP-479 its Impossible to raise a StopIteration exception from a coroutine.
es: `bpo-38859 <https://bugs.python.org/issue38859>`__: Asyncmock ahora retorna la parada de la detección en la exasión de un lado.Dado que PEP-479 es imposible de plantear una excepción de detención de una coroutina.

source: `bpo-38857 <https://bugs.python.org/issue38857>`__: AsyncMock fix for return values that are awaitable types. This also covers side_effect iterable values that happend to be awaitable, and wraps callables that return an awaitable type. Before these awaitables were being awaited instead of being returned as is.
es: `bpo-38857 <https://bugs.python.org/issue38857>`__: Asyncmock Fix para valores de retorno que son tipos esperados.Esto también cubre los valores iterables laterales que se dedican a ser esperados, y envuelve las calificaciones que retornan un tipo esperado.Antes de que estas esperadas estuvieran siendo esperadas en lugar de ser retornadas como está.

source: `bpo-38821 <https://bugs.python.org/issue38821>`__: Fix unhandled exceptions in :mod:`argparse` when internationalizing error messages for arguments with ``nargs`` set to special (non-integer) values. Patch by Federico Bond.
es: `bpo-38821 <https://bugs.python.org/issue38821>`__: Arregla las excepciones no manejadas en:mod:`Argparse` cuando internacionalice los mensajes de error para argumentos con` `nargs`` se establece en especial (no entero)valores.Parche de Federico Bond.

source: `bpo-38820 <https://bugs.python.org/issue38820>`__: Make Python compatible with OpenSSL 3.0.0. :func:`ssl.SSLSocket.getpeercert` no longer returns IPv6 addresses with a trailing new line.
es: `bpo-38820 <https://bugs.python.org/issue38820>`__: Haz que Python sea compatible con OpenSSL 3.0.0. :func:`ssl.sslsocket.getpeercert` ya no retorna las direcciones IPv6 con una nueva línea que se arrastra.

source: `bpo-38807 <https://bugs.python.org/issue38807>`__: Update :exc:`TypeError` messages for :meth:`os.path.join` to include :class:`os.PathLike` objects as acceptable input types.
es: `bpo-38807 <https://bugs.python.org/issue38807>`__: Actualización :exc:`TypeError` mensajes para :meth:`os.path.join` incluir :class:`os.PathLike` como tipos de entrada aceptables.

source: `bpo-38785 <https://bugs.python.org/issue38785>`__: Prevent asyncio from crashing if parent ``__init__`` is not called from a constructor of object derived from ``asyncio.Future``.
es: `bpo-38785 <https://bugs.python.org/issue38785>`__: Evite que Asyncio se estrelló si el padre ``__init__`` se llama desde un constructor de objeto derivado de ``asyncio.Future``.

source: `bpo-38723 <https://bugs.python.org/issue38723>`__: :mod:`pdb` now uses :meth:`io.open_code` to trigger auditing events.
es: `bpo-38723 <https://bugs.python.org/issue38723>`__: :mod:`pdb` ahora usa :meth:`io.open_code` para activar los eventos de auditoría.

source: `bpo-27805 <https://bugs.python.org/issue27805>`__: Allow opening pipes and other non-seekable files in append mode with :func:`open`.
es: `bpo-27805 <https://bugs.python.org/issue27805>`__: Permita que las tuberías de apertura y otros archivos no buscados en el modo Anexo con:func:`ABIERTE`.

source: `bpo-38686 <https://bugs.python.org/issue38686>`__: Added support for multiple ``qop`` values in :class:`urllib.request.AbstractDigestAuthHandler`.
es: `bpo-38686 <https://bugs.python.org/issue38686>`__: Añadido soporte para múltiples valores ``qop`` en :class:`urllib.Request.abstractdigestauthhandler`.

source: `bpo-38334 <https://bugs.python.org/issue38334>`__: Fixed seeking backward on an encrypted :class:`zipfile.ZipExtFile`.
es: `bpo-38334 <https://bugs.python.org/issue38334>`__: Se fija buscando hacia atrás en un encriptado :class:`ZipFile.ZipextFile`.

source: `bpo-34679 <https://bugs.python.org/issue34679>`__: asynci.ProactorEventLoop.close() now only calls signal.set_wakeup_fd() in the main thread.
es: `bpo-34679 <https://bugs.python.org/issue34679>`__: asynci.proactoreventloop.close() Ahora solo llama la señal.set_wakeup_fd() en el hilo principal.

source: `bpo-31202 <https://bugs.python.org/issue31202>`__: The case the result of :func:`pathlib.WindowsPath.glob` matches now the case of the pattern for literal parts.
es: `bpo-31202 <https://bugs.python.org/issue31202>`__: El caso del resultado de :func:`pathlib.windowspath.glob` coincide ahora en el caso del patrón de las partes literales.

source: `bpo-38521 <https://bugs.python.org/issue38521>`__: Fixed erroneous equality comparison in statistics.NormalDist().
es: `bpo-38521 <https://bugs.python.org/issue38521>`__: COMPARACIÓN DE IGUALDIDAD ERRONosa fija en estadísticas.normaldista().

source: `bpo-38478 <https://bugs.python.org/issue38478>`__: Fixed a bug in :meth:`inspect.signature.bind` that was causing it to fail when handling a keyword argument with same name as positional-only parameter. Patch by Pablo Galindo.
es: `bpo-38478 <https://bugs.python.org/issue38478>`__: Se corrigió un error en:meth:`inspeccionar.signature.bind` que lo estaba causando que fallará al manejar un argumento de palabras clave con el mismo nombre como posicional-Anly parámetro. Parche de Pablo Galindo.

source: `bpo-33604 <https://bugs.python.org/issue33604>`__: Fixed `hmac.new` and `hmac.HMAC` to raise TypeError instead of ValueError when the digestmod parameter, now required in 3.8, is omitted. Also clarified the hmac module documentation and docstrings.
es: `bpo-33604 <https://bugs.python.org/issue33604>`__: fijado `hmac.new` y `hmac.hmac` para elevar a TypeError en lugar de ValueError cuando el parámetro digestmod, ahora se requiere en 3.8, se omite. También aclaró la documentación y documentos de los módulos HMAC.

source: `bpo-38422 <https://bugs.python.org/issue38422>`__: Clarify docstrings of pathlib suffix(es)
es: `bpo-38422 <https://bugs.python.org/issue38422>`__: aclare los doces de los sufijos de Pathlib (es)

source: `bpo-36993 <https://bugs.python.org/issue36993>`__: Improve error reporting for corrupt zip files with bad zip64 extra data. Patch by Daniel Hillier.
es: `bpo-36993 <https://bugs.python.org/issue36993>`__: Mejorar los informes de errores para los archivos zip corruptos con los datos adicionales de Bad Zip64. Parche por Daniel Hillier.

source: `bpo-36820 <https://bugs.python.org/issue36820>`__: Break cycle generated when saving an exception in socket.py, codeop.py and dyld.py as they keep alive not only the exception but user objects through the ``__traceback__`` attribute. Patch by Mario Corchero.
es: `bpo-36820 <https://bugs.python.org/issue36820>`__: Ciclo de ruptura generado al guardar una excepción en Socket.py, Codeop.py y Dyld.py, ya que mantienen vivos, no solo la excepción, sino también los objetos de usuarioA través del atributo ``__traceback__``. Parche por mario corchero.

source: `bpo-34776 <https://bugs.python.org/issue34776>`__: Fix dataclasses to support forward references in type annotations
es: `bpo-34776 <https://bugs.python.org/issue34776>`__: Arregla las dataclasses para apoyar las referencias hacia adelante en las anotaciones de tipo

source: `bpo-33348 <https://bugs.python.org/issue33348>`__: lib2to3 now recognizes expressions after ``*`` and `**` like in ``f(*[] or [])``.
es: `bpo-33348 <https://bugs.python.org/issue33348>`__: lib2to3 ahora reconoce las expresiones después de ``*`` y `**` como en ``f(*[] o [])``.

source: `bpo-27657 <https://bugs.python.org/issue27657>`__: Fix urllib.parse.urlparse() with numeric paths. A string like "path:80" is no longer parsed as a path but as a scheme ("path") and a path ("80").
es: `bpo-27657 <https://bugs.python.org/issue27657>`__: Arregla urllib.Parse.UrlParse() con caminos numéricos.Una cuerda como "Ruta: 80" ya no se analiza como un camino, sino como un esquema ("Ruta") y una ruta ("80").

source: `bpo-38816 <https://bugs.python.org/issue38816>`__: Provides more details about the interaction between :c:func:`fork` and CPython's runtime, focusing just on the C-API. This includes cautions about where :c:func:`fork` should and shouldn't be called.
es: `bpo-38816 <https://bugs.python.org/issue38816>`__: Proporciona más detalles sobre la interacción entre:c:func:`Tenedor 'y el tiempo de ejecución de Cpython, enfocando solo en la API C.Esto incluye precauciones sobre dónde:c:func:`Fork 'debería y no debe llamarse.

source: `bpo-38351 <https://bugs.python.org/issue38351>`__: Modernize :mod:`email` examples from %-formatting to f-strings.
es: `bpo-38351 <https://bugs.python.org/issue38351>`__: Moderniza ejemplos de :mod:`email` de %-formatting a f-Strings.

source: `bpo-38778 <https://bugs.python.org/issue38778>`__: Document the fact that :exc:`RuntimeError` is raised if :meth:`os.fork` is called in a subinterpreter.
es: `bpo-38778 <https://bugs.python.org/issue38778>`__: Documente el hecho de que:exc:`RunTimeError` se levanta si:meth:`OS.Fork 'se llama en un subinterpreter.

source: `bpo-38592 <https://bugs.python.org/issue38592>`__: Add Brazilian Portuguese to the language switcher at Python Documentation website.
es: `bpo-38592 <https://bugs.python.org/issue38592>`__: Añadir Portugués brasileño al conmutador de idiomas en el sitio web de Python Documentation.

source: `bpo-38547 <https://bugs.python.org/issue38547>`__: Fix test_pty: if the process is the session leader, closing the master file descriptor raises a SIGHUP signal: simply ignore SIGHUP when running the tests.
es: `bpo-38547 <https://bugs.python.org/issue38547>`__: Fix test_pty: Si el proceso es el líder de la sesión, cerrar el descriptor del archivo maestro lanza una señal de suspidración: simplemente ignore el suspiento al ejecutar las pruebas.

source: `bpo-38992 <https://bugs.python.org/issue38992>`__: Fix a test for :func:`math.fsum` that was failing due to constant folding.
es: `bpo-38992 <https://bugs.python.org/issue38992>`__: Arregla una prueba para:func:`math.fsum 'que estaba fallando debido a un plegado constante.

source: `bpo-38965 <https://bugs.python.org/issue38965>`__: Fix test_faulthandler on GCC 10. Use the "volatile" keyword in ``faulthandler._stack_overflow()`` to prevent tail call optimization on any compiler, rather than relying on compiler specific pragma.
es: `bpo-38965 <https://bugs.python.org/issue38965>`__: Fix test_faulthandler en GCC 10. Use la palabra clave "Volatile" en ``faulthandler._stack_overflow()`` Para evitar la optimización de llamadas de la cola en cualquier compilador, en lugar de confiar en el compilador Pragma específico.

source: `bpo-38875 <https://bugs.python.org/issue38875>`__: test_capi: trashcan tests now require the test "cpu" resource.
es: `bpo-38875 <https://bugs.python.org/issue38875>`__: test_capi: Las pruebas de basura ahora requieren el recurso de prueba "CPU".

source: `bpo-38841 <https://bugs.python.org/issue38841>`__: Skip asyncio test_create_datagram_endpoint_existing_sock_unix on platforms lacking a functional bind() for named unix domain sockets.
es: `bpo-38841 <https://bugs.python.org/issue38841>`__: Skip asyncio test_create_datagram_endpoint_existing_sock_unix en plataformas que carecen de un enlace funcional() para llamadas los sockets de dominio UNIX.

source: `bpo-38669 <https://bugs.python.org/issue38669>`__: Raise :exc:`TypeError` when passing target as a string with :meth:`unittest.mock.patch.object`.
es: `bpo-38669 <https://bugs.python.org/issue38669>`__: Suba:exc:`TypeError` al pasar el objetivo como una cadena con:meth:'Unittest.mock.patch.Object`.

source: `bpo-35998 <https://bugs.python.org/issue35998>`__: Fix a race condition in test_asyncio.test_start_tls_server_1(). Previously, there was a race condition between the test main() function which replaces the protocol and the test ServerProto protocol which sends ANSWER once it gets HELLO. Now, only the test main() function is responsible to send data, ServerProto no longer sends data.
es: `bpo-35998 <https://bugs.python.org/issue35998>`__: Arregla una condición de carrera en test_asyncio.test_start_tls_server_1().Anteriormente, hubo una condición de raza entre la función principal de prueba() que reemplaza el protocolo y el protocolo de Prueba ServerPROTO que envía respuesta una vez que se hola.Ahora, solo la función principal de prueba() es responsable de enviar datos, SERVERPROTO ya no envía datos.

source: `bpo-37404 <https://bugs.python.org/issue37404>`__: :mod:`asyncio` now raises :exc:`TyperError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. Patch by Ido Michael.
es: `bpo-37404 <https://bugs.python.org/issue37404>`__: :mod:`asyncio` ahora aumenta :exc:`TyperError` cuando llame a los métodos incompatibles con una :class:`ssl.SSLSocket` socket. Parche por Ido Michael.

source: `bpo-38809 <https://bugs.python.org/issue38809>`__: On Windows, build scripts will now recognize and use python.exe from an active virtual env.
es: `bpo-38809 <https://bugs.python.org/issue38809>`__: en Windows, Build Scripts ahora reconocerá y usará Python.exe de un env. virtual activo.

source: `bpo-38684 <https://bugs.python.org/issue38684>`__: Fix _hashlib build when Blake2 is disabled, but OpenSSL supports it.
es: `bpo-38684 <https://bugs.python.org/issue38684>`__: Fix _Hashlib Build Cuando Blake2 está deshabilitado, pero OpenSSL lo admite.
