Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-39215 <https://bugs.python.org/issue39215>`__: Fix ``SystemError`` when nested function has annotation on positional-only argument - by Anthony Sottile.
es: `bpo-39215 <https://bugs.python.org/issue39215>`__: Arregla ``SystemError`` cuando la función anidada tiene anotación en el argumento de solo posicionamiento, por Anthony Sottile.

source: `bpo-38588 <https://bugs.python.org/issue38588>`__: Fix possible crashes in dict and list when calling :c:func:`PyObject_RichCompareBool`.
es: `bpo-38588 <https://bugs.python.org/issue38588>`__: Arregla los posibles choques en DICT y LISTA CUANDO LLAMADO:c:func:`pyoBject_RichComPareBool`.

source: `bpo-38610 <https://bugs.python.org/issue38610>`__: Fix possible crashes in several list methods by holding strong references to list elements when calling :c:func:`PyObject_RichCompareBool`.
es: `bpo-38610 <https://bugs.python.org/issue38610>`__: Arregla Posibles choques en varios métodos de lista mediante la celebración de referencias fuertes para enumerar elementos al llamar:c:func:`pyoBject_RichComPareBool`.

source: `bpo-39590 <https://bugs.python.org/issue39590>`__: Collections.deque now holds strong references during deque.__contains__ and deque.count, fixing crashes.
es: `bpo-39590 <https://bugs.python.org/issue39590>`__: collections.deque ahora tiene referencias fuertes durante el deque .__ contiene __ y deques.count, fijando choques.

source: `bpo-38149 <https://bugs.python.org/issue38149>`__: :func:`sys.audit` is now called only once per call of :func:`glob.glob` and :func:`glob.iglob`.
es: `bpo-38149 <https://bugs.python.org/issue38149>`__: :func:`sys.audit` ahora se llama solo una vez por llamada de :func:`glob.glob` y :func:`glob.iglob`.

source: `bpo-39450 <https://bugs.python.org/issue39450>`__: Striped whitespace from docstring before returning it from :func:`unittest.case.shortDescription`.
es: `bpo-39450 <https://bugs.python.org/issue39450>`__: espacio en blanco rayado de Docstring Antes de retornarlo de:func:`Unittest.case.shortDescription`.

source: `bpo-39493 <https://bugs.python.org/issue39493>`__: Mark ``typing.IO.closed`` as a property
es: `bpo-39493 <https://bugs.python.org/issue39493>`__: mark ``typing.IO.closed`` como una propiedad

source: `bpo-39485 <https://bugs.python.org/issue39485>`__: Fix a bug in :func:`unittest.mock.create_autospec` that would complain about the wrong number of arguments for custom descriptors defined in an extension module returning functions.
es: `bpo-39485 <https://bugs.python.org/issue39485>`__: Arregla un error en:func:`UNITTEST.MOCK.CREATE_AUTOSTHEC` que se quejarse del número equivocado de argumentos para los descriptores personalizados definidos en una extensiónFunciones de devolución del módulo.

source: `bpo-39082 <https://bugs.python.org/issue39082>`__: Allow AsyncMock to correctly patch static/class methods
es: `bpo-39082 <https://bugs.python.org/issue39082>`__: Permita que Asyncmock parpadea correctamente los métodos estáticos / clase

source: `bpo-39430 <https://bugs.python.org/issue39430>`__: Fixed race condition in lazy imports in :mod:`tarfile`.
es: `bpo-39430 <https://bugs.python.org/issue39430>`__: condición de raza fija en importaciones perezosas en:mod:`tarfile`.

source: `bpo-39390 <https://bugs.python.org/issue39390>`__: Fixed a regression with the `ignore` callback of :func:`shutil.copytree`. The argument types are now str and List[str] again.
es: `bpo-39390 <https://bugs.python.org/issue39390>`__: Se corrigió una regresión con la devolución de llamada `ignore` de :func:`slightil.copytree`. Los tipos de argumentos ahora son str y List[str] nuevamente.

source: `bpo-39389 <https://bugs.python.org/issue39389>`__: Write accurate compression level metadata in :mod:`gzip` archives, rather than always signaling maximum compression.
es: `bpo-39389 <https://bugs.python.org/issue39389>`__: Escribe metadatos de nivel de compresión precisos en:mod:`GZIP` Archivos, en lugar de señalar siempre la compresión máxima.

source: `bpo-39274 <https://bugs.python.org/issue39274>`__: ``bool(fraction.Fraction)`` now returns a boolean even if (numerator != 0) does not return a boolean (ex: numpy number).
es: `bpo-39274 <https://bugs.python.org/issue39274>`__: ``bool(fraction.Fraction)`` ¡Ahora retorna un booleano incluso si (numerator! = 0) no retorna un booleano (por ejemplo: Número de numpy).

source: `bpo-39297 <https://bugs.python.org/issue39297>`__: Improved performance of importlib.metadata distribution discovery and resilients to inaccessible sys.path entries (importlib_metadata v1.4.0).
es: `bpo-39297 <https://bugs.python.org/issue39297>`__: mejora del rendimiento de importlib.metadata Distribution Distribution Discovery y los resilientes a las entradas de SYS.Path inaccesibles (importlib_metadata v1.4.0).

source: `bpo-39242 <https://bugs.python.org/issue39242>`__: Updated the Gmane domain from news.gmane.org to news.gmane.io which is used for examples of :class:`~nntplib.NNTP` news reader server and nntplib tests.
es: `bpo-39242 <https://bugs.python.org/issue39242>`__: Actualizado el dominio de Gmane de news.gmane.org a news.gmane.io que se utiliza para ejemplos de :class:`~nntplib.NNTP` servidor de lectura de noticias y nntplib tests.

source: `bpo-38907 <https://bugs.python.org/issue38907>`__: In http.server script, restore binding to IPv4 on Windows.
es: `bpo-38907 <https://bugs.python.org/issue38907>`__: en http.server script, restaure la unión a IPv4 en Windows.

source: `bpo-39152 <https://bugs.python.org/issue39152>`__: Fix ttk.Scale.configure([name]) to return configuration tuple for name or all options. Giovanni Lombardo contributed part of the patch.
es: `bpo-39152 <https://bugs.python.org/issue39152>`__: corregir ttk.scale.configure ([nombre]) para retornar la configuración de la configuración para nombre o todas las opciones.Giovanni Lombardo contribuyó parte del parche.

source: `bpo-39198 <https://bugs.python.org/issue39198>`__: If an exception were to be thrown in `Logger.isEnabledFor` (say, by asyncio timeouts or stopit) , the `logging` global lock may not be released appropriately, resulting in deadlock. This change wraps that block of code with `try...finally` to ensure the lock is released.
es: `bpo-39198 <https://bugs.python.org/issue39198>`__: Si una excepción se lanzaría en `Logger.isEnabledFor` (diga, por los tiempos de espera de asyncio o parada), el bloqueo global de `logging` puede que no se lanzará apropiadamente, lo que resulta en punto muerto. Este cambio envuelve ese bloque de código con `try ...finally`, para asegurarse de que se libere el bloqueo.

source: `bpo-39191 <https://bugs.python.org/issue39191>`__: Perform a check for running loop before starting a new task in ``loop.run_until_complete()`` to fail fast; it prevents the side effect of new task spawning before exception raising.
es: `bpo-39191 <https://bugs.python.org/issue39191>`__: Realice un cheque para ejecutar el bucle antes de comenzar una nueva tarea en ``loop.run_until_complete()`` para fallar rápido;Previene el efecto secundario de la nueva tarea de desove antes de la elevación de excepciones.

source: `bpo-38871 <https://bugs.python.org/issue38871>`__: Correctly parenthesize filter-based statements that contain lambda expressions in mod:`lib2to3`. Patch by Dong-hee Na.
es: `bpo-38871 <https://bugs.python.org/issue38871>`__: Los estados de extracción basados en filtros que contienen las expresiones Lambda en MOD: `lib2to3`. Parche por dong-hee na.

source: `bpo-39142 <https://bugs.python.org/issue39142>`__: A change was made to logging.config.dictConfig to avoid converting instances of named tuples to ConvertingTuple. It's assumed that named tuples are too specialised to be treated like ordinary tuples; if a user of named tuples requires ConvertingTuple functionality, they will have to implement that themselves in their named tuple class.
es: `bpo-39142 <https://bugs.python.org/issue39142>`__: Se realizó un cambio a la logging.config.dictconfig para evitar convertir las instancias de las tuplas nombradas a convertingtuple.Se supone que las tuplas nombradas están demasiado especializadas para ser tratadas como tuplas ordinarias;Si un usuario de tupores nombrados requiere la funcionalidad de conversión, tendrán que implementarse en su clase de tupla llamada.

source: `bpo-39129 <https://bugs.python.org/issue39129>`__: Fix import path for ``asyncio.TimeoutError``
es: `bpo-39129 <https://bugs.python.org/issue39129>`__: corregir la ruta de importación para ``asyncio.TimeoutError``

source: `bpo-39057 <https://bugs.python.org/issue39057>`__: :func:`urllib.request.proxy_bypass_environment` now ignores leading dots and no longer ignores a trailing newline.
es: `bpo-39057 <https://bugs.python.org/issue39057>`__: :func:`urllib.request.proxy_bypass_environment` ahora ignora los puntos principales y ya no ignora una nueva línea de arrastre.

source: `bpo-39056 <https://bugs.python.org/issue39056>`__: Fixed handling invalid warning category in the -W option. No longer import the re module if it is not needed.
es: `bpo-39056 <https://bugs.python.org/issue39056>`__: Manejo fijo Categoría de advertencia inválida en la opción -w.Ya no importa el módulo RE si no es necesario.

source: `bpo-39055 <https://bugs.python.org/issue39055>`__: :func:`base64.b64decode` with ``validate=True`` raises now a binascii.Error if the input ends with a single ``\n``.
es: `bpo-39055 <https://bugs.python.org/issue39055>`__: :func:`base64.b64decode` con ``validate=True`` aumenta ahora un binascii. Error si la entrada termina con un solo ``\n``.

source: `bpo-39033 <https://bugs.python.org/issue39033>`__: Fix :exc:`NameError` in :mod:`zipimport`. Patch by Karthikeyan Singaravelan.
es: `bpo-39033 <https://bugs.python.org/issue39033>`__: Fix:exc:`NameError` en :mod:`ZipImport`. Parche por karthikeyan singaravelan.

source: `bpo-38878 <https://bugs.python.org/issue38878>`__: Fixed __subclasshook__ of :class:`os.PathLike` to return a correct result upon inheritence. Patch by Bar Harel.
es: `bpo-38878 <https://bugs.python.org/issue38878>`__: Arregla __subclasshook__ de :class:`os.PathLike` para retornar un resultado correcto contra la herencia. Parche by Bar Harel.

source: `bpo-35182 <https://bugs.python.org/issue35182>`__: Fixed :func:`Popen.communicate` subsequent call crash when the child process has already closed any piped standard stream, but still continues to be running. Patch by Andriy Maletsky.
es: `bpo-35182 <https://bugs.python.org/issue35182>`__: Arreglado :func:`Popen.communicate` error llamada subsecuente cuando el proceso hijo tiene cualquier pipe cerrada del flujo estándar , pero aún continua ejecutándose. Patche por Andriy Maletsky.

source: `bpo-38473 <https://bugs.python.org/issue38473>`__: Use signature from inner mock for autospecced methods attached with :func:`unittest.mock.attach_mock`. Patch by Karthikeyan Singaravelan.
es: `bpo-38473 <https://bugs.python.org/issue38473>`__: Use la firma de mock interior para los métodos automedicados con :func:`unittest.mock.attach_mock`. Parche por karthikeyan singaravelan.

source: `bpo-38293 <https://bugs.python.org/issue38293>`__: Add :func:`copy.copy` and :func:`copy.deepcopy` support to :func:`property` objects.
es: `bpo-38293 <https://bugs.python.org/issue38293>`__: Añadir :func:`copy.copy` y sporte :func:`copy.deepcopy` a objetos :func:`property`.

source: `bpo-39153 <https://bugs.python.org/issue39153>`__: Clarify refcounting semantics for the following functions: - PyObject_SetItem - PyMapping_SetItemString - PyDict_SetItem - PyDict_SetItemString
es: `bpo-39153 <https://bugs.python.org/issue39153>`__: aclare la semántica de reformaje para las siguientes funciones: - pyoBject_setitem - Pymapping_SetItemString - Pydict_SetItem - Pydict_setItemString

source: `bpo-39392 <https://bugs.python.org/issue39392>`__: Explain that when filling with turtle, overlap regions may be left unfilled.
es: `bpo-39392 <https://bugs.python.org/issue39392>`__: Explique que al rellenar con tortuga, las regiones de superposición se pueden dejar sin rellenar.

source: `bpo-39381 <https://bugs.python.org/issue39381>`__: Mention in docs that :func:`asyncio.get_event_loop` implicitly creates new event loop only if called from the main thread.
es: `bpo-39381 <https://bugs.python.org/issue39381>`__: Mención en la documentación que :func:`asyncio.get_event_loop` crea implícitamente el nuevo bucle de eventos solo si se llama desde el hilo principal.

source: `bpo-38918 <https://bugs.python.org/issue38918>`__: Add an entry for ``__module__`` in the "function" & "method" sections of the `inspect docs types and members table <https://docs.python.org/3/library/inspect.html#types-and-members>`_
es: `bpo-38918 <https://bugs.python.org/issue38918>`__: Agregue una entrada para ``__module__`` en las secciones "function" y "method" de la `tabla de inspecciones los tipos de documentos y los miembros <https: //docs.python.org/3/library/inspect.html#types-and-members>`_

source: `bpo-3530 <https://bugs.python.org/issue3530>`__: In the :mod:`ast` module documentation, fix a misleading ``NodeTransformer`` example and add advice on when to use the ``fix_missing_locations`` function.
es: `bpo-3530 <https://bugs.python.org/issue3530>`__: En la documentación del módulo :mod:`ast`, arregla un ejemplo engañoso ``NodeTransformer`` y agrega consejos sobre cuándo usar la función ``fix_missing_locations``.

source: `bpo-39502 <https://bugs.python.org/issue39502>`__: Skip test_zipfile.test_add_file_after_2107() if :func:`time.localtime` fails with :exc:`OverflowError`. It is the case on AIX 6.1 for example.
es: `bpo-39502 <https://bugs.python.org/issue39502>`__: skip test_zipfile.test_add_file_after_2107() Si:func:`Time.Localtime` falla con: Exc:`OverflowerRor`.Es el caso en AIX 6.1, por ejemplo.

source: `bpo-38546 <https://bugs.python.org/issue38546>`__: Fix test_ressources_gced_in_workers() of test_concurrent_futures: explicitly stop the manager to prevent leaking a child process running in the background after the test completes.
es: `bpo-38546 <https://bugs.python.org/issue38546>`__: Fix test_ressources_ged_in_workers() de test_concurrent_futures: detenga explícitamente al administrador para evitar fugarse de un proceso secundario que se ejecuta en segundo plano después de que se complete la prueba.

source: `bpo-39144 <https://bugs.python.org/issue39144>`__: The ctags and etags build targets both include Modules/_ctypes and Python standard library source files.
es: `bpo-39144 <https://bugs.python.org/issue39144>`__: Los objetivos de CTAGS y Etags construyen ambos incluyen módulos / _ctypes y archivos de origen de la biblioteca de Python Standard.

source: `bpo-39439 <https://bugs.python.org/issue39439>`__: Honor the Python path when a virtualenv is active on Windows.
es: `bpo-39439 <https://bugs.python.org/issue39439>`__: Honra el camino de Python cuando un VirtualEnv está activo en Windows.

source: `bpo-39393 <https://bugs.python.org/issue39393>`__: Improve the error message when attempting to load a DLL with unresolved dependencies.
es: `bpo-39393 <https://bugs.python.org/issue39393>`__: Mejore el mensaje de error al intentar cargar una DLL con dependencias no resueltas.

source: `bpo-38883 <https://bugs.python.org/issue38883>`__: :meth:`~pathlib.Path.home()` and :meth:`~pathlib.Path.expanduser()` on Windows now prefer :envvar:`USERPROFILE` and no longer use :envvar:`HOME`, which is not normally set for regular user accounts. This makes them again behave like :func:`os.path.expanduser`, which was changed to ignore :envvar:`HOME` in 3.8, see :issue:`36264`.
es: `bpo-38883 <https://bugs.python.org/issue38883>`__: :meth:`~pathlib.Path.home()` y :meth:`~pathlib.Path.expanduser()` en Windows ahora prefiere :envvar:`USERPROFILE` y ya no se usa :envvar:`HOME`, que normalmente no se establece para las cuentas de usuario regulares. Esto los hace de nuevo comportarse como :func:`os.path.expanduser`, que se cambió a ignorar :envvar:`HOME` en 3.8, consulte :issue:`36264`.

source: `bpo-39185 <https://bugs.python.org/issue39185>`__: The build.bat script has additional options for very-quiet output (-q) and very-verbose output (-vv)
es: `bpo-39185 <https://bugs.python.org/issue39185>`__: el script Build.bat tiene opciones adicionales para la salida (-Q) y la salida muy verbosa (-vv)

source: `bpo-30780 <https://bugs.python.org/issue30780>`__: Add remaining configdialog tests for buttons and highlights and keys tabs.
es: `bpo-30780 <https://bugs.python.org/issue30780>`__: Agregue las pruebas restantes de Configdialog para los botones y las pestañas de las teclas.

source: `bpo-39388 <https://bugs.python.org/issue39388>`__: IDLE Settings Cancel button now cancels pending changes
es: `bpo-39388 <https://bugs.python.org/issue39388>`__: configuración inactiva Cancelar el botón Cancelar ahora cancela los cambios pendientes

source: `bpo-39050 <https://bugs.python.org/issue39050>`__: Make IDLE Settings dialog Help button work again.
es: `bpo-39050 <https://bugs.python.org/issue39050>`__: Configuración de diálogo Inactivo Ayuda El botón Ayuda de Ayuda de nuevo.

source: `bpo-34118 <https://bugs.python.org/issue34118>`__: Tag memoryview, range, and tuple as classes, the same as list, etcetera, in the library manual built-in functions list.
es: `bpo-34118 <https://bugs.python.org/issue34118>`__: Tag memoryView, rango y tuple como clases, lo mismo que la Lista, etc., en la lista de funciones integradas de la Biblioteca manual.

source: `bpo-38792 <https://bugs.python.org/issue38792>`__: Close an IDLE shell calltip if a :exc:`KeyboardInterrupt` or shell restart occurs. Patch by Zackery Spytz.
es: `bpo-38792 <https://bugs.python.org/issue38792>`__: Cierre una llamada de shell calltip si :exc:`KeyboardInterrupt` o reinicio de shell ccurre. Parche by Zackery Spytz.

source: `bpo-32989 <https://bugs.python.org/issue32989>`__: Add tests for editor newline_and_indent_event method. Remove dead code from pyparse find_good_parse_start method.
es: `bpo-32989 <https://bugs.python.org/issue32989>`__: agregue las pruebas para el editor newline_and_indent_event método.Eliminar el código muerto del método PyParse Find_Good_Parse_Start.

source: *Release date: 2019-12-18*
es: * Fecha de lanzamiento: 2019-12-18 *

source: `bpo-39080 <https://bugs.python.org/issue39080>`__: Fix the value of *end_col_offset* for Starred Expression AST nodes when they are among the elements in the *args* attribute of Call AST nodes.
es: `bpo-39080 <https://bugs.python.org/issue39080>`__: Arregla el valor de *end_col_offset* para expresión protagonizada nodos AST cuando se encuentran entre los elementos en el atributo *args* de la llamada a nodos AST.

source: `bpo-39031 <https://bugs.python.org/issue39031>`__: When parsing an "elif" node, lineno and col_offset of the node now point to the "elif" keyword and not to its condition, making it consistent with the "if" node. Patch by Lysandros Nikolaou.
es: `bpo-39031 <https://bugs.python.org/issue 39031>`__: Al analizar un nodo "ELIF", Lineno y Col_Offset del nodo ahora apunta a la palabra clave "ELIF" y no a su condición, lo que lo haceconsistente con el nodo "IF". Parche por lysandros nikolaou.

source: `bpo-39008 <https://bugs.python.org/issue39008>`__: :c:func:`PySys_Audit` now requires ``Py_ssize_t`` to be used for size arguments in the format string, regardless of whether ``PY_SSIZE_T_CLEAN`` was defined at include time.
es: `bpo-39008 <https://bugs.python.org/issue39008>`__: :c:func:`Pissys_Audit 'ahora requiere` `py_ssize_t` se usa para los argumentos de tamaño en la cadena de formato, independientemente de si`` PY_SSIZE_T_CLEAN`` se definió en la hora de inclusión.

source: `bpo-39022 <https://bugs.python.org/issue39022>`__: Update importlib.metadata to include improvements from importlib_metadata 1.3 including better serialization of EntryPoints and improved documentation for custom finders.
es: `bpo-39022 <https://bugs.python.org/issue39022>`__: Actualizar importlib.metadata Para incluir mejoras en importlib_metadata 1.3, incluida una mejor serialización de los puntos de entrada y la documentación mejorada para los buscadores de encargo.

source: `bpo-38811 <https://bugs.python.org/issue38811>`__: Fix an unhandled exception in :mod:`pathlib` when :meth:`os.link` is missing. Patch by Toke Høiland-Jørgensen.
es: `bpo-38811 <https://bugs.python.org/issue38811>`__: Arregla una excepción no controlada en:mod:`pathlib` cuando:meth:`OS.LINK` Falta. Parche por toke høiland-jørgensen.

source: `bpo-36406 <https://bugs.python.org/issue36406>`__: Handle namespace packages in :mod:`doctest`. Patch by Karthikeyan Singaravelan.
es: `bpo-36406 <https://bugs.python.org/issue36406>`__: Manejar paquetes de espacio de nombres en:mod:`Doctuest`. Parche por karthikeyan singaravelan.

source: `bpo-38546 <https://bugs.python.org/issue38546>`__: Multiprocessing and concurrent.futures tests now stop the resource tracker process when tests complete.
es: `bpo-38546 <https://bugs.python.org/issue38546>`__: Las pruebas de multiprocesamiento y concurrentes. Ahora detenga el proceso de rastreador de recursos cuando se completan las pruebas.

source: `bpo-39007 <https://bugs.python.org/issue39007>`__: Add auditing events to functions in :mod:`winreg`.
es: `bpo-39007 <https://bugs.python.org/issue39007>`__: agregue eventos de auditoría a funciones en:mod:`winreg`.

source: `bpo-38295 <https://bugs.python.org/issue38295>`__: Prevent failure of test_relative_path in test_py_compile on macOS Catalina.
es: `bpo-38295 <https://bugs.python.org/issue38295>`__: Evite el fracaso de test_relative_path en test_py_compile en MacOS Catalina.

source: `bpo-38944 <https://bugs.python.org/issue38944>`__: Escape key now closes IDLE completion windows. Patch by Johnny Najera.
es: `bpo-38944 <https://bugs.python.org/issue38944>`__: Escape Key ahora cierra las ventanas de finalización inactiva. Parche por johnny najera.

source: `bpo-38943 <https://bugs.python.org/issue38943>`__: Fix IDLE autocomplete windows not always appearing on some systems. Patch by Johnny Najera.
es: `bpo-38943 <https://bugs.python.org/issue38943>`__: Arregla las ventanas de autocompletar inactivas que no siempre aparecen en algunos sistemas. Parche por johnny najera.

source: Python 3.8.1 release candidate 1
es: Python 3.8.1 Candidato de lanzamiento 1

source: *Release date: 2019-12-09*
es: * Fecha de lanzamiento: 2019-12-09 *

source: `bpo-38945 <https://bugs.python.org/issue38945>`__: Newline characters have been escaped when performing uu encoding to prevent them from overflowing into to content section of the encoded file. This prevents malicious or accidental modification of data during the decoding process.
es: `bpo-38945 <https://bugs.python.org/issue38945>`__: Los caracteres de nueva línea se han escapado al realizar la codificación de la UU para evitar que se desbordan en la sección de contenido del archivo codificado.Esto evita la modificación maliciosa o accidental de los datos durante el proceso de decodificación.
