Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-37415 <https://bugs.python.org/issue37415>`__: Fix stdatomic.h header check for ICC compiler: the ICC implementation lacks atomic_uintptr_t type which is needed by Python.
es: `bpo-37415 <https://bugs.python.org/issue37415>`__: Fix stdatomic.h Cheque de encabezado para el compilador de ICC: La implementación de ICC carece de tipo Atomic_UINTPTR_T, que necesita Python.

source: `bpo-33125 <https://bugs.python.org/issue33125>`__: Add support for building and releasing Windows ARM64 packages.
es: `bpo-33125 <https://bugs.python.org/issue33125>`__: Agregar soporte para construir y liberar paquetes de Windows ARM64.

source: `bpo-38589 <https://bugs.python.org/issue38589>`__: Fixes HTML Help shortcut when Windows is not installed to C drive
es: `bpo-38589 <https://bugs.python.org/issue38589>`__: corrige HTML Ayuda Atajo Cuando Windows no está instalado en la unidad C

source: `bpo-38453 <https://bugs.python.org/issue38453>`__: Ensure ntpath.realpath() correctly resolves relative paths.
es: `bpo-38453 <https://bugs.python.org/issue38453>`__: Asegúrese de que Ntpath.realPath() resuelve correctamente las rutas relativas.

source: `bpo-38519 <https://bugs.python.org/issue38519>`__: Restores the internal C headers that were missing from the nuget.org and Microsoft Store packages.
es: `bpo-38519 <https://bugs.python.org/issue38519>`__: restaura los encabezados C internos que faltan en los paquetes de NUGET.ORG y Microsoft Store.

source: `bpo-38492 <https://bugs.python.org/issue38492>`__: Remove ``pythonw.exe`` dependency on the Microsoft C++ runtime.
es: `bpo-38492 <https://bugs.python.org/issue38492>`__: Eliminar ``pythonw.exe`` dependency en el tiempo de ejecución de Microsoft C ++.

source: `bpo-37931 <https://bugs.python.org/issue37931>`__: Fixed a crash on OSX dynamic builds that occurred when re-initializing the posix module after a Py_Finalize if the environment had changed since the previous `import posix`. Patch by Benoît Hudson.
es: `bpo-37931 <https://bugs.python.org/issue37931>`__: Se corrigió un choque en las compilaciones dinámicas OSX que ocurrieron al reiniciar el módulo POSIX después de un PY_Finalizar si el entorno había cambiado desde el anterior "Importar POSIX`. Parche de Benoît Hudson.

source: `bpo-38862 <https://bugs.python.org/issue38862>`__: 'Strip Trailing Whitespace' on the Format menu removes extra newlines at the end of non-shell files.
es: `bpo-38862 <https://bugs.python.org/issue38862>`__: 'Strip Trailing Whitespace' en el menú Formato elimina las nuevas líneas adicionales al final de los archivos que no son de shell.

source: `bpo-26353 <https://bugs.python.org/issue26353>`__: Stop adding newline when saving an IDLE shell window.
es: `bpo-26353 <https://bugs.python.org/issued26353>`__: Deje de agregar una nueva línea al guardar una ventana de concha de ralentí.

source: `bpo-38636 <https://bugs.python.org/issue38636>`__: Fix IDLE Format menu tab toggle and file indent width. These functions (default shortcuts Alt-T and Alt-U) were mistakenly disabled in 3.7.5 and 3.8.0.
es: `bpo-38636 <https://bugs.python.org/issue38636>`__: Fix Form Formate Menu Tab Toggle and File Sinsent Anchura.Estas funciones (los atajos predeterminados alt-t y alt-u) se desactivaron erróneamente en 3.7.5 y 3.8.0.

source: `bpo-4630 <https://bugs.python.org/issue4630>`__: Add an option to toggle IDLE's cursor blink for shell, editor, and output windows. See Settings, General, Window Preferences, Cursor Blink. Patch by Zachary Spytz.
es: `bpo-4630 <https://bugs.python.org/issue4630>`__: Agregue una opción para alternar el cursor de ROINE Blink para Windows Shell, Editor y Salida.Consulte Configuración, General, Preferencias de la ventana, Cursor Blink.Parche de Zachary Spytz.

source: `bpo-38598 <https://bugs.python.org/issue38598>`__: Do not try to compile IDLE shell or output windows
es: `bpo-38598 <https://bugs.python.org/issue38598>`__: No intente compilar la cubierta de la cubierta o la salida de salida

source: `bpo-37633 <https://bugs.python.org/issue37633>`__: Re-export some function compatibility wrappers for macros in ``pythonrun.h``.
es: `bpo-37633 <https://bugs.python.org/issue37633>`__: Reexportar algunos envoltorios de compatibilidad de funciones para macros en ``pythonrun.h``.

source: `bpo-38540 <https://bugs.python.org/issue38540>`__: Fixed possible leak in :c:func:`PyArg_Parse` and similar functions for format units ``"es#"`` and ``"et#"`` when the macro :c:macro:`PY_SSIZE_T_CLEAN` is not defined.
es: `bpo-38540 <https://bugs.python.org/issue38540>`__: Arreglada posible fugas en :C:func:`pyarg_parse` y funciones similares para las unidades de formato ``"es#"`` y ``"et#"`` cuando la macro :c:macro:`PY_SSIZE_T_CLEAN` no está definido.

source: `bpo-36389 <https://bugs.python.org/issue36389>`__: The ``_PyObject_CheckConsistency()`` function is now also available in release mode. For example, it can be used to debug a crash in the ``visit_decref()`` function of the GC.
es: `bpo-36389 <https://bugs.python.org/issue36389>`__: la función ``_PyObject_CheckConsistency()`` Function ahora también está disponible en modo de liberación. Por ejemplo, se puede utilizar para depurar un choque en la función `VISIVE_DECREF()` `Función del GC.

source: *Release date: 2019-10-14*
es: * Fecha de lanzamiento: 2019-10-14 *

source: `bpo-38469 <https://bugs.python.org/issue38469>`__: Fixed a bug where the scope of named expressions was not being resolved correctly in the presence of the *global* keyword. Patch by Pablo Galindo.
es: `bpo-38469 <https://bugs.python.org/issue38469>`__: Se corrigió un error en el que el alcance de las expresiones nombradas no se estaba resolviendo correctamente en presencia de la palabra clave * global *. Parche de Pablo Galindo.

source: `bpo-38379 <https://bugs.python.org/issue38379>`__: When cyclic garbage collection (gc) runs finalizers that resurrect unreachable objects, the current gc run ends, without collecting any cyclic trash. However, the statistics reported by ``collect()`` and ``get_stats()`` claimed that all cyclic trash found was collected, and that the resurrected objects were collected. Changed the stats to report that none were collected.
es: `bpo-38379 <https://bugs.python.org/issue38379>`__: Cuando la recolección de basura cíclica (GC) ejecuta a los finalizadores que resucitan objetos inalcanzables, el GC actual funciona, sin recopilar ninguna basura cíclica.Sin embargo, las estadísticas informadas por ``collect()`` y ``get_stats()`` afirman que se recolectó toda la basura cíclica, y que se recogieron los objetos resucitados. Cambió las estadísticas para informar que ninguno fue recogido.

source: `bpo-38449 <https://bugs.python.org/issue38449>`__: Revert GH-15522, which introduces a regression in :meth:`mimetypes.guess_type` due to improper handling of filenames as urls.
es: `bpo-38449 <https://bugs.python.org/issue38449>`__: revertir GH-15522, que introduce una regresión en:meth:`mimetypes.guess_type` debido a un manejo inadecuado de nombres de archivos como URL.

source: `bpo-38431 <https://bugs.python.org/issue38431>`__: Fix ``__repr__`` method for :class:`dataclasses.InitVar` to support typing objects, patch by Samuel Colvin.
es: `bpo-38431 <https://bugs.python.org/issue38431>`__: Arregla ``__repr__`` método para :class:`dataclasses.InitVar` para admitir objetos de escritura, parche por Samuel Colvin.

source: `bpo-38109 <https://bugs.python.org/issue38109>`__: Add missing :data:`stat.S_IFDOOR`, :data:`stat.S_IFPORT`, :data:`stat.S_IFWHT`, :func:`stat.S_ISDOOR`, :func:`stat.S_ISPORT`, and :func:`stat.S_ISWHT` values to the Python implementation of :mod:`stat`.
es: `bpo-38109 <https://bugs.python.org/issuen38109>`__: Añadir Falta: Datos: `stat.s_ifdoor`, :data:`stat.s_ifport`, :data: `stat.s_ifwht`,:FUNC: `stat.s_isdoor`,:func:`stat.s_isport`, y: func: `stat.s_iswht` valora a la implementación de Python de :mod:`stat`.

source: `bpo-38405 <https://bugs.python.org/issue38405>`__: Nested subclasses of :class:`typing.NamedTuple` are now pickleable.
es: `bpo-38405 <https://bugs.python.org/issue38405>`__: Subclasses anidados de:class:`Typing.namedtuple 'es ahora recogida.

source: `bpo-38332 <https://bugs.python.org/issue38332>`__: Prevent :exc:`KeyError` thrown by :func:`_encoded_words.decode` when given an encoded-word with invalid content-type encoding from propagating all the way to :func:`email.message.get`.
es: `bpo-38332 <https://bugs.python.org/issuen38332>`__: EXPED DE EXC: `KeyError` lanzó por:func:`_ENCODED_WORMS.DECODE` Cuando se le da una palabra codificada con codificación de tipo de contenido no válido desdePropagando todo el camino a:func:`Email.message.get`.

source: `bpo-38341 <https://bugs.python.org/issue38341>`__: Add :exc:`smtplib.SMTPNotSupportedError` to the :mod:`smtplib` exported names.
es: `bpo-38341 <https://bugs.python.org/issue38341>`__: Añadir:exc:`smtplib.smtpnotsupportederror` a :mod:`smtplib` nombres exportados.

source: `bpo-13153 <https://bugs.python.org/issue13153>`__: OS native encoding is now used for converting between Python strings and Tcl objects. This allows to display, copy and paste to clipboard emoji and other non-BMP characters. Converting strings from Tcl to Python and back now never fails (except MemoryError).
es: `bpo-13153 <https://bugs.python.org/issue11153>`__: La codificación nativa del sistema operativo ahora se usa para convertir entre las cadenas de Python y los objetos TCL.Esto permite mostrar, copiar y pegar en el Portapapeles Emoji y otros caracteres no BMP.Convertir cadenas de TCL a Python y la espalda ahora nunca falla (excepto MemoryError).

source: `bpo-38294 <https://bugs.python.org/issue38294>`__: Add list of no-longer-escaped chars to re.escape documentation.
es: `bpo-38294 <https://bugs.python.org/issue38294>`__: Agregar lista de caracteres no más largos a la documentación de Re.Escape.

source: `bpo-37531 <https://bugs.python.org/issue37531>`__: On timeout, regrtest no longer attempts to call ``popen.communicate()`` again: it can hang until all child processes using stdout and stderr pipes completes. Kill the worker process and ignores its output. Change also the faulthandler timeout of the main process from 1 minute to 5 minutes, for Python slowest buildbots.
es: `bpo-37531 <https://bugs.python.org/issue37531>`__: En el tiempo de espera, regañamente ya no intenta llamar a ``popen.communicate()`` de nuevo: puede colgar hasta que todos los procesos de niños usan STDOUT yLas tuberías de STDERR se completan.Mata al proceso del trabajador e ignora su producción.Cambie también el tiempo de espera de Faulthandler del proceso principal de 1 minuto a 5 minutos, para los builturbots más lentos de Python.

source: `bpo-38344 <https://bugs.python.org/issue38344>`__: Fix error message in activate.bat.
es: `bpo-38344 <https://bugs.python.org/issue38344>`__: Arregla el mensaje de error en Activate.bat.

source: `bpo-38359 <https://bugs.python.org/issue38359>`__: Ensures ``pyw.exe`` launcher reads correct registry key.
es: `bpo-38359 <https://bugs.python.org/issue38359>`__: garantiza ``pyw.exe`` Launcher lee la clave de registro correcta.

source: `bpo-38355 <https://bugs.python.org/issue38355>`__: Fixes ``ntpath.realpath`` failing on ``sys.executable``.
es: `bpo-38355 <https://bugs.python.org/issue38355>`__: corrige ``ntpath.realPath`` Fallando ``sys.executable``.

source: `bpo-36698 <https://bugs.python.org/issue36698>`__: IDLE no longer fails when write non-encodable characters to stderr. It now escapes them with a backslash, as the regular Python interpreter. Added the ``errors`` field to the standard streams.
es: `bpo-36698 <https://bugs.python.org/issue36698>`__: inactivo ya no falla cuando escribe caracteres no codificables en stderr.Ahora los escapa con una barra invertida, como el intérprete regular de Python.Se agregó el campo ``errors`` a los flujos estándar.

source: `bpo-38118 <https://bugs.python.org/issue38118>`__: Update Valgrind suppression file to ignore a false alarm in :c:func:`PyUnicode_Decode` when using GCC builtin strcmp().
es: `bpo-38118 <https://bugs.python.org/issue38118>`__: Actualice el archivo de supresión de Valgand para ignorar una alarma falsa en:c:func:`Pyunicode_DECODE` cuando se usa GCC BURTINMIN STRCMP().

source: `bpo-38347 <https://bugs.python.org/issue38347>`__: pathfix.py: Assume all files that end on '.py' are Python scripts when working recursively.
es: `bpo-38347 <https://bugs.python.org/issue38347>`__: pathfix.py: Asuma que todos los archivos que terminen en '.py' son scripts de Python cuando se trabaja recursivamente.

source: `bpo-38395 <https://bugs.python.org/issue38395>`__: Fix a crash in :class:`weakref.proxy` objects due to incorrect lifetime management when calling some associated methods that may delete the last reference to object being referenced by the proxy. Patch by Pablo Galindo.
es: `bpo-38395 <https://bugs.python.org/issue38395>`__: Arregla un choque en:class:`wealref.proxy 'Objetos Debido a la administración incorrecta de por vida al llamar algunos métodos asociados que pueden eliminar la última referencia aObjeto siendo referenciado por el proxy. Parche de Pablo Galindo.

source: Python 3.8.0 release candidate 1
es: Python 3.8.0 Candidato de lanzamiento 1

source: *Release date: 2019-10-01*
es: * Fecha de lanzamiento: 2019-10-01 *

source: `bpo-38243 <https://bugs.python.org/issue38243>`__: Escape the server title of :class:`xmlrpc.server.DocXMLRPCServer` when rendering the document page as HTML. (Contributed by Dong-hee Na in :issue:`38243`.)
es: `bpo-38243 <https://bugs.python.org/issue38243>`__: Escape el título del servidor de :class:`xmlrpc.server.DocXMLRPCServer` cuando se presenta la página del documento como HTML.(Contribuido por Dong-hee NA en: Número: `38243`.)

source: `bpo-38174 <https://bugs.python.org/issue38174>`__: Update vendorized expat library version to 2.2.8, which resolves CVE-2019-15903.
es: `bpo-38174 <https://bugs.python.org/issue38174>`__: Actualizar versión de la biblioteca de expatriados vendorrizada a 2.2.8, que resuelve CVE-2019-15903.

source: `bpo-37764 <https://bugs.python.org/issue37764>`__: Fixes email._header_value_parser.get_unstructured going into an infinite loop for a specific case in which the email header does not have trailing whitespace, and the case in which it contains an invalid encoded word. Patch by Ashwin Ramaswami.
es: `bpo-37764 <https://bugs.python.org/issue37764>`__: corrige el correo electrónico._heeder_value_parser.get_untstructured entrando en un bucle infinito para un caso específico en el que el encabezado de correo electrónico no tiene espacio en blanco, y el caso enque contiene una palabra codificada no válida. Parche por ashwin ramaswami.

source: `bpo-38006 <https://bugs.python.org/issue38006>`__: Fix a bug due to the interaction of weakrefs and the cyclic garbage collector. We must clear any weakrefs in garbage in order to prevent their callbacks from executing and causing a crash.
es: `bpo-38006 <https://bugs.python.org/issue38006>`__: Arregla un error debido a la interacción de Weekrefs y el recolector de basura cíclicos.Debemos borrar cualquier débil en basura para evitar que sus llamadas de llamadas se ejecuten y causen un choque.

source: `bpo-38317 <https://bugs.python.org/issue38317>`__: Fix warnings options priority: ``PyConfig.warnoptions`` has the highest priority, as stated in the :pep:`587`.
es: `bpo-38317 <https://bugs.python.org/issue38317>`__: Arregla las opciones de advertencias Prioridad: ``PyConfig.warnoptions`` tiene la máxima prioridad, como se indica en:pep:`587`.

source: `bpo-36871 <https://bugs.python.org/issue36871>`__: Improve error handling for the assert_has_calls and assert_has_awaits methods of mocks. Fixed a bug where any errors encountered while binding the expected calls to the mock's spec were silently swallowed, leading to misleading error output.
es: `bpo-36871 <https://bugs.python.org/issue36871>`__: Mejorar el manejo de errores para los métodos de burlas de Assert_Has_Calls y Assert_Has_Awaits.Se solucionó un error en el que se encontraron errores encontrados mientras vinculan las llamadas esperadas a las especificaciones de Mock, se tragaron silenciosamente, lo que llevó a una salida de error engañosa.

source: `bpo-38236 <https://bugs.python.org/issue38236>`__: Python now dumps path configuration if it fails to import the Python codecs of the filesystem and stdio encodings.
es: `bpo-38236 <https://bugs.python.org/issue38236>`__: Python ahora descarga la configuración de la ruta si no logra importar los códecs de Python de los codificaciones de sistema de archivos y STDIO.

source: `bpo-38013 <https://bugs.python.org/issue38013>`__: Allow to call ``async_generator_athrow().throw(...)`` even for non-started async generator helper. It fixes annoying warning at the end of :func:`asyncio.run` call.
es: `bpo-38013 <https://bugs.python.org/issue38013>`__: Permita llamar a ``async_generator_athrow().throw(...)`` Incluso para el ayudante de generador de Async no iniciado.Corrige una advertencia molesta al final de:func:`Asyncio.Run` Llame.

source: `bpo-38124 <https://bugs.python.org/issue38124>`__: Fix an off-by-one error in PyState_AddModule that could cause out-of-bounds memory access.
es: `bpo-38124 <https://bugs.python.org/issue38124>`__: Arregla un error fuera de uno en Pytate_AddModule que podría causar acceso a la memoria fuera de los límites.

source: `bpo-38005 <https://bugs.python.org/issue38005>`__: Fixed comparing and creating of InterpreterID and ChannelID.
es: `bpo-38005 <https://bugs.python.org/issue38005>`__: Arreglado comparando y creando de interpreid y canalix.

source: `bpo-37994 <https://bugs.python.org/issue37994>`__: Fixed silencing arbitrary errors if an attribute lookup fails in several sites. Only AttributeError should be silenced.
es: `bpo-37994 <https://bugs.python.org/issue37994>`__: Silenciamiento fijo Errores arbitrarios Si una búsqueda de atributos falla en varios sitios.Solo AttributeError debe ser silenciado.

source: `bpo-37990 <https://bugs.python.org/issue37990>`__: Fix elapsed time in gc stats was not printed correctly. This bug was a regression in 3.8b4.
es: `bpo-37990 <https://bugs.python.org/issue37990>`__: El tiempo transcurrido en las estadísticas de GC no se imprimió correctamente.Este error fue una regresión en 3.8B4.

source: `bpo-37966 <https://bugs.python.org/issue37966>`__: The implementation of :func:`~unicodedata.is_normalized` has been greatly sped up on strings that aren't normalized, by implementing the full normalization-quick-check algorithm from the Unicode standard.
es: `bpo-37966 <https://bugs.python.org/issue37966>`__: La implementación de:func:`~ Unicodedata.is_Normalized` ha sido acelerada en gran medida en las cadenas que no están normalizadas, implementando la normalización completa-Compare el algoritmo de verificación del estándar Unicode.

source: `bpo-20490 <https://bugs.python.org/issue20490>`__: Improve import error message for partially initialized module on circular ``from`` imports - by Anthony Sottile.
es: `bpo-20490 <https://bugs.python.org/issue20490>`__: Mejore el mensaje de error de importación para el módulo parcializado en la circular ``from`` - por Anthony Sottile.

source: `bpo-37409 <https://bugs.python.org/issue37409>`__: Ensure explicit relative imports from interactive sessions and scripts (having no parent package) always raise ImportError, rather than treating the current module as the package. Patch by Ben Lewis.
es: `bpo-37409 <https://bugs.python.org/issue37409>`__: Asegurar las importaciones relativas explícitas de las sesiones y los scripts interactivos (que no tengan un paquete de padres) siempre recauda a ImportError, en lugar de tratar el módulo actual como el paquete. Parche por Ben Lewis.

source: `bpo-37619 <https://bugs.python.org/issue37619>`__: When adding a wrapper descriptor from one class to a different class (for example, setting ``__add__ = str.__add__`` on an ``int`` subclass), an exception is correctly raised when the operator is called.
es: `bpo-37619 <https://bugs.python.org/issue37619>`__: Al agregar un descriptor de envoltura de una clase a una clase diferente (por ejemplo, configurar "__Add__ = STR .__ Add__`` en un ``Subclase Int`, una excepción se lanza correctamente cuando se llama al operador.

source: `bpo-30773 <https://bugs.python.org/issue30773>`__: Prohibit parallel running of aclose() / asend() / athrow(). Fix ag_running to reflect the actual running status of the AG.
es: `bpo-30773 <https://bugs.python.org/issue30773>`__: Prohibir el funcionamiento paralelo de la aclose() / ased() / Athrow().Arregla AG_RUNNING para reflejar el estado actual de la AG.

source: `bpo-38319 <https://bugs.python.org/issue38319>`__: sendfile() used in socket and shutil modules was raising OverflowError for files >= 2GiB on 32-bit architectures. (patch by Giampaolo Rodola)
es: `bpo-38319 <https://bugs.python.org/issue38319>`__: sendfile() usado en módulos de socket y stlutado estaba recaudando el overflentror para archivos> = 2gib en arquitecturas de 32 bits.(Parche por giampaolo rodola)

source: `bpo-38242 <https://bugs.python.org/issue38242>`__: Revert the new asyncio Streams API
es: `bpo-38242 <https://bugs.python.org/issue38242>`__: revertir la nueva API de Syncio Streams

source: `bpo-38019 <https://bugs.python.org/issue38019>`__: Correctly handle pause/resume reading of closed asyncio unix pipe.
es: `bpo-38019 <https://bugs.python.org/issue38019>`__: maneja correctamente la lectura de pausa / reanudación de la tubería cerrada Asyncio Unix.

source: `bpo-38163 <https://bugs.python.org/issue38163>`__: Child mocks will now detect their type as either synchronous or asynchronous, asynchronous child mocks will be AsyncMocks and synchronous child mocks will be either MagicMock or Mock (depending on their parent type).
es: `bpo-38163 <https://bugs.python.org/issue38163>`__: Childs Mocks ahora detectará su tipo, ya sea síncrono o asíncrono, las simuras infantiles asíncronas serán Asyncmocks y las simuras infantiles síncronas serán MagicMock o Mock (Dependiendo de su tipo de padre).

source: `bpo-38161 <https://bugs.python.org/issue38161>`__: Removes _AwaitEvent from AsyncMock.
es: `bpo-38161 <https://bugs.python.org/issue38161>`__: elimina _awaitevent de asyncmock.

source: `bpo-38216 <https://bugs.python.org/issue38216>`__: Allow the rare code that wants to send invalid http requests from the `http.client` library a way to do so. The fixes for `bpo-30458 <https://bugs.python.org/issue30458>`__ led to breakage for some projects that were relying on this ability to test their own behavior in the face of bad requests.
es: `bpo-38216 <https://bugs.python.org/issue38216>`__: Permita que el código raro que quiera enviar solicitudes HTTP no válidas de la biblioteca `http.client` de la forma de hacerlo. Las correcciones para `bpo-30458 <https://bugs.python.org/issue3458>`__ llevó a la rotura para algunos proyectos que confiaban en esta capacidad para probar su propio comportamiento ante las malas solicitudes.

source: `bpo-38108 <https://bugs.python.org/issue38108>`__: Any synchronous magic methods on an AsyncMock now return a MagicMock. Any asynchronous magic methods on a MagicMock now return an AsyncMock.
es: `bpo-38108 <https://bugs.python.org/issue38108>`__: Cualquier método mágico síncrono en un asyncmock ahora retorne una mágica.Cualquier método de magia asíncrono en una mágica, ahora retorne un asyncmock.

source: `bpo-38248 <https://bugs.python.org/issue38248>`__: asyncio: Fix inconsistent immediate Task cancellation
es: `bpo-38248 <https://bugs.python.org/issue38248>`__: asyncio: corregir la cancelación de tareas inmediatas inconsistentes
