Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-20285 <https://bugs.python.org/issue20285>`__: Expand object.__doc__ (docstring) to make it clearer. Modify pydoc.py so that help(object) lists object methods (for other classes, help omits methods of the object base class.)
es: `bpo-20285 <https://bugs.python.org/issue20285>`__: expandir el objeto .__ doc__ (docstring) para que sea más claro.Modifique PYDOC.PY para que la ayuda (objeto) enumera los métodos de objeto (para otras clases, ayude a omite los métodos de la clase de base de objetos).

source: `bpo-37069 <https://bugs.python.org/issue37069>`__: Modify test_coroutines, test_cprofile, test_generators, test_raise, test_ssl and test_yield_from to use :func:`test.support.catch_unraisable_exception` rather than :func:`test.support.captured_stderr`.
es: `bpo-37069 <https://bugs.python.org/issue37069>`__: Modify test_coroutines, test_cprofile, test_generators, test_raise, test_ssl y test_yield_from para usar:func:`test.support.catch_unraisable_exception` en lugar de: func:`test.support.captured_stderr`.

source: `bpo-37098 <https://bugs.python.org/issue37098>`__: Fix test_memfd_create on older Linux Kernels.
es: `bpo-37098 <https://bugs.python.org/issue37098>`__: Fix test_memfd_create en los kernels de Linux anteriores.

source: `bpo-37081 <https://bugs.python.org/issue37081>`__: Test with OpenSSL 1.1.1c
es: `bpo-37081 <https://bugs.python.org/issue37081>`__: prueba con OpenSSL 1.1.1C

source: `bpo-36829 <https://bugs.python.org/issue36829>`__: Add :func:`test.support.catch_unraisable_exception`: context manager catching unraisable exception using :func:`sys.unraisablehook`.
es: `bpo-36829 <https://bugs.python.org/issue36829>`__: Añadir:func:`test.support.catch_unraisable_exception`: Context Manager Cogiendo una excepción desagradable utilizando:func:`SYS.US.URRAISBLEHOOK`.

source: `bpo-36915 <https://bugs.python.org/issue36915>`__: The main regrtest process now always removes all temporary directories of worker processes even if they crash or if they are killed on KeyboardInterrupt (CTRL+c).
es: `bpo-36915 <https://bugs.python.org/issue36915>`__: El principal proceso de regañas ahora siempre elimina todos los directorios temporales de los procesos de los trabajadores, incluso si se estrellaran o si se matan en el tecladointerruptor (Ctrl + C).

source: `bpo-36719 <https://bugs.python.org/issue36719>`__: "python3 -m test -jN ..." now continues the execution of next tests when a worker process crash (CHILD_ERROR state). Previously, the test suite stopped immediately. Use --failfast to stop at the first error.
es: `bpo-36719 <https://bugs.python.org/issue36719>`__: "Python3 -m Test -jn ..." Ahora continúa la ejecución de las siguientes pruebas cuando un proceso de proceso trabajador (Estado infantil).Anteriormente, la suite de prueba se detuvo de inmediato.Use --failFast para detenerse en el primer error.

source: `bpo-36816 <https://bugs.python.org/issue36816>`__: Update Lib/test/selfsigned_pythontestdotnet.pem to match self-signed.pythontest.net's new TLS certificate.
es: `bpo-36816 <https://bugs.python.org/issue36816>`__: Actualice lib / prueba / selfsigned_pythontestdotnet.pem para que coincida con el nuevo certificado TLS de auto-signed.pythontest.net.

source: `bpo-35925 <https://bugs.python.org/issue35925>`__: Skip httplib and nntplib networking tests when they would otherwise fail due to a modern OS or distro with a default OpenSSL policy of rejecting connections to servers with weak certificates.
es: `bpo-35925 <https://bugs.python.org/issue35925>`__: Omitir HTTPLIB y NNTPLIB Redes de pruebas cuando, de lo contrario, fallarían debido a un sistema operativo o DISTRO moderno con una política de OpenSSL predeterminada de rechazo de conexiones a servidores con débilesCertificados.

source: `bpo-36782 <https://bugs.python.org/issue36782>`__: Add tests for several C API functions in the :mod:`datetime` module. Patch by Edison Abahurire.
es: `bpo-36782 <https://bugs.python.org/issue36782>`__: Agregue las pruebas para varias funciones C API en el módulo :mod:`datetime`. Parche de Edison Abrahurire.

source: `bpo-36342 <https://bugs.python.org/issue36342>`__: Fix test_multiprocessing in test_venv if platform lacks functioning sem_open.
es: `bpo-36342 <https://bugs.python.org/issue36342>`__: Arregla test_multiprocsing en test_venv Si la plataforma carece de funcionar SEM_OPEN.

source: `bpo-36721 <https://bugs.python.org/issue36721>`__: To embed Python into an application, a new ``--embed`` option must be passed to ``python3-config --libs --embed`` to get ``-lpython3.8`` (link the application to libpython). To support both 3.8 and older, try ``python3-config --libs --embed`` first and fallback to ``python3-config --libs`` (without ``--embed``) if the previous command fails.
es: `bpo-36721 <https://bugs.python.org/issue36721>`__: Para incrustar Python en una aplicación, se debe pasar una nueva opción ``--embed`` a ``python3-config --libs --embed`` para obtener ``-lpython3.8`` (vincula la aplicación a libpython). Para apoyar tanto 3.8 como en más antiguo, intente ``python3-config --libs --embed`` primero y falto a ``python3-config --libs`` (sin ``--embed``) Si el comando anterior falla.

source: Add a pkg-config ``python-3.8-embed`` module to embed Python into an application: ``pkg-config python-3.8-embed --libs`` includes ``-lpython3.8``. To support both 3.8 and older, try ``pkg-config python-X.Y-embed --libs`` first and fallback to ``pkg-config python-X.Y --libs`` (without ``--embed``) if the previous command fails (replace ``X.Y`` with the Python version).
es: Agregue un módulo PKG-Config ``python-3.8-embed`` para incrustar Python en una aplicación: ``pkg-config python-3.8-embed --libs`` incluye ``-lpython3.8``. Para soportar 3.8 y más antiguos, intente ``pkg-config python-X.Y-embed -libs`` primero y falto a ``pkg-config python-X.Y --libs`` (sin ``--embed``)Si el comando anterior falla (reemplace ``X.Y`` con la versión de Python).

source: On the other hand, ``pkg-config python3.8 --libs`` no longer contains ``-lpython3.8``. C extensions must not be linked to libpython (except on Android, case handled by the script); this change is backward incompatible on purpose.
es: Por otro lado, ``pkg-config python3.8 --libs`` ya no contiene ``-lpython3.8``.Las extensiones de C no deben estar vinculadas a Libpython (excepto en Android, un caso manejado por el script);Este cambio es atrasado incompatible a propósito.

source: `bpo-36786 <https://bugs.python.org/issue36786>`__: "make install" now runs compileall in parallel.
es: `bpo-36786 <https://bugs.python.org/issue36786>`__: "make install" ahora funciona compileal en paralelo.

source: `bpo-36965 <https://bugs.python.org/issue36965>`__: include of STATUS_CONTROL_C_EXIT without depending on MSC compiler
es: `bpo-36965 <https://bugs.python.org/issue36965>`__: Incluya de status_control_c_exit sin depender del compilador de MSC

source: `bpo-35926 <https://bugs.python.org/issue35926>`__: Update to OpenSSL 1.1.1b for Windows.
es: `bpo-35926 <https://bugs.python.org/issue35926>`__: Actualización a OpenSSL 1.1.1B para Windows.

source: `bpo-29883 <https://bugs.python.org/issue29883>`__: Add Windows support for UDP transports for the Proactor Event Loop. Patch by Adam Meily.
es: `bpo-29883 <https://bugs.python.org/issue29883>`__: Agregue el soporte de Windows para los transportes de UDP para el bucle de eventos del proactor.Parche por adam meily.

source: `bpo-33407 <https://bugs.python.org/issue33407>`__: The :c:macro:`Py_DEPRECATED()` macro has been implemented for MSVC.
es: `bpo-33407 <https://bugs.python.org/issue33407>`__: C: C: Macro: `PY_DEPRECATE()` Macro se ha implementado para MSVC.

source: `bpo-36231 <https://bugs.python.org/issue36231>`__: Support building Python on macOS without /usr/include installed. As of macOS 10.14, system header files are only available within an SDK provided by either the Command Line Tools or the Xcode app.
es: `bpo-36231 <https://bugs.python.org/issue36231>`__: Soporte Edificio Python en MacOS sin / usr / Include instalado.A partir de MACOS 10.14, los archivos de encabezado del sistema solo están disponibles dentro de un SDK proporcionado por la línea de comandos o la aplicación XCODE.

source: `bpo-35610 <https://bugs.python.org/issue35610>`__: Replace now redundant .context_use_ps1 with .prompt_last_line. This finishes change started in `bpo-31858 <https://bugs.python.org/issue31858>`__.
es: `bpo-35610 <https://bugs.python.org/issue35610>`__: Reemplace ahora Redundante .Context_USE_PS1 con .prompt_last_line.Esto finaliza el cambio iniciado en `bpo-31858 <https://bugs.python.org/issue31858>`__.

source: `bpo-37038 <https://bugs.python.org/issue37038>`__: Make idlelib.run runnable; add test clause.
es: `bpo-37038 <https://bugs.python.org/issue37038>`__: haz que Idlelib.Run Runnable;Agregar cláusula de prueba.

source: `bpo-36958 <https://bugs.python.org/issue36958>`__: Print any argument other than None or int passed to SystemExit or sys.exit().
es: `bpo-36958 <https://bugs.python.org/issue36958>`__: Imprima cualquier argumento que no sea None o int Pasado a SystemExit o Sys.Exit().

source: `bpo-36807 <https://bugs.python.org/issue36807>`__: When saving a file, call os.fsync() so bits are flushed to e.g. USB drive.
es: `bpo-36807 <https://bugs.python.org/issue36807>`__: Al guardar un archivo, llame a OS.FSYNC(), por lo que los bits se enjuaguen a, por ejemplo,Unidad USB.

source: `bpo-32411 <https://bugs.python.org/issue32411>`__: In browser.py, remove extraneous sorting by line number since dictionary was created in line number order.
es: `bpo-32411 <https://bugs.python.org/issue32411>`__: en el navegador.py, elimine la clasificación extraña por número de línea desde que se creó el diccionario en el orden del número de línea.

source: `bpo-37053 <https://bugs.python.org/issue37053>`__: Handle strings like u"bar" correctly in Tools/parser/unparse.py. Patch by Chih-Hsuan Yen.
es: `bpo-37053 <https://bugs.python.org/issue37053>`__: maneja cadenas como U "Barra" correctamente en Herramientas / Parser / Desperse.py. Parche por chih-hsuan yen.

source: `bpo-36763 <https://bugs.python.org/issue36763>`__: Implement the :pep:`587` "Python Initialization Configuration".
es: `bpo-36763 <https://bugs.python.org/issue36763>`__: Implementar el:pep:`587 '" Configuración de inicialización de Python ".

source: `bpo-36379 <https://bugs.python.org/issue36379>`__: Fix crashes when attempting to use the *modulo* parameter when ``__ipow__`` is implemented in C.
es: `bpo-36379 <https://bugs.python.org/issue36379>`__: Arregla problemas al intentar usar el parámetro *modulo* cuando se implementa en C ``__ipow__``.

source: `bpo-37107 <https://bugs.python.org/issue37107>`__: Update :c:func:`PyObject_CallMethodObjArgs` and ``_PyObject_CallMethodIdObjArgs`` to use ``_PyObject_GetMethod`` to avoid creating a bound method object in many cases. Patch by Michael J. Sullivan.
es: `bpo-37107 <https://bugs.python.org/issue37107>`__: Actualización:c:func:`pyoBject_callmethodobjargs` y` `_pyobject_callmethodidobjargs`` para usar` `_pyobject_getmethod`` para evitar crear un objeto de método unido enmuchos casos. Parche de Michael J. Sullivan.

source: `bpo-36974 <https://bugs.python.org/issue36974>`__: Implement :pep:`590`: Vectorcall: a fast calling protocol for CPython. This is a new protocol to optimize calls of custom callable objects.
es: `bpo-36974 <https://bugs.python.org/issue36974>`__: Implementar:pep:`590`: VectorCall: un protocolo de llamadas rápidas para CPYTHON.Este es un nuevo protocolo para optimizar las llamadas de objetos calificables personalizados.

source: `bpo-36763 <https://bugs.python.org/issue36763>`__: ``Py_Main()`` now returns the exitcode rather than calling ``Py_Exit(exitcode)`` when calling ``PyErr_Print()`` if the current exception type is ``SystemExit``.
es: `bpo-36763 <https://bugs.python.org/issue36763>`__: ``Py_Main()`` Ahora retorna el código de exitamento en lugar de llamar ``Py_Exit(exitcode)`` cuando llame ``PyErr_Print()`` si el tipo de excepción actual es ``SystemExit``.

source: `bpo-36922 <https://bugs.python.org/issue36922>`__: Add new type flag ``Py_TPFLAGS_METHOD_DESCRIPTOR`` for objects behaving like unbound methods. These are objects supporting the optimization given by the ``LOAD_METHOD``/``CALL_METHOD`` opcodes. See PEP 590.
es: `bpo-36922 <https://bugs.python.org/issue36922>`__: Agregar nuevo tipo de marca ``py_tpflags_method_descriptor`` para objetos que se comportan como métodos no unidos.Estos son objetos que soportan la optimización dada por el opodes opcionales de "Load_Method`` /` `Call_Method``Ver PEP 590.

source: `bpo-36728 <https://bugs.python.org/issue36728>`__: The :c:func:`PyEval_ReInitThreads` function has been removed from the C API. It should not be called explicitly: use :c:func:`PyOS_AfterFork_Child` instead.
es: `bpo-36728 <https://bugs.python.org/issue36728>`__: :c:func:`PyEval_ReInitThreads` función ha sido eliminado de la API C. No debe llamarse explícitamente: Uso :c:func:`PyOS_AfterFork_Child` en su lugar.

source: *Release date: 2019-05-06*
es: * Fecha de lanzamiento: 2019-05-06 *

source: `bpo-36742 <https://bugs.python.org/issue36742>`__: Fixes mishandling of pre-normalization characters in urlsplit().
es: `bpo-36742 <https://bugs.python.org/issue36742>`__: fija el mal manejo de los caracteres de pre-normalización en URLSplit().

source: `bpo-30458 <https://bugs.python.org/issue30458>`__: Address CVE-2019-9740 by disallowing URL paths with embedded whitespace or control characters through into the underlying http client request. Such potentially malicious header injection URLs now cause an http.client.InvalidURL exception to be raised.
es: `bpo-30458 <https://bugs.python.org/issue30458>`__: Dirección CVE-2019-9740 al no permitir rutas URL con espacios en blanco incorporados o caracteres de control a través de la solicitud de cliente HTTP subyacente.Tales URL de inyección de encabezado potencialmente malintencionadas ahora causan que se plantee una excepción http.client.Invalidurl.

source: `bpo-35755 <https://bugs.python.org/issue35755>`__: :func:`shutil.which` now uses ``os.confstr("CS_PATH")`` if available and if the :envvar:`PATH` environment variable is not set. Remove also the current directory from :data:`posixpath.defpath`. On Unix, :func:`shutil.which` and the :mod:`subprocess` module no longer search the executable in the current directory if the :envvar:`PATH` environment variable is not set.
es: `bpo-35755 <https://bugs.python.org/issue35755>`__: :func:`shutil.which` ahora usa ``os.confstr("CS_PATH")`` Si está disponible y si el :envvar:`PATH` variable de entorno no se establece. Elimine también el directorio actual de :data:`posixpath.defpath`. En UNIX, :func:`shutil.which` y el :mod:`subprocess` ya no busque el ejecutable en el directorio actual si el :envvar:`PATH` variable de entorno no está configurada.

source: `bpo-36722 <https://bugs.python.org/issue36722>`__: In debug build, import now also looks for C extensions compiled in release mode and for C extensions compiled in the stable ABI.
es: `bpo-36722 <https://bugs.python.org/issue36722>`__: En la construcción de depuración, la importación ahora también busca las extensiones C compiladas en modo de liberación y para las extensiones C compiladas en el ABI estable.

source: `bpo-32849 <https://bugs.python.org/issue32849>`__: Fix Python Initialization code on FreeBSD to detect properly when stdin file descriptor (fd 0) is invalid.
es: `bpo-32849 <https://bugs.python.org/issue32849>`__: Arregla el código de inicialización de Python en FreeBSD para detectar correctamente cuando el descriptor de archivo STDIN (FD 0) no es válido.

source: `bpo-36623 <https://bugs.python.org/issue36623>`__: Remove parser headers and related function declarations that lack implementations after the removal of pgen.
es: `bpo-36623 <https://bugs.python.org/issue36623>`__: Retire los encabezados de los analizadores y las declaraciones de la función relacionadas que carecen de implementaciones después de la eliminación de Pgen.

source: `bpo-20180 <https://bugs.python.org/issue20180>`__: ``dict.pop()`` is now up to 33% faster thanks to Argument Clinic. Patch by Inada Naoki.
es: `bpo-20180 <https://bugs.python.org/issue20180>`__: ``dict.pop()`` es ahora hasta un 33% más rápido gracias a la clínica argument. Parche por Inada Naoki.

source: `bpo-36611 <https://bugs.python.org/issue36611>`__: Debug memory allocators: disable serialno field by default from debug hooks on Python memory allocators to reduce the memory footprint by 5%. Enable :mod:`tracemalloc` to get the traceback where a memory block has been allocated when a fatal memory error is logged to decide where to put a breakpoint. Compile Python with ``PYMEM_DEBUG_SERIALNO`` defined to get back the field.
es: `bpo-36611 <https://bugs.python.org/issue36611>`__: Memory asignadores de memoria: Deshabilitar el campo Serialno de forma predeterminada de los ganchos de depuración en los asignadores de memoria de Python para reducir la huella de la memoria en un 5%. Habilitar :mod:`tracemalloc` para obtener el rastreo donde se ha asignado un bloque de memoria cuando se registra un error de memoria fatal para decidir dónde colocar un punto de interrupción.Compile Python con ``PYMEM_DEBUG_SERIALNO`` definido para recuperar el campo.

source: `bpo-36588 <https://bugs.python.org/issue36588>`__: On AIX, :attr:`sys.platform` doesn't contain the major version anymore. Always return ``'aix```, instead of ``'aix3``` .. ``'aix7```. Since older Python versions include the version number, it is recommended to always use ``sys.platform.startswith('aix')``. Contributed by M. Felt.
es: `bpo-36588 <https://bugs.python.org/issue36588>`__: en AIX ,: ATTR: `Sys.platform 'no contiene la versión principal.Siempre retorne ``'aix'``, en lugar de ``'aix3'`` ..``'aix7'``. Dado que las versiones anteriores de Python incluyen el número de versión, se recomienda utilizar siempre ``sys.platform.sartswith('aix')``.Contribuyó por M. fieltro.

source: `bpo-36549 <https://bugs.python.org/issue36549>`__: Change str.capitalize to use titlecase for the first character instead of uppercase.
es: `bpo-36549 <https://bugs.python.org/issue36549>`__: Cambie STR.Capitalice para usar Titlecase para el primer carácter en lugar de mayúsculas.

source: `bpo-36540 <https://bugs.python.org/issue36540>`__: Implement :pep:`570` (Python positional-only parameters). Patch by Pablo Galindo.
es: `bpo-36540 <https://bugs.python.org/issue36540>`__: Implementar:pep:`570` (Parámetros de solo posición de Python). Parche de Pablo Galindo.

source: `bpo-36475 <https://bugs.python.org/issue36475>`__: :c:func:`PyEval_AcquireLock` and :c:func:`PyEval_AcquireThread` now terminate the current thread if called while the interpreter is finalizing, making them consistent with :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS`, and :c:func:`PyGILState_Ensure`.
es: `bpo-36475 <https://bugs.python.org/issue36475>`__: :c:func: `PyEval_AcquireLock` y :c:func:`PyEval_AcquireThread` ahora Termina el hilo actual si se llama mientras el intérprete está finalizando, haciéndolos consistentes con :c:func:`PyEval_RestoreThread`, :c:func:`PY_END_ALLOW_THREADS`, y :c:func:`PyGILState_Ensure`.

source: `bpo-36504 <https://bugs.python.org/issue36504>`__: Fix signed integer overflow in _ctypes.c's ``PyCArrayType_new()``.
es: `bpo-36504 <https://bugs.python.org/issue36504>`__: Arregla el desbordamiento entero firmado en _ctypes.c ``pycarraytype_new()` ``'.

source: `bpo-20844 <https://bugs.python.org/issue20844>`__: Fix running script with encoding cookie and LF line ending may fail on Windows.
es: `bpo-20844 <https://bugs.python.org/issue20844>`__: Fix Everying Script con cookie de codificación y LF La finalización puede fallar en Windows.

source: `bpo-24214 <https://bugs.python.org/issue24214>`__: Fixed support of the surrogatepass error handler in the UTF-8 incremental decoder.
es: `bpo-24214 <https://bugs.python.org/issue24214>`__: Soporte fijo del controlador de errores de SurrogatePass en el decodificador incremental UTF-8.

source: `bpo-36452 <https://bugs.python.org/issue36452>`__: Changing ``dict`` keys during iteration of the dict itself, ``keys()``, ``values()``, or ``items()`` will now be detected in certain corner cases where keys are deleted/added so that the number of keys isn't changed. A `RuntimeError` will be raised after ``len(dict)`` iterations. Contributed by Thomas Perl.
es: `bpo-36452 <https://bugs.python.org/issue36452>`__: Cambio de llaves de ``dict`` durante la iteración del propio, ``keys()``, ``values()``,o ``items()`` ahora se detectarán en ciertos casos de esquina donde las claves se eliminan / agreguen de manera que la cantidad de claves no se cambie.A `RunTimeError` se elevará después de" LEN (DICT) "iteraciones.Contribuido por Thomas Perl.

source: `bpo-36459 <https://bugs.python.org/issue36459>`__: Fix a possible double ``PyMem_FREE()`` due to tokenizer.c's ``tok_nextc()``.
es: `bpo-36459 <https://bugs.python.org/issue36459>`__: Arregla un posible doble ``PyMem_FREE()`` debido a tokenizer.c ``tok_nextc()``.

source: `bpo-36433 <https://bugs.python.org/issue36433>`__: Fixed TypeError message in classmethoddescr_call.
es: `bpo-36433 <https://bugs.python.org/issue36433>`__: Mensaje de TypeError fijo en classmethoddescr_call.

source: `bpo-36430 <https://bugs.python.org/issue36430>`__: Fix a possible reference leak in :func:`itertools.count`.
es: `bpo-36430 <https://bugs.python.org/issue36430>`__: Arregla una posible fugas de referencia:func:`ITERTROOLS.COUNT`.

source: `bpo-36440 <https://bugs.python.org/issue36440>`__: Include node names in ``ParserError`` messages, instead of numeric IDs. Patch by A. Skrobov.
es: `bpo-36440 <https://bugs.python.org/issue36440>`__: Incluya los nombres de los nodos en los mensajes ``ParserError`` en lugar de ID numéricas. Parche por A. Skrobov.

source: `bpo-36143 <https://bugs.python.org/issue36143>`__: Regenerate :mod:`keyword` from the Grammar and Tokens file using pgen. Patch by Pablo Galindo.
es: `bpo-36143 <https://bugs.python.org/issue36143>`__: regenerada :mod:`keyword` de la gramática y tokens usando Pgen. Parche de Pablo Galindo.

source: `bpo-18372 <https://bugs.python.org/issue18372>`__: Add missing :c:func:`PyObject_GC_Track` calls in the :mod:`pickle` module. Patch by Zackery Spytz.
es: `bpo-18372 <https://bugs.python.org/issue18372>`__: Añadir Falta:c:func:`pyoBject_gc_track 'llama en :mod:`Pickle' Module. Parche by Zackery Spytz.

source: `bpo-35952 <https://bugs.python.org/issue35952>`__: Fix pythoninfo when the compiler is missing.
es: `bpo-35952 <https://bugs.python.org/issue35952>`__: Arregla la pythoninfo cuando falta el compilador.

source: `bpo-28238 <https://bugs.python.org/issue28238>`__: The ``.find*()`` methods of xml.etree.ElementTree can now search for wildcards like ``{*}tag`` and ``{ns}*`` that match a tag in any namespace or all tags in a namespace. Patch by Stefan Behnel.
es: `bpo-28238 <https://bugs.python.org/issued28238>`__: ``.find*()`` métodos de xml.etree.elementtree ahora puede buscar comodines como ``{*}tag`` y ``{ns}*`` que coincida con una etiqueta en cualquier espacio de nombres o todas las etiquetas en un espacio de nombres. Parche por Stefan Behons.

source: `bpo-26978 <https://bugs.python.org/issue26978>`__: `pathlib.path.link_to()` is now implemented. It creates a hard link pointing to a path.
es: `bpo-26978 <https://bugs.python.org/issue26978>`__: `pathlib.path.link_to()` ahora está implementado.Crea un disco duro que apunta a un camino.
