Repository: python/python-docs-es
Catalog: whatsnew/changelog.po
Languages: es

source: `bpo-40436 <https://bugs.python.org/issue40436>`__: test_gdb and test.pythoninfo now check gdb command exit code.
es: `bpo-40436 <https://bugs.python.org/issue40436>`__: test_gdb and test.pythoninfo ahora Compruebe el código de salida de GDB Command.

source: `bpo-40162 <https://bugs.python.org/issue40162>`__: Update Travis CI configuration to OpenSSL 1.1.1f.
es: `bpo-40162 <https://bugs.python.org/issue40162>`__: Actualice la configuración de Travis CI a OpenSSL 1.1.1F.

source: `bpo-40146 <https://bugs.python.org/issue40146>`__: Update OpenSSL to 1.1.1f in Azure Pipelines.
es: `bpo-40146 <https://bugs.python.org/issue40146>`__: Actualice OpenSSL a 1.1.1F en tuberías Azure.

source: `bpo-40019 <https://bugs.python.org/issue40019>`__: test_gdb now skips tests if it detects that gdb failed to read debug information because the Python binary is optimized.
es: `bpo-40019 <https://bugs.python.org/issue40019>`__: test_gdb ahora salta las pruebas si detecta que GDB no pudo leer la información de depuración porque se optimiza el binario de Python.

source: `bpo-27807 <https://bugs.python.org/issue27807>`__: ``test_site.test_startup_imports()`` is now skipped if a path of :data:`sys.path` contains a ``.pth`` file.
es: `bpo-27807 <https://bugs.python.org/issue27807>`__: ``test_site.test_startup_imports()`` ahora se omite si una ruta de :data:`sys.path` contiene un ``.pth`` archivo.

source: `bpo-39793 <https://bugs.python.org/issue39793>`__: Use the same domain when testing ``make_msgid``. Patch by Batuhan Taskaya.
es: `bpo-39793 <https://bugs.python.org/issue39793>`__: Use el mismo dominio al probar ``make_msgid``. Parche de Batuhan Taskaya.

source: `bpo-1812 <https://bugs.python.org/issue1812>`__: Fix newline handling in doctest.testfile when loading from a package whose loader has a get_data method. Patch by Peter Donis.
es: `bpo-1812 <https://bugs.python.org/issue812>`__: Arregla el manejo de newline en Doctest.testFile al cargar desde un paquete cuyo cargador tiene un método GET_DATA. Parche de Peter Donis.

source: `bpo-37957 <https://bugs.python.org/issue37957>`__: test.regrtest now can receive a list of test patterns to ignore (using the -i/--ignore argument) or a file with a list of patterns to ignore (using the --ignore-file argument). Patch by Pablo Galindo.
es: `bpo-37957 <https://bugs.python.org/issue37957>`__: test.regrtest ahora puede recibir una lista de patrones de prueba para ignorar (usando el argumento -i / - ignorar) o un archivo con una lista con una listade patrones para ignorar (utilizando el argumento de archivo -ignore). Parche de Pablo Galindo.

source: `bpo-38502 <https://bugs.python.org/issue38502>`__: test.regrtest now uses process groups in the multiprocessing mode (-jN command line option) if process groups are available: if :func:`os.setsid` and :func:`os.killpg` functions are available.
es: `bpo-38502 <https://bugs.python.org/issue38502>`__: test.regrtest ahora usa grupos de procesos en el modo multiprocesado (opción de línea de comandos -jn) Si los grupos de proceso están disponibles: Si:func:`OS.setsid` y:func:`OS.KILLPG` Funciones están disponibles.

source: Build
es: Construir

source: `bpo-38360 <https://bugs.python.org/issue38360>`__: Support single-argument form of macOS -isysroot flag.
es: `bpo-38360 <https://bugs.python.org/issue38360>`__: Forma de argumento único de la flag de MacOS -ISSROOT.

source: `bpo-40204 <https://bugs.python.org/issue40204>`__: Pin Sphinx version to 1.8.2 in ``Doc/Makefile``.
es: `bpo-40204 <https://bugs.python.org/issue40204>`__: PIN Sphinx versión a 1.8.2 en ``Doc/Makefile``.

source: `bpo-40158 <https://bugs.python.org/issue40158>`__: Fix CPython MSBuild Properties in NuGet Package (build/native/python.props)
es: `bpo-40158 <https://bugs.python.org/issue40158>`__: FIX CPYTHON MSBUILD Propiedades en el paquete de Nuget (compilación / nativa / python.props)

source: `bpo-38527 <https://bugs.python.org/issue38527>`__: Fix configure check on Solaris for "float word ordering": sometimes, the correct "grep" command was not being used. Patch by Arnon Yaari.
es: `bpo-38527 <https://bugs.python.org/issue38527>`__: FIX Configure la verificación en Solaris para "Ordenamiento de la palabra flotante": A veces, el comando "GREP" correcto no se estaba utilizando. Parche por Arnon Yaari.

source: Windows
es: Ventanas

source: `bpo-40164 <https://bugs.python.org/issue40164>`__: Updates Windows to OpenSSL 1.1.1f
es: `bpo-40164 <https://bugs.python.org/issue40164>`__: actualiza Windows a OpenSSL 1.1.1F

source: `bpo-39930 <https://bugs.python.org/issue39930>`__: Ensures the required :file:`vcruntime140.dll` is included in install packages.
es: `bpo-39930 <https://bugs.python.org/issue39930>`__: garantiza el archivo: archivo: vcruntime140.dll` se incluye en los paquetes de instalación.

source: `bpo-39847 <https://bugs.python.org/issue39847>`__: Avoid hang when computer is hibernated whilst waiting for a mutex (for lock-related objects from :mod:`threading`) around 49-day uptime.
es: `bpo-39847 <https://bugs.python.org/issue39847>`__: Evite cuelga cuando la computadora está hibernada mientras espera un mutex (para los objetos relacionados con la cerradura de:mod:`roscado`) alrededor de 49 días en tiempo de actividad.

source: `bpo-38597 <https://bugs.python.org/issue38597>`__: :mod:`distutils` will no longer statically link :file:`vcruntime140.dll` when a redistributable version is unavailable. All future releases of CPython will include a copy of this DLL to ensure distributed extensions can continue to load.
es: `bpo-38597 <https://bugs.python.org/issue38597>`__: :mod:`distutils` ya no vinculará estáticamente :file:`vcruntime140.dll` cuando una versión redistribuible no está disponible.Todas las futuras versiones de CPYTHON incluirán una copia de esta DLL para garantizar que las extensiones distribuidas puedan continuar cargando.

source: `bpo-38380 <https://bugs.python.org/issue38380>`__: Update Windows builds to use SQLite 3.31.1
es: `bpo-38380 <https://bugs.python.org/issue38380>`__: Actualizar Windows se basa en usar SQLite 3.31.1

source: `bpo-39789 <https://bugs.python.org/issue39789>`__: Update Windows release build machines to Visual Studio 2019 (MSVC 14.2).
es: `bpo-39789 <https://bugs.python.org/issue39789>`__: Actualice las máquinas de construcción de librares de Windows a Visual Studio 2019 (MSVC 14.2).

source: `bpo-34803 <https://bugs.python.org/issue34803>`__: Package for nuget.org now includes repository reference and bundled icon image.
es: `bpo-34803 <https://bugs.python.org/issue34803>`__: Paquete para nugaT.org ahora incluye la referencia del repositorio y la imagen de icono de paquete.

source: `bpo-40164 <https://bugs.python.org/issue40164>`__: Update macOS installer builds to use OpenSSL 1.1.1g.
es: `bpo-40164 <https://bugs.python.org/issue40164>`__: Actualizar MacOS Installer se basa en usar OpenSSL 1.1.1G.

source: `bpo-38380 <https://bugs.python.org/issue38380>`__: Update macOS builds to use SQLite 3.31.1
es: `bpo-38380 <https://bugs.python.org/issue38380>`__: Actualizar MacOS se basa en usar SQLite 3.31.1

source: `bpo-27115 <https://bugs.python.org/issue27115>`__: For 'Go to Line', use a Query box subclass with IDLE standard behavior and improved error checking.
es: `bpo-27115 <https://bugs.python.org/issue27115>`__: para 'ir a la línea', use una subclase de la caja de consulta con un comportamiento estándar inactivo y una mejor revisión de errores.

source: `bpo-39885 <https://bugs.python.org/issue39885>`__: Since clicking to get an IDLE context menu moves the cursor, any text selection should be and now is cleared.
es: `bpo-39885 <https://bugs.python.org/issue39885>`__: Dado que hace clic para obtener un menú de contexto inactivo, mueve el cursor, cualquier selección de texto debe estar y ahora se borra.

source: `bpo-39852 <https://bugs.python.org/issue39852>`__: Edit "Go to line" now clears any selection, preventing accidental deletion. It also updates Ln and Col on the status bar.
es: `bpo-39852 <https://bugs.python.org/issue39852>`__: editar "Ir a la línea" Ahora borra cualquier selección, evitando la eliminación accidental.También actualiza LN y COL en la barra de estado.

source: `bpo-39781 <https://bugs.python.org/issue39781>`__: Selecting code context lines no longer causes a jump.
es: `bpo-39781 <https://bugs.python.org/issue39781>`__: Selección de líneas de contexto del código ya no causa un salto.

source: `bpo-38439 <https://bugs.python.org/issue38439>`__: Add a 256×256 pixel IDLE icon to support more modern environments. Created by Andrew Clover. Delete the unused macOS idle.icns icon file.
es: `bpo-38439 <https://bugs.python.org/issue38439>`__: Agregue un icono inactivo de 256 × 256 píxeles para admitir ambientes más modernos.Creado por Andrew Clover.Eliminar el archivo icono de MacOS inactivo no utilizado.

source: `bpo-38689 <https://bugs.python.org/issue38689>`__: IDLE will no longer freeze when inspect.signature fails when fetching a calltip.
es: `bpo-38689 <https://bugs.python.org/issue38689>`__: inactivo ya no se congelará cuando se inspeccione. Laignature falla al buscar una llamada de llamada.

source: Tools/Demos
es: Herramientas / Demos

source: `bpo-40179 <https://bugs.python.org/issue40179>`__: Fixed translation of ``#elif`` in Argument Clinic.
es: `bpo-40179 <https://bugs.python.org/issue40179>`__: Traducción fija de ``#elif`` en clínica argument.

source: `bpo-36184 <https://bugs.python.org/issue36184>`__: Port python-gdb.py to FreeBSD. python-gdb.py now checks for "take_gil" function name to check if a frame tries to acquire the GIL, instead of checking for "pthread_cond_timedwait" which is specific to Linux and can be a different condition than the GIL.
es: `bpo-36184 <https://bugs.python.org/issue36184>`__: Puerto Python-gdb.py a FreeBSD.Python-gdb.py ahora verifica el nombre de la función "Take_gil" para verificar si un marco intenta adquirir el GIL, en lugar de verificar "PTHREAD_COND_TIMEDWAIT", que es específico de Linux y puede ser una condición diferente a la GIL.

source: `bpo-39889 <https://bugs.python.org/issue39889>`__: Fixed ``unparse.py`` for extended slices containing a single element (e.g. ``a[i:j,]``). Remove redundant tuples when index with a tuple (e.g. ``a[i, j]``).
es: `bpo-39889 <https://bugs.python.org/issue39889>`__: Arreglado ``unparse.py`` para rebanadas extendidas que contienen un elemento único (por ejemplo, ``a[i:j,]``). Eliminando las tuplas redundantes cuando se ice con una tupla (por ejemplo, ``a[i, j]``).

source: `bpo-35370 <https://bugs.python.org/issue35370>`__: If :c:func:`PySys_Audit` fails in :c:func:`PyEval_SetProfile` or :c:func:`PyEval_SetTrace`, log the error as an unraisable exception.
es: `bpo-35370 <https://bugs.python.org/issuen35370>`__: Si: C:c:func:`Pissys_Audit` falla en:c:func:`pyeval_setprofile` o: c: func: `pyeval_settrace`, logEl error como una excepción unraisable.

source: `bpo-39884 <https://bugs.python.org/issue39884>`__: :c:func:`PyDescr_NewMethod` and :c:func:`PyCFunction_NewEx` now include the method name in the SystemError "bad call flags" error message to ease debug.
es: `bpo-39884 <https://bugs.python.org/issue39884>`__: :c:func:`PyDescr_NewMethod` y :c:func:`PyCFunction_NewEx` ahora incluye el nombre del método en el SystemError "bad call flags" mensaje de error para facilitar la depuración.

source: `bpo-38643 <https://bugs.python.org/issue38643>`__: :c:func:`PyNumber_ToBase` now raises a :exc:`SystemError` instead of crashing when called with invalid base.
es: `bpo-38643 <https://bugs.python.org/issue38643>`__: :c:func:`PyNumber_ToBase` ahora lanza un :exc:`SystemError` en lugar de estrellarse cuando se llama con base inválida.

source: `bpo-38913 <https://bugs.python.org/issue38913>`__: Fixed segfault in ``Py_BuildValue()`` called with a format containing "#" and undefined PY_SSIZE_T_CLEAN whwn an exception is set.
es: `bpo-38913 <https://bugs.python.org/issue38913>`__: Se fija Segfault en ``PY_BuildValue()`` Llamado con un formato que contiene "#" y undefined py_ssize_t_clean whn se establece una excepción.

source: *Release date: 2020-02-24*
es: * Fecha de lanzamiento: 2020-02-24 *

source: `bpo-39382 <https://bugs.python.org/issue39382>`__: Fix a use-after-free in the single inheritance path of ``issubclass()``, when the ``__bases__`` of an object has a single reference, and so does its first item. Patch by Yonatan Goldschmidt.
es: `bpo-39382 <https://bugs.python.org/issue39382>`__: Arregla un uso después del libre en la trayectoria de la herencia única de ``issubclass``, cuando el ``__bases__`` de un objeto tiene una sola referencia, y también lo hace su primer artículo. Parche por yonatan goldschmidt.

source: `bpo-39427 <https://bugs.python.org/issue39427>`__: Document all possibilities for the ``-X`` options in the command line help section. Patch by Pablo Galindo.
es: `bpo-39427 <https://bugs.python.org/issue39427>`__: Documente todas las posibilidades de las opciones ``-x`` en la sección de ayuda de la línea de comandos. Parche de Pablo Galindo.

source: `bpo-39649 <https://bugs.python.org/issue39649>`__: Remove obsolete check for `__args__` in bdb.Bdb.format_stack_entry.
es: `bpo-39649 <https://bugs.python.org/issue39649>`__: Retire el cheque obsoleto para `__args__` en bdb.bdb.format_stack_entry.

source: `bpo-39681 <https://bugs.python.org/issue39681>`__: Fix a regression where the C pickle module wouldn't allow unpickling from a file-like object that doesn't expose a readinto() method.
es: `bpo-39681 <https://bugs.python.org/issue39681>`__: Arregla una regresión en la que el módulo de Pickle de C no permitiría un poco de un objeto similar a un archivo que no expone un método READINTO().

source: `bpo-39546 <https://bugs.python.org/issue39546>`__: Fix a regression in :class:`~argparse.ArgumentParser` where ``allow_abbrev=False`` was ignored for long options that used a prefix character other than "-".
es: `bpo-39546 <https://bugs.python.org/issue39546>`__: Arregla una regresión en:class:`~argparse.ArgumentParser` donde ``allow_abbrev=False`` se ignoró para las opciones largas que utilizaron un prefijopersonaje que no sea "-".

source: `bpo-39432 <https://bugs.python.org/issue39432>`__: Implement PEP-489 algorithm for non-ascii "PyInit\_..." symbol names in distutils to make it export the correct init symbol also on Windows.
es: `bpo-39432 <https://bugs.python.org/issue39432>`__: Implementar el algoritmo PEP-489 para los nombres de símbolos no ASCII "PYINIT\_..." en Distutils para hacerlo exportar el símbolo de init correcto tambiénen Windows.

source: `bpo-17422 <https://bugs.python.org/issue17422>`__: The language reference now specifies restrictions on class namespaces. Adapted from a patch by Ethan Furman.
es: `bpo-17422 <https://bugs.python.org/issue17422>`__: La referencia del idioma ahora especifica las restricciones en los espacios de nombres de la clase.Adaptado de un parche de Ethan Furman.

source: `bpo-39572 <https://bugs.python.org/issue39572>`__: Updated documentation of ``total`` flag of TypeDict.
es: `bpo-39572 <https://bugs.python.org/issue39572>`__: Documentación actualizada del flag ``total`` de TypeDict.

source: `bpo-39654 <https://bugs.python.org/issue39654>`__: In pyclbr doc, update 'class' to 'module' where appropriate and add readmodule comment. Patch by Hakan Çelik.
es: `bpo-39654 <https://bugs.python.org/issue39654>`__: en Pyclbr Doc, actualiza 'clase' a 'módulo' cuando sea apropiado y agrega un comentario readmodule. Parche por Hakan Çelik.

source: `bpo-39663 <https://bugs.python.org/issue39663>`__: Add tests for pyparse find_good_parse_start().
es: `bpo-39663 <https://bugs.python.org/issue39663>`__: Agregar pruebas para PyParse Find_Good_Parse_Start().

source: Python 3.8.2 release candidate 2
es: Python 3.8.2 Liberación candidata 2

source: *Release date: 2020-02-17*
es: * Fecha de lanzamiento: 2020-02-17 *

source: `bpo-39184 <https://bugs.python.org/issue39184>`__: Add audit events to functions in `fcntl`, `msvcrt`, `os`, `resource`, `shutil`, `signal` and `syslog`.
es: `bpo-39184 <https://bugs.python.org/issue39184>`__: Agrega eventos de auditoría a funciones en `fcntl`, `msvcrt`, `os`, `resource`, `shutil`, `signal` y `syslog`.

source: `bpo-39619 <https://bugs.python.org/issue39619>`__: Enable use of :func:`os.chroot` on HP-UX systems.
es: `bpo-39619 <https://bugs.python.org/issue39619>`__: Habilitar el uso de:func:`OS.CHROOT` en los sistemas HP-UX.

source: `bpo-39606 <https://bugs.python.org/issue39606>`__: Fix regression caused by fix for `bpo-39386 <https://bugs.python.org/issue39386>`__, that prevented calling ``aclose`` on an async generator that had already been closed or exhausted.
es: `bpo-39606 <https://bugs.python.org/issue39606>`__: Arregla la regresión causada por FIX para `bpo-39386 <https://bugs.python.org/issue39386>`__, que evitó la llamada ``aclose`` en un generador de ASYNC que ya se había cerrado o agotado.

source: `bpo-39453 <https://bugs.python.org/issue39453>`__: Fixed a possible crash in :meth:`list.__contains__` when a list is changed during comparing items. Patch by Dong-hee Na.
es: `bpo-39453 <https://bugs.python.org/issue39453>`__: Se corrigió un posible caída en :meth:`list.__contains__` cuando se cambia una lista durante la comparación de elementos. Parche por Dong-hee Na.

source: `bpo-39219 <https://bugs.python.org/issue39219>`__: Syntax errors raised in the tokenizer now always set correct "text" and "offset" attributes.
es: `bpo-39219 <https://bugs.python.org/issue39219>`__: Los errores de sintaxis recaudados en el tokenizador ahora siempre configuran los atributos correctos "texto" y "offset".

source: `bpo-27657 <https://bugs.python.org/issue27657>`__: The original fix for `bpo-27657 <https://bugs.python.org/issue27657>`__, "Fix urlparse() with numeric paths" (GH-16839) included in 3.8.1, inadvertently introduced a behavior change that broke several third-party packages relying on the original undefined parsing behavior. The change is reverted in 3.8.2, restoring the behavior of 3.8.0 and earlier releases.
es: `bpo-27657 <https://bugs.python.org/issue27657>`__: la solución original para `bpo-27657 <https://bugs.python.org/issue27657>`__, "Arregla UrlParse() conLas rutas numéricas "(GH-16839) incluidas en 3.8.1, introdujeron inadvertidamente un cambio de comportamiento que rompió varios paquetes de terceros que se basan en el comportamiento de análisis indefinido original.El cambio se revertida en 3.8.2, restaurando el comportamiento de 3.8.0 y lanzamientos anteriores.

source: `bpo-39474 <https://bugs.python.org/issue39474>`__: Fixed starting position of AST for expressions like ``(a)(b)``, ``(a)[b]`` and ``(a).b``.
es: `bpo-39474 <https://bugs.python.org/issue39474>`__: Se fija la posición inicial de la AST para expresiones como ``(a)(b)``, ``(a)[b]`` y ``(a).b``.

source: `bpo-21016 <https://bugs.python.org/issue21016>`__: The :mod:`pydoc` and :mod:`trace` modules now use the :mod:`sysconfig` module to get the path to the Python standard library, to support uncommon installation path like ``/usr/lib64/python3.9/`` on Fedora. Patch by Jan Matějek.
es: `bpo-21016 <https://bugs.python.org/issue21016>`__: Los módulos :mod:`pydoc` y :mod:`trace` ahora usan el módulo :mod:`sysconfig` para obtener la ruta a la biblioteca estándar de Python, para admitir la ruta de instalación poco común como ``/usr/lib64/python3.9/`` en Fedora. Parche de Jan Matějek.

source: `bpo-39595 <https://bugs.python.org/issue39595>`__: Improved performance of zipfile.Path for files with a large number of entries. Also improved performance and fixed minor issue as published with `importlib_metadata 1.5 <https://importlib-metadata.readthedocs.io/en/latest/changelog%20(links).html#v1-5-0>`_.
es: `bpo-39595 <https://bugs.python.org/issue39595>`__: mejora del rendimiento de Zipfile.Path para archivos con un gran número de entradas.También mejora el rendimiento y un problema menor fijo como se publicó con `importlib_metadata 1.5 <https://importlib-metadata.readthedocs.io/en/latest/changelog%20 (enlaces) .html # v1-5-0>`_.

source: `bpo-39600 <https://bugs.python.org/issue39600>`__: In the font configuration window, remove duplicated font names.
es: `bpo-39600 <https://bugs.python.org/issue39600>`__: En la ventana Configuración de fuentes, elimine los nombres de fuente duplicados.

source: Python 3.8.2 release candidate 1
es: Python 3.8.2 Liberación candidata 1

source: *Release date: 2020-02-10*
es: * Fecha de lanzamiento: 2020-02-10 *

source: `bpo-39401 <https://bugs.python.org/issue39401>`__: Avoid unsafe load of ``api-ms-win-core-path-l1-1-0.dll`` at startup on Windows 7.
es: `bpo-39401 <https://bugs.python.org/issue39401>`__: Evite la carga insegura de ``api-ms-win-core-path-l1-1-0.dll`` en el inicio en Windows 7.

source: `bpo-39184 <https://bugs.python.org/issue39184>`__: Add audit events to command execution functions in os and pty modules.
es: `bpo-39184 <https://bugs.python.org/issue39184>`__: Agregue eventos de auditoría a las funciones de ejecución de comandos en los módulos OS y PTY.

source: `bpo-39579 <https://bugs.python.org/issue39579>`__: Change the ending column offset of `Attribute` nodes constructed in `ast_for_dotted_name` to point at the end of the current node and not at the end of the last `NAME` node.
es: `bpo-39579 <https://bugs.python.org/issue39579>`__: Cambie el desplazamiento de la columna de finalización de los nodos `Attribute` construidos en `ast_for_dotted_name` se apunta al final del nodo actual y no al final de el último nodo `NAME`.

source: `bpo-39510 <https://bugs.python.org/issue39510>`__: Fix segfault in ``readinto()`` method on closed BufferedReader.
es: `bpo-39510 <https://bugs.python.org/issue39510>`__: Arregla Segfault en método ``readinto()`` en BuffereReader cerrado.

source: `bpo-39492 <https://bugs.python.org/issue39492>`__: Fix a reference cycle in the C Pickler that was preventing the garbage collection of deleted, pickled objects.
es: `bpo-39492 <https://bugs.python.org/issue39492>`__: Arregla un ciclo de referencia en el Pickler de C que impidió la recolección de basura de objetos eliminados, en escabeche.

source: `bpo-39421 <https://bugs.python.org/issue39421>`__: Fix possible crashes when operating with the functions in the :mod:`heapq` module and custom comparison operators.
es: `bpo-39421 <https://bugs.python.org/issue39421>`__: Arregla los posibles fallos cuando opera con las funciones en el módulo :mod:`heapq` y operadores de comparación personalizados.

source: `bpo-39386 <https://bugs.python.org/issue39386>`__: Prevent double awaiting of async iterator.
es: `bpo-39386 <https://bugs.python.org/issue39386>`__: Evite la duplicación del iterador de Async.

source: `bpo-39235 <https://bugs.python.org/issue39235>`__: Fix AST end location for lone generator expression in function call, e.g. f(i for i in a).
es: `bpo-39235 <https://bugs.python.org/issue39235>`__: Arregla la ubicación de extremo AST para la expresión de generador solitario en la llamada de la función, por ejemplo,F (I por i en a).

source: `bpo-39209 <https://bugs.python.org/issue39209>`__: Correctly handle multi-line tokens in interactive mode. Patch by Pablo Galindo.
es: `bpo-39209 <https://bugs.python.org/issue39209>`__: Maneje correctamente los tokens de múltiples líneas en modo interactivo. Parche de Pablo Galindo.

source: `bpo-39216 <https://bugs.python.org/issue39216>`__: Fix constant folding optimization for positional only arguments - by Anthony Sottile.
es: `bpo-39216 <https://bugs.python.org/issue39216>`__: Arregla la optimización de plegado constante para los argumentos posicionales solo - por Anthony SOTTLE.
