Repository: python/python-docs-es
Catalog: tutorial/appendix.po
Languages: es

source: Appendix
es: Apéndice

source: Interactive Mode
es: Modo interactivo

source: Error Handling
es: Manejo de errores

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
es: Cuando ocurre un error, el intérprete imprime un mensaje de error y la traza del error. En el modo interactivo, luego retorna al prompt primario; cuando la entrada viene de un archivo, el programa termina con código de salida distinto a cero luego de imprimir la traza del error. (Las excepciones manejadas por una clausula :keyword:`except` en una sentencia :keyword:`try` no son errores en este contexto). Algunos errores son incondicionalmente fatales y causan una terminación con código de salida distinto de cero; esto se debe a inconsistencias internas o a que el intérprete se queda sin memoria. Todos los mensajes de error se escriben en el flujo de errores estándar; las salidas normales de comandos ejecutados se escriben en la salida estándar.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
es: Al ingresar el carácter de interrupción (por lo general :kbd:`Control-C` o :kbd:`Supr`) en el prompt primario o secundario, se cancela la entrada y retorna al prompt primario. [#]_ Tipear una interrupción mientras un comando se están ejecutando lanza la excepción :exc:`KeyboardInterrupt`, que puede ser manejada con una sentencia :keyword:`try`.

source: Executable Python Scripts
es: Programas ejecutables de Python

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
es: En los sistemas Unix y tipo BSD, los programas Python pueden convertirse directamente en ejecutables, como programas del intérprete de comandos, poniendo la linea::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
es: ...al principio del script y dándole al archivo permisos de ejecución (asumiendo que el intérprete están en la variable de entorno :envvar:`PATH` del usuario). ``#!`` deben ser los primeros dos caracteres del archivo. En algunas plataformas, la primera línea debe terminar al estilo Unix (``'\n'``), no como en Windows (``'\r\n'``). Notá que el carácter numeral ``'#'`` se usa en Python para comenzar un comentario.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
es: Se le puede dar permisos de ejecución al script usando el comando :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
es: En sistemas Windows, no existe la noción de "modo ejecutable". El instalador de Python asocia automáticamente la extensión ``.py`` con ``python.exe`` para que al hacerle doble clic a un archivo Python se corra el script. La extensión también puede ser ``.pyw``, en este caso se omite la ventana con la consola que normalmente aparece.

source: The Interactive Startup File
es: El archivo de inicio interactivo

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
es: Cuando usas Python en forma interactiva, suele ser útil que algunos comandos estándar se ejecuten cada vez que el intérprete se inicia. Puedes hacer esto configurando la variable de entorno :envvar:`PYTHONSTARTUP` con el nombre de un archivo que contenga tus comandos de inicio. Esto es similar al archivo :file:`.profile` en los intérpretes de comandos de Unix.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
es: Este archivo es solo leído en las sesiones interactivas del intérprete, no cuando Python lee comandos de un script ni cuando :file:`/dev/tty` se explicita como una fuente de comandos (que de otro modo se comporta como una sesión interactiva). Se ejecuta en el mismo espacio de nombres en el que los comandos interactivos se ejecutan, entonces los objetos que define o importa pueden ser usados sin cualificaciones en la sesión interactiva. En este archivo también puedes cambiar los prompts ``sys.ps1`` y ``sys.ps2``.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
es: Si quieres leer un archivo de inicio adicional desde el directorio actual, puedes programarlo en el archivo de inicio global usando algo como ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. Si quieres usar el archivo de inicio en un script, tienes que hacer lo siguiente de forma explícita en el script::

source: The Customization Modules
es: Los módulos de customización

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
es: Python provee dos formas para customizarlo: :index:`sitecustomize` y :index:`usercustomize`. Para ver cómo funciona, necesitas primero encontrar dónde está tu directorio para tu usuario de paquetes del sistema. Inicia Python y ejecuta el siguiente código::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
es: Ahora puedes crear un archivo llamado :file:`usercustomize.py` en ese directorio y poner lo que quieras en él. Eso afectará cada ejecución de Python, a menos que se inicie con la opción :option:`-s` para deshabilitar esta importación automática.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
es: :index:`sitecustomize` funciona de la misma manera, pero normalmente lo crea el administrador de la computadora en el directorio global de paquetes del sistema, y se importa antes que :index:`usercustomize`. Para más detalles, mira la documentación del módulo :mod:`site`.

source: Footnotes
es: Notas al pie

source: A problem with the GNU Readline package may prevent this.
es: Un problema con el paquete GNU Readline puede prevenir esto.
