Repository: python/python-docs-es
Catalog: tutorial/datastructures.po
Languages: es

source: Data Structures
es: Estructuras de datos

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
es: Este capítulo describe algunas cosas que ya has aprendido en más detalle y agrega algunas cosas nuevas también.

source: More on Lists
es: Más sobre listas

source: The list data type has some more methods. Here are all of the methods of list objects:
es: El tipo de dato lista tiene algunos métodos más. Aquí están todos los métodos de los objetos lista:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
es: Agrega un ítem al final de la lista. Equivale a ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
es: Extiende la lista agregándole todos los ítems del iterable. Equivale a ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
es: Inserta un ítem en una posición dada. El primer argumento es el índice del ítem delante del cual se insertará, por lo tanto ``a.insert(0, x)`` inserta al principio de la lista y ``a.insert(len(a), x)`` equivale a ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
es: Quita el primer ítem de la lista cuyo valor sea *x*. Lanza un :exc:`ValueError` si no existe tal ítem.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. (The square brackets around the *i* in the method signature denote that the parameter is optional, not that you should type square brackets at that position. You will see this notation frequently in the Python Library Reference.)
es: Quita el ítem en la posición dada de la lista y lo retorna. Si no se especifica un índice, ``a.pop()`` quita y retorna el último elemento de la lista. (Los corchetes que encierran a *i* en la firma del método denotan que el parámetro es opcional, no que deberías escribir corchetes en esa posición. Verás esta notación con frecuencia en la Referencia de la Biblioteca de Python.)

source: Remove all items from the list. Equivalent to ``del a[:]``.
es: Elimina todos los elementos de la lista. Equivalente a ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
es: Retorna el índice basado en cero del primer elemento cuyo valor sea igual a *x*. Lanza una excepción :exc:`ValueError` si no existe tal elemento.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
es: Los argumentos opcionales *start* y *end* son interpretados como la notación de rebanadas y se usan para limitar la búsqueda a un segmento particular de la lista. El índice retornado se calcula de manera relativa al inicio de la secuencia completa en lugar de con respecto al argumento *start*.

source: Return the number of times *x* appears in the list.
es: Retorna el número de veces que *x* aparece en la lista.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
es: Ordena los elementos de la lista in situ (los argumentos pueden ser usados para personalizar el orden de la lista, ver :func:`sorted` para su explicación).

source: Reverse the elements of the list in place.
es: Invierte los elementos de la lista in situ.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
es: Retorna una copia superficial de la lista. Equivalente a ``a[:]``.

source: An example that uses most of the list methods::
es: Un ejemplo que usa la mayoría de los métodos de la lista::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [1]_ This is a design principle for all mutable data structures in Python.
es: Quizás hayas notado que métodos como `insert``, ``remove`` o ``sort`` que únicamente modifican la lista no tienen impreso un valor de retorno -- retornan el valor por defecto ``None``. [1]_ Esto es un principio de diseño para todas las estructuras de datos mutables en Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and *None* can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
es: Otra cosa que puedes observar es que no todos los datos se pueden ordenar o comparar. Por ejemplo, ``[None, 'hello', 10]`` no se puede ordenar ya que los enteros no se pueden comparar con strings y *None* no se puede comparar con los otros tipos. También hay algunos tipos que no tienen una relación de orden definida. Por ejemplo, ``3+4j < 5+7j`` no es una comparación válida.

source: Using Lists as Stacks
es: Usando listas como pilas

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`append`. To retrieve an item from the top of the stack, use :meth:`pop` without an explicit index. For example::
es: Los métodos de lista hacen que resulte muy fácil usar una lista como una pila, donde el último elemento añadido es el primer elemento retirado ("último en entrar, primero en salir"). Para agregar un elemento a la cima de la pila, utiliza :meth:`append`. Para retirar un elemento de la cima de la pila, utiliza :meth:`pop` sin un índice explícito. Por ejemplo:

source: Using Lists as Queues
es: Usando listas como colas

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
es: También es posible usar una lista como una cola, donde el primer elemento añadido es el primer elemento retirado ("primero en entrar, primero en salir"); sin embargo, las listas no son eficientes para este propósito. Agregar y sacar del final de la lista es rápido, pero insertar o sacar del comienzo de una lista es lento (porque todos los otros elementos tienen que ser desplazados por uno).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
es: Para implementar una cola, utiliza :class:`collections.deque` el cual fue diseñado para añadir y quitar de ambas puntas de forma rápida. Por ejemplo::

source: List Comprehensions
es: Comprensión de listas

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
es: Las comprensiones de listas ofrecen una manera concisa de crear listas. Sus usos comunes son para hacer nuevas listas donde cada elemento es el resultado de algunas operaciones aplicadas a cada miembro de otra secuencia o iterable, o para crear un segmento de la secuencia de esos elementos para satisfacer una condición determinada.

source: For example, assume we want to create a list of squares, like::
es: Por ejemplo, asumamos que queremos crear una lista de cuadrados, como::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
es: Nota que esto crea (o sobreescribe) una variable llamada ``x`` que sigue existiendo luego de que el bucle haya terminado. Podemos calcular la lista de cuadrados sin ningún efecto secundario haciendo::

source: or, equivalently::
es: o, un equivalente::

source: which is more concise and readable.
es: que es más conciso y legible.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
es: Una lista de comprensión consiste de corchetes rodeando una expresión seguida de la declaración :keyword:`!for` y luego cero o más declaraciones :keyword:`!for` o :keyword:`!if`. El resultado será una nueva lista que sale de evaluar la expresión en el contexto de los :keyword:`!for` o :keyword:`!if` que le siguen. Por ejemplo, esta lista de comprensión combina los elementos de dos listas si no son iguales::

source: and it's equivalent to::
es: y es equivalente a::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
es: Notá como el orden de los :keyword:`for` y :keyword:`if` es el mismo en ambos pedacitos de código.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
es: Si la expresión es una tupla (como el ``(x, y)`` en el ejemplo anterior), debe estar entre paréntesis. ::

source: List comprehensions can contain complex expressions and nested functions::
es: Las comprensiones de listas pueden contener expresiones complejas y funciones anidadas::

source: Nested List Comprehensions
es: Listas por comprensión anidadas

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
es: La expresión inicial de una comprensión de listas puede ser cualquier expresión arbitraria, incluyendo otra comprensión de listas.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
es: Considerá el siguiente ejemplo de una matriz de 3x4 implementada como una lista de tres listas de largo 4::

source: The following list comprehension will transpose rows and columns::
es: La siguiente comprensión de lista transpondrá las filas y columnas::

source: As we saw in the previous section, the nested listcomp is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
es: Como vimos en la sección anterior, la lista de comprensión anidada se evalúa en el contexto del :keyword:`for` que lo sigue, por lo que este ejemplo equivale a::

source: which, in turn, is the same as::
es: el cual, a la vez, es lo mismo que::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
es: En el mundo real, deberías preferir funciones predefinidas a declaraciones con flujo complejo. La función :func:`zip` haría un buen trabajo para este caso de uso::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
es: Ver :ref:`tut-unpacking-arguments` para detalles en el asterisco de esta línea.

source: The :keyword:`!del` statement
es: La instrucción :keyword:`del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
es: Hay una manera de quitar un ítem de una lista dado su índice en lugar de su valor: la instrucción :keyword:`del`. Esta es diferente del método :meth:`pop`, el cual retorna un valor. La instrucción :keyword:`!del` también puede usarse para quitar secciones de una lista o vaciar la lista completa (lo que hacíamos antes asignando una lista vacía a la sección). Por ejemplo::

source: :keyword:`del` can also be used to delete entire variables::
es: :keyword:`del` puede usarse también para eliminar variables::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
es: Hacer referencia al nombre ``a`` de aquí en más es un error (al menos hasta que se le asigne otro valor). Veremos otros usos para :keyword:`del` más adelante.

source: Tuples and Sequences
es: Tuplas y secuencias

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
es: Vimos que las listas y cadenas tienen propiedades en común, como el indizado y las operaciones de seccionado. Estas son dos ejemplos de datos de tipo *secuencia* (ver :ref:`typesseq`). Como Python es un lenguaje en evolución, otros datos de tipo secuencia pueden agregarse. Existe otro dato de tipo secuencia estándar: la *tupla*.

source: A tuple consists of a number of values separated by commas, for instance::
es: Una tupla consiste de un número de valores separados por comas, por ejemplo::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
es: Como puedes ver, en la salida las tuplas siempre se encierran entre paréntesis, para que las tuplas anidadas puedan interpretarse correctamente; pueden ingresarse con o sin paréntesis, aunque a menudo los paréntesis son necesarios de todas formas (si la tupla es parte de una expresión más grande). No es posible asignar a los ítems individuales de una tupla, pero sin embargo sí se puede crear tuplas que contengan objetos mutables, como las listas.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
es: A pesar de que las tuplas puedan parecerse a las listas, frecuentemente se utilizan en distintas situaciones y para distintos propósitos. Las tuplas son :term:`immutable` y normalmente contienen una secuencia heterogénea de elementos que son accedidos al desempaquetar (ver más adelante en esta sección) o indizar (o incluso acceder por atributo en el caso de las :func:`namedtuples <collections.namedtuple>`). Las listas son :term:`mutable`, y sus elementos son normalmente homogéneos y se acceden iterando a la lista.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
es: Un problema particular es la construcción de tuplas que contengan 0 o 1 ítem: la sintaxis presenta algunas peculiaridades para estos casos. Las tuplas vacías se construyen mediante un par de paréntesis vacío; una tupla con un ítem se construye poniendo una coma a continuación del valor (no alcanza con encerrar un único valor entre paréntesis). Feo, pero efectivo. Por ejemplo::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
es: La declaración ``t = 12345, 54321, 'hola!'`` es un ejemplo de *empaquetado de tuplas*: los valores ``12345``, ``54321`` y ``'hola!'`` se empaquetan juntos en una tupla. La operación inversa también es posible::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
es: Esto se llama, apropiadamente, *desempaquetado de secuencias*, y funciona para cualquier secuencia en el lado derecho del igual. El desempaquetado de secuencias requiere que la cantidad de variables a la izquierda del signo igual sea el tamaño de la secuencia. Notá que la asignación múltiple es en realidad sólo una combinación de empaquetado de tuplas y desempaquetado de secuencias.

source: Sets
es: Conjuntos

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
es: Python también incluye un tipo de dato para *conjuntos*. Un conjunto es una colección no ordenada y sin elementos repetidos. Los usos básicos de éstos incluyen verificación de pertenencia y eliminación de entradas duplicadas. Los conjuntos también soportan operaciones matemáticas como la unión, intersección, diferencia, y diferencia simétrica.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
es: Las llaves o la función :func:`set` pueden usarse para crear conjuntos. Notá que para crear un conjunto vacío tenés que usar ``set()``, no ``{}``; esto último crea un diccionario vacío, una estructura de datos que discutiremos en la sección siguiente.

source: Here is a brief demonstration::
es: Una pequeña demostración::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
es: De forma similar a las :ref:`comprensiones de listas <tut-listcomps>`, está también soportada la comprensión de conjuntos::

source: Dictionaries
es: Diccionarios

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`append` and :meth:`extend`.
es: Otro tipo de dato útil incluido en Python es el *diccionario* (ver :ref:`typesmapping`). Los diccionarios se encuentran a veces en otros lenguajes como "memorias asociativas" o "arreglos asociativos". A diferencia de las secuencias, que se indexan mediante un rango numérico, los diccionarios se indexan con *claves*, que pueden ser cualquier tipo inmutable; las cadenas y números siempre pueden ser claves. Las tuplas pueden usarse como claves si solamente contienen cadenas, números o tuplas; si una tupla contiene cualquier objeto mutable directa o indirectamente, no puede usarse como clave. No podés usar listas como claves, ya que las listas pueden modificarse usando asignación por índice, asignación por sección, o métodos como :meth:`append` y :meth:`extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
es: Es mejor pensar en un diccionario como un conjunto de pares *clave:valor* con el requerimiento de que las claves sean únicas (dentro de un diccionario). Un par de llaves crean un diccionario vacío: ``{}``. Colocar una lista de pares clave:valor separada por comas dentro de las llaves agrega, de inicio, pares clave:valor al diccionario; esta es, también, la forma en que los diccionarios se muestran en la salida.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
es: Las operaciones principales sobre un diccionario son guardar un valor con una clave y extraer ese valor dada la clave. También es posible borrar un par clave:valor con ``del``. Si usás una clave que ya está en uso para guardar un valor, el valor que estaba asociado con esa clave se pierde. Es un error extraer un valor usando una clave no existente.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
es: Ejecutando ``list(d)`` en un diccionario retornará una lista con todas las claves usadas en el diccionario, en el orden de inserción (si deseas que esté ordenada simplemente usa ``sorted(d)`` en su lugar). Para comprobar si una clave está en el diccionario usa la palabra clave :keyword:`in`.

source: Here is a small example using a dictionary::
es: Un pequeño ejemplo de uso de un diccionario::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
es: El constructor :func:`dict` crea un diccionario directamente desde secuencias de pares clave-valor::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
es: Además, las comprensiones de diccionarios se pueden usar para crear diccionarios desde expresiones arbitrarias de clave y valor::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
es: Cuando las claves son cadenas simples, a veces resulta más fácil especificar los pares usando argumentos por palabra clave::

source: Looping Techniques
es: Técnicas de iteración
