Repository: python/python-docs-es
Catalog: tutorial/datastructures.po
Languages: es

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`items` method. ::
es: Cuando iteramos sobre diccionarios, se pueden obtener al mismo tiempo la clave y su valor correspondiente usando el método :meth:`items`. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
es: Cuando se itera sobre una secuencia, se puede obtener el índice de posición junto a su valor correspondiente usando la función :func:`enumerate`. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
es: Para iterar sobre dos o más secuencias al mismo tiempo, los valores pueden emparejarse con la función :func:`zip`. ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
es: Para iterar sobre una secuencia en orden inverso, se especifica primero la secuencia al derecho y luego se llama a la función :func:`reversed`. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
es: Para iterar sobre una secuencia ordenada, se utiliza la función :func:`sorted` la cual retorna una nueva lista ordenada dejando a la original intacta. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
es: A veces uno intenta cambiar una lista mientras la está iterando; sin embargo, a menudo es más simple y seguro crear una nueva lista::

source: More on Conditions
es: Más acerca de condiciones

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
es: Las condiciones usadas en las instrucciones ``while`` e ``if`` pueden contener cualquier operador, no sólo comparaciones.

source: The comparison operators ``in`` and ``not in`` check whether a value occurs (does not occur) in a sequence. The operators ``is`` and ``is not`` compare whether two objects are really the same object; this only matters for mutable objects like lists. All comparison operators have the same priority, which is lower than that of all numerical operators.
es: Los operadores de comparación ``in`` y ``not in`` verifican si un valor está (o no está) en una secuencia. Los operadores ``is`` e ``is not`` comparan si dos objetos son realmente el mismo objeto; esto es significativo sólo para objetos mutables como las listas. Todos los operadores de comparación tienen la misma prioridad, la cual es menor que la de todos los operadores numéricos.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
es: Las comparaciones pueden encadenarse. Por ejemplo, ``a < b == c`` verifica si ``a`` es menor que ``b`` y además si ``b`` es igual a ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
es: Las comparaciones pueden combinarse mediante los operadores booleanos ``and`` y ``or``, y el resultado de una comparación (o de cualquier otra expresión booleana) puede negarse con ``not``. Estos tienen prioridades menores que los operadores de comparación; entre ellos ``not`` tiene la mayor prioridad y ``or`` la menor, o sea que ``A and not B or C`` equivale a ``(A and (not B)) or C``. Como siempre, los paréntesis pueden usarse para expresar la composición deseada.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
es: Los operadores booleanos ``and`` y ``or`` son los llamados operadores *cortocircuito*: sus argumentos se evalúan de izquierda a derecha, y la evaluación se detiene en el momento en que se determina su resultado. Por ejemplo, si ``A`` y ``C`` son verdaderas pero ``B`` es falsa, en ``A and B and C`` no se evalúa la expresión ``C``. Cuando se usa como un valor general y no como un booleano, el valor retornado de un operador cortocircuito es el último argumento evaluado.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
es: Es posible asignar el resultado de una comparación u otra expresión booleana a una variable. Por ejemplo, ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
es: Nota que en Python, a diferencia de C, asignaciones dentro de expresiones deben realizarse explícitamente con :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. Esto soluciona algunos problemas comunes encontrados en C: escribiendo ``=`` en una expresión cuando se intentaba escribir ``==``.

source: Comparing Sequences and Other Types
es: Comparando secuencias y otros tipos

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
es: Las secuencias pueden compararse con otros objetos del mismo tipo de secuencia. La comparación usa orden *lexicográfico*: primero se comparan los dos primeros ítems, si son diferentes esto ya determina el resultado de la comparación; si son iguales, se comparan los siguientes dos ítems, y así sucesivamente hasta llegar al final de alguna de las secuencias. Si dos ítems a comparar son ambos secuencias del mismo tipo, la comparación lexicográfica es recursiva. Si todos los ítems de dos secuencias resultan iguales, se considera que las secuencias son iguales. Si una secuencia es la parte inicial de la otra, la secuencia más corta es la más pequeña. El orden lexicográfico de los strings utiliza el punto de código Unicode para ordenar caracteres individuales. Algunos ejemplos de comparación entre secuencias del mismo tipo::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
es: Observá que comparar objetos de diferentes tipos con ``<`` o ``>`` es legal siempre y cuando los objetas tenga los métodos de comparación apropiados. Por ejemplo, los tipos de números mezclados son comparados de acuerdo a su valor numérico, o sea 0 es igual a 0.0, etc. Si no es el caso, en lugar de proveer un ordenamiento arbitrario, el intérprete generará una excepción :exc:`TypeError`.

source: Footnotes
es: Notas al pie

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
es: Otros lenguajes podrían retornar un objeto mutado, que permite encadenamiento de métodos como ``d->insert("a")->remove("b")->sort();``.
