Repository: python/python-docs-es
Catalog: tutorial/inputoutput.po
Languages: es

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
es: Para cambiar la posición del objeto archivo, utiliza ``f.seek(offset, whence)``. La posición es calculada agregando el *offset* a un punto de referencia; el punto de referencia se selecciona del argumento *whence*. Un valor *whence* de 0 mide desde el comienzo del archivo, 1 usa la posición actual del archivo, y 2 usa el fin del archivo como punto de referencia. *whence* puede omitirse, el valor por defecto es 0, usando el comienzo del archivo como punto de referencia. ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
es: En los archivos de texto (aquellos que se abrieron sin una ``b`` en el modo), se permiten solamente desplazamientos con ``seek`` relativos al comienzo (con la excepción de ir justo al final con ``seek(0, 2)``) y los únicos valores de *desplazamiento* válidos son aquellos retornados por ``f.tell()``, o cero. Cualquier otro valor de *desplazamiento* produce un comportamiento indefinido.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
es: Los objetos archivo tienen algunos métodos más, como :meth:`~io.IOBase.isatty` y :meth:`~io.IOBase.truncate` que son usados menos frecuentemente; consultá la Referencia de la Biblioteca para una guía completa sobre los objetos archivo.

source: Saving structured data with :mod:`json`
es: Guardar datos estructurados con :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
es: Las cadenas pueden fácilmente escribirse y leerse de un archivo. Los números toman algo más de esfuerzo, ya que el método :meth:`~io.TextIOBase.read` sólo retorna cadenas, que tendrán que ser pasadas a una función como :func:`int`, que toma una cadena como ``'123'`` y retorna su valor numérico 123. Sin embargo, cuando querés guardar tipos de datos más complejos como listas, diccionarios, o instancias de clases, las cosas se ponen más complicadas.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
es: En lugar de tener a los usuarios constantemente escribiendo y debugueando código para guardar tipos de datos complicados, Python te permite usar el popular formato intercambiable de datos llamado `JSON (JavaScript Object Notation) <http://json.org>`_. El módulo estándar llamado :mod:`json` puede tomar datos de Python con una jerarquía, y convertirlo a representaciones de cadena de caracteres; este proceso es llamado :dfn:`serialización`. Reconstruir los datos desde la representación de cadena de caracteres es llamado :dfn:`deserialización`. Entre serialización y deserialización, la cadena de caracteres representando el objeto quizás haya sido guardado en un archivo o datos, o enviado a una máquina distante por una conexión de red.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
es: El formato JSON es comúnmente usado por aplicaciones modernas para permitir el intercambio de datos. Muchos programadores ya están familiarizados con él, lo cual lo convierte en una buena opción para la interoperabilidad.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
es: Si tienes un objeto ``x``, puedes ver su representación JSON con una simple línea de código::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
es: Otra variante de la función :func:`~json.dumps`, llamada :func:`~json.dump`, simplemente serializa el objeto a un :term:`archivo de texto`. Así que, si ``f`` es un objeto :term:`archivo de texto` abierto para escritura, podemos hacer::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
es: Para decodificar un objeto nuevamente, si ``f`` es un objeto :term:`binary file` o :term:`text file` que fue abierto para lectura::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
es: Los archivos JSON deben estar codificados en UTF-8. Utilice ``encoding="utf-8"`` al abrir un archivo JSON como :term:`text file` tanto para lectura como para escritura.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
es: La simple técnica de serialización puede manejar listas y diccionarios, pero serializar instancias de clases arbitrarias en JSON requiere un poco de esfuerzo extra. La referencia del módulo :mod:`json` contiene una explicación de esto.

source: :mod:`pickle` - the pickle module
es: :mod:`pickle` - El módulo *pickle*

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
es: Contrariamente a :ref:`JSON <tut-json>`, *pickle* es un protocolo que permite la serialización de objetos Python arbitrariamente complejos. Como tal, es específico de Python y no se puede utilizar para comunicarse con aplicaciones escritas en otros lenguajes. También es inseguro de forma predeterminada: deserializar los datos de *pickle* procedentes de un origen que no es de confianza puede ejecutar código arbitrario, si los datos fueron creados por un atacante experto.

source: built-in function
es: función incorporada

source: module
es: módulo
