Repository: python/python-docs-es
Catalog: tutorial/inputoutput.po
Languages: es

source: Input and Output
es: Entrada y salida

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
es: Hay diferentes métodos de presentar la salida de un programa; los datos pueden ser impresos de una forma legible por humanos, o escritos a un archivo para uso futuro. Este capítulo discutirá algunas de las posibilidades.

source: Fancier Output Formatting
es: Formateo elegante de la salida

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
es: Hasta ahora encontramos dos maneras de escribir valores: *declaraciones de expresión* y la función :func:`print`. (Una tercera manera es usando el método :meth:`~io.TextIOBase.write` de los objetos tipo archivo; el archivo de salida estándar puede referenciarse como ``sys.stdout``. Mirá la Referencia de la Biblioteca para más información sobre esto).

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
es: A menudo se querrá tener más control sobre el formato de la salida, y no simplemente imprimir valores separados por espacios. Para ello, hay varias maneras de dar formato a la salida.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
es: Para usar :ref:`literales de cadena formateados <tut-f-strings>`, comience una cadena con ``f`` o ``F`` antes de la comilla de apertura o comillas triples. Dentro de esta cadena, se puede escribir una expresión de Python entre los caracteres ``{`` y ``}`` que pueden hacer referencia a variables o valores literales.

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted.
es: El método :meth:`str.format` requiere más esfuerzo manual. Se seguirá usando ``{`` y ``}`` para marcar dónde se sustituirá una variable y puede proporcionar directivas de formato detalladas, pero también se debe proporcionar la información de lo que se va a formatear.

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
es: Por último, puede realizar todo el control de cadenas usted mismo mediante operaciones de concatenación y segmentación de cadenas para crear cualquier diseño que se pueda imaginar. El tipo de cadena tiene algunos métodos que realizan operaciones útiles para rellenar cadenas a un ancho de columna determinado.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
es: Cuando no necesita una salida elegante, pero solo desea una visualización rápida de algunas variables con fines de depuración, puede convertir cualquier valor en una cadena con las funciones :func:`repr` o :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
es: La función :func:`str` retorna representaciones de los valores que son bastante legibles por humanos, mientras que :func:`repr` genera representaciones que pueden ser leídas por el intérprete (o forzarían un :exc:`SyntaxError` si no hay sintaxis equivalente). Para objetos que no tienen una representación en particular para consumo humano, :func:`str` retornará el mismo valor que :func:`repr`. Muchos valores, como números o estructuras como listas y diccionarios, tienen la misma representación usando cualquiera de las dos funciones. Las cadenas, en particular, tienen dos representaciones distintas.

source: Some examples::
es: Algunos ejemplos::

source: The :mod:`string` module contains a :class:`~string.Template` class that offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary, but offers much less control of the formatting.
es: El módulo :mod:`string` contiene una clase :class:`~string.Template` que ofrece otra forma de sustituir valores en cadenas, utilizando marcadores de posición como ``$x`` y reemplazarlos con valores desde un diccionario, pero esto ofrece mucho menos control en el formato.

source: Formatted String Literals
es: Formatear cadenas literales

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
es: :ref:`Literales de cadena formateados <f-strings>` (también llamados f-strings para abreviar) le permiten incluir el valor de las expresiones de Python dentro de una cadena prefijando la cadena con ``f`` o ``F`` y escribiendo expresiones como ``{expresion}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
es: La expresión puede ir seguida de un especificador de formato opcional . Esto permite un mayor control sobre cómo se formatea el valor. En el ejemplo siguiente se redondea pi a tres lugares después del decimal::

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
es: Pasar un entero después de ``':'`` hará que ese campo sea un número mínimo de caracteres de ancho. Esto es útil para hacer que las columnas se alineen. ::

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
es: Se pueden utilizar otros modificadores para convertir el valor antes de formatearlo. ``'!a'`` se aplica :func:`ascii`, ``'!s'`` se aplica :func:`str`, y ``'!r'`` se aplica :func:`repr`::

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
es: El especificador ``=`` puede utilizarse para expandir una expresión al texto de la expresión, un signo igual y, a continuación, la representación de la expresión evaluada:

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
es: Véase :ref:`expresiones auto-documentadas <bpo-36817-whatsnew>` para más información en el especificador ``=``. Para obtener una referencia sobre estas especificaciones de formato, consulte la guía de referencia para :ref:`formatspec`.

source: The String format() Method
es: El método format() de cadenas

source: Basic usage of the :meth:`str.format` method looks like this::
es: El uso básico del método :meth:`str.format` es como esto::

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
es: Las llaves y caracteres dentro de las mismas (llamados campos de formato) son reemplazadas con los objetos pasados en el método :meth:`str.format`. Un número en las llaves se refiere a la posición del objeto pasado en el método :meth:`str.format`. ::

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
es: Si se usan argumentos nombrados en el método :meth:`str.format`, sus valores se referencian usando el nombre del argumento. ::

source: Positional and keyword arguments can be arbitrarily combined::
es: Se pueden combinar arbitrariamente argumentos posicionales y nombrados::

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
es: Si tiene una cadena de caracteres de formato realmente larga que no desea dividir, sería bueno si pudiera hacer referencia a las variables que se formatearán por nombre en lugar de por posición. Esto se puede hacer simplemente pasando el diccionario y usando corchetes ``'[]'`` para acceder a las claves. ::

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
es: Esto se podría hacer, también, pasando el diccionario ``table`` como argumentos por palabra clave con la notación '**'. ::

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables.
es: Esto es particularmente útil en combinación con la función integrada :func:`vars`, que retorna un diccionario conteniendo todas las variables locales.

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
es: Como ejemplo, las siguientes líneas producen un conjunto ordenado de columnas que dan enteros y sus cuadrados y cubos::

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
es: Para una completa descripción del formateo de cadenas con :meth:`str.format`, ver :ref:`string-formatting`.

source: Manual String Formatting
es: Formateo manual de cadenas

source: Here's the same table of squares and cubes, formatted manually::
es: Aquí está la misma tabla de cuadrados y cubos, formateados manualmente::

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
es: (Nótese que el espacio existente entre cada columna es añadido debido a como funciona :func:`print`: siempre añade espacios entre sus argumentos.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
es: El método :meth:`str.rjust` de los objetos cadena justifica a la derecha en un campo de anchura predeterminada rellenando con espacios a la izquierda. Métodos similares a este son :meth:`str.ljust` y :meth:`str.center`. Estos métodos no escriben nada, simplemente retornan una nueva cadena. Si la cadena de entrada es demasiado larga no la truncarán sino que la retornarán sin cambios; esto desordenará la disposición de la columna que es, normalmente, mejor que la alternativa, la cual podría falsear un valor. (Si realmente deseas truncar siempre puedes añadir una operación de rebanado, como en ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
es: Hay otro método, :meth:`str.zfill`, el cual rellena una cadena numérica a la izquierda con ceros. Entiende signos positivos y negativos::

source: Old string formatting
es: Viejo formateo de cadenas

source: The % operator (modulo) can also be used for string formatting. Given ``'string' % values``, instances of ``%`` in ``string`` are replaced with zero or more elements of ``values``. This operation is commonly known as string interpolation. For example::
es: El operador % (módulo) también se puede utilizar para formatear cadenas de caracteres. Dados los ``'cadena de caracteres' % valores``, las instancias de ``%`` en ``cadena de caracteres`` se reemplazan con cero o más elementos de ``valores``. Esta operación se conoce comúnmente como interpolación de cadenas. Por ejemplo::

source: More information can be found in the :ref:`old-string-formatting` section.
es: Podés encontrar más información en la sección :ref:`old-string-formatting`.

source: Reading and Writing Files
es: Leyendo y escribiendo archivos

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
es: La función :func:`open` retorna un :term:`file object`, y se usa normalmente con dos argumentos posicionales y un argumento nombrado: ``open(nombre_de_archivo, modo, encoding=None)``

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
es: El primer argumento es una cadena que contiene el nombre del fichero. El segundo argumento es otra cadena que contiene unos pocos caracteres describiendo la forma en que el fichero será usado. *mode* puede ser ``'r'`` cuando el fichero solo se leerá, ``'w'`` para solo escritura (un fichero existente con el mismo nombre se borrará) y ``'a'`` abre el fichero para agregar; cualquier dato que se escribe en el fichero se añade automáticamente al final. ``'r+'`` abre el fichero tanto para lectura como para escritura. El argumento *mode* es opcional; se asume que se usará ``'r'`` si se omite.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
es: Normalmente, los ficheros se abren en :dfn:`modo texto`, es decir, se leen y escriben cadenas desde y hacia el fichero, que están codificadas en una *codificación* específica. Si no se especifica *codificación*, el valor por defecto depende de la plataforma (véase :func:`open`). Dado que UTF-8 es el estándar moderno de facto, se recomienda ``encoding="utf-8"`` a menos que sepa que necesita usar una codificación diferente. Añadiendo ``'b'`` al modo se abre el fichero en :dfn:`modo binario`. Los datos en modo binario se leen y escriben como objetos :class:`bytes`. No se puede especificar *codificación* al abrir un fichero en modo binario.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
es: Cuando se lee en modo texto, por defecto se convierten los fin de lineas que son específicos a las plataformas (``\n`` en Unix, ``\r\n`` en Windows) a solamente ``\n``. Cuando se escribe en modo texto, por defecto se convierten los ``\n`` a los fin de linea específicos de la plataforma. Este cambio automático está bien para archivos de texto, pero corrompería datos binarios como los de archivos :file:`JPEG` o :file:`EXE`. Asegúrese de usar modo binario cuando lea y escriba tales archivos.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
es: Es una buena práctica usar la declaración :keyword:`with` cuando manejamos objetos archivo. Tiene la ventaja de que el archivo es cerrado apropiadamente luego de que el bloque termina, incluso si se generó una excepción. También es mucho más corto que escribir los equivalentes bloques :keyword:`try`\ -\ :keyword:`finally` ::

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
es: Si no está utilizando la palabra clave :keyword:`with`, entonces debe llamar a ``f.close()`` para cerrar el archivo y liberar inmediatamente los recursos del sistema utilizados por él.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
es: Llamar a ``f.write()`` sin usar la palabra clave :keyword:`!with` o sin llamar a ``f.close()`` **podría** dar como resultado que los argumentos de ``f.write()`` no se escriban completamente en disco, incluso si el programa se termina correctamente.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
es: Después de que un objeto de archivo es cerrado, ya sea por :keyword:`with` o llamando a ``f.close()``, intentar volver a utilizarlo fallará automáticamente::

source: Methods of File Objects
es: Métodos de los objetos Archivo

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
es: El resto de los ejemplos en esta sección asumirán que ya se creó un objeto archivo llamado ``f``.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
es: Para leer el contenido de una archivo utiliza ``f.read(size)``, el cual lee alguna cantidad de datos y los retorna como una cadena (en modo texto) o un objeto de bytes (en modo binario). *size* es un argumento numérico opcional. Cuando se omite *size* o es negativo, el contenido entero del archivo será leído y retornado; es tu problema si el archivo es el doble de grande que la memoria de tu máquina. De otra manera, son leídos y retornados como máximo *size* caracteres (en modo texto) o *size* bytes (en modo binario). Si se alcanzó el fin del archivo, ``f.read()`` retornará una cadena vacía (``''``). ::

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
es: ``f.readline()`` lee una sola linea del archivo; el carácter de fin de linea (``\n``) se deja al final de la cadena, y sólo se omite en la última linea del archivo si el mismo no termina en un fin de linea. Esto hace que el valor de retorno no sea ambiguo; si ``f.readline()`` retorna una cadena vacía, es que se alcanzó el fin del archivo, mientras que una linea en blanco es representada por ``'\n'``, una cadena conteniendo sólo un único fin de linea. ::

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
es: Para leer líneas de un archivo, puedes iterar sobre el objeto archivo. Esto es eficiente en memoria, rápido, y conduce a un código más simple::

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
es: Si querés leer todas las líneas de un archivo en una lista también podés usar ``list(f)`` o ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
es: ``f.write(cadena)`` escribe el contenido de la *cadena* al archivo, retornando la cantidad de caracteres escritos. ::

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
es: Otros tipos de objetos necesitan ser convertidos -- tanto a una cadena (en modo texto) o a un objeto de bytes (en modo binario) -- antes de escribirlos::

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
es: ``f.tell()`` retorna un entero que indica la posición actual en el archivo representada como número de bytes desde el comienzo del archivo en modo binario y un número opaco en modo texto.
