Repository: python/python-docs-es
Catalog: tutorial/introduction.po
Languages: es

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
es: Debido a que ``**`` tiene una prioridad mayor que ``-``, ``-3**2`` se interpretará como ``-(3**2)``, por lo tanto dará como resultado ``-9``. Para evitar esto y obtener ``9``, puedes usar ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
es: A diferencia de otros lenguajes, caracteres especiales como ``\n`` tienen el mismo significado con simple(``'...'``) y dobles (``"..."``) comillas. La única diferencia entre las dos es que dentro de las comillas simples no existe la necesidad de escapar ``"`` (pero tienes que escapar ``\'``) y viceversa.

source: comment
es: comentario
