Repository: python/python-docs-es
Catalog: tutorial/introduction.po
Languages: es

source: An Informal Introduction to Python
es: Una introducción informal a Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
es: En los siguientes ejemplos, la entrada y la salida se distinguen por la presencia o ausencia de prompts (:term:`>>>` y :term:`...`): para repetir el ejemplo, escribe todo después del prompt, cuando aparece; las líneas que no comienzan con un prompt son emitidas desde el intérprete. Ten en cuenta que en un ejemplo un prompt secundario en una linea en solitario significa que debes escribir una línea en blanco. Esto se utiliza para finalizar un comando multilínea.

source: You can toggle the display of prompts and output by clicking on ``>>>`` in the upper-right corner of an example box. If you hide the prompts and output for an example, then you can easily copy and paste the input lines into your interpreter.
es: Puede alternar la visualización de mensajes y salida haciendo clic en ``>>>`` en la esquina superior derecha de un cuadro de ejemplo. Si oculta las indicaciones y la salida para un ejemplo, puede copiar y pegar fácilmente las líneas de entrada en su intérprete.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
es: Muchos de los ejemplos de este manual, incluso aquellos ingresados en el prompt interactivo, incluyen comentarios. Los comentarios en Python comienzan con el carácter numeral, ``#``, y se extienden hasta el final visible de la línea. Un comentario quizás aparezca al comienzo de la línea o seguido de espacios en blanco o código, pero no dentro de una cadena de caracteres. Un carácter numeral dentro de una cadena de caracteres es sólo un carácter numeral. Ya que los comentarios son para aclarar código y no son interpretados por Python, pueden omitirse cuando se escriben los ejemplos.

source: Some examples::
es: Algunos ejemplos::

source: Using Python as a Calculator
es: Usando Python como una calculadora

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
es: Probemos algunos comandos simples de Python. Inicia el intérprete y espera el prompt primario, ``>>>``. (No debería tardar mucho.)

source: Numbers
es: Números

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
es: El intérprete funciona como una simple calculadora: puedes introducir una expresión en él y este escribirá los valores. La sintaxis es sencilla: los operadores ``+``, ``-``, ``*`` y ``/`` se pueden usar para realizar operaciones aritméticas; los paréntesis (``()``) pueden ser usados para agrupar. Por ejemplo::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
es: Los números enteros (ej. ``2``, ``4``, ``20``) tienen tipo :class:`int`, los que tienen una parte fraccionaria (por ejemplo ``5.0``, ``1.6``) tiene el tipo :class:`float`. Vamos a ver más acerca de los tipos numéricos más adelante en el tutorial.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
es: La división (``/``) siempre retorna un número decimal de punto flotante. Para hacer :term:`floor division` y obtener un número entero como resultado puede usarse el operador ``//``; para calcular el resto puedes usar ``%``::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
es: Con Python, es posible usar el operador ``**`` para calcular potencias [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
es: El signo igual (``=``) se usa para asignar un valor a una variable. Después, no se muestra ningún resultado antes del siguiente prompt interactivo::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
es: Si una variable no está "definida" (no se le ha asignado un valor), al intentar usarla dará un error::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
es: Hay soporte completo de punto flotante; operadores con operando mezclados convertirán los enteros a punto flotante::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
es: En el modo interactivo, la última expresión impresa se asigna a la variable ``_``. Esto significa que cuando se está utilizando Python como calculadora, es más fácil seguir calculando, por ejemplo::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
es: Esta variable debe ser tratada como de sólo lectura por el usuario. No le asignes explícitamente un valor; crearás una variable local independiente con el mismo nombre enmascarando la variable con el comportamiento mágico.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
es: Además de :class:`int` y :class:`float`, Python admite otros tipos de números, como :class:`~decimal.Decimal` y :class:`~fractions.Fraction`. Python también tiene soporte incorporado para :ref:`complex numbers <typesnumeric>`, y usa el sufijo ``j`` o ``J`` para indicar la parte imaginaria (por ejemplo, ``3+5j``).

source: Text
es: Texto

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_.
es: Python puede manipular texto (representado por el tipo :class:`str`, conocido como "cadenas de caracteres") al igual que números. Esto incluye caracteres "``!``", palabras "``conejo``", nombres "``París``", oraciones "``¡Te tengo a la vista!``", etc. "``Yay! :)``". Se pueden encerrar en comillas simples (``'...'``) o comillas dobles (``"..."``) con el mismo resultado [#]_.

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
es: Para citar una cita, debemos "escapar" la cita precediéndola con ``\``. Alternativamente, podemos usar el otro tipo de comillas::

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
es: En el intérprete de Python, la definición de cadena y la cadena de salida pueden verse diferentes. La función :func:`print` produce una salida más legible, omitiendo las comillas de encuadre e imprimiendo caracteres escapados y especiales::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
es: Si no quieres que los caracteres precedidos por ``\`` se interpreten como caracteres especiales, puedes usar *cadenas sin formato* agregando una ``r`` antes de la primera comilla::

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
es: Hay un aspecto sutil en las cadenas sin formato: una cadena sin formato no puede terminar en un número impar de caracteres ``\``; consultar :ref:`en preguntas frequentes <faq-programming-raw-string-backslash>` para obtener más información y soluciones.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
es: Las cadenas de texto literales pueden contener múltiples líneas. Una forma es usar triples comillas: ``"""..."""`` o ``'''...'''``. Los fin de línea son incluidos automáticamente, pero es posible prevenir esto agregando una ``\`` al final de la línea. Por ejemplo:

source: produces the following output (note that the initial newline is not included):
es: produce la siguiente salida (tener en cuenta que la línea inicial no está incluida):

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
es: Las cadenas se pueden concatenar (pegar juntas) con el operador ``+`` y se pueden repetir con ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
es: Dos o más *cadenas literales* (es decir, las encerradas entre comillas) una al lado de la otra se concatenan automáticamente. ::

source: This feature is particularly useful when you want to break long strings::
es: Esta característica es particularmente útil cuando quieres dividir cadenas largas::

source: This only works with two literals though, not with variables or expressions::
es: Esto solo funciona con dos literales, no con variables ni expresiones::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
es: Si quieres concatenar variables o una variable y un literal, usa ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
es: Las cadenas de texto se pueden *indexar* (subíndices), el primer carácter de la cadena tiene el índice 0. No hay un tipo de dato diferente para los caracteres; un carácter es simplemente una cadena de longitud uno::

source: Indices may also be negative numbers, to start counting from the right::
es: Los índices también pueden ser números negativos, para empezar a contar desde la derecha::

source: Note that since -0 is the same as 0, negative indices start from -1.
es: Nótese que -0 es lo mismo que 0, los índice negativos comienzan desde -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
es: Además de los índices, las *rebanadas* (slicing) también están soportadas. Mientras que la indexación se utiliza para obtener caracteres individuales, *rebanar* te permite obtener una subcadena::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
es: Los índices de las rebanadas tienen valores por defecto útiles; el valor por defecto para el primer índice es cero, el valor por defecto para el segundo índice es la longitud de la cadena a rebanar. ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
es: Nótese cómo el inicio siempre se incluye y el final siempre se excluye. Esto asegura que ``s[:i] + s[i:]`` siempre sea igual a ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
es: Una forma de recordar cómo funcionan las rebanadas es pensar que los índices apuntan *entre* caracteres, con el borde izquierdo del primer carácter numerado 0. Luego, el punto derecho del último carácter de una cadena de *n* caracteres tiene un índice *n*, por ejemplo ::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
es: La primera fila de números da la posición de los índices 0...6 en la cadena; La segunda fila da los correspondientes indices negativos. La rebanada desde *i* hasta *j* consta de todos los caracteres entre los bordes etiquetados *i* y *j*, respectivamente.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
es: Para índices no negativos, la longitud de la rebanada es la diferencia de los índices, si ambos están dentro de los límites. Por ejemplo, la longitud de ``word[1:3]`` es 2.

source: Attempting to use an index that is too large will result in an error::
es: Intentar usar un índice que es muy grande resultará en un error::

source: However, out of range slice indexes are handled gracefully when used for slicing::
es: Sin embargo, los índices de rebanadas fuera de rango se manejan satisfactoriamente cuando se usan para rebanar::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
es: Las cadenas de Python no se pueden modificar, son :term:`immutable`. Por eso, asignar a una posición indexada de la cadena resulta en un error:

source: If you need a different string, you should create a new one::
es: Si necesitas una cadena diferente, deberías crear una nueva::

source: The built-in function :func:`len` returns the length of a string::
es: La función incorporada :func:`len` retorna la longitud de una cadena::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
es: Las cadenas de texto son ejemplos de *tipos secuencias* y soportan las operaciones comunes para esos tipos.

source: Strings support a large number of methods for basic transformations and searching.
es: Las cadenas de texto soportan una gran cantidad de métodos para transformaciones básicas y búsqueda.

source: String literals that have embedded expressions.
es: Literales de cadena que tienen expresiones embebidas.

source: Information about string formatting with :meth:`str.format`.
es: Aquí se da información sobre formateo de cadenas de texto con :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
es: Aquí se describen con más detalle las antiguas operaciones para formateo utilizadas cuando una cadena de texto está a la izquierda del operador ``%``.

source: Lists
es: Listas

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
es: Python tiene varios tipos de datos *compuestos*, utilizados para agrupar otros valores. El más versátil es la *lista*, la cual puede ser escrita como una lista de valores separados por coma (ítems) entre corchetes. Las listas pueden contener ítems de diferentes tipos, pero usualmente los ítems son del mismo tipo. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
es: Al igual que las cadenas (y todas las demás tipos integrados :term:`sequence`), las listas se pueden indexar y segmentar:

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
es: Todas las operaciones de rebanado retornan una nueva lista que contiene los elementos pedidos. Esto significa que la siguiente rebanada retorna una :ref:`shallow copy <shallow_vs_deep_copy>` de la lista::

source: Lists also support operations like concatenation::
es: Las listas también admiten operaciones como concatenación::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
es: A diferencia de las cadenas, que son :term:`immutable`, las listas son de tipo :term:`mutable`, es decir, es posible cambiar su contenido::

source: You can also add new items at the end of the list, by using the :meth:`~list.append` *method* (we will see more about methods later)::
es: También puede agregar nuevos elementos al final de la lista, utilizando el *método* :meth:`~list.append` (vamos a ver más sobre los métodos luego)::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
es: También es posible asignar a una rebanada, y esto incluso puede cambiar la longitud de la lista o vaciarla totalmente::

source: The built-in function :func:`len` also applies to lists::
es: La función predefinida :func:`len` también sirve para las listas ::

source: It is possible to nest lists (create lists containing other lists), for example::
es: Es posible anidar listas (crear listas que contengan otras listas), por ejemplo::

source: First Steps Towards Programming
es: Primeros pasos hacia la programación

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_number>`_ as follows::
es: Por supuesto, podemos usar Python para tareas más complicadas que sumar dos más dos. Por ejemplo, podemos escribir una parte inicial de la `serie de Fibonacci <https://es.wikipedia.org/wiki/Sucesión_de_Fibonacci>`_ así::

source: This example introduces several new features.
es: Este ejemplo introduce varias características nuevas.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
es: La primera línea contiene una *asignación múltiple*: las variables ``a`` y ``b`` obtienen simultáneamente los nuevos valores 0 y 1. En la última línea esto se usa nuevamente, demostrando que las expresiones de la derecha son evaluadas primero antes de que se realice cualquiera de las asignaciones. Las expresiones del lado derecho se evalúan de izquierda a derecha.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
es: El bucle :keyword:`while` se ejecuta mientras la condición (aquí: ``a < 10``) sea verdadera. En Python, como en C, cualquier valor entero que no sea cero es verdadero; cero es falso. La condición también puede ser una cadena de texto o una lista, de hecho, cualquier secuencia; cualquier cosa con una longitud distinta de cero es verdadera, las secuencias vacías son falsas. La prueba utilizada en el ejemplo es una comparación simple. Los operadores de comparación estándar se escriben igual que en C: ``<`` (menor que), ``>`` (mayor que), ``==`` (igual a), ``<=`` (menor que o igual a), ``>=`` (mayor que o igual a) y ``!=`` (distinto a).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
es: El cuerpo del bucle está *indentado*: la indentación es la forma que usa Python para agrupar declaraciones. En el intérprete interactivo debes teclear un tabulador o espacio(s) para cada línea indentada. En la práctica vas a preparar entradas más complicadas para Python con un editor de texto; todos los editores de texto modernos tienen la facilidad de agregar la indentación automáticamente. Cuando se ingresa una instrucción compuesta de forma interactiva, se debe finalizar con una línea en blanco para indicar que está completa (ya que el analizador no puede adivinar cuando tecleaste la última línea). Nota que cada línea de un bloque básico debe estar sangrada de la misma forma.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
es: La función :func:`print` escribe el valor de los argumentos que se le dan. Difiere de simplemente escribir la expresión que se quiere mostrar (como hicimos antes en los ejemplos de la calculadora) en la forma en que maneja múltiples argumentos, cantidades de punto flotante, y cadenas. Las cadenas de texto son impresas sin comillas y un espacio en blanco se inserta entre los elementos, así puedes formatear cosas de una forma agradable::

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
es: El parámetro nombrado *end* puede usarse para evitar el salto de linea al final de la salida, o terminar la salida con una cadena diferente:

source: Footnotes
es: Notas al pie
