Repository: python/python-docs-es
Catalog: tutorial/modules.po
Languages: es

source: Modules
es: Módulos

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
es: Si sales del intérprete de Python y vuelves a entrar, las definiciones que habías hecho (funciones y variables) se pierden. Por lo tanto, si quieres escribir un programa más o menos largo, es mejor que utilices un editor de texto para preparar la entrada para el intérprete y ejecutarlo con ese archivo como entrada. Esto se conoce como crear un *script*. A medida que tu programa crezca, quizás quieras separarlo en varios archivos para que el mantenimiento sea más sencillo. Quizás también quieras usar una función útil que has escrito en distintos programas sin copiar su definición en cada programa.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
es: Para soportar esto, Python tiene una manera de poner definiciones en un archivo y usarlos en un script o en una instancia del intérprete. Este tipo de ficheros se llama *módulo*; las definiciones de un módulo pueden ser *importadas* a otros módulos o al módulo *principal* (la colección de variables a las que tienes acceso en un script ejecutado en el nivel superior y en el modo calculadora).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
es: Un módulo es un fichero conteniendo definiciones y declaraciones de Python. El nombre de archivo es el nombre del módulo con el sufijo :file:`.py` agregado. Dentro de un módulo, el nombre del mismo módulo (como cadena) está disponible en el valor de la variable global ``__name__``. Por ejemplo, utiliza tu editor de texto favorito para crear un archivo llamado :file:`fibo.py` en el directorio actual, con el siguiente contenido::

source: Now enter the Python interpreter and import this module with the following command::
es: Ahora entra en el intérprete de Python e importa este modulo con el siguiente comando::

source: This does not add the names of the functions defined in ``fibo`` directly to the current :term:`namespace` (see :ref:`tut-scopes` for more details); it only adds the module name ``fibo`` there. Using the module name you can access the functions::
es: Esto no añade los nombres de las funciones definidas en ``fibo`` directamente al actual :term:`namespace` (ver :ref:`tut-scopes` para más detalles); sólo añade el nombre del módulo ``fibo`` allí. Usando el nombre del módulo puedes acceder a las funciones::

source: If you intend to use a function often you can assign it to a local name::
es: Si pretendes utilizar una función frecuentemente puedes asignarla a un nombre local::

source: More on Modules
es: Más sobre los módulos

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
es: Un módulo puede contener tanto declaraciones ejecutables como definiciones de funciones. Estas declaraciones están pensadas para inicializar el módulo. Se ejecutan únicamente la *primera* vez que el módulo se encuentra en una declaración import. [#]_ (También se ejecutan si el archivo se ejecuta como script.)

source: Each module has its own private namespace, which is used as the global namespace by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
es: Cada módulo tiene su propio espacio de nombres privado, que es utilizado como espacio de nombres global por todas las funciones definidas en el módulo. De este modo, el autor de un módulo puede utilizar variables globales en el módulo sin preocuparse por choques accidentales con las variables globales de un usuario. Por otro lado, si sabes lo que estás haciendo puedes tocar las variables globales de un módulo con la misma notación que se utiliza para referirse a sus funciones, ``modname.itemname``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names, if placed at the top level of a module (outside any functions or classes), are added to the module's global namespace.
es: Los módulos pueden importar otros módulos. Es costumbre pero no obligatorio ubicar todas las declaraciones :keyword:`import` al principio del módulo (o script, para el caso). Los nombres de los módulos importados, si se colocan en el nivel superior de un módulo (fuera de cualquier función o clase), se añaden al espacio de nombres global del módulo.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's namespace. For example::
es: Hay una variante de la declaración :keyword:`import` que importa los nombres de un módulo directamente al espacio de nombres del módulo que hace la importación. Por ejemplo::

source: This does not introduce the module name from which the imports are taken in the local namespace (so in the example, ``fibo`` is not defined).
es: Esto no introduce en el espacio de nombres local el nombre del módulo desde el cual se está importando (por lo tanto, en el ejemplo, ``fibo`` no esta definido).

source: There is even a variant to import all names that a module defines::
es: Hay incluso una variante para importar todos los nombres que un módulo define::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
es: Esto importa todos los nombres excepto los que inician con un guión bajo (``_``). La mayoría de las veces los programadores de Python no usan esto ya que introduce en el intérprete un conjunto de nombres desconocido, posiblemente escondiendo algunas de las definiciones previas.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
es: Nótese que en general la práctica de importar ``*`` de un módulo o paquete está muy mal vista, ya que frecuentemente genera código poco legible. Sin embargo, está bien usarlo para ahorrar tecleo en sesiones interactivas.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
es: Si el nombre del módulo es seguido por :keyword:`!as`, el nombre siguiendo :keyword:`!as` queda ligado directamente al módulo importado.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
es: Esto es básicamente importar el módulo de la misma forma que se haría con ``import fibo``, con la única diferencia en que se encuentra accesible como ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
es: También se puede utilizar cuando se utiliza :keyword:`from` con efectos similares::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
es: Por razones de eficiencia, cada módulo es importado solo una vez por sesión del intérprete. Por lo tanto, si cambias tus módulos, debes reiniciar el interprete -- ó, si es un solo módulo que quieres probar de forma interactiva, usa :func:`importlib.reload`, por ejemplo: ``import importlib; importlib.reload(modulename)``.

source: Executing modules as scripts
es: Ejecutar módulos como scripts

source: When you run a Python module with ::
es: Cuando ejecutes un módulo de Python con ::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
es: el código en el módulo será ejecutado, tal como si lo hubieses importado, pero con ``__name__`` con el valor de ``"__main__"``. Eso significa que agregando este código al final de tu módulo::

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
es: puedes hacer que el archivo sea utilizable tanto como script, como módulo importable, porque el código que analiza la línea de órdenes sólo se ejecuta si el módulo es ejecutado como archivo principal:

source: If the module is imported, the code is not run::
es: Si el módulo se importa, ese código no se ejecuta::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
es: Esto es frecuentemente usado para proveer al módulo una interfaz de usuario conveniente, o para fines de prueba (ejecutar el módulo como un script que ejecuta un conjunto de pruebas).

source: The Module Search Path
es: El camino de búsqueda de los módulos

source: When a module named :mod:`!spam` is imported, the interpreter first searches for a built-in module with that name. These module names are listed in :data:`sys.builtin_module_names`. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
es: Cuando se importa un módulo llamado :mod:`!spam`, el intérprete busca primero por un módulo con ese nombre que esté integrado en el intérprete. Estos nombres de módulos están listados en :data:`sys.builtin_module_names`. Si no lo encuentra, entonces busca un archivo llamado :file:`spam.py` en una lista de directorios especificada por la variable :data:`sys.path`. :data:`sys.path` se inicializa con las siguientes ubicaciones:

source: The directory containing the input script (or the current directory when no file is specified).
es: El directorio que contiene el script de entrada (o el directorio actual cuando no se especifica archivo).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
es: :envvar:`PYTHONPATH` (una lista de nombres de directorios, con la misma sintaxis que la variable de la terminal :envvar:`PATH`).

source: The installation-dependent default (by convention including a ``site-packages`` directory, handled by the :mod:`site` module).
es: El valor predeterminado dependiente de la instalación (por convención incluye un directorio ``site-packages``, manejado por el módulo :mod:`site`).

source: More details are at :ref:`sys-path-init`.
es: Más detalles en :ref:`sys-path-init`.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
es: En los sistemas de archivo que soportan enlaces simbólicos, el directorio que contiene el script de entrada es calculado luego de seguir el enlace simbólico. En otras palabras, el directorio que contiene el enlace simbólico **no** es agregado al camino de búsqueda del módulo.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
es: Luego de la inicialización, los programas Python pueden modificar :data:`sys.path`. El directorio que contiene el script que se está ejecutando se ubica al principio de la búsqueda, adelante de la biblioteca estándar. Esto significa que se cargarán scripts en ese directorio en lugar de módulos de la biblioteca estándar con el mismo nombre. Esto es un error a menos que se esté reemplazando intencionalmente. Mirá la sección :ref:`tut-standardmodules` para más información.

source: "Compiled" Python files
es: Archivos "compilados" de Python

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
es: Para acelerar la carga de módulos, Python cachea las versiones compiladas de cada módulo en el directorio ``__pycache__`` bajo el nombre :file:`module.{version}.pyc`, dónde la versión codifica el formato del archivo compilado; generalmente contiene el número de versión de Python. Por ejemplo, en CPython *release* 3.3 la versión compilada de spam.py sería cacheada como ``__pycache__/spam.cpython-33.pyc``. Este convención de nombre permite compilar módulos desde diferentes *releases* y versiones de Python para coexistir.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
es: Python chequea la fecha de modificación de la fuente contra la versión compilada para ver si esta es obsoleta y necesita ser recompilada. Esto es un proceso completamente automático. También, los módulos compilados son independientes de la plataforma, así que la misma biblioteca puede ser compartida a través de sistemas con diferentes arquitecturas.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
es: Python no chequea el caché en dos circunstancias. Primero, siempre recompila y no graba el resultado del módulo que es cargado directamente desde la línea de comando. Segundo, no chequea el caché si no hay módulo fuente. Para soportar una distribución sin fuente (solo compilada), el módulo compilado debe estar en el directorio origen, y no debe haber un módulo fuente.

source: Some tips for experts:
es: Algunos consejos para expertos:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
es: Puedes usar los modificadores :option:`-O` o :option:`-OO` en el comando de Python para reducir el tamaño del módulo compilado. El modificador ``-O`` remueve las declaraciones *assert*, el modificador ``-OO`` remueve declaraciones *assert* y cadenas *__doc__*. Dado que algunos programas pueden confiar en tenerlos disponibles, solo deberías usar esta opción si conoces lo que estás haciendo. Los módulos "optimizados" tienen una etiqueta ``opt-`` y generalmente son mas pequeños. *Releases* futuras pueden cambiar los efectos de la optimización.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
es: Un programa no se ejecuta mas rápido cuando es leído de un archivo ``.pyc`` que cuando es leído de un archivo ``.py``; la única cosa que es mas rápida en los archivos ``.pyc`` es la velocidad con la cual son cargados.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
es: El módulo :mod:`compileall` puede crear archivos .pyc para todos los módulos en un directorio.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
es: Hay mas detalle de este proceso, incluyendo un diagrama de flujo de decisiones, en :pep:`3147`.

source: Standard Modules
es: Módulos estándar

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
es: Python viene con una biblioteca de módulos estándar, descrita en un documento separado, la Referencia de la Biblioteca de Python (de aquí en más, "Referencia de la Biblioteca"). Algunos módulos se integran en el intérprete; estos proveen acceso a operaciones que no son parte del núcleo del lenguaje pero que sin embargo están integrados, tanto por eficiencia como para proveer acceso a primitivas del sistema operativo, como llamadas al sistema. El conjunto de tales módulos es una opción de configuración que también depende de la plataforma subyacente. Por ejemplo, el módulo :mod:`winreg` sólo se provee en sistemas Windows. Un módulo en particular merece algo de atención: :mod:`sys`, el que está integrado en todos los intérpretes de Python. Las variables ``sys.ps1`` y ``sys.ps2`` definen las cadenas usadas como cursores primarios y secundarios::

source: These two variables are only defined if the interpreter is in interactive mode.
es: Estas dos variables están solamente definidas si el intérprete está en modo interactivo.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
es: La variable ``sys.path`` es una lista de cadenas que determinan el camino de búsqueda del intérprete para los módulos. Se inicializa por omisión a un camino tomado de la variable de entorno :envvar:`PYTHONPATH`, o a un valor predefinido en el intérprete si :envvar:`PYTHONPATH` no está configurada. Lo puedes modificar usando las operaciones estándar de listas::

source: The :func:`dir` Function
es: La función :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
es: La función integrada :func:`dir` se usa para encontrar qué nombres define un módulo. Retorna una lista ordenada de cadenas::

source: Without arguments, :func:`dir` lists the names you have defined currently::
es: Sin argumentos, :func:`dir` lista los nombres que tienes actualmente definidos::

source: Note that it lists all types of names: variables, modules, functions, etc.
es: Nótese que lista todos los tipos de nombres: variables, módulos, funciones, etc.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
es: :func:`dir` no lista los nombres de las funciones y variables integradas. Si quieres una lista de esos, están definidos en el módulo estándar :mod:`builtins`::

source: Packages
es: Paquetes

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`!A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
es: Los Paquetes son una forma de estructurar el espacio de nombres de módulos de Python usando "nombres de módulo con puntos". Por ejemplo, el nombre del módulo :mod:`!A.B` designa un submódulo ``B`` en un paquete llamado ``A``. Así como el uso de módulos salva a los autores de diferentes módulos de tener que preocuparse por los nombres de las variables globales de los demás, el uso de nombres de módulo con puntos evita que los autores de paquetes multimódulos, como NumPy o Pillow, tengan que preocuparse por los nombres de los módulos de los demás.
