Repository: python/python-docs-es
Catalog: tutorial/modules.po
Languages: es

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
es: Supongamos que quieres designar una colección de módulos (un "paquete") para el manejo uniforme de archivos y datos de sonidos. Hay diferentes formatos de archivos de sonido (normalmente reconocidos por su extensión, por ejemplo: :file:`.wav`, :file:`.aiff`, :file:`.au`), por lo que tienes que crear y mantener una colección siempre creciente de módulos para la conversión entre los distintos formatos de archivos. Hay muchas operaciones diferentes que quizás quieras ejecutar en los datos de sonido (como mezclarlos, añadir eco, aplicar una función ecualizadora, crear un efecto estéreo artificial), por lo que además estarás escribiendo una lista sin fin de módulos para realizar estas operaciones. Aquí hay una posible estructura para tu paquete (expresados en términos de un sistema jerárquico de archivos):

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
es: Al importar el paquete, Python busca a través de los directorios en ``sys.path``, buscando el sub-directorio del paquete.

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages. This prevents directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
es: Los archivos :file:`__init__.py` son obligatorios para que Python trate los directorios que contienen los archivos como paquetes. Esto evita que los directorios con un nombre común, como ``string``, oculten involuntariamente módulos válidos que se producen luego en el camino de búsqueda del módulo. En el caso mas simple, :file:`__init__.py` puede ser solo un archivo vacío, pero también puede ejecutar código de inicialización para el paquete o el conjunto de variables ``__all__``, descriptas luego.

source: Users of the package can import individual modules from the package, for example::
es: Los usuarios del paquete pueden importar módulos individuales del mismo, por ejemplo::

source: This loads the submodule :mod:`!sound.effects.echo`. It must be referenced with its full name. ::
es: Esto carga el submódulo :mod:`!sound.effects.echo`. Debe hacerse referencia al mismo con el nombre completo. ::

source: An alternative way of importing the submodule is::
es: Otra alternativa para importar el submódulo es::

source: This also loads the submodule :mod:`!echo`, and makes it available without its package prefix, so it can be used as follows::
es: Esto también carga el submódulo :mod:`!echo`, y lo deja disponible sin su prefijo de paquete, por lo que puede usarse así::

source: Yet another variation is to import the desired function or variable directly::
es: Otra variación más es importar la función o variable deseadas directamente::

source: Again, this loads the submodule :mod:`!echo`, but this makes its function :func:`!echofilter` directly available::
es: De nuevo, esto carga el submódulo :mod:`!echo`, pero deja directamente disponible a la función :func:`!echofilter`::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
es: Nótese que al usar ``from package import item``, el ítem puede ser tanto un submódulo (o subpaquete) del paquete, o algún otro nombre definido en el paquete, como una función, clase, o variable. La declaración ``import`` primero verifica si el ítem está definido en el paquete; si no, asume que es un módulo y trata de cargarlo. Si no lo puede encontrar, se genera una excepción :exc:`ImportError`.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
es: Por otro lado, cuando se usa la sintaxis como ``import item.subitem.subsubitem``, cada ítem excepto el último debe ser un paquete; el mismo puede ser un módulo o un paquete pero no puede ser una clase, función o variable definida en el ítem previo.

source: Importing \* From a Package
es: Importar \* desde un paquete

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
es: Ahora, ¿qué sucede cuando el usuario escribe ``from sound.effects import *``? Idealmente, uno esperaría que esto de alguna manera vaya al sistema de archivos, encuentre cuales submódulos están presentes en el paquete, y los importe a todos. Esto puede tardar mucho y el importar sub-módulos puede tener efectos secundarios no deseados que sólo deberían ocurrir cuando se importe explícitamente el sub-módulo.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
es: La única solución es que el autor del paquete provea un índice explícito del paquete. La declaración :keyword:`import` usa la siguiente convención: si el código del :file:`__init__.py` de un paquete define una lista llamada ``__all__``, se toma como la lista de los nombres de módulos que deberían ser importados cuando se hace ``from package import *``. Es tarea del autor del paquete mantener actualizada esta lista cuando se libera una nueva versión del paquete. Los autores de paquetes podrían decidir no soportarlo, si no ven un uso para importar \* en sus paquetes. Por ejemplo, el archivo :file:`sound/effects/__init__.py` podría contener el siguiente código::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`!sound.effects` package.
es: Esto significaría que ``from sound.effects import *`` importaría esos tres submódulos del paquete :mod:`!sound.effects`.

source: Be aware that submodules might become shadowed by locally defined names. For example, if you added a ``reverse`` function to the :file:`sound/effects/__init__.py` file, the ``from sound.effects import *`` would only import the two submodules ``echo`` and ``surround``, but *not* the ``reverse`` submodule, because it is shadowed by the locally defined ``reverse`` function::
es: Ten en cuenta que los submódulos pueden quedar ocultos por nombres definidos localmente. Por ejemplo, si agregaste una función llamada ``reverse`` al archivo :file:`sound/effects/__init__.py`, ``from sound.effects import *`` solo importaría los dos submódulos ``echo`` y ``surround``, pero *no* el submódulo ``reverse`` porque queda oculto por la función ``reverse`` definida localmente::

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`!sound.effects` into the current namespace; it only ensures that the package :mod:`!sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
es: Si no se define ``__all__``, la declaración ``from sound.effects import *`` *no* importa todos los submódulos del paquete :mod:`!sound.effects` al espacio de nombres actual; sólo se asegura que se haya importado el paquete :mod:`!sound.effects` (posiblemente ejecutando algún código de inicialización que haya en :file:`__init__.py`) y luego importa aquellos nombres que estén definidos en el paquete. Esto incluye cualquier nombre definido (y submódulos explícitamente cargados) por :file:`__init__.py`. También incluye cualquier submódulo del paquete que pudiera haber sido explícitamente cargado por declaraciones :keyword:`import` previas. Considere este código::

source: In this example, the :mod:`!echo` and :mod:`!surround` modules are imported in the current namespace because they are defined in the :mod:`!sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
es: En este ejemplo, los módulos :mod:`!echo` y :mod:`!surround` se importan en el espacio de nombre actual porque están definidos en el paquete :mod:`!sound.effects` cuando se ejecuta la declaración ``from...import``. (Esto también funciona cuando se define ``__all__``).

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
es: A pesar de que ciertos módulos están diseñados para exportar solo nombres que siguen ciertos patrones cuando uses ``import *``, también se considera una mala práctica en código de producción.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
es: Recuerda, ¡no hay nada malo al usar ``from package import specific_submodule``! De hecho, esta es la notación recomendada a menos que el módulo que importamos necesite usar submódulos con el mismo nombre desde un paquete diferente.

source: Intra-package References
es: Referencias internas en paquetes

source: When packages are structured into subpackages (as with the :mod:`!sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`!sound.filters.vocoder` needs to use the :mod:`!echo` module in the :mod:`!sound.effects` package, it can use ``from sound.effects import echo``.
es: Cuando se estructuran los paquetes en sub-paquetes (como en el ejemplo :mod:`!sound`), puedes usar imports absolutos para referirte a submódulos de paquetes hermanos. Por ejemplo, si el módulo :mod:`!sound.filters.vocoder` necesita usar el módulo :mod:`!echo` en el paquete :mod:`!sound.effects`, puede hacer ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`!surround` module for example, you might use::
es: También puedes escribir imports relativos con la forma ``from module import name``. Estos imports usan puntos adelante para indicar los paquetes actuales o paquetes padres involucrados en el import relativo. En el ejemplo :mod:`!surround`, podrías hacer::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
es: Nótese que los imports relativos se basan en el nombre del módulo actual. Ya que el nombre del módulo principal es siempre ``"__main__"``, los módulos pensados para usarse como módulo principal de una aplicación Python siempre deberían usar ``import`` absolutos.

source: Packages in Multiple Directories
es: Paquetes en múltiples directorios

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
es: Los paquetes soportan un atributo especial más, :attr:`__path__`. Este se inicializa a una lista que contiene el nombre del directorio donde está el archivo :file:`__init__.py` del paquete, antes de que el código en ese archivo se ejecute. Esta variable puede modificarse, afectando búsquedas futuras de módulos y subpaquetes contenidos en el paquete.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
es: Aunque esta característica no se necesita frecuentemente, puede usarse para extender el conjunto de módulos que se encuentran en el paquete.

source: Footnotes
es: Notas al pie

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
es: De hecho, las definiciones de funciones también son "declaraciones" que se "ejecutan"; la ejecución de una definición de función a nivel de módulo, añade el nombre de la función en el espacio de nombres global del módulo.
