Repository: python/python-docs-es
Catalog: tutorial/stdlib.po
Languages: es

source: Brief Tour of the Standard Library
es: Pequeño paseo por la Biblioteca Estándar

source: Operating System Interface
es: Interfaz al sistema operativo

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
es: El módulo :mod:`os` provee docenas de funciones para interactuar con el sistema operativo::

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
es: Asegúrate de usar el estilo ``import os`` en lugar de ``from os import *``. Esto evitará que :func:`os.open` oculte a la función integrada :func:`open`, que trabaja bastante diferente.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
es: Las funciones integradas :func:`dir` y :func:`help` son útiles como ayudas interactivas para trabajar con módulos grandes como :mod:`os`::

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
es: Para tareas diarias de administración de archivos y directorios, el módulo :mod:`shutil` provee una interfaz de más alto nivel que es más fácil de usar::

source: File Wildcards
es: Comodines de archivos

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
es: El módulo :mod:`glob` provee una función para hacer listas de archivos a partir de búsquedas con comodines en directorios::

source: Command Line Arguments
es: Argumentos de linea de órdenes

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance the following output results from running ``python demo.py one two three`` at the command line::
es: Los programas frecuentemente necesitan procesar argumentos de linea de órdenes. Estos argumentos se almacenan en el atributo *argv* del módulo :mod:`sys` como una lista. Por ejemplo, la siguiente salida resulta de ejecutar ``python demo.py uno dos tres`` en la línea de órdenes::

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
es: El modulo :mod:`argparse` provee un mecanismo más sofisticado para procesar argumentos recibidos vía línea de comandos. El siguiente *script* extrae uno o más nombres de archivos y un número opcional de líneas para mostrar::

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
es: Cuando se ejecuta por línea de comandos haciendo ``python top.py --lines=5 alpha.txt beta.txt``, el *script* establece ``args.lines`` a ``5`` y ``args.filenames`` a ``['alpha.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
es: Redirigir la salida de error y finalización del programa

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
es: El módulo :mod:`sys` también tiene atributos para *stdin*, *stdout*, y *stderr*. Este último es útil para emitir mensajes de alerta y error para que se vean incluso cuando se haya redirigido *stdout*::

source: The most direct way to terminate a script is to use ``sys.exit()``.
es: La forma más directa de terminar un programa es usar ``sys.exit()``.

source: String Pattern Matching
es: Coincidencia en patrones de cadenas

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
es: El módulo :mod:`re` provee herramientas de expresiones regulares para un procesamiento avanzado de cadenas. Para manipulación y coincidencias complejas, las expresiones regulares ofrecen soluciones concisas y optimizadas::

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
es: Cuando se necesita algo más sencillo solamente, se prefieren los métodos de las cadenas porque son más fáciles de leer y depurar::

source: Mathematics
es: Matemática

source: The :mod:`math` module gives access to the underlying C library functions for floating point math::
es: El módulo :mod:`math` permite el acceso a las funciones de la biblioteca C subyacente para la matemática de punto flotante::

source: The :mod:`random` module provides tools for making random selections::
es: El módulo :mod:`random` provee herramientas para realizar selecciones al azar::

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
es: El módulo :mod:`statistics` calcula propiedades de estadística básica (la media, mediana, varianza, etc) de datos numéricos::

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
es: El proyecto SciPy <https://scipy.org> tiene muchos otros módulos para cálculos numéricos.

source: Internet Access
es: Acceso a Internet

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
es: Hay varios módulos para acceder a Internet y procesar sus protocolos. Dos de los más simples son :mod:`urllib.request` para traer data de URLs y :mod:`smtplib` para mandar correos::

source: (Note that the second example needs a mailserver running on localhost.)
es: (Notá que el segundo ejemplo necesita un servidor de correo corriendo en la máquina local)

source: Dates and Times
es: Fechas y tiempos

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
es: El módulo :mod:`datetime` ofrece clases para gestionar fechas y tiempos tanto de manera simple como compleja. Aunque soporta aritmética sobre fechas y tiempos, el foco de la implementación es en la extracción eficiente de partes para gestionarlas o formatear la salida. El módulo también soporta objetos que son conscientes de la zona horaria. ::

source: Data Compression
es: Compresión de datos

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
es: Los formatos para archivar y comprimir datos se soportan directamente con los módulos: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` y :mod:`tarfile`. ::

source: Performance Measurement
es: Medición de rendimiento

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
es: Algunos usuarios de Python desarrollan un profundo interés en saber el rendimiento relativo de las diferentes soluciones al mismo problema. Python provee una herramienta de medición que responde esas preguntas inmediatamente.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
es: Por ejemplo, puede ser tentador usar la característica de empaquetado y desempaquetado de las tuplas en lugar de la solución tradicional para intercambiar argumentos. El módulo :mod:`timeit` muestra rápidamente una modesta ventaja de rendimiento::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
es: En contraste con el fino nivel de medición del módulo :mod:`timeit`, los módulos :mod:`profile` y :mod:`pstats` proveen herramientas para identificar secciones críticas de tiempo en bloques de código más grandes.

source: Quality Control
es: Control de calidad

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
es: Una forma para desarrollar software de alta calidad es escribir pruebas para cada función mientras se la desarrolla, y correr esas pruebas frecuentemente durante el proceso de desarrollo.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
es: El módulo :mod:`doctest` provee una herramienta para revisar un módulo y validar las pruebas integradas en las cadenas de documentación (o *docstring*) del programa. La construcción de las pruebas es tan sencillo como cortar y pegar una ejecución típica junto con sus resultados en los docstrings. Esto mejora la documentación al proveer al usuario un ejemplo y permite que el módulo *doctest* se asegure que el código permanece fiel a la documentación::

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
es: El módulo :mod:`unittest` necesita más esfuerzo que el módulo :mod:`doctest`, pero permite que se mantenga en un archivo separado un conjunto más comprensivo de pruebas::

source: Batteries Included
es: Las pilas incluidas

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
es: Python tiene una filosofía de "pilas incluidas". Esto se ve mejor en las capacidades robustas y sofisticadas de sus paquetes más grandes. Por ejemplo:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules names, no direct knowledge or handling of XML is needed.
es: Los módulo :mod:`xmlrpc.client` y :mod:`xmlrpc.server` convierten una implementación de la llamada a un procedimiento en una tarea casi trivial. A pesar de los nombres de los nombres, no se necesita ningún conocimiento o manejo de archivos XML.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
es: El paquete :mod:`email` es una biblioteca para administrar mensajes de correo electrónico, incluidos MIME y otros documentos de mensajes basados en :rfc:`2822`. A diferencia de :mod:`smtplib` y :mod:`poplib` que realmente envían y reciben mensajes, el paquete de correo electrónico tiene un conjunto de herramientas completo para crear o decodificar estructuras de mensajes complejas (incluidos los archivos adjuntos) y para implementar protocolos de codificación y encabezado de Internet.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
es: El paquete :mod:`json` proporciona un sólido soporte para analizar este popular formato de intercambio de datos. El módulo :mod:`csv` admite la lectura y escritura directa de archivos en formato de valor separado por comas, comúnmente compatible con bases de datos y hojas de cálculo. El procesamiento XML es compatible con los paquetes :mod:`xml.etree.ElementTree`, :mod:`xml.dom` y :mod:`xml.sax`. Juntos, estos módulos y paquetes simplifican en gran medida el intercambio de datos entre aplicaciones de Python y otras herramientas.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
es: El módulo :mod:`sqlite3` es un *wrapper* para la biblioteca de bases de datos SQLite, proporcionando una base de datos persistente que se puede actualizar y acceder mediante una sintaxis SQL ligeramente no estándar.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
es: La internacionalización es compatible con una serie de módulos, incluyendo :mod:`gettext`, :mod:`locale`, y el paquete :mod:`codecs`.
