Repository: python/python-docs-es
Catalog: about.po
Languages: es

source: About these documents
es: Acerca de estos documentos

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
es: Estos documentos son generados por `reStructuredText`_ desarrollado por `Sphinx`_, un procesador de documentos específicamente escrito para la documentación de Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
es: El desarrollo de la documentación y su cadena de herramientas es un esfuerzo enteramente voluntario, al igual que Python. Si tu quieres contribuir, por favor revisa la página :ref:`reporting-bugs` para más información de cómo hacerlo. Los nuevos voluntarios son siempre bienvenidos!

source: Many thanks go to:
es: Agradecemos a:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
es: Fred L. Drake, Jr., el creador original de la documentación del conjunto de herramientas de Python y escritor de gran parte del contenido;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
es: el proyecto `Docutils <http://docutils.sourceforge.net/>`_ para creación de reStructuredText y el juego de Utilidades de Documentación;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
es: Fredrik Lundh por su proyecto `Referencia Alternativa de Python <http://effbot.org/zone/pyref.htm>`_ para la cual Sphinx tuvo muchas ideas.

source: Contributors to the Python Documentation
es: Contribuidores de la documentación de Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
es: Muchas personas han contribuido para el lenguaje de Python, la librería estándar de Python, y la documentación de Python. Revisa :source:`Misc/ACKS` la distribución de Python para una lista parcial de contribuidores.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
es: Es solamente con la aportación y contribuciones de la comunidad de Python que Python tiene tan fantástica documentación -- Muchas gracias!
