Repository: python/python-docs-es
Catalog: bugs.po
Languages: es

source: Dealing with Bugs
es: Lidiar con errores

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
es: Python es un lenguaje de programación maduro que ha establecido una reputación de estabilidad. Con el fin de mantener esta reputación, a los desarrolladores les gustaría conocer cualquier anomalía que encuentre en Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
es: A veces puede ser más rápido corregir errores y añadir parches a Python, ya que agiliza el proceso e involucra a menos personas. Aprenda a :ref:`contribuir <contributing-to-python>`.

source: Documentation bugs
es: Documentación de errores

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
es: Si encuentras un error en esta documentación o te gustaría proponer una mejora, por favor envía un informe de fallos en el :ref:`rastreador <using-the-tracker>`. Si tienes una sugerencia sobre cómo arreglarlo, inclúyela también.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
es: También puede abrir una discusión en nuestro `foro de Documentación de Discourse <https://discuss.python.org/c/documentation/26>`_.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
es: Si tienes poco tiempo, también puedes enviar un correo electrónico con el informe de errores de documentación a la dirección docs@python.org (los errores de comportamiento puedes enviarlos a la dirección python-list@python.org). 'docs@' es una lista de correo iniciada por voluntarios; tu petición será notificada, aunque puede que lleve algo de tiempo el ser procesada.

source: `Documentation bugs`_
es: `Documentación de errores`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
es: Una lista de errores (*bugs*) que ha sido enviada al issue tracker (sistema de seguimiento de incidentes) de Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
es: `Seguimiento de incidencias <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
es: Resumen general del proceso necesario para reportar una mejora en el tracker.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
es: `Ayudar con la documentación <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
es: Guía detallada para gente interesada en contribuir a la documentación de Python.

source: `Documentation Translations <https://devguide.python.org/documenting/#translating>`_
es: `Traducciones de la Documentación <https://devguide.python.org/documenting/#translating>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
es: Una lista de páginas de GitHub para la traducción de documentación y sus contactos principales.

source: Using the Python issue tracker
es: Utilizar el issue tracker de Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
es: Los informes de incidencias de Python deben enviarse a través del gestor de incidencias de GitHub (https://github.com/python/cpython/issues). El gestor de incidencias de GitHub ofrece un formulario web que permite introducir la información pertinente y enviarla a los desarrolladores.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
es: El primer paso para completar un informe es determinar si el problema ya ha sido descrito previamente. La ventaja de hacer esto, aparte de ahorrar tiempo a los desarrolladores, es que te permite aprender qué cambios se han realizado para repararlo; puede que el problema se haya reparado para la siguiente versión, o que sea necesaria información adicional (en ese caso, ¡te invitamos a incluirla si puedes!). Para hacerlo, busca en la base de datos de errores usando la zona de búsqueda al principio de esta página.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
es: Si el problema del que informa no está ya en la lista, inicie sesión en GitHub. Si aún no tienes una cuenta en GitHub, crea una nueva a través del enlace "Regístrate". No es posible enviar un informe de error de forma anónima.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
es: Ahora que has iniciado sesión, puedes enviar un informe de error. Haz clic en el botón "New issue" de la barra superior para notificar un nuevo informe de error.

source: The submission form has two fields, "Title" and "Comment".
es: El formulario de envío tiene dos campos: "Title" y "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
es: En el campo "Title", introduzca una descripción *muy* breve del problema; menos de diez palabras es suficiente.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
es: En el campo "Comment", describe el problema con detalle, incluyendo qué esperabas que ocurriera y que ha sucedido en realidad. Asegúrate de incluir si cualquier módulo de extensión está involucrado, y qué plataformas de hardware y software estás usando (incluyendo las versiones correspondientes).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
es: Cada informe de error será asignado a un desarrollador que determinará qué es necesario hacer para corregir el problema. Recibirás una actualización cada vez que se tome una medida al respecto.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
es: `Cómo informar de errores de manera efectiva <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
es: Artículo que detalla cómo crear un informe de errores útil. Describe qué tipo de información es útil y por qué lo es.

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
es: Información sobre cómo escribir un buen informe de errores. Parte de esta información es específica al proyecto Mozilla, pero en general describe buenas prácticas.

source: Getting started contributing to Python yourself
es: Para empezar a contribuir en Python

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
es: Más allá de informar de los errores que puedas encontrar, te damos la bienvenida a enviar parches para corregirlos. Puedes encontrar más información en cómo empezar parcheando Python en la `Python Developer's Guide`_. Si tienes preguntas, el `core-mentorship mailing list`_ es un agradable lugar para obtener respuestas a cualquiera y a todas las preguntas pertenecientes al proceso de corrección de problemas en Python.
