Repository: python/python-docs-es
Catalog: sphinx.po
Languages: es_es

source: This Page
es_es: Esta página

source: Report a Bug
es_es: Reporta un Bug

source: Show Source
es_es: Ver Fuente

source: CPython implementation detail:
es_es: Detalles de implementación de CPython:

source: Deprecated since version {deprecated}, will be removed in version {removed}
es_es: Obsoleto desde la versión {deprecated}, se eliminará en la versión {removed}

source: Welcome! This is the documentation for Python %(release)s.
es_es: ¡Te damos la bienvenida! Esta es la documentación de Python %(release)s.

source: Parts of the documentation:
es_es: Áreas de la documentación:

source: What's new in Python %(version)s?
es_es: ¿Qué hay de nuevo en Python %(version)s?

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
es_es: o <a href="%(whatsnew_index)s">todos los "Qué hay de nuevo"</a> desde 2.0

source: start here
es_es: empieza aquí

source: Library Reference
es_es: Referencia de la Biblioteca

source: keep this under your pillow
es_es: Mantén esto bajo tu almohada

source: Language Reference
es_es: Referencia del lenguaje

source: describes syntax and language elements
es_es: descripción de sintaxis y los elementos del lenguaje

source: Python Setup and Usage
es_es: Configuración y uso de Python

source: how to use Python on different platforms
es_es: como usar Python en diferentes plataformas

source: Python HOWTOs
es_es: Cómos (<em>HOWTOs</em>) de Python

source: in-depth documents on specific topics
es_es: documentos detallados sobre temas específicos

source: Installing Python Modules
es_es: Instalación de módulos de Python

source: installing from the Python Package Index &amp; other sources
es_es: instalación desde el Índice de paquete de Python (<em>Python Package Index</em>) y otras fuentes

source: Distributing Python Modules
es_es: Distribuir módulos de Python

source: publishing modules for installation by others
es_es: publicación de módulos para que otros los instalen

source: Extending and Embedding
es_es: Extender e incrustar

source: tutorial for C/C++ programmers
es_es: tutorial para programadores y programadoras de C/C++

source: reference for C/C++ programmers
es_es: referencia para programadores y programadoras de C/C++

source: FAQs
es_es: Preguntas frecuentes

source: frequently asked questions (with answers!)
es_es: preguntas frecuentes (¡con respuestas!)

source: Indices and tables:
es_es: Índices y tablas:

source: Global Module Index
es_es: Índice de Módulos Global

source: quick access to all modules
es_es: acceso rápido a todos los módulos

source: General Index
es_es: Índice general

source: all functions, classes, terms
es_es: todas las funciones, clases, términos

source: Glossary
es_es: Glosario

source: the most important terms explained
es_es: los términos más importantes explicados

source: Search page
es_es: Página de búsqueda

source: search this documentation
es_es: buscar en esta documentación

source: Complete Table of Contents
es_es: Tabla de contenidos completa

source: lists all sections and subsections
es_es: listado de todas las secciones y subsecciones

source: Meta information:
es_es: Meta información:

source: Reporting bugs
es_es: Reportar errores (<em>bugs</em>)

source: About the documentation
es_es: Acerca de la documentación

source: History and License of Python
es_es: Historia y licencia de Python

source: Download
es_es: Descarga

source: Download these documents
es_es: Descarga esta documentación

source: Docs by version
es_es: Documentos por versión

source: Python 3.8 (in development)
es_es: Python 3.8 (en desarrollo)

source: Python 3.7 (stable)
es_es: Python 3.7 (estable)

source: Python 3.6 (security-fixes)
es_es: Python 3.6 (correcciones de seguridad)

source: Python 3.5 (security-fixes)
es_es: Python 3.5 (correcciones de seguridad)

source: Python 2.7 (stable)
es_es: Python 2.7 (estable)

source: All versions
es_es: Todas las versiones

source: Other resources
es_es: Otros recursos

source: PEP Index
es_es: Índice PEP

source: Beginner's Guide
es_es: Guía para principiantes

source: Book List
es_es: Listado de libros

source: Audio/Visual Talks
es_es: Charlas Audios/Videos

source: Documentation
es_es: Documentación

source: Quick search
es_es: Búsqueda rápida

source: Go
es_es: Ir

source: The Python Software Foundation is a non-profit corporation.
es_es: La Python Software Fundation es una organización sin fines de lucro.

source: Please donate.
es_es: Por favor, haga una donación.

source: Last updated on %(last_updated)s.
es_es: Última actualización el %(last_updated).

source: <a href="%(pathto_bugs)s">Found a bug</a>?
es_es: ¿<a href="%(pathto_bugs)s">Encontró un error</a>?

source: Created using <a href="http://sphinx.pocoo.org/">Sphinx</a> %(sphinx_version)s.
es_es: Creado usando <a href="http://sphinx.pocoo.org/">Sphinx</a> %(sphinx_version)s.
