Repository: python/python-docs-es
Catalog: extending/building.po
Languages: es

source: Building C and C++ Extensions
es: Construyendo Extensiones C y C++

source: A C extension for CPython is a shared library (e.g. a ``.so`` file on Linux, ``.pyd`` on Windows), which exports an *initialization function*.
es: Una extensión C para CPython es una biblioteca compartida (por ejemplo, un archivo ``.so`` en Linux, ``.pyd`` en Windows), que exporta una *función de inicialización*.

source: To be importable, the shared library must be available on :envvar:`PYTHONPATH`, and must be named after the module name, with an appropriate extension. When using distutils, the correct filename is generated automatically.
es: Para que sea importable, la biblioteca compartida debe estar disponible en :envvar:`PYTHONPATH`, y debe tener el nombre del módulo, con una extensión adecuada. Cuando se usan distutils, el nombre de archivo correcto se genera automáticamente.

source: The initialization function has the signature:
es: La función de inicialización tiene la firma:

source: It returns either a fully-initialized module, or a :c:type:`PyModuleDef` instance. See :ref:`initializing-modules` for details.
es: Retorna un módulo completamente inicializado o una instancia :c:type:`PyModuleDef`. Ver :ref:`initializing-modules` para más detalles.

source: For modules with ASCII-only names, the function must be named ``PyInit_<modulename>``, with ``<modulename>`` replaced by the name of the module. When using :ref:`multi-phase-initialization`, non-ASCII module names are allowed. In this case, the initialization function name is ``PyInitU_<modulename>``, with ``<modulename>`` encoded using Python's *punycode* encoding with hyphens replaced by underscores. In Python::
es: Para los módulos con nombres solo ASCII, la función debe llamarse ``PyInit_<modulename>``, con ``<modulename>`` reemplazado por el nombre del módulo. Cuando se usa :ref:`multi-phase-initialization`, se permiten nombres de módulos que no sean ASCII. En este caso, el nombre de la función de inicialización es ``PyInitU_<modulename>``, con ``<modulename>`` codificado usando la codificación *punycode* de Python con guiones reemplazados por guiones bajos. En Python::

source: It is possible to export multiple modules from a single shared library by defining multiple initialization functions. However, importing them requires using symbolic links or a custom importer, because by default only the function corresponding to the filename is found. See the *"Multiple modules in one library"* section in :pep:`489` for details.
es: Es posible exportar múltiples módulos desde una única biblioteca compartida definiendo múltiples funciones de inicialización. Sin embargo, importarlos requiere el uso de enlaces simbólicos o un importador personalizado, porque de forma predeterminada solo se encuentra la función correspondiente al nombre del archivo. Consulte la sección *"Múltiples módulos en una biblioteca"* en :pep:`489` para más detalles.

source: Building C and C++ Extensions with distutils
es: Construyendo Extensiones C y C++ con distutils

source: Extension modules can be built using distutils, which is included in Python. Since distutils also supports creation of binary packages, users don't necessarily need a compiler and distutils to install the extension.
es: Los módulos de extensión se pueden construir utilizando distutils, que se incluye en Python. Dado que distutils también admite la creación de paquetes binarios, los usuarios no necesitan necesariamente un compilador y distutils para instalar la extensión.

source: A distutils package contains a driver script, :file:`setup.py`. This is a plain Python file, which, in the most simple case, could look like this:
es: Un paquete distutils contiene un script de controlador, :file:`setup.py`. Este es un archivo Python simple, que, en el caso más simple, podría verse así:

source: With this :file:`setup.py`, and a file :file:`demo.c`, running ::
es: Con esto :file:`setup.py`, y un archivo :file:`demo.c`, ejecutando::

source: will compile :file:`demo.c`, and produce an extension module named ``demo`` in the :file:`build` directory. Depending on the system, the module file will end up in a subdirectory :file:`build/lib.system`, and may have a name like :file:`demo.so` or :file:`demo.pyd`.
es: compilará :file:`demo.c`, y producirá un módulo de extensión llamado ``demo`` en el directorio :file:`build`. Dependiendo del sistema, el archivo del módulo terminará en un subdirectorio :file:`build/lib.system`, y puede tener un nombre como :file:`demo.so` o :file:`demo.pyd`.

source: In the :file:`setup.py`, all execution is performed by calling the ``setup`` function. This takes a variable number of keyword arguments, of which the example above uses only a subset. Specifically, the example specifies meta-information to build packages, and it specifies the contents of the package. Normally, a package will contain additional modules, like Python source modules, documentation, subpackages, etc. Please refer to the distutils documentation in :ref:`distutils-index` to learn more about the features of distutils; this section explains building extension modules only.
es: En :file:`setup.py`, toda la ejecución se realiza llamando a la función ``setup``. Esto toma un número variable de argumentos de palabras clave, de los cuales el ejemplo anterior usa solo un subconjunto. Específicamente, el ejemplo especifica metainformación para construir paquetes, y especifica el contenido del paquete. Normalmente, un paquete contendrá módulos adicionales, como módulos fuente Python, documentación, subpaquetes, etc. Consulte la documentación de distutils en :ref:`distutils-index` para obtener más información sobre las características de distutils; Esta sección explica la construcción de módulos de extensión solamente.

source: It is common to pre-compute arguments to :func:`setup`, to better structure the driver script. In the example above, the ``ext_modules`` argument to :func:`~distutils.core.setup` is a list of extension modules, each of which is an instance of the :class:`~distutils.extension.Extension`. In the example, the instance defines an extension named ``demo`` which is build by compiling a single source file, :file:`demo.c`.
es: Es común precalcular argumentos para :func:`setup`, para estructurar mejor el script del controlador. En el ejemplo anterior, el argumento ``ext_modules`` para :func:`~distutils.core.setup` es una lista de módulos de extensión, cada uno de los cuales es una instancia de :class:`~distutils.extension.Extension` . En el ejemplo, la instancia define una extensión llamada ``demo`` que se construye compilando un solo archivo fuente :file:`demo.c`.

source: In many cases, building an extension is more complex, since additional preprocessor defines and libraries may be needed. This is demonstrated in the example below.
es: En muchos casos, construir una extensión es más complejo, ya que es posible que se necesiten preprocesadores adicionales y bibliotecas. Esto se demuestra en el siguiente ejemplo.

source: In this example, :func:`~distutils.core.setup` is called with additional meta-information, which is recommended when distribution packages have to be built. For the extension itself, it specifies preprocessor defines, include directories, library directories, and libraries. Depending on the compiler, distutils passes this information in different ways to the compiler. For example, on Unix, this may result in the compilation commands ::
es: En este ejemplo, se llama a :func:`~distutils.core.setup` con metainformación adicional, que se recomienda cuando se deben construir paquetes de distribución. Para la extensión en sí, especifica las definiciones de preprocesador, incluye directorios, directorios de biblioteca y bibliotecas. Dependiendo del compilador, distutils pasa esta información de diferentes maneras al compilador. Por ejemplo, en Unix, esto puede resultar en los comandos de compilación::

source: These lines are for demonstration purposes only; distutils users should trust that distutils gets the invocations right.
es: Estas líneas son solo para fines de demostración; Los usuarios de distutils deben confiar en que distutils obtiene las invocaciones correctas.

source: Distributing your extension modules
es: Distribuyendo sus módulos de extensión

source: When an extension has been successfully built, there are three ways to use it.
es: Cuando una extensión se ha creado correctamente, hay tres formas de usarla.

source: End-users will typically want to install the module, they do so by running ::
es: Los usuarios finales generalmente querrán instalar el módulo, lo hacen ejecutando::

source: Module maintainers should produce source packages; to do so, they run ::
es: Los mantenedores de módulos deben producir paquetes fuente; para hacerlo, ejecutan::

source: In some cases, additional files need to be included in a source distribution; this is done through a :file:`MANIFEST.in` file; see :ref:`manifest` for details.
es: En algunos casos, se deben incluir archivos adicionales en una distribución de origen; esto se hace a través de un archivo :file:`MANIFEST.in`; ver :ref:`manifest` para más detalles.

source: If the source distribution has been built successfully, maintainers can also create binary distributions. Depending on the platform, one of the following commands can be used to do so. ::
es: Si la distribución de origen se ha creado correctamente, los encargados del mantenimiento también pueden crear distribuciones binarias. Dependiendo de la plataforma, se puede usar uno de los siguientes comandos para hacerlo.::
