Repository: python/python-docs-es
Catalog: extending/extending.po
Languages: es

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
es: Hay algunas situaciones en las que el uso aparentemente inofensivo de una referencia prestada puede generar problemas. Todo esto tiene que ver con invocaciones implícitas del intérprete, lo que puede hacer que el propietario de una referencia se deshaga de él.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
es: El primer y más importante caso que debe conocer es el uso de :c:func:`Py_DECREF` en un objeto no relacionado mientras toma prestada una referencia a un elemento de la lista. Por ejemplo::

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
es: Esta función primero toma prestada una referencia a ``list[0]``, luego reemplaza ``list[1]`` con el valor ``0``, y finalmente imprime la referencia prestada. Parece inofensivo, ¿verdad? ¡Pero no lo es!

source: Let's follow the control flow into :c:func:`PyList_SetItem`. The list owns references to all its items, so when item 1 is replaced, it has to dispose of the original item 1. Now let's suppose the original item 1 was an instance of a user-defined class, and let's further suppose that the class defined a :meth:`__del__` method. If this class instance has a reference count of 1, disposing of it will call its :meth:`__del__` method.
es: Sigamos el flujo de control en :c:func:`PyList_SetItem`. La lista posee referencias a todos sus elementos, por lo que cuando se reemplaza el elemento 1, debe deshacerse del elemento original 1. Ahora supongamos que el elemento original 1 era una instancia de una clase definida por el usuario, y supongamos además que la clase definió un método :meth:`__del__`. Si esta instancia de clase tiene un recuento de referencia de 1, al eliminarla llamará a su método :meth:`__del__`.

source: Since it is written in Python, the :meth:`__del__` method can execute arbitrary Python code. Could it perhaps do something to invalidate the reference to ``item`` in :c:func:`bug`? You bet! Assuming that the list passed into :c:func:`bug` is accessible to the :meth:`__del__` method, it could execute a statement to the effect of ``del list[0]``, and assuming this was the last reference to that object, it would free the memory associated with it, thereby invalidating ``item``.
es: Como está escrito en Python, el método :meth:`__del__` puede ejecutar código arbitrario de Python. ¿Podría hacer algo para invalidar la referencia a ``item`` en :c:func:`error`? ¡Tenlo por seguro! Suponiendo que la lista pasado a :c:func:`bug` es accesible para el método :meth:`__del__`, podría ejecutar una declaración en el sentido de ``del list[0]``, y suponiendo que este fuera el última referencia a ese objeto, liberaría la memoria asociada con él, invalidando así el ``elemento``.

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
es: La solución, una vez que conoce el origen del problema, es fácil: incremente temporalmente el recuento de referencia. La versión correcta de la función dice:

source: This is a true story. An older version of Python contained variants of this bug and someone spent a considerable amount of time in a C debugger to figure out why his :meth:`__del__` methods would fail...
es: Esta es una historia real. Una versión anterior de Python contenía variantes de este error y alguien pasó una cantidad considerable de tiempo en un depurador C para descubrir por qué sus métodos :meth:`__del__` fallaban ...

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a global lock protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :c:macro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
es: El segundo caso de problemas con una referencia prestada es una variante que involucra hilos. Normalmente, varios hilos en el intérprete de Python no pueden interponerse entre sí, porque hay un bloqueo global que protege todo el espacio de objetos de Python. Sin embargo, es posible liberar temporalmente este bloqueo usando la macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, y volver a adquirirlo usando :c:macro:`Py_END_ALLOW_THREADS`. Esto es común al bloquear las llamadas de E/S, para permitir que otros subprocesos usen el procesador mientras esperan que se complete la E/S. Obviamente, la siguiente función tiene el mismo problema que la anterior:

source: NULL Pointers
es: Punteros NULL

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
es: En general, las funciones que toman referencias de objetos como argumentos no esperan que les pase los punteros ``NULL``, y volcará el núcleo (o causará volcados de núcleo posteriores) si lo hace. Las funciones que retornan referencias a objetos generalmente retornan ``NULL`` solo para indicar que ocurrió una excepción. La razón para no probar los argumentos ``NULL`` es que las funciones a menudo pasan los objetos que reciben a otra función --- si cada función probara ``NULL``, habría muchas pruebas redundantes y el código correría más lentamente.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
es: Es mejor probar ``NULL`` solo en "source:" cuando se recibe un puntero que puede ser ``NULL``, por ejemplo, de :c:func:`malloc` o de una función que puede plantear una excepción.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
es: Las macros :c:func:`Py_INCREF` y :c:func:`Py_DECREF` no comprueban los punteros ``NULL`` --- sin embargo, sus variantes :c:func:`Py_XINCREF` y :c:func:`Py_XDECREF` lo hacen.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for ``NULL`` pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with ``NULL`` checking.
es: Las macros para verificar un tipo de objeto en particular (``Pytype_Check()``) no verifican los punteros ``NULL`` --- nuevamente, hay mucho código que llama a varios de estos en una fila para probar un objeto contra varios tipos esperados diferentes, y esto generaría pruebas redundantes. No hay variantes con comprobación ``NULL``.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
es: El mecanismo de llamada a la función C garantiza que la lista de argumentos pasada a las funciones C (``args`` en los ejemplos) nunca sea ``NULL`` --- de hecho, garantiza que siempre sea una tupla [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
es: Es un error grave dejar que un puntero ``NULL`` "escape" al usuario de Python.

source: Writing Extensions in C++
es: Escribiendo Extensiones en C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
es: Es posible escribir módulos de extensión en C++. Se aplican algunas restricciones. Si el compilador de C compila y vincula el programa principal (el intérprete de Python), no se pueden usar objetos globales o estáticos con constructores. Esto no es un problema si el programa principal está vinculado por el compilador de C++. Las funciones que serán llamadas por el intérprete de Python (en particular, las funciones de inicialización del módulo) deben declararse usando ``extern "C"``. No es necesario encerrar los archivos de encabezado de Python en ``extern "C" {...}`` --- ya usan este formulario si el símbolo ``__cplusplus`` está definido (todos los compiladores recientes de C++ definen este símbolo) .

source: Providing a C API for an Extension Module
es: Proporcionar una API C para un módulo de extensión

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
es: Muchos módulos de extensión solo proporcionan nuevas funciones y tipos para ser utilizados desde Python, pero a veces el código en un módulo de extensión puede ser útil para otros módulos de extensión. Por ejemplo, un módulo de extensión podría implementar un tipo de "colección" que funciona como listas sin orden. Al igual que el tipo de lista Python estándar tiene una API C que permite a los módulos de extensión crear y manipular listas, este nuevo tipo de colección debe tener un conjunto de funciones C para la manipulación directa desde otros módulos de extensión.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
es: A primera vista, esto parece fácil: simplemente escriba las funciones (sin declararlas ``static``, por supuesto), proporcione un archivo de encabezado apropiado y documente la API de C. Y, de hecho, esto funcionaría si todos los módulos de extensión siempre estuvieran vinculados estáticamente con el intérprete de Python. Sin embargo, cuando los módulos se usan como bibliotecas compartidas, los símbolos definidos en un módulo pueden no ser visibles para otro módulo. Los detalles de visibilidad dependen del sistema operativo; algunos sistemas usan un espacio de nombres global para el intérprete de Python y todos los módulos de extensión (Windows, por ejemplo), mientras que otros requieren una lista explícita de símbolos importados en el momento del enlace del módulo (AIX es un ejemplo) u ofrecen una variedad de estrategias diferentes (la mayoría Unices). E incluso si los símbolos son visibles a nivel mundial, ¡el módulo cuyas funciones uno desea llamar podría no haberse cargado todavía!

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
es: Por lo tanto, la portabilidad requiere no hacer suposiciones sobre la visibilidad del símbolo. Esto significa que todos los símbolos en los módulos de extensión deben declararse ``static``, excepto la función de inicialización del módulo, para evitar conflictos de nombres con otros módulos de extensión (como se discutió en la sección :ref:`methodtable`). Y significa que los símbolos que *deberían* ser accesibles desde otros módulos de extensión deben exportarse de una manera diferente.

source: Python provides a special mechanism to pass C-level information (pointers) from one extension module to another one: Capsules. A Capsule is a Python data type which stores a pointer (:c:type:`void \*`). Capsules can only be created and accessed via their C API, but they can be passed around like any other Python object. In particular, they can be assigned to a name in an extension module's namespace. Other extension modules can then import this module, retrieve the value of this name, and then retrieve the pointer from the Capsule.
es: Python proporciona un mecanismo especial para pasar información de nivel C (punteros) de un módulo de extensión a otro: Cápsulas. Una cápsula es un tipo de datos de Python que almacena un puntero (:c:type:`void \*`). Las cápsulas solo se pueden crear y acceder a través de su API de C, pero se pueden pasar como cualquier otro objeto de Python. En particular, pueden asignarse a un nombre en el espacio de nombres de un módulo de extensión. Otros módulos de extensión pueden importar este módulo, recuperar el valor de este nombre y luego recuperar el puntero de la Cápsula.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
es: Hay muchas formas en que las Cápsulas se pueden usar para exportar la API de C de un módulo de extensión. Cada función podría tener su propia cápsula, o todos los punteros de API C podrían almacenarse en una matriz cuya dirección se publica en una cápsula. Y las diversas tareas de almacenamiento y recuperación de los punteros se pueden distribuir de diferentes maneras entre el módulo que proporciona el código y los módulos del cliente.

source: Whichever method you choose, it's important to name your Capsules properly. The function :c:func:`PyCapsule_New` takes a name parameter (:c:type:`const char \*`); you're permitted to pass in a ``NULL`` name, but we strongly encourage you to specify a name. Properly named Capsules provide a degree of runtime type-safety; there is no feasible way to tell one unnamed Capsule from another.
es: Sea cual sea el método que elija, es importante nombrar sus cápsulas correctamente. La función :c:func:`PyCapsule_New` toma un parámetro de nombre (:c:type:`const char \*`); se le permite pasar un nombre ``NULL``, pero le recomendamos que especifique un nombre. Las cápsulas correctamente nombradas proporcionan un grado de seguridad de tipo de tiempo de ejecución; no hay una manera factible de distinguir una Cápsula sin nombre de otra.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
es: En particular, las cápsulas utilizadas para exponer las API de C deben recibir un nombre siguiendo esta convención:

source: The convenience function :c:func:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
es: La función de conveniencia :c:func:`PyCapsule_Import` facilita la carga de una API C proporcionada a través de una cápsula, pero solo si el nombre de la cápsula coincide con esta convención. Este comportamiento brinda a los usuarios de C API un alto grado de certeza de que la Cápsula que cargan contiene la API de C correcta.

source: The following example demonstrates an approach that puts most of the burden on the writer of the exporting module, which is appropriate for commonly used library modules. It stores all C API pointers (just one in the example!) in an array of :c:type:`void` pointers which becomes the value of a Capsule. The header file corresponding to the module provides a macro that takes care of importing the module and retrieving its C API pointers; client modules only have to call this macro before accessing the C API.
es: El siguiente ejemplo demuestra un enfoque que pone la mayor parte de la carga en el escritor del módulo de exportación, que es apropiado para los módulos de biblioteca de uso común. Almacena todos los punteros de API C (¡solo uno en el ejemplo!) En un arreglo de punteros :c:type:`void` que se convierte en el valor de una cápsula. El archivo de encabezado correspondiente al módulo proporciona una macro que se encarga de importar el módulo y recuperar sus punteros de API C; Los módulos de cliente solo tienen que llamar a esta macro antes de acceder a la API de C.

source: The exporting module is a modification of the :mod:`spam` module from section :ref:`extending-simpleexample`. The function :func:`spam.system` does not call the C library function :c:func:`system` directly, but a function :c:func:`PySpam_System`, which would of course do something more complicated in reality (such as adding "spam" to every command). This function :c:func:`PySpam_System` is also exported to other extension modules.
es: El módulo de exportación es una modificación del módulo :mod:`spam` de la sección :ref:`extending-simpleexample`. La función :func:`spam.system` no llama a la función de la biblioteca C :c:func:`system` directamente, sino una función :c:func:`PySpam_System`, que por supuesto haría algo más complicado en realidad (como agregar "spam" a cada comando). Esta función :c:func:`PySpam_System` también se exporta a otros módulos de extensión.

source: The function :c:func:`PySpam_System` is a plain C function, declared ``static`` like everything else::
es: La función :c:func:`PySpam_System` es una función C simple, declarada ``static`` como todo lo demás::

source: The function :c:func:`spam_system` is modified in a trivial way::
es: La función :c:func:`spam_system` se modifica de manera trivial::

source: In the beginning of the module, right after the line ::
es: Al comienzo del módulo, justo después de la línea::

source: two more lines must be added::
es: se deben agregar dos líneas más::

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's initialization function must take care of initializing the C API pointer array::
es: El ``#define`` se usa para decirle al archivo de encabezado que se está incluyendo en el módulo de exportación, no en un módulo de cliente. Finalmente, la función de inicialización del módulo debe encargarse de inicializar la matriz de punteros de API C::

source: Note that ``PySpam_API`` is declared ``static``; otherwise the pointer array would disappear when :func:`PyInit_spam` terminates!
es: Tenga en cuenta que ``PySpam_API`` se declara ``static``; de lo contrario, la matriz de punteros desaparecería cuando :func:`PyInit_spam` finalice!

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
es: La mayor parte del trabajo está en el archivo de encabezado :file:`spammodule.h`, que se ve así:

source: All that a client module must do in order to have access to the function :c:func:`PySpam_System` is to call the function (or rather macro) :c:func:`import_spam` in its initialization function::
es: Todo lo que un módulo cliente debe hacer para tener acceso a la función :c:func:`PySpam_System` es llamar a la función (o más bien macro) :c:func:`import_spam` en su función de inicialización::

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
es: La principal desventaja de este enfoque es que el archivo :file:`spammodule.h` es bastante complicado. Sin embargo, la estructura básica es la misma para cada función que se exporta, por lo que solo se debe aprender una vez.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
es: Finalmente, debe mencionarse que las cápsulas ofrecen una funcionalidad adicional, que es especialmente útil para la asignación de memoria y la desasignación del puntero almacenado en una cápsula. Los detalles se describen en el Manual de referencia de Python/C API en la sección :ref:`capsules` y en la implementación de Capsules (archivos :file:`Include/pycapsule.h` y :file:`Objects/pycapsule.c` en la distribución del código fuente de Python).

source: Footnotes
es: Notas al pie de página

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
es: Ya existe una interfaz para esta función en el módulo estándar :mod:`os` --- se eligió como un ejemplo simple y directo.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
es: La metáfora de "pedir prestado" una referencia no es completamente correcta: el propietario todavía tiene una copia de la referencia.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
es: ¡Comprobar que el recuento de referencia es al menos 1 **no funciona** --- el recuento de referencia en sí podría estar en la memoria liberada y, por lo tanto, puede reutilizarse para otro objeto!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
es: Estas garantías no se cumplen cuando utiliza la convención de llamadas de estilo "antiguo", que todavía se encuentra en muchos códigos existentes.
