Repository: python/python-docs-es
Catalog: extending/extending.po
Languages: es

source: Keyword Parameters for Extension Functions
es: Parámetros de palabras clave para funciones de extensión

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
es: La función :c:func:`PyArg_ParseTupleAndKeywords` se declara de la siguiente manera::

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
es: Los parámetros *arg* y *format* son idénticos a los de la función :c:func:`PyArg_ParseTuple`. El parámetro *kwdict* es el diccionario de palabras clave recibidas como tercer parámetro del tiempo de ejecución de Python. El parámetro *kwlist* es una lista de cadenas terminadas en ``NULL`` que identifican los parámetros; los nombres se corresponden con la información de tipo de *format* de izquierda a derecha. En caso de éxito, :c:func:`PyArg_ParseTupleAndKeywords` retorna verdadero; de lo contrario, retorna falso y genera una excepción apropiada.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
es: ¡Las tuplas anidadas no se pueden analizar al usar argumentos de palabras clave! Los parámetros de palabras clave pasados que no están presentes en la *kwlist* provocarán que se genere :exc:`TypeError`.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
es: Aquí hay un módulo de ejemplo que usa palabras clave, basado en un ejemplo de *Geoff Philbrick (philbrick@hks.com)*::

source: Building Arbitrary Values
es: Construyendo Valores Arbitrarios

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
es: Esta función es la contraparte de :c:func:`PyArg_ParseTuple`. Se declara de la siguiente manera::

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
es: Reconoce un conjunto de unidades de formato similares a las reconocidas por :c:func:`PyArg_ParseTuple`, pero los argumentos (que son de entrada a la función, no de salida) no deben ser punteros, solo valores. Retorna un nuevo objeto Python, adecuado para regresar de una función C llamada desde Python.

source: One difference with :c:func:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
es: Una diferencia con :c:func:`PyArg_ParseTuple`: mientras que este último requiere que su primer argumento sea una tupla (ya que las listas de argumentos de Python siempre se representan como tuplas internamente), :c:func:`Py_BuildValue` no siempre construye una tupla . Construye una tupla solo si su cadena de formato contiene dos o más unidades de formato. Si la cadena de formato está vacía, retorna ``None``; si contiene exactamente una unidad de formato, retorna el objeto que describa esa unidad de formato. Para forzarlo a retornar una tupla de tamaño 0 o uno, agregar paréntesis a la cadena de formato.

source: Examples (to the left the call, to the right the resulting Python value):
es: Ejemplos (a la izquierda la llamada, a la derecha el valor de Python resultante):

source: Reference Counts
es: Conteo de Referencias

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
es: En lenguajes como C o C++, el programador es responsable de la asignación dinámica y la desasignación de memoria en el montón. En C, esto se hace usando las funciones :c:func:`malloc` y :c:func:`free`. En C++, los operadores ``new`` y ``delete`` se usan esencialmente con el mismo significado y restringiremos la siguiente discusión al caso C.

source: Every block of memory allocated with :c:func:`malloc` should eventually be returned to the pool of available memory by exactly one call to :c:func:`free`. It is important to call :c:func:`free` at the right time. If a block's address is forgotten but :c:func:`free` is not called for it, the memory it occupies cannot be reused until the program terminates. This is called a :dfn:`memory leak`. On the other hand, if a program calls :c:func:`free` for a block and then continues to use the block, it creates a conflict with re-use of the block through another :c:func:`malloc` call. This is called :dfn:`using freed memory`. It has the same bad consequences as referencing uninitialized data --- core dumps, wrong results, mysterious crashes.
es: Cada bloque de memoria asignado con :c:func:`malloc` eventualmente debería ser retorna al grupo de memoria disponible exactamente por una llamada a :c:func:`free`. Es importante llamar a :c:func:`free` en el momento adecuado. Si se olvida la dirección de un bloque pero :c:func:`free` no se solicita, la memoria que ocupa no se puede reutilizar hasta que finalice el programa. Esto se llama :dfn:`fuga de memoria`. Por otro lado, si un programa llama :c:func:`free` para un bloque y luego continúa usando el bloque, crea un conflicto con la reutilización del bloque a través de otra llamada a :c:func:`malloc`. Esto se llama :dfn:`usando memoria liberada`. Tiene las mismas malas consecuencias que hacer referencia a datos no inicializados: volcados de núcleos, resultados incorrectos, bloqueos misteriosos.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
es: Las causas comunes de pérdidas de memoria son rutas inusuales a través del código. Por ejemplo, una función puede asignar un bloque de memoria, hacer algunos cálculos y luego liberar el bloque nuevamente. Ahora, un cambio en los requisitos de la función puede agregar una prueba al cálculo que detecta una condición de error y puede regresar prematuramente de la función. Es fácil olvidar liberar el bloque de memoria asignado al tomar esta salida prematura, especialmente cuando se agrega más tarde al código. Tales filtraciones, una vez introducidas, a menudo pasan desapercibidas durante mucho tiempo: la salida del error se toma solo en una pequeña fracción de todas las llamadas, y la mayoría de las máquinas modernas tienen mucha memoria virtual, por lo que la filtración solo se hace evidente en un proceso de larga ejecución que usa la función de fugas con frecuencia. Por lo tanto, es importante evitar que se produzcan fugas mediante una convención o estrategia de codificación que minimice este tipo de errores.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
es: Dado que Python hace un uso intensivo de :c:func:`malloc` y :c:func:`free`, necesita una estrategia para evitar pérdidas de memoria, así como el uso de memoria liberada. El método elegido se llama :dfn:`recuento de referencias`. El principio es simple: cada objeto contiene un contador, que se incrementa cuando se almacena una referencia al objeto en algún lugar, y que se reduce cuando se elimina una referencia al mismo. Cuando el contador llega a cero, la última referencia al objeto se ha eliminado y el objeto se libera.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
es: Una estrategia alternativa se llama :dfn:`recolección automática de basura`. (A veces, el recuento de referencias también se conoce como una estrategia de recolección de basura, de ahí mi uso de "automático" para distinguir los dos). La gran ventaja de la recolección automática de basura es que el usuario no necesita llamar a :c:func:`free` explícitamente. (Otra ventaja afirmada es una mejora en la velocidad o el uso de la memoria; sin embargo, esto no es un hecho difícil). La desventaja es que para C, no hay un recolector de basura automático verdaderamente portátil, mientras que el conteo de referencias se puede implementar de forma portátil (siempre que las funciones :c:func:`malloc` y :c:func:`free` están disponibles --- que garantiza el estándar C). Tal vez algún día un recolector de basura automático lo suficientemente portátil estará disponible para C. Hasta entonces, tendremos que vivir con recuentos de referencia.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
es: Si bien Python utiliza la implementación tradicional de conteo de referencias, también ofrece un detector de ciclos que funciona para detectar ciclos de referencia. Esto permite que las aplicaciones no se preocupen por crear referencias circulares directas o indirectas; Estas son las debilidades de la recolección de basura implementada utilizando solo el conteo de referencias. Los ciclos de referencia consisten en objetos que contienen referencias (posiblemente indirectas) a sí mismos, de modo que cada objeto en el ciclo tiene un recuento de referencias que no es cero. Las implementaciones típicas de recuento de referencias no pueden recuperar la memoria que pertenece a algún objeto en un ciclo de referencia, o referenciada a partir de los objetos en el ciclo, a pesar de que no hay más referencias al ciclo en sí.

source: The cycle detector is able to detect garbage cycles and can reclaim them. The :mod:`gc` module exposes a way to run the detector (the :func:`~gc.collect` function), as well as configuration interfaces and the ability to disable the detector at runtime. The cycle detector is considered an optional component; though it is included by default, it can be disabled at build time using the :option:`!--without-cycle-gc` option to the :program:`configure` script on Unix platforms (including Mac OS X). If the cycle detector is disabled in this way, the :mod:`gc` module will not be available.
es: El detector de ciclos puede detectar ciclos de basura y puede reclamarlos. El módulo :mod:`gc` expone una forma de ejecutar el detector (la función :func:`~gc.collect`), así como las interfaces de configuración y la capacidad de desactivar el detector en tiempo de ejecución. El detector de ciclo se considera un componente opcional; aunque se incluye de manera predeterminada, se puede deshabilitar en el momento de la compilación utilizando la opción :option:`!--without-cycle-gc` al script :program:`configure` en plataformas Unix (incluido Mac OS X). Si el detector de ciclos está deshabilitado de esta manera, el módulo :mod:`gc` no estará disponible.

source: Reference Counting in Python
es: Conteo de Referencias en Python

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
es: Hay dos macros, ``Py_INCREF(x)`` y ``Py_DECREF(x)``, que manejan el incremento y la disminución del recuento de referencias. :c:func:`Py_DECREF` también libera el objeto cuando el recuento llega a cero. Por flexibilidad, no llama a :c:func:`free` directamente --- más bien, realiza una llamada a través de un puntero de función en el objeto :dfn:`type object`. Para este propósito (y otros), cada objeto también contiene un puntero a su objeto de tipo.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
es: La gran pregunta ahora permanece: ¿cuándo usar ``Py_INCREF(x)`` y ``Py_DECREF(x)``? Primero introduzcamos algunos términos. Nadie "posee" un objeto; sin embargo, puede :dfn:`poseer una referencia` a un objeto. El recuento de referencias de un objeto ahora se define como el número de referencias que posee. El propietario de una referencia es responsable de llamar a :c:func:`Py_DECREF` cuando la referencia ya no es necesaria. La propiedad de una referencia puede ser transferida. Hay tres formas de deshacerse de una referencia de propiedad: pasarla, almacenarla o llamar a :c:func:`Py_DECREF`. Olvidar deshacerse de una referencia de propiedad crea una pérdida de memoria.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :c:func:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely [#]_.
es: También es posible :dfn:`tomar prestada` [#]_ una referencia a un objeto. El prestatario de una referencia no debe llamar a :c:func:`Py_DECREF`. El prestatario no debe retener el objeto por más tiempo que el propietario del cual fue prestado. El uso de una referencia prestada después de que el propietario la haya eliminado corre el riesgo de usar memoria liberada y debe evitarse por completo [#]_.

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
es: La ventaja de pedir prestado sobre tener una referencia es que no necesita ocuparse de disponer de la referencia en todas las rutas posibles a través del código --- en otras palabras, con una referencia prestada no corre el riesgo de fugas cuando se toma una salida prematura. La desventaja de pedir prestado sobre la posesión es que hay algunas situaciones sutiles en las que, en un código aparentemente correcto, una referencia prestada se puede usar después de que el propietario del que se tomó prestado la haya eliminado.

source: A borrowed reference can be changed into an owned reference by calling :c:func:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
es: Una referencia prestada se puede cambiar en una referencia de propiedad llamando a :c:func:`Py_INCREF`. Esto no afecta el estado del propietario del cual se tomó prestada la referencia: crea una nueva referencia de propiedad y otorga responsabilidades completas al propietario (el nuevo propietario debe disponer de la referencia correctamente, así como el propietario anterior).

source: Ownership Rules
es: Reglas de Propiedad

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
es: Cuando una referencia de objeto se pasa dentro o fuera de una función, es parte de la especificación de la interfaz de la función si la propiedad se transfiere con la referencia o no.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :c:func:`PyLong_FromLong` and :c:func:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :c:func:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
es: La mayoría de las funciones que retornan una referencia a un objeto pasan de propiedad con la referencia. En particular, todas las funciones cuya función es crear un nuevo objeto, como :c:func:`PyLong_FromLong` y :c:func:`Py_BuildValue`, pasan la propiedad al receptor. Incluso si el objeto no es realmente nuevo, aún recibirá la propiedad de una nueva referencia a ese objeto. Por ejemplo, :c:func:`PyLong_FromLong` mantiene un caché de valores populares y puede retornar una referencia a un elemento en caché.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :c:func:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, and :c:func:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
es: Muchas funciones que extraen objetos de otros objetos también transfieren la propiedad con la referencia, por ejemplo :c:func:`PyObject_GetAttrString`. Sin embargo, la imagen es menos clara aquí, ya que algunas rutinas comunes son excepciones: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, y :c:func:`PyDict_GetItemString` todas las referencias retornadas que tomaste prestadas de la tupla, lista o diccionario.

source: The function :c:func:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
es: La función :c:func:`PyImport_AddModule` también retorna una referencia prestada, aunque en realidad puede crear el objeto que retorna: esto es posible porque una referencia de propiedad del objeto se almacena en ``sys.modules``.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :c:func:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :c:func:`PyTuple_SetItem` and :c:func:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :c:func:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
es: Cuando pasa una referencia de objeto a otra función, en general, la función toma prestada la referencia de usted --- si necesita almacenarla, usará :c:func:`Py_INCREF` para convertirse en un propietario independiente. Hay exactamente dos excepciones importantes a esta regla: :c:func:`PyTuple_SetItem` y :c:func:`PyList_SetItem`. Estas funciones se hacen cargo de la propiedad del artículo que se les pasa, ¡incluso si fallan! (Tenga en cuenta que :c:func:`PyDict_SetItem` y sus amigos no se hacen cargo de la propiedad --- son "normales")

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :c:func:`Py_INCREF`.
es: Cuando se llama a una función C desde Python, toma de la persona que llama referencias a sus argumentos. Quien llama posee una referencia al objeto, por lo que la vida útil de la referencia prestada está garantizada hasta que la función regrese. Solo cuando dicha referencia prestada debe almacenarse o transmitirse, debe convertirse en una referencia propia llamando a :c:func:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
es: La referencia de objeto retornada desde una función C que se llama desde Python debe ser una referencia de propiedad: la propiedad se transfiere de la función a su llamador.

source: Thin Ice
es: Hielo delgado
