Repository: python/python-docs-es
Catalog: extending/extending.po
Languages: es

source: Extending Python with C or C++
es: Extendiendo Python con C o C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
es: Es muy fácil agregar nuevos módulos incorporados a Python, si sabe cómo programar en C. Tales como :dfn:`módulos de extensión` pueden hacer dos cosas que no se pueden hacer directamente en Python: pueden implementar nuevos tipos objetos incorporados, y pueden llamar a funciones de biblioteca C y llamadas de sistema.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
es: Para admitir extensiones, la API de Python (interfaz de programadores de aplicaciones) define un conjunto de funciones, macros y variables que proporcionan acceso a la mayoría de los aspectos del sistema de tiempo de ejecución de Python. La API de Python se incorpora en un archivo fuente C incluyendo el encabezado ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
es: La compilación de un módulo de extensión depende de su uso previsto, así como de la configuración de su sistema; los detalles se dan en capítulos posteriores.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
es: La interfaz de extensión C es específica de CPython, y los módulos de extensión no funcionan en otras implementaciones de Python. En muchos casos, es posible evitar escribir extensiones C y preservar la portabilidad a otras implementaciones. Por ejemplo, si su caso de uso es llamar a funciones de biblioteca C o llamadas de sistema, debería considerar usar el módulo :mod:`ctypes` o la biblioteca `cffi <https://cffi.readthedocs.io/>`_ en lugar de escribir código personalizado C. Estos módulos le permiten escribir código Python para interactuar con el código C y son más portátiles entre las implementaciones de Python que escribir y compilar un módulo de extensión C.

source: A Simple Example
es: Un ejemplo simple

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
es: Creemos un módulo de extensión llamado ``spam`` (la comida favorita de los fanáticos de Monty Python ...) y digamos que queremos crear una interfaz de Python para la función de biblioteca C :c:func:`system` [#]_ . Esta función toma una cadena de caracteres con terminación nula como argumento y retorna un entero. Queremos que esta función se pueda llamar desde Python de la siguiente manera:

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
es: Comience creando un archivo :file:`spammodule.c`. (Históricamente, si un módulo se llama ``spam``, el archivo C que contiene su implementación se llama :file:`spammodule.c`; si el nombre del módulo es muy largo, como ``spammify``, el nombre del módulo puede sea solo :file:`spammify.c`.)

source: The first two lines of our file can be::
es: Las dos primeras líneas de nuestro archivo pueden ser::

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
es: que extrae la API de Python (puede agregar un comentario que describa el propósito del módulo y un aviso de copyright si lo desea).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
es: Dado que Python puede definir algunas definiciones de preprocesador que afectan los encabezados estándar en algunos sistemas, *debe* incluir :file:`Python.h` antes de incluir encabezados estándar.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`parsetuple` for a description of this macro.
es: Se recomienda definir siempre ``PY_SSIZE_T_CLEAN`` antes de incluir ``Python.h``. Consulte :ref:`parsetuple` para obtener una descripción de esta macro.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :c:func:`malloc`, :c:func:`free` and :c:func:`realloc` directly.
es: Todos los símbolos visibles para el usuario definidos por :file:`Python.h` tienen un prefijo ``Py`` o ``PY``, excepto los definidos en los archivos de encabezado estándar. Por conveniencia, y dado que el intérprete de Python los usa ampliamente, ``"Python.h"`` incluye algunos archivos de encabezado estándar: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, y ``<stdlib.h>``. Si el último archivo de encabezado no existe en su sistema, declara las funciones :c:func:`malloc`, :c:func:`free` y :c:func:`realloc` directamente.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
es: Lo siguiente que agregamos a nuestro archivo de módulo es la función C que se llamará cuando se evalúe la expresión Python ``spam.system(string)`` (veremos en breve cómo termina siendo llamado)::

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
es: Hay una traducción directa de la lista de argumentos en Python (por ejemplo, la única expresión ``"ls -l"``) a los argumentos pasados a la función C. La función C siempre tiene dos argumentos, llamados convencionalmente *self* y *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
es: El argumento *self* apunta al objeto del módulo para funciones a nivel de módulo; para un método apuntaría a la instancia del objeto.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
es: El argumento *args* será un puntero a un objeto de tupla de Python que contiene los argumentos. Cada elemento de la tupla corresponde a un argumento en la lista de argumentos de la llamada. Los argumentos son objetos de Python --- para hacer algo con ellos en nuestra función C tenemos que convertirlos a valores C. La función :c:func:`PyArg_ParseTuple` en la API de Python verifica los tipos de argumento y los convierte a valores C. Utiliza una cadena de plantilla para determinar los tipos requeridos de los argumentos, así como los tipos de las variables C en las que almacenar los valores convertidos. Más sobre esto más tarde.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
es: :c:func:`PyArg_ParseTuple` retorna verdadero (distinto de cero) si todos los argumentos tienen el tipo correcto y sus componentes se han almacenado en las variables cuyas direcciones se pasan. Retorna falso (cero) si se pasó una lista de argumentos no válidos. En el último caso, también genera una excepción apropiada para que la función de llamada pueda retornar ``NULL`` inmediatamente (como vimos en el ejemplo).

source: Intermezzo: Errors and Exceptions
es: Intermezzo: errores y excepciones

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually a ``NULL`` pointer). Exceptions are stored in a static global variable inside the interpreter; if this variable is ``NULL`` no exception has occurred. A second global variable stores the "associated value" of the exception (the second argument to :keyword:`raise`). A third variable contains the stack traceback in case the error originated in Python code. These three variables are the C equivalents of the result in Python of :meth:`sys.exc_info` (see the section on module :mod:`sys` in the Python Library Reference). It is important to know about them to understand how errors are passed around.
es: Una convención importante en todo el intérprete de Python es la siguiente: cuando una función falla, debe establecer una condición de excepción y retornar un valor de error (generalmente un puntero ``NULL``). Las excepciones se almacenan en una variable global estática dentro del intérprete; Si esta variable es ``NULL``, no se ha producido ninguna excepción. Una segunda variable global almacena el "valor asociado" de la excepción (el segundo argumento para :keyword:`raise`). Una tercera variable contiene el seguimiento de la pila en caso de que el error se origine en el código Python. Estas tres variables son los equivalentes en C del resultado en Python de :meth:`sys.exc_info` (consulte la sección sobre el módulo :mod:`sys` en la Referencia de la biblioteca de Python). Es importante conocerlos para comprender cómo se transmiten los errores.

source: The Python API defines a number of functions to set various types of exceptions.
es: La API de Python define una serie de funciones para establecer varios tipos de excepciones.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
es: El más común es :c:func:`PyErr_SetString`. Sus argumentos son un objeto de excepción y una cadena C. El objeto de excepción suele ser un objeto predefinido como :c:data:`PyExc_ZeroDivisionError`. La cadena C indica la causa del error y se convierte en un objeto de cadena Python y se almacena como el "valor asociado" de la excepción.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
es: Otra función útil es :c:func:`PyErr_SetFromErrno`, que solo toma un argumento de excepción y construye el valor asociado mediante la inspección de la variable global :c:data:`errno`. La función más general es :c:func:`PyErr_SetObject`, que toma dos argumentos de objeto, la excepción y su valor asociado. No necesita :c:func:`Py_INCREF` los objetos pasados a cualquiera de estas funciones.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
es: Puede probar de forma no destructiva si se ha establecido una excepción con :c:func:`PyErr_Occurred`. Esto retorna el objeto de excepción actual o ``NULL`` si no se ha producido ninguna excepción. Normalmente no necesita llamar a :c:func:`PyErr_Occurred` para ver si se produjo un error en una llamada a la función, ya que debería poder distinguir el valor de retorno.

source: When a function *f* that calls another function *g* detects that the latter fails, *f* should itself return an error value (usually ``NULL`` or ``-1``). It should *not* call one of the :c:func:`PyErr_\*` functions --- one has already been called by *g*. *f*'s caller is then supposed to also return an error indication to *its* caller, again *without* calling :c:func:`PyErr_\*`, and so on --- the most detailed cause of the error was already reported by the function that first detected it. Once the error reaches the Python interpreter's main loop, this aborts the currently executing Python code and tries to find an exception handler specified by the Python programmer.
es: Cuando una función *f* que llama a otra función *g* detecta que la última falla, *f* debería retornar un valor de error (generalmente ``NULL`` o ``-1``). Debería *no* llamar a una de las funciones :c:func:`PyErr_\*` --- una ya ha sido llamada por *g*. Se supone que la persona que llama *f* también debe retornar una indicación de error a *su* persona que llama, de nuevo *sin* llamar :c:func:`PyErr_\*`, y así sucesivamente --- la causa más detallada del error ya fue informado por la función que lo detectó por primera vez. Una vez que el error llega al bucle principal del intérprete de Python, esto anula el código de Python que se está ejecutando actualmente e intenta encontrar un controlador de excepción especificado por el programador de Python.

source: (There are situations where a module can actually give a more detailed error message by calling another :c:func:`PyErr_\*` function, and in such cases it is fine to do so. As a general rule, however, this is not necessary, and can cause information about the cause of the error to be lost: most operations can fail for a variety of reasons.)
es: (Hay situaciones en las que un módulo puede dar un mensaje de error más detallado llamando a otra función :c:func:`PyErr_\*`, y en tales casos está bien hacerlo. Como regla general, sin embargo, esto es no es necesario y puede causar que se pierda información sobre la causa del error: la mayoría de las operaciones pueden fallar por varias razones.)

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
es: Para ignorar una excepción establecida por una llamada de función que falló, la condición de excepción debe borrarse explícitamente llamando a :c:func:`PyErr_Clear`. La única vez que el código C debe llamar :c:func:`PyErr_Clear` es si no quiere pasar el error al intérprete pero quiere manejarlo completamente por sí mismo (posiblemente probando algo más o pretendiendo que nada salió mal) )

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
es: Cada llamada fallida a :c:func:`malloc` debe convertirse en una excepción --- la persona que llama directamente de :c:func:`malloc` (o :c:func:`realloc`) debe llamar :c:func:`PyErr_NoMemory` y retorna un indicador de falla en sí mismo. Todas las funciones de creación de objetos (por ejemplo, :c:func:`PyLong_FromLong`) ya hacen esto, por lo que esta nota solo es relevante para aquellos que llaman :c:func:`malloc` directamente.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
es: También tenga en cuenta que, con la importante excepción de :c:func:`PyArg_ParseTuple` y sus amigos, las funciones que retornan un estado entero generalmente retornan un valor positivo o cero para el éxito y ``-1`` para el fracaso, como las llamadas al sistema Unix.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
es: Finalmente, tenga cuidado de limpiar la basura (haciendo :c:func:`Py_XDECREF` o :c:func:`Py_DECREF` requiere objetos que ya ha creado) cuando retorna un indicador de error!

source: The choice of which exception to raise is entirely yours. There are predeclared C objects corresponding to all built-in Python exceptions, such as :c:data:`PyExc_ZeroDivisionError`, which you can use directly. Of course, you should choose exceptions wisely --- don't use :c:data:`PyExc_TypeError` to mean that a file couldn't be opened (that should probably be :c:data:`PyExc_IOError`). If something's wrong with the argument list, the :c:func:`PyArg_ParseTuple` function usually raises :c:data:`PyExc_TypeError`. If you have an argument whose value must be in a particular range or must satisfy other conditions, :c:data:`PyExc_ValueError` is appropriate.
es: La elección de qué excepción lanzar es totalmente suya. Hay objetos C declarados previamente que corresponden a todas las excepciones de Python incorporadas, como :c:data:`PyExc_ZeroDivisionError`, que puede usar directamente. Por supuesto, debe elegir sabiamente las excepciones --- no use :c:data:`PyExc_TypeError` para significar que no se puede abrir un archivo (probablemente debería ser :c:data:`PyExc_IOError`). Si algo anda mal con la lista de argumentos, la función :c:func:`PyArg_ParseTuple` generalmente genera :c:data:`PyExc_TypeError`. Si tiene un argumento cuyo valor debe estar en un rango particular o debe satisfacer otras condiciones, :c:data:`PyExc_ValueError` es apropiado.

source: You can also define a new exception that is unique to your module. For this, you usually declare a static object variable at the beginning of your file::
es: También puede definir una nueva excepción que sea exclusiva de su módulo. Para esto, generalmente declara una variable de objeto estático al comienzo de su archivo::

source: and initialize it in your module's initialization function (:c:func:`PyInit_spam`) with an exception object::
es: y lo inicializa en la función de inicialización de su módulo (:c:func:`PyInit_spam`) con un objeto de excepción::

source: Note that the Python name for the exception object is :exc:`spam.error`. The :c:func:`PyErr_NewException` function may create a class with the base class being :exc:`Exception` (unless another class is passed in instead of ``NULL``), described in :ref:`bltin-exceptions`.
es: Tenga en cuenta que el nombre de Python para el objeto de excepción es :exc:`spam.error`. La función :c:func:`PyErr_NewException` puede crear una clase con la clase base siendo :exc:`Exception` (a menos que se pase otra clase en lugar de ``NULL``), descrita en :ref:`bltin-exceptions`.

source: Note also that the :c:data:`SpamError` variable retains a reference to the newly created exception class; this is intentional! Since the exception could be removed from the module by external code, an owned reference to the class is needed to ensure that it will not be discarded, causing :c:data:`SpamError` to become a dangling pointer. Should it become a dangling pointer, C code which raises the exception could cause a core dump or other unintended side effects.
es: Tenga en cuenta también que la variable :c:data:`SpamError` retiene una referencia a la clase de excepción recién creada; esto es intencional! Como la excepción podría eliminarse del módulo mediante un código externo, se necesita una referencia propia de la clase para garantizar que no se descarte, lo que hace que :c:data:`SpamError` se convierta en un puntero colgante. Si se convierte en un puntero colgante, el código C que genera la excepción podría causar un volcado del núcleo u otros efectos secundarios no deseados.

source: We discuss the use of ``PyMODINIT_FUNC`` as a function return type later in this sample.
es: Discutimos el uso de ``PyMODINIT_FUNC`` como un tipo de retorno de función más adelante en esta muestra.

source: The :exc:`spam.error` exception can be raised in your extension module using a call to :c:func:`PyErr_SetString` as shown below::
es: La excepción :exc:`spam.error` se puede generar en su módulo de extensión mediante una llamada a :c:func:`PyErr_SetString` como se muestra a continuación::

source: Back to the Example
es: De vuelta al ejemplo

source: Going back to our example function, you should now be able to understand this statement::
es: Volviendo a nuestra función de ejemplo, ahora debería poder comprender esta declaración::

source: It returns ``NULL`` (the error indicator for functions returning object pointers) if an error is detected in the argument list, relying on the exception set by :c:func:`PyArg_ParseTuple`. Otherwise the string value of the argument has been copied to the local variable :c:data:`command`. This is a pointer assignment and you are not supposed to modify the string to which it points (so in Standard C, the variable :c:data:`command` should properly be declared as ``const char *command``).
es: Retorna ``NULL`` (el indicador de error para las funciones que retornan punteros de objeto) si se detecta un error en la lista de argumentos, basándose en la excepción establecida por :c:func:`PyArg_ParseTuple`. De lo contrario, el valor de cadena del argumento se ha copiado en la variable local :c:data:`command`. Esta es una asignación de puntero y no se supone que modifique la cadena a la que apunta (por lo tanto, en el Estándar C, la variable :c:data:`command` debería declararse correctamente como ``const char * command``).
