Repository: python/python-docs-es
Catalog: extending/extending.po
Languages: es

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
es: La siguiente declaración es una llamada a la función Unix :c:func:`system`, pasándole la cadena que acabamos de obtener de :c:func:`PyArg_ParseTuple`::

source: Our :func:`spam.system` function must return the value of :c:data:`sts` as a Python object. This is done using the function :c:func:`PyLong_FromLong`. ::
es: Nuestra función :func:`spam.system` debe retornar el valor de :c:data:`sts` como un objeto Python. Esto se hace usando la función :c:func:`PyLong_FromLong`. ::

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
es: En este caso, retornará un objeto entero. (Sí, ¡incluso los enteros son objetos en el montículo (*heap*) en Python!)

source: If you have a C function that returns no useful argument (a function returning :c:type:`void`), the corresponding Python function must return ``None``. You need this idiom to do so (which is implemented by the :c:macro:`Py_RETURN_NONE` macro)::
es: Si tiene una función C que no retorna ningún argumento útil (una función que retorna :c:type:`void`), la función Python correspondiente debe retornar ``None``. Necesita este modismo para hacerlo (que se implementa mediante la macro :c:macro:`Py_RETURN_NONE`)::

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
es: :c:data:`Py_None` es el nombre C para el objeto especial de Python ``None``. Es un objeto genuino de Python en lugar de un puntero ``NULL``, que significa "error" en la mayoría de los contextos, como hemos visto.

source: The Module's Method Table and Initialization Function
es: La tabla de métodos del módulo y la función de inicialización

source: I promised to show how :c:func:`spam_system` is called from Python programs. First, we need to list its name and address in a "method table"::
es: Prometí mostrar cómo :c:func:`spam_system` se llama desde los programas de Python. Primero, necesitamos enumerar su nombre y dirección en una "tabla de métodos"::

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
es: Tenga en cuenta la tercera entrada (``METH_VARARGS``). Esta es una bandera que le dice al intérprete la convención de llamada que se utilizará para la función C. Normalmente debería ser siempre ``METH_VARARGS`` o ``METH_VARARGS | METH_KEYWORDS``; un valor de ``0`` significa que se usa una variante obsoleta de :c:func:`PyArg_ParseTuple`.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
es: Cuando se usa solo ``METH_VARARGS``, la función debe esperar que los parámetros a nivel de Python se pasen como una tupla aceptable para el análisis mediante :c:func:`PyArg_ParseTuple`; A continuación se proporciona más información sobre esta función.

source: The :const:`METH_KEYWORDS` bit may be set in the third field if keyword arguments should be passed to the function. In this case, the C function should accept a third ``PyObject *`` parameter which will be a dictionary of keywords. Use :c:func:`PyArg_ParseTupleAndKeywords` to parse the arguments to such a function.
es: El bit :const:`METH_KEYWORDS` se puede establecer en el tercer campo si se deben pasar argumentos de palabras clave a la función. En este caso, la función C debería aceptar un tercer parámetro ``PyObject *`` que será un diccionario de palabras clave. Use :c:func:`PyArg_ParseTupleAndKeywords` para analizar los argumentos de dicha función.

source: The method table must be referenced in the module definition structure::
es: La tabla de métodos debe ser referenciada en la estructura de definición del módulo::

source: This structure, in turn, must be passed to the interpreter in the module's initialization function. The initialization function must be named :c:func:`PyInit_name`, where *name* is the name of the module, and should be the only non-\ ``static`` item defined in the module file::
es: Esta estructura, a su vez, debe pasarse al intérprete en la función de inicialización del módulo. La función de inicialización debe llamarse :c:func:`PyInit_name`, donde *name* es el nombre del módulo y debe ser el único elemento no ``static`` definido en el archivo del módulo::

source: Note that PyMODINIT_FUNC declares the function as ``PyObject *`` return type, declares any special linkage declarations required by the platform, and for C++ declares the function as ``extern "C"``.
es: Tenga en cuenta que PyMODINIT_FUNC declara la función como ``PyObject *`` tipo de retorno, declara cualquier declaración de vinculación especial requerida por la plataforma, y para C++ declara la función como ``extern "C"``.

source: When the Python program imports module :mod:`spam` for the first time, :c:func:`PyInit_spam` is called. (See below for comments about embedding Python.) It calls :c:func:`PyModule_Create`, which returns a module object, and inserts built-in function objects into the newly created module based upon the table (an array of :c:type:`PyMethodDef` structures) found in the module definition. :c:func:`PyModule_Create` returns a pointer to the module object that it creates. It may abort with a fatal error for certain errors, or return ``NULL`` if the module could not be initialized satisfactorily. The init function must return the module object to its caller, so that it then gets inserted into ``sys.modules``.
es: Cuando el programa Python importa el módulo :mod:`spam` por primera vez, se llama :c:func:`PyInit_spam`. (Consulte a continuación los comentarios sobre la incorporación de Python). Llama a :c:func:`PyModule_Create`, que retorna un objeto de módulo e inserta objetos de función incorporados en el módulo recién creado en función de la tabla (un arreglo de estructuras :c:type:`PyMethodDef`) encontradas en la definición del módulo. :c:func:`PyModule_Create` retorna un puntero al objeto del módulo que crea. Puede abortar con un error fatal para ciertos errores, o retornar ``NULL`` si el módulo no se pudo inicializar satisfactoriamente. La función *init* debe retornar el objeto del módulo a su llamador, para que luego se inserte en ``sys.modules``.

source: When embedding Python, the :c:func:`PyInit_spam` function is not called automatically unless there's an entry in the :c:data:`PyImport_Inittab` table. To add the module to the initialization table, use :c:func:`PyImport_AppendInittab`, optionally followed by an import of the module::
es: Al incrustar Python, la función :c:func:`PyInit_spam` no se llama automáticamente a menos que haya una entrada en la tabla :c:data:`PyImport_Inittab`. Para agregar el módulo a la tabla de inicialización, use :c:func:`PyImport_AppendInittab`, seguido opcionalmente por una importación del módulo::

source: Removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :c:func:`fork` without an intervening :c:func:`exec`) can create problems for some extension modules. Extension module authors should exercise caution when initializing internal data structures.
es: Eliminar entradas de ``sys.modules`` o importar módulos compilados en múltiples intérpretes dentro de un proceso (o seguir un :c:func:`fork` sin una intervención :c:func:`exec`) puede crear problemas para algunas extensiones de módulos. Los autores de módulos de extensiones deben tener precaución al inicializar estructuras de datos internas.

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxmodule.c`. This file may be used as a template or simply read as an example.
es: Se incluye un módulo de ejemplo más sustancial en la distribución fuente de Python como :file:`Modules/xxmodule.c`. Este archivo puede usarse como plantilla o simplemente leerse como ejemplo.

source: Unlike our ``spam`` example, ``xxmodule`` uses *multi-phase initialization* (new in Python 3.5), where a PyModuleDef structure is returned from ``PyInit_spam``, and creation of the module is left to the import machinery. For details on multi-phase initialization, see :PEP:`489`.
es: A diferencia de nuestro ejemplo de ``spam``, ``xxmodule`` usa *inicialización de múltiples fases* (nuevo en Python 3.5), donde se retorna una estructura PyModuleDef de ``PyInit_spam``, y la creación del módulo se deja al maquinaria de importación. Para obtener detalles sobre la inicialización múltiples fases, consulte :PEP:`489`.

source: Compilation and Linkage
es: Compilación y Enlazamiento

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
es: Hay dos cosas más que hacer antes de que pueda usar su nueva extensión: compilarla y vincularla con el sistema Python. Si usa carga dinámica, los detalles pueden depender del estilo de carga dinámica que usa su sistema; Para obtener más información al respecto, consulte los capítulos sobre la creación de módulos de extensión (capítulo :ref:`building`) e información adicional que se refiere solo a la construcción en Windows (capítulo :ref:`building-on-windows`).

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file:
es: Si no puede utilizar la carga dinámica, o si desea que su módulo sea una parte permanente del intérprete de Python, tendrá que cambiar la configuración (*setup*) y reconstruir el intérprete. Afortunadamente, esto es muy simple en Unix: simplemente coloque su archivo (:file:`spammodule.c` por ejemplo) en el directorio :file:`Modules/ ` de una distribución fuente desempaquetada, agregue una línea al archivo :file:`Modules/Setup.local` que describe su archivo:

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
es: y reconstruya el intérprete ejecutando :program:`make` en el directorio de nivel superior. También puede ejecutar :program:`make` en el subdirectorio :file:`Modules/`, pero primero debe reconstruir :file:`Makefile` ejecutando ':program:`make` Makefile'. (Esto es necesario cada vez que cambia el archivo :file:`Configuración`).

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance:
es: Si su módulo requiere bibliotecas adicionales para vincular, también se pueden enumerar en la línea del archivo de configuración, por ejemplo:

source: Calling Python Functions from C
es: Llamando funciones Python desde C

source: So far we have concentrated on making C functions callable from Python. The reverse is also useful: calling Python functions from C. This is especially the case for libraries that support so-called "callback" functions. If a C interface makes use of callbacks, the equivalent Python often needs to provide a callback mechanism to the Python programmer; the implementation will require calling the Python callback functions from a C callback. Other uses are also imaginable.
es: Hasta ahora nos hemos concentrado en hacer que las funciones de C puedan llamarse desde Python. Lo contrario también es útil: llamar a las funciones de Python desde C. Este es especialmente el caso de las bibliotecas que admiten las llamadas funciones de "retrollamada". Si una interfaz C utiliza retrollamadas, el Python equivalente a menudo necesita proporcionar un mecanismo de retrollamada al programador de Python; la implementación requerirá llamar a las funciones de retrollamada de Python desde una retrollamada en C. Otros usos también son imaginables.

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
es: Afortunadamente, el intérprete de Python se llama fácilmente de forma recursiva, y hay una interfaz estándar para llamar a una función de Python. (No me detendré en cómo llamar al analizador Python con una cadena particular como entrada --- si está interesado, eche un vistazo a la implementación de la opción de línea de comando :option:`-c` en :file:`Modules/main.c` del código fuente de Python.)

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :c:func:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
es: Llamar a una función de Python es fácil. Primero, el programa Python debe de alguna manera pasar el objeto de función Python. Debe proporcionar una función (o alguna otra interfaz) para hacer esto. Cuando se llama a esta función, guarde un puntero en el objeto de la función Python (tenga cuidado de usar :c:func:`Py_INCREF`) En una variable global --- o donde mejor le parezca. Por ejemplo, la siguiente función podría ser parte de una definición de módulo::

source: This function must be registered with the interpreter using the :const:`METH_VARARGS` flag; this is described in section :ref:`methodtable`. The :c:func:`PyArg_ParseTuple` function and its arguments are documented in section :ref:`parsetuple`.
es: Esta función debe registrarse con el intérprete utilizando el indicador :const:`METH_VARARGS`; esto se describe en la sección :ref:`methodtable`. La función :c:func:`PyArg_ParseTuple` y sus argumentos están documentados en la sección :ref:`parsetuple`.

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
es: Las macros :c:func:`Py_XINCREF` y :c:func:`Py_XDECREF` incrementan/disminuyen el recuento de referencia de un objeto y son seguros en presencia de punteros ``NULL`` (pero tenga en cuenta que *temp* no lo hará ser ``NULL`` en este contexto). Más información sobre ellos en la sección :ref:`refcounts`.

source: Later, when it is time to call the function, you call the C function :c:func:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in ``NULL``, or an empty tuple; to call it with one argument, pass a singleton tuple. :c:func:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
es: Más tarde, cuando es hora de llamar a la función, llama a la función C :c:func:`PyObject_CallObject`. Esta función tiene dos argumentos, ambos punteros a objetos arbitrarios de Python: la función Python y la lista de argumentos. La lista de argumentos siempre debe ser un objeto de tupla, cuya longitud es el número de argumentos. Para llamar a la función Python sin argumentos, pase ``NULL`` o una tupla vacía; para llamarlo con un argumento, pasa una tupla singleton. :c:func:`Py_BuildValue` retorna una tupla cuando su cadena de formato consta de cero o más códigos de formato entre paréntesis. Por ejemplo::

source: :c:func:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :c:func:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :c:func:`Py_DECREF`\ -ed immediately after the :c:func:`PyObject_CallObject` call.
es: :c:func:`PyObject_CallObject` retorna un puntero de objeto Python: este es el valor de retorno de la función Python. :c:func:`PyObject_CallObject` es "recuento-referencia-neutral" con respecto a sus argumentos. En el ejemplo, se creó una nueva tupla para servir como lista de argumentos, a la cual se le llama :c:func:`Py_DECREF` inmediatamente después de la llamada :c:func:`PyObject_CallObject`.

source: The return value of :c:func:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :c:func:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
es: El valor de retorno de :c:func:`PyObject_CallObject` es "nuevo": o bien es un objeto nuevo o es un objeto existente cuyo recuento de referencias se ha incrementado. Por lo tanto, a menos que desee guardarlo en una variable global, debería de alguna manera :c:func:`Py_DECREF` el resultado, incluso (¡especialmente!) Si no está interesado en su valor.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
es: Sin embargo, antes de hacer esto, es importante verificar que el valor de retorno no sea ``NULL``. Si es así, la función de Python terminó generando una excepción. Si el código C que llamó :c:func:`PyObject_CallObject` se llama desde Python, ahora debería retornar una indicación de error a su llamador de Python, para que el intérprete pueda imprimir un seguimiento de la pila, o el código de Python que llama puede manejar la excepción. Si esto no es posible o deseable, la excepción se debe eliminar llamando a :c:func:`PyErr_Clear`. Por ejemplo::

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
es: Dependiendo de la interfaz deseada para la función de retrollamada de Python, es posible que también deba proporcionar una lista de argumentos para :c:func:`PyObject_CallObject`. En algunos casos, el programa Python también proporciona la lista de argumentos, a través de la misma interfaz que especificó la función de retrollamada. Luego se puede guardar y usar de la misma manera que el objeto de función. En otros casos, puede que tenga que construir una nueva tupla para pasarla como lista de argumentos. La forma más sencilla de hacer esto es llamar a :c:func:`Py_BuildValue`. Por ejemplo, si desea pasar un código de evento integral, puede usar el siguiente código::

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :c:func:`Py_BuildValue` may run out of memory, and this should be checked.
es: ¡Observe la ubicación de ``Py_DECREF(arglist)`` inmediatamente después de la llamada, antes de la verificación de errores! También tenga en cuenta que, estrictamente hablando, este código no está completo: :c:func:`Py_BuildValue` puede quedarse sin memoria, y esto debe verificarse.

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
es: También puede llamar a una función con argumentos de palabras clave utilizando :c:func:`PyObject_Call`, que admite argumentos y argumentos de palabras clave. Como en el ejemplo anterior, usamos :c:func:`Py_BuildValue` para construir el diccionario. ::

source: Extracting Parameters in Extension Functions
es: Extracción de parámetros en funciones de extensión

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
es: La función :c:func:`PyArg_ParseTuple` se declara de la siguiente manera::

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
es: El argumento *arg* debe ser un objeto de tupla que contenga una lista de argumentos pasada de Python a una función C. El argumento *format* debe ser una cadena de formato, cuya sintaxis se explica en :ref:`arg-parsing` en el Manual de referencia de la API de Python/C. Los argumentos restantes deben ser direcciones de variables cuyo tipo está determinado por la cadena de formato.

source: Note that while :c:func:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
es: Tenga en cuenta que si bien :c:func:`PyArg_ParseTuple` verifica que los argumentos de Python tengan los tipos requeridos, no puede verificar la validez de las direcciones de las variables C pasadas a la llamada: si comete errores allí, su código probablemente se bloqueará o al menos sobrescribir bits aleatorios en la memoria. ¡Así que ten cuidado!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
es: Tenga en cuenta que las referencias de objetos de Python que se proporcionan a quien llama son referencias prestadas (*borrowed*); ¡no disminuya su recuento de referencias!

source: Some example calls::
es: Algunas llamadas de ejemplo::
