Repository: python/python-docs-es
Catalog: extending/index.po
Languages: es

source: Extending and Embedding the Python Interpreter
es: Ampliación e incrustación del intérprete de Python

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
es: Este documento describe cómo escribir módulos en C o C++ para extender el intérprete de Python con nuevos módulos. Esos módulos no solo pueden definir nuevas funciones sino también nuevos tipos de objetos y sus métodos. El documento también describe cómo incrustar el intérprete de Python en otra aplicación, para usarlo como un lenguaje de extensión. Finalmente, muestra cómo compilar y vincular módulos de extensión para que puedan cargarse dinámicamente (en tiempo de ejecución) en el intérprete, si el sistema operativo subyacente admite esta característica.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
es: Este documento asume conocimientos básicos sobre Python. Para una introducción informal al lenguaje, consulte :ref:`tutorial-index`. :ref:`reference-index` da una definición más formal del lenguaje. :ref:`library-index` documenta los tipos de objetos, funciones y módulos existentes (tanto incorporados como escritos en Python) que le dan al lenguaje su amplio rango de aplicaciones.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
es: Para obtener una descripción detallada de toda la API de Python/C, consulte el apartado separado :ref:`c-api-index`.

source: Recommended third party tools
es: Herramientas de terceros recomendadas

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
es: Esta guía solo cubre las herramientas básicas para crear extensiones proporcionadas como parte de esta versión de CPython. Herramientas de terceros como `Cython <http://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <http://www.swig.org>`_ y `Numba <https://numba.pydata.org/>`_ ofrecen enfoques más simples y sofisticados para crear extensiones C y C++ para Python.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
es: `Guía del Usuario de Empaquetamiento de Python: Extensiones binarias <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
es: La Guía del Usuario de Empaquetamiento de Python no solo cubre varias herramientas disponibles que simplifican la creación de extensiones binarias, sino que también discute las diversas razones por las cuales crear un módulo de extensión puede ser deseable en primer lugar.

source: Creating extensions without third party tools
es: Crear extensiones sin herramientas de terceros

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
es: Esta sección de la guía cubre la creación de extensiones C y C++ sin la ayuda de herramientas de terceros. Está destinado principalmente a los creadores de esas herramientas, en lugar de ser una forma recomendada de crear sus propias extensiones C.

source: Embedding the CPython runtime in a larger application
es: Incrustar el tiempo de ejecución de CPython en una aplicación más grande

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
es: A veces, en lugar de crear una extensión que se ejecute dentro del intérprete de Python como la aplicación principal, es conveniente incorporar el tiempo de ejecución de CPython dentro de una aplicación más grande. Esta sección cubre algunos de los detalles involucrados en hacerlo con éxito.
