Repository: python/python-docs-es
Catalog: extending/newtypes.po
Languages: es

source: Defining Extension Types: Assorted Topics
es: Definición de tipos de extensión: temas variados

source: This section aims to give a quick fly-by on the various type methods you can implement and what they do.
es: Esta sección tiene como objetivo dar un vistazo rápido a los diversos métodos de tipo que puede implementar y lo que hacen.

source: Here is the definition of :c:type:`PyTypeObject`, with some fields only used in :ref:`debug builds <debug-build>` omitted:
es: Aquí está la definición de :c:type:`PyTypeObject`, con algunos campos que solo se usan en las :ref:`versiones de depuración <debug-build>` omitidas:

source: Now that's a *lot* of methods. Don't worry too much though -- if you have a type you want to define, the chances are very good that you will only implement a handful of these.
es: Esos son *muchos* métodos. Sin embargo, no se preocupe demasiado: si tiene un tipo que desea definir, es muy probable que solo implemente un puñado de estos.

source: As you probably expect by now, we're going to go over this and give more information about the various handlers. We won't go in the order they are defined in the structure, because there is a lot of historical baggage that impacts the ordering of the fields. It's often easiest to find an example that includes the fields you need and then change the values to suit your new type. ::
es: Como probablemente espera ahora, vamos a repasar esto y daremos más información sobre los diversos controladores. No iremos en el orden en que se definen en la estructura, porque hay mucho equipaje histórico que afecta el orden de los campos. A menudo es más fácil encontrar un ejemplo que incluya los campos que necesita y luego cambiar los valores para adaptarlos a su nuevo tipo. ::

source: The name of the type -- as mentioned in the previous chapter, this will appear in various places, almost entirely for diagnostic purposes. Try to choose something that will be helpful in such a situation! ::
es: El nombre del tipo -- como se mencionó en el capítulo anterior, aparecerá en varios lugares, casi por completo para fines de diagnóstico. ¡Intente elegir algo que sea útil en tal situación! ::

source: These fields tell the runtime how much memory to allocate when new objects of this type are created. Python has some built-in support for variable length structures (think: strings, tuples) which is where the :c:member:`~PyTypeObject.tp_itemsize` field comes in. This will be dealt with later. ::
es: Estos campos le dicen al tiempo de ejecución cuánta memoria asignar cuando se crean nuevos objetos de este tipo. Python tiene algún soporte incorporado para estructuras de longitud variable (piense: cadenas, tuplas) que es donde entra el campo :c:member:`~PyTypeObject.tp_itemsize`. Esto se tratará más adelante. ::

source: Here you can put a string (or its address) that you want returned when the Python script references ``obj.__doc__`` to retrieve the doc string.
es: Aquí puede poner una cadena de caracteres (o su dirección) que desea que se retorne cuando el script de Python haga referencia a ``obj.__doc__`` para recuperar el docstring.

source: Now we come to the basic type methods -- the ones most extension types will implement.
es: Ahora llegamos a los métodos de tipo básicos: los que implementarán la mayoría de los tipos de extensión.

source: Finalization and De-allocation
es: Finalización y desasignación

source: This function is called when the reference count of the instance of your type is reduced to zero and the Python interpreter wants to reclaim it. If your type has memory to free or other clean-up to perform, you can put it here. The object itself needs to be freed here as well. Here is an example of this function::
es: Se llama a esta función cuando el recuento de referencia de la instancia de su tipo se reduce a cero y el intérprete de Python quiere reclamarlo. Si su tipo tiene memoria para liberar u otra limpieza para realizar, puede ponerla aquí. El objeto en sí mismo necesita ser liberado aquí también. Aquí hay un ejemplo de esta función::

source: If your type supports garbage collection, the destructor should call :c:func:`PyObject_GC_UnTrack` before clearing any member fields::
es: Si su tipo admite la recolección de basura, el destructor debe llamar a :c:func:`PyObject_GC_UnTrack` antes de borrar cualquier campo miembro:

source: One important requirement of the deallocator function is that it leaves any pending exceptions alone. This is important since deallocators are frequently called as the interpreter unwinds the Python stack; when the stack is unwound due to an exception (rather than normal returns), nothing is done to protect the deallocators from seeing that an exception has already been set. Any actions which a deallocator performs which may cause additional Python code to be executed may detect that an exception has been set. This can lead to misleading errors from the interpreter. The proper way to protect against this is to save a pending exception before performing the unsafe action, and restoring it when done. This can be done using the :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` functions::
es: Un requisito importante de la función desasignador es que deja solo las excepciones pendientes. Esto es importante ya que los desasignadores se llaman con frecuencia cuando el intérprete desenrolla la pila de Python; cuando la pila se desenrolla debido a una excepción (en lugar de retornos normales), no se hace nada para proteger a los desasignadores de memoria (*deallocator*) de ver que ya se ha establecido una excepción. Cualquier acción que realice un desasignador que pueda hacer que se ejecute código Python adicional puede detectar que se ha establecido una excepción. Esto puede conducir a errores engañosos del intérprete. La forma correcta de protegerse contra esto es guardar una excepción pendiente antes de realizar la acción insegura y restaurarla cuando haya terminado. Esto se puede hacer usando las funciones :c:func:`PyErr_Fetch` y :c:func:`PyErr_Restore`::

source: There are limitations to what you can safely do in a deallocator function. First, if your type supports garbage collection (using :c:member:`~PyTypeObject.tp_traverse` and/or :c:member:`~PyTypeObject.tp_clear`), some of the object's members can have been cleared or finalized by the time :c:member:`~PyTypeObject.tp_dealloc` is called. Second, in :c:member:`~PyTypeObject.tp_dealloc`, your object is in an unstable state: its reference count is equal to zero. Any call to a non-trivial object or API (as in the example above) might end up calling :c:member:`~PyTypeObject.tp_dealloc` again, causing a double free and a crash.
es: Existen limitaciones para lo que puede hacer de manera segura en una función de desasignación. Primero, si su tipo admite la recolección de basura (usando :c:member:`~PyTypeObject.tp_traverse` o :c:member:`~PyTypeObject.tp_clear`), algunos de los miembros del objeto pueden haber sido borrados o finalizados por el time :c:member:`~PyTypeObject.tp_dealloc` es llamado. Segundo, en :c:member:`~PyTypeObject.tp_dealloc`, su objeto está en un estado inestable: su recuento de referencia es igual a cero. Cualquier llamada a un objeto o API no trivial (como en el ejemplo anterior) podría terminar llamando :c:member:`~PyTypeObject.tp_dealloc` nuevamente, causando una doble liberación y un bloqueo.

source: Starting with Python 3.4, it is recommended not to put any complex finalization code in :c:member:`~PyTypeObject.tp_dealloc`, and instead use the new :c:member:`~PyTypeObject.tp_finalize` type method.
es: Comenzando con Python 3.4, se recomienda no poner ningún código de finalización complejo en :c:member:`~PyTypeObject.tp_dealloc`, y en su lugar use el nuevo método de tipo :c:member:`~PyTypeObject.tp_finalize`.

source: :pep:`442` explains the new finalization scheme.
es: :pep:`442` explica el nuevo esquema de finalización.

source: Object Presentation
es: Presentación de objetos

source: In Python, there are two ways to generate a textual representation of an object: the :func:`repr` function, and the :func:`str` function. (The :func:`print` function just calls :func:`str`.) These handlers are both optional.
es: En Python, hay dos formas de generar una representación textual de un objeto: la función :func:`repr`, y la función :func:`str`. (La función :func:`print` solo llama a :func:`str`.) Estos controladores son opcionales.

source: The :c:member:`~PyTypeObject.tp_repr` handler should return a string object containing a representation of the instance for which it is called. Here is a simple example::
es: El manejador :c:member:`~PyTypeObject.tp_repr` debe retornar un objeto de cadena que contenga una representación de la instancia para la que se llama. Aquí hay un ejemplo simple::

source: If no :c:member:`~PyTypeObject.tp_repr` handler is specified, the interpreter will supply a representation that uses the type's :c:member:`~PyTypeObject.tp_name` and a uniquely identifying value for the object.
es: Si no se especifica un controlador :c:member:`~PyTypeObject.tp_repr`, el intérprete proporcionará una representación que utiliza el :c:member:`~PyTypeObject.tp_name` del tipo y un valor de identificación exclusivo para el objeto.

source: The :c:member:`~PyTypeObject.tp_str` handler is to :func:`str` what the :c:member:`~PyTypeObject.tp_repr` handler described above is to :func:`repr`; that is, it is called when Python code calls :func:`str` on an instance of your object. Its implementation is very similar to the :c:member:`~PyTypeObject.tp_repr` function, but the resulting string is intended for human consumption. If :c:member:`~PyTypeObject.tp_str` is not specified, the :c:member:`~PyTypeObject.tp_repr` handler is used instead.
es: El manejador :c:member:`~PyTypeObject.tp_str` es para :func:`str` lo que el manejador :c:member:`~PyTypeObject.tp_repr` descrito arriba es para :func:`repr`; es decir, se llama cuando el código Python llama :func:`str` en una instancia de su objeto. Su implementación es muy similar a la función :c:member:`~PyTypeObject.tp_repr`, pero la cadena resultante está destinada al consumo humano. Si :c:member:`~PyTypeObject.tp_str` no se especifica, en su lugar se utiliza el controlador :c:member:`~PyTypeObject.tp_repr`.

source: Here is a simple example::
es: Aquí hay un ejemplo simple::

source: Attribute Management
es: Gestión de atributos

source: For every object which can support attributes, the corresponding type must provide the functions that control how the attributes are resolved. There needs to be a function which can retrieve attributes (if any are defined), and another to set attributes (if setting attributes is allowed). Removing an attribute is a special case, for which the new value passed to the handler is ``NULL``.
es: Para cada objeto que puede soportar atributos, el tipo correspondiente debe proporcionar las funciones que controlan cómo se resuelven los atributos. Es necesario que haya una función que pueda recuperar atributos (si hay alguna definida), y otra para establecer atributos (si se permite establecer atributos). La eliminación de un atributo es un caso especial, para el cual el nuevo valor pasado al controlador es ``NULL``.

source: Python supports two pairs of attribute handlers; a type that supports attributes only needs to implement the functions for one pair. The difference is that one pair takes the name of the attribute as a :c:expr:`char\*`, while the other accepts a :c:expr:`PyObject*`. Each type can use whichever pair makes more sense for the implementation's convenience. ::
es: Python admite dos pares de controladores de atributos; un tipo que admite atributos solo necesita implementar las funciones para un par. La diferencia es que un par toma el nombre del atributo como :c:expr:`char\*`, mientras que el otro acepta un :c:expr:`PyObject*`. Cada tipo puede usar cualquier par que tenga más sentido para la conveniencia de la implementación. ::

source: If accessing attributes of an object is always a simple operation (this will be explained shortly), there are generic implementations which can be used to provide the :c:expr:`PyObject*` version of the attribute management functions. The actual need for type-specific attribute handlers almost completely disappeared starting with Python 2.2, though there are many examples which have not been updated to use some of the new generic mechanism that is available.
es: Si acceder a los atributos de un objeto siempre es una operación simple (esto se explicará en breve), existen implementaciones genéricas que se pueden usar para proporcionar la versión :c:expr:`PyObject*` de las funciones de administración de atributos. La necesidad real de controladores de atributos específicos de tipo desapareció casi por completo a partir de Python 2.2, aunque hay muchos ejemplos que no se han actualizado para usar algunos de los nuevos mecanismos genéricos disponibles.

source: Generic Attribute Management
es: Gestión de atributos genéricos

source: Most extension types only use *simple* attributes. So, what makes the attributes simple? There are only a couple of conditions that must be met:
es: La mayoría de los tipos de extensión solo usan atributos *simple*. Entonces, ¿qué hace que los atributos sean simples? Solo hay un par de condiciones que se deben cumplir:

source: The name of the attributes must be known when :c:func:`PyType_Ready` is called.
es: El nombre de los atributos debe ser conocido cuando :c:func:`PyType_Ready` es llamado.

source: No special processing is needed to record that an attribute was looked up or set, nor do actions need to be taken based on the value.
es: No se necesita un procesamiento especial para registrar que un atributo se buscó o se configuró, ni se deben tomar acciones basadas en el valor.

source: Note that this list does not place any restrictions on the values of the attributes, when the values are computed, or how relevant data is stored.
es: Tenga en cuenta que esta lista no impone restricciones a los valores de los atributos, cuándo se calculan los valores o cómo se almacenan los datos relevantes.

source: When :c:func:`PyType_Ready` is called, it uses three tables referenced by the type object to create :term:`descriptor`\s which are placed in the dictionary of the type object. Each descriptor controls access to one attribute of the instance object. Each of the tables is optional; if all three are ``NULL``, instances of the type will only have attributes that are inherited from their base type, and should leave the :c:member:`~PyTypeObject.tp_getattro` and :c:member:`~PyTypeObject.tp_setattro` fields ``NULL`` as well, allowing the base type to handle attributes.
es: Cuando se llama a :c:func:`PyType_Ready`, utiliza tres tablas a las que hace referencia el objeto de tipo para crear :term:`descriptor` que se colocan en el diccionario del objeto de tipo. Cada descriptor controla el acceso a un atributo del objeto de instancia. Cada una de las tablas es opcional; si los tres son ``NULL``, las instancias del tipo solo tendrán atributos que se heredan de su tipo base, y deberían dejar :c:member:`~PyTypeObject.tp_getattro` y los campos :c:member:`~PyTypeObject.tp_setattro` ``NULL`` también, permitiendo que el tipo base maneje los atributos.

source: The tables are declared as three fields of the type object::
es: Las tablas se declaran como tres campos del tipo objeto::

source: If :c:member:`~PyTypeObject.tp_methods` is not ``NULL``, it must refer to an array of :c:type:`PyMethodDef` structures. Each entry in the table is an instance of this structure::
es: Si :c:member:`~PyTypeObject.tp_methods` no es ``NULL``, debe referirse a un arreglo de estructuras :c:type:`PyMethodDef`. Cada entrada en la tabla es una instancia de esta estructura::

source: The second table is used to define attributes which map directly to data stored in the instance. A variety of primitive C types are supported, and access may be read-only or read-write. The structures in the table are defined as::
es: La segunda tabla se utiliza para definir atributos que se asignan directamente a los datos almacenados en la instancia. Se admite una variedad de tipos C primitivos, y el acceso puede ser de solo lectura o lectura-escritura. Las estructuras en la tabla se definen como::

source: An interesting advantage of using the :c:member:`~PyTypeObject.tp_members` table to build descriptors that are used at runtime is that any attribute defined this way can have an associated doc string simply by providing the text in the table. An application can use the introspection API to retrieve the descriptor from the class object, and get the doc string using its :attr:`__doc__` attribute.
es: Una ventaja interesante de usar la tabla :c:member:`~PyTypeObject.tp_members` para crear descriptores que se usan en tiempo de ejecución es que cualquier atributo definido de esta manera puede tener un docstring asociada simplemente al proporcionar el texto en la tabla. Una aplicación puede usar la API de introspección para recuperar el descriptor del objeto de clase y obtener el docstring utilizando su atributo :attr:`__doc__`.

source: Type-specific Attribute Management
es: Gestión de atributos específicos de tipo

source: For simplicity, only the :c:expr:`char\*` version will be demonstrated here; the type of the name parameter is the only difference between the :c:expr:`char\*` and :c:expr:`PyObject*` flavors of the interface. This example effectively does the same thing as the generic example above, but does not use the generic support added in Python 2.2. It explains how the handler functions are called, so that if you do need to extend their functionality, you'll understand what needs to be done.
es: Para simplificar, solo la versión :c:expr:`char\*` será demostrada aquí; el tipo del parámetro con nombre es la única diferencia entre :c:expr:`char\*` y :c:expr:`PyObject*` de la interfaz. Este ejemplo efectivamente hace lo mismo que el ejemplo genérico anterior, pero no usa el soporte genérico agregado en Python 2.2. Explica cómo se llaman las funciones del controlador, de modo que si necesita ampliar su funcionalidad, comprenderá lo que debe hacerse.

source: Here is an example::
es: Aquí hay un ejemplo::

source: Object Comparison
es: Comparación de Objetos

source: This function is called with two Python objects and the operator as arguments, where the operator is one of ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` or ``Py_GT``. It should compare the two objects with respect to the specified operator and return ``Py_True`` or ``Py_False`` if the comparison is successful, ``Py_NotImplemented`` to indicate that comparison is not implemented and the other object's comparison method should be tried, or ``NULL`` if an exception was set.
es: Esta función se llama con dos objetos de Python y el operador como argumentos, donde el operador es uno de ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` o ``Py_GT``. Debe comparar los dos objetos con respecto al operador especificado y retornar ``Py_True`` o ``Py_False`` si la comparación es exitosa, ``Py_NotImplemented`` para indicar que la comparación no está implementada y se debe probar el método de comparación del otro objeto, o ``NULL`` si se estableció una excepción.

source: Here is a sample implementation, for a datatype that is considered equal if the size of an internal pointer is equal::
es: Aquí hay una implementación de muestra, para un tipo de datos que se considera igual si el tamaño de un puntero interno es igual:

source: Abstract Protocol Support
es: Soporte de protocolo abstracto

source: Python supports a variety of *abstract* 'protocols;' the specific interfaces provided to use these interfaces are documented in :ref:`abstract`.
es: Python admite una variedad de protocolos *abstractos*; las interfaces específicas proporcionadas para usar estas interfaces están documentadas en :ref:`abstract`.

source: A number of these abstract interfaces were defined early in the development of the Python implementation. In particular, the number, mapping, and sequence protocols have been part of Python since the beginning. Other protocols have been added over time. For protocols which depend on several handler routines from the type implementation, the older protocols have been defined as optional blocks of handlers referenced by the type object. For newer protocols there are additional slots in the main type object, with a flag bit being set to indicate that the slots are present and should be checked by the interpreter. (The flag bit does not indicate that the slot values are non-``NULL``. The flag may be set to indicate the presence of a slot, but a slot may still be unfilled.) ::
es: Varias de estas interfaces abstractas se definieron temprano en el desarrollo de la implementación de Python. En particular, los protocolos de número, mapeo y secuencia han sido parte de Python desde el principio. Se han agregado otros protocolos con el tiempo. Para los protocolos que dependen de varias rutinas de controlador de la implementación de tipo, los protocolos más antiguos se han definido como bloques opcionales de controladores a los que hace referencia el objeto de tipo. Para los protocolos más nuevos, hay espacios adicionales en el objeto de tipo principal, con un bit de marca que se establece para indicar que los espacios están presentes y el intérprete debe verificarlos. (El bit de indicador no indica que los valores de intervalo no son ``NULL``. El indicador puede establecerse para indicar la presencia de un intervalo, pero un intervalo aún puede estar vacío.)::

source: If you wish your object to be able to act like a number, a sequence, or a mapping object, then you place the address of a structure that implements the C type :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, or :c:type:`PyMappingMethods`, respectively. It is up to you to fill in this structure with appropriate values. You can find examples of the use of each of these in the :file:`Objects` directory of the Python source distribution. ::
es: Si desea que su objeto pueda actuar como un número, una secuencia o un objeto de mapeo, entonces coloca la dirección de una estructura que implementa el tipo C :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, o :c:type:`PyMappingMethods`, respectivamente. Depende de usted completar esta estructura con los valores apropiados. Puede encontrar ejemplos del uso de cada uno de estos en el directorio :file:`Objects` de la distribución fuente de Python. ::

source: This function, if you choose to provide it, should return a hash number for an instance of your data type. Here is a simple example::
es: Esta función, si elige proporcionarla, debería retornar un número hash para una instancia de su tipo de datos. Aquí hay un ejemplo simple::

source: :c:type:`Py_hash_t` is a signed integer type with a platform-varying width. Returning ``-1`` from :c:member:`~PyTypeObject.tp_hash` indicates an error, which is why you should be careful to avoid returning it when hash computation is successful, as seen above.
es: :c:type:`Py_hash_t` es un tipo entero con signo con un ancho que varia dependiendo de la plataforma.retornar ``-1`` de :c:member:`~PyTypeObject.tp_hash` indica un error, por lo que debe tener cuidado de evitar retornarlo cuando el cálculo de hash sea exitoso, como se vio anteriormente.
