Repository: python/python-docs-es
Catalog: extending/newtypes.po
Languages: es

source: This function is called when an instance of your data type is "called", for example, if ``obj1`` is an instance of your data type and the Python script contains ``obj1('hello')``, the :c:member:`~PyTypeObject.tp_call` handler is invoked.
es: Esta función se llama cuando una instancia de su tipo de datos se "llama", por ejemplo, si ``obj1`` es una instancia de su tipo de datos y el script de Python contiene ``obj1('hello')``, el controlador :c:member:`~PyTypeObject.tp_call` se invoca.

source: This function takes three arguments:
es: Esta función toma tres argumentos:

source: *self* is the instance of the data type which is the subject of the call. If the call is ``obj1('hello')``, then *self* is ``obj1``.
es: *self* es la instancia del tipo de datos que es el sujeto de la llamada. Si la llamada es ``obj1('hola')``, entonces *self* es ``obj1``.

source: *args* is a tuple containing the arguments to the call. You can use :c:func:`PyArg_ParseTuple` to extract the arguments.
es: *args* es una tupla que contiene los argumentos de la llamada. Puede usar :c:func:`PyArg_ParseTuple` para extraer los argumentos.

source: *kwds* is a dictionary of keyword arguments that were passed. If this is non-``NULL`` and you support keyword arguments, use :c:func:`PyArg_ParseTupleAndKeywords` to extract the arguments. If you do not want to support keyword arguments and this is non-``NULL``, raise a :exc:`TypeError` with a message saying that keyword arguments are not supported.
es: *kwds* es un diccionario de argumentos de palabras clave que se pasaron. Si no es ``NULL`` y admite argumentos de palabras clave, use :c:func:`PyArg_ParseTupleAndKeywords` para extraer los argumentos. Si no desea admitir argumentos de palabras clave y esto no es ``NULL``, genere un :exc:`TypeError` con un mensaje que indique que los argumentos de palabras clave no son compatibles.

source: Here is a toy ``tp_call`` implementation::
es: Aquí hay una implementación de juguete ``tp_call``::

source: Any :term:`iterable` object must implement the :c:member:`~PyTypeObject.tp_iter` handler, which must return an :term:`iterator` object. Here the same guidelines apply as for Python classes:
es: Cualquier objeto :term:`iterable` debe implementar el manejador :c:member:`~PyTypeObject.tp_iter`, que debe retornar un objeto :term:`iterator`. Aquí se aplican las mismas pautas que para las clases de Python:

source: For collections (such as lists and tuples) which can support multiple independent iterators, a new iterator should be created and returned by each call to :c:member:`~PyTypeObject.tp_iter`.
es: Para colecciones (como listas y tuplas) que pueden admitir múltiples iteradores independientes, cada llamada debe crear y retornar un nuevo iterador a :c:member:`~PyTypeObject.tp_iter`.

source: Objects which can only be iterated over once (usually due to side effects of iteration, such as file objects) can implement :c:member:`~PyTypeObject.tp_iter` by returning a new reference to themselves -- and should also therefore implement the :c:member:`~PyTypeObject.tp_iternext` handler.
es: Los objetos que solo se pueden iterar una vez (generalmente debido a los efectos secundarios de la iteración, como los objetos de archivo) pueden implementar :c:member:`~PyTypeObject.tp_iter` retornando una nueva referencia a ellos mismos y, por lo tanto, también deben implementar el manejador :c:member:`~PyTypeObject.tp_iternext`.

source: Any :term:`iterator` object should implement both :c:member:`~PyTypeObject.tp_iter` and :c:member:`~PyTypeObject.tp_iternext`. An iterator's :c:member:`~PyTypeObject.tp_iter` handler should return a new reference to the iterator. Its :c:member:`~PyTypeObject.tp_iternext` handler should return a new reference to the next object in the iteration, if there is one. If the iteration has reached the end, :c:member:`~PyTypeObject.tp_iternext` may return ``NULL`` without setting an exception, or it may set :exc:`StopIteration` *in addition* to returning ``NULL``; avoiding the exception can yield slightly better performance. If an actual error occurs, :c:member:`~PyTypeObject.tp_iternext` should always set an exception and return ``NULL``.
es: Cualquier objeto :term:`iterator` debe implementar tanto :c:member:`~PyTypeObject.tp_iter` como :c:member:`~PyTypeObject.tp_iternext`. El manejador de un iterador :c:member:`~PyTypeObject.tp_iter` debería retornar una nueva referencia al iterador. Su controlador :c:member:`~PyTypeObject.tp_iternext` debería retornar una nueva referencia al siguiente objeto en la iteración, si hay uno. Si la iteración ha llegado al final, :c:member:`~PyTypeObject.tp_iternext` puede retornar ``NULL`` sin establecer una excepción, o puede establecer :exc:`StopIteration` *además* para retornar ``NULL``; evitar la excepción puede producir un rendimiento ligeramente mejor. Si se produce un error real, :c:member:`~PyTypeObject.tp_iternext` siempre debe establecer una excepción y retornar ``NULL``.

source: Weak Reference Support
es: Soporte de referencia débil

source: One of the goals of Python's weak reference implementation is to allow any type to participate in the weak reference mechanism without incurring the overhead on performance-critical objects (such as numbers).
es: Uno de los objetivos de la implementación de referencia débil de Python es permitir que cualquier tipo participe en el mecanismo de referencia débil sin incurrir en la sobrecarga de objetos críticos para el rendimiento (como los números).

source: Documentation for the :mod:`weakref` module.
es: Documentación para el módulo :mod:`weakref`.

source: More Suggestions
es: Más Sugerencias

source: In order to learn how to implement any specific method for your new data type, get the :term:`CPython` source code. Go to the :file:`Objects` directory, then search the C source files for ``tp_`` plus the function you want (for example, ``tp_richcompare``). You will find examples of the function you want to implement.
es: Para aprender a implementar cualquier método específico para su nuevo tipo de datos, obtenga el código fuente :term:`CPython`. Vaya al directorio :file:`Objects`, luego busque en los archivos fuente C ``tp_`` más la función que desee (por ejemplo, ``tp_richcompare``). Encontrará ejemplos de la función que desea implementar.

source: When you need to verify that an object is a concrete instance of the type you are implementing, use the :c:func:`PyObject_TypeCheck` function. A sample of its use might be something like the following::
es: Cuando necesite verificar que un objeto es una instancia concreta del tipo que está implementando, use la función :c:func:`PyObject_TypeCheck`. Una muestra de su uso podría ser algo como lo siguiente::

source: Download CPython source releases.
es: Descargue las versiones de origen de CPython.

source: The CPython project on GitHub, where the CPython source code is developed.
es: El proyecto CPython en GitHub, donde se desarrolla el código fuente de CPython.
