Repository: python/python-docs-es
Catalog: reference/import.po
Languages: es

source: The ``__spec__`` attribute must be set to the module spec that was used when importing the module. Setting ``__spec__`` appropriately applies equally to :ref:`modules initialized during interpreter startup <programs>`. The one exception is ``__main__``, where ``__spec__`` is :ref:`set to None in some cases <main_spec>`.
es: El atributo ``__spec__`` debe establecerse en la especificación de módulo que se utilizó al importar el módulo. Establecer ``__spec__`` se aplica correctamente por igual a :ref:`módulos inicializados durante el inicio del intérprete <programs>`. La única excepción es ``__main__``, donde ``__spec__`` es :ref:`establecido None en algunos casos <main_spec>`.

source: ``__spec__.parent`` is used as a fallback when ``__package__`` is not defined.
es: ``__spec__.parent`` se utiliza como reserva cuando ``__package__``` no está definido.

source: If the module is a package (either regular or namespace), the module object's ``__path__`` attribute must be set. The value must be iterable, but may be empty if ``__path__`` has no further significance. If ``__path__`` is not empty, it must produce strings when iterated over. More details on the semantics of ``__path__`` are given :ref:`below <package-path-rules>`.
es: Si el módulo es un paquete (normal o espacio de nombres), se debe establecer el atributo ``__path__`` del objeto de módulo. El valor debe ser iterable, pero puede estar vacío si ``__path__`` no tiene más importancia. Si ``__path__`` no está vacío, debe producir cadenas cuando se itera. Más detalles sobre la semántica de ``__path__`` se dan :ref:`below <package-path-rules>`.

source: Non-package modules should not have a ``__path__`` attribute.
es: Los módulos que no son de paquete no deben tener un atributo ``__path__``.

source: ``__file__`` is optional (if set, value must be a string). It indicates the pathname of the file from which the module was loaded (if loaded from a file), or the pathname of the shared library file for extension modules loaded dynamically from a shared library. It might be missing for certain types of modules, such as C modules that are statically linked into the interpreter, and the import system may opt to leave it unset if it has no semantic meaning (e.g. a module loaded from a database).
es: ``__file__`` es opcional (si se establece, el valor debe ser una cadena). Indica el nombre de ruta del archivo desde el que se cargó el módulo (si se cargó desde un archivo), o el nombre de ruta del archivo de biblioteca compartida para módulos de extensión cargados dinámicamente desde una biblioteca compartida. Es posible que falte para ciertos tipos de módulos, como los módulos C que están vinculados estáticamente al intérprete, y el sistema de importación puede optar por dejarlo sin configurar si no tiene un significado semántico (por ejemplo, un módulo cargado desde una base de datos).

source: If ``__file__`` is set then the ``__cached__`` attribute might also be set, which is the path to any compiled version of the code (e.g. byte-compiled file). The file does not need to exist to set this attribute; the path can simply point to where the compiled file would exist (see :pep:`3147`).
es: Si se establece ``__file__``, también se puede establecer el atributo ``__cached__``, que es la ruta a cualquier versión compilada del código (por ejemplo, un archivo compilado por bytes). No es necesario que el archivo exista para establecer este atributo; la ruta simplemente puede indicar dónde existiría el archivo compilado (ver :pep:`3147`).

source: Note that ``__cached__`` may be set even if ``__file__`` is not set. However, that scenario is quite atypical. Ultimately, the loader is what makes use of the module spec provided by the finder (from which ``__file__`` and ``__cached__`` are derived). So if a loader can load from a cached module but otherwise does not load from a file, that atypical scenario may be appropriate.
es: Tenga en cuenta que se puede configurar ``__cached__`` incluso si ``__file__`` no está configurado. Sin embargo, ese escenario es bastante atípico. En última instancia, el cargador es lo que hace uso de la especificación del módulo proporcionada por el buscador (del que se derivan ``__file__`` y ``__cached__``). Entonces, si un cargador puede cargar desde un módulo almacenado en caché pero no carga desde un archivo, ese escenario atípico puede ser apropiado.

source: It is **strongly** recommended that you rely on :attr:`__spec__` instead instead of ``__cached__``.
es: Es **altamente** recomendado utilizar :attr:`__spec__` en lugar de ``__cached__``.

source: By definition, if a module has a ``__path__`` attribute, it is a package.
es: Por definición, si un módulo tiene un atributo ``__path__``, es un paquete.

source: A package's ``__path__`` attribute is used during imports of its subpackages. Within the import machinery, it functions much the same as :data:`sys.path`, i.e. providing a list of locations to search for modules during import. However, ``__path__`` is typically much more constrained than :data:`sys.path`.
es: El atributo ``__path__`` de un paquete se utiliza durante las importaciones de sus subpaquetes. Dentro de la maquinaria de importación, funciona de la misma manera que :data:`sys.path`, es decir, proporcionando una lista de ubicaciones para buscar módulos durante la importación. Sin embargo, ``__path__`` suele estar mucho más restringido que :data:`sys.path`.

source: ``__path__`` must be an iterable of strings, but it may be empty. The same rules used for :data:`sys.path` also apply to a package's ``__path__``, and :data:`sys.path_hooks` (described below) are consulted when traversing a package's ``__path__``.
es: ``__path__`` debe ser un iterable de cadenas, pero puede estar vacío. Las mismas reglas utilizadas para :data:`sys.path` también se aplican a la ``__path__`` de un paquete, y :data:`sys.path_hooks` (descrito a continuación) se consultan al recorrer el ``__path__`` de un paquete.

source: A package's ``__init__.py`` file may set or alter the package's ``__path__`` attribute, and this was typically the way namespace packages were implemented prior to :pep:`420`. With the adoption of :pep:`420`, namespace packages no longer need to supply ``__init__.py`` files containing only ``__path__`` manipulation code; the import machinery automatically sets ``__path__`` correctly for the namespace package.
es: El archivo ``__init__.py`` de un paquete puede establecer o modificar el atributo ``__path__`` del paquete, y esta era normalmente la forma en que los paquetes de espacio de nombres se implementaban antes de :pep:`420`. Con la adopción de :pep:`420`, los paquetes de espacio de nombres ya no necesitan proporcionar archivos ``__init__.py`` que contienen solo el código de manipulación ``__path__``; la máquina de importación establece automáticamente ``__path__`` correctamente para el paquete de espacio de nombres.

source: Module reprs
es: Representación (*Reprs*) de módulos

source: By default, all modules have a usable repr, however depending on the attributes set above, and in the module's spec, you can more explicitly control the repr of module objects.
es: De forma predeterminada, todos los módulos tienen un repr utilizable, sin embargo, dependiendo de los atributos establecidos anteriormente, y en las especificaciones del módulo, puede controlar más explícitamente el repr de los objetos de módulo.

source: If the module has a spec (``__spec__``), the import machinery will try to generate a repr from it. If that fails or there is no spec, the import system will craft a default repr using whatever information is available on the module. It will try to use the ``module.__name__``, ``module.__file__``, and ``module.__loader__`` as input into the repr, with defaults for whatever information is missing.
es: Si el módulo tiene una especificación (``__spec__``), la maquinaria de importación intentará generar un repr a partir de él. Si eso falla o no hay ninguna especificación, el sistema de importación creará un repr predeterminado usando cualquier información disponible en el módulo. Intentará utilizar el ``module.__name__``, ``module.__file__`` y ``module.__loader__`` como entrada en el repr, con valores predeterminados para cualquier información que falte.

source: Here are the exact rules used:
es: Aquí están las reglas exactas utilizadas:

source: If the module has a ``__spec__`` attribute, the information in the spec is used to generate the repr. The "name", "loader", "origin", and "has_location" attributes are consulted.
es: Si el módulo tiene un atributo ``__spec__``, la información de la especificación se utiliza para generar el repr. Se consultan los atributos "name", "loader", "origin" y "has_location".

source: If the module has a ``__file__`` attribute, this is used as part of the module's repr.
es: Si el módulo tiene un atributo ``__file__``, se utiliza como parte del repr del módulo.

source: If the module has no ``__file__`` but does have a ``__loader__`` that is not ``None``, then the loader's repr is used as part of the module's repr.
es: Si el módulo no tiene ``__file__`` pero tiene un ``__loader__`` que no es ``None``, entonces el repr del cargador se utiliza como parte del repr del módulo.

source: Otherwise, just use the module's ``__name__`` in the repr.
es: De lo contrario, sólo tiene que utilizar el ``__name__`` del módulo en el repr.

source: Use of :meth:`!module_repr`, having been deprecated since Python 3.4, was removed in Python 3.12 and is no longer called during the resolution of a module's repr.
es: El uso de :meth:`!module_repr`, al ser obsoleto desde Python 3.4, fue eliminado en Python 3.12 y no es llamado durante la resolución de la representación (repr) de un módulo.

source: Cached bytecode invalidation
es: Invalidación del código de bytes en caché

source: Before Python loads cached bytecode from a ``.pyc`` file, it checks whether the cache is up-to-date with the source ``.py`` file. By default, Python does this by storing the source's last-modified timestamp and size in the cache file when writing it. At runtime, the import system then validates the cache file by checking the stored metadata in the cache file against the source's metadata.
es: Antes de que Python cargue el código de bytes en caché de un archivo ``.pyc``, verifica si el caché está actualizado con el archivo ``.py`` de origen. De forma predeterminada, Python hace esto almacenando la marca de tiempo y el tamaño de la última modificación de la fuente en el archivo de caché al escribirlo. En tiempo de ejecución, el sistema de importación valida el archivo de caché comprobando los metadatos almacenados en el archivo de caché con los metadatos de la fuente.

source: Python also supports "hash-based" cache files, which store a hash of the source file's contents rather than its metadata. There are two variants of hash-based ``.pyc`` files: checked and unchecked. For checked hash-based ``.pyc`` files, Python validates the cache file by hashing the source file and comparing the resulting hash with the hash in the cache file. If a checked hash-based cache file is found to be invalid, Python regenerates it and writes a new checked hash-based cache file. For unchecked hash-based ``.pyc`` files, Python simply assumes the cache file is valid if it exists. Hash-based ``.pyc`` files validation behavior may be overridden with the :option:`--check-hash-based-pycs` flag.
es: Python también admite archivos de caché "basados en hash", que almacenan un hash del contenido del archivo de origen en lugar de sus metadatos. Hay dos variantes de archivos ``.pyc`` basados en hash: marcados y desmarcados. Para los archivos ``.pyc`` marcados basados en hash, Python valida el archivo de caché mediante el hash del archivo de origen y la comparación del hash resultante con el hash en el archivo de caché. Si se encuentra que un archivo de caché basado en hash comprobado no es válido, Python lo regenera y escribe un nuevo archivo de caché basado en hash comprobado. Para los archivos ``.pyc`` sin marcar en hash, Python simplemente asume que el archivo de caché es válido si existe. El comportamiento de validación de archivos basado en hash ``.pyc`` se puede invalidar con el indicador :option:`--check-hash-based-pycs`.

source: Added hash-based ``.pyc`` files. Previously, Python only supported timestamp-based invalidation of bytecode caches.
es: Se han añadido archivos ``.pyc`` basados en hash. Anteriormente, Python solo admitía la invalidación basada en la marca de tiempo de la caché del código de bytes.

source: The Path Based Finder
es: El buscador basado en rutas

source: As mentioned previously, Python comes with several default meta path finders. One of these, called the :term:`path based finder` (:class:`~importlib.machinery.PathFinder`), searches an :term:`import path`, which contains a list of :term:`path entries <path entry>`. Each path entry names a location to search for modules.
es: Como se mencionó anteriormente, Python viene con varios buscadores de meta rutas predeterminados. Uno de ellos, llamado el buscador :term:`path based finder` (:class:`~importlib.machinery.PathFinder`), busca una :term:`import path`, que contiene una lista de :term:`entradas de ruta <path entry>`. Cada entrada de ruta de acceso nombra una ubicación para buscar módulos.

source: The path based finder itself doesn't know how to import anything. Instead, it traverses the individual path entries, associating each of them with a path entry finder that knows how to handle that particular kind of path.
es: El buscador basado en rutas en sí no sabe cómo importar nada. En su lugar, atraviesa las entradas de ruta individuales, asociando cada una de ellas con un buscador de entrada de ruta que sabe cómo manejar ese tipo particular de ruta de acceso.

source: The default set of path entry finders implement all the semantics for finding modules on the file system, handling special file types such as Python source code (``.py`` files), Python byte code (``.pyc`` files) and shared libraries (e.g. ``.so`` files). When supported by the :mod:`zipimport` module in the standard library, the default path entry finders also handle loading all of these file types (other than shared libraries) from zipfiles.
es: El conjunto predeterminado de buscadores de entradas de ruta implementa toda la semántica para encontrar módulos en el sistema de archivos, controlando tipos de archivos especiales como el código fuente de Python (archivos ```.py``), el código de bytes de Python (archivos ``.pyc``) y las bibliotecas compartidas (por ejemplo, archivos ``.so```). Cuando es compatible con el módulo :mod:`zipimport` en la biblioteca estándar, los buscadores de entradas de ruta de acceso predeterminados también controlan la carga de todos estos tipos de archivo (excepto las bibliotecas compartidas) desde zipfiles.

source: Path entries need not be limited to file system locations. They can refer to URLs, database queries, or any other location that can be specified as a string.
es: Las entradas de ruta de acceso no deben limitarse a las ubicaciones del sistema de archivos. Pueden hacer referencia a direcciones URL, consultas de base de datos o cualquier otra ubicación que se pueda especificar como una cadena.

source: The path based finder provides additional hooks and protocols so that you can extend and customize the types of searchable path entries. For example, if you wanted to support path entries as network URLs, you could write a hook that implements HTTP semantics to find modules on the web. This hook (a callable) would return a :term:`path entry finder` supporting the protocol described below, which was then used to get a loader for the module from the web.
es: El buscador basado en rutas proporciona enlaces y protocolos adicionales para que pueda ampliar y personalizar los tipos de entradas de ruta de acceso que se pueden buscar. Por ejemplo, si desea admitir entradas de ruta de acceso como direcciones URL de red, podría escribir un enlace que implemente la semántica HTTP para buscar módulos en la web. Este gancho (un al que se puede llamar) retornaría un :term:`path entry finder` compatible con el protocolo descrito a continuación, que luego se utilizó para obtener un cargador para el módulo de la web.

source: A word of warning: this section and the previous both use the term *finder*, distinguishing between them by using the terms :term:`meta path finder` and :term:`path entry finder`. These two types of finders are very similar, support similar protocols, and function in similar ways during the import process, but it's important to keep in mind that they are subtly different. In particular, meta path finders operate at the beginning of the import process, as keyed off the :data:`sys.meta_path` traversal.
es: Una palabra de advertencia: esta sección y la anterior utilizan el término *finder*, distinguiendo entre ellos utilizando los términos :term:`meta path finder` y :term:`path entry finder`. Estos dos tipos de buscadores son muy similares, admiten protocolos similares y funcionan de maneras similares durante el proceso de importación, pero es importante tener en cuenta que son sutilmente diferentes. En particular, los buscadores de meta path operan al principio del proceso de importación, como se indica en el recorrido :data:`sys.meta_path`.

source: By contrast, path entry finders are in a sense an implementation detail of the path based finder, and in fact, if the path based finder were to be removed from :data:`sys.meta_path`, none of the path entry finder semantics would be invoked.
es: Por el contrario, los buscadores de entradas de ruta son en cierto sentido un detalle de implementación del buscador basado en rutas y, de hecho, si el buscador basado en rutas se eliminara de :data:`sys.meta_path`, no se invocaría ninguna semántica del buscador de entradas de ruta.

source: Path entry finders
es: Buscadores de entradas de ruta

source: The :term:`path based finder` is responsible for finding and loading Python modules and packages whose location is specified with a string :term:`path entry`. Most path entries name locations in the file system, but they need not be limited to this.
es: El :term:`path based finder` es responsable de encontrar y cargar módulos y paquetes de Python cuya ubicación se especifica con una cadena :term:`path entry`. La mayoría de las ubicaciones de nombres de entradas de ruta de acceso en el sistema de archivos, pero no es necesario limitarlas a esto.

source: As a meta path finder, the :term:`path based finder` implements the :meth:`~importlib.abc.MetaPathFinder.find_spec` protocol previously described, however it exposes additional hooks that can be used to customize how modules are found and loaded from the :term:`import path`.
es: Como buscador de meta rutas, el buscador :term:`path based finder` implementa el protocolo :meth:`~importlib.abc.MetaPathFinder.find_spec` descrito anteriormente, sin embargo, expone enlaces adicionales que se pueden usar para personalizar cómo se encuentran y cargan los módulos desde la ruta :term:`import path`.

source: Three variables are used by the :term:`path based finder`, :data:`sys.path`, :data:`sys.path_hooks` and :data:`sys.path_importer_cache`. The ``__path__`` attributes on package objects are also used. These provide additional ways that the import machinery can be customized.
es: Tres variables son usadas por :term:`path based finder`, :data:`sys.path`, :data:`sys.path_hooks` y :data:`sys.path_importer_cache`. También se utilizan los atributos ``__path__`` en los objetos de paquete. Estos proporcionan formas adicionales de personalizar la maquinaria de importación.

source: :data:`sys.path` contains a list of strings providing search locations for modules and packages. It is initialized from the :data:`PYTHONPATH` environment variable and various other installation- and implementation-specific defaults. Entries in :data:`sys.path` can name directories on the file system, zip files, and potentially other "locations" (see the :mod:`site` module) that should be searched for modules, such as URLs, or database queries. Only strings should be present on :data:`sys.path`; all other data types are ignored.
es: :data:`sys.path` contiene una lista de cadenas que proporcionan ubicaciones de búsqueda para módulos y paquetes. Se inicializa a partir de la variable de entorno :data:`PYTHONPATH` y varios otros valores predeterminados específicos de instalación e implementación. Las entradas en :data:`sys.path` pueden nombrar directorios en el sistema de archivos, archivos zip y potencialmente otras "ubicaciones" (consulte el módulo :mod:`site`) en las que se deben buscar módulos, como URL o consultas de bases de datos. Solo las cadenas deben estar presentes en :data:`sys.path`; todos los demás tipos de datos se ignoran.

source: The :term:`path based finder` is a :term:`meta path finder`, so the import machinery begins the :term:`import path` search by calling the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method as described previously. When the ``path`` argument to :meth:`~importlib.machinery.PathFinder.find_spec` is given, it will be a list of string paths to traverse - typically a package's ``__path__`` attribute for an import within that package. If the ``path`` argument is ``None``, this indicates a top level import and :data:`sys.path` is used.
es: El buscador :term:`path based finder` es un :term:`meta path finder`, por lo que la maquinaria de importación comienza la búsqueda :term:`import path` llamando al método :meth:`~importlib.machinery.PathFinder.find_spec` basado en la ruta de acceso, tal como se describió anteriormente. Cuando se proporciona el argumento ``path`` a :meth:`~importlib.machinery.PathFinder.find_spec`, será una lista de rutas de acceso de cadena para recorrer - normalmente el atributo ``__path__`` de un paquete para una importación dentro de ese paquete. Si el argumento ``path`` es ``None``, esto indica una importación de nivel superior y se utiliza :data:`sys.path`.
