Repository: python/python-docs-es
Catalog: reference/import.po
Languages: es

source: If the path entry is not present in the cache, the path based finder iterates over every callable in :data:`sys.path_hooks`. Each of the :term:`path entry hooks <path entry hook>` in this list is called with a single argument, the path entry to be searched. This callable may either return a :term:`path entry finder` that can handle the path entry, or it may raise :exc:`ImportError`. An :exc:`ImportError` is used by the path based finder to signal that the hook cannot find a :term:`path entry finder` for that :term:`path entry`. The exception is ignored and :term:`import path` iteration continues. The hook should expect either a string or bytes object; the encoding of bytes objects is up to the hook (e.g. it may be a file system encoding, UTF-8, or something else), and if the hook cannot decode the argument, it should raise :exc:`ImportError`.
es: Si la entrada de ruta de acceso no está presente en la memoria caché, el buscador basado en rutas de acceso recorre en iteración cada llamada que se puede llamar en :data:`sys.path_hooks`. Cada uno de los enlaces de :term:`ganchos de rutas de entrada <path entry hook>` en esta lista se llama con un solo argumento, la entrada de ruta de acceso que se va a buscar. Esta invocable puede retornar un :term:`path entry finder` que puede controlar la entrada de ruta de acceso, o puede generar :exc:`ImportError`. Un :exc:`ImportError` es utilizado por el buscador basado en ruta para indicar que el gancho no puede encontrar un :term:`path entry finder` para eso :term:`entrada de ruta`. Se omite la excepción y la iteración :term:`import path` continúa. El enlace debe esperar un objeto de rutas o bytes; la codificación de objetos bytes está hasta el enlace (por ejemplo, puede ser una codificación del sistema de archivos, UTF-8, o algo más), y si el gancho no puede decodificar el argumento, debe generar :exc:`ImportError`.

source: If :data:`sys.path_hooks` iteration ends with no :term:`path entry finder` being returned, then the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method will store ``None`` in :data:`sys.path_importer_cache` (to indicate that there is no finder for this path entry) and return ``None``, indicating that this :term:`meta path finder` could not find the module.
es: Si la iteración :data:`sys.path_hooks` termina sin que se retorne ningún valor :term:`path entry finder`, a continuación, el método de búsqueda basado en la ruta de acceso :meth:`~importlib.machinery.PathFinder.find_spec` almacenará ``None`` en :data:`sys.path_importer_cache` (para indicar que no hay ningún buscador para esta entrada de ruta) y retornará ``None``, lo que indica que este :term:`meta path finder` no pudo encontrar el módulo.

source: If a :term:`path entry finder` *is* returned by one of the :term:`path entry hook` callables on :data:`sys.path_hooks`, then the following protocol is used to ask the finder for a module spec, which is then used when loading the module.
es: Si un :term:`path entry finder` *is* retornado por uno de los :term:`path entry hook` invocables en :data:`sys.path_hooks`, entonces el siguiente protocolo se utiliza para pedir al buscador una especificación de módulo, que luego se utiliza al cargar el módulo.

source: The current working directory -- denoted by an empty string -- is handled slightly differently from other entries on :data:`sys.path`. First, if the current working directory is found to not exist, no value is stored in :data:`sys.path_importer_cache`. Second, the value for the current working directory is looked up fresh for each module lookup. Third, the path used for :data:`sys.path_importer_cache` and returned by :meth:`importlib.machinery.PathFinder.find_spec` will be the actual current working directory and not the empty string.
es: El directorio de trabajo actual, denotado por una cadena vacía, se controla de forma ligeramente diferente de otras entradas de :data:`sys.path`. En primer lugar, si se encuentra que el directorio de trabajo actual no existe, no se almacena ningún valor en :data:`sys.path_importer_cache`. En segundo lugar, el valor del directorio de trabajo actual se busca actualizado para cada búsqueda de módulo. En tercer lugar, la ruta de acceso utilizada para :data:`sys.path_importer_cache` y retornada por :meth:`importlib.machinery.PathFinder.find_spec` será el directorio de trabajo actual real y no la cadena vacía.

source: Path entry finder protocol
es: Buscadores de entradas de ruta

source: In order to support imports of modules and initialized packages and also to contribute portions to namespace packages, path entry finders must implement the :meth:`~importlib.abc.PathEntryFinder.find_spec` method.
es: Para admitir las importaciones de módulos y paquetes inicializados y también para contribuir con partes a paquetes de espacio de nombres, los buscadores de entradas de ruta de acceso deben implementar el método :meth:`importlib.abc.PathEntryFinder.find_spec`.

source: :meth:`~importlib.abc.PathEntryFinder.find_spec` takes two arguments: the fully qualified name of the module being imported, and the (optional) target module. ``find_spec()`` returns a fully populated spec for the module. This spec will always have "loader" set (with one exception).
es: :meth:`importlib.abc.PathEntryFinder.find_spec`` toma dos argumentos: el nombre completo del módulo que se va a importar y el módulo de destino (opcional). ``find_spec()`` retorna una especificación completamente poblada para el módulo. Esta especificación siempre tendrá "cargador" establecido (con una excepción).

source: Older path entry finders may implement one of these two deprecated methods instead of ``find_spec()``. The methods are still respected for the sake of backward compatibility. However, if ``find_spec()`` is implemented on the path entry finder, the legacy methods are ignored.
es: Los buscadores de entradas de ruta más antiguos pueden implementar uno de estos dos métodos en desuso en lugar de ``find_spec()``. Los métodos todavía se respetan en aras de la compatibilidad con versiones anteriores. Sin embargo, si ``find_spec()`` se implementa en el buscador de entrada de ruta, se omiten los métodos heredados.

source: For backwards compatibility with other implementations of the import protocol, many path entry finders also support the same, traditional ``find_module()`` method that meta path finders support. However path entry finder ``find_module()`` methods are never called with a ``path`` argument (they are expected to record the appropriate path information from the initial call to the path hook).
es: Para la compatibilidad con versiones anteriores con otras implementaciones del protocolo de importación, muchos buscadores de entradas de ruta de acceso también admiten el mismo método tradicional ``find_module()`` que admiten los buscadores de rutas de acceso meta. Sin embargo, nunca se llama a los métodos del buscador de entradas de ruta ``find_module()`` con un argumento ``path`` (se espera que registren la información de ruta adecuada desde la llamada inicial al enlace de ruta).

source: The ``find_module()`` method on path entry finders is deprecated, as it does not allow the path entry finder to contribute portions to namespace packages. If both ``find_loader()`` and ``find_module()`` exist on a path entry finder, the import system will always call ``find_loader()`` in preference to ``find_module()``.
es: El método ``find_module()`` en los buscadores de entrada de ruta está en desuso, ya que no permite que el buscador de entradas de ruta de acceso aporte partes a paquetes de espacio de nombres. Si existen tanto ``find_loader()`` como ``find_module()`` en un buscador de entrada de ruta, el sistema de importación siempre llamará a ``find_loader()`` en lugar de ``find_module()``.

source: ``find_module()`` and ``find_loader()`` have been removed.
es: Los métodos ``find_module()`` y ``find_loader()`` fueron eliminados.

source: Replacing the standard import system
es: Reemplazando el sistema de importación estándar

source: The most reliable mechanism for replacing the entire import system is to delete the default contents of :data:`sys.meta_path`, replacing them entirely with a custom meta path hook.
es: El mecanismo más confiable para reemplazar todo el sistema de importación es eliminar el contenido predeterminado de :data:`sys.meta_path`, sustituyéndolos por completo por un enlace de meta path personalizado.

source: If it is acceptable to only alter the behaviour of import statements without affecting other APIs that access the import system, then replacing the builtin :func:`__import__` function may be sufficient. This technique may also be employed at the module level to only alter the behaviour of import statements within that module.
es: Si es aceptable alterar únicamente el comportamiento de las declaraciones de importación sin afectar a otras API que acceden al sistema de importación, puede ser suficiente reemplazar la función incorporada :func:`__import__`. Esta técnica también puede emplearse a nivel de módulo para alterar únicamente el comportamiento de las declaraciones de importación dentro de ese módulo.

source: To selectively prevent the import of some modules from a hook early on the meta path (rather than disabling the standard import system entirely), it is sufficient to raise :exc:`ModuleNotFoundError` directly from :meth:`~importlib.abc.MetaPathFinder.find_spec` instead of returning ``None``. The latter indicates that the meta path search should continue, while raising an exception terminates it immediately.
es: Para evitar selectivamente la importación de algunos módulos de un enlace al principio de la meta path (en lugar de deshabilitar completamente el sistema de importación estándar), es suficiente elevar :exc:`ModuleNotFoundError` directamente desde :meth:`~importlib.abc.MetaPathFinder.find_spec` en lugar de retornar ``None``. Este último indica que la búsqueda de meta path debe continuar, mientras que la generación de una excepción termina inmediatamente.

source: Package Relative Imports
es: Paquete Importaciones relativas

source: Relative imports use leading dots. A single leading dot indicates a relative import, starting with the current package. Two or more leading dots indicate a relative import to the parent(s) of the current package, one level per dot after the first. For example, given the following package layout::
es: Las importaciones relativas utilizan puntos iniciales. Un único punto inicial indica una importación relativa, empezando por el paquete actual. Dos o más puntos iniciales indican una importación relativa a los elementos primarios del paquete actual, un nivel por punto después del primero. Por ejemplo, dado el siguiente diseño de paquete::

source: In either ``subpackage1/moduleX.py`` or ``subpackage1/__init__.py``, the following are valid relative imports::
es: En ``subpackage1/moduleX.py`` o ``subpackage1/__init__.py``, las siguientes son importaciones relativas válidas::

source: Absolute imports may use either the ``import <>`` or ``from <> import <>`` syntax, but relative imports may only use the second form; the reason for this is that::
es: Las importaciones absolutas pueden utilizar la sintaxis ``import <>`` o ``from <> import <>``, pero las importaciones relativas solo pueden usar el segundo formulario; la razón de esto es que:

source: should expose ``XXX.YYY.ZZZ`` as a usable expression, but .moduleY is not a valid expression.
es: debe exponer ``XXX. Yyy. ZZZ`` como una expresión utilizable, pero .moduleY no es una expresión válida.

source: Special considerations for __main__
es: Consideraciones especiales para __main__

source: The :mod:`__main__` module is a special case relative to Python's import system. As noted :ref:`elsewhere <programs>`, the ``__main__`` module is directly initialized at interpreter startup, much like :mod:`sys` and :mod:`builtins`. However, unlike those two, it doesn't strictly qualify as a built-in module. This is because the manner in which ``__main__`` is initialized depends on the flags and other options with which the interpreter is invoked.
es: El módulo :mod:`__main__` es un caso especial relativo al sistema de importación de Python. Como se señaló :ref:`elsewhere <programs>`, el módulo ``__main__`` se inicializa directamente al inicio del intérprete, al igual que :mod:`sys` y :mod:`builtins`. Sin embargo, a diferencia de esos dos, no califica estrictamente como un módulo integrado. Esto se debe a que la forma en que se inicializa ``__main__`` depende de las marcas y otras opciones con las que se invoca el intérprete.

source: Depending on how :mod:`__main__` is initialized, ``__main__.__spec__`` gets set appropriately or to ``None``.
es: Dependiendo de cómo se inicializa :mod:`__main__`, ``__main__.__spec__`` se establece correctamente o en ``None``.

source: When Python is started with the :option:`-m` option, ``__spec__`` is set to the module spec of the corresponding module or package. ``__spec__`` is also populated when the ``__main__`` module is loaded as part of executing a directory, zipfile or other :data:`sys.path` entry.
es: Cuando Python se inicia con la opción :option:`-m`, ``__spec__`` se establece en la especificación de módulo del módulo o paquete correspondiente. ``__spec__`` también se rellena cuando el módulo ``__main__`` se carga como parte de la ejecución de un directorio, zipfile u otro :data:`sys.path` entrada.

source: In :ref:`the remaining cases <using-on-interface-options>` ``__main__.__spec__`` is set to ``None``, as the code used to populate the :mod:`__main__` does not correspond directly with an importable module:
es: En :ref:`los casos restantes <using-on-interface-options>` ``__main__.__spec__`` se establece en ``None``, ya que el código utilizado para rellenar el :mod:`__main__` no se corresponde directamente con un módulo importable:

source: interactive prompt
es: mensaje interactivo

source: :option:`-c` option
es: opción :option:`-c`

source: running from stdin
es: ejecutando desde stdin

source: running directly from a source or bytecode file
es: que se ejecuta directamente desde un archivo de código fuente o de código de bytes

source: Note that ``__main__.__spec__`` is always ``None`` in the last case, *even if* the file could technically be imported directly as a module instead. Use the :option:`-m` switch if valid module metadata is desired in :mod:`__main__`.
es: Tenga en cuenta que ``__main__.__spec__`` siempre es ``None`` en el último caso, *incluso si* el archivo técnicamente podría importarse directamente como un módulo en su lugar. Utilice el modificador :option:`-m` si se desean metadatos de módulo válidos en :mod:`__main__`.

source: Note also that even when ``__main__`` corresponds with an importable module and ``__main__.__spec__`` is set accordingly, they're still considered *distinct* modules. This is due to the fact that blocks guarded by ``if __name__ == "__main__":`` checks only execute when the module is used to populate the ``__main__`` namespace, and not during normal import.
es: Tenga en cuenta también que incluso cuando ``__main__`` corresponde a un módulo importable y ``__main__.__spec__`` se establece en consecuencia, todavía se consideran módulos *distinct*. Esto se debe al hecho de que los bloques protegidos por las comprobaciones ``if __name__ == "__main__":`` solo se ejecutan cuando el módulo se utiliza para rellenar el espacio de nombres ``__main__``, y no durante la importación normal.

source: References
es: Referencias

source: The import machinery has evolved considerably since Python's early days. The original `specification for packages <https://www.python.org/doc/essays/packages/>`_ is still available to read, although some details have changed since the writing of that document.
es: La maquinaria de importación ha evolucionado considerablemente desde los primeros días de Python. La `especificación original para paquetes <https://www.python.org/doc/essays/packages/>`_ todavía está disponible para leer, aunque algunos detalles han cambiado desde la escritura de ese documento.

source: The original specification for :data:`sys.meta_path` was :pep:`302`, with subsequent extension in :pep:`420`.
es: La especificación original de :data:`sys.meta_path` era :pep:`302`, con posterior extensión en :pep:`420`.

source: :pep:`366` describes the addition of the ``__package__`` attribute for explicit relative imports in main modules.
es: :pep:`366` describe la adición del atributo ``__package__`` para las importaciones relativas explícitas en los módulos principales.

source: :pep:`328` introduced absolute and explicit relative imports and initially proposed ``__name__`` for semantics :pep:`366` would eventually specify for ``__package__``.
es: :pep:`328` introdujo importaciones relativas absolutas y explícitas e inicialmente propuestas ``__name__`` para la semántica :pep:`366` eventualmente especificaría para ``__package__``.

source: :pep:`338` defines executing modules as scripts.
es: :pep:`338` define la ejecución de módulos como scripts.

source: :pep:`451` adds the encapsulation of per-module import state in spec objects. It also off-loads most of the boilerplate responsibilities of loaders back onto the import machinery. These changes allow the deprecation of several APIs in the import system and also addition of new methods to finders and loaders.
es: :pep:`451` agrega la encapsulación del estado de importación por módulo en los objetos de especificación. También descargara la mayoría de las responsabilidades de los cargadores en la maquinaria de importación. Estos cambios permiten el desuso de varias API en el sistema de importación y también la adición de nuevos métodos a los buscadores y cargadores.

source: Footnotes
es: Notas al Pie de Pagina

source: See :class:`types.ModuleType`.
es: Véase :class:`types. ModuleType`.

source: The importlib implementation avoids using the return value directly. Instead, it gets the module object by looking the module name up in :data:`sys.modules`. The indirect effect of this is that an imported module may replace itself in :data:`sys.modules`. This is implementation-specific behavior that is not guaranteed to work in other Python implementations.
es: La implementación de importlib evita usar el valor retornado directamente. En su lugar, obtiene el objeto module buscando el nombre del módulo en :data:`sys.modules`. El efecto indirecto de esto es que un módulo importado puede sustituirse a sí mismo en :data:`sys.modules`. Este es un comportamiento específico de la implementación que no se garantiza que funcione en otras implementaciones de Python.

source: import machinery
es: maquinaria de importación

source: portion
es: porción

source: finder
es: buscador

source: hooks
es: ganchos
