Repository: python/python-docs-es
Catalog: reference/import.po
Languages: es

source: The import system
es: El sistema de importación

source: Python code in one :term:`module` gains access to the code in another module by the process of :term:`importing` it. The :keyword:`import` statement is the most common way of invoking the import machinery, but it is not the only way. Functions such as :func:`importlib.import_module` and built-in :func:`__import__` can also be used to invoke the import machinery.
es: El código Python en un :term:`módulo <module>` obtiene acceso al código en otro módulo por el proceso de :term:`importarlo <importing>`. La instrucción :keyword:`import` es la forma más común de invocar la maquinaria de importación, pero no es la única manera. Funciones como :func:`importlib.import_module` y built-in :func:`__import__` también se pueden utilizar para invocar la maquinaria de importación.

source: The :keyword:`import` statement combines two operations; it searches for the named module, then it binds the results of that search to a name in the local scope. The search operation of the :keyword:`!import` statement is defined as a call to the :func:`__import__` function, with the appropriate arguments. The return value of :func:`__import__` is used to perform the name binding operation of the :keyword:`!import` statement. See the :keyword:`!import` statement for the exact details of that name binding operation.
es: La instrucción :keyword:`import` combina dos operaciones; busca el módulo con nombre y, a continuación, enlaza los resultados de esa búsqueda a un nombre en el ámbito local. La operación de búsqueda de la instrucción :keyword:`!import` se define como una llamada a la función :func:`__import__`, con los argumentos adecuados. El valor retornado de :func:`__import__` se utiliza para realizar la operación de enlace de nombre de la instrucción :keyword:`!import`. Consulte la instrucción :keyword:`!import` para obtener los detalles exactos de esa operación de enlace de nombres.

source: A direct call to :func:`__import__` performs only the module search and, if found, the module creation operation. While certain side-effects may occur, such as the importing of parent packages, and the updating of various caches (including :data:`sys.modules`), only the :keyword:`import` statement performs a name binding operation.
es: Una llamada directa a :func:`__import__` realiza solo la búsqueda del módulo y, si se encuentra, la operación de creación del módulo. Aunque pueden producirse ciertos efectos secundarios, como la importación de paquetes primarios y la actualización de varias memorias caché (incluidas :data:`sys.modules`), solo la instrucción :keyword:`import` realiza una operación de enlace de nombres.

source: When an :keyword:`import` statement is executed, the standard builtin :func:`__import__` function is called. Other mechanisms for invoking the import system (such as :func:`importlib.import_module`) may choose to bypass :func:`__import__` and use their own solutions to implement import semantics.
es: Cuando se ejecuta una instrucción :keyword:`import`, se llama a la función estándar incorporada :func:`__import__`. Otros mecanismos para invocar el sistema de importación (como :func:`importlib.import_module`) pueden optar por omitir :func:`__import__` y utilizar sus propias soluciones para implementar la semántica de importación.

source: When a module is first imported, Python searches for the module and if found, it creates a module object [#fnmo]_, initializing it. If the named module cannot be found, a :exc:`ModuleNotFoundError` is raised. Python implements various strategies to search for the named module when the import machinery is invoked. These strategies can be modified and extended by using various hooks described in the sections below.
es: Cuando se importa un módulo por primera vez, Python busca el módulo y, si se encuentra, crea un objeto de módulo [#fnmo]_, inicializándolo. Si no se encuentra el módulo con nombre, se genera un :exc:`ModuleNotFoundError`. Python implementa varias estrategias para buscar el módulo con nombre cuando se invoca la maquinaria de importación. Estas estrategias se pueden modificar y ampliar mediante el uso de varios ganchos descritos en las secciones siguientes.

source: The import system has been updated to fully implement the second phase of :pep:`302`. There is no longer any implicit import machinery - the full import system is exposed through :data:`sys.meta_path`. In addition, native namespace package support has been implemented (see :pep:`420`).
es: El sistema de importación se ha actualizado para aplicar plenamente la segunda fase de :pep:`302`. Ya no hay ninguna maquinaria de importación implícita: todo el sistema de importación se expone a través de :data:`sys.meta_path`. Además, se ha implementado la compatibilidad con paquetes de espacio de nombres nativos (consulte :pep:`420`).

source: The :mod:`importlib` module provides a rich API for interacting with the import system. For example :func:`importlib.import_module` provides a recommended, simpler API than built-in :func:`__import__` for invoking the import machinery. Refer to the :mod:`importlib` library documentation for additional detail.
es: El módulo :mod:`importlib` proporciona una API enriquecida para interactuar con el sistema de importación. Por ejemplo :func:`importlib.import_module` proporciona una API recomendada y más sencilla que la integrada :func:`__import__` para invocar la maquinaria de importación. Consulte la documentación de la biblioteca :mod:`importlib` para obtener más detalles.

source: Packages
es: Paquetes

source: Python has only one type of module object, and all modules are of this type, regardless of whether the module is implemented in Python, C, or something else. To help organize modules and provide a naming hierarchy, Python has a concept of :term:`packages <package>`.
es: Python sólo tiene un tipo de objeto módulo, y todos los módulos son de este tipo, independientemente de si el módulo está implementado en Python, C, o en cualquier otro lenguaje. Para ayudar a organizar los módulos y proporcionar una jerarquía de nombres, Python tiene un concepto de :term:`paquete <package>`.

source: You can think of packages as the directories on a file system and modules as files within directories, but don't take this analogy too literally since packages and modules need not originate from the file system. For the purposes of this documentation, we'll use this convenient analogy of directories and files. Like file system directories, packages are organized hierarchically, and packages may themselves contain subpackages, as well as regular modules.
es: Puedes pensar en los paquetes como los directorios de un sistema de archivos y en los módulos como archivos dentro de los directorios, pero no te tomes esta analogía demasiado literalmente, ya que los paquetes y los módulos no tienen por qué originarse en el sistema de archivos. Para los propósitos de esta documentación, usaremos esta conveniente analogía de directorios y archivos. Al igual que los directorios del sistema de archivos, los paquetes están organizados de forma jerárquica, y los paquetes pueden contener subpaquetes, así como módulos regulares.

source: It's important to keep in mind that all packages are modules, but not all modules are packages. Or put another way, packages are just a special kind of module. Specifically, any module that contains a ``__path__`` attribute is considered a package.
es: Es importante tener en cuenta que todos los paquetes son módulos, pero no todos los módulos son paquetes. O dicho de otro modo, los paquetes son sólo un tipo especial de módulo. Específicamente, cualquier módulo que contenga un atributo ``__path__`` se considera un paquete.

source: All modules have a name. Subpackage names are separated from their parent package name by a dot, akin to Python's standard attribute access syntax. Thus you might have a package called :mod:`email`, which in turn has a subpackage called :mod:`email.mime` and a module within that subpackage called :mod:`email.mime.text`.
es: Todos los módulos tienen un nombre. Los nombres de los subpaquetes están separados de su nombre de paquete principal por un punto, similar a la sintaxis de acceso de atributo estándar de Python. Por lo tanto, podría tener un paquete llamado :mod:`email`, que a su vez tiene un subpaquete llamado :mod:`email.mime` y un módulo dentro de ese subpaquete llamado :mod:`email.mime.text`.

source: Regular packages
es: Paquetes regulares

source: Python defines two types of packages, :term:`regular packages <regular package>` and :term:`namespace packages <namespace package>`. Regular packages are traditional packages as they existed in Python 3.2 and earlier. A regular package is typically implemented as a directory containing an ``__init__.py`` file. When a regular package is imported, this ``__init__.py`` file is implicitly executed, and the objects it defines are bound to names in the package's namespace. The ``__init__.py`` file can contain the same Python code that any other module can contain, and Python will add some additional attributes to the module when it is imported.
es: Python define dos tipos de paquetes, :term:`paquetes regulares <regular package>` y :term:`paquetes de espacio de nombres <namespace package>`. Los paquetes regulares son los paquetes tradicionales tal y como existían en Python 3.2 y anteriores. Un paquete regular se implementa típicamente como un directorio que contiene un archivo ``init__.py``. Cuando se importa un paquete regular, este archivo ``__init__.py`` se ejecuta implícitamente, y los objetos que define están vinculados a nombres en el espacio de nombres del paquete. El archivo ``__init__.py`` puede contener el mismo código Python que puede contener cualquier otro módulo, y Python añadirá algunos atributos adicionales al módulo cuando se importe.

source: For example, the following file system layout defines a top level ``parent`` package with three subpackages::
es: Por ejemplo, la siguiente disposición del sistema de archivos define un paquete ``parent`` de nivel superior con tres subpaquetes::

source: Importing ``parent.one`` will implicitly execute ``parent/__init__.py`` and ``parent/one/__init__.py``. Subsequent imports of ``parent.two`` or ``parent.three`` will execute ``parent/two/__init__.py`` and ``parent/three/__init__.py`` respectively.
es: Importando ``parent.one`` se ejecutará implícitamente ``parent/__init__.py`` y ``parent/one/__init__.py``. La importación posterior de ``parent.two`` o ``parent.three`` ejecutará ``parent/two/__init__.py`` y ``parent/three/__init__.py`` respectivamente.

source: Namespace packages
es: Paquetes de espacio de nombres

source: A namespace package is a composite of various :term:`portions <portion>`, where each portion contributes a subpackage to the parent package. Portions may reside in different locations on the file system. Portions may also be found in zip files, on the network, or anywhere else that Python searches during import. Namespace packages may or may not correspond directly to objects on the file system; they may be virtual modules that have no concrete representation.
es: Un paquete de espacio de nombres es un compuesto de varias :term:`porciones <portion>`, donde cada porción contribuye con un subpaquete al paquete padre. Las porciones pueden residir en diferentes lugares del sistema de archivos. Las porciones también pueden encontrarse en archivos zip, en la red, o en cualquier otro lugar que Python busque durante la importación. Los paquetes de espacios de nombres pueden corresponder o no directamente a objetos del sistema de archivos; pueden ser módulos virtuales que no tienen una representación concreta.

source: Namespace packages do not use an ordinary list for their ``__path__`` attribute. They instead use a custom iterable type which will automatically perform a new search for package portions on the next import attempt within that package if the path of their parent package (or :data:`sys.path` for a top level package) changes.
es: Los paquetes de espacios de nombres no usan una lista ordinaria para su atributo ``__path__``. En su lugar utilizan un tipo iterable personalizado que realizará automáticamente una nueva búsqueda de porciones de paquete en el siguiente intento de importación dentro de ese paquete si la ruta de su paquete padre (o :data:`sys.path`` para un paquete de nivel superior) cambia.

source: With namespace packages, there is no ``parent/__init__.py`` file. In fact, there may be multiple ``parent`` directories found during import search, where each one is provided by a different portion. Thus ``parent/one`` may not be physically located next to ``parent/two``. In this case, Python will create a namespace package for the top-level ``parent`` package whenever it or one of its subpackages is imported.
es: Con los paquetes de espacio de nombres, no hay ningún archivo ``parent/__init__.py``. De hecho, puede haber varios directorios ``padre`` encontrados durante la búsqueda de importación, donde cada uno de ellos es proporcionado por una parte diferente. Por lo tanto, ``padre/one`` no puede estar físicamente situado junto a ``padre/two``. En este caso, Python creará un paquete de espacio de nombres para el paquete ``parent`` de nivel superior siempre que se importe él o uno de sus subpaquetes.

source: See also :pep:`420` for the namespace package specification.
es: Consulte también :pep:`420` para conocer la especificación del paquete de espacio de nombres.

source: Searching
es: Buscando

source: To begin the search, Python needs the :term:`fully qualified <qualified name>` name of the module (or package, but for the purposes of this discussion, the difference is immaterial) being imported. This name may come from various arguments to the :keyword:`import` statement, or from the parameters to the :func:`importlib.import_module` or :func:`__import__` functions.
es: Para comenzar la búsqueda, Python necesita el nombre :term:`totalmente calificado <qualified name>` del módulo (o paquete, pero para los fines de esta discusión, la diferencia es irrelevante) que se está importando. Este nombre puede provenir de varios argumentos a la instrucción :keyword:`import`, o de los parámetros de las funciones :func:`importlib.import_module` o :func:`__import__`.

source: This name will be used in various phases of the import search, and it may be the dotted path to a submodule, e.g. ``foo.bar.baz``. In this case, Python first tries to import ``foo``, then ``foo.bar``, and finally ``foo.bar.baz``. If any of the intermediate imports fail, a :exc:`ModuleNotFoundError` is raised.
es: Este nombre se utilizará en varias fases de la búsqueda de importación, y puede ser la ruta de acceso punteada a un submódulo, por ejemplo, ``foo.bar.baz``. En este caso, Python primero intenta importar ``foo``, luego ``foo.bar``, y finalmente ``foo.bar.baz``. Si se produce un error en cualquiera de las importaciones intermedias, se genera un :exc:`ModuleNotFoundError`.

source: The module cache
es: La caché del módulo

source: The first place checked during import search is :data:`sys.modules`. This mapping serves as a cache of all modules that have been previously imported, including the intermediate paths. So if ``foo.bar.baz`` was previously imported, :data:`sys.modules` will contain entries for ``foo``, ``foo.bar``, and ``foo.bar.baz``. Each key will have as its value the corresponding module object.
es: El primer lugar comprobado durante la búsqueda de importación es :data:`sys.modules`. Esta asignación sirve como caché de todos los módulos que se han importado previamente, incluidas las rutas intermedias. Por lo tanto, si ``foo.bar.baz`` se importó previamente, :data:`sys.modules` contendrá entradas para ``foo``, ``foo.bar``, y ``foo.bar.baz``. Cada clave tendrá como valor el objeto de módulo correspondiente.

source: During import, the module name is looked up in :data:`sys.modules` and if present, the associated value is the module satisfying the import, and the process completes. However, if the value is ``None``, then a :exc:`ModuleNotFoundError` is raised. If the module name is missing, Python will continue searching for the module.
es: Durante la importación, el nombre del módulo se busca en :data:`sys.modules` y si está presente, el valor asociado es el módulo que satisface la importación y el proceso se completa. Sin embargo, si el valor es ``None``, se genera un :exc:`ModuleNotFoundError`. Si falta el nombre del módulo, Python continuará buscando el módulo.

source: :data:`sys.modules` is writable. Deleting a key may not destroy the associated module (as other modules may hold references to it), but it will invalidate the cache entry for the named module, causing Python to search anew for the named module upon its next import. The key can also be assigned to ``None``, forcing the next import of the module to result in a :exc:`ModuleNotFoundError`.
es: :data:`sys.modules` se puede escribir. La eliminación de una clave no puede destruir el módulo asociado (ya que otros módulos pueden contener referencias a él), pero invalidará la entrada de caché para el módulo con nombre, lo que hará que Python busque de nuevo el módulo con nombre en su próxima importación. La clave también se puede asignar a ``None``, lo que obliga a la siguiente importación del módulo a dar como resultado un :exc:`ModuleNotFoundError`.

source: Beware though, as if you keep a reference to the module object, invalidate its cache entry in :data:`sys.modules`, and then re-import the named module, the two module objects will *not* be the same. By contrast, :func:`importlib.reload` will reuse the *same* module object, and simply reinitialise the module contents by rerunning the module's code.
es: Tenga cuidado, sin embargo, como si mantiene una referencia al objeto module, invalide su entrada de caché en :data:`sys.modules` y, a continuación, vuelva a importar el módulo con nombre, los dos objetos de módulo *no* serán los mismos. Por el contrario, :func:`importlib.reload` reutilizará el objeto de módulo *same* y simplemente reinicializará el contenido del módulo volviendo a ejecutar el código del módulo.

source: Finders and loaders
es: Buscadores y cargadores

source: If the named module is not found in :data:`sys.modules`, then Python's import protocol is invoked to find and load the module. This protocol consists of two conceptual objects, :term:`finders <finder>` and :term:`loaders <loader>`. A finder's job is to determine whether it can find the named module using whatever strategy it knows about. Objects that implement both of these interfaces are referred to as :term:`importers <importer>` - they return themselves when they find that they can load the requested module.
es: Si el módulo con nombre no se encuentra en :data:`sys.modules`, se invoca el protocolo de importación de Python para buscar y cargar el módulo. Este protocolo consta de dos objetos conceptuales, :term:`buscadores <finder>` y :term:`cargadores <loader>`. El trabajo de un buscador es determinar si puede encontrar el módulo con nombre utilizando cualquier estrategia que conozca. Los objetos que implementan ambas interfaces se conocen como :term:`importadores <importer>` se retornan a sí mismos cuando descubren que pueden cargar el módulo solicitado.

source: Python includes a number of default finders and importers. The first one knows how to locate built-in modules, and the second knows how to locate frozen modules. A third default finder searches an :term:`import path` for modules. The :term:`import path` is a list of locations that may name file system paths or zip files. It can also be extended to search for any locatable resource, such as those identified by URLs.
es: Python incluye una serie de buscadores e importadores predeterminados. El primero sabe cómo localizar módulos integrados, y el segundo sabe cómo localizar módulos congelados. Un tercer buscador predeterminado busca módulos en :term:`import path`. El :term:`import path` es una lista de ubicaciones que pueden nombrar rutas del sistema de archivos o archivos zip. También se puede ampliar para buscar cualquier recurso localizable, como los identificados por las direcciones URL.

source: The import machinery is extensible, so new finders can be added to extend the range and scope of module searching.
es: La maquinaria de importación es extensible, por lo que se pueden añadir nuevos buscadores para ampliar el alcance y el alcance de la búsqueda de módulos.

source: Finders do not actually load modules. If they can find the named module, they return a :dfn:`module spec`, an encapsulation of the module's import-related information, which the import machinery then uses when loading the module.
es: En realidad, los buscadores no cargan módulos. Si pueden encontrar el módulo con nombre, retornan un :dfn:`module spec`, una encapsulación de la información relacionada con la importación del módulo, que la maquinaria de importación utiliza al cargar el módulo.

source: The following sections describe the protocol for finders and loaders in more detail, including how you can create and register new ones to extend the import machinery.
es: En las secciones siguientes se describe el protocolo para buscadores y cargadores con más detalle, incluido cómo puede crear y registrar otros nuevos para ampliar la maquinaria de importación.

source: In previous versions of Python, finders returned :term:`loaders <loader>` directly, whereas now they return module specs which *contain* loaders. Loaders are still used during import but have fewer responsibilities.
es: En versiones anteriores de Python, los buscadores retornaban :term:`cargadores <loader>` directamente, mientras que ahora retornen especificaciones de módulo que *contienen* cargadores. Los cargadores todavía se utilizan durante la importación, pero tienen menos responsabilidades.

source: Import hooks
es: Ganchos de importación

source: The import machinery is designed to be extensible; the primary mechanism for this are the *import hooks*. There are two types of import hooks: *meta hooks* and *import path hooks*.
es: La maquinaria de importación está diseñada para ser extensible; el mecanismo principal para esto son los *ganchos de importación* (import hooks). Hay dos tipos de ganchos de importación: *meta hooks* (meta ganchos) y *import path hooks* (ganchos de ruta de acceso de importación).

source: Meta hooks are called at the start of import processing, before any other import processing has occurred, other than :data:`sys.modules` cache look up. This allows meta hooks to override :data:`sys.path` processing, frozen modules, or even built-in modules. Meta hooks are registered by adding new finder objects to :data:`sys.meta_path`, as described below.
es: Los meta ganchos se llaman al inicio del procesamiento de importación, antes de que se haya producido cualquier otro procesamiento de importación, que no sea búsqueda de caché de :data:`sys.modules`. Esto permite que los metaganchos reemplacen el procesamiento de :data:`sys.path`, módulos congelados o incluso módulos integrados. Los meta ganchos se registran agregando nuevos objetos de buscador a :data:`sys.meta_path`, como se describe a continuación.
