Repository: python/python-docs-es
Catalog: reference/import.po
Languages: es

source: Import path hooks are called as part of :data:`sys.path` (or ``package.__path__``) processing, at the point where their associated path item is encountered. Import path hooks are registered by adding new callables to :data:`sys.path_hooks` as described below.
es: Los ganchos de ruta de acceso de importación se invocan como parte del procesamiento :data:`sys.path` (o ``package.__path__``), en el punto donde se encuentra su elemento de ruta de acceso asociado. Los ganchos de ruta de acceso de importación se registran agregando nuevos invocables a :data:`sys.path_hooks` como se describe a continuación.

source: The meta path
es: La meta ruta (*path*)

source: When the named module is not found in :data:`sys.modules`, Python next searches :data:`sys.meta_path`, which contains a list of meta path finder objects. These finders are queried in order to see if they know how to handle the named module. Meta path finders must implement a method called :meth:`~importlib.abc.MetaPathFinder.find_spec()` which takes three arguments: a name, an import path, and (optionally) a target module. The meta path finder can use any strategy it wants to determine whether it can handle the named module or not.
es: Cuando el módulo con nombre no se encuentra en :data:`sys.modules`, Python busca a continuación :data:`sys.meta_path`, que contiene una lista de objetos buscadores de metarutas. Estos buscadores se consultan para ver si saben cómo manejar el módulo nombrado. Los buscadores de rutas de meta deben implementar un método llamado :meth:`~importlib.abc.MetaPathFinder.find_spec()` que toma tres argumentos: un nombre, una ruta de importación y (opcionalmente) un módulo de destino. El buscador de metarutas puede usar cualquier estrategia que desee para determinar si puede manejar el módulo con nombre o no.

source: If the meta path finder knows how to handle the named module, it returns a spec object. If it cannot handle the named module, it returns ``None``. If :data:`sys.meta_path` processing reaches the end of its list without returning a spec, then a :exc:`ModuleNotFoundError` is raised. Any other exceptions raised are simply propagated up, aborting the import process.
es: Si el buscador de metarutas sabe cómo controlar el módulo con nombre, retorna un objeto de especificación. Si no puede controlar el módulo con nombre, retorna ``None``. Si el procesamiento de :data:`sys.meta_path` llega al final de su lista sin retornar una especificación, se genera un :exc:`ModuleNotFoundError`. Cualquier otra excepción provocada simplemente se propaga hacia arriba, anulando el proceso de importación.

source: The :meth:`~importlib.abc.MetaPathFinder.find_spec()` method of meta path finders is called with two or three arguments. The first is the fully qualified name of the module being imported, for example ``foo.bar.baz``. The second argument is the path entries to use for the module search. For top-level modules, the second argument is ``None``, but for submodules or subpackages, the second argument is the value of the parent package's ``__path__`` attribute. If the appropriate ``__path__`` attribute cannot be accessed, a :exc:`ModuleNotFoundError` is raised. The third argument is an existing module object that will be the target of loading later. The import system passes in a target module only during reload.
es: El método de los buscadores de metarutas de :meth:`~importlib.abc.metapathFinder.find_spec()` se llama con dos o tres argumentos. El primero es el nombre completo del módulo que se está importando, por ejemplo ``foo.bar.baz``. El segundo argumento son las entradas de ruta de acceso que se utilizarán para la búsqueda de módulos. Para los módulos de nivel superior, el segundo argumento es ``None``, pero para submódulos o subpaquetes, el segundo argumento es el valor del atributo ``__path__`` del paquete primario. Si no se puede tener acceso al atributo ``__path__`` adecuado, se genera un :exc:`ModuleNotFoundError`. El tercer argumento es un objeto de módulo existente que será el destino de la carga más adelante. El sistema de importación pasa un módulo de destino solo durante la recarga.

source: The meta path may be traversed multiple times for a single import request. For example, assuming none of the modules involved has already been cached, importing ``foo.bar.baz`` will first perform a top level import, calling ``mpf.find_spec("foo", None, None)`` on each meta path finder (``mpf``). After ``foo`` has been imported, ``foo.bar`` will be imported by traversing the meta path a second time, calling ``mpf.find_spec("foo.bar", foo.__path__, None)``. Once ``foo.bar`` has been imported, the final traversal will call ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.
es: La metaruta se puede recorrer varias veces para una sola solicitud de importación. Por ejemplo, suponiendo que ninguno de los módulos implicados ya se haya almacenado en caché, la importación de ``foo.bar.baz`` realizará primero una importación de nivel superior, llamando a ``mpf.find_spec("foo", None, None)`` en cada buscador de metarutas (``mpf``). Después de importar ``foo`` , ``foo.bar`` se importará atravesando la meta ruta por segunda vez, llamando a ``mpf.find_spec("foo.bar", foo.__path__, None)``. Una vez importado ``foo.bar``, el recorrido final llamará a ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.

source: Some meta path finders only support top level imports. These importers will always return ``None`` when anything other than ``None`` is passed as the second argument.
es: Algunos buscadores de metarutas solo admiten importaciones de nivel superior. Estos importadores siempre retornarán ``None`` cuando se pase algo distinto de ``None`` como segundo argumento.

source: Python's default :data:`sys.meta_path` has three meta path finders, one that knows how to import built-in modules, one that knows how to import frozen modules, and one that knows how to import modules from an :term:`import path` (i.e. the :term:`path based finder`).
es: El valor predeterminado de Python :data:`sys.meta_path` tiene tres buscadores de metarutas, uno que sabe cómo importar módulos integrados, uno que sabe cómo importar módulos congelados y otro que sabe cómo importar módulos desde un :term:`import path` (es decir, el :term:`path based finder`).

source: ``find_module()`` has been removed. Use :meth:`find_spec` instead.
es: Se eliminó el método ``find_module()``. Utiliza el método :meth:`find_spec` en su lugar.

source: Loading
es: Cargando

source: If and when a module spec is found, the import machinery will use it (and the loader it contains) when loading the module. Here is an approximation of what happens during the loading portion of import::
es: Si se encuentra una especificación de módulo, la maquinaria de importación la utilizará (y el cargador que contiene) al cargar el módulo. Aquí está una aproximación de lo que sucede durante la porción de carga de la importación:

source: Note the following details:
es: Tenga en cuenta los siguientes detalles:

source: If there is an existing module object with the given name in :data:`sys.modules`, import will have already returned it.
es: Si hay un objeto de módulo existente con el nombre dado en :data:`sys.modules`, la importación ya lo habrá retornado.

source: The module will exist in :data:`sys.modules` before the loader executes the module code. This is crucial because the module code may (directly or indirectly) import itself; adding it to :data:`sys.modules` beforehand prevents unbounded recursion in the worst case and multiple loading in the best.
es: El módulo existirá en :data:`sys.modules` antes de que el cargador ejecute el código del módulo. Esto es crucial porque el código del módulo puede (directa o indirectamente) importarse a sí mismo; agregándolo a :data:`sys.modules` de antemano evita la recursividad sin límites en el peor de los casos y la carga múltiple en el mejor.

source: If loading fails, the failing module -- and only the failing module -- gets removed from :data:`sys.modules`. Any module already in the :data:`sys.modules` cache, and any module that was successfully loaded as a side-effect, must remain in the cache. This contrasts with reloading where even the failing module is left in :data:`sys.modules`.
es: Si se produce un error en la carga, el módulo con errores -- y solo el módulo con errores -- se elimina de :data:`sys.modules`. Cualquier módulo que ya esté en la caché de :data:`sys.modules` y cualquier módulo que se haya cargado correctamente como efecto secundario, debe permanecer en la memoria caché. Esto contrasta con la recarga donde incluso el módulo que falla se deja en :data:`sys.modules`.

source: After the module is created but before execution, the import machinery sets the import-related module attributes ("_init_module_attrs" in the pseudo-code example above), as summarized in a :ref:`later section <import-mod-attrs>`.
es: Después de crear el módulo pero antes de la ejecución, la maquinaria de importación establece los atributos del módulo relacionados con la importación ("_init_module_attrs" en el ejemplo de pseudocódigo anterior), como se resume en una :ref:`sección posterior <import-mod-attrs>`.

source: Module execution is the key moment of loading in which the module's namespace gets populated. Execution is entirely delegated to the loader, which gets to decide what gets populated and how.
es: La ejecución del módulo es el momento clave de la carga en el que se rellena el espacio de nombres del módulo. La ejecución se delega por completo en el cargador, lo que llega a decidir qué se rellena y cómo.

source: The module created during loading and passed to exec_module() may not be the one returned at the end of import [#fnlo]_.
es: El módulo creado durante la carga y pasado a exec_module() puede no ser el que se retorna al final de la importación [#fnlo]_.

source: The import system has taken over the boilerplate responsibilities of loaders. These were previously performed by the :meth:`importlib.abc.Loader.load_module` method.
es: El sistema de importación se ha hecho cargo de las responsabilidades reutilizables de los cargadores. Estos fueron realizados previamente por el método :meth:`importlib.abc.Loader.load_module`.

source: Loaders
es: Cargadores

source: Module loaders provide the critical function of loading: module execution. The import machinery calls the :meth:`importlib.abc.Loader.exec_module` method with a single argument, the module object to execute. Any value returned from :meth:`~importlib.abc.Loader.exec_module` is ignored.
es: Los cargadores de módulos proporcionan la función crítica de carga: ejecución del módulo. La maquinaria de importación llama al método :meth:`importlib.abc.Loader.exec_module` con un único argumento, el objeto module que se va a ejecutar. Se omite cualquier valor retornado de :meth:`~importlib.abc.Loader.exec_module`.

source: Loaders must satisfy the following requirements:
es: Los cargadores deben cumplir los siguientes requisitos:

source: If the module is a Python module (as opposed to a built-in module or a dynamically loaded extension), the loader should execute the module's code in the module's global name space (``module.__dict__``).
es: Si el módulo es un módulo Python (a diferencia de un módulo integrado o una extensión cargada dinámicamente), el cargador debe ejecutar el código del módulo en el espacio de nombres global del módulo (``module.__dict__``).

source: If the loader cannot execute the module, it should raise an :exc:`ImportError`, although any other exception raised during :meth:`~importlib.abc.Loader.exec_module` will be propagated.
es: Si el cargador no puede ejecutar el módulo, debe generar un :exc:`ImportError`, aunque se propagará cualquier otra excepción provocada durante :meth:`~importlib.abc.Loader.exec_module`.

source: In many cases, the finder and loader can be the same object; in such cases the :meth:`~importlib.abc.MetaPathFinder.find_spec` method would just return a spec with the loader set to ``self``.
es: En muchos casos, el buscador y el cargador pueden ser el mismo objeto; en tales casos, el método :meth:`~importlib.abc.MetaPathFinder.find_spec` simplemente retornaría una especificación con el cargador establecido en ``self``.

source: Module loaders may opt in to creating the module object during loading by implementing a :meth:`~importlib.abc.Loader.create_module` method. It takes one argument, the module spec, and returns the new module object to use during loading. ``create_module()`` does not need to set any attributes on the module object. If the method returns ``None``, the import machinery will create the new module itself.
es: Los cargadores de módulos pueden optar por crear el objeto de módulo durante la carga mediante la implementación de un método :meth:`~importlib.abc.Loader.create_module`. Toma un argumento, la especificación del módulo, y retorna el nuevo objeto de módulo que se usará durante la carga. ``create_module()`` no necesita establecer ningún atributo en el objeto module. Si el método retorna ``None``, la maquinaria de importación creará el nuevo módulo en sí.

source: The :meth:`~importlib.abc.Loader.create_module` method of loaders.
es: El método de cargadores :meth:`~importlib.abc.Loader.create_module`.

source: The :meth:`~importlib.abc.Loader.load_module` method was replaced by :meth:`~importlib.abc.Loader.exec_module` and the import machinery assumed all the boilerplate responsibilities of loading.
es: El método :meth:`~importlib.abc.Loader.load_module` fue reemplazado por :meth:`~importlib.abc.Loader.exec_module` y la maquinaria de importación asumió todas las responsabilidades reutilizables de la carga.

source: For compatibility with existing loaders, the import machinery will use the ``load_module()`` method of loaders if it exists and the loader does not also implement ``exec_module()``. However, ``load_module()`` has been deprecated and loaders should implement ``exec_module()`` instead.
es: Para la compatibilidad con los cargadores existentes, la maquinaria de importación utilizará el método de cargadores ``load_module()`` si existe y el cargador no implementa también ``exec_module()``. Sin embargo, ``load_module()`` ha quedado obsoleto y los cargadores deben implementar ``exec_module()`` en su lugar.

source: The ``load_module()`` method must implement all the boilerplate loading functionality described above in addition to executing the module. All the same constraints apply, with some additional clarification:
es: El método ``load_module()`` debe implementar toda la funcionalidad de carga reutilizable descrita anteriormente, además de ejecutar el módulo. Se aplican todas las mismas restricciones, con algunas aclaraciones adicionales:

source: If there is an existing module object with the given name in :data:`sys.modules`, the loader must use that existing module. (Otherwise, :func:`importlib.reload` will not work correctly.) If the named module does not exist in :data:`sys.modules`, the loader must create a new module object and add it to :data:`sys.modules`.
es: Si hay un objeto de módulo existente con el nombre dado en :data:`sys.modules`, el cargador debe utilizar ese módulo existente. (De lo contrario, :func:`importlib.reload` no funcionará correctamente.) Si el módulo con nombre no existe en :data:`sys.modules`, el cargador debe crear un nuevo objeto de módulo y agregarlo a :data:`sys.modules`.

source: The module *must* exist in :data:`sys.modules` before the loader executes the module code, to prevent unbounded recursion or multiple loading.
es: El módulo *debe* existir en :data:`sys.modules` antes de que el cargador ejecute el código del módulo, para evitar la recursividad sin límites o la carga múltiple.

source: If loading fails, the loader must remove any modules it has inserted into :data:`sys.modules`, but it must remove **only** the failing module(s), and only if the loader itself has loaded the module(s) explicitly.
es: Si se produce un error en la carga, el cargador debe quitar los módulos que ha insertado en :data:`sys.modules`, pero debe quitar **solo** los módulos con errores, y solo si el propio cargador ha cargado los módulos explícitamente.

source: A :exc:`DeprecationWarning` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
es: A :exc:`DeprecationWarning` se genera cuando se define ``exec_module()`` pero ``create_module()`` no lo es.

source: An :exc:`ImportError` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
es: Un :exc:`ImportError` se genera cuando ``exec_module()`` está definido, pero ``create_module()`` no lo es.

source: Use of ``load_module()`` will raise :exc:`ImportWarning`.
es: El uso de ``load_module()`` lanzará :exc:`ImportWarning`.

source: Submodules
es: Submódulos

source: When a submodule is loaded using any mechanism (e.g. ``importlib`` APIs, the ``import`` or ``import-from`` statements, or built-in ``__import__()``) a binding is placed in the parent module's namespace to the submodule object. For example, if package ``spam`` has a submodule ``foo``, after importing ``spam.foo``, ``spam`` will have an attribute ``foo`` which is bound to the submodule. Let's say you have the following directory structure::
es: Cuando se carga un submódulo mediante cualquier mecanismo (por ejemplo, API ``importlib``, las instrucciones ``import`` o ``import-from``, o ``__import__()``) integradas, se coloca un enlace en el espacio de nombres del módulo primario al objeto submodule. Por ejemplo, si el paquete ``spam`` tiene un submódulo ``foo``, después de importar ``spam.foo``, ``spam`` tendrá un atributo ``foo`` que está enlazado al submódulo. Supongamos que tiene la siguiente estructura de directorios:

source: and ``spam/__init__.py`` has the following line in it::
es: y ``spam/__init__.py`` tiene la siguiente línea::

source: then executing the following puts name bindings for ``foo`` and ``Foo`` in the ``spam`` module::
es: a continuación, la ejecución de lo siguiente pone un nombre vinculante para ``foo`` y ``Foo`` en el módulo ``spam``::

source: Given Python's familiar name binding rules this might seem surprising, but it's actually a fundamental feature of the import system. The invariant holding is that if you have ``sys.modules['spam']`` and ``sys.modules['spam.foo']`` (as you would after the above import), the latter must appear as the ``foo`` attribute of the former.
es: Dadas las reglas de enlace de nombres familiares de Python, esto puede parecer sorprendente, pero en realidad es una característica fundamental del sistema de importación. La retención invariable es que si tiene ``sys.modules[`spam`]`` y ``sys.modules[`spam.foo`]`` (como lo haría después de la importación anterior), este último debe aparecer como el atributo ``foo`` de la primera.

source: Module spec
es: Especificaciones del módulo

source: The import machinery uses a variety of information about each module during import, especially before loading. Most of the information is common to all modules. The purpose of a module's spec is to encapsulate this import-related information on a per-module basis.
es: La maquinaria de importación utiliza una variedad de información sobre cada módulo durante la importación, especialmente antes de la carga. La mayor parte de la información es común a todos los módulos. El propósito de las especificaciones de un módulo es encapsular esta información relacionada con la importación por módulo.

source: Using a spec during import allows state to be transferred between import system components, e.g. between the finder that creates the module spec and the loader that executes it. Most importantly, it allows the import machinery to perform the boilerplate operations of loading, whereas without a module spec the loader had that responsibility.
es: El uso de una especificación durante la importación permite transferir el estado entre los componentes del sistema de importación, por ejemplo, entre el buscador que crea la especificación del módulo y el cargador que la ejecuta. Lo más importante es que permite a la maquinaria de importación realizar las operaciones de caldera de carga, mientras que sin una especificación de módulo el cargador tenía esa responsabilidad.

source: The module's spec is exposed as the ``__spec__`` attribute on a module object. See :class:`~importlib.machinery.ModuleSpec` for details on the contents of the module spec.
es: La especificación del módulo se expone como el atributo ``__spec__`` en un objeto de módulo. Consulte :class:`~importlib.machinery.ModuleSpec` para obtener más información sobre el contenido de la especificación del módulo.

source: Import-related module attributes
es: Atributos de módulo relacionados con la importación

source: The import machinery fills in these attributes on each module object during loading, based on the module's spec, before the loader executes the module.
es: La máquina de importación rellena estos atributos en cada objeto de módulo durante la carga, en función de las especificaciones del módulo, antes de que el cargador ejecute el módulo.

source: It is **strongly** recommended that you rely on :attr:`__spec__` and its attributes instead of any of the other individual attributes listed below.
es: Es **altamente** recomendado utilizar :attr:`__spec__` y sus atributos en lugar de cualquiera de los otros atributos individuales listados abajo.

source: The ``__name__`` attribute must be set to the fully qualified name of the module. This name is used to uniquely identify the module in the import system.
es: El atributo ``__name__`` debe establecerse en el nombre completo del módulo. Este nombre se utiliza para identificar de forma exclusiva el módulo en el sistema de importación.

source: The ``__loader__`` attribute must be set to the loader object that the import machinery used when loading the module. This is mostly for introspection, but can be used for additional loader-specific functionality, for example getting data associated with a loader.
es: El atributo ``__loader__`` debe establecerse en el objeto de cargador que utilizó la máquina de importación al cargar el módulo. Esto es principalmente para la introspección, pero se puede utilizar para la funcionalidad específica del cargador adicional, por ejemplo, obtener datos asociados con un cargador.

source: It is **strongly** recommended that you rely on :attr:`__spec__` instead instead of this attribute.
es: Es **altamente** recomendado utilizar :attr:`__spec__` en lugar de este atributo.

source: The value of ``__loader__`` is expected to be the same as ``__spec__.loader``. The use of ``__loader__`` is deprecated and slated for removal in Python 3.14.
es: Se espera que el valor de ``__loader__`` sea el mismo que el de ``__spec__.loader``. Es uso de ``__loader__`` es obsoleto y será eliminado en Python 3.14.

source: The value of ``__package__`` is expected to be the same as ``__spec__.parent``.
es: Se espera que el valor de ``__package__`` sea el mismo que ``__spec__.parent``.

source: :exc:`ImportWarning` is raised if import falls back to ``__package__`` instead of :attr:`~importlib.machinery.ModuleSpec.parent`.
es: Se genera un :exc:`ImportWarning` si el módulo importado recurre a ``__package__`` en lugar de a :attr:`~importlib.machinery.ModuleSpec.parent`.

source: Raise :exc:`DeprecationWarning` instead of :exc:`ImportWarning` when falling back to ``__package__``.
es: Se genera :exc:`DeprecationWarning` en lugar de :exc:`ImportWarning` cuando recurre a ``__package__``.
