Repository: python/python-docs-es
Catalog: reference/introduction.po
Languages: es

source: Introduction
es: Introducción

source: This reference manual describes the Python programming language. It is not intended as a tutorial.
es: Este manual de referencia describe el lenguaje de programación Python. No pretende ser un tutorial.

source: While I am trying to be as precise as possible, I chose to use English rather than formal specifications for everything except syntax and lexical analysis. This should make the document more understandable to the average reader, but will leave room for ambiguities. Consequently, if you were coming from Mars and tried to re-implement Python from this document alone, you might have to guess things and in fact you would probably end up implementing quite a different language. On the other hand, if you are using Python and wonder what the precise rules about a particular area of the language are, you should definitely be able to find them here. If you would like to see a more formal definition of the language, maybe you could volunteer your time --- or invent a cloning machine :-).
es: Aunque intento ser lo más preciso posible, he optado por utilizar el Español (N. de T.: del original en inglés \"I chose to use English\")" en lugar de especificaciones formales para todo, excepto para la sintaxis y el análisis léxico. Esto debería hacer el documento más comprensible para el lector medio, pero dejará espacio para ambigüedades. En consecuencia, si vienes de Marte y tratas de re implementar Python sólo a partir de este documento, puede que tengas que adivinar cosas y, de hecho, probablemente acabarías implementando un lenguaje bastante diferente. Por otro lado, si estás usando Python y te preguntas cuáles son las reglas precisas sobre un área particular del lenguaje, deberías poder encontrarlas aquí. Si te gustaría ver una definición más formal del lenguaje, quizás podrías ofrecer tu tiempo --- o inventar una máquina clonadora :-).

source: It is dangerous to add too many implementation details to a language reference document --- the implementation may change, and other implementations of the same language may work differently. On the other hand, CPython is the one Python implementation in widespread use (although alternate implementations continue to gain support), and its particular quirks are sometimes worth being mentioned, especially where the implementation imposes additional limitations. Therefore, you'll find short "implementation notes" sprinkled throughout the text.
es: Es peligroso añadir muchos detalles de implementación en un documento de referencia: la implementación puede cambiar y otras implementaciones del lenguaje pueden funcionar de forma diferente. Por otro lado, CPython es la implementación de Python más usada (aunque implementaciones alternativas están ganando soporte), y es importante mencionar sus detalles particulares especialmente donde la implementación impone limitaciones adicionales. Por lo tanto, encontrarás pequeñas "notas sobre la implementación" repartidas por todo el texto.

source: Every Python implementation comes with a number of built-in and standard modules. These are documented in :ref:`library-index`. A few built-in modules are mentioned when they interact in a significant way with the language definition.
es: Cada implementación de Python viene con un número de módulos estándar incorporados. Éstos están documentados en :ref:`library-index`. Unos pocos de estos módulos son citados cuando interactúan de forma significativa con la definición del lenguaje.

source: Alternate Implementations
es: Implementaciones alternativas

source: Though there is one Python implementation which is by far the most popular, there are some alternate implementations which are of particular interest to different audiences.
es: Aunque hay una implementación de Python que es, de lejos, la más popular, hay otras implementaciones alternativas que pueden ser de particular interés para diferentes audiencias.

source: Known implementations include:
es: Las implementaciones conocidas incluyen:

source: This is the original and most-maintained implementation of Python, written in C. New language features generally appear here first.
es: Es la implementación original, y la más mantenida, de Python y está escrita en C. Las nuevas características del lenguaje normalmente aparecen primero aquí.

source: Python implemented in Java. This implementation can be used as a scripting language for Java applications, or can be used to create applications using the Java class libraries. It is also often used to create tests for Java libraries. More information can be found at `the Jython website <https://www.jython.org/>`_.
es: Python implementado en Java. Esta implementación puede utilizarse como lenguaje de scripting para aplicaciones Java, o puede utilizarse para crear aplicaciones utilizando las bibliotecas de clases Java. También se utiliza a menudo para crear pruebas para bibliotecas Java. Puede encontrar más información en `the Jython website <https://www.jython.org/>`_.

source: Python for .NET
es: Python para .NET

source: This implementation actually uses the CPython implementation, but is a managed .NET application and makes .NET libraries available. It was created by Brian Lloyd. For more information, see the `Python for .NET home page <https://pythonnet.github.io/>`_.
es: Esta implementación, de hecho, usa la implementación CPython, pero es una aplicación .NET gestionada y usa librerías .NET. Ha sido creada por Brian Lloyd. Para más información ir al `sitio web de Python for .NET <https://pythonnet.github.io/>`_.

source: An alternate Python for .NET. Unlike Python.NET, this is a complete Python implementation that generates IL, and compiles Python code directly to .NET assemblies. It was created by Jim Hugunin, the original creator of Jython. For more information, see `the IronPython website <https://ironpython.net/>`_.
es: Una alternativa de Python para .NET. A diferencia de Python.NET, esta es una implementación completa de Python que genera IL, y compila código Python directamente a ensamblados .NET. Fue creado por Jim Hugunin, el creador original de Jython. Para más información, consulte `el sitio web de IronPython <https://ironpython.net/>`_.

source: An implementation of Python written completely in Python. It supports several advanced features not found in other implementations like stackless support and a Just in Time compiler. One of the goals of the project is to encourage experimentation with the language itself by making it easier to modify the interpreter (since it is written in Python). Additional information is available on `the PyPy project's home page <https://www.pypy.org/>`_.
es: Una implementación de Python escrita completamente en Python. Soporta varias características avanzadas que no se encuentran en otras implementaciones como soporte stackless y un compilador Just in Time. Uno de los objetivos del proyecto es fomentar la experimentación con el propio lenguaje facilitando la modificación del intérprete (ya que está escrito en Python). Puede encontrar más información en la página principal del proyecto 'PyPy <https://www.pypy.org/>_'

source: Each of these implementations varies in some way from the language as documented in this manual, or introduces specific information beyond what's covered in the standard Python documentation. Please refer to the implementation-specific documentation to determine what else you need to know about the specific implementation you're using.
es: Cada una de estas implementaciones varía de una forma u otra del lenguaje tal y como está documentado en este manual, o introduce información específica más allá de lo cubierto por la documentación estándar de Python. Por favor, consulte la documentación específica de cada implementación para saber qué tienes que saber acerca de la implementación específica que uses.

source: Notation
es: Notación

source: The descriptions of lexical analysis and syntax use a modified BNF grammar notation. This uses the following style of definition:
es: Las descripciones del análisis léxico y sintáctico usan una notación gramatical BNF modificada. De tal forma, utilizan el siguiente estilo de definición:

source: The first line says that a ``name`` is an ``lc_letter`` followed by a sequence of zero or more ``lc_letter``\ s and underscores. An ``lc_letter`` in turn is any of the single characters ``'a'`` through ``'z'``. (This rule is actually adhered to for the names defined in lexical and grammar rules in this document.)
es: La primera línea dice que un ``name`` es una ``lc_letter`` seguida de una secuencia de cero o más ``lc_letter``\s y guiones bajos. Una ``lc_letter`` es, a su vez, cualquiera de los caracteres de la ``'a'`` a la ``'z'``. (Esta regla se cumple realmente para los nombres definidos en las reglas léxicas y gramaticales en este documento.)

source: Each rule begins with a name (which is the name defined by the rule) and ``::=``. A vertical bar (``|``) is used to separate alternatives; it is the least binding operator in this notation. A star (``*``) means zero or more repetitions of the preceding item; likewise, a plus (``+``) means one or more repetitions, and a phrase enclosed in square brackets (``[ ]``) means zero or one occurrences (in other words, the enclosed phrase is optional). The ``*`` and ``+`` operators bind as tightly as possible; parentheses are used for grouping. Literal strings are enclosed in quotes. White space is only meaningful to separate tokens. Rules are normally contained on a single line; rules with many alternatives may be formatted alternatively with each line after the first beginning with a vertical bar.
es: Cada regla empieza con un nombre (que es el nombre definido por la regla) y ``::=``. Una barra vertical (``|``) se usa para separar alternativas; es el operador menos vinculante en esta notación. Un asterisco (``*``) significa cero o más repeticiones del elemento anterior; del mismo modo, un signo más (``+``) significa una o más repeticiones, y una frase entre corchetes (``[]``) significa cero o una ocurrencia (en otras palabras, la frase adjunta es opcional). Los operadores ``*`` y ``+`` se vinculan lo más firmemente posible; los paréntesis se usan para agrupar. Las cadenas de caracteres literales están entre comillas. El espacio en blanco sólo es útil para separar tokens. Las reglas normalmente están contenidas en una sola línea; las reglas con varias alternativas se pueden formatear, de forma alternativa, con una barra vertical con cada línea después del primer comienzo.

source: In lexical definitions (as the example above), two more conventions are used: Two literal characters separated by three dots mean a choice of any single character in the given (inclusive) range of ASCII characters. A phrase between angular brackets (``<...>``) gives an informal description of the symbol defined; e.g., this could be used to describe the notion of 'control character' if needed.
es: En las definiciones léxicas (como el ejemplo anterior), se utilizan dos convenciones más: Dos caracteres literales separados por tres puntos significan que se puede elegir cualquier carácter de la gama dada (inclusiva) de caracteres ASCII. Una frase entre corchetes angulares (``<...>``) ofrece una descripción informal del símbolo definido; por ejemplo, podría utilizarse para describir la noción de "carácter de control" si fuera necesario.

source: Even though the notation used is almost the same, there is a big difference between the meaning of lexical and syntactic definitions: a lexical definition operates on the individual characters of the input source, while a syntax definition operates on the stream of tokens generated by the lexical analysis. All uses of BNF in the next chapter ("Lexical Analysis") are lexical definitions; uses in subsequent chapters are syntactic definitions.
es: Aunque la notación utilizada es casi la misma, hay una gran diferencia entre el significado de las definiciones léxicas y sintácticas: una definición léxica opera sobre los caracteres individuales de la fuente de entrada, mientras que una definición sintáctica opera sobre el flujo de tokens generado por el análisis léxico. Todos los usos de BNF en el próximo capítulo (\"Análisis léxico\") son definiciones léxicas; los usos en los capítulos siguientes son definiciones sintácticas.
