Repository: python/python-docs-es
Catalog: reference/lexical_analysis.po
Languages: es

source: Lexical analysis
es: Análisis léxico

source: A Python program is read by a *parser*. Input to the parser is a stream of *tokens*, generated by the *lexical analyzer*. This chapter describes how the lexical analyzer breaks a file into tokens.
es: Un programa de Python es leído por un *parser* (analizador sintáctico). Los datos introducidos en el analizador son un flujo de *tokens*, generados por el *analizador léxico*. Este capítulo describe cómo el analizador léxico desglosa un archivo en tokens.

source: Python reads program text as Unicode code points; the encoding of a source file can be given by an encoding declaration and defaults to UTF-8, see :pep:`3120` for details. If the source file cannot be decoded, a :exc:`SyntaxError` is raised.
es: Python lee el texto del programa como puntos de código Unicode; la codificación de un archivo fuente puede ser dada por una declaración de codificación y por defecto es UTF-8, ver :pep:`3120` para más detalles. Si el archivo fuente no puede ser decodificado, se genera un :exc:`SyntaxError`.

source: Line structure
es: Estructura de línea

source: A Python program is divided into a number of *logical lines*.
es: Un programa Python se divide en un número de *líneas lógicas*.

source: Logical lines
es: Líneas lógicas

source: The end of a logical line is represented by the token NEWLINE. Statements cannot cross logical line boundaries except where NEWLINE is allowed by the syntax (e.g., between statements in compound statements). A logical line is constructed from one or more *physical lines* by following the explicit or implicit *line joining* rules.
es: El final de una línea lógica está representado por el token NEWLINE (nueva línea). Las declaraciones no pueden cruzar los límites de la línea lógica, excepto cuando la sintaxis permite la utilización de NEWLINE (por ejemplo, entre declaraciones en declaraciones compuestas). Una línea lógica se construye a partir de una o más *líneas físicas* siguiendo las reglas explícitas o implícitas de *unión de líneas*.

source: Physical lines
es: Líneas físicas

source: A physical line is a sequence of characters terminated by an end-of-line sequence. In source files and strings, any of the standard platform line termination sequences can be used - the Unix form using ASCII LF (linefeed), the Windows form using the ASCII sequence CR LF (return followed by linefeed), or the old Macintosh form using the ASCII CR (return) character. All of these forms can be used equally, regardless of platform. The end of input also serves as an implicit terminator for the final physical line.
es: Una línea física es una secuencia de caracteres terminada por una secuencia de final de línea. En los archivos fuente y las cadenas, se puede utilizar cualquiera de las secuencias de terminación de línea de la plataforma estándar: el formulario Unix que utiliza ASCII LF (salto de línea, por el inglés *linefeed*), el formulario Windows que utiliza la secuencia ASCII CR LF (retorno seguido de salto de línea), o el antiguo formulario Macintosh que utiliza el carácter ASCII CR (retorno). Todas estas formas pueden ser utilizadas por igual, independientemente de la plataforma. El final de la introducción de datos también sirve como un terminador implícito para la línea física final.

source: When embedding Python, source code strings should be passed to Python APIs using the standard C conventions for newline characters (the ``\n`` character, representing ASCII LF, is the line terminator).
es: Al incrustar Python, las cadenas de código fuente deben ser pasadas a las APIs de Python usando las convenciones estándar de C para los caracteres de nueva línea (el carácter ``\n``, que representa ASCII LF, es el terminador de línea).

source: Comments
es: Comentarios

source: A comment starts with a hash character (``#``) that is not part of a string literal, and ends at the end of the physical line. A comment signifies the end of the logical line unless the implicit line joining rules are invoked. Comments are ignored by the syntax.
es: Un comentario comienza con un carácter de almohadilla (``#``) que no es parte de un literal de cadena, y termina al final de la línea física. Un comentario implica el final de la línea lógica, a menos que se invoque la regla implícita de unión de líneas. Los comentarios son ignorados por la sintaxis.

source: Encoding declarations
es: Declaración de Codificación

source: If a comment in the first or second line of the Python script matches the regular expression ``coding[=:]\s*([-\w.]+)``, this comment is processed as an encoding declaration; the first group of this expression names the encoding of the source code file. The encoding declaration must appear on a line of its own. If it is the second line, the first line must also be a comment-only line. The recommended forms of an encoding expression are ::
es: Si un comentario en la primera o segunda línea del script de Python coincide con la expresión regular ``coding[=:]\s*([-\w.]+)``, este comentario se procesa como una declaración de codificación; el primer grupo de esta expresión denomina la codificación del archivo de código fuente. La declaración de codificación debe aparecer en una línea propia. Si se trata de la segunda línea, la primera línea debe ser también una línea solamente de comentario. Las formas recomendadas de una expresión de codificación son ::

source: which is recognized also by GNU Emacs, and ::
es: que también es reconocido por GNU Emacs y ::

source: which is recognized by Bram Moolenaar's VIM.
es: que es reconocido por el VIM de Bram Moolenaar.

source: If no encoding declaration is found, the default encoding is UTF-8. In addition, if the first bytes of the file are the UTF-8 byte-order mark (``b'\xef\xbb\xbf'``), the declared file encoding is UTF-8 (this is supported, among others, by Microsoft's :program:`notepad`).
es: Si no se encuentra una declaración de codificación, la codificación por defecto es UTF-8. Además, si los primeros bytes del archivo son la marca de orden de bytes UTF-8 (``b'\xef\xbb\xbf'``), la codificación declarada del archivo es UTF-8 (esto está soportado, entre otros, por el programa :program:`notepad` de Microsoft).

source: If an encoding is declared, the encoding name must be recognized by Python. The encoding is used for all lexical analysis, including string literals, comments and identifiers.
es: Si se declara una codificación, el nombre de la codificación debe ser reconocido por Python. La codificación se utiliza para todos los análisis léxicos, incluidos los literales de cadena, los comentarios y los identificadores.

source: Explicit line joining
es: Unión explícita de líneas

source: Two or more physical lines may be joined into logical lines using backslash characters (``\``), as follows: when a physical line ends in a backslash that is not part of a string literal or comment, it is joined with the following forming a single logical line, deleting the backslash and the following end-of-line character. For example::
es: Dos o más líneas físicas pueden unirse en líneas lógicas utilizando caracteres de barra invertida (``\``), de la siguiente manera: cuando una línea física termina en una barra invertida que no es parte de literal de cadena o de un comentario, se une con la siguiente formando una sola línea lógica, borrando la barra invertida y el siguiente carácter de fin de línea. Por ejemplo::

source: A line ending in a backslash cannot carry a comment. A backslash does not continue a comment. A backslash does not continue a token except for string literals (i.e., tokens other than string literals cannot be split across physical lines using a backslash). A backslash is illegal elsewhere on a line outside a string literal.
es: Una línea que termina en una barra invertida no puede llevar un comentario. Una barra invertida no continúa un comentario. Una barra invertida no continúa un token excepto para los literales de la cadena (es decir, los tokens que no sean literales de la cadena no pueden ser divididos a través de líneas físicas usando una barra invertida). La barra invertida es ilegal en cualquier parte de una línea fuera del literal de la cadena.

source: Implicit line joining
es: Unión implícita de líneas

source: Expressions in parentheses, square brackets or curly braces can be split over more than one physical line without using backslashes. For example::
es: Las expresiones entre paréntesis, entre corchetes o entre rizos pueden dividirse en más de una línea física sin usar barras invertidas. Por ejemplo::

source: Implicitly continued lines can carry comments. The indentation of the continuation lines is not important. Blank continuation lines are allowed. There is no NEWLINE token between implicit continuation lines. Implicitly continued lines can also occur within triple-quoted strings (see below); in that case they cannot carry comments.
es: Las líneas continuas implícitas pueden llevar comentarios. La sangría de las líneas de continuación no es importante. Se permiten líneas de continuación en blanco. No hay ningún token NEWLINE (nueva línea) entre las líneas de continuación implícitas. Las líneas de continuación implícitas también pueden aparecer dentro de cadenas de triple comilla ( ver más adelante); en ese caso no pueden llevar comentarios.

source: Blank lines
es: Líneas en blanco

source: A logical line that contains only spaces, tabs, formfeeds and possibly a comment, is ignored (i.e., no NEWLINE token is generated). During interactive input of statements, handling of a blank line may differ depending on the implementation of the read-eval-print loop. In the standard interactive interpreter, an entirely blank logical line (i.e. one containing not even whitespace or a comment) terminates a multi-line statement.
es: Una línea lógica que contiene sólo espacios, tabulaciones, saltos de página y posiblemente un comentario, es ignorada (es decir, no se genera un símbolo de NEWLINE). Durante la introducción interactiva de declaraciones, el manejo de una línea en blanco puede variar dependiendo de la implementación del bucle de *read-eval-print* (lectura-evaluación-impresión). En el intérprete interactivo estándar, una línea lógica completamente en blanco (es decir, una que no contiene ni siquiera un espacio en blanco o un comentario) termina una declaración de varias líneas.

source: Indentation
es: Sangría

source: Leading whitespace (spaces and tabs) at the beginning of a logical line is used to compute the indentation level of the line, which in turn is used to determine the grouping of statements.
es: El espacio en blanco ( espacios y tabulaciones) al principio de una línea lógica se utiliza para calcular el nivel de sangría de la línea, que a su vez se utiliza para determinar la agrupación de las declaraciones.

source: Tabs are replaced (from left to right) by one to eight spaces such that the total number of characters up to and including the replacement is a multiple of eight (this is intended to be the same rule as used by Unix). The total number of spaces preceding the first non-blank character then determines the line's indentation. Indentation cannot be split over multiple physical lines using backslashes; the whitespace up to the first backslash determines the indentation.
es: Los tabuladores se sustituyen (de izquierda a derecha) por uno a ocho espacios, de manera que el número total de caracteres hasta el reemplazo inclusive es un múltiplo de ocho (se pretende que sea la misma regla que la utilizada por Unix). El número total de espacios que preceden al primer carácter no en blanco determina entonces la sangría de la línea. La sangría no puede dividirse en múltiples líneas físicas utilizando barras invertidas; el espacio en blanco hasta la primera barra invertida determina la sangría.

source: Indentation is rejected as inconsistent if a source file mixes tabs and spaces in a way that makes the meaning dependent on the worth of a tab in spaces; a :exc:`TabError` is raised in that case.
es: La indentación se rechaza como inconsistente si un archivo fuente mezcla tabulaciones y espacios de manera que el significado depende del valor de una tabulación en los espacios; un :exc:`TabError` se produce en ese caso.

source: **Cross-platform compatibility note:** because of the nature of text editors on non-UNIX platforms, it is unwise to use a mixture of spaces and tabs for the indentation in a single source file. It should also be noted that different platforms may explicitly limit the maximum indentation level.
es: **Nota de compatibilidad entre plataformas:** debido a la naturaleza de los editores de texto en plataformas que no sean UNIX, no es aconsejable utilizar una mezcla de espacios y tabuladores para la sangría en un solo archivo de origen. También debe tenerse en cuenta que las diferentes plataformas pueden limitar explícitamente el nivel máximo de sangría.

source: A formfeed character may be present at the start of the line; it will be ignored for the indentation calculations above. Formfeed characters occurring elsewhere in the leading whitespace have an undefined effect (for instance, they may reset the space count to zero).
es: Un carácter *formfeed* puede estar presente al comienzo de la línea; será ignorado para los cálculos de sangría anteriores. Los caracteres *formfeed* que aparecen en otras partes del espacio en blanco inicial tienen un efecto indefinido (por ejemplo, pueden poner a cero el recuento de espacio).

source: The indentation levels of consecutive lines are used to generate INDENT and DEDENT tokens, using a stack, as follows.
es: Los niveles de sangría de las líneas consecutivas se utilizan para generar tokens INDENT y DEDENT, utilizando una pila, de la siguiente manera.

source: Before the first line of the file is read, a single zero is pushed on the stack; this will never be popped off again. The numbers pushed on the stack will always be strictly increasing from bottom to top. At the beginning of each logical line, the line's indentation level is compared to the top of the stack. If it is equal, nothing happens. If it is larger, it is pushed on the stack, and one INDENT token is generated. If it is smaller, it *must* be one of the numbers occurring on the stack; all numbers on the stack that are larger are popped off, and for each number popped off a DEDENT token is generated. At the end of the file, a DEDENT token is generated for each number remaining on the stack that is larger than zero.
es: Antes de que se lea la primera línea del archivo, se empuja un solo cero en la pila; esto no volverá a saltar. Los números empujados en la pila siempre irán aumentando estrictamente de abajo hacia arriba. Al principio de cada línea lógica, el nivel de sangría de la línea se compara con la parte superior de la pila. Si es igual, no pasa nada. Si es mayor, se empuja en la pila, y se genera un token INDENT. Si es más pequeño, *debe* ser uno de los números de la pila; todos los números de la pila que son más grandes se sacan, y por cada número sacado se genera un token DEDENT. Al final del archivo, se genera un token DEDENT por cada número restante de la pila que sea mayor que cero.

source: Here is an example of a correctly (though confusingly) indented piece of Python code::
es: Aquí hay un ejemplo de un código de Python con una correcta (aunque no tan clara) sangría::

source: The following example shows various indentation errors::
es: El siguiente ejemplo muestra varios errores de sangría::

source: (Actually, the first three errors are detected by the parser; only the last error is found by the lexical analyzer --- the indentation of ``return r`` does not match a level popped off the stack.)
es: (En realidad, los tres primeros errores son detectados por el analizador; sólo el último error es encontrado por el analizador léxico --- la sangría de ``return r`` no coincide con un nivel sacado de la pila.)

source: Whitespace between tokens
es: Espacios en blanco entre tokens

source: Except at the beginning of a logical line or in string literals, the whitespace characters space, tab and formfeed can be used interchangeably to separate tokens. Whitespace is needed between two tokens only if their concatenation could otherwise be interpreted as a different token (e.g., ab is one token, but a b is two tokens).
es: A excepción del comienzo de una línea lógica o en los literales de cadenas, los caracteres de espacio en blanco, tabulación y formfeed pueden utilizarse indistintamente para separar tokens. Los espacios en blanco se necesitan entre dos tokens sólo si su concatenación podría interpretarse de otra manera como un token diferente (por ejemplo, ab es un token, pero a b corresponde a dos tokens).

source: Other tokens
es: Otros tokens

source: Besides NEWLINE, INDENT and DEDENT, the following categories of tokens exist: *identifiers*, *keywords*, *literals*, *operators*, and *delimiters*. Whitespace characters (other than line terminators, discussed earlier) are not tokens, but serve to delimit tokens. Where ambiguity exists, a token comprises the longest possible string that forms a legal token, when read from left to right.
es: Además de NEWLINE, INDENT y DEDENT, existen las siguientes categorías de fichas: *identifiers* (identificadores), *keywords* (palabras clave), *literals* (literales), *operators* (operadores) y *delimiters* (delimitadores). Los caracteres de espacio en blanco (distintos de los terminadores de línea, discutidos anteriormente) no son tokens, pero sirven para delimitarlos. En los casos en que exista ambigüedad, un token comprende la cadena más larga posible que forma un token legal cuando se lee de izquierda a derecha.

source: Identifiers and keywords
es: Identificadores y palabras clave

source: Identifiers (also referred to as *names*) are described by the following lexical definitions.
es: Los identificadores (también denominados *nombres*) se describen mediante las siguientes definiciones léxicas.

source: The syntax of identifiers in Python is based on the Unicode standard annex UAX-31, with elaboration and changes as defined below; see also :pep:`3131` for further details.
es: La sintaxis de los identificadores en Python se basa en el anexo estándar de Unicode UAX-31, con la elaboración y los cambios que se definen a continuación; ver también :pep:`3131` para más detalles.

source: Within the ASCII range (U+0001..U+007F), the valid characters for identifiers are the same as in Python 2.x: the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``.
es: Dentro del rango ASCII (U+0001..U+007F), los caracteres válidos para los identificadores son los mismos que en Python 2.x: las letras mayúsculas y minúsculas ``A`` hasta ``Z``, el guión bajo ``_`` y los dígitos ``0`` hasta ``9``, salvo el primer carácter.

source: Python 3.0 introduces additional characters from outside the ASCII range (see :pep:`3131`). For these characters, the classification uses the version of the Unicode Character Database as included in the :mod:`unicodedata` module.
es: Python 3.0 introduce caracteres adicionales fuera del rango ASCII (ver :pep:`3131`). Para estos caracteres, la clasificación utiliza la versión de la base de datos de caracteres Unicode incluida en el módulo :mod:`unicodedata`.

source: Identifiers are unlimited in length. Case is significant.
es: Los identificadores son de extensión ilimitada. Las mayúsculas y minúsculas son significativas.

source: The Unicode category codes mentioned above stand for:
es: Los códigos de la categoría Unicode mencionados anteriormente representan:

source: *Lu* - uppercase letters
es: *Lu* - letras mayúsculas

source: *Ll* - lowercase letters
es: *Ll* - letras minúsculas

source: *Lt* - titlecase letters
es: *Lt* - letras de *titlecase*

source: *Lm* - modifier letters
es: *Lm* - letras modificadoras

source: *Lo* - other letters
es: *Lo* - otras letras

source: *Nl* - letter numbers
es: *Nl* - números de letra

source: *Mn* - nonspacing marks
es: *Mn* - marcas sin separación

source: *Mc* - spacing combining marks
es: *Mc* - marcas de combinación de separación

source: *Nd* - decimal numbers
es: *Nd* - números decimales

source: *Pc* - connector punctuations
es: *Pc* - puntuaciones conectoras

source: *Other_ID_Start* - explicit list of characters in `PropList.txt <http://www.unicode.org/Public/12.1.0/ucd/PropList.txt>`_ to support backwards compatibility
es: *Other_ID_Start* - lista explícita de caracteres en `PropList.txt <http://www.unicode.org/Public/12.1.0/ucd/PropList.txt>`_ para apoyar la compatibilidad hacia atrás

source: *Other_ID_Continue* - likewise
es: *Other_ID_Continue* - Así mismo

source: All identifiers are converted into the normal form NFKC while parsing; comparison of identifiers is based on NFKC.
es: Todos los identificadores se convierten en la forma normal NFKC mientras se analizan; la comparación de los identificadores se basa en NFKC.

source: A non-normative HTML file listing all valid identifier characters for Unicode 4.1 can be found at https://www.dcl.hpi.uni-potsdam.de/home/loewis/table-3131.html.
es: En https://www.dcl.hpi.uni-potsdam.de/home/loewis/table-3131.html se puede encontrar un archivo HTML no normativo que enumera todos los caracteres de identificación válidos para Unicode 4.1.

source: Keywords
es: Palabras clave

source: The following identifiers are used as reserved words, or *keywords* of the language, and cannot be used as ordinary identifiers. They must be spelled exactly as written here:
es: Los siguientes identificadores se utilizan como palabras reservadas, o *palabras clave* del idioma, y no pueden utilizarse como identificadores ordinarios. Deben escribirse exactamente como están escritas aquí:

source: Reserved classes of identifiers
es: Clases reservadas de identificadores

source: Certain classes of identifiers (besides keywords) have special meanings. These classes are identified by the patterns of leading and trailing underscore characters:
es: Ciertas clases de identificadores (además de las palabras clave) tienen significados especiales. Estas clases se identifican por los patrones de los caracteres de guión bajo que van delante y detrás:

source: Not imported by ``from module import *``. The special identifier ``_`` is used in the interactive interpreter to store the result of the last evaluation; it is stored in the :mod:`builtins` module. When not in interactive mode, ``_`` has no special meaning and is not defined. See section :ref:`import`.
es: No importado por ``from module import *``. El identificador especial ``_`` se utiliza en el intérprete interactivo para almacenar el resultado de la última evaluación; se almacena en el módulo :mod:`builtins`. Cuando no está en modo interactivo, ``_`` no tiene un significado especial y no está definido. Ver la sección :ref:`import`.

source: The name ``_`` is often used in conjunction with internationalization; refer to the documentation for the :mod:`gettext` module for more information on this convention.
es: El nombre ``_`` se usa a menudo en conjunción con la internacionalización; consultar la documentación del módulo :mod:`gettext`` para más información sobre esta convención.
