Repository: python/python-docs-es
Catalog: reference/lexical_analysis.po
Languages: es

source: Floating point literals
es: Literales de punto flotante

source: Floating point literals are described by the following lexical definitions:
es: Los literales de punto flotante se describen en las siguientes definiciones léxicas:

source: Note that the integer and exponent parts are always interpreted using radix 10. For example, ``077e010`` is legal, and denotes the same number as ``77e10``. The allowed range of floating point literals is implementation-dependent. As in integer literals, underscores are supported for digit grouping.
es: Nótese que las partes enteras y exponentes siempre se interpretan usando el radix 10. Por ejemplo, ``077e010`` es legal, y denota el mismo número que ``77e10``. El rango permitido de los literales de punto flotante depende de la implementación. Al igual que en los literales enteros, se admiten guiones bajos para la agrupación de dígitos.

source: Some examples of floating point literals::
es: Algunos ejemplos de literales de punto flotante::

source: Imaginary literals
es: Literales imaginarios

source: Imaginary literals are described by the following lexical definitions:
es: Los literales imaginarios se describen en las siguientes definiciones léxicas:

source: An imaginary literal yields a complex number with a real part of 0.0. Complex numbers are represented as a pair of floating point numbers and have the same restrictions on their range. To create a complex number with a nonzero real part, add a floating point number to it, e.g., ``(3+4j)``. Some examples of imaginary literals::
es: Un literal imaginario da un número complejo con una parte real de 0.0. Los números complejos se representan como un par de números de punto flotante y tienen las mismas restricciones en su rango. Para crear un número complejo con una parte real distinta de cero, añada un número de punto flotante, por ejemplo, ``(3+4j)``. Algunos ejemplos de literales imaginarios::

source: Operators
es: Operadores

source: The following tokens are operators:
es: Los siguientes tokens son operadores:

source: Delimiters
es: Delimitadores

source: The following tokens serve as delimiters in the grammar:
es: Los siguientes tokens sirven como delimitadores en la gramática:

source: The period can also occur in floating-point and imaginary literals. A sequence of three periods has a special meaning as an ellipsis literal. The second half of the list, the augmented assignment operators, serve lexically as delimiters, but also perform an operation.
es: El punto también puede ocurrir en los literales de punto flotante e imaginarios. Una secuencia de tres períodos tiene un significado especial como un literal de elipsis. La segunda mitad de la lista, los operadores de asignación aumentada, sirven léxicamente como delimitadores, pero también realizan una operación.

source: The following printing ASCII characters have special meaning as part of other tokens or are otherwise significant to the lexical analyzer:
es: Los siguientes caracteres ASCII de impresión tienen un significado especial como parte de otros tokens o son de alguna manera significativos para el analizador léxico:

source: The following printing ASCII characters are not used in Python. Their occurrence outside string literals and comments is an unconditional error:
es: Los siguientes caracteres ASCII de impresión no se utilizan en Python. Su presencia fuera de las cadenas de caracteres y comentarios es un error incondicional:

source: Footnotes
es: Notas al pie de página
