Repository: python/python-docs-es
Catalog: reference/lexical_analysis.po
Languages: es

source: System-defined names, informally known as "dunder" names. These names are defined by the interpreter and its implementation (including the standard library). Current system names are discussed in the :ref:`specialnames` section and elsewhere. More will likely be defined in future versions of Python. *Any* use of ``__*__`` names, in any context, that does not follow explicitly documented use, is subject to breakage without warning.
es: Nombres definidos por el sistema, conocidos informalmente como nombres "*dunder*". Estos nombres son definidos por el intérprete y su aplicación (incluida la biblioteca estándar). Los nombres actuales del sistema se discuten en la sección :ref:`specialnames` y en otros lugares. Es probable que se definan más en futuras versiones de Python. *Cualquier* uso de nombres ``__*__``, en cualquier contexto, que no siga un uso explícitamente documentado, está sujeto a que se rompa sin previo aviso.

source: Class-private names. Names in this category, when used within the context of a class definition, are re-written to use a mangled form to help avoid name clashes between "private" attributes of base and derived classes. See section :ref:`atom-identifiers`.
es: Nombres de clase privada. Los nombres de esta categoría, cuando se utilizan en el contexto de una definición de clase, se reescriben para utilizar una forma desfigurada que ayude a evitar conflictos de nombres entre los atributos "privados" de las clases base y derivadas. Ver la sección :ref:`atom-identifiers`.

source: Literals
es: Literales

source: Literals are notations for constant values of some built-in types.
es: Los literales son notaciones para los valores constantes de algunos tipos incorporados.

source: String and Bytes literals
es: Literales de cadenas y bytes

source: String literals are described by the following lexical definitions:
es: Los literales de cadena se describen mediante las siguientes definiciones léxicas:

source: One syntactic restriction not indicated by these productions is that whitespace is not allowed between the :token:`stringprefix` or :token:`bytesprefix` and the rest of the literal. The source character set is defined by the encoding declaration; it is UTF-8 if no encoding declaration is given in the source file; see section :ref:`encodings`.
es: Una restricción sintáctica que no se indica en estas producciones es que no se permiten espacios en blanco entre el :token:`stringprefix` o :token:`bytesprefix` y el resto del literal. El conjunto de caracteres fuente está definido por la declaración de codificación; es UTF-8 si no se da una declaración de codificación en el archivo fuente; ver la sección :ref:`encodings`.

source: In plain English: Both types of literals can be enclosed in matching single quotes (``'``) or double quotes (``"``). They can also be enclosed in matching groups of three single or double quotes (these are generally referred to as *triple-quoted strings*). The backslash (``\``) character is used to escape characters that otherwise have a special meaning, such as newline, backslash itself, or the quote character.
es: En lenguaje claro y sencillo: ambos tipos de literales pueden ser encerrados entre comillas simples (``'``) o dobles (``"``). También pueden estar encerrados en grupos de tres comillas simples o dobles (a las que generalmente se les llama *cadenas de tres comillas*). El carácter de la barra inversa (``\``) se utiliza para escapar de los caracteres que de otra manera tienen un significado especial, como la línea nueva, la barra inversa en sí misma, o el carácter de comillas.

source: Bytes literals are always prefixed with ``'b'`` or ``'B'``; they produce an instance of the :class:`bytes` type instead of the :class:`str` type. They may only contain ASCII characters; bytes with a numeric value of 128 or greater must be expressed with escapes.
es: Los literales de bytes siempre se prefijan con ``'b'`` o ``'B'``; producen una instancia del tipo :class:`bytes` en lugar del tipo :class:`str`. Sólo pueden contener caracteres ASCII; los bytes con un valor numérico de 128 o mayor deben ser expresados con escapes.

source: Both string and bytes literals may optionally be prefixed with a letter ``'r'`` or ``'R'``; such strings are called :dfn:`raw strings` and treat backslashes as literal characters. As a result, in string literals, ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially. Given that Python 2.x's raw unicode literals behave differently than Python 3.x's the ``'ur'`` syntax is not supported.
es: Tanto los literales de cadena como de bytes pueden ser prefijados con una letra ``'r'`` o ``'R'``; tales cadenas se llaman :dfn:`raw strings` y consideran las barras inversas como caracteres literales. Como resultado, en las cadenas literales, los escapes de ``'\U'`` y ``'\u'`` en las cadenas sin procesar no son tratados de manera especial. Dado que los literales *raw* de unicode de Python 2.x se comportan de manera diferente a los de Python 3.x, la sintaxis de ``'ur'`` no está soportada.

source: The ``'rb'`` prefix of raw bytes literals has been added as a synonym of ``'br'``.
es: El prefijo ``'rb'`` de literales de bytes raw se ha añadido como sinónimo de ``'br'``.

source: Support for the unicode legacy literal (``u'value'``) was reintroduced to simplify the maintenance of dual Python 2.x and 3.x codebases. See :pep:`414` for more information.
es: Se reintrodujo el soporte para el legado unicode literal (``u'value'``) para simplificar el mantenimiento de las bases de código dual Python 2.x y 3.x. Ver :pep:`414` para más información.

source: A string literal with ``'f'`` or ``'F'`` in its prefix is a :dfn:`formatted string literal`; see :ref:`f-strings`. The ``'f'`` may be combined with ``'r'``, but not with ``'b'`` or ``'u'``, therefore raw formatted strings are possible, but formatted bytes literals are not.
es: Un literal de cadena con ``'f'`` o ``'F'`` en su prefijo es un :dfn:`formatted string literal`; ver :ref:`f-strings`. La ``'f'`` puede combinarse con la ``'r'``, pero no con la ``'b'`` o ``'u'``, por lo que las cadenas *raw* formateadas son posibles, pero los literales de bytes formateados no lo son.

source: In triple-quoted literals, unescaped newlines and quotes are allowed (and are retained), except that three unescaped quotes in a row terminate the literal. (A "quote" is the character used to open the literal, i.e. either ``'`` or ``"``.)
es: En los literales de triple cita, se permiten (y se retienen) nuevas líneas y citas no escapadas, excepto cuando tres citas no escapadas seguidas finalizan el literal. (Una "cita" es el carácter utilizado para abrir el literal, es decir, ya sea ``'`` o ``"``.)

source: Unless an ``'r'`` or ``'R'`` prefix is present, escape sequences in string and bytes literals are interpreted according to rules similar to those used by Standard C. The recognized escape sequences are:
es: A menos que un prefijo ``'r'`` o ``'R'`` esté presente, las secuencias de escape en literales de cadena y bytes se interpretan según reglas similares a las usadas por C estándar. Las secuencias de escape reconocidas son:

source: Escape Sequence
es: Secuencia de escape

source: Meaning
es: Significado

source: Notes
es: Notas

source: Backslash and newline ignored
es: Barra inversa y línea nueva ignoradas

source: Backslash (``\``)
es: Barra inversa (``\``)

source: Single quote (``'``)
es: Comilla simple (``'``)

source: Double quote (``"``)
es: Comilla doble (``"``)

source: ASCII Backspace (BS)
es: ASCII Retroceso (BS)

source: ASCII Carriage Return (CR)
es: ASCII Retorno de carro (CR)

source: ASCII Horizontal Tab (TAB)
es: ASCII Sangría horizontal (TAB)

source: ASCII Vertical Tab (VT)
es: ASCII Sangría vertical (VT)

source: Character with octal value *ooo*
es: Carácter con valor octal *ooo*

source: Character with hex value *hh*
es: Carácter con valor hexadecimal *hh*

source: Escape sequences only recognized in string literals are:
es: Las secuencias de escape que sólo se reconocen en los literales de cadena son:

source: Character named *name* in the Unicode database
es: El carácter llamado *name* en la base de datos de Unicode

source: Character with 16-bit hex value *xxxx*
es: Carácter con valor hexadecimal de 16 bits *xxxx*

source: Character with 32-bit hex value *xxxxxxxx*
es: Carácter con valor hexadecimal de 32 bits *xxxxxxxx*

source: Notes:
es: Notas:

source: As in Standard C, up to three octal digits are accepted.
es: Como en C estándar, se aceptan hasta tres dígitos octales.

source: Unlike in Standard C, exactly two hex digits are required.
es: A diferencia de C estándar, se requieren exactamente dos dígitos hexadecimales.

source: In a bytes literal, hexadecimal and octal escapes denote the byte with the given value. In a string literal, these escapes denote a Unicode character with the given value.
es: En un literal de bytes, los escapes hexadecimal y octal denotan el byte con el valor dado. En un literal de cadena, estos escapes denotan un carácter Unicode con el valor dado.

source: Support for name aliases [#]_ has been added.
es: Se ha añadido el soporte para los alias de nombres [#]_.

source: Exactly four hex digits are required.
es: Se requieren exactamente cuatro dígitos hexadecimales.

source: Any Unicode character can be encoded this way. Exactly eight hex digits are required.
es: Cualquier carácter Unicode puede ser codificado de esta manera. Se requieren exactamente ocho dígitos hexadecimales.

source: Unlike Standard C, all unrecognized escape sequences are left in the string unchanged, i.e., *the backslash is left in the result*. (This behavior is useful when debugging: if an escape sequence is mistyped, the resulting output is more easily recognized as broken.) It is also important to note that the escape sequences only recognized in string literals fall into the category of unrecognized escapes for bytes literals.
es: A diferencia de C estándar, todas las secuencias de escape no reconocidas se dejan en la cadena sin cambios, es decir, *la barra invertida se deja en el resultado*. (Este comportamiento es útil para la depuración: si una secuencia de escape se escribe mal, la salida resultante se reconoce más fácilmente como rota). También es importante señalar que las secuencias de escape sólo reconocidas en los literales de cadena caen en la categoría de escapes no reconocidos para los literales de bytes.

source: Unrecognized escape sequences produce a :exc:`DeprecationWarning`. In a future Python version they will be a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`.
es: Las secuencias de escape no reconocidas producen un :exc:`DeprecationWarning`. En una futura versión de Python serán un :exc:`SyntaxWarning` y eventualmente un :exc:`SyntaxError`.

source: Even in a raw literal, quotes can be escaped with a backslash, but the backslash remains in the result; for example, ``r"\""`` is a valid string literal consisting of two characters: a backslash and a double quote; ``r"\"`` is not a valid string literal (even a raw string cannot end in an odd number of backslashes). Specifically, *a raw literal cannot end in a single backslash* (since the backslash would escape the following quote character). Note also that a single backslash followed by a newline is interpreted as those two characters as part of the literal, *not* as a line continuation.
es: Incluso en un literal *raw*, las comillas se pueden escapar con una barra inversa, pero la barra inversa permanece en el resultado; por ejemplo, ``r"\""`` es un literal de cadena válido que consiste en dos caracteres: una barra inversa y una comilla doble; ``r"\"`` no es un literal de cadena válido (incluso una cadena en bruto no puede terminar en un número impar de barras inversas). Específicamente, *un literal raw no puede terminar en una sola barra inversa* (ya que la barra inversa se escaparía del siguiente carácter de comillas). Nótese también que una sola barra inversa seguida de una nueva línea se interpreta como esos dos caracteres como parte del literal, *no* como una continuación de línea.

source: String literal concatenation
es: Concatenación de literales de cadena

source: Multiple adjacent string or bytes literals (delimited by whitespace), possibly using different quoting conventions, are allowed, and their meaning is the same as their concatenation. Thus, ``"hello" 'world'`` is equivalent to ``"helloworld"``. This feature can be used to reduce the number of backslashes needed, to split long strings conveniently across long lines, or even to add comments to parts of strings, for example::
es: Se permiten múltiples literales de cadenas o bytes adyacentes (delimitados por espacios en blanco), posiblemente utilizando diferentes convenciones de citas, y su significado es el mismo que su concatenación. Por lo tanto, ``"hola" 'mundo'`` es equivalente a ``"holamundo"``. Esta característica puede ser utilizada para reducir el número de barras inversas necesarias, para dividir largas cadenas convenientemente a través de largas líneas, o incluso para añadir comentarios a partes de las cadenas, por ejemplo::

source: Note that this feature is defined at the syntactical level, but implemented at compile time. The '+' operator must be used to concatenate string expressions at run time. Also note that literal concatenation can use different quoting styles for each component (even mixing raw strings and triple quoted strings), and formatted string literals may be concatenated with plain string literals.
es: Téngase en cuenta que esta característica se define a nivel sintáctico, pero se implementa en el momento de la compilación. El operador '+' debe ser usado para concatenar expresiones de cadena al momento de la ejecución. Observar también que la concatenación de literales puede utilizar diferentes estilos de citas para cada componente (incluso mezclando cadenas *raw* y cadenas de triple comillado), y los literales de cadena formateados pueden ser concatenados con los literales de cadena simples.

source: Formatted string literals
es: Literales de cadena formateados

source: A :dfn:`formatted string literal` or :dfn:`f-string` is a string literal that is prefixed with ``'f'`` or ``'F'``. These strings may contain replacement fields, which are expressions delimited by curly braces ``{}``. While other string literals always have a constant value, formatted strings are really expressions evaluated at run time.
es: Un :dfn:`formatted string literal` o :dfn:`f-string` es un literal de cadena que se prefija con ``'f'`` o ``'F'``. Estas cadenas pueden contener campos de reemplazo, que son expresiones delimitadas por llaves ``{}``. Mientras que otros literales de cadena siempre tienen un valor constante, las cadenas formateadas son realmente expresiones evaluadas en tiempo de ejecución.

source: Escape sequences are decoded like in ordinary string literals (except when a literal is also marked as a raw string). After decoding, the grammar for the contents of the string is:
es: Las secuencias de escape se decodifican como en los literales de cadena ordinarios (excepto cuando un literal también se marca como cadena *raw*). Después de la decodificación, la gramática para el contenido de la cadena es:

source: The parts of the string outside curly braces are treated literally, except that any doubled curly braces ``'{{'`` or ``'}}'`` are replaced with the corresponding single curly brace. A single opening curly bracket ``'{'`` marks a replacement field, which starts with a Python expression. After the expression, there may be a conversion field, introduced by an exclamation point ``'!'``. A format specifier may also be appended, introduced by a colon ``':'``. A replacement field ends with a closing curly bracket ``'}'``.
es: Las partes de la cadena fuera de llaves se tratan literalmente, excepto que cualquier llave doble ``'{{'`` o ``'}}'`` se reemplaza con la llave simple correspondiente. Una llave de apertura simple ``'{'``` marca un campo de reemplazo, que comienza con una expresión de Python. Después de la expresión, puede haber un campo de conversión, introducido por un signo de exclamación ``'!'``. También se puede añadir un especificador de formato, introducido por dos puntos ``':'``. Un campo de reemplazo termina con una llave de cierre ``'}'``.

source: Expressions in formatted string literals are treated like regular Python expressions surrounded by parentheses, with a few exceptions. An empty expression is not allowed, and both :keyword:`lambda` and assignment expressions ``:=`` must be surrounded by explicit parentheses. Replacement expressions can contain line breaks (e.g. in triple-quoted strings), but they cannot contain comments. Each expression is evaluated in the context where the formatted string literal appears, in order from left to right.
es: Las expresiones en literales de cadena formateados se tratan como expresiones regulares de Python rodeadas de paréntesis, con algunas excepciones. Una expresión vacía no está permitida, y tanto :keyword:`lambda` como las expresiones de asignación ``:=`` deben estar rodeadas de paréntesis explícitos. Las expresiones de sustitución pueden contener saltos de línea (por ejemplo, en cadenas de tres comillas), pero no pueden contener comentarios. Cada expresión se evalúa en el contexto en el que aparece el literal de cadena formateado, en orden de izquierda a derecha.

source: Prior to Python 3.7, an :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in formatted string literals due to a problem with the implementation.
es: Antes de Python 3.7, una expresión :keyword:`await` y comprensiones que contenían una cláusula :keyword:`async for` eran ilegales en las expresiones en literales de cadenas formateadas debido a un problema con la implementación.

source: If a conversion is specified, the result of evaluating the expression is converted before formatting. Conversion ``'!s'`` calls :func:`str` on the result, ``'!r'`` calls :func:`repr`, and ``'!a'`` calls :func:`ascii`.
es: Si se especifica una conversión, el resultado de la evaluación de la expresión se convierte antes del formateo. La conversión ```!s'`` llama :func:`str` al resultado, ```!r'`` llama :func:`repr`, y ```!a'`` llama :func:`ascii`.

source: The result is then formatted using the :func:`format` protocol. The format specifier is passed to the :meth:`__format__` method of the expression or conversion result. An empty string is passed when the format specifier is omitted. The formatted result is then included in the final value of the whole string.
es: El resultado es entonces formateado usando el protocolo :func:`format`. El especificador de formato se pasa al método :meth:`__format__` del resultado de la expresión o conversión. Se pasa una cadena vacía cuando se omite el especificador de formato. El resultado formateado se incluye entonces en el valor final de toda la cadena.

source: Top-level format specifiers may include nested replacement fields. These nested fields may include their own conversion fields and :ref:`format specifiers <formatspec>`, but may not include more deeply-nested replacement fields. The :ref:`format specifier mini-language <formatspec>` is the same as that used by the string .format() method.
es: Los especificadores de formato de nivel superior pueden incluir campos de reemplazo anidados. Estos campos anidados pueden incluir sus propios campos de conversión y :ref:`especificadores de formato <formatspec>`, pero no pueden incluir campos de reemplazo con nidos más profundos. El :ref:`mini-lenguaje de especificadores de formato <formatspec>` es el mismo que el utilizado por el método de *string* `.format()`.

source: Formatted string literals may be concatenated, but replacement fields cannot be split across literals.
es: Los literales de cadena formateados pueden ser concatenados, pero los campos de reemplazo no pueden ser divididos entre los literales.

source: Some examples of formatted string literals::
es: Algunos ejemplos de literales de cadena formateados::

source: A consequence of sharing the same syntax as regular string literals is that characters in the replacement fields must not conflict with the quoting used in the outer formatted string literal::
es: Una consecuencia de compartir la misma sintaxis que los literales de cadena regulares es que los caracteres en los campos de reemplazo no deben entrar en conflicto con la comilla usada en el literal de cadena formateado exterior::

source: Backslashes are not allowed in format expressions and will raise an error::
es: Las barras inversas no están permitidas en las expresiones de formato y generarán un error::

source: To include a value in which a backslash escape is required, create a temporary variable.
es: Para incluir un valor en el que se requiere un escape de barra inversa, hay que crear una variable temporal.

source: Formatted string literals cannot be used as docstrings, even if they do not include expressions.
es: Los literales de cadena formateados no pueden ser usados como cadenas de documentos (*docstrings*), aunque no incluyan expresiones.

source: See also :pep:`498` for the proposal that added formatted string literals, and :meth:`str.format`, which uses a related format string mechanism.
es: Ver también :pep:`498` para la propuesta que añadió literales de cadenas formateados, y :meth:`str.format`, que utiliza un mecanismo de cadenas formateadas relacionado.

source: Numeric literals
es: Literales numéricos

source: There are three types of numeric literals: integers, floating point numbers, and imaginary numbers. There are no complex literals (complex numbers can be formed by adding a real number and an imaginary number).
es: Hay tres tipos de literales numéricos: números enteros, números de punto flotante y números imaginarios. No hay literales complejos (los números complejos pueden formarse sumando un número real y un número imaginario).

source: Note that numeric literals do not include a sign; a phrase like ``-1`` is actually an expression composed of the unary operator '``-``' and the literal ``1``.
es: Nótese que los literales numéricos no incluyen un signo; una frase como ``-1`` es en realidad una expresión compuesta por el operador unario '``-``' y el literal ``1``.

source: Integer literals
es: Literales enteros

source: Integer literals are described by the following lexical definitions:
es: Los literales enteros se describen mediante las siguientes definiciones léxicas:

source: There is no limit for the length of integer literals apart from what can be stored in available memory.
es: No hay límite para la longitud de los literales enteros aparte de lo que se puede almacenar en la memoria disponible.

source: Underscores are ignored for determining the numeric value of the literal. They can be used to group digits for enhanced readability. One underscore can occur between digits, and after base specifiers like ``0x``.
es: Los guiones bajos se ignoran para determinar el valor numérico del literal. Se pueden utilizar para agrupar los dígitos para mejorar la legibilidad. Un guión bajo puede ocurrir entre dígitos y después de especificadores de base como ``0x``.

source: Note that leading zeros in a non-zero decimal number are not allowed. This is for disambiguation with C-style octal literals, which Python used before version 3.0.
es: Nótese que no se permiten los ceros a la izquierda en un número decimal que no sea cero. Esto es para desambiguar con los literales octales de estilo C, que Python usaba antes de la versión 3.0.

source: Some examples of integer literals::
es: Algunos ejemplos de literales enteros::

source: Underscores are now allowed for grouping purposes in literals.
es: Los guiones bajos están ahora permitidos para agrupar en literales.
