Repository: python/python-docs-es
Catalog: reference/simple_stmts.po
Languages: es

source: These equivalences assume that :const:`__debug__` and :exc:`AssertionError` refer to the built-in variables with those names. In the current implementation, the built-in variable :const:`__debug__` is ``True`` under normal circumstances, ``False`` when optimization is requested (command line option :option:`-O`). The current code generator emits no code for an assert statement when optimization is requested at compile time. Note that it is unnecessary to include the source code for the expression that failed in the error message; it will be displayed as part of the stack trace.
es: Estas equivalencias asumen que :const:`__debug__` y :exc:`AssertionError` se refieren a las variables integradas con esos nombres. En la implementación actual, la variable incorporada :const:`__debug__` es ``True`` en circunstancias normales, ``False`` cuando se solicita la optimización (opción de línea de comando :option:`-O`). El generador de código actual no emite código para una declaración de aserción cuando se solicita la optimización en tiempo de compilación. Tenga en cuenta que no es necesario incluir el código fuente de la expresión que falló en el mensaje de error; se mostrará como parte del seguimiento de la pila.

source: Assignments to :const:`__debug__` are illegal. The value for the built-in variable is determined when the interpreter starts.
es: Asignaciones a :const:`__debug__` son ilegales. El valor para la variable se determina cuando arranca el intérprete.

source: The :keyword:`!pass` statement
es: La declaración :keyword:`!pass`

source: :keyword:`pass` is a null operation --- when it is executed, nothing happens. It is useful as a placeholder when a statement is required syntactically, but no code needs to be executed, for example::
es: :keyword:`pass` es una operación nula --- cuando se ejecuta, no sucede nada. Es útil como marcador de posición cuando se requiere una declaración sintácticamente, pero no es necesario ejecutar código, por ejemplo::

source: The :keyword:`!del` statement
es: La declaración :keyword:`!del`

source: Deletion is recursively defined very similar to the way assignment is defined. Rather than spelling it out in full details, here are some hints.
es: La eliminación se define de forma recursiva de manera muy similar a la forma en que se define la asignación. En lugar de explicarlo con todos los detalles, aquí hay algunas sugerencias.

source: Deletion of a target list recursively deletes each target, from left to right.
es: La eliminación de una lista de objetivos elimina cada objetivo de forma recursiva, de izquierda a derecha.

source: Deletion of a name removes the binding of that name from the local or global namespace, depending on whether the name occurs in a :keyword:`global` statement in the same code block. If the name is unbound, a :exc:`NameError` exception will be raised.
es: La eliminación de un nombre elimina la vinculación de ese nombre del espacio de nombres local o global, dependiendo de si el nombre aparece en una declaración :keyword:`global` en el mismo bloque de código. Si el nombre no está vinculado, se lanzará una excepción :exc:`NameError`.

source: Deletion of attribute references, subscriptions and slicings is passed to the primary object involved; deletion of a slicing is in general equivalent to assignment of an empty slice of the right type (but even this is determined by the sliced object).
es: La supresión de referencias de atributo, suscripciones y rebanadas se pasa al objeto primario involucrado; la eliminación de una rebanada es en general equivalente a la asignación de una rebanada vacía del tipo correcto (pero incluso esto está determinado por el objeto rebanado).

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block.
es: Anteriormente era ilegal eliminar un nombre del espacio de nombres local si aparece como una variable libre en un bloque anidado.

source: The :keyword:`!return` statement
es: La declaración :keyword:`!return`

source: :keyword:`return` may only occur syntactically nested in a function definition, not within a nested class definition.
es: El :keyword:`return` sólo puede ocurrir sintácticamente anidado en una definición de función, no dentro de una definición de clase anidada.

source: If an expression list is present, it is evaluated, else ``None`` is substituted.
es: Si una lista de expresiones es presente, ésta es evaluada, sino es substituida por ``None`` .

source: :keyword:`return` leaves the current function call with the expression list (or ``None``) as return value.
es: :keyword:`return` deja la llamada a la función actual con la lista de expresiones (o ``None``) como valor de retorno.

source: When :keyword:`return` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the function.
es: Cuando :keyword:`return` pasa el control de una sentencia :keyword:`try` con una cláusula :keyword:`finally`, esa cláusula :keyword:`!finally` se ejecuta antes de dejar realmente la función.

source: In a generator function, the :keyword:`return` statement indicates that the generator is done and will cause :exc:`StopIteration` to be raised. The returned value (if any) is used as an argument to construct :exc:`StopIteration` and becomes the :attr:`StopIteration.value` attribute.
es: En una función generadora, la declaración :keyword:`return` indica que el generador ha acabado y hará que :exc:`StopIteration` se lance. El valor retornado (si lo hay) se utiliza como argumento para construir :exc:`StopIteration` y se convierte en el atributo :attr:`StopIteration.value`.

source: In an asynchronous generator function, an empty :keyword:`return` statement indicates that the asynchronous generator is done and will cause :exc:`StopAsyncIteration` to be raised. A non-empty :keyword:`!return` statement is a syntax error in an asynchronous generator function.
es: En una función de generador asíncrono, una declaración :keyword:`return` vacía indica que el generador asíncrono ha acabado y va a lanzar un :exc:`StopAsyncIteration`. Una declaración :keyword:`!return` no vacía es un error de sintaxis en una función generadora asíncrona.

source: The :keyword:`!yield` statement
es: La declaración :keyword:`!yield`

source: A :keyword:`yield` statement is semantically equivalent to a :ref:`yield expression <yieldexpr>`. The yield statement can be used to omit the parentheses that would otherwise be required in the equivalent yield expression statement. For example, the yield statements ::
es: La declaración :keyword:`yield` es semánticamente equivalente a :ref:`yield expression <yieldexpr>`. Una declaración de producción se puede utilizar para omitir los paréntesis que de otro modo serían necesarios en la declaración de expresión de producción equivalente. Por ejemplo, las declaraciones de producción ::

source: are equivalent to the yield expression statements ::
es: son equivalentes a las funciones que producen declaraciones ::

source: Yield expressions and statements are only used when defining a :term:`generator` function, and are only used in the body of the generator function. Using yield in a function definition is sufficient to cause that definition to create a generator function instead of a normal function.
es: Expresiones y declaraciones productoras se usan únicamente para definir una función :term:`generator`, y son utilizadas únicamente en el cuerpo de una función generadora. Usar producción en una definición de función es suficiente para hacer que esa definición cree una función generadora en lugar de una función normal.

source: For full details of :keyword:`yield` semantics, refer to the :ref:`yieldexpr` section.
es: Para todos los detalles de la semántica de :keyword:`yield`, referirse a la sección :ref:`yieldexpr`.

source: The :keyword:`!raise` statement
es: La declaración :keyword:`!raise`

source: If no expressions are present, :keyword:`raise` re-raises the last exception that was active in the current scope. If no exception is active in the current scope, a :exc:`RuntimeError` exception is raised indicating that this is an error.
es: Si no hay expresiones presentes, :keyword:`raise` vuelve a lanzar la última excepción que estaba activa en el ámbito actual. Si no hay ninguna excepción activa en el alcance actual, se lanza una :exc:`RuntimeError` que indica que se trata de un error.

source: Otherwise, :keyword:`raise` evaluates the first expression as the exception object. It must be either a subclass or an instance of :class:`BaseException`. If it is a class, the exception instance will be obtained when needed by instantiating the class with no arguments.
es: De lo contrario, :keyword:`raise` evalúa la primera expresión como el objeto de excepción. Debe ser una subclase o una instancia de :class:`BaseException`. Si es una clase, la instancia de excepción se obtendrá cuando sea necesario creando una instancia de la clase sin argumentos.

source: The :dfn:`type` of the exception is the exception instance's class, the :dfn:`value` is the instance itself.
es: El :dfn:`type` de la excepción es la instancia de la clase excepción, el :dfn:`value` es la propia instancia.

source: A traceback object is normally created automatically when an exception is raised and attached to it as the :attr:`__traceback__` attribute, which is writable. You can create an exception and set your own traceback in one step using the :meth:`with_traceback` exception method (which returns the same exception instance, with its traceback set to its argument), like so::
es: Normalmente, un objeto de rastreo se crea automáticamente cuando se lanza una excepción y se le adjunta como atributo :attr:`__traceback__`, que se puede escribir. Puede crear una excepción y establecer su propio rastreo en un solo paso utilizando el método de excepción :meth:`with_traceback` (que retorna la misma instancia de excepción, con su rastreo establecido en su argumento), así::

source: The ``from`` clause is used for exception chaining: if given, the second *expression* must be another exception class or instance, which will then be attached to the raised exception as the :attr:`__cause__` attribute (which is writable). If the raised exception is not handled, both exceptions will be printed::
es: La clausura ``from`` se usa para el encadenamiento de excepciones: si se proporciona, la segunda *expresión* debe ser otra clase o instancia de excepción, que luego se adjuntará a la excepción lanzada como el atributo de :attr:`__cause__` (que se puede escribir). Si no se maneja la excepción lanzada, se imprimirán ambas excepciones::

source: A similar mechanism works implicitly if an exception is raised inside an exception handler or a :keyword:`finally` clause: the previous exception is then attached as the new exception's :attr:`__context__` attribute::
es: Un mecanismo similar funciona implícitamente si se lanza una excepción dentro de un controlador de excepciones o una cláusula :keyword:`finally`: la excepción anterior se adjunta como el atributo :attr:`__context__` de la nueva excepción::

source: Exception chaining can be explicitly suppressed by specifying :const:`None` in the ``from`` clause::
es: El encadenamiento de excepciones se puede suprimir explícitamente especificando :const:`None` en la cláusula ``from``:

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information about handling exceptions is in section :ref:`try`.
es: Se puede encontrar información adicional sobre excepciones en la sección :ref:`exceptions`, e información sobre manejo de excepciones en la sección :ref:`try`.

source: :const:`None` is now permitted as ``Y`` in ``raise X from Y``.
es: :const:`None` ahora es permitido como ``Y`` en ``raise X from Y``.

source: The ``__suppress_context__`` attribute to suppress automatic display of the exception context.
es: El atributo ``__suppress_context__`` para suprimir la visualización automática del contexto de excepción.

source: The :keyword:`!break` statement
es: La declaración :keyword:`!break`

source: :keyword:`break` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop.
es: :keyword:`break` solo puede ocurrir sintácticamente anidado en un bucle :keyword:`for` o :keyword:`while`, pero no anidado en una función o definición de clase dentro de ese bucle.

source: It terminates the nearest enclosing loop, skipping the optional :keyword:`!else` clause if the loop has one.
es: Termina el bucle adjunto más cercano, omitiendo la cláusula :keyword:`!else` opcional si el bucle tiene una.

source: If a :keyword:`for` loop is terminated by :keyword:`break`, the loop control target keeps its current value.
es: Si un bucle :keyword:`for` es terminado por :keyword:`break`, el objetivo de control de bucle mantiene su valor actual.

source: When :keyword:`break` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the loop.
es: Cuando :keyword:`break` pasa el control de una sentencia :keyword:`try` con una cláusula :keyword:`finally`, esa cláusula :keyword:`!finally` se ejecuta antes de dejar realmente el bucle.

source: The :keyword:`!continue` statement
es: La declaración :keyword:`!continue`

source: :keyword:`continue` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop. It continues with the next cycle of the nearest enclosing loop.
es: :keyword:`continue` sólo puede ocurrir sintácticamente anidado en el ciclo :keyword:`for` o :keyword:`while`, pero no anidado en una función o definición de clase dentro de ese ciclo. Continúa con la siguiente iteración del bucle envolvente más cercano.

source: When :keyword:`continue` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really starting the next loop cycle.
es: Cuando :keyword:`continue` pasa el control de una sentencia :keyword:`try` con una cláusula :keyword:`finally`, esa cláusula :keyword:`!finally` se ejecuta antes de empezar realmente el siguiente ciclo del bucle.

source: The :keyword:`!import` statement
es: La declaración :keyword:`!import`

source: The basic import statement (no :keyword:`from` clause) is executed in two steps:
es: La declaración básica de importación (sin la cláusula :keyword:`from`) es ejecutada en 2 pasos:

source: find a module, loading and initializing it if necessary
es: encontrar un módulo, cargarlo e inicializarlo en caso de ser necesario

source: define a name or names in the local namespace for the scope where the :keyword:`import` statement occurs.
es: define un nombre o nombres en el espacio de nombres local para el alcance donde ocurre la instrucción :keyword:`import`.

source: When the statement contains multiple clauses (separated by commas) the two steps are carried out separately for each clause, just as though the clauses had been separated out into individual import statements.
es: Cuando la declaración contiene varias cláusulas (separadas por comas), los dos pasos se llevan a cabo por separado para cada cláusula, como si las cláusulas se hubieran separado en declaraciones de importación individuales.

source: The details of the first step, finding and loading modules are described in greater detail in the section on the :ref:`import system <importsystem>`, which also describes the various types of packages and modules that can be imported, as well as all the hooks that can be used to customize the import system. Note that failures in this step may indicate either that the module could not be located, *or* that an error occurred while initializing the module, which includes execution of the module's code.
es: Los detalles del primer paso, búsqueda y carga de módulos se describen con mayor detalle en la sección sobre el :ref:`import system <importsystem>`, que también describe los distintos tipos de paquetes y módulos que se pueden importar, así como todos los ganchos que se puede utilizar para personalizar el sistema de importación. Tenga en cuenta que las fallas en este paso pueden indicar que el módulo no se pudo ubicar, *o* que ocurrió un error al inicializar el módulo, que incluye la ejecución del código del módulo.

source: If the requested module is retrieved successfully, it will be made available in the local namespace in one of three ways:
es: Si el módulo solicitado se recupera correctamente, estará disponible en el espacio de nombres local de una de estas tres formas:

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
es: Si el nombre del módulo va seguido de :keyword:`!as``, entonces el nombre siguiente :keyword:`!as` está vinculado directamente al módulo importado.

source: If no other name is specified, and the module being imported is a top level module, the module's name is bound in the local namespace as a reference to the imported module
es: Si no se especifica ningún otro nombre y el módulo que se está importando es un módulo de nivel superior, el nombre del módulo se enlaza en el espacio de nombres local como una referencia al módulo importado

source: If the module being imported is *not* a top level module, then the name of the top level package that contains the module is bound in the local namespace as a reference to the top level package. The imported module must be accessed using its full qualified name rather than directly
es: Si el módulo que se está importando *no* es un módulo de nivel superior, entonces el nombre del paquete de nivel superior que contiene el módulo se enlaza en el espacio de nombres local como una referencia al paquete de nivel superior. Se debe acceder al módulo importado utilizando su nombre calificado completo en lugar de directamente

source: The :keyword:`from` form uses a slightly more complex process:
es: La forma :keyword:`from` usa un complejo un poco más complicado:

source: find the module specified in the :keyword:`from` clause, loading and initializing it if necessary;
es: encuentra el módulo especificado en la cláusula :keyword:`from`, cargando e inicializándolo si es necesario;

source: for each of the identifiers specified in the :keyword:`import` clauses:
es: para cada uno de los identificadores especificados en la cláusula :keyword:`import`:

source: check if the imported module has an attribute by that name
es: compruebe si el módulo importado tiene un atributo con ese nombre

source: if not, attempt to import a submodule with that name and then check the imported module again for that attribute
es: de lo contrario, intente importar un submódulo con ese nombre y luego verifique el módulo importado nuevamente para ese atributo

source: if the attribute is not found, :exc:`ImportError` is raised.
es: si el atributo no se encuentra, :exc:`ImportError` es lanzada.

source: otherwise, a reference to that value is stored in the local namespace, using the name in the :keyword:`!as` clause if it is present, otherwise using the attribute name
es: de lo contrario, una referencia a ese valor se almacena en el espacio de nombres local, usando el nombre en la cláusula :keyword:`!as` si ésta está presente, de lo contrario usando el nombre del atributo

source: Examples::
es: Ejemplos::

source: If the list of identifiers is replaced by a star (``'*'``), all public names defined in the module are bound in the local namespace for the scope where the :keyword:`import` statement occurs.
es: Si la lista de identificadores se reemplaza por una estrella (``’*’``), todos los nombres públicos definidos en el módulo se enlazan en el espacio de nombres local para el ámbito donde ocurre la declaración :keyword:`import`.

source: The *public names* defined by a module are determined by checking the module's namespace for a variable named ``__all__``; if defined, it must be a sequence of strings which are names defined or imported by that module. The names given in ``__all__`` are all considered public and are required to exist. If ``__all__`` is not defined, the set of public names includes all names found in the module's namespace which do not begin with an underscore character (``'_'``). ``__all__`` should contain the entire public API. It is intended to avoid accidentally exporting items that are not part of the API (such as library modules which were imported and used within the module).
es: Los *nombres públicos* definidos por un módulo se determinan al verificar el espacio de nombres del módulo en busca de una variable llamada ``__all__``; si se define, debe ser una secuencia de cadenas que son nombres definidos o importados por ese módulo. Los nombres dados en ``__all__`` se consideran públicos y se requiere que existan. Si ``__all__`` no está definido, el conjunto de nombres públicos incluye todos los nombres que se encuentran en el espacio de nombres del módulo que no comienzan con un carácter de subrayado (``’_’``). ``__all__`` debe contener la API pública completa. Su objetivo es evitar la exportación accidental de elementos que no forman parte de la API (como los módulos de biblioteca que se importaron y utilizaron dentro del módulo).

source: The wild card form of import --- ``from module import *`` --- is only allowed at the module level. Attempting to use it in class or function definitions will raise a :exc:`SyntaxError`.
es: La forma de importación comodín --- ``from module import *`` --- sólo se permite a nivel módulo. Intentar usarlo en una definición de clase o función lanza una :exc:`SyntaxError`.

source: When specifying what module to import you do not have to specify the absolute name of the module. When a module or package is contained within another package it is possible to make a relative import within the same top package without having to mention the package name. By using leading dots in the specified module or package after :keyword:`from` you can specify how high to traverse up the current package hierarchy without specifying exact names. One leading dot means the current package where the module making the import exists. Two dots means up one package level. Three dots is up two levels, etc. So if you execute ``from . import mod`` from a module in the ``pkg`` package then you will end up importing ``pkg.mod``. If you execute ``from ..subpkg2 import mod`` from within ``pkg.subpkg1`` you will import ``pkg.subpkg2.mod``. The specification for relative imports is contained in the :ref:`relativeimports` section.
es: Al especificar qué módulo importar, no es necesario especificar el nombre absoluto del módulo. Cuando un módulo o paquete está contenido dentro de otro paquete, es posible realizar una importación relativa dentro del mismo paquete superior sin tener que mencionar el nombre del paquete. Al usar puntos iniciales en el módulo o paquete especificado después de :keyword:`from`, puede especificar qué tan alto recorrer la jerarquía actual del paquete sin especificar nombres exactos. Un punto inicial significa el paquete actual donde existe el módulo que realiza la importación. Dos puntos significan un nivel de paquete. Tres puntos son dos niveles, etc. Entonces, si ejecuta ``from . import mod`` de un módulo en el paquete ``pkg`` terminará importando``pkg.mod``. Si ejecuta ``from ..subpkg2 import mod`` desde dentro de ``pkg.subpkg1``, importará ``pkg.subpkg2.mod``. La especificación para las importaciones relativas está contenida en la sección :ref:`relativeimports`.
