Repository: python/python-docs-es
Catalog: reference/simple_stmts.po
Languages: es

source: :func:`importlib.import_module` is provided to support applications that determine dynamically the modules to be loaded.
es: :func:`importlib.import_module` se proporciona para soportar aplicaciones que determinan dinámicamente los módulos a cargar.

source: Raises an :ref:`auditing event <auditing>` ``import`` with arguments ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.
es: Lanza un :ref:`auditing event <auditing>` ``import`` con argumentos ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.

source: Future statements
es: Declaraciones Futuras

source: A :dfn:`future statement` is a directive to the compiler that a particular module should be compiled using syntax or semantics that will be available in a specified future release of Python where the feature becomes standard.
es: Una :dfn:`future statement` es una directiva para el compilador para indicar que un módulo en particular debe compilarse usando la sintaxis o semántica que estará disponible en una versión futura específica de Python donde la característica se convierte en estándar.

source: The future statement is intended to ease migration to future versions of Python that introduce incompatible changes to the language. It allows use of the new features on a per-module basis before the release in which the feature becomes standard.
es: La declaración futura está destinada a facilitar la migración a futuras versiones de Python que introducen cambios incompatibles en el lenguaje. Permite el uso de las nuevas funciones por módulo antes del lanzamiento en el que la función se convierte en estándar.

source: A future statement must appear near the top of the module. The only lines that can appear before a future statement are:
es: Una declaración futura debe aparecer cerca de la parte superior del módulo. Las únicas líneas que pueden aparecer antes de una declaración futura son:

source: the module docstring (if any),
es: el docstring del módulo (si hay),

source: comments,
es: comentarios,

source: blank lines, and
es: lineas en blanco, y

source: other future statements.
es: otras declaraciones futuras.

source: The only feature that requires using the future statement is ``annotations`` (see :pep:`563`).
es: La única característica en Python 3.7 que requiere el uso la declaración futuro es ``annotations``.

source: All historical features enabled by the future statement are still recognized by Python 3. The list includes ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` and ``with_statement``. They are all redundant because they are always enabled, and only kept for backwards compatibility.
es: 108/5000 Python 3 aún reconoce todas las características históricas habilitadas por la declaración futura. La lista incluye ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` y ``with_statement``. Todos son redundantes porque siempre están habilitados y solo se conservan para compatibilidad con versiones anteriores.

source: A future statement is recognized and treated specially at compile time: Changes to the semantics of core constructs are often implemented by generating different code. It may even be the case that a new feature introduces new incompatible syntax (such as a new reserved word), in which case the compiler may need to parse the module differently. Such decisions cannot be pushed off until runtime.
es: Una declaración futura se reconoce y se trata especialmente en el momento de la compilación: los cambios en la semántica de las construcciones centrales a menudo se implementan generando código diferente. Incluso puede darse el caso de que una nueva característica introduzca una nueva sintaxis incompatible (como una nueva palabra reservada), en cuyo caso el compilador puede necesitar analizar el módulo de manera diferente. Tales decisiones no pueden postergarse hasta el tiempo de ejecución.

source: For any given release, the compiler knows which feature names have been defined, and raises a compile-time error if a future statement contains a feature not known to it.
es: Para cualquier versión dada, el compilador sabe qué nombres de características se han definido y lanza un error en tiempo de compilación si una declaración futura contiene una característica que no conoce.

source: The direct runtime semantics are the same as for any import statement: there is a standard module :mod:`__future__`, described later, and it will be imported in the usual way at the time the future statement is executed.
es: La semántica del tiempo de ejecución directo es la misma que para cualquier declaración de importación: hay un módulo estándar :mod:`__future__`, que se describe más adelante, y se importará de la forma habitual en el momento en que se ejecute la declaración futura.

source: The interesting runtime semantics depend on the specific feature enabled by the future statement.
es: La interesante semántica del tiempo de ejecución depende de la característica específica habilitada por la declaración futura.

source: Note that there is nothing special about the statement::
es: Notar que no hay nada especial a cerca de la declaración::

source: That is not a future statement; it's an ordinary import statement with no special semantics or syntax restrictions.
es: Esa no es una declaración futura; es una declaración de importación ordinaria sin restricciones especiales de semántica o sintaxis.

source: Code compiled by calls to the built-in functions :func:`exec` and :func:`compile` that occur in a module :mod:`M` containing a future statement will, by default, use the new syntax or semantics associated with the future statement. This can be controlled by optional arguments to :func:`compile` --- see the documentation of that function for details.
es: El código compilado por llamadas a las funciones integradas :func:`exec` y :func:`compile` que ocurren en un módulo :mod:`M` que contiene una declaración futura usará, por defecto, la nueva sintaxis o semántica asociada con la declaración futura. Esto se puede controlar mediante argumentos opcionales para :func:`compile` --- consulte la documentación de esa función para obtener más detalles.

source: A future statement typed at an interactive interpreter prompt will take effect for the rest of the interpreter session. If an interpreter is started with the :option:`-i` option, is passed a script name to execute, and the script includes a future statement, it will be in effect in the interactive session started after the script is executed.
es: Una declaración futura escrita en una prompt interactiva del intérprete entrará en vigencia durante el resto de la sesión de dicho intérprete. Si un intérprete se inicia con la opción :option:`-i`, se le pasa un nombre de script para ejecutar, y el script incluye una declaración futura, ésta estará en efecto en la sesión interactiva iniciada después de que se ejecute el script.

source: :pep:`236` - Back to the __future__
es: :pep:`236` - Vuelta al __future__

source: The original proposal for the __future__ mechanism.
es: La propuesta original para el mecanismo __future__.

source: The :keyword:`!global` statement
es: La declaración :keyword:`!global`

source: The :keyword:`global` statement is a declaration which holds for the entire current code block. It means that the listed identifiers are to be interpreted as globals. It would be impossible to assign to a global variable without :keyword:`!global`, although free variables may refer to globals without being declared global.
es: La declaración :keyword:`global` es una declaración que se aplica a todo el bloque de código actual. Significa que los identificadores enumerados deben interpretarse como globales. Sería imposible asignar a una variable global sin :keyword:`!global`, aunque las variables libres pueden referirse a globales sin ser declaradas globales.

source: Names listed in a :keyword:`global` statement must not be used in the same code block textually preceding that :keyword:`!global` statement.
es: Los nombres enumerados en una declaración :keyword:`global` no deben usarse en el mismo bloque de código que precede textualmente a la declaración :keyword:`!global`.

source: Names listed in a :keyword:`global` statement must not be defined as formal parameters or in a :keyword:`for` loop control target, :keyword:`class` definition, function definition, :keyword:`import` statement, or variable annotation.
es: Los nombres enumerados en una declaración :keyword:`global` no deben definirse como parámetros formales o en un objetivo de control de bucle :keyword:`for`, definición de :keyword:`class`, definición de función, declaración :keyword:`import` o anotación de variable.

source: The current implementation does not enforce some of these restrictions, but programs should not abuse this freedom, as future implementations may enforce them or silently change the meaning of the program.
es: La implementación actual no hace cumplir algunas de estas restricciones, pero los programas no deben abusar de esta libertad, ya que las implementaciones futuras pueden imponerlas o cambiar silenciosamente el significado del programa.

source: **Programmer's note:** :keyword:`global` is a directive to the parser. It applies only to code parsed at the same time as the :keyword:`!global` statement. In particular, a :keyword:`!global` statement contained in a string or code object supplied to the built-in :func:`exec` function does not affect the code block *containing* the function call, and code contained in such a string is unaffected by :keyword:`!global` statements in the code containing the function call. The same applies to the :func:`eval` and :func:`compile` functions.
es: ** Nota del programador: ** :keyword:`global` es una directiva para el analizador. Se aplica solo al código analizado al mismo tiempo que la declaración :keyword:`!global`. En particular, una declaración :keyword:`!global` contenida en una cadena u objeto de código suministrado a la función incorporada :func:`exec` no afecta el bloque de código *que contiene* la llamada a la función, y el código contenido en dicha función una cadena no se ve afectada por la declaración keyword:`!global` en el código que contiene la llamada a la función. Lo mismo se aplica a las funciones :func:`eval` y :func:`compile`.

source: The :keyword:`!nonlocal` statement
es: La declaración :keyword:`!nonlocal`

source: The :keyword:`nonlocal` statement causes the listed identifiers to refer to previously bound variables in the nearest enclosing scope excluding globals. This is important because the default behavior for binding is to search the local namespace first. The statement allows encapsulated code to rebind variables outside of the local scope besides the global (module) scope.
es: La declaración :keyword:`nonlocal` hace que los identificadores enumerados se refieran a variables vinculadas previamente en el ámbito circundante más cercano excluyendo globales. Esto es importante porque el comportamiento predeterminado para el enlace es buscar primero en el espacio de nombres local. La declaración permite que el código encapsulado vuelva a vincular variables fuera del ámbito local además del ámbito global (módulo).

source: Names listed in a :keyword:`nonlocal` statement must not collide with pre-existing bindings in the local scope.
es: Los nombres enumerados en la declaración :keyword:`nonlocal` no deben colisionar con las enlaces preexistentes en el ámbito local.

source: :pep:`3104` - Access to Names in Outer Scopes
es: :pep:`3104` - Acceso a Nombres de Ámbitos externos

source: The specification for the :keyword:`nonlocal` statement.
es: La especificación para la declaración :keyword:`nonlocal`.
