Repository: python/python-docs-es
Catalog: reference/simple_stmts.po
Languages: es

source: Simple statements
es: Declaraciones simples

source: A simple statement is comprised within a single logical line. Several simple statements may occur on a single line separated by semicolons. The syntax for simple statements is:
es: Una declaración simple se compone dentro de una sola línea lógica. Pueden producirse varias declaraciones simples en una sola línea separada por punto y coma. La sintaxis de las declaraciones simples es:

source: Expression statements
es: Declaraciones de tipo expresión

source: Expression statements are used (mostly interactively) to compute and write a value, or (usually) to call a procedure (a function that returns no meaningful result; in Python, procedures return the value ``None``). Other uses of expression statements are allowed and occasionally useful. The syntax for an expression statement is:
es: Las declaraciones de tipo expresión son usadas (en su mayoría interactivamente) para computar y escribir un valor, o (usualmente) para llamar a un método (una función que no retorna un resultado significativo; en Python, los métodos retornan el valor ``None``). Otros usos de las declaraciones de tipo expresión son permitidas y ocasionalmente útiles. La sintaxis para una declaración de tipo expresión es:

source: An expression statement evaluates the expression list (which may be a single expression).
es: Una declaración de tipo expresión evalúa la lista de expresiones (que puede ser una única expresión).

source: In interactive mode, if the value is not ``None``, it is converted to a string using the built-in :func:`repr` function and the resulting string is written to standard output on a line by itself (except if the result is ``None``, so that procedure calls do not cause any output.)
es: En modo interactivo, si el valor no es ``None``, es convertido a cadena de caracteres usando la función built-in :func:`repr` y la cadena resultante es escrita en la salida estándar en una línea por si sola (excepto si el resultado es ``None``, entonces el procedimiento llamado no produce ninguna salida.)

source: Assignment statements
es: Declaraciones de asignación

source: Assignment statements are used to (re)bind names to values and to modify attributes or items of mutable objects:
es: Las declaraciones de asignación son usadas para (volver a) unir nombres a valores y para modificar atributos o elementos de objetos mutables:

source: (See section :ref:`primaries` for the syntax definitions for *attributeref*, *subscription*, and *slicing*.)
es: (Ver sección :ref:`primaries` para las definiciones de sintaxis para *attributeref*, *subscription*, y *slicing*.)

source: An assignment statement evaluates the expression list (remember that this can be a single expression or a comma-separated list, the latter yielding a tuple) and assigns the single resulting object to each of the target lists, from left to right.
es: Una declaración de asignación evalúa la lista de expresiones (recuerda que ésta puede ser una única expresión o una lista separada por comas, la última produce una tupla) y asigna el único objeto resultante a cada una de las listas de objetivos, de izquierda a derecha.

source: Assignment is defined recursively depending on the form of the target (list). When a target is part of a mutable object (an attribute reference, subscription or slicing), the mutable object must ultimately perform the assignment and decide about its validity, and may raise an exception if the assignment is unacceptable. The rules observed by various types and the exceptions raised are given with the definition of the object types (see section :ref:`types`).
es: Las asignaciones son definidas recursivamente dependiendo de la forma del objetivo (lista). Cuando el objetivo es parte de un objeto mutable (una referencia a un atributo, una subscripción o un segmento), el objeto mutable finalmente debe realizar la asignación y decidir sobre su validez, y puede lanzar una excepción si la asignación no es aceptable. Las reglas observadas por varios tipos y las excepciones lanzadas se dan con la definición de los tipos de objeto (ver sección :ref:`types`).

source: Assignment of an object to a target list, optionally enclosed in parentheses or square brackets, is recursively defined as follows.
es: La asignación de un objeto a una lista de destino, opcionalmente entre paréntesis o corchetes, se define de forma recursiva de la siguiente manera.

source: If the target list is a single target with no trailing comma, optionally in parentheses, the object is assigned to that target.
es: Si la lista de destino es un único objeto sin terminar en coma, opcionalmente entre paréntesis, el objeto es asignado a ese objetivo.

source: Else: The object must be an iterable with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets.
es: Sino: el objeto debe ser iterable con el mismo número de elementos que los elementos en la lista de objetivos, y los elementos son asignados a sus respectivos objetivos de izquierda a derecha.

source: If the target list contains one target prefixed with an asterisk, called a "starred" target: The object must be an iterable with at least as many items as there are targets in the target list, minus one. The first items of the iterable are assigned, from left to right, to the targets before the starred target. The final items of the iterable are assigned to the targets after the starred target. A list of the remaining items in the iterable is then assigned to the starred target (the list can be empty).
es: Si la lista de objetivos contiene un objetivo prefijado con un asterisco, llamado objetivo “destacado”: El objeto debe ser iterable con al menos tantos elementos como objetivos en la lista de objetivos, menos uno. Los primeros elementos del iterable se asignan, de izquierda a derecha, a los objetivos antes del objetivo destacado. Los elementos finales del iterable se asignan a los objetivos después del objetivo destacado. Luego se asigna una lista de los elementos restantes en el iterable al objetivo destacado (la lista puede estar vacía).

source: Assignment of an object to a single target is recursively defined as follows.
es: La asignación de un objeto a un único objetivo se define a continuación de manera recursiva.

source: If the target is an identifier (name):
es: Si el objetivo es un identificador (nombre):

source: If the name does not occur in a :keyword:`global` or :keyword:`nonlocal` statement in the current code block: the name is bound to the object in the current local namespace.
es: Si el nombre no ocurre en una declaración :keyword:`global` o :keyword:`nonlocal` en el actual bloque de código: el nombre es unido al objeto del actual espacio de nombres local.

source: Otherwise: the name is bound to the object in the global namespace or the outer namespace determined by :keyword:`nonlocal`, respectively.
es: Por otra parte: el nombre es unido al objeto en el nombre de espacio global o el nombre de espacio exterior determinado por :keyword:`nonlocal`, respectivamente.

source: The name is rebound if it was already bound. This may cause the reference count for the object previously bound to the name to reach zero, causing the object to be deallocated and its destructor (if it has one) to be called.
es: El nombre se vuelve a unir si ya ha estado unido. Esto puede hacer que el recuento de referencia para el objeto previamente vinculado al nombre llegue a cero, provocando que el objeto se desasigne y se llame a su destructor (si tiene uno).

source: If the target is an attribute reference: The primary expression in the reference is evaluated. It should yield an object with assignable attributes; if this is not the case, :exc:`TypeError` is raised. That object is then asked to assign the assigned object to the given attribute; if it cannot perform the assignment, it raises an exception (usually but not necessarily :exc:`AttributeError`).
es: Si el destino es una referencia de atributo: se evalúa la expresión primaria en la referencia. Debe producir un objeto con atributos asignables; si este no es el caso, una excepción :exc:`TypeError` es lanzada. Luego se le pide a ese objeto que asigne el objeto asignado al atributo dado; si no puede realizar la tarea, lanza una excepción (generalmente pero no necesariamente :exc:`AttributeError`).

source: Note: If the object is a class instance and the attribute reference occurs on both sides of the assignment operator, the right-hand side expression, ``a.x`` can access either an instance attribute or (if no instance attribute exists) a class attribute. The left-hand side target ``a.x`` is always set as an instance attribute, creating it if necessary. Thus, the two occurrences of ``a.x`` do not necessarily refer to the same attribute: if the right-hand side expression refers to a class attribute, the left-hand side creates a new instance attribute as the target of the assignment::
es: Nota: Si el objeto es una instancia de clase y la referencia de atributo ocurre en ambos lados del operador de asignación, la expresión del lado derecho, ``a.x`` puede acceder a un atributo de instancia o (si no existe un atributo de instancia) a una clase atributo. El objetivo del lado izquierdo ``a.x`` siempre se establece como un atributo de instancia, creándolo si es necesario. Por lo tanto, las dos ocurrencias de ``a.x`` no necesariamente se refieren al mismo atributo: si la expresión del lado derecho se refiere a un atributo de clase, el lado izquierdo crea un nuevo atributo de instancia como el objetivo de la asignación::

source: This description does not necessarily apply to descriptor attributes, such as properties created with :func:`property`.
es: Esta descripción no se aplica necesariamente a los atributos del descriptor, como las propiedades creadas con :func:`property`.

source: If the target is a subscription: The primary expression in the reference is evaluated. It should yield either a mutable sequence object (such as a list) or a mapping object (such as a dictionary). Next, the subscript expression is evaluated.
es: Si el objetivo es una suscripción: se evalúa la expresión primaria en la referencia. Debe producir un objeto de secuencia mutable (como una lista) o un objeto de mapeo (como un diccionario). A continuación, se evalúa la expresión del subíndice.

source: If the primary is a mutable sequence object (such as a list), the subscript must yield an integer. If it is negative, the sequence's length is added to it. The resulting value must be a nonnegative integer less than the sequence's length, and the sequence is asked to assign the assigned object to its item with that index. If the index is out of range, :exc:`IndexError` is raised (assignment to a subscripted sequence cannot add new items to a list).
es: Si el primario es un objeto de secuencia mutable (como una lista), el subíndice debe producir un número entero. Si es negativo, se le suma la longitud de la secuencia. El valor resultante debe ser un número entero no negativo menor que la longitud de la secuencia, y se le pide a la secuencia que asigne el objeto asignado a su elemento con ese índice. Si el índice está fuera de rango, :exc:`IndexError` se lanza (la asignación a una secuencia suscrita no puede agregar nuevos elementos a una lista).

source: If the primary is a mapping object (such as a dictionary), the subscript must have a type compatible with the mapping's key type, and the mapping is then asked to create a key/datum pair which maps the subscript to the assigned object. This can either replace an existing key/value pair with the same key value, or insert a new key/value pair (if no key with the same value existed).
es: Si el principal es un objeto de mapeo (como un diccionario), el subíndice debe tener un tipo compatible con el tipo de clave del mapeo, y luego se le pide al mapeo que cree un par clave / dato que mapee el subíndice al objeto asignado. Esto puede reemplazar un par clave / valor existente con el mismo valor clave o insertar un nuevo par clave / valor (si no existía ninguna clave con el mismo valor).

source: For user-defined objects, the :meth:`__setitem__` method is called with appropriate arguments.
es: Para objetos definidos por el usuario, se llama al método :meth:`__setitem__` con los argumentos apropiados.

source: If the target is a slicing: The primary expression in the reference is evaluated. It should yield a mutable sequence object (such as a list). The assigned object should be a sequence object of the same type. Next, the lower and upper bound expressions are evaluated, insofar they are present; defaults are zero and the sequence's length. The bounds should evaluate to integers. If either bound is negative, the sequence's length is added to it. The resulting bounds are clipped to lie between zero and the sequence's length, inclusive. Finally, the sequence object is asked to replace the slice with the items of the assigned sequence. The length of the slice may be different from the length of the assigned sequence, thus changing the length of the target sequence, if the target sequence allows it.
es: Si el destino es un rebanado (*slicing*): la expresión principal de la referencia es evaluada. Debería producir un objeto de secuencia mutable (como una lista). El objeto asignado debe ser un objeto de secuencia del mismo tipo. A continuación, se evalúan las expresiones de límite superior e inferior, en la medida en que estén presentes; los valores predeterminados son cero y la longitud de la secuencia. Los límites deben evaluarse a números enteros. Si alguno de los límites es negativo, se le suma la longitud de la secuencia. Los límites resultantes se recortan para que se encuentren entre cero y la longitud de la secuencia, inclusive. Finalmente, se solicita al objeto de secuencia que reemplace el segmento con los elementos de la secuencia asignada. La longitud del corte puede ser diferente de la longitud de la secuencia asignada, cambiando así la longitud de la secuencia objetivo, si la secuencia objetivo lo permite.

source: In the current implementation, the syntax for targets is taken to be the same as for expressions, and invalid syntax is rejected during the code generation phase, causing less detailed error messages.
es: En la implementación actual, se considera que la sintaxis de los objetivos es la misma que la de las expresiones y se rechaza la sintaxis no válida durante la fase de generación del código, lo que genera mensajes de error menos detallados.

source: Although the definition of assignment implies that overlaps between the left-hand side and the right-hand side are 'simultaneous' (for example ``a, b = b, a`` swaps two variables), overlaps *within* the collection of assigned-to variables occur left-to-right, sometimes resulting in confusion. For instance, the following program prints ``[0, 2]``::
es: Aunque la definición de asignación implica que las superposiciones entre el lado izquierdo y el lado derecho son ‘simultáneas’ (por ejemplo, ``a, b = b, a`` intercambia dos variables), las superposiciones *dentro* de la colección de las variables asignadas ocurren de izquierda a derecha, lo que a veces genera confusión. Por ejemplo, el siguiente programa imprime ``[0, 2]``::

source: :pep:`3132` - Extended Iterable Unpacking
es: :pep:`3132` - Desembalaje Iterable Extendido

source: The specification for the ``*target`` feature.
es: La especificación para la función ``*target``.

source: Augmented assignment statements
es: Declaraciones de asignación aumentada

source: Augmented assignment is the combination, in a single statement, of a binary operation and an assignment statement:
es: La asignación aumentada es la combinación, en una sola declaración, de una operación binaria y una declaración de asignación:

source: (See section :ref:`primaries` for the syntax definitions of the last three symbols.)
es: (Ver sección :ref:`primaries` para la definición de la sintaxis de los tres últimos símbolos.)

source: An augmented assignment evaluates the target (which, unlike normal assignment statements, cannot be an unpacking) and the expression list, performs the binary operation specific to the type of assignment on the two operands, and assigns the result to the original target. The target is only evaluated once.
es: Una asignación aumentada evalúa el destino (que, a diferencia de las declaraciones de asignación normales, no puede ser un desempaquetado) y la lista de expresiones, realiza la operación binaria específica del tipo de asignación en los dos operandos y asigna el resultado al destino original. El objetivo sólo se evalúa una vez.

source: An augmented assignment expression like ``x += 1`` can be rewritten as ``x = x + 1`` to achieve a similar, but not exactly equal effect. In the augmented version, ``x`` is only evaluated once. Also, when possible, the actual operation is performed *in-place*, meaning that rather than creating a new object and assigning that to the target, the old object is modified instead.
es: Una declaración de asignación aumentada como ``x += 1`` puede ser reescriba como ``x = x + 1`` para alcanzar un efecto similar pero no exactamente igual. En la versión aumentada, ``x`` es evaluada una única vez. Además, cuando es posible, la operación real se realiza *in-place*, lo que significa que en lugar de crear un nuevo objeto y asignarlo al objetivo, el objeto anterior se modifica.

source: Unlike normal assignments, augmented assignments evaluate the left-hand side *before* evaluating the right-hand side. For example, ``a[i] += f(x)`` first looks-up ``a[i]``, then it evaluates ``f(x)`` and performs the addition, and lastly, it writes the result back to ``a[i]``.
es: A diferencia de las asignaciones normales, las asignaciones aumentadas evalúan el lado izquierdo *antes* de evaluar el lado derecho. Por ejemplo, ``a[i] += f(x)`` primero busca ``a[i]``, entonces evalúa ``f(x)`` y realiza la suma, y finalmente, vuelve a escribir el resultado en ``a[i]``.

source: With the exception of assigning to tuples and multiple targets in a single statement, the assignment done by augmented assignment statements is handled the same way as normal assignments. Similarly, with the exception of the possible *in-place* behavior, the binary operation performed by augmented assignment is the same as the normal binary operations.
es: Con la excepción de la asignación a tuplas y múltiples objetivos en una sola instrucción, la asignación realizada por las instrucciones de asignación aumentada se maneja de la misma manera que las asignaciones normales. De manera similar, con la excepción del posible comportamiento *in situ*, la operación binaria realizada por la asignación aumentada es la misma que las operaciones binarias normales.

source: For targets which are attribute references, the same :ref:`caveat about class and instance attributes <attr-target-note>` applies as for regular assignments.
es: Para destinos que son referencias a atributos, lo mismo que :ref:`caveat about class and instance attributes <attr-target-note>` se aplica para asignaciones regulares.

source: Annotated assignment statements
es: Declaraciones de asignación anotadas

source: :term:`Annotation <variable annotation>` assignment is the combination, in a single statement, of a variable or attribute annotation and an optional assignment statement:
es: Asignación :term:`Annotation <variable annotation>` es la combinación, en una única declaración, de una variable o anotación de atributo y una declaración de asignación opcional:

source: The difference from normal :ref:`assignment` is that only single target is allowed.
es: La diferencia respecto a :ref:`assignment` normal es que sólo se permite un único objetivo.

source: For simple names as assignment targets, if in class or module scope, the annotations are evaluated and stored in a special class or module attribute :attr:`__annotations__` that is a dictionary mapping from variable names (mangled if private) to evaluated annotations. This attribute is writable and is automatically created at the start of class or module body execution, if annotations are found statically.
es: Para nombres simples como destinos de asignación, si están en el ámbito de clase o módulo, las anotaciones se evalúan y almacenan en una clase especial o atributo de módulo :attr:`__annotations__` que es una asignación de diccionario de nombres de variables (alterados si son privados) a anotaciones evaluadas. Este atributo se puede escribir y se crea automáticamente al comienzo de la ejecución del cuerpo del módulo o la clase, si las anotaciones se encuentran estáticamente.

source: For expressions as assignment targets, the annotations are evaluated if in class or module scope, but not stored.
es: Para expresiones como destinos de asignaciones, las anotaciones se evalúan si están en ámbitos de clase o módulo pero no se almacenan.

source: If a name is annotated in a function scope, then this name is local for that scope. Annotations are never evaluated and stored in function scopes.
es: Si se anota un nombre en el ámbito de una función, este nombre es local para ese ámbito. Las anotaciones nunca se evalúan y almacenan en ámbitos de función.

source: If the right hand side is present, an annotated assignment performs the actual assignment before evaluating annotations (where applicable). If the right hand side is not present for an expression target, then the interpreter evaluates the target except for the last :meth:`__setitem__` or :meth:`__setattr__` call.
es: Si el lado derecho está presente, una tarea anotada realiza la tarea real antes de evaluar las anotaciones (cuando corresponda). Si el lado derecho no está presente para un destino de expresión, entonces el intérprete evalúa el destino excepto por la última llamada :meth:`__setitem__` o :meth:`__setattr__`.

source: :pep:`526` - Syntax for Variable Annotations
es: :pep:`526` - Sintaxis para anotaciones de variable

source: The proposal that added syntax for annotating the types of variables (including class variables and instance variables), instead of expressing them through comments.
es: La propuesta que agregó sintaxis para anotar los tipos de variables (incluidas variables de clase y variables de instancia), en lugar de expresarlas a través de comentarios.

source: :pep:`484` - Type hints
es: :pep:`484` - Indicadores de tipo

source: The proposal that added the :mod:`typing` module to provide a standard syntax for type annotations that can be used in static analysis tools and IDEs.
es: La propuesta que agregó el módulo :mod:`typing` para proporcionar una sintaxis estándar para las anotaciones de tipo para ser utilizadas en herramientas de análisis estático e IDEs.

source: Now annotated assignments allow same expressions in the right hand side as the regular assignments. Previously, some expressions (like un-parenthesized tuple expressions) caused a syntax error.
es: Ahora, las asignaciones anotadas permiten las mismas expresiones en el lado derecho que las asignaciones regulares. Anteriormente, algunas expresiones (como las expresiones de tupla sin paréntesis) provocaban un error de sintaxis.

source: The :keyword:`!assert` statement
es: La declaración :keyword:`!assert`

source: Assert statements are a convenient way to insert debugging assertions into a program:
es: Las declaraciones de afirmación son una forma conveniente de insertar afirmaciones de depuración en un programa:

source: The simple form, ``assert expression``, is equivalent to ::
es: La forma simple, ``assert expressionn``, es equivalente a ::

source: The extended form, ``assert expression1, expression2``, is equivalent to ::
es: La forma extendida, ``assert expression1, expression2``, es equivalente a ::
