Repository: python/python-docs-es
Catalog: reference/toplevel_components.po
Languages: es

source: Top-level components
es: Componentes de nivel superior

source: The Python interpreter can get its input from a number of sources: from a script passed to it as standard input or as program argument, typed in interactively, from a module source file, etc. This chapter gives the syntax used in these cases.
es: El intérprete de Python puede obtener su entrada de varias fuentes: de un script que se le pasa como entrada estándar o como argumento del programa, escrito interactivamente, de un archivo fuente de módulo, etc. Este capítulo proporciona la sintaxis utilizada en estos casos.

source: Complete Python programs
es: Programas completos de Python

source: While a language specification need not prescribe how the language interpreter is invoked, it is useful to have a notion of a complete Python program. A complete Python program is executed in a minimally initialized environment: all built-in and standard modules are available, but none have been initialized, except for :mod:`sys` (various system services), :mod:`builtins` (built-in functions, exceptions and ``None``) and :mod:`__main__`. The latter is used to provide the local and global namespace for execution of the complete program.
es: Si bien una especificación de lenguaje no necesita prescribir cómo se invoca al intérprete de lenguaje, es útil tener una noción de un programa completo de Python. Un programa completo de Python se ejecuta en un entorno mínimamente inicializado: todos los módulos estándar e integrados están disponibles, pero ninguno ha sido inicializado, excepto :mod:`sys` (varios servicios del sistema), :mod:`builtins` (funciones integradas, excepciones y ``Ninguno``) y :mod:`__main__`. Este último se utiliza para proporcionar el espacio de nombres local y global para la ejecución del programa completo.

source: The syntax for a complete Python program is that for file input, described in the next section.
es: La sintaxis de un programa completo de Python es la entrada de archivos, que se describe en la siguiente sección.

source: The interpreter may also be invoked in interactive mode; in this case, it does not read and execute a complete program but reads and executes one statement (possibly compound) at a time. The initial environment is identical to that of a complete program; each statement is executed in the namespace of :mod:`__main__`.
es: El intérprete también puede invocarse en modo interactivo; en este caso, no lee ni ejecuta un programa completo, sino que lee y ejecuta una instrucción (posiblemente compuesta) a la vez. El entorno inicial es idéntico al de un programa completo; cada instrucción se ejecuta en el espacio de nombres de :mod:`__main__`.

source: A complete program can be passed to the interpreter in three forms: with the :option:`-c` *string* command line option, as a file passed as the first command line argument, or as standard input. If the file or standard input is a tty device, the interpreter enters interactive mode; otherwise, it executes the file as a complete program.
es: Se puede pasar un programa completo al intérprete en tres formas: con la opción :option:`-c` *string* de línea de comando, como un archivo pasado como primer argumento de línea de comando o como entrada estándar. Si el archivo o la entrada estándar es un dispositivo tty, el intérprete ingresa al modo interactivo; de lo contrario, ejecuta el archivo como un programa completo.

source: File input
es: Entrada de archivo

source: All input read from non-interactive files has the same form:
es: Todas las entradas leídas de archivos no interactivos tienen la misma forma:

source: This syntax is used in the following situations:
es: Esta sintaxis se utiliza en las siguientes situaciones:

source: when parsing a complete Python program (from a file or from a string);
es: al analizar un programa completo de Python (desde un archivo o desde una cadena);

source: when parsing a module;
es: al analizar un módulo;

source: when parsing a string passed to the :func:`exec` function;
es: al analizar una cadena pasada a la función: :func:`exec`;

source: Interactive input
es: Entrada interactiva

source: Input in interactive mode is parsed using the following grammar:
es: La entrada en modo interactivo se analiza utilizando la siguiente gramática:

source: Note that a (top-level) compound statement must be followed by a blank line in interactive mode; this is needed to help the parser detect the end of the input.
es: Tenga en cuenta que una declaración compuesta (de nivel superior) debe ir seguida de una línea en blanco en modo interactivo; esto es necesario para ayudar al analizador sintáctico a detectar el final de la entrada.

source: Expression input
es: Entrada de expresión

source: :func:`eval` is used for expression input. It ignores leading whitespace. The string argument to :func:`eval` must have the following form:
es: :func:`eval` se utiliza para la entrada de expresiones. Ignora los espacios en blanco iniciales. El argumento de cadena para :func:`eval` debe tener la siguiente forma:
