Repository: python/python-docs-es
Catalog: library/_thread.po
Languages: es

source: :mod:`_thread` --- Low-level threading API
es: :mod:`_thread` --- API de bajo nivel para manejo de hilos

source: This module provides low-level primitives for working with multiple threads (also called :dfn:`light-weight processes` or :dfn:`tasks`) --- multiple threads of control sharing their global data space. For synchronization, simple locks (also called :dfn:`mutexes` or :dfn:`binary semaphores`) are provided. The :mod:`threading` module provides an easier to use and higher-level threading API built on top of this module.
es: Este módulo ofrece primitivas de bajo nivel para trabajar con múltiples *threads* o hilos (también llamados :dfn:`light-weight processes` o :dfn:`tasks`) -- múltiples hilos de control compartiendo su espacio de datos global. Para sincronizar, provee "candados" simples (también llamados :dfn:`mutexes` o :dfn:`binary semaphores`). El módulo :mod:`threading` provee una API de manejo de hilos más fácil de usar y de más alto nivel, construida sobre este módulo.

source: This module used to be optional, it is now always available.
es: Este módulo solía ser opcional, pero ahora está siempre disponible.

source: This module defines the following constants and functions:
es: Este módulo define las siguientes constantes y funciones:

source: Raised on thread-specific errors.
es: Lanzado ante errores específicos de un hilo.

source: This is now a synonym of the built-in :exc:`RuntimeError`.
es: Ahora es un sinónimo de la excepción incorporada :exc:`RuntimeError`.

source: This is the type of lock objects.
es: Este es el tipo de los objetos candado (*lock objects*).

source: Start a new thread and return its identifier. The thread executes the function *function* with the argument list *args* (which must be a tuple). The optional *kwargs* argument specifies a dictionary of keyword arguments.
es: Inicia un nuevo hilo y retorna su identificador. El hilo ejecuta la función *function* con la lista de argumentos *args* (que debe ser una tupla). El argumento opcional *kwargs* especifica un diccionario de argumentos por palabras clave.

source: When the function returns, the thread silently exits.
es: Cuando la función retorna, el hilo finaliza silenciosamente.

source: When the function terminates with an unhandled exception, :func:`sys.unraisablehook` is called to handle the exception. The *object* attribute of the hook argument is *function*. By default, a stack trace is printed and then the thread exits (but other threads continue to run).
es: Cuando la función termina con una excepción no gestionada, se invoca a :func:`sys.unraisablehook` para que gestione la excepción. El atributo *object* del argumento gancho (*hook*), es *function*. Por defecto, se muestra un seguimiento de pila y luego el hilo sale (pero los otros hilos continúan funcionando).

source: When the function raises a :exc:`SystemExit` exception, it is silently ignored.
es: Cuando la función lanza una excepción :exc:`SystemExit`, se ignora silenciosamente.

source: :func:`sys.unraisablehook` is now used to handle unhandled exceptions.
es: Ahora se utiliza :func:`sys.unraisablehook` para gestionar las excepciones no gestionadas.

source: Simulate the effect of a signal arriving in the main thread. A thread can use this function to interrupt the main thread, though there is no guarantee that the interruption will happen immediately.
es: Simular el efecto de una señal que llega al hilo principal. Un hilo puede usar esta función para interrumpir el hilo principal, aunque no hay garantías de que la interrupción ocurrirá inmediatamente.

source: If given, *signum* is the number of the signal to simulate. If *signum* is not given, :data:`signal.SIGINT` is simulated.
es: Si se da, *signum* es el número de la señal a simular. Si *signum* no se da, :data:`signal.SIGINT` es simulado.

source: If the given signal isn't handled by Python (it was set to :data:`signal.SIG_DFL` or :data:`signal.SIG_IGN`), this function does nothing.
es: Si la señal dada no es manejada por Python (se estableció en :data:`signal.SIG_DFL` o :data:`signal.SIG_IGN`), esta función no hace nada.

source: The *signum* argument is added to customize the signal number.
es: Se agrega el argumento *signum* para personalizar el número de señal.

source: This does not emit the corresponding signal but schedules a call to the associated handler (if it exists). If you want to truly emit the signal, use :func:`signal.raise_signal`.
es: Esto no emite la señal correspondiente, sino que programa una llamada al controlador asociado (si existe). Si realmente se quiere emitir la señal, se utiliza :func:`signal.raise_signal`.

source: Raise the :exc:`SystemExit` exception. When not caught, this will cause the thread to exit silently.
es: Lanza la excepción :exc:`SystemExit`. Cuando no es gestionada, causa que el hilo salga silenciosamente.

source: Return a new lock object. Methods of locks are described below. The lock is initially unlocked.
es: Retorna un nuevo objeto candado (*lock object*). Los métodos de los candados se describen más abajo. El candado está abierto al inicio.

source: Return the 'thread identifier' of the current thread. This is a nonzero integer. Its value has no direct meaning; it is intended as a magic cookie to be used e.g. to index a dictionary of thread-specific data. Thread identifiers may be recycled when a thread exits and another thread is created.
es: Retorna el 'identificador de hilo' (*thread identifier*) del hilo actual. Es un entero distinto de cero. Su valor no tiene un significado directo, tiene la intención de ser utilizada como una *cookie* mágica para, por ejemplo, indexar un diccionario con datos específicos del hilo. Los identificadores de hilo pueden reciclarse cuando un hilo sale y otro se crea.

source: Return the native integral Thread ID of the current thread assigned by the kernel. This is a non-negative integer. Its value may be used to uniquely identify this particular thread system-wide (until the thread terminates, after which the value may be recycled by the OS).
es: Retorna el ID de hilo nativo integral del hilo asignado por el kernel. Es un entero no-negativo. Su valor puede utilizarse para identificar inequívocamente este hilo en particular en todo el sistema (hasta que el hilo termine, luego de lo cual el valor puede ser reciclado por el Sistema Operativo).

source: :ref:`Availability <availability>`: Windows, FreeBSD, Linux, macOS, OpenBSD, NetBSD, AIX.
es: :ref:`Disponibilidad <availability>`: Windows, FreeBSD, Linux, macOS, OpenBSD, NetBSD, AIX.

source: Return the thread stack size used when creating new threads. The optional *size* argument specifies the stack size to be used for subsequently created threads, and must be 0 (use platform or configured default) or a positive integer value of at least 32,768 (32 KiB). If *size* is not specified, 0 is used. If changing the thread stack size is unsupported, a :exc:`RuntimeError` is raised. If the specified stack size is invalid, a :exc:`ValueError` is raised and the stack size is unmodified. 32 KiB is currently the minimum supported stack size value to guarantee sufficient stack space for the interpreter itself. Note that some platforms may have particular restrictions on values for the stack size, such as requiring a minimum stack size > 32 KiB or requiring allocation in multiples of the system memory page size - platform documentation should be referred to for more information (4 KiB pages are common; using multiples of 4096 for the stack size is the suggested approach in the absence of more specific information).
es: Retorna el tamaño de la pila del hilo (*thread stack*) utilizada al crear nuevos hilos. El argumento opcional *size* especifica el tamaño de la pila a utilizar en los hilos que se creen a continuación, y debe ser 0 (utiliza el valor por defecto de la plataforma o el configurado) o un entero positivo de al menos 32768 (32KiB). Si *size* no se especifica, se utiliza 0. Si no está soportado el cambio del tamaño de pila del hilo, se lanza una excepción :exc:`RuntimeError`. Si la pila especificada es inválida se lanza un :exc:`ValueError` y el tamaño de la pila no se modifica. 32KiB es actualmente el menor valor soportado para el tamaño de la pila, para garantizar suficiente espacio en la misma para que quepa el propio intérprete. Tenga en cuenta que alguna plataformas pueden tener restricciones particulares en los valores para el tamaño de la pila, como requerir un mínimo que supere los 32KiB, o requerir una asignación en múltiplos del tamaño de página de memoria del sistema. Es necesario consultar la documentación de la plataforma para mayor información (son habituales las páginas de 4KiB; usar múltiplos de 4096 para el tamaño de pila es la estrategia sugerida si no se cuenta con información más específica).

source: :ref:`Availability <availability>`: Windows, pthreads.
es: :ref:`Disponibilidad <availability>`: Windows, hilos POSIX (también llamados pthreads).

source: The maximum value allowed for the *timeout* parameter of :meth:`Lock.acquire`. Specifying a timeout greater than this value will raise an :exc:`OverflowError`.
es: El máximo valor permitido para el parámetro *timeout* de :meth:`Lock.acquire`. Especificar un tiempo de espera (*timeout*) mayor que este valor lanzará una excepción :exc:`OverflowError`.

source: Lock objects have the following methods:
es: Los objetos candado (*lock objects*) tienen los siguientes métodos:

source: Without any optional argument, this method acquires the lock unconditionally, if necessary waiting until it is released by another thread (only one thread at a time can acquire a lock --- that's their reason for existence).
es: Sin ningún argumento opcional, este método adquiere el candado incondicionalmente, si es necesario esperando que éste sea liberado por otro hilo (solamente un hilo por vez puede adquirir un candado; para eso existen).

source: If the *blocking* argument is present, the action depends on its value: if it is False, the lock is only acquired if it can be acquired immediately without waiting, while if it is True, the lock is acquired unconditionally as above.
es: Si el argumento *blocking* está presente, la acción depende de su valor: si es False, el candado es adquirido sólo si puede ser adquirido inmediatamente sin espera, en cambio si es True, el candado es adquirido incondicionalmente como arriba.

source: If the floating-point *timeout* argument is present and positive, it specifies the maximum wait time in seconds before returning. A negative *timeout* argument specifies an unbounded wait. You cannot specify a *timeout* if *blocking* is False.
es: Si el argumento de punto flotante *timeout* está presente y es positivo, éste especifica el tiempo máximo de espera en segundos antes de retornar. Un argumento *timeout* negativo especifica una espera ilimitada. No se puede especificar un *timeout* si *blocking* es False.

source: The return value is ``True`` if the lock is acquired successfully, ``False`` if not.
es: El valor de retorno es ``True`` si el candado (*lock*) se adquirió exitosamente, ``False`` de lo contrario.

source: The *timeout* parameter is new.
es: El parámetro *timeout* es nuevo.

source: Lock acquires can now be interrupted by signals on POSIX.
es: La adquisición de candados ahora puede ser interrumpida por señales en POSIX.

source: Releases the lock. The lock must have been acquired earlier, but not necessarily by the same thread.
es: Libera el candado. El candado debe haber sido adquirido previamente, pero no necesariamente por el mismo hilo.

source: Return the status of the lock: ``True`` if it has been acquired by some thread, ``False`` if not.
es: Retorna el estado del candado: ``True`` si ha sido adquirido por algún hilo, ``False`` de lo contrario.

source: In addition to these methods, lock objects can also be used via the :keyword:`with` statement, e.g.::
es: Además de estos métodos, los objetos candado pueden ser utilizados mediante la declaración :keyword:`with`, por ejemplo::

source: **Caveats:**
es: **Salvedades:**

source: Threads interact strangely with interrupts: the :exc:`KeyboardInterrupt` exception will be received by an arbitrary thread. (When the :mod:`signal` module is available, interrupts always go to the main thread.)
es: Los hilos interactúan de manera extraña con interrupciones: la excepción :exc:`KeyboardInterrupt` va a ser recibida por un hilo cualquiera. (Cuando el módulo :mod:`signal` está disponible, la interrupción siempre se dirige al hilo principal.

source: Calling :func:`sys.exit` or raising the :exc:`SystemExit` exception is equivalent to calling :func:`_thread.exit`.
es: Invocar a :func:`sys.exit` o lanzar la excepción :exc:`SystemExit` equivale a invocar :func:`_thread.exit`.

source: It is not possible to interrupt the :meth:`acquire` method on a lock --- the :exc:`KeyboardInterrupt` exception will happen after the lock has been acquired.
es: No es posible interrumpir el método :meth:`acquire` en un candado. La excepción :exc:`KeyboardInterrupt` tendrá lugar después de que el candado haya sido adquirido.

source: When the main thread exits, it is system defined whether the other threads survive. On most systems, they are killed without executing :keyword:`try` ... :keyword:`finally` clauses or executing object destructors.
es: Cuando el hilo principal sale, ¿sobreviven los otros hilos? Depende de cómo esté definido por el sistema. En la mayoría de los sistemas, los hilos se cierran inmediatamente (*killed*), sin ejecutar las cláusulas :keyword:`try` ... :keyword:`finally` o los destructores del objeto.

source: When the main thread exits, it does not do any of its usual cleanup (except that :keyword:`try` ... :keyword:`finally` clauses are honored), and the standard I/O files are not flushed.
es: Cuando el hilo principal sale, no hace ninguna de las tareas de limpieza habituales (excepto que se haga honor a las cláusulas :keyword:`try` ... :keyword:`finally`), y los archivos de E/S estándar no son liberados.
