Repository: python/python-docs-es
Catalog: library/abc.po
Languages: es

source: :mod:`abc` --- Abstract Base Classes
es: :mod:`abc` --- Clases de Base Abstracta

source: **Source code:** :source:`Lib/abc.py`
es: **Código fuente:** :source:`Lib/abc.py`

source: This module provides the infrastructure for defining :term:`abstract base classes <abstract base class>` (ABCs) in Python, as outlined in :pep:`3119`; see the PEP for why this was added to Python. (See also :pep:`3141` and the :mod:`numbers` module regarding a type hierarchy for numbers based on ABCs.)
es: Este módulo proporciona la infraestructura para definir :term:`clases de base abstracta <abstract base class>` (CBAs) en Python, como se describe en :pep:`3119`; consulte en el PEP el porqué fue agregado a Python. (Véase también :pep:`3141` y el módulo :mod:`numbers` con respecto a una jerarquía de tipos para números basados en CBAs.)

source: The :mod:`collections` module has some concrete classes that derive from ABCs; these can, of course, be further derived. In addition, the :mod:`collections.abc` submodule has some ABCs that can be used to test whether a class or instance provides a particular interface, for example, if it is :term:`hashable` or if it is a mapping.
es: El módulo :mod:`collections` tiene algunas clases concretas que se derivan de ABC; estos, por supuesto, pueden derivarse más. Además, el submódulo :mod:`collections.abc` tiene algunos ABC que se pueden usar para probar si una clase o instancia proporciona una interfaz en particular, por ejemplo, si es :term:`hashable` o si es un mapeo.

source: This module provides the metaclass :class:`ABCMeta` for defining ABCs and a helper class :class:`ABC` to alternatively define ABCs through inheritance:
es: Este módulo provee la metaclase :class:`ABCMeta` para definir CBAs y una clase auxiliar :class:`ABC` para definir CBAs alternativamente a través de herencia:

source: A helper class that has :class:`ABCMeta` as its metaclass. With this class, an abstract base class can be created by simply deriving from :class:`ABC` avoiding sometimes confusing metaclass usage, for example::
es: Una clase auxiliar que tiene una :class:`ABCMeta` como su metaclase. Con esta clase, una clase de base abstracta puede ser creada simplemente derivándola desde :class:`ABC` evitando el uso de metaclases algunas veces confusos, por ejemplo::

source: Note that the type of :class:`ABC` is still :class:`ABCMeta`, therefore inheriting from :class:`ABC` requires the usual precautions regarding metaclass usage, as multiple inheritance may lead to metaclass conflicts. One may also define an abstract base class by passing the metaclass keyword and using :class:`ABCMeta` directly, for example::
es: Tenga en cuenta que el tipo de :class:`ABC` sigue siendo :class:`ABCMeta`, por lo tanto, heredar de :class:`ABC` requiere las precauciones habituales con respecto al uso de metaclases, ya que la herencia múltiple puede dar lugar a conflictos de metaclases. También se puede definir una clase base abstracta pasando la palabra clave metaclase y usando :class:`ABCMeta` directamente, por ejemplo::

source: Metaclass for defining Abstract Base Classes (ABCs).
es: Metaclases para definir Clases de Base Abstracta (CBAs).

source: Use this metaclass to create an ABC. An ABC can be subclassed directly, and then acts as a mix-in class. You can also register unrelated concrete classes (even built-in classes) and unrelated ABCs as "virtual subclasses" -- these and their descendants will be considered subclasses of the registering ABC by the built-in :func:`issubclass` function, but the registering ABC won't show up in their MRO (Method Resolution Order) nor will method implementations defined by the registering ABC be callable (not even via :func:`super`). [#]_
es: Utilice esta metaclase para crear una CBA. Una CBA puede ser heredada directamente y así, actuar como una clase mixta. También se puede registrar clases concretas no relacionadas (incluso clases integradas) y CBAs no relacionadas como "subclases virtuales" -- estas y sus descendientes serán consideradas subclases del CBA registrado por la función integrada :func:`issubclass`, pero la CBA registrada no aparecerá en su *MRO* (Orden de Resolución de Métodos) ni las implementaciones de método definidas por la CBA registrada serán invocables (ni siquiera a través de :func:`super`). [#]_

source: Classes created with a metaclass of :class:`ABCMeta` have the following method:
es: Las clases creadas con una metaclase de :class:`ABCMeta` tienen el siguiente método:

source: Register *subclass* as a "virtual subclass" of this ABC. For example::
es: Registre la *subclase* como una "subclase virtual" de esta CBA. Por ejemplo::

source: Returns the registered subclass, to allow usage as a class decorator.
es: Retorna la subclase registrada, para permitir su uso como decorador de clase.

source: To detect calls to :meth:`register`, you can use the :func:`get_cache_token` function.
es: Para detectar llamadas a :meth:`register`, se puede usar la función :func:`get_cache_token`.

source: You can also override this method in an abstract base class:
es: También se puede redefinir este método en una clase de base abstracta:

source: (Must be defined as a class method.)
es: (Debe ser definido como un método de clase.)

source: Check whether *subclass* is considered a subclass of this ABC. This means that you can customize the behavior of ``issubclass`` further without the need to call :meth:`register` on every class you want to consider a subclass of the ABC. (This class method is called from the :meth:`__subclasscheck__` method of the ABC.)
es: Compruebe si la *subclase* se considera una subclase de esta CBA. Esto significa que puede personalizar aún más el comportamiento de ``issubclass`` sin necesidad de llamar a :meth:`register` en cada clase que desee considerar una subclase de la CBA. (Este método de clase es llamado desde el método :meth:`__subclasscheck__` del CBA.)

source: This method should return ``True``, ``False`` or ``NotImplemented``. If it returns ``True``, the *subclass* is considered a subclass of this ABC. If it returns ``False``, the *subclass* is not considered a subclass of this ABC, even if it would normally be one. If it returns ``NotImplemented``, the subclass check is continued with the usual mechanism.
es: Este método debe retornar ``True``, ``False`` o ``NotImplemented``. Si retorna ``True``, la *subclase* se considera una subclase de esta CBA. Si retorna ``False``, la *subclase* no se considera una subclase de esta CBA, incluso si normalmente fuese una. Si retorna ``NotImplemented``, la comprobación de subclase se continúa con el mecanismo usual.

source: For a demonstration of these concepts, look at this example ABC definition::
es: Para una demostración de estos conceptos, vea este ejemplo de la definición CBA::

source: The ABC ``MyIterable`` defines the standard iterable method, :meth:`~iterator.__iter__`, as an abstract method. The implementation given here can still be called from subclasses. The :meth:`get_iterator` method is also part of the ``MyIterable`` abstract base class, but it does not have to be overridden in non-abstract derived classes.
es: La CBA ``MyIterable`` define el método iterable estándar, :meth:`~iterator.__iter__`, como un método abstracto. La implementación dada aquí aún se puede llamar desde subclases. El método :meth:`get_iterator` también forma parte de la clase de base abstracta ``MyIterable``, pero no tiene que ser reemplazado en clases derivadas no abstractas.

source: The :meth:`__subclasshook__` class method defined here says that any class that has an :meth:`~iterator.__iter__` method in its :attr:`~object.__dict__` (or in that of one of its base classes, accessed via the :attr:`~class.__mro__` list) is considered a ``MyIterable`` too.
es: El método de la clase :meth:`__subclasshook__` definido aquí dice que cualquier clase que tenga un método :meth:`~iterator.__iter__` en su :attr:`~object.__dict__` (o en la de una de sus clases base, a la que se accede a través de la lista :attr:`~class.__mro__`) también se considera un ``MyIterable``.

source: Finally, the last line makes ``Foo`` a virtual subclass of ``MyIterable``, even though it does not define an :meth:`~iterator.__iter__` method (it uses the old-style iterable protocol, defined in terms of :meth:`__len__` and :meth:`__getitem__`). Note that this will not make ``get_iterator`` available as a method of ``Foo``, so it is provided separately.
es: Por último, la última línea convierte ``Foo`` en una subclase virtual de ``MyIterable``, aunque no define un método :meth:`~iterator.__iter__` (utiliza el protocolo iterable al estilo antiguo, definido en términos de :meth:`__len__` y :meth:`__getitem__`). Tenga en cuenta que esto no hará que ``get_iterator`` esté disponible como un método de ``Foo``, por lo que es proporcionado por separado.

source: The :mod:`abc` module also provides the following decorator:
es: El módulo :mod:`abc` también proporciona el siguiente decorador:

source: A decorator indicating abstract methods.
es: Un decorador que indica métodos abstractos.

source: Using this decorator requires that the class's metaclass is :class:`ABCMeta` or is derived from it. A class that has a metaclass derived from :class:`ABCMeta` cannot be instantiated unless all of its abstract methods and properties are overridden. The abstract methods can be called using any of the normal 'super' call mechanisms. :func:`abstractmethod` may be used to declare abstract methods for properties and descriptors.
es: El uso de este decorador requiere que la metaclase de la clase sea :class:`ABCMeta` o se derive de esta. Una clase que tiene una metaclase derivada de :class:`ABCMeta` no puede ser instanciada, a menos que todas sus propiedades y métodos abstractos sean anulados. Los métodos abstractos se pueden invocar usando cualquiera de los mecanismos de 'super' invocación normales. :func:`abstractmethod` se puede utilizar para declarar métodos abstractos para propiedades y descriptores.

source: Dynamically adding abstract methods to a class, or attempting to modify the abstraction status of a method or class once it is created, are only supported using the :func:`update_abstractmethods` function. The :func:`abstractmethod` only affects subclasses derived using regular inheritance; "virtual subclasses" registered with the ABC's :meth:`register` method are not affected.
es: La adición dinámica de métodos abstractos a una clase, o el intento de modificar el estado de abstracción de un método o clase una vez creado, solo se admite mediante la función :func:`update_abstractmethods`. :func:`abstractmethod` solo afecta a las subclases derivadas mediante herencia regular; Las "subclases virtuales" registradas con el método :meth:`register` de ABC no se ven afectadas.

source: When :func:`abstractmethod` is applied in combination with other method descriptors, it should be applied as the innermost decorator, as shown in the following usage examples::
es: Cuando :func:`abstractmethod` se aplica en combinación con otros descriptores de método, se debe aplicar como el decorador más interno, como se muestra en los siguientes ejemplos de uso::

source: In order to correctly interoperate with the abstract base class machinery, the descriptor must identify itself as abstract using :attr:`__isabstractmethod__`. In general, this attribute should be ``True`` if any of the methods used to compose the descriptor are abstract. For example, Python's built-in :class:`property` does the equivalent of::
es: Para interoperar correctamente con la maquinaria de clase de base abstracta, el descriptor debe identificarse como abstracto utilizando :attr:`__isabstractmethod__`. En general, este atributo debe ser ``True`` si alguno de los métodos utilizados para componer el descriptor es abstracto. Por ejemplo, la clase de propiedad integrada de Python :class:`property` hace el equivalente de::

source: Unlike Java abstract methods, these abstract methods may have an implementation. This implementation can be called via the :func:`super` mechanism from the class that overrides it. This could be useful as an end-point for a super-call in a framework that uses cooperative multiple-inheritance.
es: A diferencia de los métodos abstractos de Java, estos métodos abstractos pueden tener una implementación. Esta implementación se puede llamar a través del mecanismo :func:`super` de la clase que lo invalida. Esto podría ser útil como un *end-point* para una super llamada en un *framework* que use herencia múltiple cooperativa.

source: The :mod:`abc` module also supports the following legacy decorators:
es: El módulo :mod:`abc` también es compatible con los siguientes decoradores heredados:

source: It is now possible to use :class:`classmethod` with :func:`abstractmethod`, making this decorator redundant.
es: Ahora es posible utilizar :class:`classmethod` con :func:`abstractmethod`, lo cual hace que este decorador sea redundante.

source: A subclass of the built-in :func:`classmethod`, indicating an abstract classmethod. Otherwise it is similar to :func:`abstractmethod`.
es: Una subclase de la :func:`classmethod` incorporada, indicando un método de clase abstracto. De otra forma, es similar a :func:`abstractmethod`.

source: This special case is deprecated, as the :func:`classmethod` decorator is now correctly identified as abstract when applied to an abstract method::
es: Este caso especial está obsoleto, ya que el decorador :func:`classmethod` ahora es identificado correctamente como abstracto cuando se aplica a un método abstracto:

source: It is now possible to use :class:`staticmethod` with :func:`abstractmethod`, making this decorator redundant.
es: Ahora es posible utilizar :class:`staticmethod` con :func:`abstractmethod`, haciendo que este decorador sea redundante.

source: A subclass of the built-in :func:`staticmethod`, indicating an abstract staticmethod. Otherwise it is similar to :func:`abstractmethod`.
es: Una subclase de la :func:`staticmethod` incorporada, indicando un método estático abstracto. De otra forma, es similar a :func:`abstractmethod`.

source: This special case is deprecated, as the :func:`staticmethod` decorator is now correctly identified as abstract when applied to an abstract method::
es: Este caso especial está obsoleto, ya que el decorador :func:`staticmethod` ahora es identificado correctamente como abstracto cuando se aplica a un método abstracto:

source: It is now possible to use :class:`property`, :meth:`property.getter`, :meth:`property.setter` and :meth:`property.deleter` with :func:`abstractmethod`, making this decorator redundant.
es: Ahora es posible utilizar :class:`property`, :meth:`property.getter`, :meth:`property.setter` y :meth:`property.deleter` con :func:`abstractmethod`, lo cual hace que este decorador sea redundante.

source: A subclass of the built-in :func:`property`, indicating an abstract property.
es: Una subclase de la :func:`property` integrada, que indica una propiedad abstracta.

source: This special case is deprecated, as the :func:`property` decorator is now correctly identified as abstract when applied to an abstract method::
es: Este caso especial está obsoleto, ya que el decorador :func:`property` ahora es identificado correctamente como abstracto cuando es aplicado a un método abstracto::

source: The above example defines a read-only property; you can also define a read-write abstract property by appropriately marking one or more of the underlying methods as abstract::
es: En el ejemplo anterior se define una propiedad de solo lectura; también se puede definir una propiedad abstracta de lectura y escritura marcando adecuadamente uno o varios de los métodos subyacentes como abstractos::

source: If only some components are abstract, only those components need to be updated to create a concrete property in a subclass::
es: Si solo algunos componentes son abstractos, solo estos componentes necesitan ser actualizados para crear una propiedad concreta en una subclase::

source: The :mod:`abc` module also provides the following functions:
es: El módulo :mod:`abc` también proporciona las siguientes funciones:

source: Returns the current abstract base class cache token.
es: Retorna el token de caché de la clase base abstracta actual.

source: The token is an opaque object (that supports equality testing) identifying the current version of the abstract base class cache for virtual subclasses. The token changes with every call to :meth:`ABCMeta.register` on any ABC.
es: El token es un objeto opaco (que admite pruebas de igualdad) que identifica la versión actual de la caché de clases de base abstractas para subclases virtuales. El token cambia con cada llamada a :meth:`ABCMeta.register` en cualquier CBA.

source: A function to recalculate an abstract class's abstraction status. This function should be called if a class's abstract methods have been implemented or changed after it was created. Usually, this function should be called from within a class decorator.
es: Una función para recalcular el estado de abstracción de una clase abstracta. Se debe llamar a esta función si los métodos abstractos de una clase se han implementado o cambiado después de su creación. Por lo general, esta función debe llamarse desde dentro de un decorador de clases.

source: Returns *cls*, to allow usage as a class decorator.
es: Retorna *cls*, para permitir su uso como decorador de clases.

source: If *cls* is not an instance of :class:`ABCMeta`, does nothing.
es: Si *cls* no es una instancia de :class:`ABCMeta`, no hace nada.

source: This function assumes that *cls*'s superclasses are already updated. It does not update any subclasses.
es: Esta función asume que las superclases de *cls* ya están actualizadas. No actualiza subclases.

source: Footnotes
es: Notas al pie

source: C++ programmers should note that Python's virtual base class concept is not the same as C++'s.
es: Los desarrolladores de C++ pueden notar que el concepto de clase base virtual de Python no es el mismo que en C++.
