Repository: python/python-docs-es
Catalog: library/argparse.po
Languages: es

source: When :class:`ArgumentParser` generates help messages, it needs some way to refer to each expected argument. By default, ArgumentParser objects use the dest_ value as the "name" of each object. By default, for positional argument actions, the dest_ value is used directly, and for optional argument actions, the dest_ value is uppercased. So, a single positional argument with ``dest='bar'`` will be referred to as ``bar``. A single optional argument ``--foo`` that should be followed by a single command-line argument will be referred to as ``FOO``. An example::
es: Cuando :class:`ArgumentParser` genera mensajes de ayuda, necesita alguna forma de referirse a cada argumento esperado. Por defecto, los objetos *ArgumentParser* utilizan el valor dest_ como "nombre" de cada objeto. Por defecto, para las acciones de argumento posicional, el valor dest_ se utiliza directamente, y para las acciones de argumento opcional, el valor dest_ está en mayúsculas. Así, un único argumento posicional con ``dest='bar'`` se denominará ``bar``. Un único argumento opcional ``--foo`` que debería seguirse por un único argumento de línea de comandos se denominará ``FOO``. Un ejemplo::

source: An alternative name can be specified with ``metavar``::
es: Un nombre alternativo se puede especificar con ``metavar``::

source: Note that ``metavar`` only changes the *displayed* name - the name of the attribute on the :meth:`~ArgumentParser.parse_args` object is still determined by the dest_ value.
es: Ten en cuenta que ``metavar`` sólo cambia el nombre *mostrado* - el nombre del atributo en el objeto :meth:`~ArgumentParser.parse_args` sigue estando determinado por el valor dest_.

source: Different values of ``nargs`` may cause the metavar to be used multiple times. Providing a tuple to ``metavar`` specifies a different display for each of the arguments::
es: Diferentes valores de ``nargs`` pueden causar que *metavar* sea usado múltiples veces. Proporcionar una tupla a ``metavar`` especifica una visualización diferente para cada uno de los argumentos::

source: Most :class:`ArgumentParser` actions add some value as an attribute of the object returned by :meth:`~ArgumentParser.parse_args`. The name of this attribute is determined by the ``dest`` keyword argument of :meth:`~ArgumentParser.add_argument`. For positional argument actions, ``dest`` is normally supplied as the first argument to :meth:`~ArgumentParser.add_argument`::
es: La mayoría de las acciones :class:`ArgumentParser` añaden algún valor como atributo del objeto retornado por :meth:`~ArgumentParser.parse_args`. El nombre de este atributo está determinado por el argumento de palabra clave ``dest`` de :meth:`~ArgumentParser.add_argument`. Para acciones de argumento posicional, se proporciona ``dest`` normalmente como primer argumento de :meth:`~ArgumentParser.add_argument`::

source: For optional argument actions, the value of ``dest`` is normally inferred from the option strings. :class:`ArgumentParser` generates the value of ``dest`` by taking the first long option string and stripping away the initial ``--`` string. If no long option strings were supplied, ``dest`` will be derived from the first short option string by stripping the initial ``-`` character. Any internal ``-`` characters will be converted to ``_`` characters to make sure the string is a valid attribute name. The examples below illustrate this behavior::
es: Para las acciones de argumentos opcionales, el valor de ``dest`` se infiere normalmente de las cadenas de caracteres de opción. :class:`ArgumentParser` genera el valor de ``dest`` tomando la primera cadena de caracteres de opción larga y quitando la cadena inicial ``--``. Si no se proporcionaron cadenas de caracteres de opción largas, ``dest`` se derivará de la primera cadena de caracteres de opción corta quitando el carácter ``-``. Cualquier carácter ``-`` interno se convertirá a caracteres ``_`` para asegurarse de que la cadena de caracteres es un nombre de atributo válido. Los ejemplos siguientes ilustran este comportamiento::

source: ``dest`` allows a custom attribute name to be provided::
es: ``dest`` permite que se proporcione un nombre de atributo personalizado::

source: Action classes
es: Las clases *Action*

source: Action classes implement the Action API, a callable which returns a callable which processes arguments from the command-line. Any object which follows this API may be passed as the ``action`` parameter to :meth:`add_argument`.
es: Las clases *Action* implementan la API de *Action*, un invocable que retorna un invocable que procesa los argumentos de la línea de comandos. Cualquier objeto que siga esta API puede ser pasado como el parámetro ``action`` a :meth:`add_argument`.

source: Action objects are used by an ArgumentParser to represent the information needed to parse a single argument from one or more strings from the command line. The Action class must accept the two positional arguments plus any keyword arguments passed to :meth:`ArgumentParser.add_argument` except for the ``action`` itself.
es: Los objetos *Action* son utilizados por un *ArgumentParser* para representar la información necesaria para analizar un sólo argumento de una o más cadenas de caracteres de la línea de comandos. La clase *Action* debe aceptar los dos argumentos de posición más cualquier argumento de palabra clave pasado a :meth:`ArgumentParser.add_argument` excepto para la propia ``action``.

source: Instances of Action (or return value of any callable to the ``action`` parameter) should have attributes "dest", "option_strings", "default", "type", "required", "help", etc. defined. The easiest way to ensure these attributes are defined is to call ``Action.__init__``.
es: Las instancias de *Action* (o el valor de retorno de cualquier invocable al parámetro ``action`` ) deben tener definidos los atributos *”dest”*, *”option_strings”*, *”default”*, *”type”*, *”required”*, *”help”*, etc. La forma más fácil de asegurar que estos atributos estén definidos es llamar a ``Action.__init__``.

source: Action instances should be callable, so subclasses must override the ``__call__`` method, which should accept four parameters:
es: Las instancias de *Action* deben ser invocables, por lo que las subclases deben anular el método ``__call__``, que debería aceptar cuatro parámetros:

source: ``parser`` - The ArgumentParser object which contains this action.
es: ``parser`` - El objeto *ArgumentParser* que contiene esta acción.

source: ``namespace`` - The :class:`Namespace` object that will be returned by :meth:`~ArgumentParser.parse_args`. Most actions add an attribute to this object using :func:`setattr`.
es: ``namespace`` - El objeto :class:`Namespace` que será retornado por :meth:`~ArgumentParser.parse_args`. La mayoría de las acciones añaden un atributo a este objeto usando :func:`setattr`.

source: ``values`` - The associated command-line arguments, with any type conversions applied. Type conversions are specified with the type_ keyword argument to :meth:`~ArgumentParser.add_argument`.
es: ``values`` - Los argumentos de la línea de comandos asociados, con cualquier tipo de conversión aplicada. Las conversiones de tipos se especifican con el argumento de palabra clave type_ a :meth:`~ArgumentParser.add_argument`.

source: ``option_string`` - The option string that was used to invoke this action. The ``option_string`` argument is optional, and will be absent if the action is associated with a positional argument.
es: ``option_string`` - La cadena de caracteres de opción que se usó para invocar esta acción. El argumento ``option_string`` es opcional, y estará ausente si la acción está asociada a un argumento de posición.

source: The ``__call__`` method may perform arbitrary actions, but will typically set attributes on the ``namespace`` based on ``dest`` and ``values``.
es: El método ``__call__`` puede realizar acciones arbitrarias, pero típicamente estable atributos en ``namespace`` basados en ``dest`` y ``values``.

source: The parse_args() method
es: El método *parse_args()*

source: Convert argument strings to objects and assign them as attributes of the namespace. Return the populated namespace.
es: Convierte las cadenas de caracteres de argumentos en objetos y los asigna como atributos del espacio de nombres (*namespace*). Retorna el espacio de nombres (*namespace*) ocupado.

source: Previous calls to :meth:`add_argument` determine exactly what objects are created and how they are assigned. See the documentation for :meth:`add_argument` for details.
es: Las llamadas previas a :meth:`add_argument` determinan exactamente qué objetos se crean y cómo se asignan. Mira la documentación de :meth:`add_argument` para más detalles.

source: args_ - List of strings to parse. The default is taken from :data:`sys.argv`.
es: args_ - Lista de cadenas de caracteres para analizar. El valor por defecto se toma de :data:`sys.argv`.

source: namespace_ - An object to take the attributes. The default is a new empty :class:`Namespace` object.
es: namespace_ - Un objeto para obtener los atributos. Por defecto es un nuevo objeto vacío :class:`Namespace`.

source: Option value syntax
es: Sintaxis del valor de la opción

source: The :meth:`~ArgumentParser.parse_args` method supports several ways of specifying the value of an option (if it takes one). In the simplest case, the option and its value are passed as two separate arguments::
es: El método :meth:`~ArgumentParser.parse_args` soporta diversas formas de especificar el valor de una opción (si requiere uno). En el caso más simple, la opción y su valor se pasan como dos argumentos separados::

source: For long options (options with names longer than a single character), the option and value can also be passed as a single command-line argument, using ``=`` to separate them::
es: En el caso de opciones largas (opciones con nombres más largos que un sólo carácter), la opción y el valor también se pueden pasar como un sólo argumento de línea de comandos, utilizando ``=`` para separarlos::

source: For short options (options only one character long), the option and its value can be concatenated::
es: Para las opciones cortas (opciones de un sólo carácter de largo), la opción y su valor pueden ser concatenados::

source: Several short options can be joined together, using only a single ``-`` prefix, as long as only the last option (or none of them) requires a value::
es: Se pueden unir varias opciones cortas, usando un sólo prefijo ``-``, siempre y cuando sólo la última opción (o ninguna de ellas) requiera un valor::

source: Invalid arguments
es: Argumentos no válidos

source: While parsing the command line, :meth:`~ArgumentParser.parse_args` checks for a variety of errors, including ambiguous options, invalid types, invalid options, wrong number of positional arguments, etc. When it encounters such an error, it exits and prints the error along with a usage message::
es: Mientras analiza la línea de comandos, :meth:`~ArgumentParser.parse_args` comprueba una variedad de errores, incluyendo opciones ambiguas, tipos no válidos, opciones no válidas, número incorrecto de argumentos de posición, etc. Cuando encuentra un error de este tipo, termina y muestra el error junto con un mensaje de uso::

source: Arguments containing ``-``
es: Argumentos conteniendo ``-``

source: The :meth:`~ArgumentParser.parse_args` method attempts to give errors whenever the user has clearly made a mistake, but some situations are inherently ambiguous. For example, the command-line argument ``-1`` could either be an attempt to specify an option or an attempt to provide a positional argument. The :meth:`~ArgumentParser.parse_args` method is cautious here: positional arguments may only begin with ``-`` if they look like negative numbers and there are no options in the parser that look like negative numbers::
es: El método :meth:`~ArgumentParser.parse_args` busca generar errores cuando el usuario ha cometido claramente una equivocación, pero algunas situaciones son inherentemente ambiguas. Por ejemplo, el argumento de línea de comandos ``-1`` podría ser un intento de especificar una opción o un intento de proporcionar un argumento de posición. El método :meth:`~ArgumentParser.parse_args` es cauteloso aquí: los argumentos de posición sólo pueden comenzar con ``-`` si se ven como números negativos y no hay opciones en el analizador que se puedan ver como números negativos ::

source: If you have positional arguments that must begin with ``-`` and don't look like negative numbers, you can insert the pseudo-argument ``'--'`` which tells :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
es: Si tienes argumentos de posición que deben comenzar con ``-`` y no parecen números negativos, puedes insertar el pseudo-argumento ``'--'`` que indica a :meth:`~ArgumentParser.parse_args` que todo lo que sigue es un argumento de posición::

source: Argument abbreviations (prefix matching)
es: Abreviaturas de los argumentos (coincidencia de prefijos)

source: The :meth:`~ArgumentParser.parse_args` method :ref:`by default <allow_abbrev>` allows long options to be abbreviated to a prefix, if the abbreviation is unambiguous (the prefix matches a unique option)::
es: El método :meth:`~ArgumentParser.parse_args` :ref:`por defecto <allow_abbrev>` permite abreviar las opciones largas a un prefijo, si la abreviatura es inequívoca (el prefijo coincide con una opción única)::

source: An error is produced for arguments that could produce more than one options. This feature can be disabled by setting :ref:`allow_abbrev` to ``False``.
es: Se incurre en un error por argumentos que podrían derivar en más de una opción. Esta característica puede ser desactivada poniendo :ref:`allow_abbrev` a ``False``.

source: Beyond ``sys.argv``
es: Más allá de ``sys.argv``

source: Sometimes it may be useful to have an ArgumentParser parse arguments other than those of :data:`sys.argv`. This can be accomplished by passing a list of strings to :meth:`~ArgumentParser.parse_args`. This is useful for testing at the interactive prompt::
es: A veces puede ser útil tener un *ArgumentParser* analizando argumentos que no sean los de :data:`sys.argv`. Esto se puede lograr pasando una lista de cadenas de caracteres a :meth:`~ArgumentParser.parse_args`. Esto es útil para probar en el *prompt* interactivo::

source: The Namespace object
es: El objeto *Namespace*

source: Simple class used by default by :meth:`~ArgumentParser.parse_args` to create an object holding attributes and return it.
es: Clase simple utilizada por defecto por :meth:`~ArgumentParser.parse_args` para crear un objeto que contenga atributos y retornarlo.

source: This class is deliberately simple, just an :class:`object` subclass with a readable string representation. If you prefer to have dict-like view of the attributes, you can use the standard Python idiom, :func:`vars`::
es: Esta clase es deliberadamente simple, sólo una subclase :class:`object` con una representación de cadena de texto legible. Si prefieres tener una vista en forma de diccionario de los atributos, puedes usar el lenguaje estándar de Python, :func:`vars`::

source: It may also be useful to have an :class:`ArgumentParser` assign attributes to an already existing object, rather than a new :class:`Namespace` object. This can be achieved by specifying the ``namespace=`` keyword argument::
es: También puede ser útil tener un :class:`ArgumentParser` que asigne atributos a un objeto ya existente, en lugar de un nuevo objeto :class:`Namespace`. Esto se puede lograr especificando el argumento de palabra clave ``namespace=``::

source: Other utilities
es: Otras utilidades

source: Sub-commands
es: Sub-comandos

source: Many programs split up their functionality into a number of sub-commands, for example, the ``svn`` program can invoke sub-commands like ``svn checkout``, ``svn update``, and ``svn commit``. Splitting up functionality this way can be a particularly good idea when a program performs several different functions which require different kinds of command-line arguments. :class:`ArgumentParser` supports the creation of such sub-commands with the :meth:`add_subparsers` method. The :meth:`add_subparsers` method is normally called with no arguments and returns a special action object. This object has a single method, :meth:`~ArgumentParser.add_parser`, which takes a command name and any :class:`ArgumentParser` constructor arguments, and returns an :class:`ArgumentParser` object that can be modified as usual.
es: Muchos programas dividen su funcionalidad en varios sub-comandos, por ejemplo, el programa ``svn`` puede llamar sub-comandos como ``svn checkout``, ``svn update``, y ``svn commit``. Dividir la funcionalidad de esta forma puede ser una idea particularmente buena cuando un programa realiza varias funciones diferentes que requieren diferentes tipos de argumentos en la línea de comandos. :class:`ArgumentParser` soporta la creación de tales sub-comandos con el método :meth:`add_subparsers`. El método :meth:`add_subparsers` se llama normalmente sin argumentos y retorna un objeto de acción especial. Este objeto tiene un único método, :meth:`~ArgumentParser.add_parser`, que toma un nombre de comando y cualquier argumento de construcción :class:`ArgumentParser`, y retorna un objeto :class:`ArgumentParser` que puede ser modificado de la forma habitual.

source: Description of parameters:
es: Descripción de los parámetros:

source: title - title for the sub-parser group in help output; by default "subcommands" if description is provided, otherwise uses title for positional arguments
es: *title* - título para el grupo del analizador secundario en la salida de la ayuda; por defecto *"subcommands"* si se proporciona la descripción, de lo contrario utiliza el título para los argumentos de posición

source: description - description for the sub-parser group in help output, by default ``None``
es: *description* - descripción para el grupo del analizador secundario en la salida de la ayuda, por defecto ``None``

source: prog - usage information that will be displayed with sub-command help, by default the name of the program and any positional arguments before the subparser argument
es: *prog* - información de uso que se mostrará con la ayuda de los sub-comandos, por defecto el nombre del programa y cualquier argumento de posición antes del argumento del analizador secundario

source: parser_class - class which will be used to create sub-parser instances, by default the class of the current parser (e.g. ArgumentParser)
es: *parser_class* - clase que se usará para crear instancias de análisis secundario, por defecto la clase del analizador actual (por ejemplo, ArgumentParser)

source: action_ - the basic type of action to be taken when this argument is encountered at the command line
es: action_ - el tipo básico de acción a tomar cuando este argumento se encuentre en la línea de comandos

source: dest_ - name of the attribute under which sub-command name will be stored; by default ``None`` and no value is stored
es: dest_ - nombre del atributo en el que se almacenará el nombre del sub-comando; por defecto ``None`` y no se almacena ningún valor

source: required_ - Whether or not a subcommand must be provided, by default ``False`` (added in 3.7)
es: required_ - Si se debe proporcionar o no un sub-comando, por defecto ``False`` (añadido en 3.7)

source: help_ - help for sub-parser group in help output, by default ``None``
es: help_ - ayuda para el grupo de análisis secundario en la salida de la ayuda, por defecto ``None``

source: metavar_ - string presenting available sub-commands in help; by default it is ``None`` and presents sub-commands in form {cmd1, cmd2, ..}
es: metavar_ - cadena de caracteres que presenta los sub-comandos disponibles en la ayuda; por defecto es ``None`` y presenta los sub-comandos de la forma {cmd1, cmd2, ..}

source: Some example usage::
es: Algún ejemplo de uso::

source: Note that the object returned by :meth:`parse_args` will only contain attributes for the main parser and the subparser that was selected by the command line (and not any other subparsers). So in the example above, when the ``a`` command is specified, only the ``foo`` and ``bar`` attributes are present, and when the ``b`` command is specified, only the ``foo`` and ``baz`` attributes are present.
es: Ten en cuenta que el objeto retornado por :meth:`parse_args` sólo contendrá atributos para el analizador principal y el analizador secundario que fue seleccionado por la línea de comandos (y no cualquier otro analizador secundario). Así que en el ejemplo anterior, cuando se especifica el comando ``a``, sólo están presentes los atributos ``foo`` y ``bar``, y cuando se especifica el comando``b``, sólo están presentes los atributos ``foo`` y ``baz``.

source: Similarly, when a help message is requested from a subparser, only the help for that particular parser will be printed. The help message will not include parent parser or sibling parser messages. (A help message for each subparser command, however, can be given by supplying the ``help=`` argument to :meth:`add_parser` as above.)
es: Del mismo modo, cuando se solicita un mensaje de ayuda de un analizador secundario, sólo se imprimirá la ayuda para ese analizador en particular. El mensaje de ayuda no incluirá mensajes del analizador principal o de analizadores relacionados. (Sin embargo, se puede dar un mensaje de ayuda para cada comando del analizador secundario suministrando el argumento ``help=`` a :meth:`add_parser` como se ha indicado anteriormente).

source: The :meth:`add_subparsers` method also supports ``title`` and ``description`` keyword arguments. When either is present, the subparser's commands will appear in their own group in the help output. For example::
es: El método :meth:`add_subparsers` también soporta los argumentos de palabra clave``title`` y ``description``. Cuando cualquiera de los dos esté presente, los comandos del analizador secundario aparecerán en su propio grupo en la salida de la ayuda. Por ejemplo::

source: Furthermore, ``add_parser`` supports an additional ``aliases`` argument, which allows multiple strings to refer to the same subparser. This example, like ``svn``, aliases ``co`` as a shorthand for ``checkout``::
es: Además, ``add_parser`` soporta un argumento adicional ``aliases``, que permite que múltiples cadenas se refieran al mismo analizador secundario. Este ejemplo, algo del estilo``svn``, alias ``co`` como abreviatura para ``checkout``::

source: One particularly effective way of handling sub-commands is to combine the use of the :meth:`add_subparsers` method with calls to :meth:`set_defaults` so that each subparser knows which Python function it should execute. For example::
es: Una forma particularmente efectiva de manejar los sub-comandos es combinar el uso del método :meth:`add_subparsers` con llamadas a :meth:`set_defaults` para que cada analizador secundario sepa qué función de Python debe ejecutar. Por ejemplo::
