Repository: python/python-docs-es
Catalog: library/argparse.po
Languages: es

source: This way, you can let :meth:`parse_args` do the job of calling the appropriate function after argument parsing is complete. Associating functions with actions like this is typically the easiest way to handle the different actions for each of your subparsers. However, if it is necessary to check the name of the subparser that was invoked, the ``dest`` keyword argument to the :meth:`add_subparsers` call will work::
es: De esta manera, puedes dejar que :meth:`parse_args` haga el trabajo de llamar a la función apropiada después de que el análisis de los argumentos se haya completado. Asociar funciones con acciones como esta es típicamente la forma más fácil de manejar las diferentes acciones para cada uno de tus analizadores secundarios. Sin embargo, si es necesario comprobar el nombre del analizador secundario que se ha invocado, el argumento de palabra clave ``dest`` a la llamada :meth:`add_subparsers` hará el trabajo::

source: New *required* keyword argument.
es: Nuevo argumento de palabra clave *required*.

source: FileType objects
es: Objetos *FileType*

source: The :class:`FileType` factory creates objects that can be passed to the type argument of :meth:`ArgumentParser.add_argument`. Arguments that have :class:`FileType` objects as their type will open command-line arguments as files with the requested modes, buffer sizes, encodings and error handling (see the :func:`open` function for more details)::
es: El generador :class:`FileType` crea objetos que pueden ser transferidos al argumento tipo de :meth:`ArgumentParser.add_argument`. Los argumentos que tienen objetos :class:`FileType` como su tipo abrirán los argumentos de líneas de comandos como archivos con los modos, tamaños de búfer, codificaciones y manejo de errores solicitados (véase la función :func:`open` para más detalles)::

source: FileType objects understand the pseudo-argument ``'-'`` and automatically convert this into ``sys.stdin`` for readable :class:`FileType` objects and ``sys.stdout`` for writable :class:`FileType` objects::
es: Los objetos *FileType* entienden el pseudo-argumento ``'-'`` y lo convierten automáticamente en ``sys.stdin`` para objetos de lectura :class:`FileType` y ``sys.stdout`` para objetos de escritura :class:`FileType`::

source: The *encodings* and *errors* keyword arguments.
es: Los argumentos de palabra clave *encodings* y *errors*.

source: Argument groups
es: Grupos de argumentos

source: By default, :class:`ArgumentParser` groups command-line arguments into "positional arguments" and "optional arguments" when displaying help messages. When there is a better conceptual grouping of arguments than this default one, appropriate groups can be created using the :meth:`add_argument_group` method::
es: Por defecto, :class:`ArgumentParser` agrupa los argumentos de la línea de comandos en "argumentos de posición" y "argumentos opcionales" al mostrar los mensajes de ayuda. Cuando hay una mejor agrupación conceptual de argumentos que esta predeterminada, se pueden crear grupos apropiados usando el método :meth:`add_argument_group`::

source: The :meth:`add_argument_group` method returns an argument group object which has an :meth:`~ArgumentParser.add_argument` method just like a regular :class:`ArgumentParser`. When an argument is added to the group, the parser treats it just like a normal argument, but displays the argument in a separate group for help messages. The :meth:`add_argument_group` method accepts *title* and *description* arguments which can be used to customize this display::
es: El método :meth:`add_argument_group` retorna un objeto de grupo de argumentos que tiene un método :meth:`~ArgumentParser.add_argument` igual que un :class:`ArgumentParser` convencional. Cuando se añade un argumento al grupo, el analizador lo trata como un argumento cualquiera, pero presenta el argumento en un grupo aparte para los mensajes de ayuda. El método :meth:`add_argument_group` acepta los argumentos *title* y *description* que pueden ser usados para personalizar esta presentación::

source: Note that any arguments not in your user-defined groups will end up back in the usual "positional arguments" and "optional arguments" sections.
es: Ten en cuenta que cualquier argumento que no esté en los grupos definidos por el usuario terminará en las secciones habituales de "argumentos de posición" y "argumentos opcionales".

source: Mutual exclusion
es: Exclusión mutua

source: Create a mutually exclusive group. :mod:`argparse` will make sure that only one of the arguments in the mutually exclusive group was present on the command line::
es: Crear un grupo de exclusividad mutua. :mod:`argparse` se asegurará de que sólo uno de los argumentos del grupo de exclusividad mutua esté presente en la línea de comandos::

source: The :meth:`add_mutually_exclusive_group` method also accepts a *required* argument, to indicate that at least one of the mutually exclusive arguments is required::
es: El método :meth:`add_mutually_exclusive_group` también acepta un argumento *required*, para indicar que se requiere al menos uno de los argumentos mutuamente exclusivos::

source: Note that currently mutually exclusive argument groups do not support the *title* and *description* arguments of :meth:`~ArgumentParser.add_argument_group`.
es: Ten en cuenta que actualmente los grupos de argumentos mutuamente exclusivos no admiten los argumentos *title* y *description* de :meth:`~ArgumentParser.add_argument_group`.

source: Parser defaults
es: Valores por defecto del analizador

source: Most of the time, the attributes of the object returned by :meth:`parse_args` will be fully determined by inspecting the command-line arguments and the argument actions. :meth:`set_defaults` allows some additional attributes that are determined without any inspection of the command line to be added::
es: La mayoría de las veces, los atributos del objeto retornado por :meth:`parse_args` se determinarán completamente inspeccionando los argumentos de la línea de comandos y las acciones de los argumentos. :meth:`set_defaults` permite que se añadan algunos atributos adicionales que se determinan sin ninguna inspección de la línea de comandos::

source: Note that parser-level defaults always override argument-level defaults::
es: Ten en cuenta que los valores por defecto a nivel analizador siempre prevalecen sobre los valores por defecto a nivel argumento::

source: Parser-level defaults can be particularly useful when working with multiple parsers. See the :meth:`~ArgumentParser.add_subparsers` method for an example of this type.
es: Los valores por defecto a nivel analizador pueden ser muy útiles cuando se trabaja con varios analizadores. Consulta el método :meth:`~ArgumentParser.add_subparsers` para ver un ejemplo de este tipo.

source: Get the default value for a namespace attribute, as set by either :meth:`~ArgumentParser.add_argument` or by :meth:`~ArgumentParser.set_defaults`::
es: Obtiene el valor por defecto para un atributo del espacio de nombres (*namespace*), establecido ya sea por :meth:`~ArgumentParser.add_argument` o por :meth:`~ArgumentParser.set_defaults`::

source: Printing help
es: Mostrando la ayuda

source: In most typical applications, :meth:`~ArgumentParser.parse_args` will take care of formatting and printing any usage or error messages. However, several formatting methods are available:
es: En la mayoría de las aplicaciones típicas, :meth:`~ArgumentParser.parse_args` se encargará de dar formato y mostrar cualquier mensaje de uso o de error. Sin embargo, hay varios métodos para dar formato disponibles:

source: Print a brief description of how the :class:`ArgumentParser` should be invoked on the command line. If *file* is ``None``, :data:`sys.stdout` is assumed.
es: Muestra una breve descripción de cómo se debe invocar el :class:`ArgumentParser` en la línea de comandos. Si *file* es ``None``, se asume :data:`sys.stdout`.

source: Print a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`. If *file* is ``None``, :data:`sys.stdout` is assumed.
es: Muestra un mensaje de ayuda, incluyendo el uso del programa e información sobre los argumentos registrados en el :class:`ArgumentParser`. Si *file* es ``None``, se asume :data:`sys.stdout`.

source: There are also variants of these methods that simply return a string instead of printing it:
es: También hay variantes de estos métodos que simplemente retornan una cadena de caracteres en lugar de mostrarla:

source: Return a string containing a brief description of how the :class:`ArgumentParser` should be invoked on the command line.
es: Retorna una cadena de caracteres que contiene una breve descripción de cómo se debe invocar el :class:`ArgumentParser` en la línea de comandos.

source: Return a string containing a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`.
es: Retorna una cadena de caracteres que contiene un mensaje de ayuda, incluyendo el uso del programa e información sobre los argumentos registrados en el :class:`ArgumentParser`.

source: Partial parsing
es: Análisis parcial

source: Sometimes a script may only parse a few of the command-line arguments, passing the remaining arguments on to another script or program. In these cases, the :meth:`~ArgumentParser.parse_known_args` method can be useful. It works much like :meth:`~ArgumentParser.parse_args` except that it does not produce an error when extra arguments are present. Instead, it returns a two item tuple containing the populated namespace and the list of remaining argument strings.
es: A veces una secuencia de comandos (*script*) sólo puede analizar algunos de los argumentos de la línea de comandos, pasando el resto de los argumentos a otra secuencia o programa. En estos casos, el método :meth:`~ArgumentParser.parse_known_args` puede ser útil. Funciona de forma muy parecida a :meth:`~ArgumentParser.parse_args` excepto que no produce un error cuando hay argumentos extra presentes. En lugar de ello, retorna una tupla de dos elementos que contiene el espacio de nombres ocupado y la lista de argumentos de cadena de caracteres restantes.

source: :ref:`Prefix matching <prefix-matching>` rules apply to :meth:`parse_known_args`. The parser may consume an option even if it's just a prefix of one of its known options, instead of leaving it in the remaining arguments list.
es: :ref:`Coincidencia de prefijos <prefix-matching>` las reglas se aplican a :meth:`parse_known_args`. El analizador puede consumir una opción aunque sea sólo un prefijo de una de sus opciones conocidas, en lugar de dejarla en la lista de argumentos restantes.

source: Customizing file parsing
es: Personalizando el análisis de archivos

source: Arguments that are read from a file (see the *fromfile_prefix_chars* keyword argument to the :class:`ArgumentParser` constructor) are read one argument per line. :meth:`convert_arg_line_to_args` can be overridden for fancier reading.
es: Los argumentos que se leen de un archivo (mira el argumento de palabra clave *fromfile_prefix_chars* para el constructor :class:`ArgumentParser`) se leen uno por línea. :meth:`convert_arg_line_to_args` puede ser invalidado para una lectura más elegante.

source: This method takes a single argument *arg_line* which is a string read from the argument file. It returns a list of arguments parsed from this string. The method is called once per line read from the argument file, in order.
es: Este método utiliza un sólo argumento *arg_line* que es una cadena de caracteres leída desde el archivo de argumentos. Retorna una lista de argumentos analizados a partir de esta cadena de caracteres. El método se llama una vez por línea leída del fichero de argumentos, en orden.

source: A useful override of this method is one that treats each space-separated word as an argument. The following example demonstrates how to do this::
es: Una alternativa útil de este método es la que trata cada palabra separada por un espacio como un argumento. El siguiente ejemplo demuestra cómo hacerlo::

source: Exiting methods
es: Métodos de salida

source: This method terminates the program, exiting with the specified *status* and, if given, it prints a *message* before that. The user can override this method to handle these steps differently::
es: Este método finaliza el programa, saliendo con el *status* especificado y, si corresponde, muestra un *message* antes de eso. El usuario puede anular este método para manejar estos pasos de manera diferente::

source: This method prints a usage message including the *message* to the standard error and terminates the program with a status code of 2.
es: Este método imprime un mensaje de uso incluyendo el *message* para error estándar y finaliza el programa con código de estado 2.

source: Intermixed parsing
es: Análisis entremezclado

source: A number of Unix commands allow the user to intermix optional arguments with positional arguments. The :meth:`~ArgumentParser.parse_intermixed_args` and :meth:`~ArgumentParser.parse_known_intermixed_args` methods support this parsing style.
es: Una serie de comandos *Unix* permiten al usuario mezclar argumentos opcionales con argumentos de posición. Los métodos :meth:`~ArgumentParser.parse_intermixed_args` y :meth:`~ArgumentParser.parse_known_intermixed_args` soportan este modo de análisis.

source: These parsers do not support all the argparse features, and will raise exceptions if unsupported features are used. In particular, subparsers, ``argparse.REMAINDER``, and mutually exclusive groups that include both optionals and positionals are not supported.
es: Estos analizadores no soportan todas las capacidades de *argparse*, y generarán excepciones si se utilizan capacidades no soportadas. En particular, los analizadores secundarios, ``argparse.REMAINDER``, y los grupos mutuamente exclusivos que incluyen tanto opcionales como de posición no están soportados.

source: The following example shows the difference between :meth:`~ArgumentParser.parse_known_args` and :meth:`~ArgumentParser.parse_intermixed_args`: the former returns ``['2', '3']`` as unparsed arguments, while the latter collects all the positionals into ``rest``. ::
es: El siguiente ejemplo muestra la diferencia entre :meth:`~ArgumentParser.parse_known_args` y :meth:`~ArgumentParser.parse_intermixed_args`: el primero retorna ``['2', '3']`` como argumentos sin procesar, mientras que el segundo recoge todos los de posición en ``rest``. ::

source: :meth:`~ArgumentParser.parse_known_intermixed_args` returns a two item tuple containing the populated namespace and the list of remaining argument strings. :meth:`~ArgumentParser.parse_intermixed_args` raises an error if there are any remaining unparsed argument strings.
es: :meth:`~ArgumentParser.parse_known_intermixed_args` retorna una tupla de dos elementos que contiene el espacio de nombres poblado y la lista de los restantes argumentos de cadenas de caracteres. :meth:`~ArgumentParser.parse_intermixed_args` arroja un error si quedan argumentos de cadenas de caracteres sin procesar.

source: Upgrading optparse code
es: Actualizar el código de *optparse*

source: Originally, the :mod:`argparse` module had attempted to maintain compatibility with :mod:`optparse`. However, :mod:`optparse` was difficult to extend transparently, particularly with the changes required to support the new ``nargs=`` specifiers and better usage messages. When most everything in :mod:`optparse` had either been copy-pasted over or monkey-patched, it no longer seemed practical to try to maintain the backwards compatibility.
es: Originalmente, el módulo :mod:`argparse` había intentado mantener la compatibilidad con :mod:`optparse`. Sin embargo, :mod:`optparse` era difícil de extender de forma transparente, particularmente con los cambios necesarios para soportar los nuevos especificadores ``nargs=`` y los mensajes de uso mejorados. Cuando casi todo en :mod:`optparse` había sido copiado y pegado o *monkey-patched*, ya no parecía práctico tratar de mantener la retro-compatibilidad.

source: The :mod:`argparse` module improves on the standard library :mod:`optparse` module in a number of ways including:
es: El módulo :mod:`argparse` mejora la biblioteca estándar del módulo :mod:`optparse` de varias maneras, incluyendo:

source: Handling positional arguments.
es: Manejando argumentos de posición.

source: Supporting sub-commands.
es: Soportando sub-comandos.

source: Allowing alternative option prefixes like ``+`` and ``/``.
es: Permitiendo prefijos de opción alternativos como ``+`` y ``/``.

source: Handling zero-or-more and one-or-more style arguments.
es: Manejando argumentos de estilo cero o más y uno o más.

source: Producing more informative usage messages.
es: Generando mensajes de uso más informativos.

source: Providing a much simpler interface for custom ``type`` and ``action``.
es: Proporcionando una interfaz mucho más simple para ``type`` y ``action`` personalizadas.

source: A partial upgrade path from :mod:`optparse` to :mod:`argparse`:
es: Una manera de actualizar parcialmente de :mod:`optparse` a :mod:`argparse`:

source: Replace all :meth:`optparse.OptionParser.add_option` calls with :meth:`ArgumentParser.add_argument` calls.
es: Reemplaza todas las llamadas :meth:`optparse.OptionParser.add_option` con llamadas :meth:`ArgumentParser.add_argument`.

source: Replace ``(options, args) = parser.parse_args()`` with ``args = parser.parse_args()`` and add additional :meth:`ArgumentParser.add_argument` calls for the positional arguments. Keep in mind that what was previously called ``options``, now in the :mod:`argparse` context is called ``args``.
es: Reemplaza ``(options, args) = parser.parse_args()`` con ``args = parser.parse_args()`` y agrega las llamadas adicionales :meth:`ArgumentParser.add_argument` para los argumentos de posición. Ten en cuenta que lo que antes se llamaba ``options``, ahora en el contexto :mod:`argparse` se llama ``args``.

source: Replace :meth:`optparse.OptionParser.disable_interspersed_args` by using :meth:`~ArgumentParser.parse_intermixed_args` instead of :meth:`~ArgumentParser.parse_args`.
es: Reemplaza :meth:`optparse.OptionParser.disable_interspersed_args` por :meth:`~ArgumentParser.parse_intermixed_args` en lugar de :meth:`~ArgumentParser.parse_args`.

source: Replace callback actions and the ``callback_*`` keyword arguments with ``type`` or ``action`` arguments.
es: Reemplaza las acciones de respuesta y los argumentos de palabra clave ``callback_*`` con argumentos de ``type`` o ``action``.

source: Replace string names for ``type`` keyword arguments with the corresponding type objects (e.g. int, float, complex, etc).
es: Reemplaza los nombres de cadena de caracteres por argumentos de palabra clave ``type`` con los correspondientes objetos tipo (por ejemplo, *int*, *float*, *complex*, etc).

source: Replace :class:`optparse.Values` with :class:`Namespace` and :exc:`optparse.OptionError` and :exc:`optparse.OptionValueError` with :exc:`ArgumentError`.
es: Reemplaza :class:`optparse.Values` por :class:`Namespace` y :exc:`optparse.OptionError` y :exc:`optparse.OptionValueError` por :exc:`ArgumentError`.

source: Replace strings with implicit arguments such as ``%default`` or ``%prog`` with the standard Python syntax to use dictionaries to format strings, that is, ``%(default)s`` and ``%(prog)s``.
es: Reemplaza las cadenas de caracteres con argumentos implícitos como ``%default`` o ``%prog`` por la sintaxis estándar de Python y usa diccionarios para dar formato a cadenas de caracteres, es decir, ``%(default)s`` y ``%(prog)s``.

source: Replace the OptionParser constructor ``version`` argument with a call to ``parser.add_argument('--version', action='version', version='<the version>')``.
es: Reemplaza el argumento ``version`` del constructor *OptionParser* por una llamada a ``parser.add_argument('--version', action='version', version='<the version>')``.
