Repository: python/python-docs-es
Catalog: library/argparse.po
Languages: es

source: :mod:`argparse` --- Parser for command-line options, arguments and sub-commands
es: :mod:`argparse` — Analizador sintáctico (*Parser*) para las opciones, argumentos y sub-comandos de la línea de comandos

source: **Source code:** :source:`Lib/argparse.py`
es: **Código fuente:** :source:`Lib/argparse.py`

source: This page contains the API reference information. For a more gentle introduction to Python command-line parsing, have a look at the :ref:`argparse tutorial <argparse-tutorial>`.
es: Esta página contiene la información de referencia de la API. Para una introducción más amigable al análisis de la línea de comandos de Python, echa un vistazo al :ref:`argparse tutorial <argparse-tutorial>`.

source: The :mod:`argparse` module makes it easy to write user-friendly command-line interfaces. The program defines what arguments it requires, and :mod:`argparse` will figure out how to parse those out of :data:`sys.argv`. The :mod:`argparse` module also automatically generates help and usage messages and issues errors when users give the program invalid arguments.
es: El módulo :mod:`argparse` facilita la escritura de interfaces de línea de comandos amigables. El programa define qué argumentos requiere, y :mod:`argparse` averiguará cómo analizar los de :data:`sys.argv`. El módulo :mod:`argparse` también genera automáticamente mensajes de ayuda y de uso y muestra errores cuando los usuarios dan parámetros incorrectos al programa.

source: Example
es: Ejemplo

source: The following code is a Python program that takes a list of integers and produces either the sum or the max::
es: El siguiente código es un programa Python que toma una lista de números enteros y obtiene la suma o el máximo::

source: Assuming the Python code above is saved into a file called ``prog.py``, it can be run at the command line and provides useful help messages:
es: Asumiendo que el código Python anterior se guarda en un archivo llamado ``prog.py``, se puede ejecutar en la línea de comandos y proporciona mensajes de ayuda útiles:

source: When run with the appropriate arguments, it prints either the sum or the max of the command-line integers:
es: Cuando se ejecuta con los parámetros apropiados, muestra la suma o el máximo de los números enteros de la línea de comandos:

source: If invalid arguments are passed in, it will issue an error:
es: Si se pasan argumentos incorrectos, se mostrará un error:

source: The following sections walk you through this example.
es: Las siguientes secciones te guiarán a través de este ejemplo.

source: Creating a parser
es: Creando un analizador sintáctico (*parser*)

source: The first step in using the :mod:`argparse` is creating an :class:`ArgumentParser` object::
es: El primer paso para usar :mod:`argparse` es crear un objeto :class:`ArgumentParser` ::

source: The :class:`ArgumentParser` object will hold all the information necessary to parse the command line into Python data types.
es: El objeto :class:`ArgumentParser` contendrá toda la información necesaria para analizar la línea de comandos con los tipos de datos de Python.

source: Adding arguments
es: Añadiendo argumentos

source: Filling an :class:`ArgumentParser` with information about program arguments is done by making calls to the :meth:`~ArgumentParser.add_argument` method. Generally, these calls tell the :class:`ArgumentParser` how to take the strings on the command line and turn them into objects. This information is stored and used when :meth:`~ArgumentParser.parse_args` is called. For example::
es: Completar un :class:`ArgumentParser` con información sobre los argumentos del programa se hace realizando llamadas al método :meth:`~ArgumentParser.add_argument`. Generalmente, estas llamadas le dicen a :class:`ArgumentParser` cómo capturar las cadenas de caracteres de la línea de comandos y convertirlas en objetos. Esta información se almacena y se usa cuando se llama a :meth:`~ArgumentParser.parse_args`. Por ejemplo::

source: Later, calling :meth:`~ArgumentParser.parse_args` will return an object with two attributes, ``integers`` and ``accumulate``. The ``integers`` attribute will be a list of one or more ints, and the ``accumulate`` attribute will be either the :func:`sum` function, if ``--sum`` was specified at the command line, or the :func:`max` function if it was not.
es: Más tarde, llamando a :meth:`~ArgumentParser.parse_args` retornará un objeto con dos atributos, ``integers`` y ``accumulate``. El atributo ``integers`` será una lista de uno o más enteros, y el atributo ``accumulate`` será la función :func:`sum`, si se especificó ``--sum`` en la línea de comandos, o la función :func:`max` si no.

source: Parsing arguments
es: Analizando argumentos

source: :class:`ArgumentParser` parses arguments through the :meth:`~ArgumentParser.parse_args` method. This will inspect the command line, convert each argument to the appropriate type and then invoke the appropriate action. In most cases, this means a simple :class:`Namespace` object will be built up from attributes parsed out of the command line::
es: :class:`ArgumentParser` analiza los argumentos mediante el método :meth:`~ArgumentParser.parse_args`. Éste inspeccionará la línea de comandos, convertirá cada argumento al tipo apropiado y luego invocará la acción correspondiente. En la mayoría de los casos, esto significa que un simple objeto :class:`Namespace` se construirá a partir de los atributos analizados en la línea de comandos::

source: In a script, :meth:`~ArgumentParser.parse_args` will typically be called with no arguments, and the :class:`ArgumentParser` will automatically determine the command-line arguments from :data:`sys.argv`.
es: En un *script*, :meth:`~ArgumentParser.parse_args` será llamado típicamente sin argumentos, y la :class:`ArgumentParser` determinará automáticamente los argumentos de la línea de comandos de :data:`sys.argv`.

source: ArgumentParser objects
es: Objetos *ArgumentParser*

source: Create a new :class:`ArgumentParser` object. All parameters should be passed as keyword arguments. Each parameter has its own more detailed description below, but in short they are:
es: Crea un nuevo objeto :class:`ArgumentParser`. Todos los parámetros deben pasarse como argumentos de palabra clave. Cada parámetro tiene su propia descripción más detallada a continuación, pero en resumen son:

source: prog_ - The name of the program (default: ``sys.argv[0]``)
es: prog_ - El nombre del programa (default: ``sys.argv[0]``)

source: usage_ - The string describing the program usage (default: generated from arguments added to parser)
es: usage_ - La cadena de caracteres que describe el uso del programa (por defecto: generado a partir de los argumentos añadidos al analizador)

source: description_ - Text to display before the argument help (default: none)
es: description_ - Texto a mostrar antes del argumento ayuda (por defecto: ninguno)

source: epilog_ - Text to display after the argument help (default: none)
es: epilog_ - Texto a mostrar después del argumento ayuda (por defecto: ninguno)

source: parents_ - A list of :class:`ArgumentParser` objects whose arguments should also be included
es: parents_ - Una lista de objetos :class:`ArgumentParser` cuyos argumentos también deberían ser incluidos

source: formatter_class_ - A class for customizing the help output
es: formatter_class_ - Una clase para personalizar la salida de la ayuda

source: prefix_chars_ - The set of characters that prefix optional arguments (default: '-')
es: prefix_chars_ - El conjunto de caracteres que preceden a los argumentos opcionales (por defecto: ‘-‘)

source: fromfile_prefix_chars_ - The set of characters that prefix files from which additional arguments should be read (default: ``None``)
es: fromfile_prefix_chars_ - El conjunto de caracteres que preceden a los archivos de los cuales se deberían leer los argumentos adicionales (por defecto: ``None``)

source: argument_default_ - The global default value for arguments (default: ``None``)
es: argument_default_ - El valor global por defecto de los argumentos (por defecto: ``None``)

source: conflict_handler_ - The strategy for resolving conflicting optionals (usually unnecessary)
es: conflict_handler_ - La estrategia para resolver los opcionales conflictivos (normalmente es innecesaria)

source: add_help_ - Add a ``-h/--help`` option to the parser (default: ``True``)
es: add_help_ - Añade una opción ``-h/--help`` al analizador (por defecto: ``True``)

source: allow_abbrev_ - Allows long options to be abbreviated if the abbreviation is unambiguous. (default: ``True``)
es: allow_abbrev_ - Permite abreviar las opciones largas si la abreviatura es inequívoca. (por defecto: ``True``)

source: *allow_abbrev* parameter was added.
es: se añadió el parámetro *allow_abbrev*.

source: In previous versions, *allow_abbrev* also disabled grouping of short flags such as ``-vv`` to mean ``-v -v``.
es: En versiones anteriores, *allow_abbrev* también deshabilitaba la agrupación de banderas (*flags*) cortas como ``-vv`` para que sea ``-v -v``.

source: The following sections describe how each of these are used.
es: En las siguientes secciones se describe cómo se utiliza cada una de ellas.

source: By default, :class:`ArgumentParser` objects use ``sys.argv[0]`` to determine how to display the name of the program in help messages. This default is almost always desirable because it will make the help messages match how the program was invoked on the command line. For example, consider a file named ``myprogram.py`` with the following code::
es: Por defecto, los objetos :class:`ArgumentParser` utilizan ``sys.argv[0]`` para determinar cómo mostrar el nombre del programa en los mensajes de ayuda. Este valor por defecto es casi siempre deseable porque hará que los mensajes de ayuda coincidan con la forma en que el programa fue invocado en la línea de comandos. Por ejemplo, considera un archivo llamado ``myprogram.py`` con el siguiente código::

source: The help for this program will display ``myprogram.py`` as the program name (regardless of where the program was invoked from):
es: La ayuda para este programa mostrará ``myprogram.py`` como el nombre del programa (sin importar desde dónde se haya invocado el programa):

source: To change this default behavior, another value can be supplied using the ``prog=`` argument to :class:`ArgumentParser`::
es: Para cambiar este comportamiento por defecto, se puede proporcionar otro valor usando el argumento``prog=`` para :class:`ArgumentParser`::

source: Note that the program name, whether determined from ``sys.argv[0]`` or from the ``prog=`` argument, is available to help messages using the ``%(prog)s`` format specifier.
es: Ten en cuenta que el nombre del programa, ya sea determinado a partir de ``sys.argv[0]`` o del argumento ``prog=`` , está disponible para los mensajes de ayuda usando el especificador de formato ``%(prog)s``.

source: usage
es: uso

source: By default, :class:`ArgumentParser` calculates the usage message from the arguments it contains::
es: Por defecto, :class:`ArgumentParser` determina el mensaje de uso a partir de los argumentos que contiene::

source: The default message can be overridden with the ``usage=`` keyword argument::
es: El mensaje por defecto puede ser sustituido con el argumento de palabra clave ``usage=``::

source: The ``%(prog)s`` format specifier is available to fill in the program name in your usage messages.
es: El especificador de formato ``%(prog)s`` está preparado para introducir el nombre del programa en los mensajes de ayuda.

source: Most calls to the :class:`ArgumentParser` constructor will use the ``description=`` keyword argument. This argument gives a brief description of what the program does and how it works. In help messages, the description is displayed between the command-line usage string and the help messages for the various arguments::
es: La mayoría de las llamadas al constructor :class:`ArgumentParser` usarán el argumento de palabra clave ``description=``. Este argumento da una breve descripción de lo que hace el programa y cómo funciona. En los mensajes de ayuda, la descripción se muestra entre la cadena de caracteres de uso (*usage*) de la línea de comandos y los mensajes de ayuda para los distintos argumentos::

source: By default, the description will be line-wrapped so that it fits within the given space. To change this behavior, see the formatter_class_ argument.
es: Por defecto, la descripción será ajustada a una línea para que encaje en el espacio dado. Para cambiar este comportamiento, revisa el argumento formatter_class_.

source: Some programs like to display additional description of the program after the description of the arguments. Such text can be specified using the ``epilog=`` argument to :class:`ArgumentParser`::
es: A algunos programas les gusta mostrar una descripción adicional del programa después de la descripción de los argumentos. Dicho texto puede ser especificado usando el argumento ``epilog=`` para :class:`ArgumentParser`::

source: As with the description_ argument, the ``epilog=`` text is by default line-wrapped, but this behavior can be adjusted with the formatter_class_ argument to :class:`ArgumentParser`.
es: Al igual que con el argumento description_, el texto ``epilog=`` está por defecto ajustado a una línea, pero este comportamiento puede ser modificado con el argumento formatter_class_ para :class:`ArgumentParser`.

source: Sometimes, several parsers share a common set of arguments. Rather than repeating the definitions of these arguments, a single parser with all the shared arguments and passed to ``parents=`` argument to :class:`ArgumentParser` can be used. The ``parents=`` argument takes a list of :class:`ArgumentParser` objects, collects all the positional and optional actions from them, and adds these actions to the :class:`ArgumentParser` object being constructed::
es: A veces, varios analizadores comparten un conjunto de argumentos comunes. En lugar de repetir las definiciones de estos argumentos, se puede usar un único analizador con todos los argumentos compartidos y pasarlo en el argumento ``parents=`` a :class:`ArgumentParser`. El argumento ``parents=`` toma una lista de objetos :class:`ArgumentParser`, recoge todas las acciones de posición y de opción de éstos, y añade estas acciones al objeto :class:`ArgumentParser` que se está construyendo::

source: Note that most parent parsers will specify ``add_help=False``. Otherwise, the :class:`ArgumentParser` will see two ``-h/--help`` options (one in the parent and one in the child) and raise an error.
es: Ten en cuenta que la mayoría de los analizadores padre especificarán ``add_help=False``. De lo contrario, el :class:`ArgumentParser` verá dos opciones ``-h/—help`` (una para el padre y otra para el hijo) y generará un error.

source: You must fully initialize the parsers before passing them via ``parents=``. If you change the parent parsers after the child parser, those changes will not be reflected in the child.
es: Debes inicializar completamente los analizadores antes de pasarlos a través de ``parents=``. Si cambias los analizadores padre después del analizador hijo, esos cambios no se reflejarán en el hijo.

source: :class:`ArgumentParser` objects allow the help formatting to be customized by specifying an alternate formatting class. Currently, there are four such classes:
es: los objetos :class:`ArgumentParser` permiten personalizar el formato de la ayuda especificando una clase de formato alternativa. Actualmente, hay cuatro clases de este tipo:

source: :class:`RawDescriptionHelpFormatter` and :class:`RawTextHelpFormatter` give more control over how textual descriptions are displayed. By default, :class:`ArgumentParser` objects line-wrap the description_ and epilog_ texts in command-line help messages::
es: :class:`RawDescriptionHelpFormatter` y :class:`RawTextHelpFormatter` dan más control sobre cómo se muestran las descripciones de texto. Por defecto, los objetos :class:`ArgumentParser` ajustan a la línea los textos de description_ y epilog_ en los mensajes de ayuda de la línea de comandos::

source: Passing :class:`RawDescriptionHelpFormatter` as ``formatter_class=`` indicates that description_ and epilog_ are already correctly formatted and should not be line-wrapped::
es: Pasar :class:`RawDescriptionHelpFormatter` como ``formatter_class=`` indica que description_ y epilog_ ya tienen el formato correcto y no deben ser ajustados a la línea::

source: :class:`RawTextHelpFormatter` maintains whitespace for all sorts of help text, including argument descriptions. However, multiple new lines are replaced with one. If you wish to preserve multiple blank lines, add spaces between the newlines.
es: :class:`RawTextHelpFormatter` mantiene espacios en blanco para todo tipo de texto de ayuda, incluyendo descripciones de argumentos. Sin embargo, varias líneas nuevas son reemplazadas por una sola. Si deseas conservar varias líneas en blanco, añade espacios entre las nuevas líneas.

source: :class:`ArgumentDefaultsHelpFormatter` automatically adds information about default values to each of the argument help messages::
es: :class:`ArgumentDefaultsHelpFormatter` añade automáticamente información sobre los valores por defecto a cada uno de los mensajes de ayuda de los argumentos::

source: :class:`MetavarTypeHelpFormatter` uses the name of the type_ argument for each argument as the display name for its values (rather than using the dest_ as the regular formatter does)::
es: :class:`MetavarTypeHelpFormatter` utiliza el nombre del parámetro type_ para cada argumento como el nombre a mostrar para sus valores (en lugar de utilizar dest_ como lo hace el formato habitual)::

source: Most command-line options will use ``-`` as the prefix, e.g. ``-f/--foo``. Parsers that need to support different or additional prefix characters, e.g. for options like ``+f`` or ``/foo``, may specify them using the ``prefix_chars=`` argument to the ArgumentParser constructor::
es: La mayoría de las opciones de la línea de comandos usarán ``-`` como prefijo, por ejemplo ``-f/--foo``. Los analizadores que necesiten soportar caracteres prefijo diferentes o adicionales, por ejemplo, para opciones como ``+f`` o ``/foo``, pueden especificarlos usando el argumento``prefix_chars=`` para el constructor *ArgumentParser*::

source: The ``prefix_chars=`` argument defaults to ``'-'``. Supplying a set of characters that does not include ``-`` will cause ``-f/--foo`` options to be disallowed.
es: El argumento ``prefix_chars=`` tiene un valor por defecto de ``'-'``. Proporcionar un conjunto de caracteres que no incluya ``-`` causará que las opciones ``-f/--foo`` no sean inhabilitadas.

source: Sometimes, for example when dealing with a particularly long argument lists, it may make sense to keep the list of arguments in a file rather than typing it out at the command line. If the ``fromfile_prefix_chars=`` argument is given to the :class:`ArgumentParser` constructor, then arguments that start with any of the specified characters will be treated as files, and will be replaced by the arguments they contain. For example::
es: A veces, por ejemplo, cuando se trata de una lista de argumentos particularmente larga, puede tener sentido mantener la lista de argumentos en un archivo en lugar de escribirla en la línea de comandos. Si el argumento ``fromfile_prefix_chars=`` se da al constructor :class:`ArgumentParser`, entonces los argumentos que empiezan con cualquiera de los caracteres especificados se tratarán como archivos, y serán reemplazados por los argumentos que contienen. Por ejemplo::

source: Arguments read from a file must by default be one per line (but see also :meth:`~ArgumentParser.convert_arg_line_to_args`) and are treated as if they were in the same place as the original file referencing argument on the command line. So in the example above, the expression ``['-f', 'foo', '@args.txt']`` is considered equivalent to the expression ``['-f', 'foo', '-f', 'bar']``.
es: Los argumentos leídos de un archivo deben ser por defecto uno por línea (pero vea también :meth:`~ArgumentParser.convert_arg_line_to_args`) y se tratan como si estuvieran en el mismo lugar que el argumento de referencia del archivo original en la línea de comandos. Así, en el ejemplo anterior, la expresión ``[‘-f’, ‘foo’, ‘@args.txt’]`` se considera equivalente a la expresión ``[‘-f’, ‘foo’, ‘-f’, ‘bar’]``.

source: The ``fromfile_prefix_chars=`` argument defaults to ``None``, meaning that arguments will never be treated as file references.
es: El argumento``fromfile_prefix_chars=`` por defecto es ``None``, lo que significa que los argumentos nunca serán tratados como referencias de archivos.

source: Generally, argument defaults are specified either by passing a default to :meth:`~ArgumentParser.add_argument` or by calling the :meth:`~ArgumentParser.set_defaults` methods with a specific set of name-value pairs. Sometimes however, it may be useful to specify a single parser-wide default for arguments. This can be accomplished by passing the ``argument_default=`` keyword argument to :class:`ArgumentParser`. For example, to globally suppress attribute creation on :meth:`~ArgumentParser.parse_args` calls, we supply ``argument_default=SUPPRESS``::
es: Generalmente, los valores por defecto de los argumentos se especifican ya sea pasando un valor por defecto a :meth:`~ArgumentParser.add_argument` o llamando a los métodos :meth:`~ArgumentParser.set_defaults` con un conjunto específico de pares nombre-valor. A veces, sin embargo, puede ser útil especificar un único valor por defecto para todos los argumentos del analizador. Esto se puede lograr pasando el argumento de palabra clave ``argument_default=`` a :class:`ArgumentParser`. Por ejemplo, para suprimir globalmente la creación de atributos en las llamadas a :meth:`~ArgumentParser.parse_args` , proporcionamos el argumento ``argument_default=SUPPRESS``::

source: Normally, when you pass an argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it :ref:`recognizes abbreviations <prefix-matching>` of long options.
es: Normalmente, cuando pasas una lista de argumentos al método :meth:`~ArgumentParser.parse_args` de un :class:`ArgumentParser`, :ref:`reconoce las abreviaturas <prefix-matching>` de las opciones largas.

source: This feature can be disabled by setting ``allow_abbrev`` to ``False``::
es: Esta característica puede ser desactivada poniendo ``allow_abbrev`` a ``False``::

source: :class:`ArgumentParser` objects do not allow two actions with the same option string. By default, :class:`ArgumentParser` objects raise an exception if an attempt is made to create an argument with an option string that is already in use::
es: Los objetos :class:`ArgumentParser` no permiten dos acciones con la misma cadena de caracteres de opción. Por defecto, los objetos :class:`ArgumentParser` lanzan una excepción si se intenta crear un argumento con una cadena de caracteres de opción que ya está en uso::

source: Sometimes (e.g. when using parents_) it may be useful to simply override any older arguments with the same option string. To get this behavior, the value ``'resolve'`` can be supplied to the ``conflict_handler=`` argument of :class:`ArgumentParser`::
es: A veces (por ejemplo, cuando se utiliza parents_) puede ser útil anular simplemente cualquier argumento antiguo con la misma cadena de caracteres de opción. Para lograr este comportamiento, se puede suministrar el valor ``'resolve'`` al argumento ``conflict_handler=`` de :class:`ArgumentParser`::
