Repository: python/python-docs-es
Catalog: library/argparse.po
Languages: es

source: Note that :class:`ArgumentParser` objects only remove an action if all of its option strings are overridden. So, in the example above, the old ``-f/--foo`` action is retained as the ``-f`` action, because only the ``--foo`` option string was overridden.
es: Ten en cuenta que los objetos :class:`ArgumentParser` sólo eliminan una acción si todas sus cadenas de caracteres de opción están anuladas. Así, en el ejemplo anterior, la antigua acción ``-f/--foo`` se mantiene como la acción``-f``, porque sólo la cadena de caracteres de opción ``--foo`` fue anulada.

source: By default, ArgumentParser objects add an option which simply displays the parser's help message. For example, consider a file named ``myprogram.py`` containing the following code::
es: Por defecto, los objetos *ArgumentParser* añaden una opción que simplemente muestra el mensaje de ayuda del analizador. Por ejemplo, considera un archivo llamado ``myprogram.py`` que contiene el siguiente código::

source: If ``-h`` or ``--help`` is supplied at the command line, the ArgumentParser help will be printed:
es: Si ``-h`` o ``--help`` se indica en la línea de comandos, se imprimirá la ayuda de *ArgumentParser*:

source: Occasionally, it may be useful to disable the addition of this help option. This can be achieved by passing ``False`` as the ``add_help=`` argument to :class:`ArgumentParser`::
es: Ocasionalmente, puede ser útil desactivar la inclusión de esta opción de ayuda. Esto se puede lograr pasando ``False`` como argumento de ``add_help=`` a :class:`ArgumentParser`::

source: The help option is typically ``-h/--help``. The exception to this is if the ``prefix_chars=`` is specified and does not include ``-``, in which case ``-h`` and ``--help`` are not valid options. In this case, the first character in ``prefix_chars`` is used to prefix the help options::
es: La opción de ayuda es típicamente ``-h/--help``. La excepción a esto es si ``prefix_chars=`` se especifica y no incluye ``-``, en cuyo caso ``-h`` y ``--help`` no son opciones válidas. En este caso, el primer carácter en ``prefix_chars`` se utiliza para preceder a las opciones de ayuda::

source: The add_argument() method
es: El método *add_argument()*

source: Define how a single command-line argument should be parsed. Each parameter has its own more detailed description below, but in short they are:
es: Define cómo se debe interpretar un determinado argumento de línea de comandos. Cada parámetro tiene su propia descripción más detallada a continuación, pero en resumen son::

source: `name or flags`_ - Either a name or a list of option strings, e.g. ``foo`` or ``-f, --foo``.
es: `name or flags`_ - Ya sea un nombre o una lista de cadena de caracteres de opción, e.g. ``foo`` o ``-f, --foo``.

source: action_ - The basic type of action to be taken when this argument is encountered at the command line.
es: action_ - El tipo básico de acción a tomar cuando este argumento se encuentra en la línea de comandos.

source: nargs_ - The number of command-line arguments that should be consumed.
es: nargs_ - El número de argumentos de la línea de comandos que deben ser consumidos.

source: const_ - A constant value required by some action_ and nargs_ selections.
es: const_ - Un valor fijo requerido por algunas selecciones de action_ y nargs_.

source: type_ - The type to which the command-line argument should be converted.
es: type_ - El tipo al que debe convertirse el argumento de la línea de comandos.

source: choices_ - A container of the allowable values for the argument.
es: choices_ - Un contenedor con los valores permitidos para el argumento.

source: required_ - Whether or not the command-line option may be omitted (optionals only).
es: required_ - Si se puede omitir o no la opción de la línea de comandos (sólo opcionales).

source: help_ - A brief description of what the argument does.
es: help_ - Una breve descripción de lo que hace el argumento.

source: metavar_ - A name for the argument in usage messages.
es: metavar_ - Un nombre para el argumento en los mensajes de uso.

source: dest_ - The name of the attribute to be added to the object returned by :meth:`parse_args`.
es: dest_ - El nombre del atributo que será añadido al objeto retornado por :meth:`parse_args`.

source: The :meth:`~ArgumentParser.add_argument` method must know whether an optional argument, like ``-f`` or ``--foo``, or a positional argument, like a list of filenames, is expected. The first arguments passed to :meth:`~ArgumentParser.add_argument` must therefore be either a series of flags, or a simple argument name. For example, an optional argument could be created like::
es: El método :meth:`~ArgumentParser.add_argument` debe saber si se espera un argumento opcional, como ``-f`` o ``--foo``, o un argumento posicional, como una lista de nombres de archivos. Por lo tanto, los primeros argumentos que se pasan a :meth:`~ArgumentParser.add_argument` deben ser una serie de indicadores (*flags*), o un simple nombre de argumento (*name*). Por ejemplo, se puede crear un argumento opcional como::

source: while a positional argument could be created like::
es: mientras que un argumento posicional podría ser creado como::

source: When :meth:`~ArgumentParser.parse_args` is called, optional arguments will be identified by the ``-`` prefix, and the remaining arguments will be assumed to be positional::
es: Cuando se llama a :meth:`~ArgumentParser.parse_args` , los argumentos opcionales serán identificados por el prefijo ``-``, y el resto de los argumentos serán asumidos como posicionales::

source: :class:`ArgumentParser` objects associate command-line arguments with actions. These actions can do just about anything with the command-line arguments associated with them, though most actions simply add an attribute to the object returned by :meth:`~ArgumentParser.parse_args`. The ``action`` keyword argument specifies how the command-line arguments should be handled. The supplied actions are:
es: Los objetos :class:`ArgumentParser` asocian los argumentos de la línea de comandos con las acciones. Esta acciones pueden hacer casi cualquier cosa con los argumentos de línea de comandos asociados a ellas, aunque la mayoría de las acciones simplemente añaden un atributo al objeto retornado por :meth:`~ArgumentParser.parse_args`. El argumento de palabra clave ``action`` especifica cómo deben ser manejados los argumentos de la línea de comandos. Las acciones proporcionadas son:

source: ``'store'`` - This just stores the argument's value. This is the default action. For example::
es: ``'store'`` - Esta sólo almacena el valor del argumento. Esta es la acción por defecto. Por ejemplo::

source: ``'store_const'`` - This stores the value specified by the const_ keyword argument. The ``'store_const'`` action is most commonly used with optional arguments that specify some sort of flag. For example::
es: ``'store_const'`` - Esta almacena el valor especificado por el argumento de palabra clave const_ . La acción ``'store_const'`` se usa más comúnmente con argumentos opcionales que especifican algún tipo de indicador (*flag*). Por ejemplo::

source: ``'store_true'`` and ``'store_false'`` - These are special cases of ``'store_const'`` used for storing the values ``True`` and ``False`` respectively. In addition, they create default values of ``False`` and ``True`` respectively. For example::
es: ``'store_true'`` y ``'store_false'`` - Son casos especiales de ``'store_const'`` usados para almacenar los valores ``True`` y ``False`` respectivamente. Además, crean valores por defecto de ``False`` y ``True`` respectivamente. Por ejemplo::

source: ``'append'`` - This stores a list, and appends each argument value to the list. This is useful to allow an option to be specified multiple times. Example usage::
es: ``'append'`` - Esta almacena una lista, y añade cada valor del argumento a la lista. Esto es útil para permitir que una opción sea especificada varias veces. Ejemplo de uso::

source: ``'append_const'`` - This stores a list, and appends the value specified by the const_ keyword argument to the list. (Note that the const_ keyword argument defaults to ``None``.) The ``'append_const'`` action is typically useful when multiple arguments need to store constants to the same list. For example::
es: ``'append_const'`` - Esta almacena una lista, y añade el valor especificado por el argumento de palabra clave const_ a la lista. (Nótese que el argumento de palabra clave const_ por defecto es ``None``.) La acción ``'append_const'`` es útil típicamente cuando múltiples argumentos necesitan almacenar constantes a la misma lista. Por ejemplo::

source: ``'count'`` - This counts the number of times a keyword argument occurs. For example, this is useful for increasing verbosity levels::
es: ``'count'`` - Esta cuenta el número de veces que un argumento de palabra clave aparece. Por ejemplo, esto es útil para incrementar los niveles de detalle::

source: Note, the *default* will be ``None`` unless explicitly set to *0*.
es: Observa, *default* (el valor por defecto) será ``None`` a menos que explícitamente se establezca como *0*.

source: ``'help'`` - This prints a complete help message for all the options in the current parser and then exits. By default a help action is automatically added to the parser. See :class:`ArgumentParser` for details of how the output is created.
es: ``'help'`` - Esta imprime un mensaje de ayuda completo para todas las opciones del analizador actual y luego termina. Por defecto, se añade una acción de ayuda automáticamente al analizador. Ver :class:`ArgumentParser` para detalles de cómo se genera la salida.

source: ``'version'`` - This expects a ``version=`` keyword argument in the :meth:`~ArgumentParser.add_argument` call, and prints version information and exits when invoked::
es: ``’version’`` - Esta espera un argumento de palabra clave ``version=`` en la llamada :meth:`~ArgumentParser.add_argument`, e imprime la información de la versión y finaliza cuando es invocada::

source: ``'extend'`` - This stores a list, and extends each argument value to the list. Example usage::
es: ``’extend’`` - Esta almacena una lista, y extiende cada valor del argumento a la lista. Ejemplo de uso::

source: An example of a custom action::
es: Un ejemplo de una acción personalizada::

source: For more details, see :class:`Action`.
es: Para más detalles, ver :class:`Action`.

source: ArgumentParser objects usually associate a single command-line argument with a single action to be taken. The ``nargs`` keyword argument associates a different number of command-line arguments with a single action. The supported values are:
es: Los objetos *ArgumentParser* suelen asociar un único argumento de línea de comandos con una única acción a realizar. El argumento de palabra clave ``nargs`` asocia un número diferente de argumentos de línea de comandos con una sola acción. Los valores admitidos son:

source: ``N`` (an integer). ``N`` arguments from the command line will be gathered together into a list. For example::
es: ``N`` (un entero). ``N`` argumentos de la línea de comandos se agruparán en una lista. Por ejemplo::

source: Note that ``nargs=1`` produces a list of one item. This is different from the default, in which the item is produced by itself.
es: Ten en cuenta que ``nargs=1`` produce una lista de un elemento. Esto es diferente del valor por defecto, en el que el elemento se produce por sí mismo.

source: ``'?'``. One argument will be consumed from the command line if possible, and produced as a single item. If no command-line argument is present, the value from default_ will be produced. Note that for optional arguments, there is an additional case - the option string is present but not followed by a command-line argument. In this case the value from const_ will be produced. Some examples to illustrate this::
es: ``’?’``. Un argumento se consumirá desde la línea de comandos si es posible, y se generará como un sólo elemento. Si no hay ningún argumento de línea de comandos, se obtendrá el valor de default_. Ten en cuenta que para los argumentos opcionales, hay un caso adicional - la cadena de caracteres de opción está presente pero no va seguida de un argumento de línea de comandos. En este caso se obtendrá el valor de const_. Algunos ejemplos para ilustrar esto::

source: One of the more common uses of ``nargs='?'`` is to allow optional input and output files::
es: Uno de los usos más comunes de ``nargs='?'`` es permitir archivos de entrada y salida opcionales::

source: ``'*'``. All command-line arguments present are gathered into a list. Note that it generally doesn't make much sense to have more than one positional argument with ``nargs='*'``, but multiple optional arguments with ``nargs='*'`` is possible. For example::
es: ``’*’``. Todos los argumentos presentes en la línea de comandos se recogen en una lista. Ten en cuenta que generalmente no tiene mucho sentido tener más de un argumento posicional con ``nargs=‘*’``, pero es posible tener múltiples argumentos opcionales con ``nargs=‘*’``. Por ejemplo::

source: ``'+'``. Just like ``'*'``, all command-line args present are gathered into a list. Additionally, an error message will be generated if there wasn't at least one command-line argument present. For example::
es: ``'+'``. Al igual que ``'*'``, todos los argumentos de la línea de comandos se recogen en una lista. Además, se generará un mensaje de error si no había al menos un argumento presente en la línea de comandos. Por ejemplo::

source: If the ``nargs`` keyword argument is not provided, the number of arguments consumed is determined by the action_. Generally this means a single command-line argument will be consumed and a single item (not a list) will be produced.
es: Si no se proporciona el argumento de palabra clave ``nargs``, el número de argumentos consumidos se determina por action_. Generalmente esto significa que se consumirá un único argumento de línea de comandos y se obtendrá un único elemento (no una lista).

source: The ``const`` argument of :meth:`~ArgumentParser.add_argument` is used to hold constant values that are not read from the command line but are required for the various :class:`ArgumentParser` actions. The two most common uses of it are:
es: El argumento ``const`` de :meth:`~ArgumentParser.add_argument` se usa para mantener valores constantes que no se leen desde la línea de comandos pero que son necesarios para las diversas acciones de :class:`ArgumentParser`. Los dos usos más comunes son:

source: When :meth:`~ArgumentParser.add_argument` is called with ``action='store_const'`` or ``action='append_const'``. These actions add the ``const`` value to one of the attributes of the object returned by :meth:`~ArgumentParser.parse_args`. See the action_ description for examples.
es: Cuando :meth:`~ArgumentParser.add_argument` se llama con ``action='store_const'`` o ``action='append_const'``. Estas acciones añaden el valor ``const`` a uno de los atributos del objeto retornado por :meth:`~ArgumentParser.parse_args`. Mira la descripción action_ para ver ejemplos.

source: When :meth:`~ArgumentParser.add_argument` is called with option strings (like ``-f`` or ``--foo``) and ``nargs='?'``. This creates an optional argument that can be followed by zero or one command-line arguments. When parsing the command line, if the option string is encountered with no command-line argument following it, the value of ``const`` will be assumed instead. See the nargs_ description for examples.
es: Cuando :meth:`~ArgumentParser.add_argument` se llama con cadenas de caracteres de opción (como ``-f`` o ``—foo``) y ``nargs=‘?’``. Esto crea un argumento opcional que puede ir seguido de cero o un argumento de línea de comandos. Al analizar la línea de comandos, si la cadena de opciones se encuentra sin ningún argumento de línea de comandos que la siga, asumirá en su lugar el valor de ``const``. Mira la descripción nargs_ para ejemplos.

source: With the ``'store_const'`` and ``'append_const'`` actions, the ``const`` keyword argument must be given. For other actions, it defaults to ``None``.
es: Con las acciones ``'store_const'`` y ``'append_const'``, se debe asignar el argumento palabra clave ``const``. Para otras acciones, por defecto es ``None``.

source: All optional arguments and some positional arguments may be omitted at the command line. The ``default`` keyword argument of :meth:`~ArgumentParser.add_argument`, whose value defaults to ``None``, specifies what value should be used if the command-line argument is not present. For optional arguments, the ``default`` value is used when the option string was not present at the command line::
es: Todos los argumentos opcionales y algunos argumentos posicionales pueden ser omitidos en la línea de comandos. El argumento de palabra clave ``default`` de :meth:`~ArgumentParser.add_argument`, cuyo valor por defecto es ``None``, especifica qué valor debe usarse si el argumento de línea de comandos no está presente. Para los argumentos opcionales, se usa el valor ``default`` cuando la cadena de caracteres de opción no está presente en la línea de comandos::

source: If the ``default`` value is a string, the parser parses the value as if it were a command-line argument. In particular, the parser applies any type_ conversion argument, if provided, before setting the attribute on the :class:`Namespace` return value. Otherwise, the parser uses the value as is::
es: Si el valor ``default`` es una cadena de caracteres, el analizador procesa el valor como si fuera un argumento de la línea de comandos. En particular, el analizador aplica cualquier argumento de conversión type_ , si se proporciona, antes de establecer el atributo en el valor de retorno :class:`Namespace`. En caso contrario, el analizador utiliza el valor tal y como es::

source: For positional arguments with nargs_ equal to ``?`` or ``*``, the ``default`` value is used when no command-line argument was present::
es: Para argumentos posiciones con nargs_ igual a ``?`` o ``*``, el valor ``default`` se utiliza cuando no hay ningún argumento de línea de comandos presente::

source: Providing ``default=argparse.SUPPRESS`` causes no attribute to be added if the command-line argument was not present::
es: Proporcionar ``default=argparse.SUPPRESS`` causa que no se agregue ningún atributo si el argumento de la línea de comandos no está presente::

source: Some command-line arguments should be selected from a restricted set of values. These can be handled by passing a container object as the *choices* keyword argument to :meth:`~ArgumentParser.add_argument`. When the command line is parsed, argument values will be checked, and an error message will be displayed if the argument was not one of the acceptable values::
es: Algunos argumentos de la línea de comandos deberían seleccionarse de un conjunto restringido de valores. Estos pueden ser manejados pasando un objeto contenedor como el argumento de palabra clave *choices* a :meth:`~ArgumentParser.add_argument`. Cuando se analiza la línea de comandos, se comprueban los valores de los argumentos y se muestra un mensaje de error si el argumento no era uno de los valores aceptables::

source: Note that inclusion in the *choices* container is checked after any type_ conversions have been performed, so the type of the objects in the *choices* container should match the type_ specified::
es: Ten en cuenta que la inclusión en el contenedor *choices* se comprueba después de que se haya realizado cualquier conversión de type_, por lo que el tipo de los objetos del contenedor *choices* debe coincidir con el type_ especificado::

source: Any container can be passed as the *choices* value, so :class:`list` objects, :class:`set` objects, and custom containers are all supported.
es: Se puede pasar cualquier contenedor como el valor para *choices*, así que los objetos :class:`list`, :class:`set` , y los contenedores personalizados están todos soportados.

source: In general, the :mod:`argparse` module assumes that flags like ``-f`` and ``--bar`` indicate *optional* arguments, which can always be omitted at the command line. To make an option *required*, ``True`` can be specified for the ``required=`` keyword argument to :meth:`~ArgumentParser.add_argument`::
es: En general, el módulo :mod:`argparse` asume que los indicadores (*flags*) como ``-f`` y ``--bar`` señalan argumentos *opcionales*, que siempre pueden ser omitidos en la línea de comandos. Para hacer una opción *requerida*, se puede especificar``True`` para el argumento de palabra clave``required=`` en :meth:`~ArgumentParser.add_argument`::

source: As the example shows, if an option is marked as ``required``, :meth:`~ArgumentParser.parse_args` will report an error if that option is not present at the command line.
es: Como muestra el ejemplo, si una opción está marcada como ``required``, :meth:`~ArgumentParser.parse_args` informará de un error si esa opción no está presente en la línea de comandos.

source: Required options are generally considered bad form because users expect *options* to be *optional*, and thus they should be avoided when possible.
es: Las opciones requeridas están consideradas generalmente mala práctica porque los usuarios esperan que las *opciones* sean *opcionales*, y por lo tanto deberían ser evitadas cuando sea posible.

source: The ``help`` value is a string containing a brief description of the argument. When a user requests help (usually by using ``-h`` or ``--help`` at the command line), these ``help`` descriptions will be displayed with each argument::
es: El valor ``help`` es una cadena de caracteres que contiene una breve descripción del argumento. Cuando un usuario solicita ayuda (normalmente usando ``-h`` o ``--help`` en la línea de comandos), estas descripciones ``help`` se mostrarán con cada argumento::

source: The ``help`` strings can include various format specifiers to avoid repetition of things like the program name or the argument default_. The available specifiers include the program name, ``%(prog)s`` and most keyword arguments to :meth:`~ArgumentParser.add_argument`, e.g. ``%(default)s``, ``%(type)s``, etc.::
es: Las cadenas de texto ``help`` pueden incluir varios descriptores de formato para evitar la repetición de cosas como el nombre del programa o el argumento default_. Los descriptores disponibles incluyen el nombre del programa, ``%(prog)s`` y la mayoría de los argumentos de palabra clave de :meth:`~ArgumentParser.add_argument`, por ejemplo ``%(default)s``, ``%(type)s``, etc.::

source: As the help string supports %-formatting, if you want a literal ``%`` to appear in the help string, you must escape it as ``%%``.
es: Como la cadena de caracteres de ayuda soporta el formato-%, si quieres que aparezca un ``%`` literal en la ayuda, debes escribirlo como ``%%``.

source: :mod:`argparse` supports silencing the help entry for certain options, by setting the ``help`` value to ``argparse.SUPPRESS``::
es: :mod:`argparse` soporta el silenciar la ayuda para ciertas opciones, ajustando el valor ``help`` a ``argparse.SUPPRESS``::
