Repository: python/python-docs-es
Catalog: library/array.po
Languages: es_es

source: :mod:`array` --- Efficient arrays of numeric values
es_es: :mod:`array` --- Arreglos eficientes de valores numéricos

source: This module defines an object type which can compactly represent an array of basic values: characters, integers, floating point numbers. Arrays are sequence types and behave very much like lists, except that the type of objects stored in them is constrained. The type is specified at object creation time by using a :dfn:`type code`, which is a single character. The following type codes are defined:
es_es: Este modulo define un tipo de objeto que representa un arreglo de valores básicos: caracteres, números enteros y de punto flotante. Los arreglos son tipos de secuencias que se comportan de forma similar a las listas, a excepción que el tipo de objeto guardado es definido. El tipo es especificado al momento de crear el objeto mediante :dfn:`type code`, que es un carácter simple. Se definen los siguientes tipos:

source: Type code
es_es: Código de tipo

source: C Type
es_es: Tipo C

source: Python Type
es_es: Tipo Python

source: Minimum size in bytes
es_es: Tamaño mínimo en bytes

source: Notes
es_es: Notas

source: Unicode character
es_es: Carácter Unicode

source: Notes:
es_es: Notas:

source: The ``'u'`` type code corresponds to Python's obsolete unicode character (:c:type:`Py_UNICODE` which is :c:type:`wchar_t`). Depending on the platform, it can be 16 bits or 32 bits.
es_es: El código de tipo ``'u'`` corresponde al carácter unicode obsoleto de Python (:c:type:`Py_UNICODE` que es :c:type:`wchar_t`). Dependiendo de la plataforma, puede ser de 16 bits o de 32 bits.

source: ``'u'`` will be removed together with the rest of the :c:type:`Py_UNICODE` API.
es_es: ``'u'`` será eliminada conjuntamente con el resto de :c:type:`Py_UNICODE` API.

source: The actual representation of values is determined by the machine architecture (strictly speaking, by the C implementation). The actual size can be accessed through the :attr:`itemsize` attribute.
es_es: La representación real de los valores viene determinada por la arquitectura de la maquina (estrictamente hablando, por la implementación de C). El tamaño actual se puede obtener mediante el atributo :attr:`itemsize`.

source: The module defines the following type:
es_es: El módulo define los siguientes tipos:

source: A new array whose items are restricted by *typecode*, and initialized from the optional *initializer* value, which must be a list, a :term:`bytes-like object`, or iterable over elements of the appropriate type.
es_es: Un nuevo arreglo cuyos elementos son restringidos por *typecode*, e inicializados con el valor opcional *initializer*, el cual debe ser una lista, un :term:`bytes-like object`, o un iterable sobre los elementos del tipo apropiado.

source: If given a list or string, the initializer is passed to the new array's :meth:`fromlist`, :meth:`frombytes`, or :meth:`fromunicode` method (see below) to add initial items to the array. Otherwise, the iterable initializer is passed to the :meth:`extend` method.
es_es: Si dada una lista o un string, el inicializador es pasado a los nuevos métodos :meth:`fromlist`, :meth:`frombytes`, :meth:`fromunicode` del arreglo (ver abajo) para añadir nuevos elementos al arreglo. De forma contraria, el iterable inicializador se pasa al método :meth:`extend`.

source: Raises an :ref:`auditing event <auditing>` ``array.__new__`` with arguments ``typecode``, ``initializer``.
es_es: Lanza un :ref:`evento de auditoría <auditing>` ``array.__new__`` con argumentos ``typecode``, ``initializer``.

source: A string with all available type codes.
es_es: Una cadena de caracteres con todos los códigos de tipos disponible.

source: Array objects support the ordinary sequence operations of indexing, slicing, concatenation, and multiplication. When using slice assignment, the assigned value must be an array object with the same type code; in all other cases, :exc:`TypeError` is raised. Array objects also implement the buffer interface, and may be used wherever :term:`bytes-like objects <bytes-like object>` are supported.
es_es: Los objetos tipo arreglo soportan operaciones de secuencia ordinarias de indexación, segmentación, concatenación y multiplicación . Cuando se utiliza segmentación, el valor asignado debe ser un arreglo con el mismo código de tipo, en todos los otros casos se lanza :exc:`TypeError`. Los arreglos también implementan una interfaz de buffer, y puede ser utilizada en cualquier momento cuando los objetos :term:`bytes-like objects <bytes-like object>` son soportados.

source: The following data items and methods are also supported:
es_es: Los siguientes tipos de datos y métodos también son soportados:

source: The typecode character used to create the array.
es_es: El carácter typecode utilizado para crear el arreglo.

source: The length in bytes of one array item in the internal representation.
es_es: La longitud en bytes de un elemento del arreglo en su representación interna.

source: Append a new item with value *x* to the end of the array.
es_es: Añade un nuevo elemento con valor *x* al final del arreglo.

source: Return a tuple ``(address, length)`` giving the current memory address and the length in elements of the buffer used to hold array's contents. The size of the memory buffer in bytes can be computed as ``array.buffer_info()[1] * array.itemsize``. This is occasionally useful when working with low-level (and inherently unsafe) I/O interfaces that require memory addresses, such as certain :c:func:`ioctl` operations. The returned numbers are valid as long as the array exists and no length-changing operations are applied to it.
es_es: Retorna una tupla ``(address, length)`` con la dirección de memoria actual y la longitud de los elementos en el buffer utilizado para almacenar temporalmente los elementos del arreglo. El tamaño del buffer de memoria es calculado como ``array.buffer_info()[1] * array.itemsize``. Ocasionalmente es practico cuando trabajamos en interfaces E/S de bajo nivel (de manera inherentemente insegura) que requieren direcciones de memoria, por ejemplo ciertas operaciones :c:func:`ioctl`. Los números retornados son válidos mientras el arreglo exista y no se cambie la longitud del mismo.

source: When using array objects from code written in C or C++ (the only way to effectively make use of this information), it makes more sense to use the buffer interface supported by array objects. This method is maintained for backward compatibility and should be avoided in new code. The buffer interface is documented in :ref:`bufferobjects`.
es_es: Cuando utilizamos objetos tipo arreglo escritos en C o C++ (la única manera de utilizar esta información de forma más efectiva), tiene más sentido utilizar interfaces buffer que soporten objetos del tipo arreglo. Este método es mantenido con retro compatibilidad y tiene que ser evitado en el nuevo código. Las interfaces de buffer son documentadas en :ref:`bufferobjects`.

source: "Byteswap" all items of the array. This is only supported for values which are 1, 2, 4, or 8 bytes in size; for other types of values, :exc:`RuntimeError` is raised. It is useful when reading data from a file written on a machine with a different byte order.
es_es: "Byteswap" todos los elementos del arreglo. Solo es soportado para valores de tamaño 1,2,3,4 o 8 bytes; para otros valores se lanza :exc:`RuntimeError`. Es útil cuando leemos información de un fichero en una máquina con diferente orden de bytes.

source: Return the number of occurrences of *x* in the array.
es_es: Retorna el número de ocurrencias de *x* en el arreglo.

source: Append items from *iterable* to the end of the array. If *iterable* is another array, it must have *exactly* the same type code; if not, :exc:`TypeError` will be raised. If *iterable* is not an array, it must be iterable and its elements must be the right type to be appended to the array.
es_es: Añade los elementos del *iterable* al final del arreglo. Si el *iterable* es de otro arreglo, este debe ser *exactamente* del mismo tipo; si no, se lanza :exc:`TypeError`. Si el *iterable* no es un arreglo, este debe de ser un iterable y sus elementos deben ser del tipo correcto para ser añadidos al arreglo.

source: Appends items from the string, interpreting the string as an array of machine values (as if it had been read from a file using the :meth:`fromfile` method).
es_es: Añade los elementos de la cadena de texto, interpretando la cadena de texto como un arreglo de valores máquina (como si se leyera de un fichero utilizando el método :meth:`fromfile`).

source: :meth:`fromstring` is renamed to :meth:`frombytes` for clarity.
es_es: :meth:`fromstring` se renombra como :meth:`frombytes` por claridad.

source: Read *n* items (as machine values) from the :term:`file object` *f* and append them to the end of the array. If less than *n* items are available, :exc:`EOFError` is raised, but the items that were available are still inserted into the array. *f* must be a real built-in file object; something else with a :meth:`read` method won't do.
es_es: Lee *n* elementos (como valores maquina) desde el :term:`file object` *f* y los añade al final del arreglo. Si hay menos de *n* elementos disponibles, se lanza :exc:`EOFError`, pero los elementos que estaban disponibles son insertados al arreglo. *f* debe de ser un objeto de archivo incorporado real; cualquier otra cosa con un método :meth:`read` no funcionará.

source: Append items from the list. This is equivalent to ``for x in list: a.append(x)`` except that if there is a type error, the array is unchanged.
es_es: Añade los elementos de la lista. Es equivalente a ``for x in list: a.append(x)`` excepto que si hay un error de tipo, el arreglo no se modifica.

source: Deprecated alias for :meth:`frombytes`.
es_es: Alias obsoleto para :meth:`frombytes`.

source: Extends this array with data from the given unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.frombytes(unicodestring.encode(enc))`` to append Unicode data to an array of some other type.
es_es: Extiende este arreglo con datos de la cadena de texto unicode. El arreglo debe ser un arreglo tipo ``'u'``; de forma contraria se lanza :exc:`ValueError`. Utiliza ``array.frombytes(unicodestring.encode(enc))`` para añadir datos Unicode a un arreglo de algún otro tipo.

source: Return the smallest *i* such that *i* is the index of the first occurrence of *x* in the array.
es_es: Retorna la *i* más pequeña de modo que *i* es el índice de la primera ocurrencia de *x* en el arreglo.

source: Insert a new item with value *x* in the array before position *i*. Negative values are treated as being relative to the end of the array.
es_es: Inserta un nuevo elemento con valor *x* en el arreglo antes de la posición *i*. Si hay valores negativos son tratados como relativos a la posición final del arreglo.

source: Removes the item with the index *i* from the array and returns it. The optional argument defaults to ``-1``, so that by default the last item is removed and returned.
es_es: Elimina el elemento con índice *i* del arreglo y lo retorna. El argumento opcional por defecto es ``-1``, en caso de utilizar el argumento por defecto el ultimo elemento es eliminado y retornado.

source: Remove the first occurrence of *x* from the array.
es_es: Elimina la primera ocurrencia de *x* del arreglo.

source: Reverse the order of the items in the array.
es_es: Invierte el orden de los elementos en el arreglo.

source: Convert the array to an array of machine values and return the bytes representation (the same sequence of bytes that would be written to a file by the :meth:`tofile` method.)
es_es: Convierte el arreglo en un arreglo de valores máquina y retorna una representación en formato de bytes (la misma secuencia de bytes que se deben escribir en un fichero por el método :meth:`tofile`.)

source: :meth:`tostring` is renamed to :meth:`tobytes` for clarity.
es_es: :meth:`tostring` se renombra como :meth:`tobytes` para claridad.

source: Write all items (as machine values) to the :term:`file object` *f*.
es_es: Escribe todos los elementos (incluido elementos máquina) a el :term:`file object` *f*.

source: Convert the array to an ordinary list with the same items.
es_es: Convierte el arreglo a una lista ordinaria con los mismos elementos.

source: Deprecated alias for :meth:`tobytes`.
es_es: Alias obsoleto para :meth:`tobytes`.

source: Convert the array to a unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.tobytes().decode(enc)`` to obtain a unicode string from an array of some other type.
es_es: Convierte el arreglo a una cadena de texto unicode. El arreglo debe ser un arreglo tipo ``'u'`` ; en caso contrario se lanza :exc:`ValueError`. Utiliza ``array.tobytes().decode(enc)`` para obtener una cadena de texto unicode de un arreglo de algún otro tipo.

source: When an array object is printed or converted to a string, it is represented as ``array(typecode, initializer)``. The *initializer* is omitted if the array is empty, otherwise it is a string if the *typecode* is ``'u'``, otherwise it is a list of numbers. The string is guaranteed to be able to be converted back to an array with the same type and value using :func:`eval`, so long as the :class:`~array.array` class has been imported using ``from array import array``. Examples::
es_es: Cuando un objeto se imprime o se convierte a una cadena de texto, este se representa como ``array(typecode, initializer)``. El *initializer* se omite cuando el arreglo está vacío, de forma contraria es una cadena de caracteres si su *typecode* es ``'u'``, de lo contrario es una lista de números. La cadena de caracteres garantiza que es capaz de ser convertida de nuevo a un arreglo con el mismo tipo y valor utilizando :func:`eval`, hasta que la clase :class:`~array.array` ha sido importada utilizando ``from array import array``. Ejemplos::

source: Module :mod:`struct`
es_es: Módulo :mod:`struct`

source: Packing and unpacking of heterogeneous binary data.
es_es: Empaquetado y desempaquetado de datos binarios heterogéneos.

source: Module :mod:`xdrlib`
es_es: Módulo :mod:`xdrlib`

source: Packing and unpacking of External Data Representation (XDR) data as used in some remote procedure call systems.
es_es: Empaquetado y desempaquetado de datos de Representación de datos externos (XDR) como los utilizados en algunos sistemas de llamadas de procedimientos remotos.

source: `The Numerical Python Documentation <https://docs.scipy.org/doc/>`_
es_es: `La documentación numérica de Python <https://docs.scipy.org/doc/>`_

source: The Numeric Python extension (NumPy) defines another array type; see http://www.numpy.org/ for further information about Numerical Python.
es_es: La extensión numérica de Python (NumPy) define otro tipo de arreglos; consultar http://www.numpy.org/ para información adicional sobre Python numérico.
