Repository: python/python-docs-es
Catalog: library/asyncio-stream.po
Languages: es

source: **Source code:** :source:`Lib/asyncio/streams.py`
es: **Código fuente:** :source:`Lib/asyncio/streams.py`

source: Streams are high-level async/await-ready primitives to work with network connections. Streams allow sending and receiving data without using callbacks or low-level protocols and transports.
es: Los *streams* son async/await primitivos de alto nivel para trabajar con conexiones de red. Los *streams* permiten enviar y recibir datos sin utilizar *callbacks* o protocolos y transportes de bajo nivel.

source: Here is an example of a TCP echo client written using asyncio streams::
es: Aquí hay un ejemplo de un cliente eco TCP escrito utilizando *streams* asyncio::

source: See also the `Examples`_ section below.
es: Consulte también la sección de `Examples`_ a continuación.

source: Stream Functions
es: Funciones *stream*

source: The following top-level asyncio functions can be used to create and work with streams:
es: Las siguientes funciones asyncio de nivel superior se pueden utilizar para crear y trabajar con *streams*:

source: Establish a network connection and return a pair of ``(reader, writer)`` objects.
es: Establece una conexión de red y retorna un par de objetos ``(reader, writer)``.

source: The returned *reader* and *writer* objects are instances of :class:`StreamReader` and :class:`StreamWriter` classes.
es: Los objetos *reader* y *writer* retornados son instancias de las clases :class:`StreamReader` y :class:`StreamWriter`.

source: *limit* determines the buffer size limit used by the returned :class:`StreamReader` instance. By default the *limit* is set to 64 KiB.
es: *limit* determina el límite de tamaño del búfer utilizado por la instancia de :class:`StreamReader` retornada. De forma predeterminada, *limit* está establecido en 64 KiB.

source: The rest of the arguments are passed directly to :meth:`loop.create_connection`.
es: El resto de los argumentos se pasan directamente a :meth:`loop.create_connection`.

source: The *sock* argument transfers ownership of the socket to the :class:`StreamWriter` created. To close the socket, call its :meth:`~asyncio.StreamWriter.close` method.
es: El argumento *sock* transfiere la propiedad del socket al :class:`StreamWriter` creado. Para cerrar el socket, llame a su método :meth:`~asyncio.StreamWriter.close`.

source: Added the *ssl_handshake_timeout* parameter.
es: Se agregó el parámetro *ssl_handshake_timeout*.

source: Added *happy_eyeballs_delay* and *interleave* parameters.
es: Se agregaron los parámetros *happy_eyeballs_delay* e *interleave*.

source: Removed the *loop* parameter.
es: Se eliminó el parámetro *loop*.

source: Start a socket server.
es: Inicia un servidor socket.

source: The *client_connected_cb* callback is called whenever a new client connection is established. It receives a ``(reader, writer)`` pair as two arguments, instances of the :class:`StreamReader` and :class:`StreamWriter` classes.
es: La retrollamada *client_connected_cb* se llama siempre que se establece una nueva conexión de cliente. Recibe un par ``(reader, writer)`` como dos argumentos, instancias de las clases :class:`StreamReader` y :class:`StreamWriter`.

source: *client_connected_cb* can be a plain callable or a :ref:`coroutine function <coroutine>`; if it is a coroutine function, it will be automatically scheduled as a :class:`Task`.
es: *client_connected_cb* puede ser una función simple invocable o de :ref:`corrutina <coroutine>`; si es una función de corrutina, se programará automáticamente como un :class:`Task`.

source: The rest of the arguments are passed directly to :meth:`loop.create_server`.
es: El resto de los argumentos se pasan directamente a :meth:`loop.create_server`.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
es: El argumento *sock* transfiere la propiedad del socket al servidor creado. Para cerrar el socket, llame al método :meth:`~asyncio.Server.close` del servidor.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters.
es: Se agregaron los parámetros *ssl_handshake_timeout* y *start_serving*.

source: Unix Sockets
es: Sockets Unix

source: Establish a Unix socket connection and return a pair of ``(reader, writer)``.
es: Establece una conexión de socket Unix y retorna un par de ``(reader, writer)``.

source: Similar to :func:`open_connection` but operates on Unix sockets.
es: Similar a :func:`open_connection` pero opera en sockets Unix.

source: See also the documentation of :meth:`loop.create_unix_connection`.
es: Consulte también la documentación de :meth:`loop.create_unix_connection`.

source: :ref:`Availability <availability>`: Unix.
es: :ref:`Disponibilidad <availability>`: Unix.

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`
es: Se agregó el parámetro *ssl_handshake_timeout*. El parámetro *path* ahora puede ser un :term:`path-like object`

source: Start a Unix socket server.
es: Inicia un servidor socket Unix.

source: Similar to :func:`start_server` but works with Unix sockets.
es: Similar a :func:`start_server` pero funciona con sockets Unix.

source: See also the documentation of :meth:`loop.create_unix_server`.
es: Consulte también la documentación de :meth:`loop.create_unix_server`.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :term:`path-like object`.
es: Se agregaron los parámetros *ssl_handshake_timeout* y *start_serving*. El parámetro *path* ahora puede ser un :term:`path-like object`.

source: It is not recommended to instantiate *StreamReader* objects directly; use :func:`open_connection` and :func:`start_server` instead.
es: No se recomienda crear instancias de objetos *StreamReader* directamente; utilice :func:`open_connection` y :func:`start_server` en su lugar.

source: Read one line, where "line" is a sequence of bytes ending with ``\n``.
es: Lea una línea, donde "línea" es una secuencia de bytes que termina en ``\n``.

source: If EOF is received and ``\n`` was not found, the method returns partially read data.
es: Si se recibe EOF (final del archivo) y no se encontró ``\n``, el método retorna datos leídos parcialmente.

source: If EOF is received and the internal buffer is empty, return an empty ``bytes`` object.
es: Si se recibe EOF (final de archivo) y el búfer interno está vacío, retorna un objeto ``bytes`` vacío.

source: Read exactly *n* bytes.
es: Lee exactamente *n* bytes.

source: Raise an :exc:`IncompleteReadError` if EOF is reached before *n* can be read. Use the :attr:`IncompleteReadError.partial` attribute to get the partially read data.
es: Genera un :exc:`IncompleteReadError` si se alcanza EOF (final del archivo) antes de que se pueda leer *n*. Utilice el atributo :attr:`IncompleteReadError.partial` para obtener los datos leídos parcialmente.

source: Read data from the stream until *separator* is found.
es: Lee datos de la secuencia hasta que se encuentre el separador (*separator*).

source: On success, the data and separator will be removed from the internal buffer (consumed). Returned data will include the separator at the end.
es: En caso de éxito, los datos y el separador se eliminarán del búfer interno (consumido). Los datos retornados incluirán el separador al final.

source: If the amount of data read exceeds the configured stream limit, a :exc:`LimitOverrunError` exception is raised, and the data is left in the internal buffer and can be read again.
es: Si la cantidad de datos leídos excede el límite de flujo configurado, se genera una excepción :exc:`LimitOverrunError` y los datos se dejan en el búfer interno y se pueden leer nuevamente.

source: If EOF is reached before the complete separator is found, an :exc:`IncompleteReadError` exception is raised, and the internal buffer is reset. The :attr:`IncompleteReadError.partial` attribute may contain a portion of the separator.
es: Si se alcanza EOF (final del archivo) antes de que se encuentre el separador completo, se genera una excepción :exc:`IncompleteReadError` y se restablece el búfer interno. El atributo :attr:`IncompleteReadError.partial` puede contener una parte del separador.

source: Return ``True`` if the buffer is empty and :meth:`feed_eof` was called.
es: Retorna ``True`` si el buffer está vacío y :meth:`feed_eof` fue llamado.

source: Represents a writer object that provides APIs to write data to the IO stream.
es: Representa un objeto de escritura que proporciona APIs para escribir datos en el flujo de E/S.

source: It is not recommended to instantiate *StreamWriter* objects directly; use :func:`open_connection` and :func:`start_server` instead.
es: No se recomienda crear instancias de objetos *StreamWriter* directamente; use :func:`open_connection` y :func:`start_server` en su lugar.

source: The method attempts to write the *data* to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
es: El método intenta escribir los datos (*data*) en el socket subyacente inmediatamente. Si eso falla, los datos se ponen en cola en un búfer de escritura interno hasta que se puedan enviar.

source: The method should be used along with the ``drain()`` method::
es: El método debe usarse junto con el método ``drain()``::

source: The method writes a list (or any iterable) of bytes to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
es: El método escribe una lista (o cualquier iterable) de bytes en el socket subyacente inmediatamente. Si eso falla, los datos se ponen en cola en un búfer de escritura interno hasta que se puedan enviar.

source: The method closes the stream and the underlying socket.
es: El método cierra la secuencia y el socket subyacente.

source: Return ``True`` if the underlying transport supports the :meth:`write_eof` method, ``False`` otherwise.
es: Retorna ``True`` si el transporte subyacente admite el método :meth:`write_eof`, ``False`` en caso contrario.

source: Close the write end of the stream after the buffered write data is flushed.
es: Cierra la escritura de la secuencia después de que se vacíen los datos de escritura almacenados en búfer.

source: Return the underlying asyncio transport.
es: Retorna el transporte asyncio subyacente.

source: Access optional transport information; see :meth:`BaseTransport.get_extra_info` for details.
es: Accede a información de transporte opcional; consulte :meth:`BaseTransport.get_extra_info` para obtener más detalles.

source: Wait until it is appropriate to resume writing to the stream. Example::
es: Espera hasta que sea apropiado reanudar la escritura en la transmisión. Ejemplo::

source: This is a flow control method that interacts with the underlying IO write buffer. When the size of the buffer reaches the high watermark, *drain()* blocks until the size of the buffer is drained down to the low watermark and writing can be resumed. When there is nothing to wait for, the :meth:`drain` returns immediately.
es: Este es un método de control de flujo que interactúa con el búfer de escritura de E/S subyacente. Cuando el tamaño del búfer alcanza la marca de agua alta, *drain()* bloquea hasta que el tamaño del búfer se agota hasta la marca de agua baja y se pueda reanudar la escritura. Cuando no hay nada que esperar, :meth:`drain` regresa inmediatamente.

source: Upgrade an existing stream-based connection to TLS.
es: Actualiza una conexión existente basada en flujo a TLS.

source: Parameters:
es: Parámetros:

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
es: *sslcontext*: una instancia configurada de :class:`~ssl.SSLContext`.

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
es: *server_hostname*: establece o sustituye el nombre de host con el que se comparará el certificado del servidor de destino.

source: *ssl_handshake_timeout* is the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es: *ssl_handshake_timeout* es el tiempo en segundos que se espera a que se complete el protocolo TLS antes de abortar la conexión. ``60.0`` segundos si ``None`` (por defecto).

source: Return ``True`` if the stream is closed or in the process of being closed.
es: Retorna ``True`` si la secuencia está cerrada o en proceso de cerrarse.

source: Wait until the stream is closed.
es: Espera hasta que se cierre la secuencia.

source: Examples
es: Ejemplos

source: TCP echo client using streams
es: Cliente eco TCP usando *streams*

source: TCP echo client using the :func:`asyncio.open_connection` function::
es: Cliente eco TCP usando la función :func:`asyncio.open_connection`::

source: The :ref:`TCP echo client protocol <asyncio_example_tcp_echo_client_protocol>` example uses the low-level :meth:`loop.create_connection` method.
es: El ejemplo del :ref:`protocolo de cliente eco TCP <asyncio_example_tcp_echo_client_protocol>` utiliza el método :meth:`loop.create_connection` de bajo nivel.

source: TCP echo server using streams
es: Servidor eco TCP usando *streams*

source: TCP echo server using the :func:`asyncio.start_server` function::
es: Servidor eco TCP usando la función :func:`asyncio.start_server`::

source: The :ref:`TCP echo server protocol <asyncio_example_tcp_echo_server_protocol>` example uses the :meth:`loop.create_server` method.
es: El ejemplo del :ref:`protocolo de servidor eco TCP <asyncio_example_tcp_echo_server_protocol>` utiliza el método :meth:`loop.create_server`.

source: Get HTTP headers
es: Obtener encabezados HTTP

source: Simple example querying HTTP headers of the URL passed on the command line::
es: Ejemplo simple de consulta de encabezados HTTP de la URL pasada en la línea de comando::

source: Usage::
es: Uso::

source: or with HTTPS::
es: o con HTTPS::

source: Register an open socket to wait for data using streams
es: Registrar un socket abierto para esperar datos usando *streams*

source: Coroutine waiting until a socket receives data using the :func:`open_connection` function::
es: Corutina esperando hasta que un socket reciba datos usando la función :func:`open_connection` function::

source: The :ref:`register an open socket to wait for data using a protocol <asyncio_example_create_connection>` example uses a low-level protocol and the :meth:`loop.create_connection` method.
es: El ejemplo de :ref:`registro de un socket abierto para esperar datos usando un protocolo <asyncio_example_create_connection>` utiliza un protocolo de bajo nivel y el método :meth:`loop.create_connection`.

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to watch a file descriptor.
es: El ejemplo de :ref:`observar un descriptor de archivo para leer eventos <asyncio_example_watch_fd>` utiliza el método :meth:`loop.add_reader` de bajo nivel para ver un descriptor de archivo.
