Repository: python/python-docs-es
Catalog: library/asyncio-future.po
Languages: es

source: **Source code:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`
es: **Código fuente:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`

source: *Future* objects are used to bridge **low-level callback-based code** with high-level async/await code.
es: Los objetos *Future* se utilizan para conectar **código basado en retrollamadas de bajo nivel** (*low-level callback-based code*) con código *async/await* de alto nivel.

source: Future Functions
es: Funciones Future

source: Return ``True`` if *obj* is either of:
es: Retorna ``True`` si *obj* es uno de los siguientes:

source: an instance of :class:`asyncio.Future`,
es: una instancia de :class:`asyncio.Future`,

source: an instance of :class:`asyncio.Task`,
es: una instancia de :class:`asyncio.Task`,

source: a Future-like object with a ``_asyncio_future_blocking`` attribute.
es: un objeto tipo Future con un atributo ``_asyncio_future_blocking``.

source: Return:
es: Retorna:

source: *obj* argument as is, if *obj* is a :class:`Future`, a :class:`Task`, or a Future-like object (:func:`isfuture` is used for the test.)
es: el argumento *obj* inalterado, si *obj* es una :class:`Future`, :class:`Task`, o un objeto tipo Future (esto se puede verificar con :func:`isfuture`.)

source: a :class:`Task` object wrapping *obj*, if *obj* is a coroutine (:func:`iscoroutine` is used for the test); in this case the coroutine will be scheduled by ``ensure_future()``.
es: un objeto :class:`Task` envolviendo *obj*, si *obj* es una corrutina (esto se puede verificar con :func:`iscoroutine`); en este caso, la corrutina será programada por ``ensure_future()``.

source: a :class:`Task` object that would await on *obj*, if *obj* is an awaitable (:func:`inspect.isawaitable` is used for the test.)
es: un objeto :class:`Task` que aguardará a *obj*, si *obj* es aguardable (esto se puede verificar con :func:`inspect.isawaitable`.)

source: If *obj* is neither of the above a :exc:`TypeError` is raised.
es: Si *obj* no es ninguno de los superiores, se lanzará :exc:`TypeError`.

source: See also the :func:`create_task` function which is the preferred way for creating new Tasks.
es: Ver también la función :func:`create_task`, que es la forma preferida de crear nuevas *Tasks*.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution.
es: Guarda una referencia al resultado de esta función, evita que una tarea desaparezca a mitad de su ejecución.

source: The function accepts any :term:`awaitable` object.
es: La función acepta cualquier objeto :term:`awaitable`.

source: Deprecation warning is emitted if *obj* is not a Future-like object and *loop* is not specified and there is no running event loop.
es: Se emite una advertencia de desaprobación si *obj* no es un objeto tipo Future y no se especifica *loop* y no hay un bucle de eventos en ejecución.

source: Wrap a :class:`concurrent.futures.Future` object in a :class:`asyncio.Future` object.
es: Envuelve un objeto :class:`concurrent.futures.Future` en un objeto :class:`asyncio.Future`.

source: Deprecation warning is emitted if *future* is not a Future-like object and *loop* is not specified and there is no running event loop.
es: Se emite una advertencia de desaprobación si *future* no es un objeto tipo Future y *loop* no se especifica y no hay un bucle de eventos en ejecución.

source: Future Object
es: Objeto Future

source: A Future represents an eventual result of an asynchronous operation. Not thread-safe.
es: Un Future representa un resultado eventual de una operación asíncrona. No es seguro en hilos (*thread-safe*).

source: Future is an :term:`awaitable` object. Coroutines can await on Future objects until they either have a result or an exception set, or until they are cancelled. A Future can be awaited multiple times and the result is same.
es: Future es un objeto :term:`awaitable`. Las corrutinas pueden esperar a objetos Future hasta que obtengan un resultado o excepción, o hasta que se cancelen. Un Future puede esperarse varias veces y el resultado es el mismo.

source: Typically Futures are used to enable low-level callback-based code (e.g. in protocols implemented using asyncio :ref:`transports <asyncio-transports-protocols>`) to interoperate with high-level async/await code.
es: Normalmente, los Futures se utilizan para permitir que código basado en retrollamadas de bajo nivel (*low-level callback-based code*) (por ejemplo, en protocolos implementados utilizando *asyncio* :ref:`transports <asyncio-transports-protocols>`) interactúe con código *async/await* de alto nivel.

source: The rule of thumb is to never expose Future objects in user-facing APIs, and the recommended way to create a Future object is to call :meth:`loop.create_future`. This way alternative event loop implementations can inject their own optimized implementations of a Future object.
es: Es recomendable no exponer nunca objetos Future en APIs expuestas al usuario, y la forma recomendada de crear un objeto Future es llamando a :meth:`loop.create_future`. De esta forma, implementaciones alternativas de bucles de eventos (*event loop*) pueden inyectar sus propias implementaciones optimizadas de un objeto Future.

source: Added support for the :mod:`contextvars` module.
es: Añadido soporte para el módulo :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
es: Se emite una advertencia de desaprobación si no se especifica *loop* y no hay un bucle de eventos en ejecución.

source: Return the result of the Future.
es: Retorna el resultado del Future.

source: If the Future is *done* and has a result set by the :meth:`set_result` method, the result value is returned.
es: Si el Future es *done* y tiene un resultado establecido por el método :meth:`set_result`, el valor resultante es retornado.

source: If the Future is *done* and has an exception set by the :meth:`set_exception` method, this method raises the exception.
es: Si el Future es *done* y tiene una excepción establecida por el método :meth:`set_exception`, este método lanzará esta excepción.

source: If the Future has been *cancelled*, this method raises a :exc:`CancelledError` exception.
es: Si un evento es *cancelled*, este método lanzará una excepción :exc:`CancelledError`.

source: If the Future's result isn't yet available, this method raises a :exc:`InvalidStateError` exception.
es: Si el resultado del Future todavía no está disponible, este método lanzará una excepción :exc:`InvalidStateError`.

source: Mark the Future as *done* and set its result.
es: Marca el Future como *done* y establece su resultado.

source: Raises a :exc:`InvalidStateError` error if the Future is already *done*.
es: Lanza un error :exc:`InvalidStateError` si el Future ya está *done*.

source: Mark the Future as *done* and set an exception.
es: Marca el Future como *done* y establece una excepción.

source: Return ``True`` if the Future is *done*.
es: Retorna ``True`` si el Future está *done*.

source: A Future is *done* if it was *cancelled* or if it has a result or an exception set with :meth:`set_result` or :meth:`set_exception` calls.
es: Un Future está *done* si estaba *cancelled* o si tiene un resultado o excepción establecidos mediante llamadas a :meth:`set_result` o :meth:`set_exception`.

source: Return ``True`` if the Future was *cancelled*.
es: Retorna ``True`` si el Future fue *cancelled*.

source: The method is usually used to check if a Future is not *cancelled* before setting a result or an exception for it::
es: El método suele utilizarse para comprobar que un Future no es *cancelled* antes de establecer un resultado o excepción al mismo::

source: Add a callback to be run when the Future is *done*.
es: Añade una retrollamada (*callback*) a ser ejecutada cuando el Future es *done*.

source: The *callback* is called with the Future object as its only argument.
es: La retrollamada (*callback*) es llamada con el objeto Future como su único argumento.

source: If the Future is already *done* when this method is called, the callback is scheduled with :meth:`loop.call_soon`.
es: Si el Future ya es *done* cuando se llama a este método, la retrollamada (*callback*) es programada con :meth:`loop.call_soon`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
es: Un argumento opcional de contexto, por palabra clave, permite especificar un :class:`contextvars.Context` personalizado para ser ejecutado en la retrollamada (*callback*). El contexto actual se utiliza cuando no se provee un contexto (*context*).

source: :func:`functools.partial` can be used to pass parameters to the callback, e.g.::
es: :func:`functools.partial` se puede utilizar para dar parámetros a la retrollamada (*callback*), por ejemplo::

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
es: El parámetro de contexto (*context*) por palabra clave fue añadido. Ver :pep:`567` para más detalles.

source: Remove *callback* from the callbacks list.
es: Elimina la retrollamada (*callback*) de la lista de retrollamadas.

source: Returns the number of callbacks removed, which is typically 1, unless a callback was added more than once.
es: Retorna el número de retrollamadas (*callbacks*) eliminadas, que normalmente es 1, excepto si una retrollamada fue añadida más de una vez.

source: Cancel the Future and schedule callbacks.
es: Cancela el Future y programa retrollamadas (*callbacks*).

source: If the Future is already *done* or *cancelled*, return ``False``. Otherwise, change the Future's state to *cancelled*, schedule the callbacks, and return ``True``.
es: Si el Future ya está *done* o *cancelled*, retorna ``False``. De lo contrario, cambia el estado del Future a *cancelled*, programa las retrollamadas, y retorna ``True``.

source: Added the *msg* parameter.
es: Se agregó el parámetro *msg*.

source: Return the exception that was set on this Future.
es: Retorna la excepción definida en este Future.

source: The exception (or ``None`` if no exception was set) is returned only if the Future is *done*.
es: La excepción (o ``None`` si no se había establecido ninguna excepción) es retornada sólo si Future es *done*.

source: If the Future isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
es: Si el Future todavía no es *done*, este método lanza una excepción :exc:`InvalidStateError`.

source: Return the event loop the Future object is bound to.
es: Retorna el bucle de eventos (*event loop*) al cual el objeto Future está asociado.

source: This example creates a Future object, creates and schedules an asynchronous Task to set result for the Future, and waits until the Future has a result::
es: Este ejemplo crea un objeto Future, crea y programa una Task asíncrona para establecer el resultado para el Future, y espera hasta que el Future tenga un resultado::

source: The Future object was designed to mimic :class:`concurrent.futures.Future`. Key differences include:
es: El objeto Future fue diseñado para imitar a :class:`concurrent.futures.Future`. Entre las principales diferencias están:

source: unlike asyncio Futures, :class:`concurrent.futures.Future` instances cannot be awaited.
es: al contrario que Futures de *asyncio*, las instancias de :class:`concurrent.futures.Future` no son aguardables (*await*).

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` do not accept the *timeout* argument.
es: :meth:`asyncio.Future.result` y :meth:`asyncio.Future.exception` no aceptan el argumento *timeout*.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` raise an :exc:`InvalidStateError` exception when the Future is not *done*.
es: :meth:`asyncio.Future.result` y :meth:`asyncio.Future.exception` lanzan una excepción :exc:`InvalidStateError` cuando el Future no es *done*.

source: Callbacks registered with :meth:`asyncio.Future.add_done_callback` are not called immediately. They are scheduled with :meth:`loop.call_soon` instead.
es: Las retrollamadas (*callbacks*) registradas con :meth:`asyncio.Future.add_done_callback` no son llamadas inmediatamente, sino que son programadas con :meth:`loop.call_soon`.

source: asyncio Future is not compatible with the :func:`concurrent.futures.wait` and :func:`concurrent.futures.as_completed` functions.
es: *asyncio* Future no es compatible con las funciones :func:`concurrent.futures.wait` ni :func:`concurrent.futures.as_completed`.

source: :meth:`asyncio.Future.cancel` accepts an optional ``msg`` argument, but :meth:`concurrent.futures.Future.cancel` does not.
es: :meth:`asyncio.Future.cancel` acepta un argumento opcional ``msg``, pero :meth:`concurrent.futures.Future.cancel` no.
