Repository: python/python-docs-es
Catalog: library/asyncio-policy.po
Languages: es

source: Policies
es: Políticas

source: An event loop policy is a global object used to get and set the current :ref:`event loop <asyncio-event-loop>`, as well as create new event loops. The default policy can be :ref:`replaced <asyncio-policy-get-set>` with :ref:`built-in alternatives <asyncio-policy-builtin>` to use different event loop implementations, or substituted by a :ref:`custom policy <asyncio-custom-policies>` that can override these behaviors.
es: Una política de bucle de eventos es un objeto global que se utiliza para obtener y establecer el :ref:`bucle de eventos <asyncio-event-loop>` actual o para crear nuevos bucles de eventos. La política preestablecida puede ser :ref:`reemplazada <asyncio-policy-get-set>` con :ref:`alternativas built-in <asyncio-policy-builtin>` para usar diferentes implementaciones de bucles de eventos, o sustituida por una :ref:`política personalizada <asyncio-custom-policies>` la cual puede anular estos comportamientos.

source: The :ref:`policy object <asyncio-policy-objects>` gets and sets a separate event loop per *context*. This is per-thread by default, though custom policies could define *context* differently.
es: El :ref:`objeto de política <asyncio-policy-objects>` obtiene y establece un bucle de eventos separado por *contexto*. Por defecto, esto se realiza por hilo, aunque las políticas personalizadas pueden definir el *contexto* de una forma diferente.

source: Custom event loop policies can control the behavior of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop`.
es: Las políticas de bucle de eventos personalizadas pueden controlar el comportamiento de :func:`get_event_loop`, :func:`set_event_loop`, y :func:`new_event_loop`.

source: Policy objects should implement the APIs defined in the :class:`AbstractEventLoopPolicy` abstract base class.
es: Los objetos de política deberían implementar las APIs definidas en la clase abstracta base :class:`AbstractEventLoopPolicy`.

source: Getting and Setting the Policy
es: Obteniendo y configurando la política

source: The following functions can be used to get and set the policy for the current process:
es: Las siguientes funciones pueden ser usadas para obtener y configurar la política de los procesos actuales:

source: Return the current process-wide policy.
es: Retorna la política actual en todo el proceso.

source: Set the current process-wide policy to *policy*.
es: Establece la política actual en todo el proceso a *policy*.

source: If *policy* is set to ``None``, the default policy is restored.
es: Si *policy* está configurado a ``None``, la política por defecto se reestablece.

source: Policy Objects
es: Objetos de política

source: The abstract event loop policy base class is defined as follows:
es: La clase base de política de bucle de eventos abstractos se define de la siguiente manera:

source: An abstract base class for asyncio policies.
es: Una clase base abstracta para políticas asyncio.

source: Get the event loop for the current context.
es: Retorna el bucle de eventos para el contexto actual.

source: Return an event loop object implementing the :class:`AbstractEventLoop` interface.
es: Retorna un objeto bucle de eventos implementando la interfaz :class:`AbstractEventLoop`.

source: This method should never return ``None``.
es: Este método nunca debería retornar ``None``.

source: Set the event loop for the current context to *loop*.
es: Establece el bucle de eventos para el contexto a *loop*.

source: Create and return a new event loop object.
es: Crea y retorna un nuevo objeto de bucle de eventos.

source: Get a child process watcher object.
es: Retorna un objeto observador de procesos secundarios.

source: Return a watcher object implementing the :class:`AbstractChildWatcher` interface.
es: Retorna un objeto observador implementando la interfaz :class:`AbstractChildWatcher`.

source: This function is Unix specific.
es: Esta función es específica de Unix.

source: Set the current child process watcher to *watcher*.
es: Establece el observador de procesos secundarios actuales a *watcher*.

source: asyncio ships with the following built-in policies:
es: asyncio se envía con las siguientes políticas integradas:

source: The default asyncio policy. Uses :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
es: La política por defecto asyncio. Usa :class:`SelectorEventLoop` en Unix y :class:`ProactorEventLoop` en Windows.

source: There is no need to install the default policy manually. asyncio is configured to use the default policy automatically.
es: No hay necesidad de instalar la política por defecto manualmente. asyncio está configurado para usar la política por defecto automáticamente.

source: On Windows, :class:`ProactorEventLoop` is now used by default.
es: En Windows, :class:`ProactorEventLoop` ahora se usa por defecto.

source: The :meth:`get_event_loop` method of the default asyncio policy now emits a :exc:`DeprecationWarning` if there is no current event loop set and it decides to create one. In some future Python release this will become an error.
es: El método :meth:`get_event_loop` de la política asyncio predeterminada ahora emite una :exc:`DeprecationWarning` si no hay un bucle de eventos actual configurado y decide crear uno. En alguna versión futura de Python, esto se convertirá en un error.

source: An alternative event loop policy that uses the :class:`SelectorEventLoop` event loop implementation.
es: Una política de bucle de eventos alternativa que usa la implementación de bucle de eventos :class:`SelectorEventLoop`.

source: :ref:`Availability <availability>`: Windows.
es: :ref:`Disponibilidad <availability>`: Windows.

source: An alternative event loop policy that uses the :class:`ProactorEventLoop` event loop implementation.
es: Una política de bucle de eventos alternativa que usa la implementación de bucle de eventos :class:`ProactorEventLoop`.

source: Process Watchers
es: Observadores de procesos

source: A process watcher allows customization of how an event loop monitors child processes on Unix. Specifically, the event loop needs to know when a child process has exited.
es: Un observador de procesos permite personalizar cómo un bucle de eventos monitorea procesos secundarios en Unix. Específicamente, un bucle de eventos necesita saber cuándo un proceso secundario ha terminado.

source: In asyncio, child processes are created with :func:`create_subprocess_exec` and :meth:`loop.subprocess_exec` functions.
es: En asyncio, los procesos secundarios son creados con las funciones :func:`créate_subprocess_exec` y :meth:`loop.subprocess_exec`.

source: asyncio defines the :class:`AbstractChildWatcher` abstract base class, which child watchers should implement, and has four different implementations: :class:`ThreadedChildWatcher` (configured to be used by default), :class:`MultiLoopChildWatcher`, :class:`SafeChildWatcher`, and :class:`FastChildWatcher`.
es: asyncio define la clase base abstracta :class:`AbstractChildWatcher`, qué observadores de subprocesos deberían implementarse, y tiene cuatro implementaciones diferentes: :class:`ThreadedChildWatcher` (configurado para ser usado por defecto), :class:`MultiLoopChildWatcher`, :class:`SaferChildWatcher`, y :class:`FastChildWatcher`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
es: Mirar también la sección :ref:`Subprocesos e hilos <asyncio-subprocess-threads>`.

source: The following two functions can be used to customize the child process watcher implementation used by the asyncio event loop:
es: Las siguientes dos funciones pueden ser usadas para personalizar la implementación de observadores de procesos secundarios usados por el bucle de eventos de asyncio:

source: Return the current child watcher for the current policy.
es: Retorna el observador de procesos secundarios para la política actual.

source: Set the current child watcher to *watcher* for the current policy. *watcher* must implement methods defined in the :class:`AbstractChildWatcher` base class.
es: Establece el observador de procesos secundarios actuales a *watcher* para la política actual. *watcher* debe implementar métodos definidos en la clase base :class:`AbstractChildWatcher`.

source: Third-party event loops implementations might not support custom child watchers. For such event loops, using :func:`set_child_watcher` might be prohibited or have no effect.
es: Implementaciones de bucles de eventos de terceras partes no deben dar soporte a observadores de procesos secundarios personalizados. Para dichos bucles de eventos, usando :func:`set_child_watcher` podría estar prohibido o no tener efecto.

source: Register a new child handler.
es: Registra un nuevo gestor de proceso secundario.

source: Arrange for ``callback(pid, returncode, *args)`` to be called when a process with PID equal to *pid* terminates. Specifying another callback for the same process replaces the previous handler.
es: Arreglo para ``callback(pid, returncode, *args)`` a ser invocado cuando un proceso con PID igual a *pid* termina. Especificando otro retrollamada para el mismo proceso reemplaza el gestor previo.

source: The *callback* callable must be thread-safe.
es: El *callback* invocable debe ser seguro para hilos.

source: Removes the handler for process with PID equal to *pid*.
es: Remueve el gestor para el proceso con PID igual a *pid*.

source: The function returns ``True`` if the handler was successfully removed, ``False`` if there was nothing to remove.
es: La función retorna ``True`` si el gestor fue removido de forma exitosa, ``False`` si no hubo nada que remover.

source: Attach the watcher to an event loop.
es: Adjunta el observador a un bucle de eventos.

source: If the watcher was previously attached to an event loop, then it is first detached before attaching to the new loop.
es: Si el observador estaba previamente adjuntado a un bucle de eventos, entonces primero es separado antes de adjuntar el nuevo bucle.

source: Note: loop may be ``None``.
es: Nota: el bucle puede ser ``None``.

source: Return ``True`` if the watcher is ready to use.
es: Retorna ``True`` si el observador está listo para usarse.

source: Spawning a subprocess with *inactive* current child watcher raises :exc:`RuntimeError`.
es: Generar un nuevo subproceso con observador de procesos secundarios actual *inactive* lanza :exc:`RuntimeError`.

source: Close the watcher.
es: Cierra el observador.

source: This method has to be called to ensure that underlying resources are cleaned-up.
es: Este método tiene que ser invocado para asegurar que los objetos subyacentes están limpiados.

source: This implementation starts a new waiting thread for every subprocess spawn.
es: Esta implementación inicia un nuevo hilo esperando para cada subproceso generado.

source: It works reliably even when the asyncio event loop is run in a non-main OS thread.
es: Trabaja de manera confiable incluso cuando el bucle de eventos asyncio se ejecuta en un hilo de SO no principal.

source: There is no noticeable overhead when handling a big number of children (*O(1)* each time a child terminates), but starting a thread per process requires extra memory.
es: No hay sobrecarga notable cuando se gestiona un número grande de procesos secundarios (*O(1)* cada vez que un proceso secundario termina), pero iniciar un hilo por proceso requiere memoria extra.

source: This watcher is used by default.
es: Este observador es usado por defecto.

source: This implementation registers a :py:data:`SIGCHLD` signal handler on instantiation. That can break third-party code that installs a custom handler for :py:data:`SIGCHLD` signal.
es: Esta implementación registra un gestor de señal en instanciación :py:data:`SIGCHLD`. Eso puede romper código de terceras partes que instalen un gestor personalizado para la señal :py:data:`SIGCHLD`.

source: The watcher avoids disrupting other code spawning processes by polling every process explicitly on a :py:data:`SIGCHLD` signal.
es: El observador evita interrumpir otro código generando procesos sondeando cada proceso explícitamente en una señal :py:data:`SIGCHLD`.

source: There is no limitation for running subprocesses from different threads once the watcher is installed.
es: No hay limitación para ejecutar subprocesos de diferentes hilos una vez el observador es instalado.

source: The solution is safe but it has a significant overhead when handling a big number of processes (*O(n)* each time a :py:data:`SIGCHLD` is received).
es: La solución es segura pero tiene una sobrecarga significativa cuando se gestiona un número grande de procesos (*O(n)* cada vez que un :py:data:`SIGCHLD` es recibido).

source: This implementation uses active event loop from the main thread to handle :py:data:`SIGCHLD` signal. If the main thread has no running event loop another thread cannot spawn a subprocess (:exc:`RuntimeError` is raised).
es: Esta implementación usa bucles de eventos activos del hilo principal para gestionar la señal :py:data:`SIGCHLD`. Si el hilo principal no tiene bucles de eventos en ejecución otro hilo no puede generar un subproceso (:exc:`RuntimeError` es disparada).

source: This solution is as safe as :class:`MultiLoopChildWatcher` and has the same *O(N)* complexity but requires a running event loop in the main thread to work.
es: Esta solución es tan segura como :class:`MultiLoopChildWatcher` y tiene la misma complejidad *O(n)* pero requiere de un bucle de eventos ejecutándose en el hilo principal para trabajar.

source: This implementation reaps every terminated processes by calling ``os.waitpid(-1)`` directly, possibly breaking other code spawning processes and waiting for their termination.
es: Esta implementación cosecha cada proceso terminado llamando ``os.waitpad(-1)`` directamente, posiblemente rompiendo otro código generando procesos y esperando por su terminación.

source: There is no noticeable overhead when handling a big number of children (*O(1)* each time a child terminates).
es: No hay sobrecarga notable cuando se gestiona un número grande de procesos secundarios (*O(1)* cada vez que un proceso secundario termina).

source: This solution requires a running event loop in the main thread to work, as :class:`SafeChildWatcher`.
es: Esta solución requiere un bucle de eventos ejecutándose en el hilo principal para trabajar, como :class:`SafeChildWatcher`.

source: This implementation polls process file descriptors (pidfds) to await child process termination. In some respects, :class:`PidfdChildWatcher` is a "Goldilocks" child watcher implementation. It doesn't require signals or threads, doesn't interfere with any processes launched outside the event loop, and scales linearly with the number of subprocesses launched by the event loop. The main disadvantage is that pidfds are specific to Linux, and only work on recent (5.3+) kernels.
es: Esta implementación sondea los descriptores de archivos de proceso (pidfds) para esperar la terminación del proceso hijo. En ciertos sentidos :class:`PidfdChildWatcher` es una implementación de niño vigilante "Ricitos de oro". No requiere señales o hilos, no interfiere con ningún proceso lanzado fuera del bucle de eventos y escala linealmente con el número de subprocesos lanzados por el bucle de eventos. La principal desventaja es que los pidfds son específicos de Linux y solo funcionan en kernels recientes (5.3+).

source: Custom Policies
es: Personalizar Políticas

source: To implement a new event loop policy, it is recommended to subclass :class:`DefaultEventLoopPolicy` and override the methods for which custom behavior is wanted, e.g.::
es: Para implementar una nueva política de bucle de eventos, se recomienda heredar :class:`DefaultEventLoopPolicy` y sobreescribir los métodos para los cuales se desea una conducta personalizada, por ejemplo::
