Repository: python/python-docs-es
Catalog: library/asyncio-eventloop.po
Languages: es

source: This class is a subclass of :class:`Handle`.
es: Esta clase es una subclase de :class:`Handle`.

source: Return a scheduled callback time as :class:`float` seconds.
es: Retorna el tiempo de una llamada planificada como :class:`float` segundos.

source: The time is an absolute timestamp, using the same time reference as :meth:`loop.time`.
es: El tiempo es una marca de tiempo absoluta, usando la misma referencia de tiempo que :meth:`loop.time`.

source: Server Objects
es: Objetos Servidor

source: Server objects are created by :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, and :func:`start_unix_server` functions.
es: Los objetos de servidor son creados por las funciones :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, y :func:`start_unix_server`.

source: *Server* objects are asynchronous context managers. When used in an ``async with`` statement, it's guaranteed that the Server object is closed and not accepting new connections when the ``async with`` statement is completed::
es: Los objetos *Server* son gestores de asíncronos de contexto. Cuando son usados en una declaración ``async with``, está garantizado que el objeto Servidor está cerrado y no está aceptando nuevas conexiones cuando la declaración ``async with`` es completada::

source: Server object is an asynchronous context manager since Python 3.7.
es: El objeto Servidor es un gestor asíncrono de contexto desde Python 3.7.

source: Stop serving: close listening sockets and set the :attr:`sockets` attribute to ``None``.
es: Deja de servir: deja de escuchar sockets y establece el atributo :attr:`sockets` a ``None``.

source: The sockets that represent existing incoming client connections are left open.
es: Los sockets que representan conexiones entrantes existentes de clientes se dejan abiertas.

source: The server is closed asynchronously, use the :meth:`wait_closed` coroutine to wait until the server is closed.
es: El servidor es cerrado de manera asíncrona, usa la corrutina :meth:`wait_closed` para esperar hasta que el servidor esté cerrado.

source: Return the event loop associated with the server object.
es: Retorna el bucle de eventos asociado con el objeto Servidor.

source: Start accepting connections.
es: Comienza a aceptar conexiones.

source: This method is idempotent, so it can be called when the server is already serving.
es: Este método es idempotente, así que puede ser llamado cuando el servidor ya está sirviendo.

source: The *start_serving* keyword-only parameter to :meth:`loop.create_server` and :meth:`asyncio.start_server` allows creating a Server object that is not accepting connections initially. In this case ``Server.start_serving()``, or :meth:`Server.serve_forever` can be used to make the Server start accepting connections.
es: El parámetro sólo de palabra clave *start_serving* de :meth:`loop.create_server` y :meth:`asyncio.start_server` permite crear un objeto Servidor que no está aceptando conexiones inicialmente. En este caso ``Server.start_serving()``, o :meth:`Server.serve_forever` pueden ser usados para hacer que el servidor empiece a aceptar conexiones.

source: Start accepting connections until the coroutine is cancelled. Cancellation of ``serve_forever`` task causes the server to be closed.
es: Comienza a aceptar conexiones hasta que la corrutina sea cancelada. La cancelación de la tarea ``serve_forever`` hace que el servidor sea cerrado.

source: This method can be called if the server is already accepting connections. Only one ``serve_forever`` task can exist per one *Server* object.
es: Este método puede ser llamado si el servidor ya está aceptando conexiones. Solamente una tarea ``serve_forever`` puede existir para un objeto *Server*.

source: Return ``True`` if the server is accepting new connections.
es: Retorna ``True`` si el servidor está aceptando nuevas conexiones.

source: Wait until the :meth:`close` method completes.
es: Espera hasta que el método :meth:`close` se complete.

source: Prior to Python 3.7 ``Server.sockets`` used to return an internal list of server sockets directly. In 3.7 a copy of that list is returned.
es: Antes de Python 3.7 ``Server.sockets`` solía retornar directamente una lista interna de servidores socket. En 3.7 se retorna una copia de esa lista.

source: Event Loop Implementations
es: Implementaciones del bucle de eventos

source: asyncio ships with two different event loop implementations: :class:`SelectorEventLoop` and :class:`ProactorEventLoop`.
es: asyncio viene con dos implementaciones diferentes del bucle de eventos: :class:`SelectorEventLoop` y :class:`ProactorEventLoop`.

source: By default asyncio is configured to use :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
es: De manera predefinida asyncio está configurado para usar :class:`SelectorEventLoop` en Unix y :class:`ProactorEventLoop` en Windows.

source: An event loop based on the :mod:`selectors` module.
es: Un bucle de eventos basado en el módulo :mod:`selectors`.

source: Uses the most efficient *selector* available for the given platform. It is also possible to manually configure the exact selector implementation to be used::
es: Usa el *selector* disponible mas eficiente para la plataforma dada. También es posible configurar manualmente la implementación exacta del selector a utilizar::

source: :ref:`Availability <availability>`: Unix, Windows.
es: :ref:`Disponibilidad <availability>`: Unix, Windows.

source: An event loop for Windows that uses "I/O Completion Ports" (IOCP).
es: Un bucle de eventos para Windows que usa "E/S Puertos de Finalización" (IOCP).

source: :ref:`Availability <availability>`: Windows.
es: :ref:`Disponibilidad <availability>`: Windows.

source: `MSDN documentation on I/O Completion Ports <https://docs.microsoft.com/en-ca/windows/desktop/FileIO/i-o-completion-ports>`_.
es: `Documentaci´on de MSDN sobre E/S Puertos de Finalización <https://docs.microsoft.com/en-ca/windows/desktop/FileIO/i-o-completion-ports>`_.

source: Abstract base class for asyncio-compliant event loops.
es: Clase base abstracta para bucles de evento compatibles con asyncio.

source: The :ref:`asyncio-event-loop-methods` section lists all methods that an alternative implementation of ``AbstractEventLoop`` should have defined.
es: La sección :ref:`asyncio-event-loop-methods` lista todos los métodos que una implementación alternativa de ``AbstractEventLoop`` debería tener definidos.

source: Note that all examples in this section **purposefully** show how to use the low-level event loop APIs, such as :meth:`loop.run_forever` and :meth:`loop.call_soon`. Modern asyncio applications rarely need to be written this way; consider using the high-level functions like :func:`asyncio.run`.
es: Nótese que todos los ejemplos en esta sección muestran **a propósito** como usar las APIs de bucle de eventos de bajo nivel, como ser :meth:`loop.run_forever` y :meth:`loop.call_soon`. Aplicaciones asyncio modernas raramente necesitan ser escritas de esta manera; considere utilizar funciones de alto nivel como :func:`asyncio.run`.

source: Hello World with call_soon()
es: Hola Mundo con call_soon()

source: An example using the :meth:`loop.call_soon` method to schedule a callback. The callback displays ``"Hello World"`` and then stops the event loop::
es: Un ejemplo usando el método :meth:`loop.call_soon` para planificar una llamada. La llamada muestra ``"Hello World"`` y luego para el bucle de eventos::

source: A similar :ref:`Hello World <coroutine>` example created with a coroutine and the :func:`run` function.
es: Un ejemplo similar de :ref:`Hola Mundo <coroutine>` creado con una corrutina y la función :func:`run`.

source: Display the current date with call_later()
es: Muestra la fecha actual con call_later()

source: An example of a callback displaying the current date every second. The callback uses the :meth:`loop.call_later` method to reschedule itself after 5 seconds, and then stops the event loop::
es: Un ejemplo de llamada mostrando la fecha actual cada un segundo. La llamada usa el método :meth:`loop.call_later` para volver a planificarse después de 5 segundos, y después para el bucle de eventos::

source: A similar :ref:`current date <asyncio_example_sleep>` example created with a coroutine and the :func:`run` function.
es: Un ejemplo similar a :ref:`fecha actual <asyncio_example_sleep>` creado con una corrutina y la función :func:`run`.

source: Watch a file descriptor for read events
es: Mirar un descriptor de archivo para leer eventos

source: Wait until a file descriptor received some data using the :meth:`loop.add_reader` method and then close the event loop::
es: Espera hasta que el descriptor de archivo reciba algún dato usando el método :meth:`loop.add_reader` y entonces cierra el bucle de eventos::

source: A similar :ref:`example <asyncio_example_create_connection>` using transports, protocols, and the :meth:`loop.create_connection` method.
es: Un :ref:`ejemplo <asyncio_example_create_connection>` similar usando transportes, protocolos y el método :meth:`loop.create_connection`.

source: Another similar :ref:`example <asyncio_example_create_connection-streams>` using the high-level :func:`asyncio.open_connection` function and streams.
es: Otro :ref:`ejemplo <asyncio_example_create_connection-streams>` similar usando la función de alto nivel :func:`asyncio.open_connection` y transmisiones.

source: Set signal handlers for SIGINT and SIGTERM
es: Establece los gestores de señal para SIGINT y SIGTERM

source: (This ``signals`` example only works on Unix.)
es: (Este ejemplo de ``signals`` solamente funcionan en Unix.)

source: Register handlers for signals :py:data:`SIGINT` and :py:data:`SIGTERM` using the :meth:`loop.add_signal_handler` method::
es: Registra gestores para las señales :py:data:`SIGINT` y :py:data:`SIGTERM` usando el método :meth:`loop.add_signal_handler`::
