Repository: python/python-docs-es
Catalog: library/asyncio-protocol.po
Languages: es

source: Send the *signal* number to the subprocess, as in :meth:`subprocess.Popen.send_signal`.
es: Envía el número de *señal* al subproceso, como en :meth:`subprocess.Popen.send_signal`.

source: Stop the subprocess.
es: Detiene el subproceso.

source: On POSIX systems, this method sends SIGTERM to the subprocess. On Windows, the Windows API function TerminateProcess() is called to stop the subprocess.
es: En los sistemas POSIX, este método envía SIGTERM al subproceso. En Windows, se llama a la función de la API de Windows *TerminateProcess()* para detener el subproceso.

source: See also :meth:`subprocess.Popen.terminate`.
es: Ver también :meth:`subprocess.Popen.terminate`.

source: Kill the subprocess by calling the :meth:`kill` method.
es: Mata al subproceso llamando al método :meth:`kill`.

source: If the subprocess hasn't returned yet, and close transports of *stdin*, *stdout*, and *stderr* pipes.
es: Si el subproceso aún no ha retornado, cierra los transportes de las pipes *stdin*, *stdout* y *stderr*.

source: Protocols
es: Protocolos

source: **Source code:** :source:`Lib/asyncio/protocols.py`
es: **Código fuente:** :source:`Lib/asyncio/protocols.py`

source: asyncio provides a set of abstract base classes that should be used to implement network protocols. Those classes are meant to be used together with :ref:`transports <asyncio-transport>`.
es: asyncio proporciona un conjunto de clases base abstractas que pueden usarse para implementar protocolos de red. Estas clases están destinadas a ser utilizadas junto con los :ref:`transportes <asyncio-transport>`.

source: Subclasses of abstract base protocol classes may implement some or all methods. All these methods are callbacks: they are called by transports on certain events, for example when some data is received. A base protocol method should be called by the corresponding transport.
es: Las subclases de las clases abstractas de protocolos base pueden implementar algunos o todos los métodos. Todos estos métodos son retrollamadas: son llamados por los transportes en ciertos eventos, por ejemplo, cuando se reciben algunos datos. Un método del protocolo base debe ser llamado por el transporte correspondiente.

source: Base Protocols
es: Protocolos base

source: Base protocol with methods that all protocols share.
es: Protocolo base con métodos que comparten todos los demás protocolos.

source: The base class for implementing streaming protocols (TCP, Unix sockets, etc).
es: La clase base para implementar protocolos de *streaming* (TCP, sockets Unix, etc).

source: A base class for implementing streaming protocols with manual control of the receive buffer.
es: Una clase base para implementar protocolos de *streaming* con control manual del búfer de recepción.

source: The base class for implementing datagram (UDP) protocols.
es: La clase base para implementar protocolos de datagramas (UDP).

source: The base class for implementing protocols communicating with child processes (unidirectional pipes).
es: La clase base para implementar protocolos que se comunican con procesos secundarios (pipes unidireccionales).

source: Base Protocol
es: Protocolo base

source: All asyncio protocols can implement Base Protocol callbacks.
es: Todos los protocolos asyncio pueden implementar las retrollamadas del protocolo base.

source: Connection Callbacks
es: Retrollamadas de conexión

source: Connection callbacks are called on all protocols, exactly once per a successful connection. All other protocol callbacks can only be called between those two methods.
es: Las retrollamadas de conexión son llamadas exactamente una vez por conexión establecida en todos los protocolos. Todas las demás retrollamadas del protocolo solo pueden ser llamadas entre estos dos métodos.

source: Called when a connection is made.
es: Se llama cuando se establece una conexión.

source: The *transport* argument is the transport representing the connection. The protocol is responsible for storing the reference to its transport.
es: El argumento *transport* es el transporte que representa la conexión. El protocolo se encarga de almacenar la referencia a su propio transporte.

source: Called when the connection is lost or closed.
es: Se llama cuando la conexión se pierde o se cierra.

source: The argument is either an exception object or :const:`None`. The latter means a regular EOF is received, or the connection was aborted or closed by this side of the connection.
es: El argumento es un objeto excepción o :const:`None`. Esto último significa que se recibió un EOF regular o que la conexión fue cancelada o cerrada por este lado de la conexión.

source: Flow Control Callbacks
es: Retrollamadas de control de flujo

source: Flow control callbacks can be called by transports to pause or resume writing performed by the protocol.
es: Los transportes pueden llamar a las retrollamadas de control de flujo para pausar o reanudar la escritura llevada a cabo por el protocolo.

source: See the documentation of the :meth:`~WriteTransport.set_write_buffer_limits` method for more details.
es: Consulta la documentación del método :meth:`~WriteTransport.set_write_buffer_limits` para obtener más detalles.

source: Called when the transport's buffer goes over the high watermark.
es: Se llama cuando el búfer del transporte supera el límite superior.

source: Called when the transport's buffer drains below the low watermark.
es: Se llama cuando el búfer del transporte se vacía por debajo del límite inferior.

source: If the buffer size equals the high watermark, :meth:`~BaseProtocol.pause_writing` is not called: the buffer size must go strictly over.
es: Si el tamaño del búfer es igual al límite superior, :meth:`~BaseProtocol.pause_writing` no será llamado: el tamaño del búfer debe superarse estrictamente.

source: Conversely, :meth:`~BaseProtocol.resume_writing` is called when the buffer size is equal or lower than the low watermark. These end conditions are important to ensure that things go as expected when either mark is zero.
es: Por el contrario, se llama a :meth:`~BaseProtocol.resume_writing` cuando el tamaño del búfer es igual o menor que el límite inferior. Estas condiciones finales son importantes para garantizar que todo salga como se espera cuando cualquiera de los dos límites sea cero.

source: Streaming Protocols
es: Protocolos de *streaming*

source: Event methods, such as :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, and :meth:`loop.connect_write_pipe` accept factories that return streaming protocols.
es: Los métodos de eventos, como :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, y :meth:`loop.connect_write_pipe` aceptan fábricas que retornan protocolos de *streaming*.

source: Called when some data is received. *data* is a non-empty bytes object containing the incoming data.
es: Se llama cuando se reciben algunos datos. *data* es un objeto bytes no vacío que contiene los datos entrantes.

source: Whether the data is buffered, chunked or reassembled depends on the transport. In general, you shouldn't rely on specific semantics and instead make your parsing generic and flexible. However, data is always received in the correct order.
es: Que los datos se almacenen en un búfer, que se fragmenten o se vuelvan a ensamblar depende del transporte. En general, no debe confiar en semánticas específicas y, en cambio, hacer que su análisis sea genérico y flexible. Sin embargo, los datos siempre se reciben en el orden correcto.

source: The method can be called an arbitrary number of times while a connection is open.
es: El método se puede llamar un número arbitrario de veces mientras una conexión esté abierta.

source: However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once. Once `eof_received()` is called, ``data_received()`` is not called anymore.
es: Sin embargo, :meth:`protocol.eof_received() <Protocol.eof_received>` se llama como máximo una vez. En el momento que se llama a `eof_received()`, ya no se llama a ``data_received()``.

source: Called when the other end signals it won't send any more data (for example by calling :meth:`transport.write_eof() <WriteTransport.write_eof>`, if the other end also uses asyncio).
es: Se llama cuando el otro extremo indica que no enviará más datos (por ejemplo, llamando a :meth:`transport.write_eof() <WriteTransport.write_eof>` si el otro extremo también usa asyncio).

source: This method may return a false value (including ``None``), in which case the transport will close itself. Conversely, if this method returns a true value, the protocol used determines whether to close the transport. Since the default implementation returns ``None``, it implicitly closes the connection.
es: Este método puede retornar un valor falso (incluido ``None``), en cuyo caso el transporte se cerrará solo. Por el contrario, si este método retorna un valor verdadero, el protocolo utilizado determina si se debe cerrar el transporte. Dado que la implementación por defecto retorna ``None``, en éste caso, se cierra implícitamente la conexión.

source: Some transports, including SSL, don't support half-closed connections, in which case returning true from this method will result in the connection being closed.
es: Algunos transportes, incluido SSL, no admiten conexiones half-closed ('semi-cerradas'), en cuyo caso retornar verdadero desde este método resultará en el cierre de la conexión.

source: State machine:
es: Máquina de estado:

source: Buffered Streaming Protocols
es: Protocolos de *streaming* mediante búfer

source: **Important:** this has been added to asyncio in Python 3.7 *on a provisional basis*! This is as an experimental API that might be changed or removed completely in Python 3.8.
es: **Importante:** ¡esto se ha agregado a asyncio en Python 3.7 *de forma provisional*! Debe tratarse como una API experimental que puede cambiarse o eliminarse por completo en Python 3.8.

source: Buffered Protocols can be used with any event loop method that supports `Streaming Protocols`_.
es: Los protocolos que hacen uso de un búfer se pueden utilizar con cualquier método del bucle de eventos que admita `Streaming Protocols`_.

source: ``BufferedProtocol`` implementations allow explicit manual allocation and control of the receive buffer. Event loops can then use the buffer provided by the protocol to avoid unnecessary data copies. This can result in noticeable performance improvement for protocols that receive big amounts of data. Sophisticated protocol implementations can significantly reduce the number of buffer allocations.
es: Las implementaciones de ``BufferedProtocol`` permiten la asignación manual explícita y el control del búfer de recepción. Los bucles de eventos pueden utilizar el búfer proporcionado por el protocolo para evitar copias de datos innecesarias. Esto puede resultar en una mejora notable del rendimiento de los protocolos que reciben grandes cantidades de datos. Las implementaciones de protocolos sofisticados pueden reducir significativamente la cantidad de asignaciones de búfer.

source: The following callbacks are called on :class:`BufferedProtocol` instances:
es: Las siguientes retrollamadas son llamadas en instancias :class:`BufferedProtocol`:

source: Called to allocate a new receive buffer.
es: Se llama para asignar un nuevo búfer de recepción.

source: *sizehint* is the recommended minimum size for the returned buffer. It is acceptable to return smaller or larger buffers than what *sizehint* suggests. When set to -1, the buffer size can be arbitrary. It is an error to return a buffer with a zero size.
es: *sizehint* es el tamaño mínimo recomendado para el búfer retornado. Es aceptable retornar búferes más pequeños o más grandes de lo que sugiere *sizehint*. Cuando se establece en -1, el tamaño del búfer puede ser arbitrario. Es un error retornar un búfer con tamaño cero.

source: ``get_buffer()`` must return an object implementing the :ref:`buffer protocol <bufferobjects>`.
es: ``get_buffer()`` debe retornar un objeto que implemente el :ref:`protocolo de búfer <bufferobjects>`.

source: Called when the buffer was updated with the received data.
es: Se llama cuando el búfer se ha actualizado con los datos recibidos.

source: *nbytes* is the total number of bytes that were written to the buffer.
es: *nbytes* es el número total de bytes que se escribieron en el búfer.

source: See the documentation of the :meth:`protocol.eof_received() <Protocol.eof_received>` method.
es: Consulte la documentación del método :meth:`protocol.eof_received() <Protocol.eof_received>`.

source: :meth:`~BufferedProtocol.get_buffer` can be called an arbitrary number of times during a connection. However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once and, if called, :meth:`~BufferedProtocol.get_buffer` and :meth:`~BufferedProtocol.buffer_updated` won't be called after it.
es: :meth:`~BufferedProtocol.get_buffer` se puede llamar un número arbitrario de veces durante una conexión. Sin embargo, :meth:`protocol.eof_received () <Protocol.eof_received>` se llama como máximo una vez y, si se llama, :meth:`~BufferedProtocol.get_buffer` y :meth:`~BufferedProtocol.buffer_updated` no serán llamados después de eso.

source: Datagram Protocols
es: Protocolos de datagramas

source: Datagram Protocol instances should be constructed by protocol factories passed to the :meth:`loop.create_datagram_endpoint` method.
es: Las instancias del protocolo de datagramas deben ser construidas por fábricas de protocolos pasadas al método :meth:`loop.create_datagram_endpoint`.

source: Called when a datagram is received. *data* is a bytes object containing the incoming data. *addr* is the address of the peer sending the data; the exact format depends on the transport.
es: Se llama cuando se recibe un datagrama. *data* es un objeto bytes que contiene los datos entrantes. *addr* es la dirección del par que envía los datos; el formato exacto depende del transporte.

source: Called when a previous send or receive operation raises an :class:`OSError`. *exc* is the :class:`OSError` instance.
es: Se llama cuando una operación de envío o recepción anterior genera una :class:`OSError`. *exc* es la instancia :class:`OSError`.

source: This method is called in rare conditions, when the transport (e.g. UDP) detects that a datagram could not be delivered to its recipient. In many conditions though, undeliverable datagrams will be silently dropped.
es: Este método se llama en condiciones excepcionales, cuando el transporte (por ejemplo, UDP) detecta que un datagrama no se pudo entregar a su destinatario. Sin embargo, en la mayoría de casos, los datagramas que no se puedan entregar se eliminarán silenciosamente.

source: On BSD systems (macOS, FreeBSD, etc.) flow control is not supported for datagram protocols, because there is no reliable way to detect send failures caused by writing too many packets.
es: En los sistemas BSD (macOS, FreeBSD, etc.) el control de flujo no es compatible con los protocolos de datagramas, esto se debe a que no hay una forma confiable de detectar fallos de envío causados por escribir demasiados paquetes.

source: The socket always appears 'ready' and excess packets are dropped. An :class:`OSError` with ``errno`` set to :const:`errno.ENOBUFS` may or may not be raised; if it is raised, it will be reported to :meth:`DatagramProtocol.error_received` but otherwise ignored.
es: El socket siempre aparece como disponible ('ready') y se eliminan los paquetes sobrantes. Un error :class:`OSError` con ``errno`` establecido en :const:`errno.ENOBUFS` puede o no ser generado; si se genera, se informará a :meth:`DatagramProtocol.error_received` pero en caso contrario se ignorará.

source: Subprocess Protocols
es: Protocolos de subprocesos

source: Datagram Protocol instances should be constructed by protocol factories passed to the :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
es: Las instancias del protocolo de datagramas deben ser construidas por fábricas de protocolos pasadas a los métodos :meth:`loop.subprocess_exec` y :meth:`loop.subprocess_shell`.

source: Called when the child process writes data into its stdout or stderr pipe.
es: Se llama cuando el proceso hijo escribe datos en su pipe stdout o stderr.

source: *fd* is the integer file descriptor of the pipe.
es: *fd* es el descriptor de archivo entero de la pipe.

source: *data* is a non-empty bytes object containing the received data.
es: *data* es un objeto bytes no vacío que contiene los datos recibidos.

source: Called when one of the pipes communicating with the child process is closed.
es: Se llama cuando se cierra una de las pipes que se comunican con el proceso hijo.

source: *fd* is the integer file descriptor that was closed.
es: *fd* es el descriptor de archivo entero que se cerró.

source: Called when the child process has exited.
es: Se llama cuando el proceso hijo ha finalizado.

source: Examples
es: Ejemplos

source: TCP Echo Server
es: Servidor de eco TCP

source: Create a TCP echo server using the :meth:`loop.create_server` method, send back received data, and close the connection::
es: Crear un servidor de eco TCP usando el método :meth:`loop.create_server`, enviar de vuelta los datos recibidos y cerrar la conexión::

source: The :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` example uses the high-level :func:`asyncio.start_server` function.
es: El ejemplo :ref:`Servidor de eco TCP usando streams <asyncio-tcp-echo-server-streams>` usa la función de alto nivel :func:`asyncio.start_server`.

source: TCP Echo Client
es: Cliente de eco TCP

source: A TCP echo client using the :meth:`loop.create_connection` method, sends data, and waits until the connection is closed::
es: Un cliente de eco TCP usando el método :meth:`loop.create_connection`, envía datos y espera hasta que la conexión se cierre::

source: The :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` example uses the high-level :func:`asyncio.open_connection` function.
es: El ejemplo :ref:`Cliente de eco TCP usando streams <asyncio-tcp-echo-client-streams>` usa la función de alto nivel :func:`asyncio.open_connection`.

source: UDP Echo Server
es: Servidor de eco UDP

source: A UDP echo server, using the :meth:`loop.create_datagram_endpoint` method, sends back received data::
es: Un servidor de eco UDP, usando el método :meth:`loop.create_datagram_endpoint`, envía de vuelta los datos recibidos::

source: UDP Echo Client
es: Cliente de eco UDP

source: A UDP echo client, using the :meth:`loop.create_datagram_endpoint` method, sends data and closes the transport when it receives the answer::
es: Un cliente de eco UDP, usando el método :meth:`loop.create_datagram_endpoint`, envía datos y cierra el transporte cuando recibe la respuesta:

source: Connecting Existing Sockets
es: Conectando sockets existentes

source: Wait until a socket receives data using the :meth:`loop.create_connection` method with a protocol::
es: Espera hasta que un socket reciba datos usando el método :meth:`loop.create_connection` mediante un protocolo::

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to register an FD.
es: El ejemplo :ref:`monitorizar eventos de lectura en un descriptor de archivo <asyncio_example_watch_fd>` utiliza el método de bajo nivel :meth:`loop.add_reader` para registrar un descriptor de archivo.

source: The :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` example uses high-level streams created by the :func:`open_connection` function in a coroutine.
es: El ejemplo :ref:`registrar un socket abierto a la espera de datos usando streams <asyncio_example_create_connection-streams>` usa *streams* de alto nivel creados por la función :func:`open_connection` en una corrutina.

source: loop.subprocess_exec() and SubprocessProtocol
es: *loop.subprocess_exec()* y *SubprocessProtocol*

source: An example of a subprocess protocol used to get the output of a subprocess and to wait for the subprocess exit.
es: Un ejemplo de un protocolo de subproceso que se utiliza para obtener la salida de un subproceso y esperar su terminación.

source: The subprocess is created by th :meth:`loop.subprocess_exec` method::
es: El subproceso es creado por el método :meth:`loop.subprocess_exec`::

source: See also the :ref:`same example <asyncio_example_create_subprocess_exec>` written using high-level APIs.
es: Consulte también el :ref:`mismo ejemplo <asyncio_example_create_subprocess_exec>` escrito utilizando la API de alto nivel.
