Repository: python/python-docs-es
Catalog: library/asyncio-api-index.po
Languages: es

source: High-level API Index
es: Índice de API de alto nivel

source: This page lists all high-level async/await enabled asyncio APIs.
es: Esta página lista todas las APIs async/await habilitadas de alto nivel.

source: Tasks
es: Tareas

source: Utilities to run asyncio programs, create Tasks, and await on multiple things with timeouts.
es: Utilidades para ejecutar programas asyncio, crear Tareas, y esperar en múltiples cosas con tiempos de espera.

source: Create event loop, run a coroutine, close the loop.
es: Crea un loop de eventos, ejecuta una corrutina, cierra el loop.

source: A context manager that simplifies multiple async function calls.
es: Un administrador de contexto que simplifica múltiples llamadas a funciones asíncronas.

source: Task object.
es: Objeto tarea.

source: A context manager that holds a group of tasks. Provides a convenient and reliable way to wait for all tasks in the group to finish.
es: Un administrador de contexto que contiene un grupo de tareas. Proporciona una forma conveniente y confiable de esperar a que finalicen todas las tareas del grupo.

source: Start an asyncio Task, then returns it.
es: Inicia una tarea asyncio, luego la retorna.

source: Return the current Task.
es: Retorna la tarea actual.

source: Return all tasks that are not yet finished for an event loop.
es: Retorna todas las tareas que aún no han terminado para un bucle de eventos.

source: Sleep for a number of seconds.
es: Duerme por un número de segundos.

source: Schedule and wait for things concurrently.
es: Programa y espera por cosas concurrentemente.

source: Run with a timeout.
es: Ejecuta con un tiempo de espera.

source: Shield from cancellation.
es: Protege de la cancelación.

source: Monitor for completion.
es: Monitorea la completitud.

source: Run with a timeout. Useful in cases when ``wait_for`` is not suitable.
es: Ejecuta con un tiempo de espera. Útil en los casos en que ``wait_for`` no es adecuado.

source: Asynchronously run a function in a separate OS thread.
es: Ejecute de forma asincrónica una función en un subproceso del sistema operativo independiente.

source: Schedule a coroutine from another OS thread.
es: Programa una corrutina de desde otro hilo del sistema operativo.

source: Monitor for completion with a ``for`` loop.
es: Monitorea por completitud con un loop ``for``.

source: Examples
es: Ejemplos

source: :ref:`Using asyncio.gather() to run things in parallel <asyncio_example_gather>`.
es: :ref:`Usando asyncio.gather() para ejecutar cosas en paralelo <asyncio_example_gather>`.

source: :ref:`Using asyncio.wait_for() to enforce a timeout <asyncio_example_waitfor>`.
es: :ref:`Usando asyncio.wait_for() para forzar un tiempo de expiración <asyncio_example_waitfor>`.

source: :ref:`Cancellation <asyncio_example_task_cancel>`.
es: :ref:`Cancelación <asyncio_example_task_cancel>`.

source: :ref:`Using asyncio.sleep() <asyncio_example_sleep>`.
es: :ref:`Usando asyncio.sleep() <asyncio_example_sleep>`.

source: See also the main :ref:`Tasks documentation page <coroutine>`.
es: Ver también la :ref:`página principal de documentación de Tareas <coroutine>`.

source: Queues
es: Colas

source: Queues should be used to distribute work amongst multiple asyncio Tasks, implement connection pools, and pub/sub patterns.
es: Las colas deberían ser usadas para distribuir trabajo entre múltiples Tareas asyncio, implementar pools de conexiones y patrones pub/sub.

source: A FIFO queue.
es: Una cola FIFO.

source: A priority queue.
es: Una cola de prioridad.

source: A LIFO queue.
es: Una cola LIFO.

source: :ref:`Using asyncio.Queue to distribute workload between several Tasks <asyncio_example_queue_dist>`.
es: :ref:`Usando asyncio.Queue para distribuir carga de trabajo entre varias Tareas <asyncio_example_queue_dist>`.

source: See also the :ref:`Queues documentation page <asyncio-queues>`.
es: Ver también la :ref:`página de documentación de Colas <asyncio-queues>`.

source: Subprocesses
es: Subprocesos

source: Utilities to spawn subprocesses and run shell commands.
es: Utilidades para generar subprocesos y ejecutar comandos de consola.

source: Create a subprocess.
es: Crea un subproceso.

source: Run a shell command.
es: Ejecuta un comando de consola.

source: :ref:`Executing a shell command <asyncio_example_subprocess_shell>`.
es: :ref:`Ejecutando un comando de consola <asyncio_example_subprocess_shell>`.

source: See also the :ref:`subprocess APIs <asyncio-subprocess>` documentation.
es: Ver también la documentación de las :ref:`APIs de subprocesos <asyncio-subprocess>`.

source: Streams
es: Flujos

source: High-level APIs to work with network IO.
es: APIs de alto nivel para trabajar con IO de red.

source: Establish a TCP connection.
es: Establece una conexión TCP.

source: Establish a Unix socket connection.
es: Establece una conexión de un socket Unix.

source: Start a TCP server.
es: Lanza un servidor TCP.

source: Start a Unix socket server.
es: Lanza un servidor de sockets Unix.

source: High-level async/await object to receive network data.
es: Objeto de alto nivel async/await para recibir datos de red.

source: High-level async/await object to send network data.
es: Objeto de alto nivel async/await para enviar datos de red.

source: :ref:`Example TCP client <asyncio_example_stream>`.
es: :ref:`Cliente TCP de ejemplo <asyncio_example_stream>`.

source: See also the :ref:`streams APIs <asyncio-streams>` documentation.
es: Ver también la documentación de :ref:`APIs de flujos <asyncio-streams>`.

source: Synchronization
es: Sincronización

source: Threading-like synchronization primitives that can be used in Tasks.
es: Primitivas de sincronización al estilo hilos que pueden ser usadas en Tareas.

source: A mutex lock.
es: Un bloqueo mutex.

source: An event object.
es: Un objeto de evento.

source: A condition object.
es: Un objeto de condición.

source: A semaphore.
es: Un semáforo.

source: A bounded semaphore.
es: Un semáforo acotado.

source: A barrier object.
es: Un objeto barrera.

source: :ref:`Using asyncio.Event <asyncio_example_sync_event>`.
es: :ref:`Usando asyncio.Event <asyncio_example_sync_event>`.

source: :ref:`Using asyncio.Barrier <asyncio_example_barrier>`.
es: :ref:`Usando asyncio.Barrier <asyncio_example_barrier>`.

source: See also the documentation of asyncio :ref:`synchronization primitives <asyncio-sync>`.
es: Ver también la documentación de las :ref:`primitivas de sincronización <asyncio-sync>` de asyncio.

source: Exceptions
es: Excepciones

source: Raised when a Task is cancelled. See also :meth:`Task.cancel`.
es: Lanzada cuando una Tarea es cancelada. Ver también :meth:`Task.cancel`.

source: Raised when a Barrier is broken. See also :meth:`Barrier.wait`.
es: Lanzada cuando se rompe una barrera. Véase también :meth:`Barrier.wait`.

source: :ref:`Handling CancelledError to run code on cancellation request <asyncio_example_task_cancel>`.
es: :ref:`Gestionando CancelledError para ejecutar código en petición de cancelación <asyncio_example_task_cancel>`.

source: See also the full list of :ref:`asyncio-specific exceptions <asyncio-exceptions>`.
es: Ver también la lista completa de :ref:`excepciones específicas de asyncio <asyncio-exceptions>`.
