Repository: python/python-docs-es
Catalog: library/asyncio-eventloop.po
Languages: es

source: Event Loop
es: Bucle de eventos

source: **Source code:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
es: **Código fuente:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`

source: Preface
es: Prólogo

source: The event loop is the core of every asyncio application. Event loops run asynchronous tasks and callbacks, perform network IO operations, and run subprocesses.
es: El bucle de eventos es el núcleo de cada aplicación asyncio. Los bucles de eventos ejecutan tareas asíncronas y llamadas de retorno, realizan operaciones de E/S de red y ejecutan subprocesos.

source: Application developers should typically use the high-level asyncio functions, such as :func:`asyncio.run`, and should rarely need to reference the loop object or call its methods. This section is intended mostly for authors of lower-level code, libraries, and frameworks, who need finer control over the event loop behavior.
es: Los desarrolladores de aplicaciones normalmente deberían usar las funciones asyncio de alto nivel, como: :func:`asyncio.run`, y rara vez deberían necesitar hacer referencia al objeto de bucle o llamar a sus métodos. Esta sección esta dirigida principalmente a autores de código de nivel inferior, bibliotecas y frameworks, quienes necesitan un control mas preciso sobre el comportamiento del bucle de eventos.

source: Obtaining the Event Loop
es: Obtención del bucle de eventos

source: The following low-level functions can be used to get, set, or create an event loop:
es: Las siguientes funciones de bajo nivel se pueden utilizar para obtener, establecer o crear un bucle de eventos:

source: Return the running event loop in the current OS thread.
es: Retorna el bucle de eventos en ejecución en el hilo del sistema operativo actual.

source: Get the current event loop.
es: Obtiene bucle de eventos actual.

source: Because this function has rather complex behavior (especially when custom event loop policies are in use), using the :func:`get_running_loop` function is preferred to :func:`get_event_loop` in coroutines and callbacks.
es: Dado que esta función tiene un comportamiento bastante complejo (especialmente cuando están en uso las políticas de bucle de eventos personalizadas), usar la función :func:`get_running_loop` es preferible antes que :func:`get_event_loop` en corrutinas y llamadas de retorno.

source: Create and return a new event loop object.
es: Crea y retorna un nuevo objeto de bucle de eventos.

source: Note that the behaviour of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be altered by :ref:`setting a custom event loop policy <asyncio-policies>`.
es: Tenga en cuenta que el comportamiento de las funciones :func:`get_event_loop`, :func:`set_event_loop`, y :func:`new_event_loop` puede ser modificado mediante :ref:`estableciendo una política de bucle de eventos personalizada <asyncio-policies>`.

source: Contents
es: Contenidos

source: This documentation page contains the following sections:
es: Esta página de documentación contiene las siguientes secciones:

source: The `Event Loop Methods`_ section is the reference documentation of the event loop APIs;
es: La sección `Métodos del bucle de eventos`_ es la documentación de referencia de las APIs del bucle de eventos;

source: The `Callback Handles`_ section documents the :class:`Handle` and :class:`TimerHandle` instances which are returned from scheduling methods such as :meth:`loop.call_soon` and :meth:`loop.call_later`;
es: La sección `Callback Handles`_ documenta las instancias :class:`Handle` y :class:`TimerHandle` las cuales son retornadas por métodos planificados como :meth:`loop.call_soon` y :meth:`loop.call_later`;

source: The `Server Objects`_ section documents types returned from event loop methods like :meth:`loop.create_server`;
es: La sección `Objetos del servidor`_ documenta tipos retornados por los métodos del bucle de eventos como :meth:`loop.create_server`;

source: The `Event Loop Implementations`_ section documents the :class:`SelectorEventLoop` and :class:`ProactorEventLoop` classes;
es: La sección `Implementaciones de bucle de eventos`_ documenta las clases :class:`SelectorEventLoop` y :class:`ProactorEventLoop`;

source: The `Examples`_ section showcases how to work with some event loop APIs.
es: La sección `Ejemplos`_ muestra como trabajar con algunas APIs de bucle de eventos.

source: Event Loop Methods
es: Métodos del bucle de eventos

source: Event loops have **low-level** APIs for the following:
es: Los bucles de eventos tienen APIs de **bajo nivel** para lo siguiente:

source: Running and stopping the loop
es: Iniciar y para el bucle

source: Run until the *future* (an instance of :class:`Future`) has completed.
es: Se ejecuta hasta que *future* (una instancia de :class:`Future`) se haya completado.

source: If the argument is a :ref:`coroutine object <coroutine>` it is implicitly scheduled to run as a :class:`asyncio.Task`.
es: Si el argumento es un :ref:`objeto corrutina <coroutine>` está implícitamente planificado para ejecutarse como una :class:`asyncio.Task`.

source: Return the Future's result or raise its exception.
es: Retorna el resultado del Futuro o genera una excepción.

source: Run the event loop until :meth:`stop` is called.
es: Ejecuta el bucle de eventos hasta que :meth:`stop` es llamado.

source: If :meth:`stop` is called before :meth:`run_forever()` is called, the loop will poll the I/O selector once with a timeout of zero, run all callbacks scheduled in response to I/O events (and those that were already scheduled), and then exit.
es: Si :meth:`stop` es llamado antes que :meth:`run_forever()`, el bucle va a sondear el selector de E/S una sola vez con un plazo de ejecución de cero, ejecuta todas las llamadas planificadas como respuesta a eventos E/S (y aquellas que ya hayan sido planificados), y entonces termina.

source: If :meth:`stop` is called while :meth:`run_forever` is running, the loop will run the current batch of callbacks and then exit. Note that new callbacks scheduled by callbacks will not run in this case; instead, they will run the next time :meth:`run_forever` or :meth:`run_until_complete` is called.
es: Si :meth:`stop` es llamado mientras :meth:`run_forever` se está ejecutando, el loop ejecutará el lote actual de llamadas y después finalizará. Tenga en cuenta que llamadas planificadas por otras llamadas no se ejecutarán en este caso; en su lugar, ellas correrán la próxima vez que :meth:`run_forever` o :meth:`run_until_complete` sean llamados.

source: Stop the event loop.
es: Detener el bucle de eventos.

source: Return ``True`` if the event loop is currently running.
es: Retorna ``True`` si el bucle de eventos esta en ejecución actualmente.

source: Return ``True`` if the event loop was closed.
es: Retorna ``True`` si el bucle de eventos se cerró.

source: Close the event loop.
es: Cierra el bucle de eventos.

source: The loop must not be running when this function is called. Any pending callbacks will be discarded.
es: El bucle no debe estar en ejecución cuando se llama a esta función. Cualquier llamada de retorno pendiente será descartada.

source: This method clears all queues and shuts down the executor, but does not wait for the executor to finish.
es: Este método limpia todas las colas y apaga el ejecutor, pero no espera a que el ejecutor termine.

source: This method is idempotent and irreversible. No other methods should be called after the event loop is closed.
es: Este método es idempotente e irreversible. No se debe llamar ningún otro método después que el bucle de eventos es cerrado.

source: Schedule all currently open :term:`asynchronous generator` objects to close with an :meth:`~agen.aclose()` call. After calling this method, the event loop will issue a warning if a new asynchronous generator is iterated. This should be used to reliably finalize all scheduled asynchronous generators.
es: Programa todos los objetos :term:`asynchronous generator` abiertos actualmente para cerrarlos con una llamada :meth:`~agen.aclose()`. Después de llamar este método, el bucle de eventos emitirá una advertencia si un nuevo generador asíncrono es iterado. Esto debe ser usado para finalizar de manera confiable todos los generadores asíncronos planificados.

source: Note that there is no need to call this function when :func:`asyncio.run` is used.
es: Tenga en cuenta que no hay necesidad de llamar esta función cuando :func:`asyncio.run` es utilizado.

source: Example::
es: Ejemplo::

source: Scheduling callbacks
es: Programación de llamadas de retorno

source: Schedule the *callback* :term:`callback` to be called with *args* arguments at the next iteration of the event loop.
es: Programa el *callback* (retrollamada) :term:`callback` para que se llame con argumentos *args* en la próxima iteración del ciclo de eventos.

source: Callbacks are called in the order in which they are registered. Each callback will be called exactly once.
es: Llamadas que son ejecutadas en el orden en el que fueron registradas. Cada llamada será ejecutada exactamente una sola vez.

source: Raises :exc:`RuntimeError` if called on a loop that's been closed. This can happen on a secondary thread when the main application is shutting down.
es: Lanza :exc:`RuntimeError` si se llama en un bucle que ha sido cerrado. Esto puede suceder en un hilo secundario cuando la aplicación principal se está apagando.

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
es: Vea sección :ref:`concurrencia y multiproceso <asyncio-multithreading>` de la documentación.

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
es: Fue agregado el parámetro solo de palabra clave *context*. Vea :pep:`567` para mas detalles.

source: Most :mod:`asyncio` scheduling functions don't allow passing keyword arguments. To do that, use :func:`functools.partial`::
es: La mayoría de las funciones planificadas de :mod:`asyncio` no permiten pasar argumentos de palabra clave. Para hacer eso utilice :func:`functools.partial`::

source: Using partial objects is usually more convenient than using lambdas, as asyncio can render partial objects better in debug and error messages.
es: El uso de objetos parciales es usualmente mas conveniente que utilizar lambdas, ya que asyncio puede renderizar mejor objetos parciales en mensajes de depuración y error.

source: Scheduling delayed callbacks
es: Planificando llamadas retardadas

source: Event loop provides mechanisms to schedule callback functions to be called at some point in the future. Event loop uses monotonic clocks to track time.
es: El bucle de eventos provee mecanismos para planificar funciones de llamadas que serán ejecutadas en algún punto en el futuro. El bucle de eventos usa relojes monotónicos para seguir el tiempo.

source: Schedule *callback* to be called after the given *delay* number of seconds (can be either an int or a float).
es: Planifica *callback* para ser ejecutada luego de *delay* número de segundos (puede ser tanto un entero como un flotante).

source: An instance of :class:`asyncio.TimerHandle` is returned which can be used to cancel the callback.
es: Una instancia de :class:`asyncio.TimerHandle` es retornada, la que puede ser utilizada para cancelar la ejecución.

source: *callback* will be called exactly once. If two callbacks are scheduled for exactly the same time, the order in which they are called is undefined.
es: *callback* será ejecutada exactamente una sola vez. Si dos llamadas son planificadas para el mismo momento exacto, el orden en el que son ejecutadas es indefinido.

source: The optional positional *args* will be passed to the callback when it is called. If you want the callback to be called with keyword arguments use :func:`functools.partial`.
es: El argumento posicional opcional *args* será pasado a la llamada cuando esta sea ejecutada. Si quieres que la llamada sea ejecutada con argumentos de palabra clave usa :func:`functools.partial`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
es: Un argumento *context* opcional y solo de palabra clave que permite especificar una clase :class:`contextvars.Context` personalizada en la cual *callback* será ejecutada. Cuando no se provee *context* el contexto actual es utilizado.

source: In Python 3.7 and earlier with the default event loop implementation, the *delay* could not exceed one day. This has been fixed in Python 3.8.
es: En Python 3.7 y versiones anteriores con la implementación del bucle de eventos predeterminada, el *delay* no puede exceder un día. Esto fue arreglado en Python 3.8.

source: Schedule *callback* to be called at the given absolute timestamp *when* (an int or a float), using the same time reference as :meth:`loop.time`.
es: Planifica *callback* para ser ejecutada en una marca de tiempo absoluta *when* (un entero o un flotante), usando la misma referencia de tiempo que :meth:`loop.time`.

source: This method's behavior is the same as :meth:`call_later`.
es: El comportamiento de este método es el mismo que :meth:`call_later`.

source: In Python 3.7 and earlier with the default event loop implementation, the difference between *when* and the current time could not exceed one day. This has been fixed in Python 3.8.
es: En Python 3.7 y versiones anteriores con la implementación del bucle de eventos predeterminada, la diferencia entre *when* y el tiempo actual no puede exceder un día. Esto fue arreglado en Python 3.8.

source: Return the current time, as a :class:`float` value, according to the event loop's internal monotonic clock.
es: Retorna el tiempo actual, como un :class:`float`, de acuerdo al reloj monotónico interno del bucle de evento.

source: In Python 3.7 and earlier timeouts (relative *delay* or absolute *when*) should not exceed one day. This has been fixed in Python 3.8.
es: En Python 3.7 y versiones anteriores los tiempos de espera (*delay* relativo o *when* absoluto) no deben exceder un día. Esto fue arreglado en Python 3.8.

source: The :func:`asyncio.sleep` function.
es: La función :func:`asyncio.sleep`.

source: Creating Futures and Tasks
es: Creando futuros y tareas

source: Create an :class:`asyncio.Future` object attached to the event loop.
es: Crea un objeto :class:`asyncio.Future` adjunto al bucle de eventos.

source: This is the preferred way to create Futures in asyncio. This lets third-party event loops provide alternative implementations of the Future object (with better performance or instrumentation).
es: Esta es la manera preferida de crear Futures en asyncio. Esto permite que bucles de eventos de terceros provean implementaciones alternativas del objeto Future (con mejor rendimiento o instrumentación).

source: Schedule the execution of :ref:`coroutine <coroutine>` *coro*. Return a :class:`Task` object.
es: Planifica la ejecución de la :ref:`corrutina <coroutine>` *coro*. Retorna un objeto :class:`Task`.

source: Third-party event loops can use their own subclass of :class:`Task` for interoperability. In this case, the result type is a subclass of :class:`Task`.
es: Bucles de eventos de terceros pueden usar sus propias subclases de :class:`Task` por interoperabilidad. En este caso, el tipo de resultado es una subclase de :class:`Task`.

source: If the *name* argument is provided and not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
es: Si el argumento *name* es provisto y no ``None``, se establece como el nombre de la tarea usando :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
es: Un argumento opcional y solo de palabra clave *context* que permite especificar una clase :class:`contextvars.Context` personalizada en la cual *coro* será ejecutada. Cuando no se provee *context* el contexto actual es utilizado.

source: Added the *name* parameter.
es: Agregado el parámetro *name*.

source: Added the *context* parameter.
es: Agregado el parámetro *context*.

source: Set a task factory that will be used by :meth:`loop.create_task`.
es: Establece una fábrica de tareas que será utilizada por :meth:`loop.create_task`.

source: If *factory* is ``None`` the default task factory will be set. Otherwise, *factory* must be a *callable* with the signature matching ``(loop, coro, context=None)``, where *loop* is a reference to the active event loop, and *coro* is a coroutine object. The callable must return a :class:`asyncio.Future`-compatible object.
es: Si *factory* es ``None`` se establecerá la fábrica de tareas por defecto. En cualquier otro caso, *factory* debe ser un *callable* con la misma firma ``(loop, coro, context=None)``, donde *loop* es una referencia al bucle de eventos activo y *coro* es un objeto de corrutina. El ejecutable debe retornar un objeto :class:`asyncio.Future` compatible.

source: Return a task factory or ``None`` if the default one is in use.
es: Retorna una fábrica de tareas o ``None`` si la predefinida está en uso.

source: Opening network connections
es: Abriendo conexiones de red

source: Open a streaming transport connection to a given address specified by *host* and *port*.
es: Abre una conexión de transmisión de transporte a una dirección especificada por *host* y *port*.

source: *protocol_factory* must be a callable returning an :ref:`asyncio protocol <asyncio-protocol>` implementation.
es: *protocol_factory* debe ser un ejecutable que retorna una implementación del :ref:`asyncio protocol <asyncio-protocol>`.

source: This method will try to establish the connection in the background. When successful, it returns a ``(transport, protocol)`` pair.
es: Este método tratará de establecer la conexión en un segundo plano. Cuando es exitosa, retorna un par ``(transport, protocol)``.

source: The chronological synopsis of the underlying operation is as follows:
es: La sinopsis cronológica de las operaciones subyacentes es como sigue:

source: The connection is established and a :ref:`transport <asyncio-transport>` is created for it.
es: La conexión es establecida y un :ref:`transporte <asyncio-transport>` es creado para ello.

source: *protocol_factory* is called without arguments and is expected to return a :ref:`protocol <asyncio-protocol>` instance.
es: *protocol_factory* es llamado sin argumentos y se espera que retorne una instancia de :ref:`protocol <asyncio-protocol>`.

source: The protocol instance is coupled with the transport by calling its :meth:`~BaseProtocol.connection_made` method.
es: La instancia del protocolo se acopla con el transporte mediante el llamado de su método :meth:`~BaseProtocol.connection_made`.

source: A ``(transport, protocol)`` tuple is returned on success.
es: Una tupla ``(transport, protocol)`` es retornada cuando se tiene éxito.

source: The created transport is an implementation-dependent bidirectional stream.
es: El transporte creado es una transmisión (*stream*) bidireccional que depende de la implementación.

source: Other arguments:
es: Otros argumentos:

source: *ssl*: if given and not false, a SSL/TLS transport is created (by default a plain TCP transport is created). If *ssl* is a :class:`ssl.SSLContext` object, this context is used to create the transport; if *ssl* is :const:`True`, a default context returned from :func:`ssl.create_default_context` is used.
es: *ssl*: si se provee y no es falso, un transporte SSL/TLS es creado (de manera predeterminada se crea un transporte TCP plano). Si *ssl* es un objeto :class:`ssl.SSLContext`, este contexto es utilizado para crear el transporte; si *ssl* es :const:`True`, se utiliza un contexto predeterminado retornado por :func:`ssl.create_default_context`.

source: :ref:`SSL/TLS security considerations <ssl-security>`
es: :ref:`Consideraciones de seguridad SSL/TLS <ssl-security>`

source: *server_hostname* sets or overrides the hostname that the target server's certificate will be matched against. Should only be passed if *ssl* is not ``None``. By default the value of the *host* argument is used. If *host* is empty, there is no default and you must pass a value for *server_hostname*. If *server_hostname* is an empty string, hostname matching is disabled (which is a serious security risk, allowing for potential man-in-the-middle attacks).
es: *server_hostname* establece o reemplaza el nombre de servidor (*hostname*) contra el cual el certificado del servidor de destino será comparado. Sólo debería ser pasado si *ssl* no es ``None``. De manera predeterminada es usado el valor del argumento *host*. Si *host* está vacío, no hay valor predeterminado y debes pasar un valor para *server_hostname*. Si *server_hostname* es una cadena vacía, la comparación de nombres de servidores es deshabilitada (lo que es un riesgo de seguridad serio, permitiendo potenciales ataques de hombre-en-el-medio, *man-in-the-middle attacks*).

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to getaddrinfo() for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
es: *family*, *proto*, *flags* son dirección de familia, protocolo y banderas opcionales que serán pasadas a través de `getaddrinfo()` para la resolución de *host*. Si están dados, todos ellos deberían ser enteros de las constantes del módulo :mod:`socket` correspondiente.

source: *happy_eyeballs_delay*, if given, enables Happy Eyeballs for this connection. It should be a floating-point number representing the amount of time in seconds to wait for a connection attempt to complete, before starting the next attempt in parallel. This is the "Connection Attempt Delay" as defined in :rfc:`8305`. A sensible default value recommended by the RFC is ``0.25`` (250 milliseconds).
es: *happy_eyeballs_delay*, si se proporciona, habilita Happy Eyeballs para esta conexión. Debe ser un número de punto flotante que represente la cantidad de tiempo en segundos para esperar a que se complete un intento de conexión, antes de comenzar el siguiente intento en paralelo. Este es el "Retraso de intento de conexión" como se define en :rfc:`8305`. Un valor predeterminado sensato recomendado por el RFC es ``0.25`` (250 milisegundos).

source: *interleave* controls address reordering when a host name resolves to multiple IP addresses. If ``0`` or unspecified, no reordering is done, and addresses are tried in the order returned by :meth:`getaddrinfo`. If a positive integer is specified, the addresses are interleaved by address family, and the given integer is interpreted as "First Address Family Count" as defined in :rfc:`8305`. The default is ``0`` if *happy_eyeballs_delay* is not specified, and ``1`` if it is.
es: *interleave* controla reordenamientos de dirección cuando un nombre de servidor resuelve a múltiples direcciones IP. Si es ``0`` o no es especificado, no se hace ningún reordenamiento, y las direcciones son intentadas en el orden retornado por :meth:`getaddrinfo`. Si un entero positivo es especificado, las direcciones son intercaladas por dirección de familia, y el entero dado es interpretado como "Número de familias de la primera dirección" (*First Address Family Count*) como es definida en :rfc:`8305`. El valor predefinido es ``0`` si *happy_eyeballs_delay* no es especificado, y ``1`` si lo es.
