Repository: python/python-docs-es
Catalog: library/asyncio-eventloop.po
Languages: es

source: Even though the method was always documented as a coroutine method, before Python 3.7 it returned a :class:`Future`. Since Python 3.7, this is an ``async def`` method.
es: A pesar de que este método siempre fue documentado como un método de corrutina, antes de Python 3.7 retorna un :class:`Future`. Desde Python 3.7, este es un método ``async def``.

source: Send a datagram from *sock* to *address*. Asynchronous version of :meth:`socket.sendto() <socket.socket.sendto>`.
es: Envía un datagrama desde *sock* a *address*. Versión asíncrona de :meth:`socket.sendto() <socket.socket.sendto>`.

source: Return the number of bytes sent.
es: Retorna el número de bytes enviados.

source: Connect *sock* to a remote socket at *address*.
es: Conecta *sock* a un socket remoto en *address*.

source: Asynchronous version of :meth:`socket.connect() <socket.socket.connect>`.
es: Versión asíncrona de :meth:`socket.connect() <socket.socket.connect>`.

source: ``address`` no longer needs to be resolved. ``sock_connect`` will try to check if the *address* is already resolved by calling :func:`socket.inet_pton`. If not, :meth:`loop.getaddrinfo` will be used to resolve the *address*.
es: ``address`` ya no necesita ser resuelto. ``sock_connect`` va a intentar verificar si *address* ya fue resuelto a partir del llamado de :func:`socket.inet_pton`. Si no lo fue, se utilizará :meth:`loop.getaddrinfo` ara resolver *address*.

source: :meth:`loop.create_connection` and :func:`asyncio.open_connection() <open_connection>`.
es: :meth:`loop.create_connection` y :func:`asyncio.open_connection() <open_connection>`.

source: Accept a connection. Modeled after the blocking :meth:`socket.accept() <socket.socket.accept>` method.
es: Acepta una conexión. Modelado después del método bloqueante :meth:`socket.accept() <socket.socket.accept>`.

source: The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
es: El socket debe estar vinculado a una conexión y escuchando conexiones. El valor retornado es un par ``(conn, address)`` donde *conn* es un objeto socket *nuevo* que puede ser usado para enviar y recibir datos en la conexión, y *address* es la dirección enlazada al socket en el otro extremo de la conexión.

source: :meth:`loop.create_server` and :func:`start_server`.
es: :meth:`loop.create_server` y :func:`start_server`.

source: Send a file using high-performance :mod:`os.sendfile` if possible. Return the total number of bytes sent.
es: Envía un archivo usando :mod:`os.sendfile` de alto rendimiento si es posible. Retorna el número total de bytes enviados.

source: Asynchronous version of :meth:`socket.sendfile() <socket.socket.sendfile>`.
es: Versión asíncrona de :meth:`socket.sendfile() <socket.socket.sendfile>`.

source: *sock* must be a non-blocking :const:`socket.SOCK_STREAM` :class:`~socket.socket`.
es: *sock* debe ser un :const:`socket.SOCK_STREAM` :class:`~socket.socket` no bloqueante.

source: *file* must be a regular file object open in binary mode.
es: *file* debe ser un objeto de archivo regular abierto en modo binario.

source: *fallback*, when set to ``True``, makes asyncio manually read and send the file when the platform does not support the sendfile syscall (e.g. Windows or SSL socket on Unix).
es: *fallback*, cuando es establecida como ``True``, hace que asyncio lea y escriba el archivo manualmente cuando el sistema no soporta la llamada de envío de archivos del sistema (por ejemplo, Windows o sockets SSL en Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support *sendfile* syscall and *fallback* is ``False``.
es: Lanza :exc:`SendfileNotAvailableError` si el sistema no soporta la llamada de envío de archivos del sistema *sendfile* y *fallback* es ``False``.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
es: Versión asíncrona de :meth:`socket.getaddrinfo`.

source: Both *getaddrinfo* and *getnameinfo* methods were always documented to return a coroutine, but prior to Python 3.7 they were, in fact, returning :class:`asyncio.Future` objects. Starting with Python 3.7 both methods are coroutines.
es: Ambos métodos *getaddrinfo* y *getnameinfo* siempre fueron documentados para retornar una corrutina, pero antes de Python 3.7 retornaban, de hecho, objetos :class:`Future`. A partir de Python 3.7, ambos métodos son corrutinas.

source: Working with pipes
es: Trabajando con tuberías

source: Register the read end of *pipe* in the event loop.
es: Registra el fin de lectura de *pipe* en el bucle de eventos.

source: *pipe* is a :term:`file-like object <file object>`.
es: *pipe* es un :term:`objeto de tipo archivo <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports the :class:`ReadTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
es: Retorna un par ``(transport, protocol)``, donde *transport* soporta la interface :class:`ReadTransport` y *protocol* es un objeto instanciado por *protocol_factory*.

source: With :class:`SelectorEventLoop` event loop, the *pipe* is set to non-blocking mode.
es: Con el bucle de eventos :class:`SelectorEventLoop`, el *pipe* es establecido en modo no bloqueante.

source: Register the write end of *pipe* in the event loop.
es: Registra el fin de escritura de *pipe* en el bucle de eventos.

source: *pipe* is :term:`file-like object <file object>`.
es: *pipe* es un :term:`objeto de tipo archivo <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports :class:`WriteTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
es: Retorna un par ``(transport, protocol)``, donde *transport* soporta la interface :class:`WriteTransport` y *protocol* es un objeto inicializado por *protocol_factory*.

source: :class:`SelectorEventLoop` does not support the above methods on Windows. Use :class:`ProactorEventLoop` instead for Windows.
es: :class:`SelectorEventLoop` no soporta los métodos anteriores en windows. En su lugar, use :class:`ProactorEventLoop` para Windows.

source: The :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
es: Los métodos :meth:`loop.subprocess_exec` y :meth:`loop.subprocess_shell`.

source: Unix signals
es: Señales Unix

source: Set *callback* as the handler for the *signum* signal.
es: Establece *callback* como el gestor para la señal *signum*.

source: The callback will be invoked by *loop*, along with other queued callbacks and runnable coroutines of that event loop. Unlike signal handlers registered using :func:`signal.signal`, a callback registered with this function is allowed to interact with the event loop.
es: La llamada será invocada por *loop*, junto con otras llamadas encoladas y corrutinas ejecutables de ese bucle de eventos. A menos que los gestores de señal la registren usando :func:`signal.signal`, una llamada registrada con esta función tiene permitido interactuar con el bucle de eventos.

source: Raise :exc:`ValueError` if the signal number is invalid or uncatchable. Raise :exc:`RuntimeError` if there is a problem setting up the handler.
es: Lanza :exc:`ValueError` si el número de señal es invalido o inalcanzable. Lanza :exc:`RuntimeError` si hay algún problema preparando el gestor.

source: Like :func:`signal.signal`, this function must be invoked in the main thread.
es: Como :func:`signal.signal`, esta función debe ser invocada en el hilo principal.

source: Remove the handler for the *sig* signal.
es: Elimina el gestor para la señal *sig*.

source: Return ``True`` if the signal handler was removed, or ``False`` if no handler was set for the given signal.
es: Retorna ``True`` si el gestor de señal fue eliminado, o ``False`` si no se estableció gestor para la señal dada.

source: The :mod:`signal` module.
es: El módulo :mod:`signal`.

source: Executing code in thread or process pools
es: Ejecutando código en un hilos o grupos de procesos

source: Arrange for *func* to be called in the specified executor.
es: Hace arreglos para que *func* sea llamado en el ejecutor especificado.

source: The *executor* argument should be an :class:`concurrent.futures.Executor` instance. The default executor is used if *executor* is ``None``.
es: El argumento *executor* debe ser una instancia de :class:`concurrent.futures.Executor`. El ejecutor predeterminado es usado si *executor* es ``None``.

source: Note that the entry point guard (``if __name__ == '__main__'``) is required for option 3 due to the peculiarities of :mod:`multiprocessing`, which is used by :class:`~concurrent.futures.ProcessPoolExecutor`. See :ref:`Safe importing of main module <multiprocessing-safe-main-import>`.
es: Tenga en cuenta que la protección del punto de entrada (``if __name__ == '__main__'``) es requerida para la opción 3 debido a las peculiaridades de :mod:`multiprocessing`, que es utilizado por :class:`~concurrent.futures.ProcessPoolExecutor`. Vea :ref:`Importación segura del módulo principal <multiprocessing-safe-main-import>`.

source: This method returns a :class:`asyncio.Future` object.
es: Este método retorna un objeto :class:`asyncio.Future`.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *func*.
es: Use :func:`functools.partial` :ref:`para pasar argumentos de palabra clave <asyncio-pass-keywords>` a *func*.

source: :meth:`loop.run_in_executor` no longer configures the ``max_workers`` of the thread pool executor it creates, instead leaving it up to the thread pool executor (:class:`~concurrent.futures.ThreadPoolExecutor`) to set the default.
es: :meth:`loop.run_in_executor` ya no configura el ``max_workers`` del ejecutor del grupo de subprocesos que crea, sino que lo deja en manos del ejecutor del grupo de subprocesos (:class:`~concurrent.futures.ThreadPoolExecutor`) para establecer el valor por defecto.

source: Set *executor* as the default executor used by :meth:`run_in_executor`. *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
es: Establece *executor* como el ejecutor predeterminado utilizado por :meth:`run_in_executor`. *executor* debe ser una instancia de :class:`~concurrent.futures.ThreadPoolExecutor`.

source: *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
es: *executor* debe ser una instancia de :class:`~concurrent.futures.ThreadPoolExecutor`.

source: Error Handling API
es: API para manejo de errores

source: Allows customizing how exceptions are handled in the event loop.
es: Permite personalizar como son manejadas las excepciones en el bucle de eventos.

source: Set *handler* as the new event loop exception handler.
es: Establece *handler* como el nuevo gestor de excepciones del bucle de eventos.

source: If *handler* is ``None``, the default exception handler will be set. Otherwise, *handler* must be a callable with the signature matching ``(loop, context)``, where ``loop`` is a reference to the active event loop, and ``context`` is a ``dict`` object containing the details of the exception (see :meth:`call_exception_handler` documentation for details about context).
es: Si *handler* es ``None``, se establecerá el gestor de excepciones predeterminado. De otro modo, *handler* debe ser un invocable con la misma firma ``(loop, context)``, donde ``loop`` es una referencia al bucle de eventos activo, y ``context`` es un objeto ``dict`` que contiene los detalles de la excepción (vea la documentación de :meth:`call_exception_handler` para detalles acerca del contexto).

source: Return the current exception handler, or ``None`` if no custom exception handler was set.
es: Retorna el gesto de excepciones actual, o ``None`` si no fue establecido ningún gestor de excepciones personalizado.

source: Default exception handler.
es: Gestor de excepciones por defecto.

source: This is called when an exception occurs and no exception handler is set. This can be called by a custom exception handler that wants to defer to the default handler behavior.
es: Esto es llamado cuando ocurre una excepción y no se estableció ningún gestor de excepciones. Esto puede ser llamado por un gestor de excepciones personalizado que quiera cambiar el comportamiento del gestor predeterminado.

source: *context* parameter has the same meaning as in :meth:`call_exception_handler`.
es: El parámetro *context* tiene el mismo significado que en :meth:`call_exception_handler`.

source: Call the current event loop exception handler.
es: Llama al gestor de excepciones del bucle de eventos actual.

source: *context* is a ``dict`` object containing the following keys (new keys may be introduced in future Python versions):
es: *context* es un objeto ``dict`` conteniendo las siguientes claves (en futuras versiones de Python podrían introducirse nuevas claves):

source: 'message': Error message;
es: 'message': Mensaje de error;

source: 'exception' (optional): Exception object;
es: 'exception' (opcional): Objeto de excepción;

source: 'future' (optional): :class:`asyncio.Future` instance;
es: 'future' (opcional): instancia de :class:`asyncio.Future`;

source: 'task' (optional): :class:`asyncio.Task` instance;
es: 'task' (opcional): instancia de :class:`asyncio.Task`;

source: 'handle' (optional): :class:`asyncio.Handle` instance;
es: 'handle' (opcional): instancia de :class:`asyncio.Handle`;

source: 'protocol' (optional): :ref:`Protocol <asyncio-protocol>` instance;
es: 'protocol' (opcional): instancia de :ref:`Protocol <asyncio-protocol>`;

source: 'transport' (optional): :ref:`Transport <asyncio-transport>` instance;
es: 'transport' (opcional): instancia de :ref:`Transport <asyncio-transport>`;

source: 'socket' (optional): :class:`socket.socket` instance;
es: 'socket' (opcional): instancia de :class:`socket.socket`;

source: 'asyncgen' (optional): Asynchronous generator that caused
es: 'asyncgen' (opcional): Generador asíncrono que causó

source: the exception.
es: la excepción.

source: This method should not be overloaded in subclassed event loops. For custom exception handling, use the :meth:`set_exception_handler()` method.
es: Este método no debe ser sobrecargado en bucles de eventos en subclase. Para gestión de excepciones personalizadas, use el método :meth:`set_exception_handler()`.

source: Enabling debug mode
es: Habilitando el modo depuración

source: Get the debug mode (:class:`bool`) of the event loop.
es: Obtiene el modo depuración (:class:`bool`) del bucle de eventos.

source: The default value is ``True`` if the environment variable :envvar:`PYTHONASYNCIODEBUG` is set to a non-empty string, ``False`` otherwise.
es: El valor predeterminado es ``True`` si la variable de entorno :envvar:`PYTHONASYNCIODEBUG` es establecida a una cadena no vacía, de otro modo será ``False``.

source: Set the debug mode of the event loop.
es: Establece el modo de depuración del bucle de eventos.

source: The new :ref:`Python Development Mode <devmode>` can now also be used to enable the debug mode.
es: El nuevo :ref:`Python Modo de Desarrollo <devmode>` ahora también se puede usar para habilitar el modo de depuración.

source: The :ref:`debug mode of asyncio <asyncio-debug-mode>`.
es: El :ref:`modo depuración de asyncio <asyncio-debug-mode>`.

source: Running Subprocesses
es: Ejecutando subprocesos

source: Methods described in this subsections are low-level. In regular async/await code consider using the high-level :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` convenience functions instead.
es: Los métodos descritos en esta subsección son de bajo nivel. En código async/await regular considere usar las convenientes funciones de alto nivel :func:`asyncio.create_subprocess_shell` y :func:`asyncio.create_subprocess_exec`.

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
es: En Windows, el bucle de eventos por defecto :class:`ProactorEventLoop` soporta subprocesos, mientras que :class:`SelectorEventLoop` no. Vea :ref:`Soporte de subprocesos en Windows <asyncio-windows-subprocess>` para más detalles.

source: Create a subprocess from one or more string arguments specified by *args*.
es: Crea un subproceso de uno o mas argumentos de cadena especificados por *args*.

source: *args* must be a list of strings represented by:
es: *args* debe ser una lista de cadenas representadas por:

source: or :class:`bytes`, encoded to the :ref:`filesystem encoding <filesystem-encoding>`.
es: o :class:`bytes`, codificados a la :ref:`codificación del sistema de archivos <filesystem-encoding>`.

source: The first string specifies the program executable, and the remaining strings specify the arguments. Together, string arguments form the ``argv`` of the program.
es: La primer cadena especifica el programa ejecutable, y las cadenas restantes especifican los argumentos. En conjunto, los argumentos de cadena forman el ``argv`` del programa.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=False`` and the list of strings passed as the first argument; however, where :class:`~subprocess.Popen` takes a single argument which is list of strings, *subprocess_exec* takes multiple string arguments.
es: Esto es similar a la clase de la librería estándar :class:`subprocess.Popen` llamada con ``shell=False`` y la lista de cadenas pasadas como el primer argumento; de cualquier forma, cuando :class:`~subprocess.Popen` toma un sólo argumento que es una lista de cadenas, *subprocess_exec* toma múltiples cadenas como argumentos.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`asyncio.SubprocessProtocol` class.
es: El *protocol_factory* debe ser un ejecutable que retorne una subclase de la clase :class:`asyncio.SubprocessProtocol`.

source: Other parameters:
es: Otros parámetros:

source: *stdin* can be any of these:
es: *stdin* puede ser cualquier de estos:

source: the :const:`subprocess.PIPE` constant (default) which will create a new pipe and connect it,
es: la constante :const:`subprocess.PIPE` (predeterminado) que creará una tubería nueva y la conectará,

source: the value ``None`` which will make the subprocess inherit the file descriptor from this process
es: el valor ``None`` que hará que el subproceso herede el descriptor de archivo de este proceso

source: the :const:`subprocess.DEVNULL` constant which indicates that the special :data:`os.devnull` file will be used
es: la constante :const:`subprocess.DEVNULL` que indica que el archivo especial :data:`os.devnull` será utilizado

source: *stdout* can be any of these:
es: *stdout* puede ser cualquier de estos:

source: *stderr* can be any of these:
es: *stderr* puede ser cualquier de estos:

source: the :const:`subprocess.STDOUT` constant which will connect the standard error stream to the process' standard output stream
es: la constante :const:`subprocess.STDOUT` que conectará el flujo de errores predeterminado al flujo de salida predeterminado del proceso

source: All other keyword arguments are passed to :class:`subprocess.Popen` without interpretation, except for *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* and *errors*, which should not be specified at all.
es: El resto de argumentos de palabra clave son pasados a :class:`subprocess.Popen` sin interpretación, excepto por *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* y *errors*, que no deben ser especificados en lo absoluto.

source: The ``asyncio`` subprocess API does not support decoding the streams as text. :func:`bytes.decode` can be used to convert the bytes returned from the stream to text.
es: La API subproceso ``asyncio`` no soporta decodificar los flujos como texto. :func:`bytes.decode` puede ser usado para convertir a texto los bytes retornados por el flujo.

source: See the constructor of the :class:`subprocess.Popen` class for documentation on other arguments.
es: Vea el constructor de la clase :class:`subprocess.Popen` para documentación acerca de otros argumentos.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`asyncio.SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
es: Retorna un par de ``(transport, protocol)``, donde *transport* se ajusta a la clase base :class:`asyncio.SubprocessTransport` y *protocol* es un objeto instanciado por *protocol_factory*.

source: Create a subprocess from *cmd*, which can be a :class:`str` or a :class:`bytes` string encoded to the :ref:`filesystem encoding <filesystem-encoding>`, using the platform's "shell" syntax.
es: Crea un subproceso desde *cmd*, que puede ser una cadena :class:`str` o :class:`bytes` codificado a la :ref:`codificación del sistema de archivos <filesystem-encoding>`, usando la sintaxis "shell" de la plataforma.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=True``.
es: Esto es similar a la clase de la librería estándar :class:`subprocess.Popen` llamada con ``shell=True``.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`SubprocessProtocol` class.
es: El *protocol_factory* debe ser un ejecutable que retorne una subclase de la clase :class:`asyncio.SubprocessProtocol`.

source: See :meth:`~loop.subprocess_exec` for more details about the remaining arguments.
es: Vea :meth:`~loop.subprocess_exec` para mas detalles acerca de los argumentos restantes.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
es: Retorna un par de ``(transport, protocol)``, donde *transport* se ajusta a la clase base :class:`SubprocessTransport` y *protocol* es un objeto instanciado por *protocol_factory*.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special characters in strings that are going to be used to construct shell commands.
es: Es responsabilidad de la aplicación asegurar que todos los espacios en blanco y caracteres especiales estén escapados correctamente para evitar vulnerabilidades de `inyección de código <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. La función :func:`shlex.quote` puede ser usada para escapar apropiadamente espacios en blanco y caracteres especiales en cadenas que van a ser usadas para construir comandos de consola.

source: Callback Handles
es: Gestores de llamadas

source: A callback wrapper object returned by :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
es: Un objeto de contenedor de llamada retornado por :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.

source: Cancel the callback. If the callback has already been canceled or executed, this method has no effect.
es: Cancela la llamada. Si la llamada ya fue cancelada o ejecutada, este método no tiene efecto.

source: Return ``True`` if the callback was cancelled.
es: Retorna ``True`` si la llamada fue cancelada.

source: A callback wrapper object returned by :meth:`loop.call_later`, and :meth:`loop.call_at`.
es: Un objeto de contenedor de llamada retornado por :meth:`loop.call_later`, and :meth:`loop.call_at`.
