Repository: python/python-docs-es
Catalog: library/asyncio-exceptions.po
Languages: es

source: Exceptions
es: Excepciones

source: **Source code:** :source:`Lib/asyncio/exceptions.py`
es: **Código Fuente** :source:`Lib/asyncio/exceptions.py`

source: A deprecated alias of :exc:`TimeoutError`, raised when the operation has exceeded the given deadline.
es: Un alias obsoleto de :exc:`TimeoutError`, lanzado cuando la operación ha superado el plazo establecido.

source: This class was made an alias of :exc:`TimeoutError`.
es: Esta clase es un alias de :exc:`TimeoutError`.

source: The operation has been cancelled.
es: La operación ha sido cancelada.

source: This exception can be caught to perform custom operations when asyncio Tasks are cancelled. In almost all situations the exception must be re-raised.
es: Esta excepción se puede capturar para realizar operaciones personalizadas cuando se cancelan las tareas de asyncio. En casi todas las situaciones, la excepción debe volver a lanzarse.

source: :exc:`CancelledError` is now a subclass of :class:`BaseException` rather than :class:`Exception`.
es: :exc:`CancelledError` es ahora una subclase de :class:`BaseException` en lugar de :class:`Exception`.

source: Invalid internal state of :class:`Task` or :class:`Future`.
es: Estado Interno no válido de :class:`Task` o :class:`Future`.

source: Can be raised in situations like setting a result value for a *Future* object that already has a result value set.
es: Se puede lanzar en situaciones como establecer un valor de resultado para un objeto *Future* que ya tiene un valor de resultado establecido.

source: The "sendfile" syscall is not available for the given socket or file type.
es: La llamada al sistema "sendfile" no esta disponible desde el *socket* o tipo de archivo dado.

source: A subclass of :exc:`RuntimeError`.
es: Una subclase de :exc:`RuntimeError`.

source: The requested read operation did not complete fully.
es: La operación de lectura solicitada no se completó completamente.

source: Raised by the :ref:`asyncio stream APIs<asyncio-streams>`.
es: Lanzado por la :ref:`asyncio stream APIs<asyncio-streams>`.

source: This exception is a subclass of :exc:`EOFError`.
es: La excepción es una subclase de :exc:`EOFError`.

source: The total number (:class:`int`) of expected bytes.
es: El número total (:class:`int`) de bytes esperados.

source: A string of :class:`bytes` read before the end of stream was reached.
es: Un cadena de :class:`bytes` leída antes de que alcance al final del flujo.

source: Reached the buffer size limit while looking for a separator.
es: Alcanzó el límite de tamaño del búfer mientras buscaba un separador.

source: Raised by the :ref:`asyncio stream APIs <asyncio-streams>`.
es: Lanzado por :ref:`asyncio stream APIs <asyncio-streams>`.

source: The total number of to be consumed bytes.
es: El número total de bytes que se consumirán.
