Repository: python/python-docs-es
Catalog: library/asyncio-protocol.po
Languages: es

source: Transports and Protocols
es: Transportes y protocolos

source: Preface
es: Prefacio

source: Transports and Protocols are used by the **low-level** event loop APIs such as :meth:`loop.create_connection`. They use callback-based programming style and enable high-performance implementations of network or IPC protocols (e.g. HTTP).
es: Los transportes y protocolos son utilizados por las APIs de **bajo nivel** de los bucles de eventos, como :meth:`loop.create_connection`. Utilizan un estilo de programación basado en retrollamadas y permiten implementaciones de alto rendimiento de protocolos de red o IPC (p. ej. HTTP).

source: Essentially, transports and protocols should only be used in libraries and frameworks and never in high-level asyncio applications.
es: Esencialmente, los transportes y protocolos solo deben usarse en bibliotecas y frameworks, nunca en aplicaciones asyncio de alto nivel.

source: This documentation page covers both `Transports`_ and `Protocols`_.
es: Esta página de la documentación cubre tanto `Transports`_ como `Protocols`_.

source: Introduction
es: Introducción

source: At the highest level, the transport is concerned with *how* bytes are transmitted, while the protocol determines *which* bytes to transmit (and to some extent when).
es: En el nivel más alto, el transporte se ocupa de *cómo* se transmiten los bytes, mientras que el protocolo determina *qué* bytes transmitir (y hasta cierto punto cuándo).

source: A different way of saying the same thing: a transport is an abstraction for a socket (or similar I/O endpoint) while a protocol is an abstraction for an application, from the transport's point of view.
es: Una forma diferente de decir lo mismo: Un transporte es una abstracción para un socket (o un punto final de E/S similar) mientras que un protocolo es una abstracción para una aplicación, desde el punto de vista del transporte.

source: Yet another view is the transport and protocol interfaces together define an abstract interface for using network I/O and interprocess I/O.
es: Otro punto de vista más es que las interfaces de transporte y protocolo definen juntas una interfaz abstracta para usar E/S de red y E/S entre procesos.

source: There is always a 1:1 relationship between transport and protocol objects: the protocol calls transport methods to send data, while the transport calls protocol methods to pass it data that has been received.
es: Siempre existe una relación 1:1 entre el transporte y los objetos protocolo: el protocolo llama a los métodos del transporte para enviar datos, mientras que el transporte llama a los métodos del protocolo para enviarle los datos que se han recibido.

source: Most of connection oriented event loop methods (such as :meth:`loop.create_connection`) usually accept a *protocol_factory* argument used to create a *Protocol* object for an accepted connection, represented by a *Transport* object. Such methods usually return a tuple of ``(transport, protocol)``.
es: La mayoría de los métodos del bucle de eventos orientados a la conexión (como :meth:`loop.create_connection`) aceptan generalmente un argumento *protocol_factory* que es usado para crear un objeto *Protocol* para una conexión aceptada, representada por un objeto *Transport*. Estos métodos suelen retornar una tupla de la forma ``(transporte, protocolo)``.

source: Contents
es: Contenidos

source: This documentation page contains the following sections:
es: Esta página de la documentación contiene las siguientes secciones:

source: The `Transports`_ section documents asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, and :class:`SubprocessTransport` classes.
es: La sección `Transports`_ documenta las clases asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport` y :class:`SubprocessTransport`.

source: The `Protocols`_ section documents asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, and :class:`SubprocessProtocol` classes.
es: La sección `Protocols`_ documenta las clases asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol` y :class:`SubprocessProtocol`.

source: The `Examples`_ section showcases how to work with transports, protocols, and low-level event loop APIs.
es: La sección `Examples`_ muestra cómo trabajar con transportes, protocolos y las APIs de bajo nivel del bucle de eventos.

source: Transports
es: Transportes

source: **Source code:** :source:`Lib/asyncio/transports.py`
es: **Código fuente:** :source:`Lib/asyncio/transports.py`

source: Transports are classes provided by :mod:`asyncio` in order to abstract various kinds of communication channels.
es: Los transportes son clases proporcionadas por :mod:`asyncio` para abstraer varios tipos de canales de comunicación.

source: Transport objects are always instantiated by an :ref:`asyncio event loop <asyncio-event-loop>`.
es: Los objetos transporte siempre son instanciados por un :ref:`bucle de eventos asyncio <asyncio-event-loop>`.

source: asyncio implements transports for TCP, UDP, SSL, and subprocess pipes. The methods available on a transport depend on the transport's kind.
es: asyncio implementa transportes para TCP, UDP, SSL y pipes de subprocesos. Los métodos disponibles en un transporte dependen del tipo de transporte.

source: The transport classes are :ref:`not thread safe <asyncio-multithreading>`.
es: Las clases transporte :ref:`no son seguras en hilos <asyncio-multithreading>`.

source: Transports Hierarchy
es: Jerarquía de transportes

source: Base class for all transports. Contains methods that all asyncio transports share.
es: Clase base para todos los transportes. Contiene métodos que todos los transportes asyncio comparten.

source: A base transport for write-only connections.
es: Un transporte base para conexiones de solo escritura.

source: Instances of the *WriteTransport* class are returned from the :meth:`loop.connect_write_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
es: Las instancias de la clase *WriteTransport* se retornan desde el método del bucle de eventos :meth:`loop.connect_write_pipe` y también se utilizan en métodos relacionados con subprocesos como :meth:`loop.subprocess_exec`.

source: A base transport for read-only connections.
es: Un transporte base para conexiones de solo lectura.

source: Instances of the *ReadTransport* class are returned from the :meth:`loop.connect_read_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
es: Las instancias de la clase *ReadTransport* se retornan desde el método del bucle de eventos :meth:`loop.connect_read_pipe` y también se utilizan en métodos relacionados con subprocesos como :meth:`loop.subprocess_exec`.

source: Interface representing a bidirectional transport, such as a TCP connection.
es: Interfaz que representa un transporte bidireccional, como una conexión TCP.

source: The user does not instantiate a transport directly; they call a utility function, passing it a protocol factory and other information necessary to create the transport and protocol.
es: El usuario no crea una instancia de transporte directamente; en su lugar se llama a una función de utilidad, pasándole una fábrica de protocolos junto a otra información necesaria para crear el transporte y el protocolo.

source: Instances of the *Transport* class are returned from or used by event loop methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
es: Las instancias de la clase *Transport* son retornadas o utilizadas por métodos del bucle de eventos como :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.

source: A transport for datagram (UDP) connections.
es: Un transporte para conexiones de datagramas (UDP).

source: Instances of the *DatagramTransport* class are returned from the :meth:`loop.create_datagram_endpoint` event loop method.
es: Las instancias de la clase *DatagramTransport* se retornan desde el método :meth:`loop.create_datagram_endpoint` del bucle de eventos.

source: An abstraction to represent a connection between a parent and its child OS process.
es: Una abstracción para representar una conexión entre un proceso padre y su proceso OS hijo.

source: Instances of the *SubprocessTransport* class are returned from event loop methods :meth:`loop.subprocess_shell` and :meth:`loop.subprocess_exec`.
es: Las instancias de la clase *SubprocessTransport* se retornan desde los métodos del bucle de eventos :meth:`loop.subprocess_shell` y :meth:`loop.subprocess_exec`.

source: Base Transport
es: Transporte base

source: Close the transport.
es: Cierra el transporte.

source: If the transport has a buffer for outgoing data, buffered data will be flushed asynchronously. No more data will be received. After all buffered data is flushed, the protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will be called with :const:`None` as its argument.
es: Si el transporte tiene un búfer para datos de salida, los datos almacenados en el búfer se eliminarán de forma asincrónica. No se recibirán más datos. Después de que se vacíen todos los datos almacenados en el búfer, el método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` del protocolo se llamará con :const:`None` como argumento.

source: Return ``True`` if the transport is closing or is closed.
es: Retorna ``True`` si el transporte se está cerrando o está ya cerrado.

source: Return information about the transport or underlying resources it uses.
es: Retorna información sobre el transporte o los recursos subyacentes que utiliza.

source: *name* is a string representing the piece of transport-specific information to get.
es: *name* es una cadena de caracteres que representa la información específica del transporte que se va a obtener.

source: *default* is the value to return if the information is not available, or if the transport does not support querying it with the given third-party event loop implementation or on the current platform.
es: *default* es el valor que se retornará si la información no está disponible o si el transporte no admite la consulta con la implementación del bucle de eventos de terceros dada o en la plataforma actual.

source: For example, the following code attempts to get the underlying socket object of the transport::
es: Por ejemplo, el siguiente código intenta obtener el objeto socket subyacente del transporte:

source: Categories of information that can be queried on some transports:
es: Categorías de información que se pueden consultar sobre algunos transportes:

source: ``'peername'``: the remote address to which the socket is connected, result of :meth:`socket.socket.getpeername` (``None`` on error)
es: ``'peername'``: la dirección remota a la que está conectado el socket, resultado de :meth:`socket.socket.getpeername` (``None`` en caso de error)

source: ``'socket'``: :class:`socket.socket` instance
es: ``'socket'``: instancia de :class:`socket.socket`

source: ``'sockname'``: the socket's own address, result of :meth:`socket.socket.getsockname`
es: ``'sockname'``: la dirección propia del socket, resultado de :meth:`socket.socket.getsockname`

source: SSL socket:
es: socket SSL:

source: ``'compression'``: the compression algorithm being used as a string, or ``None`` if the connection isn't compressed; result of :meth:`ssl.SSLSocket.compression`
es: ``'compression'``: el algoritmo de compresión que se está usando como una cadena de caracteres o ``None`` si la conexión no está comprimida; resultado de :meth:`ssl.SSLSocket.compression`

source: ``'cipher'``: a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used; result of :meth:`ssl.SSLSocket.cipher`
es: ``'cipher'``: una tupla de tres valores que contiene el nombre del cifrado que se está utilizando, la versión del protocolo SSL que define su uso y la cantidad de bits de la clave secreta que se utilizan; resultado de :meth:`ssl.SSLSocket.cipher`

source: ``'peercert'``: peer certificate; result of :meth:`ssl.SSLSocket.getpeercert`
es: ``'peercert'``: certificado de pares; resultado de :meth:`ssl.SSLSocket.getpeercert`

source: ``'sslcontext'``: :class:`ssl.SSLContext` instance
es: ``'sslcontext'``: instancia de :class:`ssl.SSLContext`

source: ``'ssl_object'``: :class:`ssl.SSLObject` or :class:`ssl.SSLSocket` instance
es: ``'ssl_object'``: instancia de :class:`ssl.SSLObject` o :class:`ssl.SSLSocket`

source: ``'pipe'``: pipe object
es: ``'pipe'``: objeto pipe

source: subprocess:
es: subproceso:

source: ``'subprocess'``: :class:`subprocess.Popen` instance
es: ``'subprocess'``: instancia de :class:`subprocess.Popen`

source: Set a new protocol.
es: Establece un nuevo protocolo.

source: Switching protocol should only be done when both protocols are documented to support the switch.
es: El cambio de protocolo solo debe realizarse cuando esté documentado que ambos protocolos admiten el cambio.

source: Return the current protocol.
es: Retorna el protocolo actual.

source: Read-only Transports
es: Transportes de solo lectura

source: Return ``True`` if the transport is receiving new data.
es: Retorna ``True`` si el transporte está recibiendo nuevos datos.

source: Pause the receiving end of the transport. No data will be passed to the protocol's :meth:`protocol.data_received() <Protocol.data_received>` method until :meth:`resume_reading` is called.
es: Pausa el extremo receptor del transporte. No se pasarán datos al método :meth:`protocol.data_received() <Protocol.data_received>` del protocolo hasta que se llame a :meth:`resume_reading`.

source: The method is idempotent, i.e. it can be called when the transport is already paused or closed.
es: El método es idempotente, es decir, se puede llamar cuando el transporte ya está en pausa o cerrado.

source: Resume the receiving end. The protocol's :meth:`protocol.data_received() <Protocol.data_received>` method will be called once again if some data is available for reading.
es: Reanuda el extremo receptor. El método :meth:`protocol.data_received() <Protocol.data_received>` del protocolo se llamará una vez más si hay algunos datos disponibles para su lectura.

source: The method is idempotent, i.e. it can be called when the transport is already reading.
es: El método es idempotente, es decir, se puede llamar cuando el transporte está leyendo.

source: Write-only Transports
es: Transportes de solo escritura

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
es: Cierra el transporte inmediatamente, sin esperar a que finalicen las operaciones pendientes. Se perderán los datos almacenados en el búfer. No se recibirán más datos. El método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` del protocolo será llamado eventualmente con :const:`None` como argumento.

source: Return :const:`True` if the transport supports :meth:`~WriteTransport.write_eof`, :const:`False` if not.
es: Retorna :const:`True` si el transporte admite :meth:`~WriteTransport.write_eof`, en caso contrario :const:`False`.

source: Return the current size of the output buffer used by the transport.
es: Retorna el tamaño actual del búfer de salida utilizado por el transporte.

source: Get the *high* and *low* watermarks for write flow control. Return a tuple ``(low, high)`` where *low* and *high* are positive number of bytes.
es: Obtiene los límites superior e inferior para el control del flujo de escritura. Retorna una tupla ``(low, high)`` donde *low* ('inferior') y *high* ('superior') son un número de bytes positivo.

source: Use :meth:`set_write_buffer_limits` to set the limits.
es: Usa :meth:`set_write_buffer_limits` para establecer los límites.

source: Set the *high* and *low* watermarks for write flow control.
es: Establece los límites *high* ('superior') y *low* ('inferior') para el control del flujo de escritura.

source: These two values (measured in number of bytes) control when the protocol's :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` and :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` methods are called. If specified, the low watermark must be less than or equal to the high watermark. Neither *high* nor *low* can be negative.
es: Estos dos valores (medidos en número de bytes) controlan cuándo se llaman los métodos :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` y :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` del protocolo . Si se especifica, el límite inferior debe ser menor o igual que el límite superior. Ni *high* ni *low* pueden ser negativos.

source: :meth:`~BaseProtocol.pause_writing` is called when the buffer size becomes greater than or equal to the *high* value. If writing has been paused, :meth:`~BaseProtocol.resume_writing` is called when the buffer size becomes less than or equal to the *low* value.
es: :meth:`~BaseProtocol.pause_writing` se llama cuando el tamaño del búfer es mayor o igual que el valor *high* ('superior'). Si se ha pausado la escritura, se llama a :meth:`~BaseProtocol.resume_writing` cuando el tamaño del búfer es menor o igual que el valor *low* ('inferior').

source: The defaults are implementation-specific. If only the high watermark is given, the low watermark defaults to an implementation-specific value less than or equal to the high watermark. Setting *high* to zero forces *low* to zero as well, and causes :meth:`~BaseProtocol.pause_writing` to be called whenever the buffer becomes non-empty. Setting *low* to zero causes :meth:`~BaseProtocol.resume_writing` to be called only once the buffer is empty. Use of zero for either limit is generally sub-optimal as it reduces opportunities for doing I/O and computation concurrently.
es: Los valores por defecto son específicos de la implementación. Si solo se proporciona el límite superior, el inferior toma de forma predeterminada un valor específico, dependiente de la implementación, menor o igual que el límite superior. Establecer *high* ('superior') en cero fuerza *low* ('inferior') a cero también y hace que :meth:`~BaseProtocol.pause_writing` sea llamado siempre que el búfer no esté vacío. Establecer *low* ('inferior') en cero hace que :meth:`~BaseProtocol.resume_writing` sea llamado únicamente cuando el búfer esté vacío. El uso de cero para cualquiera de los límites es generalmente subóptimo, ya que reduce las oportunidades para realizar E/S y cálculos simultáneamente.

source: Use :meth:`~WriteTransport.get_write_buffer_limits` to get the limits.
es: Usa :meth:`~WriteTransport.get_write_buffer_limits` para obtener los límites.

source: Write some *data* bytes to the transport.
es: Escribe los bytes de *data* en el transporte.

source: This method does not block; it buffers the data and arranges for it to be sent out asynchronously.
es: Este método no bloquea; almacena los datos en el búfer y organiza que se envíen de forma asincrónica.

source: Write a list (or any iterable) of data bytes to the transport. This is functionally equivalent to calling :meth:`write` on each element yielded by the iterable, but may be implemented more efficiently.
es: Escribe una lista (o cualquier iterable) de bytes de datos en el transporte. Esto es funcionalmente equivalente a llamar a :meth:`write` en cada elemento generado por el iterable, pero puede ser implementado de manera más eficiente.

source: Close the write end of the transport after flushing all buffered data. Data may still be received.
es: Cierra el extremo de escritura del transporte después de vaciar todos los datos almacenados en el búfer. Aún es posible recibir datos.

source: This method can raise :exc:`NotImplementedError` if the transport (e.g. SSL) doesn't support half-closed connections.
es: Este método puede lanzar una excepción :exc:`NotImplementedError` si el transporte (p. ej. SSL) no soporta conexiones half-closed ('semi-cerradas').

source: Datagram Transports
es: Transportes de datagramas

source: Send the *data* bytes to the remote peer given by *addr* (a transport-dependent target address). If *addr* is :const:`None`, the data is sent to the target address given on transport creation.
es: Envía los bytes *data* al par remoto proporcionado por *addr* (una dirección de destino dependiente del transporte). Si *addr* es :const:`None`, los datos se envían a la dirección de destino proporcionada en la creación del transporte.

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
es: Cierra el transporte inmediatamente, sin esperar a que finalicen las operaciones pendientes. Se perderán los datos almacenados en el búfer. No se recibirán más datos. El método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` del protocolo será llamado eventualmente con :const:`None` como argumento.

source: Subprocess Transports
es: Transportes de subprocesos

source: Return the subprocess process id as an integer.
es: Retorna la id del subproceso como un número entero.

source: Return the transport for the communication pipe corresponding to the integer file descriptor *fd*:
es: Retorna el transporte para la pipe de comunicación correspondiente al descriptor de archivo entero *fd*:

source: ``0``: readable streaming transport of the standard input (*stdin*), or :const:`None` if the subprocess was not created with ``stdin=PIPE``
es: ``0``: transporte de *streaming* para lectura de la entrada estándar (*stdin*) o :const:`None` si el subproceso no se creó con ``stdin = PIPE``

source: ``1``: writable streaming transport of the standard output (*stdout*), or :const:`None` if the subprocess was not created with ``stdout=PIPE``
es: ``1``: transporte de *streaming* para escritura de la salida estándar (*stdout*) o :const:`None` si el subproceso no se creó con ``stdout = PIPE``

source: ``2``: writable streaming transport of the standard error (*stderr*), or :const:`None` if the subprocess was not created with ``stderr=PIPE``
es: `2``: transporte de *streaming* para escritura del error estándar (*stderr*) o :const:`None` si el subproceso no se creó con ``stderr = PIPE``

source: other *fd*: :const:`None`
es: otro *fd*: :const:`None`

source: Return the subprocess return code as an integer or :const:`None` if it hasn't returned, which is similar to the :attr:`subprocess.Popen.returncode` attribute.
es: Retorna el código de retorno del subproceso como un entero o :const:`None` si no ha retornado aún, lo que es similar al atributo :attr:`subprocess.Popen.returncode`.

source: Kill the subprocess.
es: Mata al subproceso.

source: On POSIX systems, the function sends SIGKILL to the subprocess. On Windows, this method is an alias for :meth:`terminate`.
es: En los sistemas POSIX, la función envía SIGKILL al subproceso. En Windows, este método es un alias para :meth:`terminate`.

source: See also :meth:`subprocess.Popen.kill`.
es: Ver también :meth:`subprocess.Popen.kill`.
