Repository: python/python-docs-es
Catalog: library/asyncio-eventloop.po
Languages: es

source: *sock*, if given, should be an existing, already connected :class:`socket.socket` object to be used by the transport. If *sock* is given, none of *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* and *local_addr* should be specified.
es: *sock*, si está dado, debe ser un objeto :class:`socket.socket` existente y ya conectado, que será utilizado por el transporte. Si *sock* es dado, ningún *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* o *local_addr* deben ser especificados.

source: The *sock* argument transfers ownership of the socket to the transport created. To close the socket, call the transport's :meth:`~asyncio.BaseTransport.close` method.
es: El argumento *sock* transfiere la propiedad del socket al transporte creado. Para cerrar el socket, llame al método :meth:`~asyncio.BaseTransport.close` del transporte.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using ``getaddrinfo()``, similarly to *host* and *port*.
es: *local_addr*, si está dado, es una tupla ``(local_host, local_port)`` usada para enlazar el socket localmente. Los *local_host* y *local_port* son buscados usando ``getaddrinfo()``, de manera similar que con *host* y *port*.

source: *ssl_handshake_timeout* is (for a TLS connection) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es: *ssl_handshake_timeout* es (para una conexión TLS) el tiempo en segundos a esperar que se complete el *handshake* TLS antes de abortar la conexión. ``60.0`` segundos si es ``None`` (predefinido).

source: *ssl_shutdown_timeout* is the time in seconds to wait for the SSL shutdown to complete before aborting the connection. ``30.0`` seconds if ``None`` (default).
es: *ssl_shutdown_timeout* es el tiempo en segundos a esperar a que se complete el apagado SSL antes de abortar la conexión. ``30.0`` segundos si es ``None`` (predefinido).

source: Added support for SSL/TLS in :class:`ProactorEventLoop`.
es: Agregado el soporte para SSL/TLS en :class:`ProactorEventLoop`.

source: Added the *ssl_handshake_timeout* parameter.
es: Agregado el parámetro *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
es: Agregados los parámetros *happy_eyeballs_delay* y *interleave*.

source: Added the *ssl_shutdown_timeout* parameter.
es: Agregado el parámetro *ssl_shutdown_timeout*.

source: The :func:`open_connection` function is a high-level alternative API. It returns a pair of (:class:`StreamReader`, :class:`StreamWriter`) that can be used directly in async/await code.
es: La función :func:`open_connection` es una API alternativa de alto nivel. Retorna un par de (:class:`StreamReader`, :class:`StreamWriter`) que puede ser usado directamente en código async/await.

source: Create a datagram connection.
es: Crea un datagrama de conexión.

source: *protocol_factory* must be a callable returning a :ref:`protocol <asyncio-protocol>` implementation.
es: *protocol_factory* debe ser un ejecutable que retorne una implementación de :ref:`protocol <asyncio-protocol>`.

source: A tuple of ``(transport, protocol)`` is returned on success.
es: Una tupla de ``(transport, protocol)`` es retornada cuando se tiene éxito.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using :meth:`getaddrinfo`.
es: *local_addr*, si está dado, es una tupla ``(local_host, local_port)`` usada para enlazar el socket localmente. Los *local_host* y *local_port* son buscados utilizando :meth:`getaddrinfo`.

source: *remote_addr*, if given, is a ``(remote_host, remote_port)`` tuple used to connect the socket to a remote address. The *remote_host* and *remote_port* are looked up using :meth:`getaddrinfo`.
es: *remote_addr*, si está dado, es una tupla ``(remote_host, remote_port)`` utilizada para conectar el socket a una dirección remota. Los *remote_host* y *remote_port* son buscados utilizando :meth:`getaddrinfo`.

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to :meth:`getaddrinfo` for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
es: *family*, *proto*, *flags* son direcciones de familia, protocolo y banderas opcionales que serán pasadas a través de :meth:`getaddrinfo` para la resolución de *host*. Si está dado, estos deben ser todos enteros de las constantes del módulo :mod:`socket` correspondiente.

source: *allow_broadcast* tells the kernel to allow this endpoint to send messages to the broadcast address.
es: *allow_broadcast* dice al kernel que habilite este punto de conexión para enviar mensajes a la dirección de transmisión (*broadcast*).

source: *sock* can optionally be specified in order to use a preexisting, already connected, :class:`socket.socket` object to be used by the transport. If specified, *local_addr* and *remote_addr* should be omitted (must be :const:`None`).
es: *sock* puede opcionalmente ser especificado para usar un objeto :class:`socket.socket` preexistente y ya conectado que será utilizado por el transporte. Si están especificados, *local_addr* y *remote_addr* deben ser omitidos (tienen que ser :const:`None`).

source: See :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` and :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` examples.
es: Refiérase a los ejemplos :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` y :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>`.

source: The *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast*, and *sock* parameters were added.
es: Los parámetros *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast* y *sock* fueron agregados.

source: When multiple processes with differing UIDs assign sockets to an identical UDP socket address with ``SO_REUSEADDR``, incoming packets can become randomly distributed among the sockets.
es: Cuando múltiples procesos con UIDs diferentes asignan sockets a una misma dirección socket UDP con ``SO_REUSEADDR``, los paquetes entrantes pueden distribuirse aleatoriamente entre los sockets.

source: Added support for Windows.
es: Se agregó soporte para Windows.

source: The *reuse_address* parameter, disabled since Python 3.9.0, 3.8.1, 3.7.6 and 3.6.10, has been entirely removed.
es: El parámetro *reuse_address*, deshabilitado desde Python 3.9.0, 3.8.1, 3.7.6 y 3.6.10, fue removido por completo.

source: Create a Unix connection.
es: Crear una conexión Unix.

source: *path* is the name of a Unix domain socket and is required, unless a *sock* parameter is specified. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
es: *path* es el nombre de un dominio de un socket Unix y es requerido, a menos que un parámetro *sock* sea especificado. Los socket Unix abstractos, :class:`str`, :class:`bytes`, y :class:`~pathlib.Path` son soportados.

source: See the documentation of the :meth:`loop.create_connection` method for information about arguments to this method.
es: Vea la documentación del método :meth:`loop.create_connection` para información acerca de los argumentos de este método.

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`.
es: Agregado el parámetro *ssl_handshake_timeout*. El parámetro *path* ahora puede ser un :term:`path-like object`.

source: Creating network servers
es: Creando servidores de red

source: Returns a :class:`Server` object.
es: Retorna un objeto :class:`Server`.

source: Arguments:
es: Argumentos:

source: The *host* parameter can be set to several types which determine where the server would be listening:
es: El parámetro *host* puede ser establecido a distintos tipos que determinan donde el servidor estaría escuchando:

source: If *host* is a string, the TCP server is bound to a single network interface specified by *host*.
es: Si *host* es una cadena, el servidor TCP está enlazado a una sola interfaz de red especificada por *host*.

source: If *host* is a sequence of strings, the TCP server is bound to all network interfaces specified by the sequence.
es: Si *host* es una secuencia de cadenas, el servidor TCP está enlazado a todas las interfaces de red especificadas por la secuencia.

source: If *host* is an empty string or ``None``, all interfaces are assumed and a list of multiple sockets will be returned (most likely one for IPv4 and another one for IPv6).
es: Si *host* es una cadena vacía o ``None``, se asumen todas las interfaces y una lista con múltiples sockets será retornada (mas probablemente uno para IPv4 y otro para IPv6).

source: The *port* parameter can be set to specify which port the server should listen on. If ``0`` or ``None`` (the default), a random unused port will be selected (note that if *host* resolves to multiple network interfaces, a different random port will be selected for each interface).
es: El parámetro *port* puede establecerse para especificar en qué puerto debe escuchar el servidor. Si es ``0`` o ``None`` (por defecto), se seleccionará un puerto aleatorio no utilizado (tenga en cuenta que si *host* resuelve a múltiples interfaces de red, se seleccionará un puerto aleatorio diferente para cada interfaz).

source: *flags* is a bitmask for :meth:`getaddrinfo`.
es: *flags* es una máscara de bits para :meth:`getaddrinfo`.

source: *sock* can optionally be specified in order to use a preexisting socket object. If specified, *host* and *port* must not be specified.
es: *sock* puede ser especificado opcionalmente para usar objetos socket preexistentes. Si se utiliza, entonces *host* y *port* no deben ser especificados.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
es: El argumento *sock* transfiere la propiedad del socket al servidor creado. Para cerrar el socket, llame al método :meth:`~asyncio.Server.close` del servidor.

source: *backlog* is the maximum number of queued connections passed to :meth:`~socket.socket.listen` (defaults to 100).
es: *backlog* es el número máximo de conexiones encoladas pasadas a :meth:`~socket.socket.listen` (el valor predeterminado es 100).

source: *ssl* can be set to an :class:`~ssl.SSLContext` instance to enable TLS over the accepted connections.
es: *ssl* puede ser establecido como una instancia de :class:`~ssl.SSLContext` para habilitar TLS sobre las conexiones aceptadas.

source: *reuse_address* tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire. If not specified will automatically be set to ``True`` on Unix.
es: *reuse_address* indica al kernel que reutilice un socket local en estado ``TIME_WAIT``, sin esperar que su plazo de ejecución expire. Si no es especificado será establecido automáticamente como ``True`` en Unix.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows.
es: *reuse_port* dice al kernel que habilite este punto de conexión para ser unido al mismo puerto de la misma forma que otros puntos de conexión existentes también están unidos, siempre y cuando todos ellos establezcan esta bandera al ser creados.

source: *ssl_handshake_timeout* is (for a TLS server) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es: *ssl_handshake_timeout* es (para un servidor TLS) el tiempo en segundos a esperar por el apretón de manos (*handshake*) TLS a ser completado antes de abortar la conexión. ``60.0`` si es ``None`` (su valor predeterminado).

source: *start_serving* set to ``True`` (the default) causes the created server to start accepting connections immediately. When set to ``False``, the user should await on :meth:`Server.start_serving` or :meth:`Server.serve_forever` to make the server to start accepting connections.
es: *start_serving* establecido como ``True`` (de manera predeterminada) produce que los servidores creados comiencen a aceptar conexiones inmediatamente. Si es establecido como ``False``, el usuario debe esperar por :meth:`Server.start_serving` o :meth:`Server.serve_forever` para que el servidor comience a aceptar conexiones.

source: The *host* parameter can be a sequence of strings.
es: El parámetro *host* puede ser una secuencia de cadenas.

source: The :func:`start_server` function is a higher-level alternative API that returns a pair of :class:`StreamReader` and :class:`StreamWriter` that can be used in an async/await code.
es: La función :func:`start_server` es una API alternativa de alto nivel que retorna un par de :class:`StreamReader` y :class:`StreamWriter` que pueden ser usados en código async/await.

source: *path* is the name of a Unix domain socket, and is required, unless a *sock* argument is provided. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
es: *path* es el nombre de un dominio de socket Unix, y es requerido a menos que el argumento *sock* sea provisto. Son soportados sockets unix abstractos, :class:`str`, :class:`bytes`, y rutas :class:`~pathlib.Path`.

source: See the documentation of the :meth:`loop.create_server` method for information about arguments to this method.
es: Vea la documentación de el método :meth:`loop.create_server` para mas información acerca de los argumentos de este método.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :class:`~pathlib.Path` object.
es: Agregados los parámetros *ssl_handshake_timeout* y *start_serving*. El parámetro *path* ahora puede ser un objeto :class:`~pathlib.Path`.

source: Wrap an already accepted connection into a transport/protocol pair.
es: Envuelve una conexión ya aceptada en un par de transporte/protocolo.

source: This method can be used by servers that accept connections outside of asyncio but that use asyncio to handle them.
es: Este método puede ser usado por servidores que acepten conexiones por fuera de asyncio, pero que usen asyncio para manejarlas.

source: Parameters:
es: Parámetros:

source: *sock* is a preexisting socket object returned from :meth:`socket.accept <socket.socket.accept>`.
es: *sock* es un objeto socket preexistente retornado por :meth:`socket.accept <socket.socket.accept>`.

source: *ssl* can be set to an :class:`~ssl.SSLContext` to enable SSL over the accepted connections.
es: *ssl* puede ser establecido como un :class:`~ssl.SSLContext` para habilitar SSL sobre las conexiones aceptadas.

source: *ssl_handshake_timeout* is (for an SSL connection) the time in seconds to wait for the SSL handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es: *ssl_handshake_timeout* es (para una conexión SSL) el tiempo en segundos que se esperará para que se complete el apretón de manos (*handshake*) SSL antes de abortar la conexión. ``60.0`` si es ``None`` (su valor predeterminado).

source: Returns a ``(transport, protocol)`` pair.
es: Retorna un par ``(transport, protocol)``.

source: Transferring files
es: Transfiriendo archivos

source: Send a *file* over a *transport*. Return the total number of bytes sent.
es: Envía un *file* a través de un *transport*. Retorna el numero total de bytes enviados.

source: The method uses high-performance :meth:`os.sendfile` if available.
es: El método usa :meth:`os.sendfile` de alto rendimiento si está disponible.

source: *file* must be a regular file object opened in binary mode.
es: *file* debe ser un objeto de archivo regular abierto en modo binario.

source: *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is always updated, even when this method raises an error, and :meth:`file.tell() <io.IOBase.tell>` can be used to obtain the actual number of bytes sent.
es: *offset* indica desde donde se empezará a leer el archivo. Si es especificado, *count* es el número total de bytes a transmitir en contraposición con enviar el archivo hasta que se alcance EOF. La posición del archivo es actualizada siempre, incluso cuando este método genere un error, y :meth:`file.tell() <io.IOBase.tell>` puede ser usado para obtener el número de bytes enviados hasta el momento.

source: *fallback* set to ``True`` makes asyncio to manually read and send the file when the platform does not support the sendfile system call (e.g. Windows or SSL socket on Unix).
es: *fallback* establecido como ``True`` hace que asyncio lea y envíe el archivo manualmente cuando la plataforma no soporta la llamada de envío de archivos del sistema (por ejemplo, Windows o sockets SSL en Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support the *sendfile* syscall and *fallback* is ``False``.
es: Lanza :exc:`SendfileNotAvailableError` si el sistema no soporta la llamada de envío de archivos del sistema y *fallback* es ``True``.

source: TLS Upgrade
es: Actualización de TLS

source: Upgrade an existing transport-based connection to TLS.
es: Actualiza una conexión basada en transporte ya existente a TLS.

source: *transport* and *protocol* instances that methods like :meth:`~loop.create_server` and :meth:`~loop.create_connection` return.
es: Las instancias *transport* y *protocol* que retornan los métodos como :meth:`~loop.create_server` y :meth:`~loop.create_connection`.

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
es: *sslcontext*: una instancia configurada de :class:`~ssl.SSLContext`.

source: *server_side* pass ``True`` when a server-side connection is being upgraded (like the one created by :meth:`~loop.create_server`).
es: *server_side* pasa `True` cuando se actualiza una conexión del lado del servidor (como en el caso de una creada por :meth:`~loop.create_server`).

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
es: *server_hostname*: establece o reemplaza el nombre del host contra el cual se compara el certificado del servidor de destino.

source: Watching file descriptors
es: Viendo descriptores de archivos

source: Start monitoring the *fd* file descriptor for read availability and invoke *callback* with the specified arguments once *fd* is available for reading.
es: Empieza a monitorear el descriptor de archivos *fd* para disponibilidad de lectura e invoca *callback* con los argumentos especificados una vez que *fd* está habilitado para ser leído.

source: Start monitoring the *fd* file descriptor for write availability and invoke *callback* with the specified arguments once *fd* is available for writing.
es: Empieza a monitorear el descriptor de archivos *fd* para disponibilidad de escritura e invoca *callback* con los argumentos especificados una vez que *fd* está habilitado para ser escrito.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *callback*.
es: Use :func:`functools.partial` :ref:`para pasar argumentos de palabra clave <asyncio-pass-keywords>` a *callback*.

source: See also :ref:`Platform Support <asyncio-platform-support>` section for some limitations of these methods.
es: Vea también la sección :ref:`Soporte de plataforma <asyncio-platform-support>` para algunas limitaciones de estos métodos.

source: Working with socket objects directly
es: Trabajar con objetos sockets directamente

source: In general, protocol implementations that use transport-based APIs such as :meth:`loop.create_connection` and :meth:`loop.create_server` are faster than implementations that work with sockets directly. However, there are some use cases when performance is not critical, and working with :class:`~socket.socket` objects directly is more convenient.
es: En general, implementaciones de protocolo que usen APIs basadas en transporte como :meth:`loop.create_connection` y :meth:`loop.create_server` son mas rápidas que aquellas implementaciones que trabajan con directamente con sockets. De cualquier forma, hay algunos casos de uso en los cuales el rendimiento no es crítico, y trabajar directamente con objetos :class:`~socket.socket` es mas conveniente.

source: Receive up to *nbytes* from *sock*. Asynchronous version of :meth:`socket.recv() <socket.socket.recv>`.
es: Recibe hasta *nbytes* de *sock*. Versión asíncrona de :meth:`socket.recv() <socket.socket.recv>`.

source: Return the received data as a bytes object.
es: Retorna los datos recibidos como un objeto bytes.

source: *sock* must be a non-blocking socket.
es: *sock* debe ser un socket no bloqueante.

source: Even though this method was always documented as a coroutine method, releases before Python 3.7 returned a :class:`Future`. Since Python 3.7 this is an ``async def`` method.
es: A pesar de que este método siempre fue documentado como un método de corrutina, los lanzamientos previos a Python 3.7 retornaban un :class:`Future`. Desde Python 3.7 este es un método ``async def``.

source: Receive data from *sock* into the *buf* buffer. Modeled after the blocking :meth:`socket.recv_into() <socket.socket.recv_into>` method.
es: Recibe datos desde *sock* en el búfer *buf*. Modelado después del método bloqueante :meth:`socket.recv_into() <socket.socket.recv_into>`.

source: Return the number of bytes written to the buffer.
es: Retorna el número de bytes escritos en el búfer.

source: Receive a datagram of up to *bufsize* from *sock*. Asynchronous version of :meth:`socket.recvfrom() <socket.socket.recvfrom>`.
es: Recibe un datagrama de hasta *bufsize* de *sock*. Versión asíncrona de :meth:`socket.recvfrom() <socket.socket.recvfrom>`.

source: Return a tuple of (received data, remote address).
es: Retorna una tupla de (datos recibidos, dirección remota).

source: Receive a datagram of up to *nbytes* from *sock* into *buf*. Asynchronous version of :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.
es: Recibe un datagrama de hasta *nbytes* de *sock* en *buf*. Versión asíncrona de :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.

source: Return a tuple of (number of bytes received, remote address).
es: Retorna una dupla de (número de bytes recibidos, dirección remota).

source: Send *data* to the *sock* socket. Asynchronous version of :meth:`socket.sendall() <socket.socket.sendall>`.
es: Envía *data* al socket *sock*. Versión asíncrona de :meth:`socket.sendall() <socket.socket.sendall>`.

source: This method continues to send to the socket until either all data in *data* has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised. Additionally, there is no way to determine how much data, if any, was successfully processed by the receiving end of the connection.
es: Este método continua enviando al socket hasta que se hayan enviado todos los datos en *data* u ocurra un error. ``None`` es retornado cuando se tiene éxito. Cuando ocurre un error, se lanza una excepción. Adicionalmente, no hay manera de determinar cuantos datos, si es que se hubo alguno, se procesaron correctamente por el extremo receptor de la conexión.
