Repository: python/python-docs-es
Catalog: library/bdb.po
Languages: es

source: :mod:`bdb` --- Debugger framework
es: :mod:`bdb` --- Framework de depuración

source: The :mod:`bdb` module handles basic debugger functions, like setting breakpoints or managing execution via the debugger.
es: El módulo :mod:`bdb` maneja las funciones básicas del depurador, como establecer puntos de interrupción o gestionar la ejecución a través del mismo.

source: The following exception is defined:
es: La siguiente excepción es definida:

source: Exception raised by the :class:`Bdb` class for quitting the debugger.
es: Excepción lanzada por la clase :class:`Bdb` al salir del depurador.

source: The :mod:`bdb` module also defines two classes:
es: El módulo :mod:`bdb` también define dos clases:

source: This class implements temporary breakpoints, ignore counts, disabling and (re-)enabling, and conditionals.
es: Esta clase implementa puntos de interrupción temporales, permitiendo ignorar recuentos, desactivar y (re-)activar puntos de interrupción y definir condiciones de interrupción para los mismos.

source: Breakpoints are indexed by number through a list called :attr:`bpbynumber` and by ``(file, line)`` pairs through :attr:`bplist`. The former points to a single instance of class :class:`Breakpoint`. The latter points to a list of such instances since there may be more than one breakpoint per line.
es: Los puntos de interrupción se indexan numéricamente mediante una lista llamada :attr:`bpbynumber` y por pares ``(archivo, linea)`` mediante :attr:`bplist`. En el primer caso se apunta a una única instancia de :class:`Breakpoint`. En el segundo caso se apunta a una lista de tales instancias, ya que puede haber más de un punto de interrupción por línea.

source: When creating a breakpoint, its associated :attr:`file name <file>` should be in canonical form. If a :attr:`funcname` is defined, a breakpoint :attr:`hit <hits>` will be counted when the first line of that function is executed. A :attr:`conditional <cond>` breakpoint always counts a :attr:`hit <hits>`.
es: Al crear un punto de interrupción, el :attr:`nombre del archivo <file>` asociado debe estar en su forma canónica. Si se define un :attr:`funcname`, se contará un :attr:`hit <hits>` de punto de interrupción cuando se ejecute la primera línea de esa función. Un punto de interrupción :attr:`condicional <cond>` siempre cuenta un :attr:`hit <hits>`.

source: :class:`Breakpoint` instances have the following methods:
es: Las instancias de la clase :class:`Breakpoint` tienen los siguientes métodos:

source: Delete the breakpoint from the list associated to a file/line. If it is the last breakpoint in that position, it also deletes the entry for the file/line.
es: Elimina el punto de interrupción de la lista asociada a un archivo/línea. Si es el último punto de interrupción en esa posición, también borra la entrada correspondiente del archivo/línea correspondiente.

source: Mark the breakpoint as enabled.
es: Marca el punto de interrupción como habilitado.

source: Mark the breakpoint as disabled.
es: Marca el punto de interrupción como deshabilitado.

source: Return a string with all the information about the breakpoint, nicely formatted:
es: Retorna una cadena de caracteres que contiene toda la información sobre el punto de interrupción, apropiadamente formateada:

source: Breakpoint number.
es: El número del punto de interrupción.

source: Temporary status (del or keep).
es: Estado temporal (del o keep)

source: File/line position.
es: Posición del archivo/línea.

source: Break condition.
es: Condición de interrupción.

source: Number of times to ignore.
es: Número de veces para ignorar.

source: Number of times hit.
es: Número de veces alcanzado.

source: Print the output of :meth:`bpformat` to the file *out*, or if it is ``None``, to standard output.
es: Imprime la salida de :meth:`bpformat` en el archivo *out*, o en la salida estándar si es ``None``.

source: :class:`Breakpoint` instances have the following attributes:
es: Las instancias de la clase :class:`Breakpoint` tienen los siguientes atributos:

source: File name of the :class:`Breakpoint`.
es: Nombre del archivo de la clase :class:`Breakpoint`.

source: Line number of the :class:`Breakpoint` within :attr:`file`.
es: Número de línea de la clase :class:`Breakpoint` dentro de :attr:`file`.

source: True if a :class:`Breakpoint` at (file, line) is temporary.
es: Verdadero si una clase :class:`Breakpoint` en (file, line) es temporal.

source: Condition for evaluating a :class:`Breakpoint` at (file, line).
es: Condición para evaluar una clase :class:`Breakpoint` en (file, line).

source: Function name that defines whether a :class:`Breakpoint` is hit upon entering the function.
es: Nombre de la función que define si se alcanza un :class:`Breakpoint` al ingresar a la función.

source: True if :class:`Breakpoint` is enabled.
es: Verdadero si la clase :class:`Breakpoint` está habilitada.

source: Numeric index for a single instance of a :class:`Breakpoint`.
es: Índice numérico para una sola instancia de un :class:`Breakpoint`.

source: Dictionary of :class:`Breakpoint` instances indexed by (:attr:`file`, :attr:`line`) tuples.
es: Diccionario de instancias :class:`Breakpoint` indexadas por tuplas (:attr:`file`, :attr:`line`).

source: Number of times to ignore a :class:`Breakpoint`.
es: Número de veces para ignorar un :class:`Breakpoint`.

source: Count of the number of times a :class:`Breakpoint` has been hit.
es: Recuento del número de veces que se alcanzó un :class:`Breakpoint`.

source: The :class:`Bdb` class acts as a generic Python debugger base class.
es: La clase :class:`Bdb` actúa como clase base del depurador genérico de Python.

source: This class takes care of the details of the trace facility; a derived class should implement user interaction. The standard debugger class (:class:`pdb.Pdb`) is an example.
es: Esta clase se encarga de los detalles de la funcionalidad de seguimiento; una clase derivada debería encargarse de implementar la interacción con el usuario. Un ejemplo es la clase de depuración estándar (:class:`pdb.Pdb`).

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
es: El argumento *skip*, si se proporciona, debe ser un iterable con patrones de nombre de archivo, al estilo del módulo glob. El depurador no entrará en aquellos marcos de ejecución que se originen en un módulo que coincida con uno de estos patrones. Para determinar si un marco de ejecución se origina en un módulo determinado, se hace uso de ``__name__`` en las variables globales del marco de ejecución dado.

source: The *skip* argument.
es: El argumento *skip*.

source: The following methods of :class:`Bdb` normally don't need to be overridden.
es: Los siguientes métodos de la clase :class:`Bdb` normalmente no necesitan ser redefinidos.

source: Return canonical form of *filename*.
es: Retorna la forma canónica de *filename*.

source: For real file names, the canonical form is an operating-system-dependent, :func:`case-normalized <os.path.normcase>` :func:`absolute path <os.path.abspath>`. A *filename* with angle brackets, such as ``"<stdin>"`` generated in interactive mode, is returned unchanged.
es: Para nombres de archivos reales, la forma canónica es una :func:`ruta absoluta <os.path.abspath>` :func:`normalizada entre mayúsculas y minúsculas <os.path.normcase>` que depende del sistema operativo. Un *filename* con corchetes angulares, como ``"<stdin>"`` generado en modo interactivo, se retorna sin cambios.

source: Set the :attr:`botframe`, :attr:`stopframe`, :attr:`returnframe` and :attr:`quitting` attributes with values ready to start debugging.
es: Establece los atributos :attr:`botframe`, :attr:`stopframe`, :attr:`returnframe` y :attr:`quitting` con valores preparados para comenzar la depuración.

source: This function is installed as the trace function of debugged frames. Its return value is the new trace function (in most cases, that is, itself).
es: Esta función se instala como función de seguimiento de los marcos de ejecución depurados. Su valor de retorno es la nueva función de seguimiento a usar (en la mayoría de los casos, ella misma).

source: The default implementation decides how to dispatch a frame, depending on the type of event (passed as a string) that is about to be executed. *event* can be one of the following:
es: La implementación predeterminada decide cómo despachar un marco de ejecución, dependiendo del tipo de evento (pasado como una cadena) que está a punto de ejecutarse. *event* puede tomar uno de los siguientes valores:

source: ``"line"``: A new line of code is going to be executed.
es: ``"line"``: Se va a ejecutar una nueva línea de código.

source: ``"call"``: A function is about to be called, or another code block entered.
es: ``"call"``: Está a punto de llamarse a una función o se ha entrado en otro bloque de código.

source: ``"return"``: A function or other code block is about to return.
es: ``"return"``: Una función u otro bloque de código está a punto de retornar.

source: ``"exception"``: An exception has occurred.
es: ``"exception"``: Ha ocurrido una excepción.

source: ``"c_call"``: A C function is about to be called.
es: ``"c_call"``: Una función de C está a punto de llamarse .

source: ``"c_return"``: A C function has returned.
es: ``"c_return"``: Una función de C ha retornado.

source: ``"c_exception"``: A C function has raised an exception.
es: ``"c_exception"``: Una función de C ha lanzado una excepción.

source: For the Python events, specialized functions (see below) are called. For the C events, no action is taken.
es: Para los eventos de Python, son llamadas funciones especializadas (ver más abajo). En cambio, para los eventos de C no se realiza ninguna acción.

source: The *arg* parameter depends on the previous event.
es: El parámetro *arg* depende del evento previo.

source: See the documentation for :func:`sys.settrace` for more information on the trace function. For more information on code and frame objects, refer to :ref:`types`.
es: Consulta la documentación de :func:`sys.settrace` para obtener más información sobre la función de seguimiento. Para obtener más información sobre los objetos código y los objetos marco consulte :ref:`types`.

source: If the debugger should stop on the current line, invoke the :meth:`user_line` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_line`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
es: Si el depurador tiene que detenerse en la línea actual, invoca el método :meth:`user_line` (que debe ser redefinido en las subclases). Genera una excepción :exc:`BdbQuit` si se establece el flag :attr:`Bdb.quitting` (que se puede establecer mediante :meth:`user_line`). Retorna una referencia al método :meth:`trace_dispatch` para realizar un seguimiento adicional en ese ámbito.

source: If the debugger should stop on this function call, invoke the :meth:`user_call` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_call`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
es: Si el depurador tiene que detenerse en esta llamada de función, invoca el método :meth:`user_call` (que debe ser redefinido en las subclases). Lanza una excepción :exc:`BdbQuit` si se establece el flag :attr:`Bdb.quitting` (que se puede establecer mediante :meth:`user_call`). Retorna una referencia al método :meth:`trace_dispatch` para realizar un seguimiento adicional en ese ámbito.

source: If the debugger should stop on this function return, invoke the :meth:`user_return` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_return`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
es: Si el depurador tiene que detenerse en el retorno de esta función, invoca el método :meth:`user_return` (que debe ser redefinido en las subclases). Lanza una excepción :exc:`BdbQuit` si se establece el flag :attr:`Bdb.quitting` (que se puede establecer mediante :meth:`user_return`). Retorna una referencia al método :meth:`trace_dispatch` para realizar un seguimiento adicional en ese ámbito.

source: If the debugger should stop at this exception, invokes the :meth:`user_exception` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`Bdb.quitting` flag is set (which can be set from :meth:`user_exception`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
es: Si el depurador tiene que detenerse en esta excepción, invoca el método :meth:`user_exception` (que debe ser redefinido en las subclases). Lanza una excepción :exc:`BdbQuit` si se establece el flag :attr:`Bdb.quitting` (que se puede establecer mediante :meth:`user_exception`). Retorna una referencia al método :meth:`trace_dispatch` para realizar un seguimiento adicional en ese ámbito.

source: Normally derived classes don't override the following methods, but they may if they want to redefine the definition of stopping and breakpoints.
es: Las clases derivadas normalmente no necesitan redefinir los siguientes métodos, pero pueden hacerlo si necesitan redefinir la definición de parada y los puntos de interrupción.

source: Return True if *module_name* matches any skip pattern.
es: Retorna True si *module_name* coincide con cualquier patrón de salto.

source: Return True if *frame* is below the starting frame in the stack.
es: Retorna True si *frame* está debajo del marco inicial en la pila.

source: Return True if there is an effective breakpoint for this line.
es: Retorna True si hay un punto de interrupción efectivo para esta línea.

source: Check whether a line or function breakpoint exists and is in effect. Delete temporary breakpoints based on information from :func:`effective`.
es: Comprueba si existe un punto de interrupción de línea o de una función y si está en vigor. Elimina puntos de interrupción temporales basados en la información de :func:`effective`.

source: Return True if any breakpoint exists for *frame*'s filename.
es: Retorna True si existe algún punto de interrupción para el nombre de archivo de *frame*.

source: Derived classes should override these methods to gain control over debugger operation.
es: Las clases derivadas deben redefinir estos métodos para adquirir el control sobre las operaciones de depuración.

source: Called from :meth:`dispatch_call` if a break might stop inside the called function.
es: Se llama desde :meth:`dispatch_call` si una interrupción puede detenerse dentro de la función llamada.

source: Called from :meth:`dispatch_line` when either :meth:`stop_here` or :meth:`break_here` returns ``True``.
es: Se llama desde :meth:`dispatch_line` cuando :meth:`stop_here` o :meth:`break_here` retornan ``True``.

source: Called from :meth:`dispatch_return` when :meth:`stop_here` returns ``True``.
es: Se llama desde :meth:`dispatch_return` cuando :meth:`stop_here` retorna ``True``.

source: Called from :meth:`dispatch_exception` when :meth:`stop_here` returns ``True``.
es: Se llama desde :meth:`dispatch_exception` cuando :meth:`stop_here` retorna ``True``.

source: Handle how a breakpoint must be removed when it is a temporary one.
es: Maneja cómo un punto de interrupción debe ser eliminado cuando es temporal.

source: This method must be implemented by derived classes.
es: Este método debe ser implementado por las clases derivadas.

source: Derived classes and clients can call the following methods to affect the stepping state.
es: Las clases derivadas y los clientes pueden llamar a los siguientes métodos para influir en el estado de transición.

source: Stop after one line of code.
es: Se detiene después de una línea de código.

source: Stop on the next line in or below the given frame.
es: Se detiene en la siguiente línea del marco de ejecución dado o en la de uno inferior.

source: Stop when returning from the given frame.
es: Se detiene cuando se retorna desde el marco de ejecución dado.

source: Stop when the line with the *lineno* greater than the current one is reached or when returning from current frame.
es: Se detiene cuando se alcanza la línea con el *lineno* mayor que el actual o al retornar desde el marco actual.

source: Start debugging from *frame*. If *frame* is not specified, debugging starts from caller's frame.
es: Inicia la depuración desde el marco de ejecución *frame*. Si *frame* no se especifica, la depuración se inicia desde el marco de ejecución que produce la llamada.

source: Stop only at breakpoints or when finished. If there are no breakpoints, set the system trace function to ``None``.
es: Se detiene solo en los puntos de interrupción o cuando haya terminado. Si no hay puntos de interrupción, se configura la función de seguimiento del sistema en ``None``.

source: Set the :attr:`quitting` attribute to ``True``. This raises :exc:`BdbQuit` in the next call to one of the :meth:`dispatch_\*` methods.
es: Establece el atributo :attr:`quitting` en ``True``. Esto lanza una excepción :exc:`BdbQuit` en la siguiente llamada a uno de los métodos :meth:`dispatch_\*` que tenga lugar.

source: Derived classes and clients can call the following methods to manipulate breakpoints. These methods return a string containing an error message if something went wrong, or ``None`` if all is well.
es: Las clases derivadas y los clientes pueden llamar a los siguientes métodos para manipular los puntos de interrupción. Estos métodos retornan una cadena de caracteres que contiene un mensaje de error si algo fue mal, o ``None`` si todo fue correctamente.

source: Set a new breakpoint. If the *lineno* line doesn't exist for the *filename* passed as argument, return an error message. The *filename* should be in canonical form, as described in the :meth:`canonic` method.
es: Establece un nuevo punto de interrupción. Si la línea en la posición *lineno* no existe en el archivo con nombre *filename* pasado como argumento, se retorna un mensaje de error. *filename* debe estar en su forma canónica, tal como se describe en el método :meth:`canonic`.

source: Delete the breakpoints in *filename* and *lineno*. If none were set, return an error message.
es: Elimina los puntos de interrupción en *filename* y *lineno*. Si no se estableció ninguno, se retorna un mensaje de error.

source: Delete the breakpoint which has the index *arg* in the :attr:`Breakpoint.bpbynumber`. If *arg* is not numeric or out of range, return an error message.
es: Elimina el punto de interrupción que tiene el índice *arg* en :attr:`Breakpoint.bpbynumber`. Si *arg* no es un valor numérico o es un indice fuera de rango, se retorna un mensaje de error.

source: Delete all breakpoints in *filename*. If none were set, return an error message.
es: Elimina todos los puntos de interrupción en *filename*. Si no se estableció ninguno, se retorna un mensaje de error.

source: Delete all existing breakpoints. If none were set, return an error message.
es: Elimina todos los puntos de interrupción. Si no se estableció ninguno, se retorna un mensaje de error.

source: Return a breakpoint specified by the given number. If *arg* is a string, it will be converted to a number. If *arg* is a non-numeric string, if the given breakpoint never existed or has been deleted, a :exc:`ValueError` is raised.
es: Retorna un punto de interrupción especificado por el número dado. Si *arg* es una cadena de caracteres, será convertida en un número. Si *arg* es una cadena no numérica, o el punto de interrupción dado nunca existió o ya ha sido eliminado, se lanza una excepción :exc:`ValueError`.

source: Return True if there is a breakpoint for *lineno* in *filename*.
es: Retorna True si hay un punto de interrupción para *lineno* en *filename*.

source: Return all breakpoints for *lineno* in *filename*, or an empty list if none are set.
es: Retorna todos los puntos de interrupción en la línea número *lineno* del archivo *filename*, o una lista vacía si no se ha establecido ninguno.

source: Return all breakpoints in *filename*, or an empty list if none are set.
es: Retorna todos los puntos de interrupción en el archivo *filename*, o una lista vacía si no hay ninguno establecido.

source: Return all breakpoints that are set.
es: Retorna todos los puntos de interrupción establecidos.

source: Derived classes and clients can call the following methods to get a data structure representing a stack trace.
es: Las clases derivadas y clientes pueden llamar los siguientes métodos para obtener una estructura de datos que representa un seguimiento de pila.

source: Return a list of (frame, lineno) tuples in a stack trace, and a size.
es: Retorna una lista de tuplas (frame, lineno) en un seguimiento de pila y un tamaño.

source: The most recently called frame is last in the list. The size is the number of frames below the frame where the debugger was invoked.
es: El marco llamado más recientemente es el último en la lista. El tamaño es el número de marcos por debajo del marco en el que se invocó el depurador.

source: Return a string with information about a stack entry, which is a ``(frame, lineno)`` tuple. The return string contains:
es: Retorna una cadena de caracteres con información sobre una entrada de pila, identificada por una tupla de la forma ``(frame, lineno)``. La cadena de caracteres que retorna contiene:

source: The canonical filename which contains the frame.
es: El nombre de archivo canónico que contiene el marco de ejecución.

source: The function name or ``"<lambda>"``.
es: El nombre de la función o ``"<lambda>"``.

source: The input arguments.
es: Los argumentos de entrada.

source: The return value.
es: El valor de retorno.

source: The line of code (if it exists).
es: La linea de código (si existe).

source: The following two methods can be called by clients to use a debugger to debug a :term:`statement`, given as a string.
es: Los dos métodos descritos a continuación pueden ser llamados por los clientes para usar un depurador que se encargue de depurar un :term:`statement`, proporcionado como una cadena de caracteres.

source: Debug a statement executed via the :func:`exec` function. *globals* defaults to :attr:`__main__.__dict__`, *locals* defaults to *globals*.
es: Depura una sentencia ejecutada a través de la función :func:`exec`. *globals* por defecto es :attr:`__main __.__ dict__`, mientras que *locals* es *globals* por defecto.

source: Debug an expression executed via the :func:`eval` function. *globals* and *locals* have the same meaning as in :meth:`run`.
es: Depura una expresión ejecutada mediante la función :func:`eval`. *globals* y *locals* tienen el mismo significado que en :meth:`run`.

source: For backwards compatibility. Calls the :meth:`run` method.
es: Definido solo por compatibilidad con versiones anteriores. Llama al método :meth:`run`.

source: Debug a single function call, and return its result.
es: Depura una única llamada a función y retorna su resultado.

source: Finally, the module defines the following functions:
es: Por último, el módulo también define las siguientes funciones:

source: Return True if we should break here, depending on the way the :class:`Breakpoint` *b* was set.
es: Retorna True si se debería interrumpir la ejecución en este punto, dependiendo de la forma en que se estableció la clase :class:`Breakpoint` *b*.
