Repository: python/python-docs-es
Catalog: library/bdb.po
Languages: es

source: If it was set via line number, it checks if :attr:`b.line <bdb.Breakpoint.line>` is the same as the one in *frame*. If the breakpoint was set via :attr:`function name <bdb.Breakpoint.funcname>`, we have to check we are in the right *frame* (the right function) and if we are on its first executable line.
es: Si se estableció a través del número de línea, comprueba si :attr:`b.line <bdb.Breakpoint.line>` es el mismo que el de *frame*. Si el punto de interrupción se estableció a través del :attr:`nombre de la función <bdb.Breakpoint.funcname>`, se tiene que comprobar que estamos en el *frame* correcto (la función correcta) y si se está en su primera línea ejecutable.

source: Return ``(active breakpoint, delete temporary flag)`` or ``(None, None)`` as the breakpoint to act upon.
es: Retorna ``(active breakpoint, delete temporary flag)`` o ``(None, None)`` como el punto de interrupción para actuar.

source: The *active breakpoint* is the first entry in :attr:`bplist <bdb.Breakpoint.bplist>` for the (:attr:`file <bdb.Breakpoint.file>`, :attr:`line <bdb.Breakpoint.line>`) (which must exist) that is :attr:`enabled <bdb.Breakpoint.enabled>`, for which :func:`checkfuncname` is True, and that has neither a False :attr:`condition <bdb.Breakpoint.cond>` nor positive :attr:`ignore <bdb.Breakpoint.ignore>` count. The *flag*, meaning that a temporary breakpoint should be deleted, is False only when the :attr:`cond <bdb.Breakpoint.cond>` cannot be evaluated (in which case, :attr:`ignore <bdb.Breakpoint.ignore>` count is ignored).
es: El *active breakpoint* es la primera entrada en :attr:`bplist <bdb.Breakpoint.bplist>` para (:attr:`file <bdb.Breakpoint.file>`, :attr:`line <bdb.Breakpoint.line>`) (que debe existir) que sea :attr:`enabled <bdb.Breakpoint.enabled>`, para lo cual :func:`checkfuncname` es True, y que no tenga una :attr:`condición <bdb.Breakpoint.cond>` False ni un conteo :attr:`ignore <bdb.Breakpoint.ignore>` positivo. *Flag* significa que un punto de interrupción temporal se debe eliminar, es False solo cuando no se puede evaluar :attr:`cond <bdb.Breakpoint.cond>` (en cuyo caso, se ignora el conteo :attr:`ignore <bdb.Breakpoint.ignore>`).

source: If no such entry exists, then (None, None) is returned.
es: Si no existe tal entrada, entonces retorna (None, None).

source: Start debugging with a :class:`Bdb` instance from caller's frame.
es: Inicia la depuración usando una instancia de :class:`Bdb`, partiendo desde el marco de ejecución que realiza la llamada.
