Repository: python/python-docs-es
Catalog: library/binhex.po
Languages: es_es

source: :mod:`binhex` --- Encode and decode binhex4 files
es_es: :mod:`binhex` --- Codificar y decodificar archivos binhex4

source: **Source code:** :source:`Lib/binhex.py`
es_es: **Código fuente:** :source:`Lib/binhex.py`

source: This module encodes and decodes files in binhex4 format, a format allowing representation of Macintosh files in ASCII. Only the data fork is handled.
es_es: Este módulo codifica y descodifica archivos en formato binhex4, un formato que permite la representación de archivos Macintosh en ASCII. Solo se maneja "data fork".

source: The :mod:`binhex` module defines the following functions:
es_es: El módulo :mod:`binhex` define las siguientes funciones:

source: Convert a binary file with filename *input* to binhex file *output*. The *output* parameter can either be a filename or a file-like object (any object supporting a :meth:`write` and :meth:`close` method).
es_es: Convierta un archivo binario con nombre de archivo *input* a archivo binhex *output*. El parámetro *output* puede ser un nombre de archivo o un objeto similar a un archivo (cualquier objeto que admita un método :meth:`write` y :meth:`close`).

source: Decode a binhex file *input*. *input* may be a filename or a file-like object supporting :meth:`read` and :meth:`close` methods. The resulting file is written to a file named *output*, unless the argument is ``None`` in which case the output filename is read from the binhex file.
es_es: Descodificar un archivo binhex *input*. *input* puede ser un nombre de archivo o un objeto similar a un archivo que admita los métodos :meth:`read` y :meth:`close`. El archivo resultante se escribe en un archivo denominado *output*, a menos que el argumento sea ``None`` en cuyo caso el nombre de archivo de salida se lee desde el archivo binhex.

source: The following exception is also defined:
es_es: También se define la siguiente excepción:

source: Exception raised when something can't be encoded using the binhex format (for example, a filename is too long to fit in the filename field), or when input is not properly encoded binhex data.
es_es: Excepción que se produce cuando algo no se puede codificar con el formato binhex (por ejemplo, un nombre de archivo demasiado largo para caber en el campo de nombre de archivo) o cuando la entrada no está codificada correctamente como datos binhex.

source: Module :mod:`binascii`
es_es: Módulo :mod:`binascii`

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
es_es: Módulo de soporte que contiene conversiones ASCII a binario y de binario a ASCII.

source: Notes
es_es: Notas

source: There is an alternative, more powerful interface to the coder and decoder, see the source for details.
es_es: Hay una interfaz alternativa más potente al codificador y decodificador, ver la fuente para más detalles.

source: If you code or decode textfiles on non-Macintosh platforms they will still use the old Macintosh newline convention (carriage-return as end of line).
es_es: Si codifica o decodifica ficheros de texto en plataformas no Macintosch, aún así se usará la antigua convención de nueva línea de Macintosh (retorno de carro al final de la línea).
