Repository: python/python-docs-es
Catalog: library/calendar.po
Languages: es_es

source: A subclass of :exc:`ValueError`, raised when the given weekday number is outside of the range 0-6 (inclusive).
es_es: Una subclase de :exc:`ValueError`, que se lanza cuando el número del día de la semana proporcionado está fuera del rango 0-6 (inclusive).

source: The invalid weekday number.
es_es: El número de día de la semana laborable no válido.

source: Module :mod:`datetime`
es_es: Módulo :mod:`datetime`

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
es_es: Interfaz orientada a objetos para fechas y horas con una funcionalidad similar a la del módulo :mod:`time`.

source: Module :mod:`time`
es_es: Módulo :mod:`time`

source: Low-level time related functions.
es_es: Funciones de bajo nivel relacionadas con el tiempo.

source: Command-Line Usage
es_es: Uso de la línea de comandos

source: The :mod:`calendar` module can be executed as a script from the command line to interactively print a calendar.
es_es: El módulo :mod:`calendar` se puede ejecutar como un script desde la línea de comandos para imprimir un calendario de forma interactiva.

source: For example, to print a calendar for the year 2000:
es_es: Por ejemplo, para imprimir un calendario para el año 2000:

source: The following options are accepted:
es_es: Se aceptan las siguientes opciones:

source: Show the help message and exit.
es_es: Muestra el mensaje de ayuda y salida.

source: The locale to use for month and weekday names. Defaults to English.
es_es: La configuración regional que se utiliza para los nombres de meses y días de la semana. El valor predeterminado es inglés.

source: The encoding to use for output. :option:`--encoding` is required if :option:`--locale` is set.
es_es: La codificación que se utiliza para la salida. Se necesita :option:`--encoding` si :option:`--locale` está configurada.

source: Print the calendar to the terminal as text, or as an HTML document.
es_es: Imprime el calendario en la terminal como texto o como un documento HTML.

source: The year to print the calendar for. Must be a number between 1 and 9999. Defaults to the current year.
es_es: El año para imprimir el calendario. Debe ser un número entre 1 y 9999. El valor predeterminado es el año actual.

source: The month of the specified :option:`year` to print the calendar for. Must be a number between 1 and 12, and may only be used in text mode. Defaults to printing a calendar for the full year.
es_es: El mes de :option:`year` especificado para imprimir el calendario. Debe ser un número entre 1 y 12 y sólo se puede usar en modo texto. El valor predeterminado es imprimir un calendario para el año completo.

source: *Text-mode options:*
es_es: *Opciones de modo texto:*

source: The width of the date column in terminal columns. The date is printed centred in the column. Any value lower than 2 is ignored. Defaults to 2.
es_es: El ancho de la columna de fecha en las columnas terminales. La fecha se imprime centrada en la columna. Cualquier valor inferior a 2 se ignora. El valor predeterminado es 2.

source: The number of lines for each week in terminal rows. The date is printed top-aligned. Any value lower than 1 is ignored. Defaults to 1.
es_es: El número de líneas para cada semana en filas terminales. La fecha se imprime alineada en la parte superior. Cualquier valor inferior a 1 se ignora. El valor predeterminado es 1.

source: The space between months in columns. Any value lower than 2 is ignored. Defaults to 6.
es_es: El espacio entre meses en columnas. Cualquier valor inferior a 2 se ignora. El valor predeterminado es 6.

source: The number of months printed per row. Defaults to 3.
es_es: El número de meses se imprimen por fila. El valor predeterminado es 3.

source: *HTML-mode options:*
es_es: *Opciones de modo HTML:*

source: The path of a CSS stylesheet to use for the calendar. This must either be relative to the generated HTML, or an absolute HTTP or ``file:///`` URL.
es_es: La ruta de una hoja de estilos CSS que se utiliza para el calendario. Esta debe ser relativa al HTML generado, o un HTTP absoluto o una URL ``file:///``.
