Repository: python/python-docs-es
Catalog: library/cgi.po
Languages: es

source: :mod:`cgi` --- Common Gateway Interface support
es: :mod:`cgi` --- Soporte de Interfaz de Entrada Común (CGI)

source: **Source code:** :source:`Lib/cgi.py`
es: **Código fuente:** :source:`Lib/cgi.py`

source: The :mod:`cgi` module is deprecated (see :pep:`PEP 594 <594#cgi>` for details and alternatives).
es: El módulo :mod:`cgi` está obsoleto (vea :pep:`PEP 594 <594#cgi>` para más detalles y alternativas).

source: The :class:`FieldStorage` class can typically be replaced with :func:`urllib.parse.parse_qsl` for ``GET`` and ``HEAD`` requests, and the :mod:`email.message` module or `multipart <https://pypi.org/project/multipart/>`_ for ``POST`` and ``PUT``. Most :ref:`utility functions <functions-in-cgi-module>` have replacements.
es: La clase :class:`FieldStorage` puede ser típicamente reemplazada con :func:`urllib.parse.parse_qsl` para solicitudes ``GET`` y ``HEAD``, y el módulo :mod:`email.message` o `multipart <https://pypi.org/project/multipart/>`_ para ``POST`` y ``PUT``. La mayoría de las :ref:`funciones de utilidad <functions-in-cgi-module>` tienen reemplazo.

source: Support module for Common Gateway Interface (CGI) scripts.
es: Módulo de soporte para scripts de la Interfaz de Entrada Común (CGI)

source: This module defines a number of utilities for use by CGI scripts written in Python.
es: Este módulo define una serie de utilidades para el uso de scripts CGI escritos en Python.

source: The global variable ``maxlen`` can be set to an integer indicating the maximum size of a POST request. POST requests larger than this size will result in a :exc:`ValueError` being raised during parsing. The default value of this variable is ``0``, meaning the request size is unlimited.
es: La variable global ``maxlen`` puede ser establecida en un entero indicando el tamaño máximo de una solicitud POST. Solicitudes POST más grandes que este tamaño resultarán en en lanzamiento de un :exc:`ValueError` durante el análisis. El valor por defecto de esta variable es ``0``, lo que significa que el tamaño de las solicitudes es ilimitado.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Vea :ref:`wasm-availability` para más información.

source: Introduction
es: Introducción

source: A CGI script is invoked by an HTTP server, usually to process user input submitted through an HTML ``<FORM>`` or ``<ISINDEX>`` element.
es: Un script de CGI es invocado por un servidor HTTP, generalmente para procesar entradas de usuario entregadas mediante un elemento HTML ``<FORM>`` o ``<ISINDEX>``.

source: Most often, CGI scripts live in the server's special :file:`cgi-bin` directory. The HTTP server places all sorts of information about the request (such as the client's hostname, the requested URL, the query string, and lots of other goodies) in the script's shell environment, executes the script, and sends the script's output back to the client.
es: Muy a menudo, los scripts CGI viven en el directorio especial :file:`cgi-bin` del servidor. El servidor HTTP coloca todo tipo de información sobre la solicitud (como el nombre de host del cliente, la dirección URL solicitada, la cadena de búsqueda (query string) y muchas otras consultas) en el entorno de shell del script, ejecuta el script y envía la salida del script al cliente.

source: The script's input is connected to the client too, and sometimes the form data is read this way; at other times the form data is passed via the "query string" part of the URL. This module is intended to take care of the different cases and provide a simpler interface to the Python script. It also provides a number of utilities that help in debugging scripts, and the latest addition is support for file uploads from a form (if your browser supports it).
es: La entrada del script también está conectada al cliente, y a veces los datos del formulario se leen de esta manera; en otras ocasiones los datos del formulario se pasan a través de la parte "cadena de caracteres de búsqueda (query string)" de la dirección URL. Este módulo está diseñado para ocuparse de los diferentes casos y proporcionar una interfaz más simple al script de Python. También proporciona una serie de utilidades que ayudan en la depuración de scripts, y la última adición es la compatibilidad con cargas de archivos desde un formulario (si el navegador lo admite).

source: The output of a CGI script should consist of two sections, separated by a blank line. The first section contains a number of headers, telling the client what kind of data is following. Python code to generate a minimal header section looks like this::
es: La salida de un script CGI debe constar de dos secciones, separadas por una línea en blanco. La primera sección contiene una serie de encabezados, indicando al cliente qué tipo de datos sigue. El código de Python para generar una sección de encabezado mínima tiene este aspecto::

source: The second section is usually HTML, which allows the client software to display nicely formatted text with header, in-line images, etc. Here's Python code that prints a simple piece of HTML::
es: La segunda sección suele ser HTML, lo que permite al software cliente mostrar texto bien formateado con encabezado, imágenes en línea, etc. Aquí está el código Python que imprime una simple pieza de HTML::

source: Using the cgi module
es: Usando el módulo CGI

source: Begin by writing ``import cgi``.
es: Empieza escribiendo ``import cgi``.

source: When you write a new script, consider adding these lines::
es: Cuando escribas un nuevo script, considera añadir estas líneas::

source: This activates a special exception handler that will display detailed reports in the web browser if any errors occur. If you'd rather not show the guts of your program to users of your script, you can have the reports saved to files instead, with code like this::
es: Esto activa un gestor de excepciones especial que mostrará informes detallados en el explorador web si se produce algún error. Si prefiere no mostrar los detalles de su programa a los usuarios de su script, puede tener los informes guardados en archivos en su lugar, como se muestra en el siguiente código::

source: It's very helpful to use this feature during script development. The reports produced by :mod:`cgitb` provide information that can save you a lot of time in tracking down bugs. You can always remove the ``cgitb`` line later when you have tested your script and are confident that it works correctly.
es: Es muy útil usar esta característica durante el desarrollo de scripts. Los informes producidos por :mod:`cgitb` proporcionan información que puede ahorrarle mucho tiempo en el seguimiento de errores. Siempre puede eliminar la línea ``cgitb`` más adelante cuando haya probado su script y esté seguro de que funciona correctamente.

source: To get at submitted form data, use the :class:`FieldStorage` class. If the form contains non-ASCII characters, use the *encoding* keyword parameter set to the value of the encoding defined for the document. It is usually contained in the META tag in the HEAD section of the HTML document or by the :mailheader:`Content-Type` header. This reads the form contents from the standard input or the environment (depending on the value of various environment variables set according to the CGI standard). Since it may consume standard input, it should be instantiated only once.
es: Para llegar a los datos de formulario enviados usa la clase :class:`FieldStorage`. Si el formulario contiene caracteres que no sean ASCII, usa el parámetro de palabra clave *encoding* establecido en el valor del codificado definido para el documento. Éste está usualmente contenido en la etiqueta META en la sección HEAD del documento HTML, o en el encabezado :mailheader:`Content-Type`. Esto lee los contenidos del formulario desde la entrada estándar o el ambiente (dependiendo de los valores de varias variables de entorno establecidas de acuerdo del estándar CGI). Dado que podría consumir entrada estándar, sólo se debería instanciar una sola vez.

source: The :class:`FieldStorage` instance can be indexed like a Python dictionary. It allows membership testing with the :keyword:`in` operator, and also supports the standard dictionary method :meth:`~dict.keys` and the built-in function :func:`len`. Form fields containing empty strings are ignored and do not appear in the dictionary; to keep such values, provide a true value for the optional *keep_blank_values* keyword parameter when creating the :class:`FieldStorage` instance.
es: La instancia :class:`FieldStorage` puede ser indexada como un diccionario Python. Permite las pruebas de afiliación con el operador :keyword:`in`, y también es compatible con el método de diccionario estándar :meth:`~dict.keys` y la función incorporada :func:`len`. Los campos de formulario que contienen cadenas de caracteres vacías son ignoradas y no aparecen en el diccionario; para mantener estos valores, proporciona un valor verdadero para el parámetro de palabra clave opcional *keep_blank_values* al crear la instancia :class:`FieldStorage`.

source: For instance, the following code (which assumes that the :mailheader:`Content-Type` header and blank line have already been printed) checks that the fields ``name`` and ``addr`` are both set to a non-empty string::
es: Por ejemplo, el código siguiente (que supone que el encabezado :mailheader:`Content-Type` y la línea en blanco ya se han impreso) comprueba que los campos ``name`` y ``addr`` son ambos establecidos a una cadena de caracteres no vacía::

source: Here the fields, accessed through ``form[key]``, are themselves instances of :class:`FieldStorage` (or :class:`MiniFieldStorage`, depending on the form encoding). The :attr:`~FieldStorage.value` attribute of the instance yields the string value of the field. The :meth:`~FieldStorage.getvalue` method returns this string value directly; it also accepts an optional second argument as a default to return if the requested key is not present.
es: Aquí los campos, a los que se accede a través de ``form[key]``, son por sí mismos las instancias de :class:`FieldStorage` (o :class:`MiniFieldStorage`, dependiendo de la codificación del formulario). El atributo :attr:`~FieldStorage.value` de la instancia produce el valor de cadena de caracteres del campo. El método :meth:`~FieldStorage.getvalue` retorna este valor de cadena de caracteres directamente; también acepta un segundo argumento opcional como valor predeterminado para retornar si la clave solicitada no está presente.

source: If the submitted form data contains more than one field with the same name, the object retrieved by ``form[key]`` is not a :class:`FieldStorage` or :class:`MiniFieldStorage` instance but a list of such instances. Similarly, in this situation, ``form.getvalue(key)`` would return a list of strings. If you expect this possibility (when your HTML form contains multiple fields with the same name), use the :meth:`~FieldStorage.getlist` method, which always returns a list of values (so that you do not need to special-case the single item case). For example, this code concatenates any number of username fields, separated by commas::
es: Si los datos del formulario enviados contienen más de un campo con el mismo nombre, el objeto recuperado por ``form[key]`` no es una instancia :class:`FieldStorage` o :class:`MiniFieldStorage`, sino una lista de dichas instancias. De forma similar, en esta situación, ``form.getvalue(key)`` retornaría una lista de cadenas de caracteres. Si espera esta posibilidad (cuando su formulario HTML contiene múltiples campos con el mismo nombre), utilice el método :meth:`~FieldStorage.getlist`, que siempre retorna una lista de valores (para que no sea necesario poner en mayúsculas y minúsculas en el caso de un solo elemento). Por ejemplo, este código concatena cualquier número de campos de nombre de usuario, separados por comas::

source: If a field represents an uploaded file, accessing the value via the :attr:`~FieldStorage.value` attribute or the :meth:`~FieldStorage.getvalue` method reads the entire file in memory as bytes. This may not be what you want. You can test for an uploaded file by testing either the :attr:`~FieldStorage.filename` attribute or the :attr:`~FieldStorage.file` attribute. You can then read the data from the :attr:`!file` attribute before it is automatically closed as part of the garbage collection of the :class:`FieldStorage` instance (the :func:`~io.RawIOBase.read` and :func:`~io.IOBase.readline` methods will return bytes)::
es: Si un campo representa un archivo cargado, el acceso al valor a través del atributo :attr:`~FieldStorage.value` o el método :meth:`~FieldStorage.getvalue` lee todo el archivo en memoria como bytes. Puede que esto no sea lo que quiera que ocurra. Puede probar un archivo cargado probando el atributo :attr:`~FieldStorage.filename` o el atributo :attr:`~FieldStorage.file`. Después, puede leer los datos del atributo :attr:`!file` antes de que se cierre automáticamente como parte de la recolección de elementos no utilizados de la instancia :class:`FieldStorage` (los métodos :func:`~io.RawIOBase.read` y :func:`~io.IOBase.readline` retornarán bytes)::

source: :class:`FieldStorage` objects also support being used in a :keyword:`with` statement, which will automatically close them when done.
es: Los objetos :class:`FieldStorage` también permiten ser usados en una sentencia :keyword:`with` , lo que automáticamente los cerrará cuando termine la sentencia.

source: If an error is encountered when obtaining the contents of an uploaded file (for example, when the user interrupts the form submission by clicking on a Back or Cancel button) the :attr:`~FieldStorage.done` attribute of the object for the field will be set to the value -1.
es: Si un error es encontrado al obtener el contenido de un archivo cargado (por ejemplo, cuando el usuario interrumpe el envío del formulario haciendo clic en un botón Atrás o Cancelar), el atributo :attr:`~FieldStorage.done` del objeto para el campo se establecerá en el valor -1.

source: The file upload draft standard entertains the possibility of uploading multiple files from one field (using a recursive :mimetype:`multipart/\*` encoding). When this occurs, the item will be a dictionary-like :class:`FieldStorage` item. This can be determined by testing its :attr:`!type` attribute, which should be :mimetype:`multipart/form-data` (or perhaps another MIME type matching :mimetype:`multipart/\*`). In this case, it can be iterated over recursively just like the top-level form object.
es: El borrador de archivo de carga estándar presenta la posibilidad de cargar varios archivos desde un campo (utilizando una codificación recursiva :mimetype:`multipart/\*`). Cuando esto ocurre, el elemento será un elemento similar a un diccionario :class:`FieldStorage`. Esto se puede determinar probando su atributo :attr:`!type`, que debe ser :mimetype:`multipart/form-data` (o tal vez otro tipo MIME que coincida :mimetype:`multipart/\*`). En este caso, se puede iterar recursivamente al igual que el objeto de formulario de nivel superior.

source: When a form is submitted in the "old" format (as the query string or as a single data part of type :mimetype:`application/x-www-form-urlencoded`), the items will actually be instances of the class :class:`MiniFieldStorage`. In this case, the :attr:`!list`, :attr:`!file`, and :attr:`filename` attributes are always ``None``.
es: Cuando se envía un formulario en el formato "antiguo" (como la cadena de caracteres de consulta (query string) o como una sola parte de datos de tipo :mimetype:`application/x-www-form-urlencoded`), los elementos serán realmente instancias de la clase :class:`MiniFieldStorage`. En este caso, los atributos :attr:`!list`, :attr:`!file` y :attr:`filename` siempre son ``None``.

source: A form submitted via POST that also has a query string will contain both :class:`FieldStorage` and :class:`MiniFieldStorage` items.
es: Un formulario enviado a través de POST que también tiene una cadena de caracteres de consulta (query string) contendrá los elementos :class:`FieldStorage` y :class:`MiniFieldStorage`.

source: The :attr:`~FieldStorage.file` attribute is automatically closed upon the garbage collection of the creating :class:`FieldStorage` instance.
es: El atributo :attr:`~FieldStorage.file` se cierra automáticamente con el recolector de basura de la instancia creada :class:`FieldStorage`.

source: Added support for the context management protocol to the :class:`FieldStorage` class.
es: Agregado soporte para el protocolo de administrador de contexto a la clase :class:`FieldStorage` .

source: Higher Level Interface
es: Interfaz de nivel superior

source: The previous section explains how to read CGI form data using the :class:`FieldStorage` class. This section describes a higher level interface which was added to this class to allow one to do it in a more readable and intuitive way. The interface doesn't make the techniques described in previous sections obsolete --- they are still useful to process file uploads efficiently, for example.
es: La sección anterior explica cómo leer datos de un formulario CGI usando la clase :class:`FieldStorage`. Esta sección describe un nivel de interfaz superior que se añadió a esta clase para permitir que uno lo haga de una manera más legible e intuitiva. La interfaz no hace que las técnicas descritas en las secciones anteriores estén obsoletas -- por ejemplo, siguen siendo útiles para procesar la carga de archivos de manera eficiente.

source: The interface consists of two simple methods. Using the methods you can process form data in a generic way, without the need to worry whether only one or more values were posted under one name.
es: La interfaz consiste en dos métodos simples. Usando los métodos puedes procesar datos de formulario de una manera genérica, sin la necesidad de preocuparte si solo se publicaron uno o más valores con un solo nombre.

source: In the previous section, you learned to write following code anytime you expected a user to post more than one value under one name::
es: En la sección anterior, aprendiste a escribir el siguiente código cada vez que esperabas que un usuario publicara más de un valor con un nombre::

source: This situation is common for example when a form contains a group of multiple checkboxes with the same name::
es: Esta situación es común, por ejemplo, cuando un formulario contiene un grupo de múltiples casillas de verificación (checkboxes) con el mismo nombre::

source: In most situations, however, there's only one form control with a particular name in a form and then you expect and need only one value associated with this name. So you write a script containing for example this code::
es: En la mayoría de las situaciones, sin embargo, solo hay un control de formulario con un nombre determinado en un formulario y así, espera y solo necesita un valor asociado con este nombre. Así que escribe un script que contiene, por ejemplo, este código::

source: The problem with the code is that you should never expect that a client will provide valid input to your scripts. For example, if a curious user appends another ``user=foo`` pair to the query string, then the script would crash, because in this situation the ``getvalue("user")`` method call returns a list instead of a string. Calling the :meth:`~str.upper` method on a list is not valid (since lists do not have a method of this name) and results in an :exc:`AttributeError` exception.
es: El problema con el código es que nunca debe esperar que un cliente proporcione una entrada válida a los scripts. Por ejemplo, si un usuario curioso anexa otro par ``user=foo`` a la cadena de caracteres de consulta (query string), el script se bloquearía, porque en esta situación la llamada al método ``getvalue("user")`` retorna una lista en lugar de una cadena de caracteres. Llamar al método :meth:`~str.upper` en una lista no es válido (ya que las listas no tienen un método con este nombre) y se produce una excepción :exc:`AttributeError`.

source: Therefore, the appropriate way to read form data values was to always use the code which checks whether the obtained value is a single value or a list of values. That's annoying and leads to less readable scripts.
es: Por lo tanto, la forma adecuada de leer los valores de datos de formulario era usar siempre el código que comprueba si el valor obtenido es un valor único o una lista de valores. Eso es molesto y conduce a scripts menos legibles.

source: A more convenient approach is to use the methods :meth:`~FieldStorage.getfirst` and :meth:`~FieldStorage.getlist` provided by this higher level interface.
es: Un enfoque más conveniente es utilizar los métodos :meth:`~FieldStorage.getfirst` y :meth:`~FieldStorage.getlist` proporcionados por esta interfaz de nivel superior.

source: This method always returns only one value associated with form field *name*. The method returns only the first value in case that more values were posted under such name. Please note that the order in which the values are received may vary from browser to browser and should not be counted on. [#]_ If no such form field or value exists then the method returns the value specified by the optional parameter *default*. This parameter defaults to ``None`` if not specified.
es: Este método siempre retorna solo un valor asociado con el campo de formulario *name*. El método retorna solo el primer valor en caso de que se registraran más valores con dicho nombre. Tenga en cuenta que el orden en que se reciben los valores puede variar de un navegador a otro y no debe darse por sentado. [#]_ Si no existe ningún campo o valor de formulario, el método retorna el valor especificado por el parámetro opcional *default*. Este parámetro tiene como valor predeterminado ``None`` si no se especifica.

source: This method always returns a list of values associated with form field *name*. The method returns an empty list if no such form field or value exists for *name*. It returns a list consisting of one item if only one such value exists.
es: Este método siempre retorna una lista de valores asociados con el campo de formulario *name*. El método retorna una lista vacía si no existe tal campo o valor de formulario para *name*. Retorna una lista que consta de un elemento si solo existe un valor de este tipo.

source: Using these methods you can write nice compact code::
es: Usando estos métodos puede escribir código compacto agradable::

source: Functions
es: Funciones

source: These are useful if you want more control, or if you want to employ some of the algorithms implemented in this module in other circumstances.
es: Estas son útiles si desea más control, o si desea emplear algunos de los algoritmos implementados en este módulo en otras circunstancias.

source: Parse a query in the environment or from a file (the file defaults to ``sys.stdin``). The *keep_blank_values*, *strict_parsing* and *separator* parameters are passed to :func:`urllib.parse.parse_qs` unchanged.
es: Analiza una consulta en el entorno o desde un archivo (el archivo predeterminado es ``sys.stdin``). Los parámetros *keep_blank_values*, *strict_parsing* y *separator* se pasan a :func:`urllib.parse.parse_qs` sin cambios.
