Repository: python/python-docs-es
Catalog: library/cgi.po
Languages: es

source: This function, like the rest of the :mod:`cgi` module, is deprecated. It can be replaced by calling :func:`urllib.parse.parse_qs` directly on the desired query string (except for ``multipart/form-data`` input, which can be handled as described for :func:`parse_multipart`).
es: Esta función, como el resto del módulo :mod:`cgi`, está obsoleta. Puede ser reemplazada llamando directamente a :func:`urllib.parse.parse_qs` con la cadena de caracteres de la consulta (excepto para entradas ``multipart/form-data``, las cuales puede ser manejadas como se describe para :func:`parse_multipart`).

source: Parse input of type :mimetype:`multipart/form-data` (for file uploads). Arguments are *fp* for the input file, *pdict* for a dictionary containing other parameters in the :mailheader:`Content-Type` header, and *encoding*, the request encoding.
es: Analiza la entrada de tipo :mimetype:`multipart/form-data` (para cargas de archivos). Los argumentos son *fp* para el archivo de entrada, *pdict* para un diccionario que contiene otros parámetros en el encabezado :mailheader:`Content-Type` y *encoding*, la codificación de la solicitud.

source: Returns a dictionary just like :func:`urllib.parse.parse_qs`: keys are the field names, each value is a list of values for that field. For non-file fields, the value is a list of strings.
es: Retorna un diccionario al igual que :func:`urllib.parse.parse_qs`: las claves son los nombres de campo, cada valor es una lista de valores para ese campo. Para los campos que no son de archivo, el valor es una lista de cadenas de caracteres.

source: This is easy to use but not much good if you are expecting megabytes to be uploaded --- in that case, use the :class:`FieldStorage` class instead which is much more flexible.
es: Esto es fácil de usar pero no muy bueno si espera que se carguen megabytes --- en ese caso, utilice la clase :class:`FieldStorage` en su lugar, que es mucho más flexible.

source: Added the *encoding* and *errors* parameters. For non-file fields, the value is now a list of strings, not bytes.
es: Se agregaron los parámetros *encoding* y *errors*. Para los campos que no son de archivo, el valor es ahora una lista de cadenas de caracteres, no bytes.

source: Added the *separator* parameter.
es: Agregado el parámetro *separator*.

source: This function, like the rest of the :mod:`cgi` module, is deprecated. It can be replaced with the functionality in the :mod:`email` package (e.g. :class:`email.message.EmailMessage`/:class:`email.message.Message`) which implements the same MIME RFCs, or with the `multipart <https://pypi.org/project/multipart/>`__ PyPI project.
es: Esta función, como el resto del módulo :mod:`cgi`, está obsoleta. Puede ser reemplazada con la funcionalidad del paquete :mod:`email` (por ejemplo, :class:`email.message.EmailMessage`/:class:`email.message.Message`) el cual implementa los mismos RFCs de MIME, o con el proyecto de PyPI `multipart <https://pypi.org/project/multipart/>`__.

source: Parse a MIME header (such as :mailheader:`Content-Type`) into a main value and a dictionary of parameters.
es: Analiza un encabezado MIME (como :mailheader:`Content-Type`) en un valor principal y un diccionario de parámetros.

source: This function, like the rest of the :mod:`cgi` module, is deprecated. It can be replaced with the functionality in the :mod:`email` package, which implements the same MIME RFCs.
es: Esta función, como el resto del módulo :mod:`cgi`, está obsoleta. Puede ser reemplazada con la funcionalidad del paquete :mod:`email`, el cual implementa los mismos RFCs de MIME.

source: For example, with :class:`email.message.EmailMessage`::
es: Por ejemplo, con :class:`email.message.EmailMessage`::

source: Robust test CGI script, usable as main program. Writes minimal HTTP headers and formats all information provided to the script in HTML format.
es: Script CGI de prueba robusto, usable como programa principal. Escribe encabezados HTTP mínimos y formatea toda la información proporcionada hacia el script en formato HTML.

source: Format the shell environment in HTML.
es: Da formato al entorno del shell en HTML.

source: Format a form in HTML.
es: Da formato a un formulario en HTML.

source: Format the current directory in HTML.
es: Da formato al directorio actual en HTML.

source: Print a list of useful (used by CGI) environment variables in HTML.
es: Imprime una lista de variables de entorno útiles (utilizadas por CGI) en HTML.

source: Caring about security
es: Preocuparse por la seguridad

source: There's one important rule: if you invoke an external program (via :func:`os.system`, :func:`os.popen` or other functions with similar functionality), make very sure you don't pass arbitrary strings received from the client to the shell. This is a well-known security hole whereby clever hackers anywhere on the web can exploit a gullible CGI script to invoke arbitrary shell commands. Even parts of the URL or field names cannot be trusted, since the request doesn't have to come from your form!
es: Hay una regla importante: si invoca un programa externo (a través de :func:`os.system`, :func:`os.popen` u otras funciones con una funcionalidad similar), asegúrese bien de no pasar strings arbitrarios recibidos desde el cliente hacia la shell. Este es una brecha de seguridad muy conocida por la que los hackers inteligentes en cualquier lugar de la web pueden explotar un inocente script CGI para invocar comandos de shell arbitrarios. Incluso partes de la URL o nombres de campo pueden no ser confiables, ya que la solicitud no tiene que venir de su formulario!

source: To be on the safe side, if you must pass a string gotten from a form to a shell command, you should make sure the string contains only alphanumeric characters, dashes, underscores, and periods.
es: Para estar en el lado seguro, si debe pasar una cadena de caracteres de un formulario a un comando de shell, debe asegurarse de que la cadena de caracteres contiene solo caracteres alfanuméricos, guiones, guiones bajos y puntos.

source: Installing your CGI script on a Unix system
es: Instalando su script de CGI en un sistema Unix

source: Read the documentation for your HTTP server and check with your local system administrator to find the directory where CGI scripts should be installed; usually this is in a directory :file:`cgi-bin` in the server tree.
es: Lea la documentación del servidor HTTP y consulte con el administrador del sistema local para encontrar el directorio donde se deben instalar los scripts CGI; por lo general, esto se encuentra en un directorio :file:`cgi-bin` en el árbol del servidor.

source: Make sure that your script is readable and executable by "others"; the Unix file mode should be ``0o755`` octal (use ``chmod 0755 filename``). Make sure that the first line of the script contains ``#!`` starting in column 1 followed by the pathname of the Python interpreter, for instance::
es: Asegúrese de que el script es legible y ejecutable por "otros"; el modo de archivo Unix debe ser octal ``0o755`` (utilice ``chmod 0755 filename``). Asegúrese de que la primera línea del script contiene ``#!`` a partir de la columna 1 seguida del nombre de ruta del intérprete de Python, por ejemplo::

source: Make sure the Python interpreter exists and is executable by "others".
es: Asegúrese que el intérprete de Python exista y sea ejecutable por "otros".

source: Make sure that any files your script needs to read or write are readable or writable, respectively, by "others" --- their mode should be ``0o644`` for readable and ``0o666`` for writable. This is because, for security reasons, the HTTP server executes your script as user "nobody", without any special privileges. It can only read (write, execute) files that everybody can read (write, execute). The current directory at execution time is also different (it is usually the server's cgi-bin directory) and the set of environment variables is also different from what you get when you log in. In particular, don't count on the shell's search path for executables (:envvar:`PATH`) or the Python module search path (:envvar:`PYTHONPATH`) to be set to anything interesting.
es: Asegúrese de que cualquier archivo que su script necesite leer o escribir sea legible o tenga permiso de escritura, respectivamente, por "otros" --- su modo debe ser ``0o644`` para legible y ``0o666`` para escribir. Esto se debe a que, por razones de seguridad, el servidor HTTP ejecuta el script como usuario "nadie", sin ningún privilegio especial. Sólo puede leer (escribir, ejecutar) archivos que todo el mundo puede leer (escribir, ejecutar). El directorio actual en tiempo de ejecución también es diferente (normalmente es el directorio cgi-bin del servidor) y el conjunto de variables de entorno también es diferente de lo que se obtiene al iniciar sesión. En particular, no cuente con la ruta de búsqueda del shell para ejecutables (:envvar:`PATH`) o la ruta de búsqueda del módulo Python (:envvar:`PYTHONPATH`) que se establecerá en cualquier cosa interesante.

source: If you need to load modules from a directory which is not on Python's default module search path, you can change the path in your script, before importing other modules. For example::
es: Si necesita cargar módulos desde un directorio el cual no está en la ruta de búsqueda de módulos predeterminada de Python, puede cambiar la ruta en su script, antes de importar otros módulos. Por ejemplo::

source: (This way, the directory inserted last will be searched first!)
es: (¡De esta manera, el directorio insertado de último será buscado primero!)

source: Instructions for non-Unix systems will vary; check your HTTP server's documentation (it will usually have a section on CGI scripts).
es: Las instrucciones para sistemas que no son Unix pueden variar; consulte la documentación de su servidor HTTP (usualmente tendrá una sección sobre scripts CGI).

source: Testing your CGI script
es: Probando su script de CGI

source: Unfortunately, a CGI script will generally not run when you try it from the command line, and a script that works perfectly from the command line may fail mysteriously when run from the server. There's one reason why you should still test your script from the command line: if it contains a syntax error, the Python interpreter won't execute it at all, and the HTTP server will most likely send a cryptic error to the client.
es: Desafortunadamente, un script CGI generalmente no se ejecutará cuando lo pruebe desde la línea de comandos, y un script que funcione perfectamente desde la línea de comandos puede fallar misteriosamente cuando se ejecuta desde el servidor. Hay una razón por la que debe probar el script desde la línea de comandos: si contiene un error de sintaxis, el intérprete de Python no lo ejecutará en absoluto y lo más probable es que el servidor HTTP envíe un error críptico al cliente.

source: Assuming your script has no syntax errors, yet it does not work, you have no choice but to read the next section.
es: Asumiendo que su script no tiene errores de sintaxis, pero este no funciona, no tiene más opción que leer la siguiente sección.

source: Debugging CGI scripts
es: Depurando scripts de CGI

source: First of all, check for trivial installation errors --- reading the section above on installing your CGI script carefully can save you a lot of time. If you wonder whether you have understood the installation procedure correctly, try installing a copy of this module file (:file:`cgi.py`) as a CGI script. When invoked as a script, the file will dump its environment and the contents of the form in HTML format. Give it the right mode etc., and send it a request. If it's installed in the standard :file:`cgi-bin` directory, it should be possible to send it a request by entering a URL into your browser of the form:
es: En primer lugar, compruebe si hay errores de instalación triviales --- leer la sección anterior sobre la instalación cuidadosa de su script CGI puede ahorrarle mucho tiempo. Si se pregunta si ha entendido correctamente el procedimiento de instalación, intente instalando una copia de este archivo de módulo (:file:`cgi.py`) como un script CGI. Cuando se invoca como un script, el archivo cambiará su entorno y el contenido del formulario en formato HTML. Dele el modo correcto, etc., y envíe una solicitud. Si está instalado en el directorio estándar :file:`cgi-bin`, debería ser posible enviarle una solicitud introduciendo una URL en su navegador de la forma:

source: If this gives an error of type 404, the server cannot find the script -- perhaps you need to install it in a different directory. If it gives another error, there's an installation problem that you should fix before trying to go any further. If you get a nicely formatted listing of the environment and form content (in this example, the fields should be listed as "addr" with value "At Home" and "name" with value "Joe Blow"), the :file:`cgi.py` script has been installed correctly. If you follow the same procedure for your own script, you should now be able to debug it.
es: Si esto da un error de tipo 404, el servidor no puede encontrar el script -- quizás necesite instalarlo en un directorio diferente. Si este da otro error, hay un problema con la instalación que debería intentar solucionar antes de continuar. Si obtiene una lista bien formateada del entorno y el contenido del formulario (en este ejemplo, los campos deberían estar listados como "addr" con el valor "At Home" y "name" con el valor "Joe Blow"), el script :file:`cgi.py` ha sido instalado correctamente. Si sigue el mismo procedimiento para su propio script, ya debería poder depurarlo.

source: The next step could be to call the :mod:`cgi` module's :func:`test` function from your script: replace its main code with the single statement ::
es: El siguiente paso podría ser llamar a la función :func:`test` del módulo :mod:`cgi` de su script: reemplace su código principal con la declaración única ::

source: This should produce the same results as those gotten from installing the :file:`cgi.py` file itself.
es: Esto debería producir los mismos resultados que los obtenidos al instalar el archivo :file:`cgi.py` en sí.

source: When an ordinary Python script raises an unhandled exception (for whatever reason: of a typo in a module name, a file that can't be opened, etc.), the Python interpreter prints a nice traceback and exits. While the Python interpreter will still do this when your CGI script raises an exception, most likely the traceback will end up in one of the HTTP server's log files, or be discarded altogether.
es: Cuando un script de Python normal lanza una excepción no controlada (por cualquier razón: de un error tipográfico en un nombre de módulo, un archivo que no se puede abrir, etc.), el intérprete de Python imprime un traceback sutil y sale. Aunque el intérprete de Python seguirá haciendo esto cuando el script CGI lance una excepción, lo más probable es que el traceback termine en uno de los archivos de registro del servidor HTTP o se descarte por completo.

source: Fortunately, once you have managed to get your script to execute *some* code, you can easily send tracebacks to the web browser using the :mod:`cgitb` module. If you haven't done so already, just add the lines::
es: Afortunadamente, una vez que haya logrado que su script ejecute *algún* código, puede enviar fácilmente tracebacks al navegador web utilizando el módulo :mod:`cgitb`. Si aún no lo ha hecho, solo añada las líneas::

source: to the top of your script. Then try running it again; when a problem occurs, you should see a detailed report that will likely make apparent the cause of the crash.
es: al principio de su script. Luego intente ejecutarlo de nuevo; cuando un problema ocurra, debería ver un informe detallado que probablemente muestre la causa del error.

source: If you suspect that there may be a problem in importing the :mod:`cgitb` module, you can use an even more robust approach (which only uses built-in modules)::
es: Si sospecha que puede haber un problema al importar el módulo :mod:`cgitb`, puede usar un enfoque aún más robusto (que solo usa módulos integrados)::

source: This relies on the Python interpreter to print the traceback. The content type of the output is set to plain text, which disables all HTML processing. If your script works, the raw HTML will be displayed by your client. If it raises an exception, most likely after the first two lines have been printed, a traceback will be displayed. Because no HTML interpretation is going on, the traceback will be readable.
es: Esto se basa en el intérprete de Python para imprimir el traceback. El tipo de contenido de la salida se establece en texto plano, lo que deshabilita todo el procesamiento HTML. Si el script funciona, el cliente mostrará el código HTML sin formato. Si lanza una excepción, lo más probable es que después que se hayan impreso las dos primeras líneas, se mostrará un traceback. Dado que no se está realizando ninguna interpretación HTML, el traceback será legible.

source: Common problems and solutions
es: Problemas comunes y soluciones

source: Most HTTP servers buffer the output from CGI scripts until the script is completed. This means that it is not possible to display a progress report on the client's display while the script is running.
es: La mayoría de servidores HTTP almacenan en búfer la salida de los scripts CGI hasta que el script esté completado. Esto significa que no es posible mostrar un reporte del progreso en la parte del cliente mientras que el script se esté ejecutando.

source: Check the installation instructions above.
es: Compruebe las instrucciones de instalación anteriores.

source: Check the HTTP server's log files. (``tail -f logfile`` in a separate window may be useful!)
es: Verifique los archivos de registro (logs) del servidor HTTP. (¡Usar ``tail -f logfile`` en una ventana separada puede ser útil!)

source: Always check a script for syntax errors first, by doing something like ``python script.py``.
es: Siempre verifique un script para encontrar errores de sintaxis primero, haciendo algo como ``python script.py``.

source: If your script does not have any syntax errors, try adding ``import cgitb; cgitb.enable()`` to the top of the script.
es: Si su script no tiene ningún error sintáctico, pruebe añadiendo ``import cgitb; cgitb.enable()`` en la parte superior del script.

source: When invoking external programs, make sure they can be found. Usually, this means using absolute path names --- :envvar:`PATH` is usually not set to a very useful value in a CGI script.
es: Cuando se invoquen programas externos, asegúrese de que pueden ser encontrados. Generalmente esto significa usar nombres de ruta absolutos --- :envvar:`PATH` generalmente no se establece en un valor útil en un script CGI.

source: When reading or writing external files, make sure they can be read or written by the userid under which your CGI script will be running: this is typically the userid under which the web server is running, or some explicitly specified userid for a web server's ``suexec`` feature.
es: Al leer o escribir archivos externos, asegúrese de que puedan ser leídas o escritas por el userid por el que su script CGI se va a ejecutar: es típico que esto sea el userid bajo el que el servidor web se está ejecutando, o algún userid especificado explícitamente por la función ``suexec`` del servidor web.

source: Don't try to give a CGI script a set-uid mode. This doesn't work on most systems, and is a security liability as well.
es: No intente darle un modo set-uid a un script CGI. Esto no funciona en la mayoría de sistemas, además de ser un riesgo de seguridad.

source: Footnotes
es: Notas al pie

source: Note that some recent versions of the HTML specification do state what order the field values should be supplied in, but knowing whether a request was received from a conforming browser, or even from a browser at all, is tedious and error-prone.
es: Tenga en cuenta que algunas versiones recientes de las especificaciones de HTML establecen en qué orden se deben suministrar los valores de campo, pero saber si se recibió una solicitud de un navegador adaptado, o incluso desde un navegador siquiera, es tedioso y propenso a errores.

source: Common Gateway Interface
es: :mod:`cgi` --- Soporte de Interfaz de Entrada Común (CGI)
