Repository: python/python-docs-es
Catalog: library/cmath.po
Languages: es_ar

source: :mod:`cmath` --- Mathematical functions for complex numbers
es_ar: :mod:`cmath` -- Función matemática para números complejos

source: Conversions to and from polar coordinates
es_ar: Conversión a y desde coordenadas polares

source: A Python complex number ``z`` is stored internally using *rectangular* or *Cartesian* coordinates. It is completely determined by its *real part* ``z.real`` and its *imaginary part* ``z.imag``. In other words::
es_ar: Un numero complejo de Python ``z`` se almacena internamente usando coordenadas *rectangulares* o *cartesianas*. Esta determinado completamente por su *parte real* ``z.real`` y su *parte imaginaria* ``z.imag``. Dicho de otra forma::

source: *Polar coordinates* give an alternative way to represent a complex number. In polar coordinates, a complex number *z* is defined by the modulus *r* and the phase angle *phi*. The modulus *r* is the distance from *z* to the origin, while the phase *phi* is the counterclockwise angle, measured in radians, from the positive x-axis to the line segment that joins the origin to *z*.
es_ar: *Las coordenadas polares* dan una alternativa a la representación de números complejos. En las coordenadas polares, un número complejo *z* se define por los módulos *r* y el ángulo de fase *phi*. El módulo *r* es la distancia desde *z* hasta el origen, mientras que la fase *phi* es el ángulo que va en contra de las agujas del reloj, medido en radianes, desde el eje positivo de las X hasta el segmento de linea que une el origen con *z*.

source: The following functions can be used to convert from the native rectangular coordinates to polar coordinates and back.
es_ar: Las siguientes funciones pueden ser usadas para convertir desde coordenadas rectangulares nativas hasta coordenadas polares y viceversa.

source: The modulus (absolute value) of a complex number *x* can be computed using the built-in :func:`abs` function. There is no separate :mod:`cmath` module function for this operation.
es_ar: El módulo (valor absoluto) de un número complejo *x* puede ser calculado usado la función predeterminada :func:`abs`. No existe otra función aparte del módulo :mod:`cmath` para esta operación.

source: Return the representation of *x* in polar coordinates. Returns a pair ``(r, phi)`` where *r* is the modulus of *x* and phi is the phase of *x*. ``polar(x)`` is equivalent to ``(abs(x), phase(x))``.
es_ar: Retorna la representación de *x* en coordenadas polares. Retorna un par ``(r, phi)`` donde *r* es el módulo de *x* y phi es la fase de *x*. ``polar(x)`` es equivalente a ``(abs(x), phase(x))``.

source: Return the complex number *x* with polar coordinates *r* and *phi*. Equivalent to ``r * (math.cos(phi) + math.sin(phi)*1j)``.
es_ar: Retorna el número complejo *x* con coordenadas polares *r* y *phi*. Esto es equivalente a ``r*(math.cos(phi) + math.sin(phi)*1j)``.

source: Power and logarithmic functions
es_ar: Funciones logarítmicas y de potencias

source: Return *e* raised to the power *x*, where *e* is the base of natural logarithms.
es_ar: Retorna *e* elevado a la potencia de *x*, donde *e* es la base de los logaritmos naturales.

source: Return the base-10 logarithm of *x*. This has the same branch cut as :func:`log`.
es_ar: Retorna el logaritmo en base de 10 de *x*. Tiene el mismo tramo que :func:`log`.

source: Return the square root of *x*. This has the same branch cut as :func:`log`.
es_ar: Retorna la raíz cuadrada de *x*. Tiene el mismo tramo que :func:`log`.

source: Trigonometric functions
es_ar: Funciones trigonométricas

source: Return the arc sine of *x*. This has the same branch cuts as :func:`acos`.
es_ar: Retorna el arcoseno de *x*. Este tiene los mismos tramos que :func:`acos`.

source: Return the cosine of *x*.
es_ar: Retorna el coseno de *x*.

source: Return the sine of *x*.
es_ar: Retorna el seno de *x*.

source: Return the tangent of *x*.
es_ar: Retorna la tangente de *x*.

source: Hyperbolic functions
es_ar: Funciones hiperbólicas

source: Return the hyperbolic cosine of *x*.
es_ar: Retorna el coseno hiperbólico de *x*.

source: Return the hyperbolic sine of *x*.
es_ar: Retorna el seno hiperbólico de *x*.

source: Return the hyperbolic tangent of *x*.
es_ar: Retorna la tangente hiperbólica de *x*.

source: Classification functions
es_ar: Funciones de clasificación

source: Return ``True`` if both the real and imaginary parts of *x* are finite, and ``False`` otherwise.
es_ar: Retorna ``True`` si tanto la parte imaginaria como real de *x* son finitas, y ``False`` en cualquier otro caso.

source: Return ``True`` if either the real or the imaginary part of *x* is an infinity, and ``False`` otherwise.
es_ar: Retorna ``True`` si la parte real o la imaginaria de *x* es un infinito, y ``False`` en el caso contrario.

source: Return ``True`` if either the real or the imaginary part of *x* is a NaN, and ``False`` otherwise.
es_ar: Retorna ``True`` tanto si la parte real o imaginaria de *x* es NaN, y ``Falso`` en cualquier otro caso.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
es_ar: Retorna ``True`` si los valores *a* y *b* son cercanos el uno al otro y ``Falso`` de otro modo.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
es_ar: Que dos valores sean o no considerados como cercanos es determinado de acuerdo al valor absoluto y las tolerancias relativas.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
es_ar: *rel_tol* es la tolerancia relativa -- es el máximo valor permitido de la resta entre *a* y *b*, relativo al valor absoluto más grande de *a* o *b*. Por ejemplo, para fijar una tolerancia del 5%, usar ``rel_tol=0.05``. El valor de tolerancia por defecto es ``1e-09``, lo que asegura que los dos valores son los mismos en aproximadamente 9 dígitos decimales. *rel_tol* debe ser mayor que cero.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
es_ar: *abs_tol* es la tolerancia mínima absoluta -- útil a la hora de hacer comparaciones cercanas al cero. *abs_tol* debe ser al menos cero.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
es_ar: Si no ocurren errores, el resultado será: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
es_ar: Los valores especiales IEEE 754 de ``NaN``, ``inf`` y ``-inf`` serán manejados de acuerdo al estándar de IEEE. Especialmente, ``NaN`` no se considera cercano a ningún otro valor, incluido ``NaN``. ``inf`` y ``-inf`` solo son considerados cercanos a sí mismos.

source: :pep:`485` -- A function for testing approximate equality
es_ar: :pep:`485` -- Una función para probar igualdad aproximada.

source: Constants
es_ar: Constantes

source: The mathematical constant *π*, as a float.
es_ar: La constante matemática *π*, como número de coma flotante.

source: The mathematical constant *e*, as a float.
es_ar: La constante matemática *e*, como número de coma flotante.

source: The mathematical constant *τ*, as a float.
es_ar: La constante matemática *τ*, como número de coma flotante.

source: Floating-point positive infinity. Equivalent to ``float('inf')``.
es_ar: Números de coma flotante de +infinito. Equivalente a ``float('inf')``.

source: Complex number with zero real part and positive infinity imaginary part. Equivalent to ``complex(0.0, float('inf'))``.
es_ar: Números complejos con la parte real cero y números positivos infinitos como la parte imaginaria. Equivalente a ``complex(0.0, float('inf'))``.

source: A floating-point "not a number" (NaN) value. Equivalent to ``float('nan')``.
es_ar: El valor del número de coma flotante "not a number" (NaN) . Equivalente a ``float('nan')``.

source: Complex number with zero real part and NaN imaginary part. Equivalent to ``complex(0.0, float('nan'))``.
es_ar: Números complejos con parte real cero y como parte imaginaria NaN. Equivalente a ``complex(0.0, float('nan'))``.

source: Note that the selection of functions is similar, but not identical, to that in module :mod:`math`. The reason for having two modules is that some users aren't interested in complex numbers, and perhaps don't even know what they are. They would rather have ``math.sqrt(-1)`` raise an exception than return a complex number. Also note that the functions defined in :mod:`cmath` always return a complex number, even if the answer can be expressed as a real number (in which case the complex number has an imaginary part of zero).
es_ar: Nótese que la selección de funciones es similar, pero no idéntica, a la del módulo :mod:`math`. El motivo de tener dos módulos se halla en que algunos usuarios no se encuentran interesados en números complejos, y quizás ni siquiera sepan que son. Preferirían que ``math.sqrt(-1)`` lance una excepción a que retorne un número complejo. Además fíjese que las funciones definidas en :mod:`cmath` siempre retornan un número complejo, incluso si la respuesta puede ser expresada como un número real (en cuyo caso el número complejo tiene una parte imaginaria de cero).

source: A note on branch cuts: They are curves along which the given function fails to be continuous. They are a necessary feature of many complex functions. It is assumed that if you need to compute with complex functions, you will understand about branch cuts. Consult almost any (not too elementary) book on complex variables for enlightenment. For information of the proper choice of branch cuts for numerical purposes, a good reference should be the following:
es_ar: Un apunte en los tramos: Se tratan de curvas en las cuales las funciones fallan a ser continua. Son un complemento necesario de muchas funciones complejas. Se asume que si se necesitan cálculos con funciones complejas, usted entenderá sobre tramos. Consulte casi cualquier(no muy elemental) libro sobre variables complejas para saber más. Para más información en la correcta elección de los tramos para propósitos numéricos, se recomienda la siguiente bibliografía:

source: Kahan, W: Branch cuts for complex elementary functions; or, Much ado about nothing's sign bit. In Iserles, A., and Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165--211.
es_ar: *Kahan, W: Branch cuts for complex elementary functions; o, Much ado about nothing's sign bit. En Iserles, A., and Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165--211*.
