Repository: python/python-docs-es
Catalog: library/codeop.po
Languages: es

source: :mod:`codeop` --- Compile Python code
es: :mod:`codeop` --- Compila código Python

source: **Source code:** :source:`Lib/codeop.py`
es: **Código fuente:** :source:`Lib/codeop.py`

source: The :mod:`codeop` module provides utilities upon which the Python read-eval-print loop can be emulated, as is done in the :mod:`code` module. As a result, you probably don't want to use the module directly; if you want to include such a loop in your program you probably want to use the :mod:`code` module instead.
es: El módulo :mod:`codeop` proporciona herramientas para emular el bucle principal del intérprete de Python (también conocido como read-eval-print), tal como se hace en el módulo :mod:`code`. Por lo tanto, este módulo no está diseñado para utilizarlo directamente; si desea incluir un ciclo de este tipo en su programa, probablemente es mejor utilizar el módulo :mod:`code` en su lugar.

source: There are two parts to this job:
es: Esta actividad consta de dos partes:

source: Being able to tell if a line of input completes a Python statement: in short, telling whether to print '``>>>``' or '``...``' next.
es: Ser capaz de identificar si una línea de entrada completa una sentencia de Python: en resumen, decir si se debe imprimir a continuación '``>>>``' o '``...``'.

source: Remembering which future statements the user has entered, so subsequent input can be compiled with these in effect.
es: Recordar qué declaraciones futuras ha ingresado el usuario, para que la entrada posterior puedan ser compiladas con estas en efecto.

source: The :mod:`codeop` module provides a way of doing each of these things, and a way of doing them both.
es: El módulo :mod:`codeop` proporciona formas de realizar estas dos partes, tanto de forma independiente, como en conjunto.

source: To do just the former:
es: Para hacer lo anterior:

source: Tries to compile *source*, which should be a string of Python code and return a code object if *source* is valid Python code. In that case, the filename attribute of the code object will be *filename*, which defaults to ``'<input>'``. Returns ``None`` if *source* is *not* valid Python code, but is a prefix of valid Python code.
es: Intenta compilar *source*, que debe ser una cadena de caracteres de código Python y retorna un objeto si *source* es código Python válido. En este caso, el atributo del nombre del archivo del objeto va a ser *filename*, el cuál por defecto es ``'<input>'``. Retorna ``None`` si *source* no es código Python válido, pero es un prefijo de código Python válido.

source: If there is a problem with *source*, an exception will be raised. :exc:`SyntaxError` is raised if there is invalid Python syntax, and :exc:`OverflowError` or :exc:`ValueError` if there is an invalid literal.
es: Si hay un problema con *source*, se lanzará una excepción. :exc:`SyntaxError` se lanza si hay una sintaxis de Python no válida, y :exc:`OverflowError` o :exc:`ValueError` si hay un literal no válido.

source: The *symbol* argument determines whether *source* is compiled as a statement (``'single'``, the default), as a sequence of :term:`statement` (``'exec'``) or as an :term:`expression` (``'eval'``). Any other value will cause :exc:`ValueError` to be raised.
es: El argumento *symbol* determina si *source* se compila como una declaración (``'single'``, el valor predeterminado), como una secuencia de :term:`statement` (``'exec'``) o como un :term:`expression` (``'eval'``). Cualquier otro valor hará que se lance :exc:`ValueError`.

source: It is possible (but not likely) that the parser stops parsing with a successful outcome before reaching the end of the source; in this case, trailing symbols may be ignored instead of causing an error. For example, a backslash followed by two newlines may be followed by arbitrary garbage. This will be fixed once the API for the parser is better.
es: Es posible (pero no probable) que el analizador deje de analizar con un resultado exitoso antes de llegar al final de la fuente; en este caso, los símbolos finales pueden ignorarse en lugar de provocar un error. Por ejemplo, una barra invertida seguida de dos nuevas líneas puede ir seguida de basura arbitraria. Esto se solucionará una vez que la API para el analizador sea mejor.

source: Instances of this class have :meth:`~object.__call__` methods identical in signature to the built-in function :func:`compile`, but with the difference that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
es: Las instancias de esta clase tienen métodos :meth:`~object.__call__` idénticos en firma a la función incorporada :func:`compile`, pero con la diferencia de que si la instancia compila el texto del programa que contiene una instrucción :mod:`__future__`, la instancia 'recuerda' y compila todos los textos de programa posteriores con la declaración en vigor.

source: Instances of this class have :meth:`~object.__call__` methods identical in signature to :func:`compile_command`; the difference is that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
es: Las instancias de esta clase tienen métodos :meth:`~object.__call__` idénticos en firma a :func:`compile_command`; la diferencia es que si la instancia compila un texto de programa que contiene una declaración :mod:`__future__`, la instancia 'recuerda' y compila todos los textos de programa posteriores con la declaración en vigor.
