Repository: python/python-docs-es
Catalog: library/compileall.po
Languages: es

source: :mod:`compileall` --- Byte-compile Python libraries
es: :mod:`compileall` --- Bibliotecas de Python de compilación de bytes

source: **Source code:** :source:`Lib/compileall.py`
es: **Código fuente:** :source:`Lib/compileall.py`

source: This module provides some utility functions to support installing Python libraries. These functions compile Python source files in a directory tree. This module can be used to create the cached byte-code files at library installation time, which makes them available for use even by users who don't have write permission to the library directories.
es: Este módulo proporciona algunas funciones de utilidad para admitir la instalación de bibliotecas Python. Estas funciones compilan archivos fuente de Python en un árbol de directorios. Este módulo se puede usar para crear los archivos de código de bytes almacenados en caché en el momento de la instalación de la biblioteca, que los hace disponibles para su uso incluso por usuarios que no tienen permiso de escritura en los directorios de la biblioteca.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este modulo no funciona o no está disponible para plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para más información.

source: Command-line use
es: Uso de la línea de comandos

source: This module can work as a script (using :program:`python -m compileall`) to compile Python sources.
es: Este módulo puede funcionar como un *script* (usando :program:`python -m compileall`) para compilar fuentes de Python.

source: Positional arguments are files to compile or directories that contain source files, traversed recursively. If no argument is given, behave as if the command line was :samp:`-l {<directories from sys.path>}`.
es: Los argumentos posicionales son archivos para compilar o directorios que contienen archivos fuente, recorridos recursivamente. Si no se proporciona ningún argumento, se comporta como si la línea de comando fuera :samp:`-l {<directories from sys.path>}`.

source: Do not recurse into subdirectories, only compile source code files directly contained in the named or implied directories.
es: No se recurre en subdirectorios, solo compila archivos de código fuente contenidos en directorios nombrados o implícitos.

source: Force rebuild even if timestamps are up-to-date.
es: Forzar la reconstrucción incluso si las marcas de tiempo están actualizadas.

source: Do not print the list of files compiled. If passed once, error messages will still be printed. If passed twice (``-qq``), all output is suppressed.
es: No imprimir la lista de archivos compilados. Si se pasa una vez, los mensajes de error se imprimirán. Si se pasa dos veces, (``-qq``), se suprime toda la salida.

source: Directory prepended to the path to each file being compiled. This will appear in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
es: Directorio antepuesto a la ruta de cada archivo que está siendo compilado. Esto aparecerá en las devoluciones de tiempo de compilación, y también se compila en el archivo de código de bytes, donde se usará en las devoluciones de seguimiento y otros mensajes en casos donde el archivo fuente no existe al momento en que el archivo de código de bytes se ejecuta.

source: Remove (``-s``) or append (``-p``) the given prefix of paths recorded in the ``.pyc`` files. Cannot be combined with ``-d``.
es: Elimina (``-s``) o agrega (``-p``) el prefijo dado de rutas registradas en los archivos ``.pyc``. No se puede combinar con ``-d``.

source: regex is used to search the full path to each file considered for compilation, and if the regex produces a match, the file is skipped.
es: regex se usa para buscar la ruta completa a cada archivo considerado para compilación, y si la regex produce una coincidencia, se omite el archivo.

source: Read the file ``list`` and add each line that it contains to the list of files and directories to compile. If ``list`` is ``-``, read lines from ``stdin``.
es: Leer el archivo ``list`` y cada línea que contiene la lista de archivos y directorios a compilar. Si ``list`` es ``-``, leer líneas desde ``stdin``.

source: Write the byte-code files to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
es: Escribir los archivos de código de byte en las locaciones y nombres de herencia, que pueden sobreescribir los archivos de código de bytes creado para otra versión de Python. El comportamiento por defecto es escribir archivos en sus locaciones y nombres :pep:`3147`, lo cual permite que archivos de código de byte de versiones múltiples de Python coexistan.

source: Control the maximum recursion level for subdirectories. If this is given, then ``-l`` option will not be taken into account. :program:`python -m compileall <directory> -r 0` is equivalent to :program:`python -m compileall <directory> -l`.
es: Controlar el nivel máximo de recurrencia para subdirectorios. Si esto está dado, la opción ``-l`` no se tendrá en cuenta. :program:`python -m compileall <directory> -r 0` es equivalente a :program:`python -m compileall <directory> -l`.

source: Use *N* workers to compile the files within the given directory. If ``0`` is used, then the result of :func:`os.cpu_count()` will be used.
es: Usar *workers* *N* para compilar los archivos dentro del directorio dado. Si ```0`` se usa, entonces se usa el resultado de :func:`os.cpu_count()`.

source: Control how the generated byte-code files are invalidated at runtime. The ``timestamp`` value, means that ``.pyc`` files with the source timestamp and size embedded will be generated. The ``checked-hash`` and ``unchecked-hash`` values cause hash-based pycs to be generated. Hash-based pycs embed a hash of the source file contents rather than a timestamp. See :ref:`pyc-invalidation` for more information on how Python validates bytecode cache files at runtime. The default is ``timestamp`` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is not set, and ``checked-hash`` if the ``SOURCE_DATE_EPOCH`` environment variable is set.
es: Controlar cómo los archivos de código de byte generados se invalidan al momento de ejecución. El valor ``timestamp`` significa que se generarán los archivos ``.pyc`` con la marca de tiempo fuente y el tamaño insertados. Los valores ``checked-hash`` y ``unchecked-hash`` generan *pycs* basados en hash. Los *pycs* basados en hash del archivo insertan un hash de los contenidos del archivo fuente, en lugar de una marca de tiempo. Véase :ref:`pyc-invalidation` para mayor información sobre cómo Python valida archivos de cache de código de bytes. El valor por defecto es ``timestamp`` si la variable de entorno :envvar:`SOURCE_DATE_EPOCH` no está definida, y ``checked-hash`` si la variable de entorno ``SOURCE_DATE_EPOCH`` está definida.

source: Compile with the given optimization level. May be used multiple times to compile for multiple levels at a time (for example, ``compileall -o 1 -o 2``).
es: Compila con el nivel de optimización dado. Puede usarse varias veces para compilar varios niveles a la vez (por ejemplo, ``compileall -o 1 -o 2``).

source: Ignore symlinks pointing outside the given directory.
es: Ignora los enlaces simbólicos que apuntan fuera del directorio dado.

source: If two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
es: Si dos archivos ``.pyc`` con diferente nivel de optimización tienen el mismo contenido, use enlaces físicos para consolidar los archivos duplicados.

source: Added the ``-i``, ``-b`` and ``-h`` options.
es: Se agregaron las opciones ``-i``, ``-b`` y ``-h``.

source: Added the ``-j``, ``-r``, and ``-qq`` options. ``-q`` option was changed to a multilevel value. ``-b`` will always produce a byte-code file ending in ``.pyc``, never ``.pyo``.
es: Se agregaron las opciones ``-j``, ``-r``, and ``-qq``. La opción ``-q`` se cambió a un valor multinivel. ``-b`` siempre producirá un archivo de código de byte que termina en ``.pyc``, nunca ``.pyo``.

source: Added the ``--invalidation-mode`` option.
es: Se agregó la opción ``--invalidation-mode``.

source: Added the ``-s``, ``-p``, ``-e`` and ``--hardlink-dupes`` options. Raised the default recursion limit from 10 to :py:func:`sys.getrecursionlimit()`. Added the possibility to specify the ``-o`` option multiple times.
es: Se agregaron las opciones ``-s``, ``-p``, ``-e`` y ``--hardlink-dupes``. Se elevó el límite de recursividad predeterminado de 10 a :py:func:`sys.getrecursionlimit()`. Se agregó la posibilidad de especificar la opción ``-o`` varias veces.

source: There is no command-line option to control the optimization level used by the :func:`compile` function, because the Python interpreter itself already provides the option: :program:`python -O -m compileall`.
es: No hay opción de línea de comando para controlar el nivel de optimización que usa la función :func:`compile` porque el intérprete de Python en sí mismo ya proporciona la opción: :program:`python -O -m compileall`.

source: Similarly, the :func:`compile` function respects the :data:`sys.pycache_prefix` setting. The generated bytecode cache will only be useful if :func:`compile` is run with the same :data:`sys.pycache_prefix` (if any) that will be used at runtime.
es: De manera similar, la función :func:`compile` respeta la configuración :data:`sys.pycache_prefix`. El cache de código de byte generado sólo será útil si :func:`compile` se ejecuta con el mismo :data:`sys.pycache_prefix` (si es que existe alguno) que se utilizará en el momento de ejecución.

source: Public functions
es: Funciones públicas

source: Recursively descend the directory tree named by *dir*, compiling all :file:`.py` files along the way. Return a true value if all the files compiled successfully, and a false value otherwise.
es: Descender recursivamente el árbol de directorio invocado por *dir*, compilando todos los archivos :file:`.py` que encuentra en el camino. Devolver un valor verdadero si todos los archivos se compilan exitosamente, y un valor falso en el caso contrario.

source: The *maxlevels* parameter is used to limit the depth of the recursion; it defaults to ``sys.getrecursionlimit()``.
es: El parámetro *maxlevels* se usar para limitar la profundidad de la recursión; toma como valor predeterminado ``sys.getrecursionlimit()``.

source: If *ddir* is given, it is prepended to the path to each file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
es: Si *ddir* está dado, se antepone a la ruta de cada archivo que se compila para usar en los rastreos de tiempo de compilación, y también se compilar en el archivo código de byte, donde se usarán en trazas y otros mensajes en casos donde el archivo fuente no existe en el momento cuando el archivo de código de byte se ejecuta.

source: If *force* is true, modules are re-compiled even if the timestamps are up to date.
es: Si *force* es verdadero, los módulos se re-compilan aun cuando las marcas de tiempo están actualizadas.

source: If *rx* is given, its ``search`` method is called on the complete path to each file considered for compilation, and if it returns a true value, the file is skipped. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
es: Si se proporciona *rx*, se llama a su método ``search`` en la ruta completa a cada archivo considerado para compilación, y si retorna un valor verdadero, se omite el archivo. Esto se puede usar para excluir archivos que coincidan con una expresión regular, dada como un objeto :ref:`re.Pattern <re-objects>`.

source: If *quiet* is ``False`` or ``0`` (the default), the filenames and other information are printed to standard out. Set to ``1``, only errors are printed. Set to ``2``, all output is suppressed.
es: Si *quiet* es ``False`` o ``0`` (el valor predeterminado), los nombres de archivo y otra información se imprimen en salida estándar. Si se configura en ``1``, solo se imprimen los errores. Si se configura en ``2``, se suprime toda la salida.

source: If *legacy* is true, byte-code files are written to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
es: Si *legacy* es verdadero, los archivos de código de byte se escriben en sus locaciones y nombres de herencia, que pueden sobreescribir los archivos de código de byte creado por otra versión de Python. El comportamiento por defecto es escribir archivos en sus locaciones y nombres :pep:`3147`, lo cual permite que archivos de código de byte de múltiples versiones de Python coexistan.

source: *optimize* specifies the optimization level for the compiler. It is passed to the built-in :func:`compile` function. Accepts also a sequence of optimization levels which lead to multiple compilations of one :file:`.py` file in one call.
es: *optimize* especifica el nivel de optimización para el compilador. Se pasa a una función incorporada :func:`compile`. Acepta también una secuencia de niveles de optimización que conducen a múltiples compilaciones de un archivo :file:`.py` en una llamada.

source: The argument *workers* specifies how many workers are used to compile files in parallel. The default is to not use multiple workers. If the platform can't use multiple workers and *workers* argument is given, then sequential compilation will be used as a fallback. If *workers* is 0, the number of cores in the system is used. If *workers* is lower than ``0``, a :exc:`ValueError` will be raised.
es: El argumento *workers* especifica cuántos workers se usan para compilar archivos en paralelo. El comportamiento por defecto es no usar múltiples workers. Si la plataforma no puede usar workers múltiples y el argumento *workers* está dado, la compilación secuencial se usará como *fallback*. Si *workers* es 0, el número de núcleos se usa en el sistema. Si *workers* es menor que ``0``, se genera un :exc:`ValueError`.

source: *invalidation_mode* should be a member of the :class:`py_compile.PycInvalidationMode` enum and controls how the generated pycs are invalidated at runtime.
es: *invalidation_mode* debería ser un miembro de la enumeración :class:`py_compile.PycInvalidationMode` y controla cómo se invalidan los pycs generados en el momento de ejecución.

source: The *stripdir*, *prependdir* and *limit_sl_dest* arguments correspond to the ``-s``, ``-p`` and ``-e`` options described above. They may be specified as ``str`` or :py:class:`os.PathLike`.
es: Los argumentos *stripdir*, *prependdir* y *limit_sl_dest* corresponden a las opciones ``-s``, ``-p`` y ``-e`` descritas anteriormente. Pueden especificarse como ``str``, o :py:class:`os.PathLike`.

source: If *hardlink_dupes* is true and two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
es: Si *hardlink_dupes* es verdadero y dos archivos ``.pyc`` con diferente nivel de optimización tienen el mismo contenido, use enlaces físicos para consolidar los archivos duplicados.

source: Added the *legacy* and *optimize* parameter.
es: Se agregó el parámetro *legacy* y *optimize*.

source: Added the *workers* parameter.
es: Se agregó el parámetro *workers*.

source: *quiet* parameter was changed to a multilevel value.
es: El parámetro *quiet* se cambió a un valor multinivel.

source: The *legacy* parameter only writes out ``.pyc`` files, not ``.pyo`` files no matter what the value of *optimize* is.
es: El parámetro *legacy* solo escribe archivos ``.pyc``, no archivos ``.pyo``, no import cuál sea el valor de *optimize*.

source: Accepts a :term:`path-like object`.
es: Acepta un :term:`path-like object`.

source: The *invalidation_mode* parameter was added.
es: Se agregó el parámetro *invalidation_mode*.

source: The *invalidation_mode* parameter's default value is updated to None.
es: El valor predeterminado del parámetro *invalidation_mode* se actualiza a *None*.

source: Setting *workers* to 0 now chooses the optimal number of cores.
es: Configurar *workers* a 0 ahora elige el número óptimo de núcleos.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments. Default value of *maxlevels* was changed from ``10`` to ``sys.getrecursionlimit()``
es: Se agregaron los argumentos *stripdir*, *prependdir*, *limit_sl_dest* y *hardlink_dupes*. El valor predeterminado de *maxlevels* se cambió de ``10`` a ``sys.getrecursionlimit()``

source: Compile the file with path *fullname*. Return a true value if the file compiled successfully, and a false value otherwise.
es: Compilar el archivo con ruta *fullname*. Retorna un valor verdadero si el archivo se compila exitosamente, y uno falso en el caso contrario.

source: If *ddir* is given, it is prepended to the path to the file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
es: Si *ddir* está dado, se antepone a la ruta del archivo que está siendo compilado para su uso en las trazas de tiempo de compilación, y también se compilar en el archivo de código de bytes, donde será utilizado en trazas y otros mensajes en casos donde el archivo fuente no existe en el momento en que el archivo de código de bytes es ejecutado.

source: If *rx* is given, its ``search`` method is passed the full path name to the file being compiled, and if it returns a true value, the file is not compiled and ``True`` is returned. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
es: Si se proporciona *rx*, a su método ``search`` se le pasa el nombre de ruta completo al archivo que se está compilando, y si retorna un valor verdadero, el archivo no se compila y se retorna ``True``. Esto se puede usar para excluir archivos que coincidan con una expresión regular, dada como un objeto :ref:`re.Pattern <re-objects>`.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments.
es: Se agregaron los argumentos *stripdir*, *prependdir*, *limit_sl_dest* y *hardlink_dupes*.

source: Byte-compile all the :file:`.py` files found along ``sys.path``. Return a true value if all the files compiled successfully, and a false value otherwise.
es: Compila en bytes todos los archivos :file:`.py` a lo largo de ``sys.path``. Retorna un valor verdadero si todos los archivos se compilan exitosamente, y uno falso en el caso contrario.

source: If *skip_curdir* is true (the default), the current directory is not included in the search. All other parameters are passed to the :func:`compile_dir` function. Note that unlike the other compile functions, ``maxlevels`` defaults to ``0``.
es: Si *skip_curdir* es verdadero (el valor predeterminado), el directorio actual no está incluido en la búsqueda. Todos los otros parámetros se pasan a la función :func:`compile_dir`. Nótese que, al contrario de las otras funciones de compilación, ``maxlevels`` tomar ``0`` como valor predeterminado.

source: To force a recompile of all the :file:`.py` files in the :file:`Lib/` subdirectory and all its subdirectories::
es: Para forzar la re-compilación del los archivos :file:`.py` en el subdirectorio :file:`Lib/` y todos sus subdirectorios::

source: Module :mod:`py_compile`
es: Módulo :mod:`py_compile`

source: Byte-compile a single source file.
es: Compilación byte de un solo archivo fuente.
