Repository: python/python-docs-es
Catalog: library/configparser.po
Languages: es_pe

source: :mod:`configparser` --- Configuration file parser
es_pe: :mod:`configparser` --- *Parser* para archivos de configuración

source: **Source code:** :source:`Lib/configparser.py`
es_pe: **Código fuente:** :source:`Lib/configparser.py`

source: This module provides the :class:`ConfigParser` class which implements a basic configuration language which provides a structure similar to what's found in Microsoft Windows INI files. You can use this to write Python programs which can be customized by end users easily.
es_pe: Este módulo provee la clase :class:`ConfigParser`, la cual implementa un lenguaje básico de configuración que proporciona una estructura similar a la encontrada en los archivos INI de Microsoft Windows. Puedes utilizarla para escribir programas Python que los usuarios finales puedan personalizar con facilidad.

source: This library does *not* interpret or write the value-type prefixes used in the Windows Registry extended version of INI syntax.
es_pe: Esta biblioteca *no* interpreta o escribe los prefijos valor-tipo usados en la versión extendida de la sintaxis INI, utilizada en el registro de Windows.

source: Module :mod:`tomllib`
es_pe: Módulo :mod:`tomllib`

source: TOML is a well-specified format for application configuration files. It is specifically designed to be an improved version of INI.
es_pe: TOML es un formato bien-especificado para archivos de configuración de aplicaciones. Está específicamente diseñado para ser una versión mejorada de INI.

source: Module :mod:`shlex`
es_pe: Módulo :mod:`shlex`

source: Support for creating Unix shell-like mini-languages which can also be used for application configuration files.
es_pe: Soporta la creación de un mini-lenguaje parecido a shell de Unix, que puede utilizarse para archivos de configuración de aplicaciones.

source: Module :mod:`json`
es_pe: Módulo :mod:`json`

source: The ``json`` module implements a subset of JavaScript syntax which is sometimes used for configuration, but does not support comments.
es_pe: El módulo ``json`` implementa un subconjunto de la sintaxis de JavaScript, que también puede utilizarse para configuración, pero no soporta comentarios.

source: Quick Start
es_pe: Inicio Rápido

source: Let's take a very basic configuration file that looks like this:
es_pe: Tomemos un archivo de configuración muy básico, el cual luce así:

source: The structure of INI files is described `in the following section <#supported-ini-file-structure>`_. Essentially, the file consists of sections, each of which contains keys with values. :mod:`configparser` classes can read and write such files. Let's start by creating the above configuration file programmatically.
es_pe: La estructura de los archivos INI es descrita `en la siguiente sección <#supported-ini-file-structure>`_. En esencia, el archivo consiste de secciones, cada una de las cuales contiene claves con valores. Las clases :mod:`configparser` pueden leer y escribir dichos archivos. Comencemos creando el anterior archivo de configuración de forma programática.

source: As you can see, we can treat a config parser much like a dictionary. There are differences, `outlined later <#mapping-protocol-access>`_, but the behavior is very close to what you would expect from a dictionary.
es_pe: Como puedes ver, podemos tratar al *config parser* como a un diccionario. Existen diferencias, `descritas posteriormente <#mapping-protocol-access>`_, pero su comportamiento es muy parecido al que esperarías de un diccionario.

source: Now that we have created and saved a configuration file, let's read it back and explore the data it holds.
es_pe: Ahora que hemos creado y guardado el archivo de configuración, vamos a releerlo y analizar los datos que contiene.

source: As we can see above, the API is pretty straightforward. The only bit of magic involves the ``DEFAULT`` section which provides default values for all other sections [1]_. Note also that keys in sections are case-insensitive and stored in lowercase [1]_.
es_pe: Como podemos apreciar, la API es muy clara. La única 'porción de magia' está en la sección ``DEFAULT``, la cual proporciona los valores por defecto para todas las demás secciones [1]_. Observe también que las claves de las secciones son insensibles a mayúsculas y minúsculas, pero se almacenan en minúscula [1]_.

source: It is possible to read several configurations into a single :class:`ConfigParser`, where the most recently added configuration has the highest priority. Any conflicting keys are taken from the more recent configuration while the previously existing keys are retained.
es_pe: Es posible leer varias configuraciones en un único :class:`ConfigParser`, siendo la configuración añadida más recientemente la que tendrá la prioridad más alta. Las claves que entren en conflicto se toman de la configuración más reciente mientras que las claves preexistentes se mantienen.

source: This behaviour is equivalent to a :meth:`ConfigParser.read` call with several files passed to the *filenames* parameter.
es_pe: Este comportamiento es equivalente a una llamada a :meth:`ConfigParser.read` pasando varios ficheros en el parámetro *filenames*.

source: Supported Datatypes
es_pe: Tipos de Datos Soportados

source: Config parsers do not guess datatypes of values in configuration files, always storing them internally as strings. This means that if you need other datatypes, you should convert on your own:
es_pe: Los *config parsers* no especulan respecto a los tipos de datos de los valores en los archivos de configuración, siempre los almacenan internamente como cadenas de caracteres. Esto significa que si necesitas otros tipos de datos, deberás hacer la conversión por ti mismo:

source: Since this task is so common, config parsers provide a range of handy getter methods to handle integers, floats and booleans. The last one is the most interesting because simply passing the value to ``bool()`` would do no good since ``bool('False')`` is still ``True``. This is why config parsers also provide :meth:`~ConfigParser.getboolean`. This method is case-insensitive and recognizes Boolean values from ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` and ``'1'``/``'0'`` [1]_. For example:
es_pe: Dado que esta tarea es muy común, los *config parsers* proporcionan una amplia variedad de útiles métodos de lectura (*getter*) que manejan enteros, números de punto flotante y booleanos. Este último es el más interesante, porque puede no ser correcto pasar simplemente el valor a ``bool()``, ya que ``bool('False')`` resultará en ``True``. Por esta razón los *config parsers* proporcionan también el método :meth:`~ConfigParser.getboolean`. Este método es insensible a mayúsculas y minúsculas, y reconoce como valores booleanos a los valores ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` and ``'1'``/``'0'`` [1]_. Por ejemplo:

source: Apart from :meth:`~ConfigParser.getboolean`, config parsers also provide equivalent :meth:`~ConfigParser.getint` and :meth:`~ConfigParser.getfloat` methods. You can register your own converters and customize the provided ones. [1]_
es_pe: Además de :meth:`~ConfigParser.getboolean`, los *config parsers* también proporcionan los métodos equivalentes :meth:`~ConfigParser.getint` y :meth:`~ConfigParser.getfloat`. Puedes registrar tus propios conversores, y personalizar los que se proporcionan. [1]_

source: Fallback Values
es_pe: Valores de contingencia

source: As with a dictionary, you can use a section's :meth:`get` method to provide fallback values:
es_pe: Similar a un diccionario, puedes utilizar el método :meth:`get` de una sección para especificar valores de contingencia (*fallback values*):

source: Please note that default values have precedence over fallback values. For instance, in our example the ``'CompressionLevel'`` key was specified only in the ``'DEFAULT'`` section. If we try to get it from the section ``'topsecret.server.example'``, we will always get the default, even if we specify a fallback:
es_pe: Por favor, fíjate que los valores por defecto tienen prioridad sobre los valores de contingencia (*fallback*). Así, en nuestro ejemplo, la clave ``'CompressionLevel'`` sólo fue especificada en la sección ``'DEFAULT'``. Si tratamos de obtener su valor de la sección ``'topsecret.server.example'``, obtendremos siempre el valor por defecto, incluso si especificamos un valor de contingencia:

source: One more thing to be aware of is that the parser-level :meth:`get` method provides a custom, more complex interface, maintained for backwards compatibility. When using this method, a fallback value can be provided via the ``fallback`` keyword-only argument:
es_pe: Otra cuestión que hay que tener en cuenta, es que el método a nivel analizador (*parser*) :meth:`get` proporciona una interfaz personalizada, más compleja, que se mantiene por compatibilidad con versiones anteriores. Cuando se utiliza este método, se puede proporcionar un valor de contingencia mediante el argumento de sólo-palabra clave (*keyword-only*) ``fallback``:

source: The same ``fallback`` argument can be used with the :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` and :meth:`~ConfigParser.getboolean` methods, for example:
es_pe: El mismo argumento ``fallback`` puede utilizarse con los métodos :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` y :meth:`~ConfigParser.getboolean`, por ejemplo:

source: Supported INI File Structure
es_pe: Estructura soportada para el archivo ini

source: A configuration file consists of sections, each led by a ``[section]`` header, followed by key/value entries separated by a specific string (``=`` or ``:`` by default [1]_). By default, section names are case sensitive but keys are not [1]_. Leading and trailing whitespace is removed from keys and values. Values can be omitted if the parser is configured to allow it [1]_, in which case the key/value delimiter may also be left out. Values can also span multiple lines, as long as they are indented deeper than the first line of the value. Depending on the parser's mode, blank lines may be treated as parts of multiline values or ignored.
es_pe: Un archivo de configuración consta de secciones, cada una iniciada por una cabecera ``[section]``, seguida por registros clave-valor separados por una cadena de caracteres específica (``=`` ó ``:`` por defecto [1]_). De forma predeterminada, los nombres de sección son sensibles a mayúsculas y minúsculas pero las claves no [1]_. Los espacios al inicio y final de las claves y valores son eliminados. Los valores pueden ser omitidos si el *parser* está configurado para permitirlo [1]_, en cuyo caso el delimitador del dato clave-valor puede ser omitido también. Los valores pueden ocupar varias líneas, siempre y cuando tengan una indentación mayor que la primera línea del valor. Dependiendo del modo del *parser*, las líneas en blanco pueden tratarse como parte de un valor multilínea o ser ignoradas.

source: By default, a valid section name can be any string that does not contain '\\n' or ']'. To change this, see :attr:`ConfigParser.SECTCRE`.
es_pe: De forma predeterminada, un nombre de sección válido puede ser cualquier cadena de texto que no contenga '\\n' or ']'. Para cambiar esto, consulte :attr:`ConfigParser.SECTCRE`.

source: Configuration files may include comments, prefixed by specific characters (``#`` and ``;`` by default [1]_). Comments may appear on their own on an otherwise empty line, possibly indented. [1]_
es_pe: Los archivos de configuración pueden incluir comentarios, con caracteres específicos como prefijos (``#`` y ``;`` por defecto [1]_). Los comentarios pueden ocupar su propia línea, posiblemente indentada. [1]_

source: For example:
es_pe: Por ejemplo:

source: Interpolation of values
es_pe: Interpolación de valores

source: On top of the core functionality, :class:`ConfigParser` supports interpolation. This means values can be preprocessed before returning them from ``get()`` calls.
es_pe: En el nivel superior de su funcionalidad central, :class:`ConfigParser` soporta la interpolación. Esto significa que los valores pueden ser preprocesados, antes de ser retornados por los llamados a ``get()``.

source: The default implementation used by :class:`ConfigParser`. It enables values to contain format strings which refer to other values in the same section, or values in the special default section [1]_. Additional default values can be provided on initialization.
es_pe: Es la implementación por defecto que utiliza :class:`ConfigParser`. Permite valores que contengan cadenas de formato, que hacen referencia a otros valores en la misma sección o a valores presentes en la sección especial *default* [1]_. Valores por defecto adicionales pueden ser proporcionados en la inicialización.

source: In the example above, :class:`ConfigParser` with *interpolation* set to ``BasicInterpolation()`` would resolve ``%(home_dir)s`` to the value of ``home_dir`` (``/Users`` in this case). ``%(my_dir)s`` in effect would resolve to ``/Users/lumberjack``. All interpolations are done on demand so keys used in the chain of references do not have to be specified in any specific order in the configuration file.
es_pe: En el ejemplo anterior, :class:`ConfigParser` con la *interpolación* establecida a ``BasicInterpolation()`` puede resolver ``%(home_dir)s`` al valor ``home_dir`` (``/Users`` en este caso). En efecto, ``%(my_dir)s`` podría resolverse como ``/Users/lumberjack``. Todas las interpolaciones son realizadas bajo demanda, de modo que las claves utilizadas en la cadena de referencias no requieren un orden específico en el archivo de configuración.

source: With ``interpolation`` set to ``None``, the parser would simply return ``%(my_dir)s/Pictures`` as the value of ``my_pictures`` and ``%(home_dir)s/lumberjack`` as the value of ``my_dir``.
es_pe: Con ``interpolation`` establecida al valor ``None``, el *parser* retornará simplemente ``%(my_dir)s/Pictures`` como el valor de ``my_pictures`` y ``%(home_dir)s/lumberjack`` como el valor de ``my_dir``.

source: An alternative handler for interpolation which implements a more advanced syntax, used for instance in ``zc.buildout``. Extended interpolation is using ``${section:option}`` to denote a value from a foreign section. Interpolation can span multiple levels. For convenience, if the ``section:`` part is omitted, interpolation defaults to the current section (and possibly the default values from the special section).
es_pe: Es un gestor alternativo para la interpolación, que implementa una sintaxis más avanzada; es utilizado, por ejemplo, en ``zc.buildout``. La interpolación es extendida al utilizar ``${section:option}``, a fin de especificar un valor que proviene de una sección externa. La interpolación puede cubrir múltiples niveles. Por conveniencia, si la parte ``section:`` es omitida, la interpolación utilizará la sección actual (y posiblemente los valores por defecto establecidos en la sección especial).

source: For example, the configuration specified above with basic interpolation, would look like this with extended interpolation:
es_pe: Por ejemplo, la configuración indicada anteriormente, con interpolación básica, luciría de la siguiente manera utilizando interpolación extendida:

source: Values from other sections can be fetched as well:
es_pe: También pueden buscarse valores en otras secciones:

source: Mapping Protocol Access
es_pe: Acceso por protocolo de mapeo

source: Mapping protocol access is a generic name for functionality that enables using custom objects as if they were dictionaries. In case of :mod:`configparser`, the mapping interface implementation is using the ``parser['section']['option']`` notation.
es_pe: El acceso por protocolo de mapeo es un nombre genérico asignado a la funcionalidad que permite el uso de objetos personalizados como si fuesen diccionarios. En el caso de :mod:`configparser`, la implementación de la interfaz de mapeo utiliza la notación ``parser['section']['option']``.

source: ``parser['section']`` in particular returns a proxy for the section's data in the parser. This means that the values are not copied but they are taken from the original parser on demand. What's even more important is that when values are changed on a section proxy, they are actually mutated in the original parser.
es_pe: En particular, ``parser['section']`` retorna un proxy para los datos de la sección en el *parser*. Esto significa que los valores no son copiados, sino que son tomados del *parser* original sobre la marcha.

source: :mod:`configparser` objects behave as close to actual dictionaries as possible. The mapping interface is complete and adheres to the :class:`~collections.abc.MutableMapping` ABC. However, there are a few differences that should be taken into account:
es_pe: Los objetos de :mod:`configparser` se comportan de forma tan similar a un diccionario como se puede. La interfaz de mapeo es completa y se ciñe a la :class:`~collections.abc.MutableMapping` ABC. Sin embargo, existen unas pequeñas diferencias que deben tomarse en cuenta:

source: By default, all keys in sections are accessible in a case-insensitive manner [1]_. E.g. ``for option in parser["section"]`` yields only ``optionxform``'ed option key names. This means lowercased keys by default. At the same time, for a section that holds the key ``'a'``, both expressions return ``True``::
es_pe: Por defecto, todas las claves de las secciones se pueden acceder de una forma insensible a mayúsculas y minúsculas [1]_. Ej. ``for option in parser["section"]`` entrega solamente nombres de claves de opción que han pasado por ``optionxform``. Esto significa, claves en minúscula por defecto. A la vez, para una sección que contiene la clave ``'a'``, ambas expresiones retornan ``True``::

source: All sections include ``DEFAULTSECT`` values as well which means that ``.clear()`` on a section may not leave the section visibly empty. This is because default values cannot be deleted from the section (because technically they are not there). If they are overridden in the section, deleting causes the default value to be visible again. Trying to delete a default value causes a :exc:`KeyError`.
es_pe: Todas las secciones también incluyen valores ``DEFAULTSECT``, lo que significa que ``.clear()`` en una sección puede no significar que esta quede vacía de forma visible. Ello debido a que los valores por defecto no pueden ser borrados de la sección (ya que técnicamente no están allí). Si fueron redefinidas en la sección, su borrado ocasiona que los valores por defecto sean visibles de nuevo. Cualquier intento de borrar un valor por defecto ocasiona una excepción :exc:`KeyError`.

source: ``DEFAULTSECT`` cannot be removed from the parser:
es_pe: ``DEFAULTSECT`` no puede ser eliminado del *parser*:

source: trying to delete it raises :exc:`ValueError`,
es_pe: el intento de borrarlo lanza una excepción :exc:`ValueError`,

source: ``parser.clear()`` leaves it intact,
es_pe: ``parser.clear()`` lo deja intacto,

source: ``parser.popitem()`` never returns it.
es_pe: ``parser.popitem()`` nunca lo retorna.

source: ``parser.get(section, option, **kwargs)`` - the second argument is **not** a fallback value. Note however that the section-level ``get()`` methods are compatible both with the mapping protocol and the classic configparser API.
es_pe: ``parser.get(section, option, **kwargs)`` - el segundo argumento **no** es un valor de contingencia. Observe, sin embargo, que los métodos ``get()`` a nivel de sección son compatibles tanto con el protocolo de mapeo como con la API clásica de *configparser*.

source: ``parser.items()`` is compatible with the mapping protocol (returns a list of *section_name*, *section_proxy* pairs including the DEFAULTSECT). However, this method can also be invoked with arguments: ``parser.items(section, raw, vars)``. The latter call returns a list of *option*, *value* pairs for a specified ``section``, with all interpolations expanded (unless ``raw=True`` is provided).
es_pe: ``parser.items()`` es compatible con el protocolo de mapeo (retorna una lista de pares *section_name*, *section_proxy* que estén incluidos en DEFAULTSECT). Sin embargo, este método también puede ser invocado con los argumentos: ``parser.items(section, raw, vars)``. Esta última llamada retorna una lista de pares *option*, *value* para una ``section`` específica, con todas las interpolaciones expandidas (a menos que se especifique ``raw=True``).

source: The mapping protocol is implemented on top of the existing legacy API so that subclasses overriding the original interface still should have mappings working as expected.
es_pe: El protocolo de mapeo se implementa en el nivel superior de la actual API heredada, de modo que esas subclases que sobre-escriben la interfaz original aún deberían hacer funcionar el mapeo como se esperaría.

source: Customizing Parser Behaviour
es_pe: Personalizando el comportamiento del parser

source: There are nearly as many INI format variants as there are applications using it. :mod:`configparser` goes a long way to provide support for the largest sensible set of INI styles available. The default functionality is mainly dictated by historical background and it's very likely that you will want to customize some of the features.
es_pe: Existen casi tantas variantes del formato INI como aplicaciones que lo usen. :mod:`configparser` llega muy lejos al proporcionar soporte al mayor conjunto sensible de estilos de INI disponibles. La funcionalidad predeterminada es impuesta principalmente por antecedentes históricos y es muy probable que quieras personalizar algunas de las funcionalidades.

source: The most common way to change the way a specific config parser works is to use the :meth:`__init__` options:
es_pe: La forma más común para modificar cómo funciona un *config parser* específico consiste en el uso de las opciones de :meth:`__init__`:

source: *defaults*, default value: ``None``
es_pe: *defaults*, valor por defecto: ``None``

source: This option accepts a dictionary of key-value pairs which will be initially put in the ``DEFAULT`` section. This makes for an elegant way to support concise configuration files that don't specify values which are the same as the documented default.
es_pe: Esta opción acepta un diccionario de pares clave-valor, que debe ser colocado inicialmente en la sección ``DEFAULT``. De este modo se obtiene una manera elegante de apoyar los archivos de configuración concisos, que no especifican valores que sean los mismos documentados por defecto.

source: Hint: if you want to specify default values for a specific section, use :meth:`read_dict` before you read the actual file.
es_pe: Consejo: si quieres especificar valores por defecto para una sección específica, usa :meth:`read_dict` antes de leer el archivo real.

source: *dict_type*, default value: :class:`dict`
es_pe: *dict_type*, valor por defecto: :class:`dict`

source: This option has a major impact on how the mapping protocol will behave and how the written configuration files look. With the standard dictionary, every section is stored in the order they were added to the parser. Same goes for options within sections.
es_pe: Esta opción tiene un gran impacto en cómo funcionará el protocolo de mapeo, y cómo lucirán los archivos de configuración a escribir. Con el diccionario estándar, cada sección se almacena en el orden en que se añadieron al *parser*. Lo mismo ocurre con las opciones dentro de las secciones.

source: An alternative dictionary type can be used for example to sort sections and options on write-back.
es_pe: Un tipo alternativo de diccionario puede ser utilizado, por ejemplo, para ordenar las secciones y opciones en un modo a posteriori (*write-back*).
