Repository: python/python-docs-es
Catalog: library/configparser.po
Languages: es_pe

source: The *converters* argument was added.
es_pe: Se agregó el argumento *converters*.

source: The *defaults* argument is read with :meth:`read_dict()`, providing consistent behavior across the parser: non-string keys and values are implicitly converted to strings.
es_pe: El argumento *defaults* es leído con :meth:`read_dict()`, proporcionando un comportamiento consistente en el *parser*: las claves y valores que no sean cadenas de caracteres son convertidas a tales.

source: The default *dict_type* is :class:`dict`, since it now preserves insertion order.
es_pe: El valor por defecto para *dict_type* es :class:`dict`, dado que este ahora preserva el orden de inserción.

source: Return a dictionary containing the instance-wide defaults.
es_pe: Retorna un diccionario que contiene los valores por defecto para toda la instancia.

source: Return a list of the sections available; the *default section* is not included in the list.
es_pe: Retorna una lista de las secciones disponibles; *default section* no se incluye en la lista.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. The name of the section must be a string; if not, :exc:`TypeError` is raised.
es_pe: Agrega una sección llamada *section* a la instancia. Si ya existe una sección con el nombre proporcionado, se genera la excepción :exc:`DuplicateSectionError`. Si se suministra el nombre *default section*, se genera la excepción :exc:`ValueError`. El nombre de la sección debe ser una cadena de caracteres, de lo contrario, se genera la excepción :exc:`TypeError`.

source: Non-string section names raise :exc:`TypeError`.
es_pe: Nombres de sección que no sean del tipo cadena de caracteres generan la excepción :exc:`TypeError`.

source: Indicates whether the named *section* is present in the configuration. The *default section* is not acknowledged.
es_pe: Indica si la sección de nombre *section* existe en la configuración. No se permite *default section*.

source: Return a list of options available in the specified *section*.
es_pe: Retorna una lista de opciones disponibles en la sección especificada.

source: If the given *section* exists, and contains the given *option*, return :const:`True`; otherwise return :const:`False`. If the specified *section* is :const:`None` or an empty string, DEFAULT is assumed.
es_pe: Si la sección indicada existe, y esta contiene las opción proporcionada, retorna :const:`True`; de lo contrario, retorna :const:`False`. Si la sección especificada es :const:`None` o una cadena de caracteres vacía, se asume DEFAULT.

source: Attempt to read and parse an iterable of filenames, returning a list of filenames which were successfully parsed.
es_pe: Intenta leer y analizar sintácticamente (*parse*) un iterable de nombres de archivos, retornando una lista de nombres de archivos que han sido analizados (*parsed*) con éxito.

source: If *filenames* is a string, a :class:`bytes` object or a :term:`path-like object`, it is treated as a single filename. If a file named in *filenames* cannot be opened, that file will be ignored. This is designed so that you can specify an iterable of potential configuration file locations (for example, the current directory, the user's home directory, and some system-wide directory), and all existing configuration files in the iterable will be read.
es_pe: Si *filenames* es una cadena de caracteres, un objeto :class:`bytes` o un :term:`path-like object`, es tratado como un simple nombre de archivo. Si un archivo mencionado en *filenames* no puede ser abierto, será ignorado. Está diseñado de forma que puedas especificar un iterable de potenciales ubicaciones para archivos de configuración (por ejemplo, el directorio actual, el directorio *home* del usuario, o algún directorio del sistema), y todos los archivos de configuración existentes serán leídos.

source: If none of the named files exist, the :class:`ConfigParser` instance will contain an empty dataset. An application which requires initial values to be loaded from a file should load the required file or files using :meth:`read_file` before calling :meth:`read` for any optional files::
es_pe: Si no existe ninguno de los archivos mencionados, la instancia de :class:`ConfigParser` contendrá un conjunto de datos vacío. Una aplicación que requiera valores iniciales, que sean cargados desde un archivo, deberá cargar el(los) archivo(s) requerido(s) utilizando :meth:`read_file` antes de llamar a :meth:`read` para cualquier otro archivo opcional::

source: The *encoding* parameter. Previously, all files were read using the default encoding for :func:`open`.
es_pe: El parámetro *encoding*. Anteriormente, todos los archivos eran leídos utilizando la codificación por defecto de la la función :func:`open`.

source: The *filenames* parameter accepts a :term:`path-like object`.
es_pe: El parámetro *filenames* acepta un :term:`path-like object`.

source: The *filenames* parameter accepts a :class:`bytes` object.
es_pe: El parámetro *filenames* acepta un objeto :class:`bytes`.

source: Read and parse configuration data from *f* which must be an iterable yielding Unicode strings (for example files opened in text mode).
es_pe: Leer y analizar (*parse*) los datos de configuración de *f*, el cual debe ser un iterable que retorne cadenas de caracteres Unicode (por ejemplo, archivos abiertos en modo texto).

source: Optional argument *source* specifies the name of the file being read. If not given and *f* has a :attr:`name` attribute, that is used for *source*; the default is ``'<???>'``.
es_pe: El argumento opcional *source* especifica el nombre del archivo que se está leyendo. Si no se proporciona y *f* tiene un atributo :attr:`name`, este es utilizado como *source*; el valor por defecto es ``'<???>'``.

source: Replaces :meth:`readfp`.
es_pe: Reemplaza a :meth:`readfp`.

source: Parse configuration data from a string.
es_pe: Analiza (*parse*) los datos de configuración desde una cadena de caracteres.

source: Optional argument *source* specifies a context-specific name of the string passed. If not given, ``'<string>'`` is used. This should commonly be a filesystem path or a URL.
es_pe: El argumento opcional *source* especifica un nombre para la cadena de caracteres proporcionada, relativo al contexto. Si no se proporciona, se utiliza ``'<string>'``. Esto, por lo general, debería ser una ruta de archivo o una URL.

source: Load configuration from any object that provides a dict-like ``items()`` method. Keys are section names, values are dictionaries with keys and values that should be present in the section. If the used dictionary type preserves order, sections and their keys will be added in order. Values are automatically converted to strings.
es_pe: Carga la configuración a partir de cualquier objeto que proporcione un método ``items()``, similar a un diccionario. Las claves son nombres de secciones, los valores son diccionarios con claves y valores que deben estar presentes en la sección. Si el tipo de diccionario utilizado preserva el orden, las secciones y sus claves serán agregados en orden. Los valores son convertidos a cadenas de caracteres de forma automática.

source: Optional argument *source* specifies a context-specific name of the dictionary passed. If not given, ``<dict>`` is used.
es_pe: El argumento opcional *source* especifica un nombre para el diccionario proporcionado, relativo al contexto. Si no se proporciona, se utiliza ``<dict>``.

source: This method can be used to copy state between parsers.
es_pe: Este método puede utilizarse para copiar el estado entre *parsers*.

source: Get an *option* value for the named *section*. If *vars* is provided, it must be a dictionary. The *option* is looked up in *vars* (if provided), *section*, and in *DEFAULTSECT* in that order. If the key is not found and *fallback* is provided, it is used as a fallback value. ``None`` can be provided as a *fallback* value.
es_pe: Obtiene el valor de una *option* para la sección indicada. Si se proporciona *vars*, tiene que ser un diccionario. El valor de *option* será buscado en *vars* (si se proporciona), en *section* y en *DEFAULTSECT*, en ese orden. Si la clave no se encuentra, y se ha proporcionado *fallback*, este es utilizado como un valor de contingencia. Se puede utilizar ``None`` como valor de contingencia (*fallback*).

source: All the ``'%'`` interpolations are expanded in the return values, unless the *raw* argument is true. Values for interpolation keys are looked up in the same manner as the option.
es_pe: Todas las interpolaciones ``'%'`` son expandidas en el valor retornado, a menos que el argumento *raw* sea *true*. Los valores para la interpolación de las claves son buscados de la misma forma que para la opción.

source: Arguments *raw*, *vars* and *fallback* are keyword only to protect users from trying to use the third argument as the *fallback* fallback (especially when using the mapping protocol).
es_pe: Los argumentos *raw*, *vars* y *fallback* son argumentos nombrados solamente, a fin de proteger a los usuarios de los intentos de emplear el tercer argumento como el valor de contingencia de *fallback* (especialmente cuando se utiliza el protocolo de mapeo).

source: A convenience method which coerces the *option* in the specified *section* to an integer. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
es_pe: Un cómodo método para forzar a entero el valor de la opción de la sección indicada. Revise :meth:`get` para una explicación acerca de *raw*, *vars* y *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a floating point number. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
es_pe: Un cómodo método para forzar a número de punto flotante el valor de la opción de la sección indicada. Revise :meth:`get` para una explicación acerca de *raw*, *vars* y *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a Boolean value. Note that the accepted values for the option are ``'1'``, ``'yes'``, ``'true'``, and ``'on'``, which cause this method to return ``True``, and ``'0'``, ``'no'``, ``'false'``, and ``'off'``, which cause it to return ``False``. These string values are checked in a case-insensitive manner. Any other value will cause it to raise :exc:`ValueError`. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
es_pe: Un cómodo método para forzar a booleano el valor de la opción de la sección indicada. Tome nota que los valores aceptados para la opción son ``'1'``, ``'yes'``, ``'true'``, and ``'on'``, para que el método retorne ``True``, y ``'0'``, ``'no'``, ``'false'``, y ``'off'`` para que el método retorne ``False``. Esos valores de cadenas de caracteres son revisados sin diferenciar mayúsculas de minúsculas. Cualquier otro valor ocasionará que se genere la excepción :exc:`ValueError`. Revise :meth:`get` para una explicación acerca de *raw*, *vars* y *fallback*.

source: When *section* is not given, return a list of *section_name*, *section_proxy* pairs, including DEFAULTSECT.
es_pe: Cuando no se proporciona el argumento *section*, retorna una lista de pares *section_name*, *section_proxy*, incluyendo DEFAULTSECT.

source: Otherwise, return a list of *name*, *value* pairs for the options in the given *section*. Optional arguments have the same meaning as for the :meth:`get` method.
es_pe: De lo contrario, retorna una lista de pares *name*, *value* para las opciones de la sección especificada. Los argumentos opcionales tienen el mismo significado que en el método :meth:`get`.

source: Items present in *vars* no longer appear in the result. The previous behaviour mixed actual parser options with variables provided for interpolation.
es_pe: Los elementos que estén en *vars* no aparecen en el resultado. El comportamiento previo mezcla las opciones actuales del *parser* con las variables proporcionadas para la interpolación.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. *option* and *value* must be strings; if not, :exc:`TypeError` is raised.
es_pe: Si la sección indicada existe, asigna el valor especificado a la opción indicada; en caso contrario, genera la excepción :exc:`NoSectionError`. *option* y *value* deben ser cadenas de caracteres; de lo contrario, se genera la excepción :exc:`TypeError`.

source: Write a representation of the configuration to the specified :term:`file object`, which must be opened in text mode (accepting strings). This representation can be parsed by a future :meth:`read` call. If *space_around_delimiters* is true, delimiters between keys and values are surrounded by spaces.
es_pe: Escribe una representación de la configuración al :term:`file object` especificado, el cual debe ser abierto en modo texto (aceptando cadenas de caracteres). Esta representación puede ser analizada (*parsed*) por una posterior llamada a :meth:`read`. Si *space_around_delimiters* es *true*, los delimitadores entre claves y valores son rodeados por espacios.

source: Comments in the original configuration file are not preserved when writing the configuration back. What is considered a comment, depends on the given values for *comment_prefix* and *inline_comment_prefix*.
es_pe: Los comentarios presentes en el fichero original no se mantienen cuando se vuelve a escribir la configuración. Qué es considerado un comentario depende de los valores asignados a *comment_prefix* e *inline_comment_prefix*.

source: Remove the specified *option* from the specified *section*. If the section does not exist, raise :exc:`NoSectionError`. If the option existed to be removed, return :const:`True`; otherwise return :const:`False`.
es_pe: Elimina la opción especificada de la sección indicada. Si la sección no existe, se genera una excepción :exc:`NoSectionError`. Si la opción existía antes de la eliminación, retorna :const:`True`; de lo contrario retorna :const:`False`.

source: Remove the specified *section* from the configuration. If the section in fact existed, return ``True``. Otherwise return ``False``.
es_pe: Elimina la sección especificada de la configuración. Si la sección existía, retorna ``True``. De lo contrario, retorna ``False``.

source: Transforms the option name *option* as found in an input file or as passed in by client code to the form that should be used in the internal structures. The default implementation returns a lower-case version of *option*; subclasses may override this or client code can set an attribute of this name on instances to affect this behavior.
es_pe: Transforma el nombre de opción *option* de la forma en que se encontraba en el archivo de entrada o como fue pasada por el código del cliente, a la forma en que debe ser utilizada en las estructuras internas. La implementación por defecto retorna una versión en minúsculas de *option*; las subclases pueden sobre-escribirla o el código del cliente puede asignar un atributo de su nombre en las instancias, para afectar su comportamiento.

source: You don't need to subclass the parser to use this method, you can also set it on an instance, to a function that takes a string argument and returns a string. Setting it to ``str``, for example, would make option names case sensitive::
es_pe: No necesitas crear una subclase del *parser* para utilizar este método, ya que también puedes asignarlo en una instancia a una función, la cual reciba una cadena de caracteres como argumento y retorne otra. Por ejemplo, estableciéndola a ``str``, se hará que los nombres de opciones sean sensibles a mayúsculas y minúsculas::

source: Note that when reading configuration files, whitespace around the option names is stripped before :meth:`optionxform` is called.
es_pe: Tome en cuenta que cuando se leen archivos de configuración, los espacios en blanco alrededor de los nombres de opción son eliminados antes de llamar a :meth:`optionxform`.

source: The maximum depth for recursive interpolation for :meth:`get` when the *raw* parameter is false. This is relevant only when the default *interpolation* is used.
es_pe: La profundidad máxima de interpolación para :meth:`get` cuando el parámetro *raw* es *false*. Esto es de importancia solamente cuando la interpolación por defecto es empleada.

source: RawConfigParser Objects
es_pe: Objetos RawConfigParser

source: Legacy variant of the :class:`ConfigParser`. It has interpolation disabled by default and allows for non-string section names, option names, and values via its unsafe ``add_section`` and ``set`` methods, as well as the legacy ``defaults=`` keyword argument handling.
es_pe: Variante heredada de :class:`ConfigParser`. Tiene la interpolación deshabilitada por defecto y permite nombres de sección que no sean cadenas de caracteres, nombres de opciones, y valores a través de sus métodos inseguros ``add_section`` y ``set``, así como el manejo heredado del argumento nombrado ``defaults=``.

source: Consider using :class:`ConfigParser` instead which checks types of the values to be stored internally. If you don't want interpolation, you can use ``ConfigParser(interpolation=None)``.
es_pe: Considere el uso de :class:`ConfigParser` en su lugar, el cual verifica los tipos de datos de los valores que se almacenarán internamente. Si no quieres la interpolación, puedes utilizar ``ConfigParser(interpolation=None)``.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised.
es_pe: Agrega a la instancia una sección de nombre *section*. Si ya existe una sección con el nombre proporcionado, se genera la excepción :exc:`DuplicateSectionError`. Si se suministra el nombre *default section*, se genera la excepción :exc:`ValueError`.

source: Type of *section* is not checked which lets users create non-string named sections. This behaviour is unsupported and may cause internal errors.
es_pe: No se comprueba el tipo de datos de *section*, con lo cual se permite que los usuarios creen secciones con nombres que no sean cadenas de caracteres. Este comportamiento no está soportado y puede ocasionar errores internos.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. While it is possible to use :class:`RawConfigParser` (or :class:`ConfigParser` with *raw* parameters set to true) for *internal* storage of non-string values, full functionality (including interpolation and output to files) can only be achieved using string values.
es_pe: Si existe la sección indicada, asigna el valor especificado a la sección indicada; de lo contrario, genera la excepción :exc:`NoSectionError`. Aunque es posible utilizar :class:`RawConfigParser` (ó :class:`ConfigParser` con parámetros *raw* con valor *true*) como almacenamiento interno para valores que no sean cadenas de caracteres, el funcionamiento completo (incluyendo la interpolación y escritura en archivos) sólo puede lograrse utilizando valores del tipo cadena de caracteres.

source: This method lets users assign non-string values to keys internally. This behaviour is unsupported and will cause errors when attempting to write to a file or get it in non-raw mode. **Use the mapping protocol API** which does not allow such assignments to take place.
es_pe: Este método permite que los usuarios asignen valores que no sean cadenas de caracteres a las claves, internamente. Este comportamiento no está soportado y causará errores cuando se intente escribir en un archivo o cuando se intente obtenerlo en un modo no *raw*. **Utilice la API del protocolo de mapeo**, la cual no permite ese tipo de asignaciones.

source: Exceptions
es_pe: Excepciones

source: Base class for all other :mod:`configparser` exceptions.
es_pe: Clase base para todas las otras excepciones :mod:`configparser`.

source: Exception raised when a specified section is not found.
es_pe: Excepción generada cuando no se encuentra una sección especificada.

source: Exception raised if :meth:`add_section` is called with the name of a section that is already present or in strict parsers when a section if found more than once in a single input file, string or dictionary.
es_pe: Excepción generada si el método :meth:`add_section` es llamado proporcionando el nombre de una sección que ya existe, o, en caso de *parsers* estrictos, si una sección se encuentra más de una vez en un solo archivo de entrada, cadena de caracteres o diccionario.

source: Optional ``source`` and ``lineno`` attributes and arguments to :meth:`__init__` were added.
es_pe: Al método :meth:`__init__` se agregaron los atributos y argumentos opcionales ``source`` y ``lineno``.

source: Exception raised by strict parsers if a single option appears twice during reading from a single file, string or dictionary. This catches misspellings and case sensitivity-related errors, e.g. a dictionary may have two keys representing the same case-insensitive configuration key.
es_pe: Excepción generada por *parsers* estrictos si una sola opción aparece dos veces durante la lectura de un solo archivo, cadena de caracteres o diccionario. Captura errores de escritura o relacionados con el uso de mayúsculas y minúsculas, ej. un diccionario podría tener dos claves que representan la misma clave de configuración bajo un esquema insensible a mayúsculas y minúsculas.

source: Exception raised when a specified option is not found in the specified section.
es_pe: Excepción generada cuando una opción especificada no se encuentra en una sección indicada.

source: Base class for exceptions raised when problems occur performing string interpolation.
es_pe: Clase base para excepciones generadas por problemas que ocurren al realizar la interpolación de cadenas de caracteres.

source: Exception raised when string interpolation cannot be completed because the number of iterations exceeds :const:`MAX_INTERPOLATION_DEPTH`. Subclass of :exc:`InterpolationError`.
es_pe: Excepción generada cuando la interpolación de cadenas de caracteres no puede completarse, debido a que el número de iteraciones excede a :const:`MAX_INTERPOLATION_DEPTH`. Subclase de :exc:`InterpolationError`.

source: Exception raised when an option referenced from a value does not exist. Subclass of :exc:`InterpolationError`.
es_pe: Excepción generada cuando no existe una opción referida por un valor. Subclase de :exc:`InterpolationError`.

source: Exception raised when the source text into which substitutions are made does not conform to the required syntax. Subclass of :exc:`InterpolationError`.
es_pe: Excepción generada cuando el texto fuente, donde se realizan las sustituciones, no se ajusta a la sintaxis requerida. Subclase de :exc:`InterpolationError`.

source: Exception raised when attempting to parse a file which has no section headers.
es_pe: Excepción generada cuando se intenta analizar (*parse*) un archivo que no tiene encabezados de sección.

source: Exception raised when errors occur attempting to parse a file.
es_pe: Excepción generada cuando ocurren errores intentando analizar (*parse*) un archivo.

source: The ``filename`` attribute and :meth:`__init__` constructor argument were removed. They have been available using the name ``source`` since 3.2.
es_pe: El atributo ``filename`` y el argumento del constructor :meth:`__init__` fueron eliminados. Estos han estado disponibles usando el nombre ``source`` desde 3.2.

source: Footnotes
es_pe: Notas al pie
