Repository: python/python-docs-es
Catalog: library/configparser.po
Languages: es_pe

source: Config parsers allow for heavy customization. If you are interested in changing the behaviour outlined by the footnote reference, consult the `Customizing Parser Behaviour`_ section.
es_pe: Los *config parsers* permiten una gran personalización. Si estás interesado en modificar el comportamiento descrito por la referencia de la nota al pie, consulta la sección `Customizing Parser Behaviour`_.
