Repository: python/python-docs-es
Catalog: library/configparser.po
Languages: es_pe

source: Please note: there are ways to add a set of key-value pairs in a single operation. When you use a regular dictionary in those operations, the order of the keys will be ordered. For example:
es_pe: Por favor, tome en cuenta que: existen formas de agregar un par clave-valor en una sola operación. Cuando se utiliza un diccionario común en tales operaciones, el orden de las claves será el empleado en la creación. Por ejemplo:

source: *allow_no_value*, default value: ``False``
es_pe: *allow_no_value*, valor por defecto: ``False``

source: Some configuration files are known to include settings without values, but which otherwise conform to the syntax supported by :mod:`configparser`. The *allow_no_value* parameter to the constructor can be used to indicate that such values should be accepted:
es_pe: Se sabe que algunos archivos de configuración incluyen elementos sin indicar un valor, aunque cumplan con la sintaxis soportada por :mod:`configparser` en todo lo demás. El parámetro *allow_no_value* le indica al constructor que tales valores deben ser aceptados:

source: *delimiters*, default value: ``('=', ':')``
es_pe: *delimiters*, valor por defecto: ``('=', ':')``

source: Delimiters are substrings that delimit keys from values within a section. The first occurrence of a delimiting substring on a line is considered a delimiter. This means values (but not keys) can contain the delimiters.
es_pe: Los *delimiters* son cadenas de caracteres que separan las claves de los valores dentro de una sección. La primera ocurrencia de una cadena de separación en una línea se considera como un separador. Esto significa que los valores pueden contener separadores, no así las claves.

source: See also the *space_around_delimiters* argument to :meth:`ConfigParser.write`.
es_pe: Vea también el argumento *space_around_delimiters* de :meth:`ConfigParser.write`.

source: *comment_prefixes*, default value: ``('#', ';')``
es_pe: *comment_prefixes*, valor por defecto: ``('#', ';')``

source: *inline_comment_prefixes*, default value: ``None``
es_pe: *inline_comment_prefixes*, valor por defecto: ``None``

source: Comment prefixes are strings that indicate the start of a valid comment within a config file. *comment_prefixes* are used only on otherwise empty lines (optionally indented) whereas *inline_comment_prefixes* can be used after every valid value (e.g. section names, options and empty lines as well). By default inline comments are disabled and ``'#'`` and ``';'`` are used as prefixes for whole line comments.
es_pe: Los prefijos de comentario son cadenas de caracteres que indican el inicio de un comentario válido dentro de un archivo de configuración. Los *comment_prefixes* son utilizados solamente en lo que serían líneas en blanco (opcionalmente indentadas), mientras que *inline_comment_prefixes* pueden ser utilizados después de cada valor válido (ej. nombres de sección, opciones y también líneas en blanco). De forma predeterminada, los comentarios en la misma línea están deshabilitados, y tanto ``'#'`` como ``';'`` se utilizan como prefijos para comentarios que ocupan toda la línea.

source: In previous versions of :mod:`configparser` behaviour matched ``comment_prefixes=('#',';')`` and ``inline_comment_prefixes=(';',)``.
es_pe: En versiones previas de :mod:`configparser` el comportamiento correspondía a ``comment_prefixes=('#',';')`` e ``inline_comment_prefixes=(';',)``.

source: Please note that config parsers don't support escaping of comment prefixes so using *inline_comment_prefixes* may prevent users from specifying option values with characters used as comment prefixes. When in doubt, avoid setting *inline_comment_prefixes*. In any circumstances, the only way of storing comment prefix characters at the beginning of a line in multiline values is to interpolate the prefix, for example::
es_pe: Por favor, observe que los *config parsers* no soportan el escapado de los prefijos de comentarios, de modo que la utilización de los *inline_comment_prefixes* puede impedir que los usuarios especifiquen valores de opciones que incluyan caracteres empleados como prefijos de comentarios. Ante la duda, evite especificar los *inline_comment_prefixes*. En cualquier circunstancia, la única forma de almacenar caracteres prefijos de comentario al inicio de una línea, en valores multilínea, es mediante la interpolación del prefijo, por ejemplo::

source: *strict*, default value: ``True``
es_pe: *strict*, valor por defecto: ``True``

source: When set to ``True``, the parser will not allow for any section or option duplicates while reading from a single source (using :meth:`read_file`, :meth:`read_string` or :meth:`read_dict`). It is recommended to use strict parsers in new applications.
es_pe: Cuando tiene el valor ``True``, el *parser* no permitirá duplicados en ninguna sección u opción, al efectuar la lectura desde una sola fuente (utilizando :meth:`read_file`, :meth:`read_string` ó :meth:`read_dict`). Se recomienda el uso de *strict parsers* en las aplicaciones nuevas.

source: In previous versions of :mod:`configparser` behaviour matched ``strict=False``.
es_pe: En versiones previas de :mod:`configparser` el comportamiento correspondía a ``strict=False``.

source: *empty_lines_in_values*, default value: ``True``
es_pe: *empty_lines_in_values*, valor por defecto: ``True``

source: In config parsers, values can span multiple lines as long as they are indented more than the key that holds them. By default parsers also let empty lines to be parts of values. At the same time, keys can be arbitrarily indented themselves to improve readability. In consequence, when configuration files get big and complex, it is easy for the user to lose track of the file structure. Take for instance:
es_pe: En los *config parsers*, los valores pueden abarcar varias líneas, siempre y cuando estén indentadas a un nivel superior al de la clave que las contiene. De forma predeterminada, los *parsers* permiten que las líneas en blanco formen parte de los valores. Igualmente, las claves pueden estar indentadas a sí mismas de forma arbitraria, a fin de mejorar la legibilidad. Por lo tanto, cuando los archivos de configuración se vuelven grandes y complejos, es fácil para el usuario el perder la pista de la estructura del archivo. Tomemos como ejemplo:

source: This can be especially problematic for the user to see if she's using a proportional font to edit the file. That is why when your application does not need values with empty lines, you should consider disallowing them. This will make empty lines split keys every time. In the example above, it would produce two keys, ``key`` and ``this``.
es_pe: Esto puede ser especialmente problemático de observar por parte del usuario, en caso que se esté utilizando un tipo de fuente proporcional para editar el archivo. Y es por ello que, cuando tu aplicación no necesite valores con líneas en blanco, debes considerar invalidarlas. Esto ocasionaría que las líneas en blanco sirvan para dividir a las claves, siempre. En el ejemplo anterior, produciría dos claves: ``key`` y ``this``.

source: *default_section*, default value: ``configparser.DEFAULTSECT`` (that is: ``"DEFAULT"``)
es_pe: *default_section*, valor por defecto: ``configparser.DEFAULTSECT`` (es decir: ``"DEFAULT"``)

source: The convention of allowing a special section of default values for other sections or interpolation purposes is a powerful concept of this library, letting users create complex declarative configurations. This section is normally called ``"DEFAULT"`` but this can be customized to point to any other valid section name. Some typical values include: ``"general"`` or ``"common"``. The name provided is used for recognizing default sections when reading from any source and is used when writing configuration back to a file. Its current value can be retrieved using the ``parser_instance.default_section`` attribute and may be modified at runtime (i.e. to convert files from one format to another).
es_pe: El convenio de permitir una sección especial con valores por defecto para otras secciones, o con propósito de interpolación, es un concepto poderoso de esta librería, el cual permite a los usuarios crear configuraciones declarativas complejas. Esta sección se suele denominar ``"DEFAULT"``, pero puede personalizarse para corresponder a cualquier otro nombre de sección. Algunas valores comunes son: ``"general"`` ó ``"common"``. El nombre proporcionado es utilizado para reconocer las secciones por defecto al momento de realizar la lectura desde cualquier fuente, y es utilizado ante cualquier escritura al archivo de configuración. Su valor actual puede obtenerse utilizando el atributo ``parser_instance.default_section`` y puede ser modificado en tiempo de ejecución (es decir, para convertir archivos de un formato a otro).

source: *interpolation*, default value: ``configparser.BasicInterpolation``
es_pe: *interpolation*, valor por defecto: ``configparser.BasicInterpolation``

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_. :class:`RawConfigParser` has a default value of ``None``.
es_pe: El comportamiento de la interpolación puede ser personalizado al proporcionar un gestor personalizado mediante el argumento *interpolation*. El valor ``None`` se utiliza para desactivar la interpolación por completo, mientras que ``ExtendedInterpolation()`` proporciona una variante más avanzada, inspirada por ``zc.buildout``. Más información al respecto en la `sección dedicada de la documentación <#interpolation-of-values>`_. El :class:`RawConfigParser` tiene un valor por defecto de ``None``.

source: *converters*, default value: not set
es_pe: *converters*, valor por defecto: no definido

source: Config parsers provide option value getters that perform type conversion. By default :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat`, and :meth:`~ConfigParser.getboolean` are implemented. Should other getters be desirable, users may define them in a subclass or pass a dictionary where each key is a name of the converter and each value is a callable implementing said conversion. For instance, passing ``{'decimal': decimal.Decimal}`` would add :meth:`getdecimal` on both the parser object and all section proxies. In other words, it will be possible to write both ``parser_instance.getdecimal('section', 'key', fallback=0)`` and ``parser_instance['section'].getdecimal('key', 0)``.
es_pe: Los *config parsers* proporcionan métodos para lectura (*getters*) de valores de opciones, que llevan a cabo la conversión de tipo. Están implementados los métodos :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat`, y :meth:`~ConfigParser.getboolean`, de forma predeterminada. Si se desean otros métodos de lectura (*getters*), los usuarios pueden definirlos en una subclase o pasar un diccionario donde cada clave sea el nombre del conversor y cada valor es un invocable (*callable*) que implemente la conversión requerida. Por ejemplo, al pasar ``{'decimal': decimal.Decimal}`` se agregaría :meth:`getdecimal` tanto en el objeto *parser* como en todas las secciones proxies. En otras palabras, sería posible escribir tanto ``parser_instance.getdecimal('section', 'key', fallback=0)`` como ``parser_instance['section'].getdecimal('key', 0)``.

source: If the converter needs to access the state of the parser, it can be implemented as a method on a config parser subclass. If the name of this method starts with ``get``, it will be available on all section proxies, in the dict-compatible form (see the ``getdecimal()`` example above).
es_pe: Si el conversor necesita acceder al estado del *parser*, este puede ser implementado como un método en una subclase del *config parser*. Si el nombre de este método comienza con ``get``, estará disponible en todas las secciones proxy, en su forma compatible con diccionarios (vea el ejemplo anterior de ``getdecimal()``).

source: More advanced customization may be achieved by overriding default values of these parser attributes. The defaults are defined on the classes, so they may be overridden by subclasses or by attribute assignment.
es_pe: Una personalización más avanzada puede conseguirse al sustituir los valores por defecto de estos atributos del *parser*. Los valores por defecto son definidos en las clases, de modo que pueden ser sustituidos por las subclases o mediante la asignación de atributos.

source: By default when using :meth:`~ConfigParser.getboolean`, config parsers consider the following values ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` and the following values ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. You can override this by specifying a custom dictionary of strings and their Boolean outcomes. For example:
es_pe: Por defecto, al utilizar el método :meth:`~ConfigParser.getboolean`, los *config parsers* consideran a los siguientes valores como ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` y a los siguientes valores como ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. Puedes cambiar ello proporcionando un diccionario personalizado de cadenas de caracteres, con sus correspondientes valores booleanos. Por ejemplo:

source: Other typical Boolean pairs include ``accept``/``reject`` or ``enabled``/``disabled``.
es_pe: Otros pares booleanos comunes incluyen ``accept``/``reject`` ó ``enabled``/``disabled``.

source: This method transforms option names on every read, get, or set operation. The default converts the name to lowercase. This also means that when a configuration file gets written, all keys will be lowercase. Override this method if that's unsuitable. For example:
es_pe: Este método realiza la transformación de los nombres de opciones para cada operación de lectura, obtención o asignación. Por defecto convierte los nombres a minúsculas. Esto significa que, cuando un archivo de configuración es escrito, todas las claves son convertidas a minúsculas. Sobre-escribe este método si tal comportamiento no es adecuado. Por ejemplo:

source: The optionxform function transforms option names to a canonical form. This should be an idempotent function: if the name is already in canonical form, it should be returned unchanged.
es_pe: La función *optionxform* transforma los nombres de opción a una forma canónica. Esta debería ser una función idempotente: si el nombre ya está en su forma canónica, debería retornarse sin cambios.

source: A compiled regular expression used to parse section headers. The default matches ``[section]`` to the name ``"section"``. Whitespace is considered part of the section name, thus ``[ larch ]`` will be read as a section of name ``" larch "``. Override this attribute if that's unsuitable. For example:
es_pe: Es una expresión regular compilada que se utiliza para parsear cabeceras de sección. Por defecto hace corresponder ``[section]`` con el nombre ``"section"``. Los espacios en blanco son considerados parte del nombre de sección, por lo que ``[ larch ]`` será leído como la sección de nombre ``" larch "``. Sobre-escribe este atributo si tal comportamiento no es adecuado. Por ejemplo:

source: While ConfigParser objects also use an ``OPTCRE`` attribute for recognizing option lines, it's not recommended to override it because that would interfere with constructor options *allow_no_value* and *delimiters*.
es_pe: Mientras que los objetos *ConfigParser* también utilizan un atributo ``OPTCRE`` para reconocer las líneas de opciones, no se recomienda su sobre-escritura porque puede interferir con las opciones *allow_no_value* y *delimiters* del constructor.

source: Legacy API Examples
es_pe: Ejemplos de la API heredada

source: Mainly because of backwards compatibility concerns, :mod:`configparser` provides also a legacy API with explicit ``get``/``set`` methods. While there are valid use cases for the methods outlined below, mapping protocol access is preferred for new projects. The legacy API is at times more advanced, low-level and downright counterintuitive.
es_pe: :mod:`configparser` proporciona también una API heredada con métodos ``get``/``set`` explícitos; ello, principalmente debido a asuntos de compatibilidad con versiones anteriores. Aunque existen casos de uso válidos para los métodos descritos a continuación, se prefiere el acceso por protocolo de mapeo para los proyectos nuevos. La API heredada es al mismo tiempo más avanzada, de bajo nivel y sumamente contradictoria.

source: An example of writing to a configuration file::
es_pe: Un ejemplo de escritura a un archivo de configuración::

source: An example of reading the configuration file again::
es_pe: Un ejemplo de lectura de un archivo de configuración, nuevamente::

source: To get interpolation, use :class:`ConfigParser`::
es_pe: Para obtener la interpolación, utilice :class:`ConfigParser`::

source: Default values are available in both types of ConfigParsers. They are used in interpolation if an option used is not defined elsewhere. ::
es_pe: Los valores por defecto están disponibles en ambos tipos de ConfigParsers. Ellos son utilizados en la interpolación cuando una opción utilizada no está definida en otro lugar. ::

source: ConfigParser Objects
es_pe: Objetos ConfigParser

source: The main configuration parser. When *defaults* is given, it is initialized into the dictionary of intrinsic defaults. When *dict_type* is given, it will be used to create the dictionary objects for the list of sections, for the options within a section, and for the default values.
es_pe: La *config parser* principal. Si se proporciona *defaults*, su valor es inicializado en el diccionario de valores por defecto intrínsecos. Si se proporciona *dict_type*, se utiliza para crear el diccionario de objetos para la lista de secciones, las opciones dentro de una sección, y los valores por defecto.

source: When *delimiters* is given, it is used as the set of substrings that divide keys from values. When *comment_prefixes* is given, it will be used as the set of substrings that prefix comments in otherwise empty lines. Comments can be indented. When *inline_comment_prefixes* is given, it will be used as the set of substrings that prefix comments in non-empty lines.
es_pe: Si se proporciona *delimiters*, se utiliza como un conjunto de cadenas de caracteres que dividen las claves de los valores. Si se proporciona *comment_prefixes*, se utiliza como un conjunto de cadenas de caracteres que preceden a los comentarios, en líneas que estarían, de otro modo, vacías. Los comentarios pueden estar indentados. Si se proporciona *inline_comment_prefixes*, se utiliza como un conjunto de cadenas de caracteres que preceden a los comentarios en líneas que no están vacías.

source: When *strict* is ``True`` (the default), the parser won't allow for any section or option duplicates while reading from a single source (file, string or dictionary), raising :exc:`DuplicateSectionError` or :exc:`DuplicateOptionError`. When *empty_lines_in_values* is ``False`` (default: ``True``), each empty line marks the end of an option. Otherwise, internal empty lines of a multiline option are kept as part of the value. When *allow_no_value* is ``True`` (default: ``False``), options without values are accepted; the value held for these is ``None`` and they are serialized without the trailing delimiter.
es_pe: Cuando *strict* es ``True`` (por defecto), el *parser* no permitirá duplicados en ninguna sección u opción, al realizar la lectura de una sola fuente (archivo, cadena de caracteres o diccionario), generando una excepción :exc:`DuplicateSectionError` ó :exc:`DuplicateOptionError`. Cuando *empty_lines_in_values* es ``False`` (valor por defecto: ``True``), cada línea en blanco indica el fin de una opción. De otro modo, las líneas en blanco de una opción multilínea son tratadas como parte del valor de esta. Cuando *allow_no_value* es ``True`` (valor por defecto: ``False``), se aceptan opciones sin valores; el valor que toman esas opciones es ``None`` y serán serializadas sin el delimitador final.

source: When *default_section* is given, it specifies the name for the special section holding default values for other sections and interpolation purposes (normally named ``"DEFAULT"``). This value can be retrieved and changed at runtime using the ``default_section`` instance attribute. This won't re-evaluate an already parsed config file, but will be used when writing parsed settings to a new config file.
es_pe: Cuando se proporciona *default_section*, se define el nombre de la sección especial que contiene valores por defecto para otras secciones y con propósito de interpolación (habitualmente denominada ``"DEFAULT"``). Este valor puede obtenerse y modificarse en tiempo de ejecución utilizando el atributo de instancia ``default_section``. Esto no volverá a evaluar un fichero de configuración previamente analizado sintácticamente (*parsed*), pero se usará al escribir configuraciones de analizado sintáctico (*parsed*) en un nuevo fichero de configuración.

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_.
es_pe: La interpolación puede personalizarse al proporcionar un gestor personalizado, mediante el argumento *interpolation*. El valor ``None`` se utiliza para desactivar la interpolación completamente, ``ExtendedInterpolation()`` proporciona una variante avanzada, inspirada en ``zc.buildout``. Más al respecto puede encontrarse en la `correspondiente sección de la documentación <#interpolation-of-values>`_.

source: All option names used in interpolation will be passed through the :meth:`optionxform` method just like any other option name reference. For example, using the default implementation of :meth:`optionxform` (which converts option names to lower case), the values ``foo %(bar)s`` and ``foo %(BAR)s`` are equivalent.
es_pe: Todos los nombres de opción que se utilizan en la interpolación pasarán por el método :meth:`optionxform`, igual que cualquier otra referencia a un nombre de opción. Por lo tanto, si se utiliza la implementación por defecto de :meth:`optionxform` (la cual convierte los nombres de opción a minúsculas), los valores ``foo %(bar)s`` y ``foo %(BAR)s`` son equivalentes.

source: When *converters* is given, it should be a dictionary where each key represents the name of a type converter and each value is a callable implementing the conversion from string to the desired datatype. Every converter gets its own corresponding :meth:`get*()` method on the parser object and section proxies.
es_pe: Cuando se proporciona *converters*, este debe ser un diccionario, donde cada clave representa el nombre de un conversor, y cada valor un invocable que implementa la conversión de la cadena de caracteres al tipo de datos deseado. Cada conversor recibe su método :meth:`get*()` correspondiente en el objeto *parser* y los proxies de sección.

source: The default *dict_type* is :class:`collections.OrderedDict`.
es_pe: El valor por defecto de *dict_type* es :class:`collections.OrderedDict`.

source: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* and *interpolation* were added.
es_pe: se agregaron los argumentos *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* y *interpolation*.
