Repository: python/python-docs-es
Catalog: library/constants.po
Languages: es

source: Built-in Constants
es: Constantes incorporadas

source: A small number of constants live in the built-in namespace. They are:
es: Un pequeño número de constantes viven en el espacio de nombres incorporado. Ellas son:

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
es: El valor falso del tipo :class:`bool`. Las asignaciones a ``False`` son ilegales y generan un :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
es: El valor verdadero del tipo :class:`bool`. Las asignaciones a ``True`` son ilegales y generan un :exc:`SyntaxError`.

source: When a binary (or in-place) method returns ``NotImplemented`` the interpreter will try the reflected operation on the other type (or some other fallback, depending on the operator). If all attempts return ``NotImplemented``, the interpreter will raise an appropriate exception. Incorrectly returning ``NotImplemented`` will result in a misleading error message or the ``NotImplemented`` value being returned to Python code.
es: Cuando un método binario (o in situ) retorna ``NotImplemented``, el intérprete intentará la operación reflejada en el otro tipo (o algún otro recurso alternativo, según el operador). Si todos los intentos retornan ``NotImplemented``, el intérprete lanzará una excepción apropiada. Retornar incorrectamente ``NotImplemented`` dará como resultado un mensaje de error engañoso o el valor de ``NotImplemented`` se retornará al código Python.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
es: Consulte :ref:`implementing-the-arithmetic-operations` para ver ejemplos.

source: ``NotImplementedError`` and ``NotImplemented`` are not interchangeable, even though they have similar names and purposes. See :exc:`NotImplementedError` for details on when to use it.
es: ``NotImplementedError`` y ``NotImplemented`` no son lo mismo, aunque tengan nombres y propósitos similares. Consulte :exc:`NotImplementedError` para obtener más información sobre cuándo usarlo.

source: Evaluating ``NotImplemented`` in a boolean context is deprecated. While it currently evaluates as true, it will emit a :exc:`DeprecationWarning`. It will raise a :exc:`TypeError` in a future version of Python.
es: La evaluación de ``NotImplemented`` en un contexto booleano está en desuso. Si bien actualmente se evalúa como verdadero, emitirá un :exc:`DeprecationWarning`. Lanzará un :exc:`TypeError` en una versión futura de Python.

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
es: Lo mismo que la elipsis literal "``...``". Valor especial que se utiliza principalmente junto con la sintaxis de segmentación extendida para tipos de datos de contenedor definidos por el usuario.``Ellipsis`` es la única instancia del tipo :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
es: Esta constante es verdadera si Python no se inició con una opción :option:`-O`. Vea también la instrucción :keyword:`assert`.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
es: Los nombres: :data:`None`, :data:`False`, :data:`True` y :data:`__debug__` no se pueden reasignar (asignaciones a ellos, incluso como un nombre de atributo, lanza :exc:`SyntaxError` ), por lo que pueden considerarse constantes "verdaderas".

source: Constants added by the :mod:`site` module
es: Constantes agregadas por el módulo :mod:`site`

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
es: El módulo :mod:`site` (que se importa automáticamente durante el inicio, excepto si se proporciona la opción :option:`-S` en la línea de comandos) agrega varias constantes al espacio de nombres integrado. Son útiles para el intérprete interactivo y no deben usarse en programas.

source: Objects that when printed, print a message like "Use quit() or Ctrl-D (i.e. EOF) to exit", and when called, raise :exc:`SystemExit` with the specified exit code.
es: Objetos que cuando se imprimen, muestra un mensaje como "Use quit() o Ctrl-D (i.e. EOF) to exit", y cuando se llama, lanza :exc:`SystemExit` con el código de salida especificado.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
es: Objetos que al ser impresos o llamados imprimen el texto de derechos de autor o créditos, respectivamente.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
es: Objeto que cuando se imprime, muestra el mensaje "Escriba licencia () para ver el texto completo de la licencia", y cuando se le llama, muestra el texto completo de la licencia en forma de buscapersonas (una pantalla a la vez).
