Repository: python/python-docs-es
Catalog: library/ctypes.po
Languages: es

source: The following public attributes are available, their name starts with an underscore to not clash with exported function names:
es: Los siguientes atributos públicos están disponibles, su nombre comienza con un guión bajo para no chocar con los nombres de las funciones exportadas:

source: The system handle used to access the library.
es: El manejador del sistema usado para acceder a la biblioteca.

source: The name of the library passed in the constructor.
es: El nombre de la biblioteca pasado en el constructor.

source: Class which loads shared libraries. *dlltype* should be one of the :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL`, or :class:`OleDLL` types.
es: Clase que carga bibliotecas compartidas. *dlltype* debe ser uno de los tipos :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL`, o :class:`OleDLL`.

source: Load a shared library into the process and return it. This method always returns a new instance of the library.
es: Carga una biblioteca compartida en el proceso y la retorna. Este método siempre retorna una nueva instancia de la biblioteca.

source: These prefabricated library loaders are available:
es: Estos cargadores prefabricados de bibliotecas están disponibles:

source: Creates :class:`CDLL` instances.
es: Crea instancias de :class:`CDLL`.

source: Windows only: Creates :class:`WinDLL` instances.
es: Sólo Windows: Crea instancias de :class:`WinDLL`.

source: Windows only: Creates :class:`OleDLL` instances.
es: Sólo Windows: Crea instancias de :class:`OleDLL`.

source: Creates :class:`PyDLL` instances.
es: Crea instancias de :class:`PyDLL`.

source: For accessing the C Python api directly, a ready-to-use Python shared library object is available:
es: Para acceder directamente a la API C de Python, se dispone de un objeto de biblioteca compartida de Python listo-para-usar:

source: In cases when only the library handle is available rather than the object, accessing a function raises an auditing event ``ctypes.dlsym/handle`` with arguments ``handle`` (the raw library handle) and ``name``.
es: En los casos en los que sólo está disponible el manejador de la biblioteca en lugar del objeto, al acceder a una función se produce un evento de auditoría ``ctypes.dlsym/handle`` con los argumentos ``handle`` (el manejador de la biblioteca en bruto) y ``name``.

source: Foreign functions
es: Funciones foráneas

source: As explained in the previous section, foreign functions can be accessed as attributes of loaded shared libraries. The function objects created in this way by default accept any number of arguments, accept any ctypes data instances as arguments, and return the default result type specified by the library loader. They are instances of a private class:
es: Como se explicó en la sección anterior, se puede acceder a las funciones foráneas como atributos de las bibliotecas compartidas cargadas. Los objetos de función creados de esta forma aceptan por defecto cualquier número de argumentos, aceptan cualquier instancia de datos ctypes como argumentos y retornan el tipo de resultado por defecto especificado por el cargador de la biblioteca. Son instancias de una clase privada:

source: Base class for C callable foreign functions.
es: Clase base para funciones foráneas C invocables.

source: Instances of foreign functions are also C compatible data types; they represent C function pointers.
es: Las instancias de funciones foráneas también son tipos de datos compatibles con C; representan punteros de funciones C.

source: This behavior can be customized by assigning to special attributes of the foreign function object.
es: Este comportamiento puede personalizarse asignando a los atributos especiales del objeto de la función foránea.

source: Assign a ctypes type to specify the result type of the foreign function. Use ``None`` for :c:expr:`void`, a function not returning anything.
es: Asigne un tipo ctypes para especificar el tipo de resultado de la función externa. Use ``None`` para :c:expr:`void`, una función que no retorna nada.

source: Assign a tuple of ctypes types to specify the argument types that the function accepts. Functions using the ``stdcall`` calling convention can only be called with the same number of arguments as the length of this tuple; functions using the C calling convention accept additional, unspecified arguments as well.
es: Asigne una tupla de tipos ctypes para especificar los tipos de argumentos que acepta la función. Las funciones que utilizan la convención de llamada ``stdcall`` sólo pueden ser llamadas con el mismo número de argumentos que la longitud de esta tupla; las funciones que utilizan la convención de llamada C aceptan también argumentos adicionales no especificados.

source: Assign a Python function or another callable to this attribute. The callable will be called with three or more arguments:
es: Asigne una función Python u otra llamada a este atributo. El invocable será llamado con tres o más argumentos:

source: *func* is the foreign function object itself, this allows reusing the same callable object to check or post process the results of several functions.
es: *func* es el propio objeto de la función foránea, lo que permite reutilizar el mismo objeto invocable para comprobar o postprocesar los resultados de varias funciones.

source: *arguments* is a tuple containing the parameters originally passed to the function call, this allows specializing the behavior on the arguments used.
es: *arguments* es una tupla que contiene los parámetros originalmente pasados a la llamada de la función, esto permite especializar el comportamiento en los argumentos utilizados.

source: The object that this function returns will be returned from the foreign function call, but it can also check the result value and raise an exception if the foreign function call failed.
es: El objeto que retorna esta función será retornado por la llamada de la función foránea, pero también puede comprobar el valor del resultado y hacer una excepción si la llamada de la función foránea ha fallado.

source: This exception is raised when a foreign function call cannot convert one of the passed arguments.
es: Esta excepción se lanza cuando una llamada a una función foránea no puede convertir uno de los argumentos pasados.

source: On Windows, when a foreign function call raises a system exception (for example, due to an access violation), it will be captured and replaced with a suitable Python exception. Further, an auditing event ``ctypes.set_exception`` with argument ``code`` will be raised, allowing an audit hook to replace the exception with its own.
es: En Windows, cuando una llamada a una función foránea plantea una excepción de sistema (por ejemplo, debido a una violación de acceso), será capturada y sustituida por una excepción Python adecuada. Además, un evento de auditoría ``ctypes.set_exception`` con el argumento ``code`` será levantado, permitiendo que un gancho de auditoría reemplace la excepción con la suya propia.

source: Some ways to invoke foreign function calls may raise an auditing event ``ctypes.call_function`` with arguments ``function pointer`` and ``arguments``.
es: Algunas formas de invocar llamadas a funciones foráneas pueden lanzar un evento de auditoría ``ctypes.call_function`` con los argumentos ``function pointer`` y ``arguments``.

source: Function prototypes
es: Prototipos de funciones

source: Foreign functions can also be created by instantiating function prototypes. Function prototypes are similar to function prototypes in C; they describe a function (return type, argument types, calling convention) without defining an implementation. The factory functions must be called with the desired result type and the argument types of the function, and can be used as decorator factories, and as such, be applied to functions through the ``@wrapper`` syntax. See :ref:`ctypes-callback-functions` for examples.
es: Las funciones foráneas también pueden crearse mediante la instanciación de prototipos de funciones. Los prototipos de funciones son similares a los prototipos de funciones en C; describen una función (tipo de retorno, tipos de argumentos, convención de llamada) sin definir una implementación. Las funciones de fábrica deben ser llamadas con el tipo de resultado deseado y los tipos de argumento de la función, y pueden ser usadas como fábricas de decoradores, y como tales, ser aplicadas a las funciones a través de la sintaxis ``@wrapper``. Ver :ref:`ctypes-callback-functions` para ejemplos.

source: The returned function prototype creates functions that use the standard C calling convention. The function will release the GIL during the call. If *use_errno* is set to true, the ctypes private copy of the system :data:`errno` variable is exchanged with the real :data:`errno` value before and after the call; *use_last_error* does the same for the Windows error code.
es: El prototipo de función retornado crea funciones que usan la convención de llamada C estándar. La función liberará el GIL durante la llamada. Si *use_errno* se configura a true, la copia privada de ctypes de la variable del sistema :data:`errno` se intercambia con el valor real :data:`errno` antes y después de la llamada; *use_last_error* hace lo mismo con el código de error de Windows.

source: Windows only: The returned function prototype creates functions that use the ``stdcall`` calling convention. The function will release the GIL during the call. *use_errno* and *use_last_error* have the same meaning as above.
es: Solo Windows: el prototipo de función retornada crea funciones que utilizan la convención de llamada ``stdcall``. La función liberará el GIL durante la llamada. *use_errno* y *use_last_error* tienen el mismo significado que el anterior.

source: The returned function prototype creates functions that use the Python calling convention. The function will *not* release the GIL during the call.
es: El prototipo de función retornado crea funciones que usan la convención de llamadas de Python. La función *no* liberará el GIL durante la llamada.

source: Function prototypes created by these factory functions can be instantiated in different ways, depending on the type and number of the parameters in the call:
es: Los prototipos de funciones creados por estas funciones de fábrica pueden ser instanciados de diferentes maneras, dependiendo del tipo y el número de los parámetros en la llamada:

source: Returns a foreign function at the specified address which must be an integer.
es: Retorna una función foránea en la dirección especificada que debe ser un número entero.

source: Create a C callable function (a callback function) from a Python *callable*.
es: Crear una función de llamada C (una función de retrollamada) a partir de un *callable* Python.

source: Returns a foreign function exported by a shared library. *func_spec* must be a 2-tuple ``(name_or_ordinal, library)``. The first item is the name of the exported function as string, or the ordinal of the exported function as small integer. The second item is the shared library instance.
es: Retorna una función foránea exportada por una biblioteca compartida. *func_spec* debe ser un 2-tupla ``(name_or_ordinal, library)``. El primer elemento es el nombre de la función exportada como cadena, o el ordinal de la función exportada como entero pequeño. El segundo elemento es la instancia de la biblioteca compartida.

source: Returns a foreign function that will call a COM method. *vtbl_index* is the index into the virtual function table, a small non-negative integer. *name* is name of the COM method. *iid* is an optional pointer to the interface identifier which is used in extended error reporting.
es: Retorna una función foránea que llamará a un método COM. *vtbl_index* es el índice de la tabla de funciones virtuales, un pequeño entero no negativo. *name* es el nombre del método COM. *iid* es un puntero opcional para el identificador de la interfaz que se utiliza en el informe de errores extendido.

source: The optional *paramflags* parameter creates foreign function wrappers with much more functionality than the features described above.
es: El parámetro opcional *paramflags* crea envoltorios de funciones foráneas con mucha más funcionalidad que las características descritas anteriormente.

source: Each item in this tuple contains further information about a parameter, it must be a tuple containing one, two, or three items.
es: Cada elemento de esta tupla contiene más información sobre un parámetro, debe ser una tupla que contenga uno, dos o tres elementos.

source: The first item is an integer containing a combination of direction flags for the parameter:
es: El primer elemento es un entero que contiene una combinación de flags de dirección para el parámetro:

source: Specifies an input parameter to the function.
es: Especifica un parámetro de entrada a la función.

source: Output parameter. The foreign function fills in a value.
es: Parámetro de salida. La función foránea rellena un valor.

source: Input parameter which defaults to the integer zero.
es: Parámetro de entrada que por defecto es el cero entero.

source: The optional second item is the parameter name as string. If this is specified, the foreign function can be called with named parameters.
es: El segundo elemento opcional es el nombre del parámetro como cadena. Si se especifica esto, se puede llamar a la función foránea con parámetros con nombre.

source: The optional third item is the default value for this parameter.
es: El tercer elemento opcional es el valor por defecto de este parámetro.

source: This example demonstrates how to wrap the Windows ``MessageBoxW`` function so that it supports default parameters and named arguments. The C declaration from the windows header file is this::
es: Este ejemplo demuestra cómo envolver la función ``MessageBoxW`` de Windows para que soporte los parámetros por defecto y los argumentos con nombre. La declaración C del archivo de cabecera de Windows es esta::

source: Here is the wrapping with :mod:`ctypes`::
es: Aquí está el envoltorio con :mod:`ctypes`::

source: The ``MessageBox`` foreign function can now be called in these ways::
es: La función foránea de ``MessageBox`` puede ser llamada de esta manera:

source: A second example demonstrates output parameters. The win32 ``GetWindowRect`` function retrieves the dimensions of a specified window by copying them into ``RECT`` structure that the caller has to supply. Here is the C declaration::
es: Un segundo ejemplo demuestra los parámetros de salida. La función ``GetWindowRect`` de win32 retorna las dimensiones de una ventana especificada copiándolas en la estructura ``RECT`` que la persona que llama tiene que suministrar. Aquí está la declaración C::

source: Functions with output parameters will automatically return the output parameter value if there is a single one, or a tuple containing the output parameter values when there are more than one, so the GetWindowRect function now returns a RECT instance, when called.
es: Las funciones con parámetros de salida retornarán automáticamente el valor del parámetro de salida si hay uno solo, o una tupla que contiene los valores del parámetro de salida cuando hay más de uno, por lo que la función GetWindowRect retorna ahora una instancia RECT, cuando se llama.

source: Utility functions
es: Funciones de utilidad

source: Returns the address of the memory buffer as integer. *obj* must be an instance of a ctypes type.
es: Retorna la dirección del buffer de memoria como un entero. *obj* debe ser una instancia de tipo ctypes.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.addressof`` with argument ``obj``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.addressof`` con el argumento ``obj``.

source: Returns the alignment requirements of a ctypes type. *obj_or_type* must be a ctypes type or instance.
es: Retorna los requerimientos de alineación de un tipo de ctypes. *obj_or_type* debe ser un tipo o instancia ctypes.

source: Returns a light-weight pointer to *obj*, which must be an instance of a ctypes type. *offset* defaults to zero, and must be an integer that will be added to the internal pointer value.
es: Retorna un puntero ligero a *obj*, que debe ser un ejemplo de un tipo de ctypes. *offset* es por defecto cero, y debe ser un entero que se añadirá al valor del puntero interno.

source: ``byref(obj, offset)`` corresponds to this C code::
es: ``byref(obj, offset)`` corresponde a este código C::

source: The returned object can only be used as a foreign function call parameter. It behaves similar to ``pointer(obj)``, but the construction is a lot faster.
es: El objeto retornado sólo puede ser utilizado como un parámetro de llamada de función foránea. Se comporta de manera similar a ``pointer(obj)``, pero la construcción es mucho más rápida.

source: This function is similar to the cast operator in C. It returns a new instance of *type* which points to the same memory block as *obj*. *type* must be a pointer type, and *obj* must be an object that can be interpreted as a pointer.
es: Esta función es similar a la del operador de reparto en C. retorna una nueva instancia de *type* que apunta al mismo bloque de memoria que *obj*. *type* debe ser un tipo de puntero, y *obj* debe ser un objeto que pueda ser interpretado como un puntero.

source: This function creates a mutable character buffer. The returned object is a ctypes array of :class:`c_char`.
es: Esta función crea un búfer de caracteres mutables. El objeto retornado es un arreglo de ctypes de :class:`c_char`.

source: *init_or_size* must be an integer which specifies the size of the array, or a bytes object which will be used to initialize the array items.
es: *init_or_size* debe ser un número entero que especifique el tamaño del arreglo, o un objeto de bytes que se utilizará para inicializar los elementos del arreglo.

source: If a bytes object is specified as first argument, the buffer is made one item larger than its length so that the last element in the array is a NUL termination character. An integer can be passed as second argument which allows specifying the size of the array if the length of the bytes should not be used.
es: Si se especifica un objeto bytes como primer argumento, el buffer se hace un elemento más grande que su longitud, de modo que el último elemento del arreglo es un carácter de terminación NUL. Se puede pasar un entero como segundo argumento que permite especificar el tamaño del arreglo si no se debe utilizar la longitud de los bytes.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.create_string_buffer`` with arguments ``init``, ``size``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.create_string_buffer`` con argumentos ``init``, ``size``.

source: This function creates a mutable unicode character buffer. The returned object is a ctypes array of :class:`c_wchar`.
es: Esta función crea un búfer de caracteres unicode mutable. El objeto retornado es un arreglo de ctypes de :class:`c_wchar`.

source: *init_or_size* must be an integer which specifies the size of the array, or a string which will be used to initialize the array items.
es: *init_or_size* debe ser un entero que especifique el tamaño del arreglo, o una cadena que se utilizará para inicializar los elementos del arreglo.

source: If a string is specified as first argument, the buffer is made one item larger than the length of the string so that the last element in the array is a NUL termination character. An integer can be passed as second argument which allows specifying the size of the array if the length of the string should not be used.
es: Si se especifica una cadena como primer argumento, el búfer se hace un elemento más grande que la longitud de la cadena, de modo que el último elemento del arreglo es un carácter de terminación NUL. Se puede pasar un entero como segundo argumento que permite especificar el tamaño del arreglo si no se debe utilizar la longitud de la cadena.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.create_unicode_buffer`` with arguments ``init``, ``size``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.create_unicode_buffer`` con argumentos ``init``, ``size``.

source: Windows only: This function is a hook which allows implementing in-process COM servers with ctypes. It is called from the DllCanUnloadNow function that the _ctypes extension dll exports.
es: Sólo Windows: Esta función es un gancho que permite implementar servidores COM en proceso con ctypes. Se llama desde la función DllCanUnloadNow que la extensión _ctypes dll exporta.

source: Windows only: This function is a hook which allows implementing in-process COM servers with ctypes. It is called from the DllGetClassObject function that the ``_ctypes`` extension dll exports.
es: Sólo Windows: Esta función es un gancho que permite implementar servidores COM en proceso con ctypes. Se llama desde la función DllGetClassObject que la extensión ``_ctypes`` exporta.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like ``lib``, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
es: Intenta encontrar una biblioteca y retornar un nombre de ruta. *name* es el nombre de la biblioteca sin ningún prefijo como ``lib``, sufijo como ``.so``, ``.dylib`` o número de versión (esta es la forma usada para la opción del enlazador posix :option:`!-l`). Si no se puede encontrar ninguna biblioteca, retorna ``None``.

source: Windows only: return the filename of the VC runtime library used by Python, and by the extension modules. If the name of the library cannot be determined, ``None`` is returned.
es: Sólo Windows: retorna el nombre de archivo de la biblioteca de tiempo de ejecución de VC usada por Python, y por los módulos de extensión. Si no se puede determinar el nombre de la biblioteca, se retorna ``None``.

source: If you need to free memory, for example, allocated by an extension module with a call to the ``free(void *)``, it is important that you use the function in the same library that allocated the memory.
es: Si necesita liberar memoria, por ejemplo, asignada por un módulo de extensión con una llamada al ``free(void *)``, es importante que utilice la función en la misma biblioteca que asignó la memoria.

source: Windows only: Returns a textual description of the error code *code*. If no error code is specified, the last error code is used by calling the Windows api function GetLastError.
es: Sólo Windows: retorna una descripción textual del código de error *code*. Si no se especifica ningún código de error, se utiliza el último código de error llamando a la función de api de Windows GetLastError.

source: Windows only: Returns the last error code set by Windows in the calling thread. This function calls the Windows ``GetLastError()`` function directly, it does not return the ctypes-private copy of the error code.
es: Solo Windows: retorna el último código de error establecido por Windows en el hilo de llamada. Esta función llama directamente a la función ``GetLastError()`` de Windows, no retorna la copia privada ctypes del código de error.

source: Returns the current value of the ctypes-private copy of the system :data:`errno` variable in the calling thread.
es: Retorna el valor actual de la copia ctypes-private de la variable de sistema :data:`errno` en el hilo de llamada.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.get_errno`` with no arguments.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.get_errno`` sin argumentos.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.get_last_error`` with no arguments.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.get_last_error`` sin argumentos.
