Repository: python/python-docs-es
Catalog: library/ctypes.po
Languages: es

source: Same as the standard C memmove library function: copies *count* bytes from *src* to *dst*. *dst* and *src* must be integers or ctypes instances that can be converted to pointers.
es: Igual que la función de la biblioteca estándar de C *memmove*: copia *count* bytes de *src* a *dst*. *dst* y *src* deben ser enteros o instancias ctypes que pueden ser convertidos en punteros.

source: Same as the standard C memset library function: fills the memory block at address *dst* with *count* bytes of value *c*. *dst* must be an integer specifying an address, or a ctypes instance.
es: Igual que la función de la biblioteca estándar de C *memset* C: llena el bloque de memoria en la dirección *dst* con *count* bytes de valor *c*. *dst* debe ser un número entero que especifique una dirección, o una instancia ctypes.

source: Note: If you just want to pass a pointer to an object to a foreign function call, you should use ``byref(obj)`` which is much faster.
es: Nota: Si sólo quieres pasar un puntero a un objeto a una llamada de función foránea, deberías usar ``byref(obj)`` que es mucho más rápido.

source: This function resizes the internal memory buffer of *obj*, which must be an instance of a ctypes type. It is not possible to make the buffer smaller than the native size of the objects type, as given by ``sizeof(type(obj))``, but it is possible to enlarge the buffer.
es: Esta función redimensiona el búfer de memoria interna de *obj*, que debe ser una instancia de tipo ctypes. No es posible hacer el buffer más pequeño que el tamaño nativo del tipo de objetos, como lo indica ``size of (type(obj))``, pero es posible agrandar el buffer.

source: Set the current value of the ctypes-private copy of the system :data:`errno` variable in the calling thread to *value* and return the previous value.
es: Poner el valor actual de la copia ctypes-private de la variable del sistema :data:`errno` en el hilo de llamada a *valor* y retornar el valor anterior.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.set_errno`` with argument ``errno``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.set_errno`` con argumento ``errno``.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.set_last_error`` with argument ``error``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.set_last_error`` con argumento ``error``.

source: Returns the size in bytes of a ctypes type or instance memory buffer. Does the same as the C ``sizeof`` operator.
es: Retorna el tamaño en bytes de un buffer de memoria tipo ctypes o instancia. Hace lo mismo que el operador C ``sizeof``.

source: This function returns the C string starting at memory address *address* as a bytes object. If size is specified, it is used as size, otherwise the string is assumed to be zero-terminated.
es: Esta función retorna la cadena C que comienza en la dirección de memoria *address* como un objeto de bytes. Si se especifica el tamaño, se utiliza como tamaño, de lo contrario se asume que la cadena tiene un final cero.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.string_at`` with arguments ``address``, ``size``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.string_at`` con argumentos ``address``, ``size``.

source: Windows only: this function is probably the worst-named thing in ctypes. It creates an instance of OSError. If *code* is not specified, ``GetLastError`` is called to determine the error code. If *descr* is not specified, :func:`FormatError` is called to get a textual description of the error.
es: Sólo para Windows: esta función es probablemente la cosa peor nombrada de los ctypes. Crea una instancia de OSError. Si no se especifica el *code*, se llama a ``GetLastError`` para determinar el código de error. Si no se especifica *descr*, se llama a :func:`FormatError`` para obtener una descripción textual del error.

source: An instance of :exc:`WindowsError` used to be created.
es: Una instancia de :exc:`WindowsError` solía ser creada.

source: This function returns the wide character string starting at memory address *address* as a string. If *size* is specified, it is used as the number of characters of the string, otherwise the string is assumed to be zero-terminated.
es: Esta función retorna la cadena de caracteres anchos que comienza en la dirección de memoria *address* como una cadena. Si se especifica *size*, se utiliza como el número de caracteres de la cadena, de lo contrario se asume que la cadena tiene un final cero.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.wstring_at`` with arguments ``address``, ``size``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.wstring_at`` con argumentos ``address``, ``size``.

source: Data types
es: Tipos de datos

source: This non-public class is the common base class of all ctypes data types. Among other things, all ctypes type instances contain a memory block that hold C compatible data; the address of the memory block is returned by the :func:`addressof` helper function. Another instance variable is exposed as :attr:`_objects`; this contains other Python objects that need to be kept alive in case the memory block contains pointers.
es: Esta clase no pública es la clase de base común de todos los tipos de datos de los ctypes. Entre otras cosas, todas las instancias de tipo ctypes contienen un bloque de memoria que contiene datos compatibles con C; la dirección del bloque de memoria es retornada por la función de ayuda :func:`addressof`. Otra variable de instancia se expone como :attr:`_objetos`; ésta contiene otros objetos de Python que deben mantenerse vivos en caso de que el bloque de memoria contenga punteros.

source: Common methods of ctypes data types, these are all class methods (to be exact, they are methods of the :term:`metaclass`):
es: Métodos comunes de tipos de datos ctypes, estos son todos métodos de clase (para ser exactos, son métodos del :term:`metaclass`):

source: This method returns a ctypes instance that shares the buffer of the *source* object. The *source* object must support the writeable buffer interface. The optional *offset* parameter specifies an offset into the source buffer in bytes; the default is zero. If the source buffer is not large enough a :exc:`ValueError` is raised.
es: Este método retorna una instancia ctypes que comparte el buffer del objeto *source*. El objeto *source* debe soportar la interfaz del buffer de escritura. El parámetro opcional *offset* especifica un offset en el buffer de la fuente en bytes; el valor por defecto es cero. Si el buffer de la fuente no es lo suficientemente grande se lanza un :exc:`ValueError`.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.cdata/buffer`` with arguments ``pointer``, ``size``, ``offset``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.cdata/buffer`` con argumentos ``pointer``, ``size``, ``offset``.

source: This method creates a ctypes instance, copying the buffer from the *source* object buffer which must be readable. The optional *offset* parameter specifies an offset into the source buffer in bytes; the default is zero. If the source buffer is not large enough a :exc:`ValueError` is raised.
es: Este método crea una instancia ctypes, copiando el buffer del buffer de objetos *source* que debe ser legible. El parámetro opcional *offset* especifica un offset en el buffer de origen en bytes; el valor por defecto es cero. Si el buffer de fuente no es lo suficientemente grande se lanza un :exc:`ValueError`.

source: This method returns a ctypes type instance using the memory specified by *address* which must be an integer.
es: Este método retorna una instancia de tipo ctypes utilizando la memoria especificada por *address* que debe ser un entero.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.cdata`` with argument ``address``.
es: Lanza un :ref:`auditing event <auditing>` ``ctypes.cdata`` con argumento ``address``.

source: This method, and others that indirectly call this method, raises an :ref:`auditing event <auditing>` ``ctypes.cdata`` with argument ``address``.
es: Este método, y otros que indirectamente llaman a este método, lanzan un :ref:`auditing event <auditing>` ``ctypes.cdata`` con argumento ``address``.

source: All ctypes data types have a default implementation of this classmethod that normally returns *obj* if that is an instance of the type. Some types accept other objects as well.
es: Todos los tipos de datos ctypes tienen una implementación por defecto de este método de clase que normalmente retorna *obj* si es una instancia del tipo. Algunos tipos aceptan también otros objetos.

source: This method returns a ctypes type instance exported by a shared library. *name* is the name of the symbol that exports the data, *library* is the loaded shared library.
es: Este método retorna una instancia de tipo ctypes exportada por una biblioteca compartida. *name* es el nombre del símbolo que exporta los datos, *library* es la biblioteca compartida cargada.

source: Common instance variables of ctypes data types:
es: Variables de instancia común de los tipos de datos de ctypes:

source: Sometimes ctypes data instances do not own the memory block they contain, instead they share part of the memory block of a base object. The :attr:`_b_base_` read-only member is the root ctypes object that owns the memory block.
es: A veces, las instancias de datos ctypes no poseen el bloque de memoria que contienen, sino que comparten parte del bloque de memoria de un objeto base. El miembro de sólo lectura :attr:`_b_base_` es el objeto raíz ctypes que posee el bloque de memoria.

source: This read-only variable is true when the ctypes data instance has allocated the memory block itself, false otherwise.
es: Esta variable de sólo lectura es verdadera cuando la instancia de datos ctypes ha sido asignada a el propio bloque de memoria, falsa en caso contrario.

source: This member is either ``None`` or a dictionary containing Python objects that need to be kept alive so that the memory block contents is kept valid. This object is only exposed for debugging; never modify the contents of this dictionary.
es: Este miembro es ``None`` o un diccionario que contiene objetos de Python que deben mantenerse vivos para que el contenido del bloque de memoria sea válido. Este objeto sólo se expone para su depuración; nunca modifique el contenido de este diccionario.

source: This non-public class is the base class of all fundamental ctypes data types. It is mentioned here because it contains the common attributes of the fundamental ctypes data types. :class:`_SimpleCData` is a subclass of :class:`_CData`, so it inherits their methods and attributes. ctypes data types that are not and do not contain pointers can now be pickled.
es: Esta clase no pública es la clase base de todos los tipos de datos de ctypes fundamentales. Se menciona aquí porque contiene los atributos comunes de los tipos de datos de ctypes fundamentales. :class:`_SimpleCData` es una subclase de :class:`_CData`, por lo que hereda sus métodos y atributos. Los tipos de datos ctypes que no son y no contienen punteros ahora pueden ser archivados.

source: Instances have a single attribute:
es: Los instancias tienen un solo atributo:

source: This attribute contains the actual value of the instance. For integer and pointer types, it is an integer, for character types, it is a single character bytes object or string, for character pointer types it is a Python bytes object or string.
es: Este atributo contiene el valor real de la instancia. Para los tipos enteros y punteros, es un entero, para los tipos de caracteres, es un objeto o cadena de bytes de un solo carácter, para los tipos de punteros de caracteres es un objeto o cadena de bytes de Python.

source: When the ``value`` attribute is retrieved from a ctypes instance, usually a new object is returned each time. :mod:`ctypes` does *not* implement original object return, always a new object is constructed. The same is true for all other ctypes object instances.
es: Cuando el atributo ``value`` se recupera de una instancia ctypes, normalmente se retorna un nuevo objeto cada vez. :mod:`ctypes` *no* implementa el retorno del objeto original, siempre se construye un nuevo objeto. Lo mismo ocurre con todas las demás instancias de objetos ctypes.

source: These are the fundamental ctypes data types:
es: Estos son los tipos de datos fundamentales de ctypes:

source: Represents the C :c:expr:`signed char` datatype, and interprets the value as small integer. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`signed char` e interpreta el valor como un entero pequeño. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`char` datatype, and interprets the value as a single character. The constructor accepts an optional string initializer, the length of the string must be exactly one character.
es: Representa el tipo de datos C :c:expr:`char` e interpreta el valor como un solo carácter. El constructor acepta un inicializador de cadena opcional, la longitud de la cadena debe ser exactamente un carácter.

source: Represents the C :c:expr:`char *` datatype when it points to a zero-terminated string. For a general character pointer that may also point to binary data, ``POINTER(c_char)`` must be used. The constructor accepts an integer address, or a bytes object.
es: Representa el tipo de datos C :c:expr:`char *` cuando apunta a una cadena terminada en cero. Para un puntero de carácter general que también puede apuntar a datos binarios, se debe usar ``POINTER(c_char)``. El constructor acepta una dirección entera o un objeto de bytes.

source: Represents the C :c:expr:`double` datatype. The constructor accepts an optional float initializer.
es: Representa el tipo de datos C :c:expr:`double`. El constructor acepta un inicializador flotante opcional.

source: Represents the C :c:expr:`long double` datatype. The constructor accepts an optional float initializer. On platforms where ``sizeof(long double) == sizeof(double)`` it is an alias to :class:`c_double`.
es: Representa el tipo de datos C :c:expr:`long double`. El constructor acepta un inicializador flotante opcional. En plataformas donde ``sizeof(long double) == sizeof(double)`` es un alias de :class:`c_double`.

source: Represents the C :c:expr:`float` datatype. The constructor accepts an optional float initializer.
es: Representa el tipo de datos C :c:expr:`float`. El constructor acepta un inicializador flotante opcional.

source: Represents the C :c:expr:`signed int` datatype. The constructor accepts an optional integer initializer; no overflow checking is done. On platforms where ``sizeof(int) == sizeof(long)`` it is an alias to :class:`c_long`.
es: Representa el tipo de datos C :c:expr:`signed int`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento. En plataformas donde ``sizeof(int) == sizeof(long)`` es un alias de :class:`c_long`.

source: Represents the C 8-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_byte`.
es: Representa el tipo de datos :c:expr:`signed int` de C de 8 bits. Por lo general, un alias para :class:`c_byte`.

source: Represents the C 16-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_short`.
es: Representa el tipo de datos :c:expr:`signed int` de C de 16 bits. Por lo general, un alias para :class:`c_short`.

source: Represents the C 32-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_int`.
es: Representa el tipo de datos :c:expr:`signed int` de C de 32 bits. Por lo general, un alias para :class:`c_int`.

source: Represents the C 64-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_longlong`.
es: Representa el tipo de datos :c:expr:`signed int` de C de 64 bits. Por lo general, un alias para :class:`c_longlong`.

source: Represents the C :c:expr:`signed long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`signed long`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`signed long long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`signed long long`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`signed short` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`signed short`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:type:`size_t` datatype.
es: Representa el tipo de datos C :c:type:`size_t`.

source: Represents the C :c:type:`ssize_t` datatype.
es: Representa el tipo de datos C :c:type:`ssize_t`.

source: Represents the C :c:expr:`unsigned char` datatype, it interprets the value as small integer. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`unsigned char`, interpreta el valor como un entero pequeño. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`unsigned int` datatype. The constructor accepts an optional integer initializer; no overflow checking is done. On platforms where ``sizeof(int) == sizeof(long)`` it is an alias for :class:`c_ulong`.
es: Representa el tipo de datos C :c:expr:`unsigned int`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento. En plataformas donde ``sizeof(int) == sizeof(long)`` es un alias para :class:`c_ulong`.

source: Represents the C 8-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_ubyte`.
es: Representa el tipo de datos :c:expr:`unsigned int` de C de 8 bits. Por lo general, un alias para :class:`c_ubyte`.

source: Represents the C 16-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_ushort`.
es: Representa el tipo de datos :c:expr:`unsigned int` de C de 16 bits. Por lo general, un alias para :class:`c_ushort`.

source: Represents the C 32-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_uint`.
es: Representa el tipo de datos :c:expr:`unsigned int` de C de 32 bits. Por lo general, un alias para :class:`c_uint`.

source: Represents the C 64-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_ulonglong`.
es: Representa el tipo de datos :c:expr:`unsigned int` de C de 64 bits. Por lo general, un alias para :class:`c_ulonglong`.

source: Represents the C :c:expr:`unsigned long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`unsigned long`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`unsigned long long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`unsigned long long`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`unsigned short` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
es: Representa el tipo de datos C :c:expr:`unsigned short`. El constructor acepta un inicializador entero opcional; no se realiza ninguna comprobación de desbordamiento.

source: Represents the C :c:expr:`void *` type. The value is represented as integer. The constructor accepts an optional integer initializer.
es: Representa el tipo C :c:expr:`void *`. El valor se representa como un número entero. El constructor acepta un inicializador entero opcional.

source: Represents the C :c:expr:`wchar_t *` datatype, which must be a pointer to a zero-terminated wide character string. The constructor accepts an integer address, or a string.
es: Representa el tipo de datos C :c:expr:`wchar_t *`, que debe ser un puntero a una cadena de caracteres anchos terminada en cero. El constructor acepta una dirección entera o una cadena.

source: Represent the C :c:expr:`bool` datatype (more accurately, :c:expr:`_Bool` from C99). Its value can be ``True`` or ``False``, and the constructor accepts any object that has a truth value.
es: Representa el tipo de dato C :c:expr:`bool` (más precisamente, :c:expr:`_Bool` de C99). Su valor puede ser ``True`` o ``False``, y el constructor acepta cualquier objeto que tenga un valor de verdad.

source: Represents the C :c:expr:`PyObject *` datatype. Calling this without an argument creates a ``NULL`` :c:expr:`PyObject *` pointer.
es: Representa el tipo de dato de C :c:expr:`PyObject *`. Llamar esto sin un argumento crea un puntero :c:expr:`PyObject *` ``NULL``.

source: Structured data types
es: Tipos de datos estructurados

source: Abstract base class for unions in native byte order.
es: Clase base abstracta para uniones en orden de bytes nativos.

source: Abstract base class for unions in *big endian* byte order.
es: Clase base abstracta para uniones en orden de bytes *big endian*.

source: Abstract base class for unions in *little endian* byte order.
es: Clase base abstracta para uniones en orden de bytes *little endian*.

source: Abstract base class for structures in *big endian* byte order.
es: Clase base abstracta para estructuras en orden de bytes *big endian*.

source: Abstract base class for structures in *little endian* byte order.
es: Clase base abstracta para estructuras en orden de bytes *little endian*.

source: Structures and unions with non-native byte order cannot contain pointer type fields, or any other data types containing pointer type fields.
es: Las estructuras y uniones con un orden de bytes no nativo no pueden contener campos de tipo puntero ni ningún otro tipo de datos que contenga campos de tipo puntero.

source: Abstract base class for structures in *native* byte order.
es: Clase base abstracta para estructuras en orden de bytes *native*.

source: Concrete structure and union types must be created by subclassing one of these types, and at least define a :attr:`_fields_` class variable. :mod:`ctypes` will create :term:`descriptor`\s which allow reading and writing the fields by direct attribute accesses. These are the
es: La estructura concreta y los tipos de unión deben crearse subclasificando uno de estos tipos, y al menos definir una variable de clase :attr:`_fields_`. :mod:`ctypes` creará :term:`descriptor`\s que permitan leer y escribir los campos por accesos directos de atributos. Estos son los

source: A sequence defining the structure fields. The items must be 2-tuples or 3-tuples. The first item is the name of the field, the second item specifies the type of the field; it can be any ctypes data type.
es: Una secuencia que define los campos de estructura. Los elementos deben ser de 2 o 3 tuplas. El primer ítem es el nombre del campo, el segundo ítem especifica el tipo de campo; puede ser cualquier tipo de datos ctypes.

source: For integer type fields like :class:`c_int`, a third optional item can be given. It must be a small positive integer defining the bit width of the field.
es: Para los campos de tipo entero como :class:`c_int`, se puede dar un tercer elemento opcional. Debe ser un pequeño entero positivo que defina el ancho de bit del campo.
