Repository: python/python-docs-es
Catalog: library/ctypes.po
Languages: es

source: The :func:`cast` function can be used to cast a ctypes instance into a pointer to a different ctypes data type. :func:`cast` takes two parameters, a ctypes object that is or can be converted to a pointer of some kind, and a ctypes pointer type. It returns an instance of the second argument, which references the same memory block as the first argument::
es: La función :func:`cast` puede ser usada para lanzar una instancia ctypes en un puntero a un tipo de datos ctypes diferente. :func:`cast` toma dos parámetros, un objeto ctypes que es o puede ser convertido en un puntero de algún tipo, y un tipo de puntero ctypes. retorna una instancia del segundo argumento, que hace referencia al mismo bloque de memoria que el primer argumento::

source: So, :func:`cast` can be used to assign to the ``values`` field of ``Bar`` the structure::
es: Así, :func:`cast` puede ser usado para asignar al campo ``values`` de ``Bar`` la estructura::

source: Incomplete Types
es: Tipos incompletos

source: *Incomplete Types* are structures, unions or arrays whose members are not yet specified. In C, they are specified by forward declarations, which are defined later::
es: *Los Tipos Incompletos* son estructuras, uniones o matrices cuyos miembros aún no están especificados. En C, se especifican mediante declaraciones a futuro, que se definen más adelante::

source: The straightforward translation into ctypes code would be this, but it does not work::
es: La traducción directa al código de ctypes sería esta, pero no funciona::

source: Let's try it. We create two instances of ``cell``, and let them point to each other, and finally follow the pointer chain a few times::
es: Vamos a intentarlo. Creamos dos instancias de ``cell``, y dejamos que se apunten una a la otra, y finalmente seguimos la cadena de punteros unas cuantas veces::

source: Callback functions
es: Funciones de retrollamadas (*callback*)

source: :mod:`ctypes` allows creating C callable function pointers from Python callables. These are sometimes called *callback functions*.
es: :mod:`ctypes` permite crear punteros de función invocables C a partir de los invocables de Python. A veces se llaman *funciones de retrollamada*.

source: First, you must create a class for the callback function. The class knows the calling convention, the return type, and the number and types of arguments this function will receive.
es: Primero, debes crear una clase para la función de retrollamada. La clase conoce la convención de llamada, el tipo de retorno, y el número y tipos de argumentos que esta función recibirá.

source: The :func:`CFUNCTYPE` factory function creates types for callback functions using the ``cdecl`` calling convention. On Windows, the :func:`WINFUNCTYPE` factory function creates types for callback functions using the ``stdcall`` calling convention.
es: La función de fábrica :func:`CFUNCTYPE`` crea tipos para las funciones de retrollamada usando la convención de llamada ``cdecl``. En Windows, la función de fábrica :func:`WINFUNCTYPE` crea tipos para funciones de retrollamadas usando la convención de llamadas ``stdcall``.

source: Both of these factory functions are called with the result type as first argument, and the callback functions expected argument types as the remaining arguments.
es: Ambas funciones de fábrica se llaman con el tipo de resultado como primer argumento, y las funciones de llamada de retorno con los tipos de argumentos esperados como los argumentos restantes.

source: So our callback function receives pointers to integers, and must return an integer. First we create the ``type`` for the callback function::
es: Así que nuestra función de retrollamada recibe punteros a números enteros, y debe retornar un número entero. Primero creamos el ``tipo`` para la función de retrollamada:

source: To get started, here is a simple callback that shows the values it gets passed::
es: Para empezar, aquí hay una simple llamada que muestra los valores que se pasan::

source: The result::
es: El resultado::

source: Now we can actually compare the two items and return a useful result::
es: Ahora podemos comparar los dos artículos y obtener un resultado útil::

source: As we can easily check, our array is sorted now::
es: Como podemos comprobar fácilmente, nuestro arreglo está ordenado ahora::

source: The function factories can be used as decorator factories, so we may as well write::
es: Las funciones de fabrica pueden ser usadas como decoradores de fabrica, así que podemos escribir::

source: Make sure you keep references to :func:`CFUNCTYPE` objects as long as they are used from C code. :mod:`ctypes` doesn't, and if you don't, they may be garbage collected, crashing your program when a callback is made.
es: Asegúrate de mantener las referencias a los objetos :func:`CFUNCTYPE` mientras se usen desde el código C. :mod:`ctypes` no lo hace, y si no lo haces, pueden ser basura recolectada, colapsando tu programa cuando se hace una llamada.

source: Also, note that if the callback function is called in a thread created outside of Python's control (e.g. by the foreign code that calls the callback), ctypes creates a new dummy Python thread on every invocation. This behavior is correct for most purposes, but it means that values stored with :class:`threading.local` will *not* survive across different callbacks, even when those calls are made from the same C thread.
es: Además, nótese que sí se llama a la función de retrollamada en un hilo creado fuera del control de Python (por ejemplo, por el código foráneo que llama a la retrollamada), ctypes crea un nuevo hilo Python tonto en cada invocación. Este comportamiento es correcto para la mayoría de los propósitos, pero significa que los valores almacenados con :class:`threading.local` *no* sobreviven a través de diferentes llamadas de retorno, incluso cuando esas llamadas se hacen desde el mismo hilo C.

source: Accessing values exported from dlls
es: Acceder a los valores exportados de los dlls

source: If the interpreter would have been started with :option:`-O`, the sample would have printed ``c_long(1)``, or ``c_long(2)`` if :option:`-OO` would have been specified.
es: Si el intérprete se hubiera iniciado con :option:`-O`, el ejemplo habría impreso ``c_long(1)``, o ``c_long(2)`` si :option:`-OO` se hubiera especificado.

source: An extended example which also demonstrates the use of pointers accesses the :c:data:`PyImport_FrozenModules` pointer exported by Python.
es: Un ejemplo extendido que también demuestra el uso de punteros accediendo al puntero :c:data:`PyImport_FrozenModules` exportado por Python.

source: Quoting the docs for that value:
es: Citando los documentos para ese valor:

source: This pointer is initialized to point to an array of :c:struct:`_frozen` records, terminated by one whose members are all ``NULL`` or zero. When a frozen module is imported, it is searched in this table. Third-party code could play tricks with this to provide a dynamically created collection of frozen modules.
es: Este puntero se inicializa para apuntar a un arreglo de registros :c:struct:`_frozen`, terminados por uno cuyos miembros son todos ``NULL`` o cero. Cuando se importa un módulo congelado, se busca en esta tabla. El código de terceros podría jugar trucos con esto para proporcionar una colección de módulos congelados creada dinámicamente.

source: So manipulating this pointer could even prove useful. To restrict the example size, we show only how this table can be read with :mod:`ctypes`::
es: Así que manipular este puntero podría incluso resultar útil. Para restringir el tamaño del ejemplo, sólo mostramos cómo esta tabla puede ser leída con :mod:`ctypes`::

source: We have defined the :c:struct:`_frozen` data type, so we can get the pointer to the table::
es: Hemos definido el tipo de datos :c:struct:`_frozen`, por lo que podemos obtener el puntero a la tabla::

source: Since ``table`` is a ``pointer`` to the array of ``struct_frozen`` records, we can iterate over it, but we just have to make sure that our loop terminates, because pointers have no size. Sooner or later it would probably crash with an access violation or whatever, so it's better to break out of the loop when we hit the ``NULL`` entry::
es: Como ``tabla`` es un ``puntero`` al arreglo de registros ``struct_frozen``, podemos iterar sobre ella, pero sólo tenemos que asegurarnos de que nuestro bucle termine, porque los punteros no tienen tamaño. Tarde o temprano, probablemente se caerá con una violación de acceso o lo que sea, así que es mejor salir del bucle cuando le demos a la entrada ``NULL``::

source: The fact that standard Python has a frozen module and a frozen package (indicated by the negative ``size`` member) is not well known, it is only used for testing. Try it out with ``import __hello__`` for example.
es: El hecho de que la Python estándar tenga un módulo congelado y un paquete congelado (indicado por el miembro ``tamaño`` negativo) no se conoce bien, sólo se usa para hacer pruebas. Pruébalo con ``import __hello__`` por ejemplo.

source: Surprises
es: Sorpresas

source: There are some edges in :mod:`ctypes` where you might expect something other than what actually happens.
es: Hay algunas aristas en :mod:`ctypes` en las que podrías esperar algo distinto de lo que realmente sucede.

source: Consider the following example::
es: Considere el siguiente ejemplo::

source: Hm. We certainly expected the last statement to print ``3 4 1 2``. What happened? Here are the steps of the ``rc.a, rc.b = rc.b, rc.a`` line above::
es: Hm. Ciertamente esperábamos que la última declaración imprimiera ``3 4 1 2``. ¿Qué ha pasado? Aquí están los pasos de la línea ``rc.a, rc.b = rc.b, rc.a`` arriba::

source: Note that ``temp0`` and ``temp1`` are objects still using the internal buffer of the ``rc`` object above. So executing ``rc.a = temp0`` copies the buffer contents of ``temp0`` into ``rc`` 's buffer. This, in turn, changes the contents of ``temp1``. So, the last assignment ``rc.b = temp1``, doesn't have the expected effect.
es: Note que ``temp0`` y ``temp1`` son objetos que todavía usan el buffer interno del objeto ``rc`` de arriba. Así que ejecutando ``rc.a = temp0`` copia el contenido del buffer de ``temp0`` en el buffer de ``rc``. Esto, a su vez, cambia el contenido de ``temp1``. Por lo tanto, la última asignación ``rc.b = temp1``, no tiene el efecto esperado.

source: Keep in mind that retrieving sub-objects from Structure, Unions, and Arrays doesn't *copy* the sub-object, instead it retrieves a wrapper object accessing the root-object's underlying buffer.
es: Tengan en cuenta que la recuperación de subobjetos de Estructuras, Uniones y Arreglos no *copia* el subobjeto, sino que recupera un objeto contenido que accede al búfer subyacente del objeto raíz.

source: Another example that may behave differently from what one would expect is this::
es: Otro ejemplo que puede comportarse de manera diferente a lo que uno esperaría es este::

source: Objects instantiated from :class:`c_char_p` can only have their value set to bytes or integers.
es: Los objetos instanciados desde :class:`c_char_p` sólo pueden tener su valor fijado en bytes o enteros.

source: Why is it printing ``False``? ctypes instances are objects containing a memory block plus some :term:`descriptor`\s accessing the contents of the memory. Storing a Python object in the memory block does not store the object itself, instead the ``contents`` of the object is stored. Accessing the contents again constructs a new Python object each time!
es: ¿Por qué está imprimiendo ``False``? Las instancias ctypes son objetos que contienen un bloque de memoria más algunos :term:`descriptor`\s que acceden al contenido de la memoria. Almacenar un objeto Python en el bloque de memoria no almacena el objeto en sí mismo, en su lugar se almacenan los ``contenidos`` del objeto. ¡Acceder a los contenidos de nuevo construye un nuevo objeto Python cada vez!

source: Variable-sized data types
es: Tipos de datos de tamaño variable

source: :mod:`ctypes` provides some support for variable-sized arrays and structures.
es: :mod:`ctypes` proporciona algo de soporte para matrices y estructuras de tamaño variable.

source: The :func:`resize` function can be used to resize the memory buffer of an existing ctypes object. The function takes the object as first argument, and the requested size in bytes as the second argument. The memory block cannot be made smaller than the natural memory block specified by the objects type, a :exc:`ValueError` is raised if this is tried::
es: La función :func:`resize` puede ser usada para redimensionar el buffer de memoria de un objeto ctypes existente. La función toma el objeto como primer argumento, y el tamaño solicitado en bytes como segundo argumento. El bloque de memoria no puede hacerse más pequeño que el bloque de memoria natural especificado por el tipo de objeto, se lanza un :exc:`ValueError` si se intenta::

source: This is nice and fine, but how would one access the additional elements contained in this array? Since the type still only knows about 4 elements, we get errors accessing other elements::
es: Esto está bien, pero ¿cómo se puede acceder a los elementos adicionales contenidos en este arreglo? Dado que el tipo todavía sabe sólo 4 elementos, obtenemos errores al acceder a otros elementos::

source: Another way to use variable-sized data types with :mod:`ctypes` is to use the dynamic nature of Python, and (re-)define the data type after the required size is already known, on a case by case basis.
es: Otra forma de utilizar tipos de datos de tamaño variable con :mod:`ctypes` es utilizar la naturaleza dinámica de Python, y (re)definir el tipo de datos después de que se conozca el tamaño requerido, caso por caso.

source: ctypes reference
es: referencia ctypes

source: Finding shared libraries
es: Encontrar bibliotecas compartidas

source: When programming in a compiled language, shared libraries are accessed when compiling/linking a program, and when the program is run.
es: Cuando se programa en un lenguaje compilado, se accede a las bibliotecas compartidas cuando se compila/enlaza un programa, y cuándo se ejecuta el programa.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like *lib*, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
es: Intenta encontrar una biblioteca y retornar un nombre. *name* es el nombre de la biblioteca sin ningún prefijo como *lib*, sufijo como ``.so``, ``.dylib`` o número de versión (esta es la forma usada para la opción del enlazador posix :option:`!-l`). Si no se puede encontrar ninguna biblioteca, retorna ``None``.

source: The exact functionality is system dependent.
es: La funcionalidad exacta depende del sistema.

source: On Linux, the value of the environment variable ``LD_LIBRARY_PATH`` is used when searching for libraries, if a library cannot be found by any other means.
es: En Linux, el valor de la variable de entorno ``LD_LIBRARY_PATH`` se utiliza cuando se buscan bibliotecas, si una biblioteca no puede ser encontrada por ningún otro medio.

source: Here are some examples::
es: Aquí hay algunos ejemplos::

source: Loading shared libraries
es: Cargando bibliotecas compartidas

source: There are several ways to load shared libraries into the Python process. One way is to instantiate one of the following classes:
es: Hay varias maneras de cargar las bibliotecas compartidas en el proceso Python. Una forma es instanciar una de las siguientes clases:

source: Instances of this class represent loaded shared libraries. Functions in these libraries use the standard C calling convention, and are assumed to return :c:expr:`int`.
es: Las instancias de esta clase representan bibliotecas compartidas cargadas. Las funciones en estas bibliotecas utilizan la convención de llamada estándar de C y se supone que retornan :c:expr:`int`.

source: On Windows creating a :class:`CDLL` instance may fail even if the DLL name exists. When a dependent DLL of the loaded DLL is not found, a :exc:`OSError` error is raised with the message *"[WinError 126] The specified module could not be found".* This error message does not contain the name of the missing DLL because the Windows API does not return this information making this error hard to diagnose. To resolve this error and determine which DLL is not found, you need to find the list of dependent DLLs and determine which one is not found using Windows debugging and tracing tools.
es: En Windows, la creación de una instancia :class:`CDLL` puede fallar incluso si existe el nombre de la DLL. Cuando no se encuentra una DLL dependiente de la DLL cargada, se lanza un error :exc:`OSError` con el mensaje *"[WinError 126] No se pudo encontrar el módulo especificado".* Este mensaje de error no contiene el nombre de DLL que falta porque la API de Windows no retorna esta información, lo que dificulta el diagnóstico de este error. Para resolver este error y determinar qué DLL no se encuentra, debe buscar la lista de DLL dependientes y determinar cuál no se encuentra utilizando las herramientas de depuración y seguimiento de Windows.

source: `Microsoft DUMPBIN tool <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- A tool to find DLL dependents.
es: `Herramienta Microsoft DUMPBIN <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- Una herramienta para encontrar dependientes de DLL.

source: Windows only: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return the windows specific :class:`HRESULT` code. :class:`HRESULT` values contain information specifying whether the function call failed or succeeded, together with additional error code. If the return value signals a failure, an :class:`OSError` is automatically raised.
es: Sólo Windows: Las instancias de esta clase representan bibliotecas compartidas cargadas, las funciones en estas bibliotecas usan la convención de llamada ``stdcall``, y se asume que retornan el código específico de windows :class:`HRESULT``. Los valores :class:`HRESULT`` contienen información que especifica si la llamada a la función falló o tuvo éxito, junto con un código de error adicional. Si el valor de retorno señala un fracaso, se lanza automáticamente un :class:`OSError``.

source: :exc:`WindowsError` used to be raised.
es: :exc:`WindowsError` solía ser lanzado.

source: Windows only: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return :c:expr:`int` by default.
es: Solo Windows: las instancias de esta clase representan bibliotecas compartidas cargadas, las funciones en estas bibliotecas utilizan la convención de llamadas ``stdcall`` y se supone que retornan :c:expr:`int` de forma predeterminada.

source: The Python :term:`global interpreter lock` is released before calling any function exported by these libraries, and reacquired afterwards.
es: El termino Python :term:`global interpreter lock` es lanzado antes de llamar a cualquier función exportada por estas librerías, y se requiere después.

source: Instances of this class behave like :class:`CDLL` instances, except that the Python GIL is *not* released during the function call, and after the function execution the Python error flag is checked. If the error flag is set, a Python exception is raised.
es: Las instancias de esta clase se comportan como instancias :class:`CDLL` , excepto que el GIL de Python es *no* liberado durante la llamada a la función, y después de la ejecución de la función se comprueba si esta activo el flag de error de Python. Si el flag de error esta activado, se lanza una excepción Python.

source: Thus, this is only useful to call Python C api functions directly.
es: Por lo tanto, esto sólo es útil para llamar directamente a las funciones api C de Python.

source: The *mode* parameter can be used to specify how the library is loaded. For details, consult the :manpage:`dlopen(3)` manpage. On Windows, *mode* is ignored. On posix systems, RTLD_NOW is always added, and is not configurable.
es: El parámetro *mode* puede utilizarse para especificar cómo se carga la biblioteca. Para más detalles, consulte la página :manpage:`dlopen(3)` del manual. En Windows, *mode* es ignorado. En los sistemas posix, RTLD_NOW siempre se agrega, y no es configurable.

source: The *use_errno* parameter, when set to true, enables a ctypes mechanism that allows accessing the system :data:`errno` error number in a safe way. :mod:`ctypes` maintains a thread-local copy of the systems :data:`errno` variable; if you call foreign functions created with ``use_errno=True`` then the :data:`errno` value before the function call is swapped with the ctypes private copy, the same happens immediately after the function call.
es: El parámetro *use_errno*, cuando se establece en true, habilita un mecanismo ctypes que permite acceder al número de error del sistema :data:`errno` de forma segura. :mod:`ctypes` mantiene una copia local del hilo de la variable del sistema :data:`errno`; si llamas a funciones extranjeras creadas con ``use_errno=True`` entonces el valor :data:`errno` antes de la llamada a la función se intercambia con la copia privada de ctypes, lo mismo ocurre inmediatamente después de la llamada a la función.

source: The function :func:`ctypes.get_errno` returns the value of the ctypes private copy, and the function :func:`ctypes.set_errno` changes the ctypes private copy to a new value and returns the former value.
es: La función :func:`ctypes.get_errno` retorna el valor de la copia privada de ctypes, y la función :func:`ctypes.set_errno` cambia la copia privada de ctypes a un nuevo valor y retorna el valor anterior.

source: Added *winmode* parameter.
es: Añadido el parámetro *winmode*.

source: Flag to use as *mode* parameter. On platforms where this flag is not available, it is defined as the integer zero.
es: Flag para usar como parámetro *modo*. En las plataformas en las que esta bandera no está disponible, se define como el cero entero.

source: Flag to use as *mode* parameter. On platforms where this is not available, it is the same as *RTLD_GLOBAL*.
es: Flag para usar como parámetro *modo*. En las plataformas en las que esto no está disponible, es lo mismo que *RTLD_GLOBAL*.

source: The default mode which is used to load shared libraries. On OSX 10.3, this is *RTLD_GLOBAL*, otherwise it is the same as *RTLD_LOCAL*.
es: El modo por defecto que se utiliza para cargar las bibliotecas compartidas. En OSX 10.3, esto es *RTLD_GLOBAL*, de lo contrario es lo mismo que *RTLD_LOCAL*.

source: Instances of these classes have no public methods. Functions exported by the shared library can be accessed as attributes or by index. Please note that accessing the function through an attribute caches the result and therefore accessing it repeatedly returns the same object each time. On the other hand, accessing it through an index returns a new object each time::
es: Las instancias de estas clases no tienen métodos públicos. Se puede acceder a las funciones exportadas por la biblioteca compartida como atributos o por índice. Tenga en cuenta que al acceder a la función a través de un atributo se almacena en caché el resultado y, por lo tanto, al acceder a él repetidamente se retorna el mismo objeto cada vez. Por otro lado, acceder a ella a través de un índice retorna un nuevo objeto cada vez::
