Repository: python/python-docs-es
Catalog: library/ctypes.po
Languages: es

source: :mod:`ctypes` --- A foreign function library for Python
es: :mod:`ctypes` --- Una biblioteca de funciones foráneas para Python

source: :mod:`ctypes` is a foreign function library for Python. It provides C compatible data types, and allows calling functions in DLLs or shared libraries. It can be used to wrap these libraries in pure Python.
es: :mod:`ctypes` es una biblioteca de funciones foráneas para Python. Proporciona tipos de datos compatibles con C y permite llamar a funciones en archivos DLL o bibliotecas compartidas. Se puede utilizar para envolver estas bibliotecas en Python puro.

source: ctypes tutorial
es: tutorial de ctypes

source: Note: The code samples in this tutorial use :mod:`doctest` to make sure that they actually work. Since some code samples behave differently under Linux, Windows, or macOS, they contain doctest directives in comments.
es: Nota: Los ejemplos de código en este tutorial usan :mod:`doctest` para asegurarse de que realmente funcionen. Dado que algunos ejemplos de código se comportan de manera diferente en Linux, Windows o macOS, contienen directivas doctest en los comentarios.

source: Note: Some code samples reference the ctypes :class:`c_int` type. On platforms where ``sizeof(long) == sizeof(int)`` it is an alias to :class:`c_long`. So, you should not be confused if :class:`c_long` is printed if you would expect :class:`c_int` --- they are actually the same type.
es: Nota: Algunos ejemplos de código hacen referencia al tipo ctypes :class:`c_int`. En las plataformas donde ``sizeof(long) == sizeof(int)`` es un alias de :class:`c_long`. Por lo tanto, no debe confundirse si :class:`c_long` se imprime si espera :class:`c_int` --- son en realidad del mismo tipo.

source: Loading dynamic link libraries
es: Carga de bibliotecas de enlaces dinámicos

source: :mod:`ctypes` exports the *cdll*, and on Windows *windll* and *oledll* objects, for loading dynamic link libraries.
es: :mod:`ctypes` exporta los objetos *cdll* y en Windows *windll* y *oledll*, para cargar bibliotecas de enlaces dinámicos.

source: Windows errors used to raise :exc:`WindowsError`, which is now an alias of :exc:`OSError`.
es: Los errores de Windows solían generar :exc:`WindowsError`, que ahora es un alias de :exc:`OSError`.

source: Here are some examples for Windows. Note that ``msvcrt`` is the MS standard C library containing most standard C functions, and uses the cdecl calling convention::
es: Estos son algunos ejemplos para Windows. Tener en cuenta que ''msvcrt'' es la biblioteca estándar de MS C que contiene la mayoría de las funciones C estándar y utiliza la convención de llamada cdecl::

source: Windows appends the usual ``.dll`` file suffix automatically.
es: Windows agrega automáticamente la extensión común ``.dll``.

source: Accessing the standard C library through ``cdll.msvcrt`` will use an outdated version of the library that may be incompatible with the one being used by Python. Where possible, use native Python functionality, or else import and use the ``msvcrt`` module.
es: Acceder a la biblioteca estándar de C a través de ``cdll.msvcrt`` utilizará una versión obsoleta de la biblioteca que puede ser incompatible con la utilizada por Python. Cuando sea posible, use la funcionalidad nativa de Python, o bien importe y use el módulo ``msvcrt``.

source: Accessing functions from loaded dlls
es: Acceder a las funciones de los dll cargados

source: Functions are accessed as attributes of dll objects::
es: Las funciones se acceden como atributos de los objetos dll::

source: Note that win32 system dlls like ``kernel32`` and ``user32`` often export ANSI as well as UNICODE versions of a function. The UNICODE version is exported with an ``W`` appended to the name, while the ANSI version is exported with an ``A`` appended to the name. The win32 ``GetModuleHandle`` function, which returns a *module handle* for a given module name, has the following C prototype, and a macro is used to expose one of them as ``GetModuleHandle`` depending on whether UNICODE is defined or not::
es: Nótese que las dlls del sistema win32 como ``kernel32`` y ``user32`` a menudo exportan versiones ANSI y UNICODE de una función. La versión UNICODE se exporta con una ``W`` añadida al nombre, mientras que la versión ANSI se exporta con una ``A`` añadida al nombre. La función ``GetModuleHandle`` de win32, que retorna un *manejador de módulo* para un nombre de módulo dado, tiene el siguiente prototipo de C, y se usa una macro para exponer uno de ellos como ``GetModuleHandle`` dependiendo de si UNICODE está definido o no::

source: *windll* does not try to select one of them by magic, you must access the version you need by specifying ``GetModuleHandleA`` or ``GetModuleHandleW`` explicitly, and then call it with bytes or string objects respectively.
es: *windll* no intenta seleccionar una de ellas por arte de magia, se debe acceder a la versión que se necesita especificando ``GetModuleHandleA`` o ``GetModuleHandleW`` explícitamente, y luego llamarlo con bytes u objetos de cadena respectivamente.

source: Sometimes, dlls export functions with names which aren't valid Python identifiers, like ``"??2@YAPAXI@Z"``. In this case you have to use :func:`getattr` to retrieve the function::
es: A veces, las dlls exportan funciones con nombres que no son identificadores válidos de Python, como ``"??2@YAPAXI@Z"``. En este caso tienes que usar :func:`getattr` para recuperar la función::

source: On Windows, some dlls export functions not by name but by ordinal. These functions can be accessed by indexing the dll object with the ordinal number::
es: En Windows, algunas dlls exportan funciones no por nombre sino por ordinal. Se pueden acceder a estas funciones indexando el objeto dll con el número ordinal::

source: Calling functions
es: Funciones de llamada

source: :exc:`ValueError` is raised when you call an ``stdcall`` function with the ``cdecl`` calling convention, or vice versa::
es: :exc:`ValueError` es lanzado cuando se llama a una función ``stdcall`` con la convención de llamada ``cdecl``, o viceversa::

source: To find out the correct calling convention you have to look into the C header file or the documentation for the function you want to call.
es: Para saber la convención de llamada correcta, hay que mirar en el archivo de encabezado C o en la documentación de la función que se quiere llamar.

source: On Windows, :mod:`ctypes` uses win32 structured exception handling to prevent crashes from general protection faults when functions are called with invalid argument values::
es: En Windows, :mod:`ctypes` utiliza la gestión de excepciones estructurada de win32 para evitar que se produzcan fallos de protección general cuando se llaman funciones con valores de argumento inválidos::

source: There are, however, enough ways to crash Python with :mod:`ctypes`, so you should be careful anyway. The :mod:`faulthandler` module can be helpful in debugging crashes (e.g. from segmentation faults produced by erroneous C library calls).
es: Sin embargo, hay suficientes maneras de bloquear Python con :mod:`ctypes`, así que debes tener cuidado de todos modos. El módulo :mod:`faulthandler` puede ser útil para depurar bloqueos (por ejemplo, provenientes de fallos de segmentación producidos por llamadas erróneas a la biblioteca C).

source: ``None``, integers, bytes objects and (unicode) strings are the only native Python objects that can directly be used as parameters in these function calls. ``None`` is passed as a C ``NULL`` pointer, bytes objects and strings are passed as pointer to the memory block that contains their data (:c:expr:`char *` or :c:expr:`wchar_t *`). Python integers are passed as the platforms default C :c:expr:`int` type, their value is masked to fit into the C type.
es: ``None``, enteros, objetos de bytes y cadenas (unicode) son los únicos objetos nativos de Python que se pueden usar directamente como parámetros en estas llamadas a funciones. ``None`` se pasa como puntero C ``NULL``, objetos de bytes y cadenas se pasan como puntero al bloque de memoria que contiene sus datos (:c:expr:`char *` or :c:expr:`wchar_t *`). Los enteros de Python se pasan como el tipo C :c:expr:`int` predeterminado de la plataforma, su valor se enmascara para encajar en el tipo C.

source: Before we move on calling functions with other parameter types, we have to learn more about :mod:`ctypes` data types.
es: Antes de pasar a llamar funciones con otros tipos de parámetros, tenemos que aprender más sobre los tipos de datos :mod:`ctypes`.

source: Fundamental data types
es: Tipos de datos fundamentales

source: :mod:`ctypes` defines a number of primitive C compatible data types:
es: :mod:`ctypes` define un número de tipos de datos primitivos compatibles con C:

source: ctypes type
es: tipo ctypes

source: C type
es: Tipo C

source: Python type
es: Tipo Python

source: 1-character bytes object
es: Un objeto bytes de 1-caracter

source: 1-character string
es: Una cadena de 1-caracter

source: int
es: entero

source: :c:expr:`__int64` or :c:expr:`long long`
es: :c:expr:`__int64` o :c:expr:`long long`

source: :c:expr:`unsigned __int64` or :c:expr:`unsigned long long`
es: :c:expr:`unsigned __int64` o :c:expr:`unsigned long long`

source: float
es: flotante

source: :c:expr:`char *` (NUL terminated)
es: :c:expr:`char *` (terminado en NUL)

source: bytes object or ``None``
es: objeto de bytes o ``None``

source: :c:expr:`wchar_t *` (NUL terminated)
es: :c:expr:`wchar_t *` (terminado en NUL)

source: string or ``None``
es: cadena o ``None``

source: int or ``None``
es: entero o ``None``

source: The constructor accepts any object with a truth value.
es: El constructor acepta cualquier objeto con valor verdadero.

source: All these types can be created by calling them with an optional initializer of the correct type and value::
es: Todos estos tipos pueden ser creados llamándolos con un inicializador opcional del tipo y valor correctos::

source: Since these types are mutable, their value can also be changed afterwards::
es: Dado que estos tipos son mutables, su valor también puede ser cambiado después::

source: Assigning a new value to instances of the pointer types :class:`c_char_p`, :class:`c_wchar_p`, and :class:`c_void_p` changes the *memory location* they point to, *not the contents* of the memory block (of course not, because Python bytes objects are immutable)::
es: Asignando un nuevo valor a las instancias de los tipos de punteros :class:`c_char_p`, :class:`c_wchar_p`, y :class:`c_void_p` cambia el *lugar de memoria* al que apuntan, *no el contenido* del bloque de memoria (por supuesto que no, porque los objetos de bytes de Python son inmutables)::

source: You should be careful, however, not to pass them to functions expecting pointers to mutable memory. If you need mutable memory blocks, ctypes has a :func:`create_string_buffer` function which creates these in various ways. The current memory block contents can be accessed (or changed) with the ``raw`` property; if you want to access it as NUL terminated string, use the ``value`` property::
es: Sin embargo, debe tener cuidado de no pasarlos a funciones que esperan punteros a la memoria mutable. Si necesitas bloques de memoria mutables, ctypes tiene una función :func:`create_string_buffer` que los crea de varias maneras. El contenido actual del bloque de memoria puede ser accedido (o cambiado) con la propiedad ``raw``; si quieres acceder a él como cadena terminada NUL, usa la propiedad ``value``::

source: Calling functions, continued
es: Funciones de llamada, continuación

source: Note that printf prints to the real standard output channel, *not* to :data:`sys.stdout`, so these examples will only work at the console prompt, not from within *IDLE* or *PythonWin*::
es: Note que printf imprime al canal de salida estándar real, *no* a :data:`sys.stdout`, por lo que estos ejemplos sólo funcionarán en el prompt de la consola, no desde dentro de *IDLE* o *PythonWin*::

source: As has been mentioned before, all Python types except integers, strings, and bytes objects have to be wrapped in their corresponding :mod:`ctypes` type, so that they can be converted to the required C data type::
es: Como se ha mencionado antes, todos los tipos de Python, excepto los enteros, cadenas y objetos bytes, tienen que ser envueltos en su correspondiente tipo :mod:`ctypes`, para que puedan ser convertidos al tipo de datos C requerido::

source: Calling functions with your own custom data types
es: Funciones de llamada con sus propios tipos de datos personalizados

source: Specifying the required argument types (function prototypes)
es: Especificar los tipos de argumentos requeridos (prototipos de funciones)

source: Specifying a format protects against incompatible argument types (just as a prototype for a C function), and tries to convert the arguments to valid types::
es: La especificación de un formato protege contra los tipos de argumentos incompatibles (al igual que un prototipo para una función C), e intenta convertir los argumentos en tipos válidos::

source: Return types
es: Tipos de retorno

source: ``WinError`` is a function which will call Windows ``FormatMessage()`` api to get the string representation of an error code, and *returns* an exception. ``WinError`` takes an optional error code parameter, if no one is used, it calls :func:`GetLastError` to retrieve it.
es: ``WinError`` es una función que llamará a la api Windows ``FormatMessage`` para obtener la representación de la cadena de un código de error, y retornará una excepción. ``WinError`` toma un parámetro de código de error opcional, si no se usa ninguno, llama a :func:`GetLastError`` para recuperarlo.

source: Passing pointers (or: passing parameters by reference)
es: Pasar los punteros (o: pasar los parámetros por referencia)

source: Sometimes a C api function expects a *pointer* to a data type as parameter, probably to write into the corresponding location, or if the data is too large to be passed by value. This is also known as *passing parameters by reference*.
es: A veces una función api C espera un *puntero* a un tipo de datos como parámetro, probablemente para escribir en el lugar correspondiente, o si los datos son demasiado grandes para ser pasados por valor. Esto también se conoce cómo *pasar parámetros por referencia*.

source: :mod:`ctypes` exports the :func:`byref` function which is used to pass parameters by reference. The same effect can be achieved with the :func:`pointer` function, although :func:`pointer` does a lot more work since it constructs a real pointer object, so it is faster to use :func:`byref` if you don't need the pointer object in Python itself::
es: :mod:`ctypes` exporta la función :func:`byref` que se utiliza para pasar parámetros por referencia. El mismo efecto se puede conseguir con la función :func:`pointer`, aunque :func:`pointer` hace mucho más trabajo ya que construye un objeto puntero real, por lo que es más rápido usar :func:`byref` si no se necesita el objeto puntero en el propio Python::

source: Structures and unions
es: Estructuras y uniones

source: The field type must be a :mod:`ctypes` type like :class:`c_int`, or any other derived :mod:`ctypes` type: structure, union, array, pointer.
es: El tipo de campo debe ser un tipo :mod:`ctypes` como :class:`c_int`, o cualquier otro tipo :mod:`ctypes` derivado: estructura, unión, matriz, puntero.

source: Here is a simple example of a POINT structure, which contains two integers named *x* and *y*, and also shows how to initialize a structure in the constructor::
es: Aquí hay un ejemplo simple de una estructura POINT, que contiene dos enteros llamados *x* y *y*, y también muestra cómo inicializar una estructura en el constructor::

source: You can, however, build much more complicated structures. A structure can itself contain other structures by using a structure as a field type.
es: Sin embargo, se pueden construir estructuras mucho más complicadas. Una estructura puede contener por sí misma otras estructuras usando una estructura como tipo de campo.

source: Here is a RECT structure which contains two POINTs named *upperleft* and *lowerright*::
es: Aquí hay una estructura RECT que contiene dos POINTs llamados *upperleft* (superior izquierda)y *lowerright* (abajo a la derecha)::

source: Nested structures can also be initialized in the constructor in several ways::
es: Las estructuras anidadas también pueden ser inicializadas en el constructor de varias maneras::

source: Field :term:`descriptor`\s can be retrieved from the *class*, they are useful for debugging because they can provide useful information::
es: El campo :term:`descriptor` puede ser recuperado de la *class*, son útiles para la depuración porque pueden proporcionar información útil::

source: :mod:`ctypes` does not support passing unions or structures with bit-fields to functions by value. While this may work on 32-bit x86, it's not guaranteed by the library to work in the general case. Unions and structures with bit-fields should always be passed to functions by pointer.
es: :mod:`ctypes` no soporta el paso de uniones o estructuras con campos de bits a funciones por valor. Aunque esto puede funcionar en 32-bit x86, la biblioteca no garantiza que funcione en el caso general. Las uniones y estructuras con campos de bits siempre deben pasarse a las funciones por puntero.

source: Structure/union alignment and byte order
es: Alineación de estructura/unión y orden de bytes

source: :mod:`ctypes` uses the native byte order for Structures and Unions. To build structures with non-native byte order, you can use one of the :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion`, and :class:`LittleEndianUnion` base classes. These classes cannot contain pointer fields.
es: :mod:`ctypes` utiliza el orden de bytes nativos para las Estructuras y Uniones. Para construir estructuras con un orden de bytes no nativo, puedes usar una de las clases base :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion`, y :class:`LittleEndianUnion`. Estas clases no pueden contener campos puntero.

source: Bit fields in structures and unions
es: Campos de bits en estructuras y uniones

source: Arrays
es: Arreglos

source: Arrays are sequences, containing a fixed number of instances of the same type.
es: Los arreglos son secuencias, que contienen un número fijo de instancias del mismo tipo.

source: The recommended way to create array types is by multiplying a data type with a positive integer::
es: La forma recomendada de crear tipos de arreglos es multiplicando un tipo de dato por un entero positivo::

source: Here is an example of a somewhat artificial data type, a structure containing 4 POINTs among other stuff::
es: Aquí hay un ejemplo de un tipo de datos algo artificial, una estructura que contiene 4 POINTs entre otras cosas::

source: Instances are created in the usual way, by calling the class::
es: Las instancias se crean de la manera habitual, llamando a la clase::

source: The above code print a series of ``0 0`` lines, because the array contents is initialized to zeros.
es: El código anterior imprime una serie de líneas ``0 0``, porque el contenido del arreglos se inicializa con ceros.

source: Initializers of the correct type can also be specified::
es: También se pueden especificar inicializadores del tipo correcto::

source: Pointers
es: Punteros

source: Pointer instances are created by calling the :func:`pointer` function on a :mod:`ctypes` type::
es: Las instancias de puntero se crean llamando a la función :func:`pointer` en un tipo :mod:`ctypes`::

source: Pointer instances have a :attr:`~_Pointer.contents` attribute which returns the object to which the pointer points, the ``i`` object above::
es: Las instancias del puntero tienen un atributo :attr:`~_Pointer.contents` que retorna el objeto al que apunta el puntero, el objeto ``i`` arriba::

source: Note that :mod:`ctypes` does not have OOR (original object return), it constructs a new, equivalent object each time you retrieve an attribute::
es: Ten en cuenta que :mod:`ctypes` no tiene OOR (original object return), construye un nuevo objeto equivalente cada vez que recuperas un atributo::

source: Assigning another :class:`c_int` instance to the pointer's contents attribute would cause the pointer to point to the memory location where this is stored::
es: Asignar otra instancia :class:`c_int` al atributo de contenido del puntero causaría que el puntero apunte al lugar de memoria donde se almacena::

source: Pointer instances can also be indexed with integers::
es: Las instancias de puntero también pueden ser indexadas con números enteros::

source: Assigning to an integer index changes the pointed to value::
es: Asignando a un índice entero cambia el valor señalado::

source: It is also possible to use indexes different from 0, but you must know what you're doing, just as in C: You can access or change arbitrary memory locations. Generally you only use this feature if you receive a pointer from a C function, and you *know* that the pointer actually points to an array instead of a single item.
es: También es posible usar índices diferentes de 0, pero debes saber lo que estás haciendo, al igual que en C: Puedes acceder o cambiar arbitrariamente las ubicaciones de memoria. Generalmente sólo usas esta característica si recibes un puntero de una función C, y *sabes* que el puntero en realidad apunta a un arreglo en lugar de a un solo elemento.

source: Behind the scenes, the :func:`pointer` function does more than simply create pointer instances, it has to create pointer *types* first. This is done with the :func:`POINTER` function, which accepts any :mod:`ctypes` type, and returns a new type::
es: Entre bastidores, la función :func:`pointer` hace más que simplemente crear instancias de puntero, tiene que crear primero punteros *tipos*. Esto se hace con la función :func:`POINTER`, que acepta cualquier tipo de :mod:`ctypes`, y retorna un nuevo tipo::

source: Calling the pointer type without an argument creates a ``NULL`` pointer. ``NULL`` pointers have a ``False`` boolean value::
es: Llamar al tipo de puntero sin un argumento crea un puntero ``NULL``. Los punteros ``NULL`` tienen un valor booleano falso..:

source: :mod:`ctypes` checks for ``NULL`` when dereferencing pointers (but dereferencing invalid non-\ ``NULL`` pointers would crash Python)::
es: :mod:`ctypes` comprueba si hay ``NULL`` cuando los punteros de referencia (pero los punteros no válidos de referencia no-\ ``NULL`` se romperán en Python)::

source: Type conversions
es: Conversiones de tipos

source: To set a POINTER type field to ``NULL``, you can assign ``None``::
es: Para poner un campo de tipo POINTER a ``NULL``, puedes asignar ``None``::

source: Sometimes you have instances of incompatible types. In C, you can cast one type into another type. :mod:`ctypes` provides a :func:`cast` function which can be used in the same way. The ``Bar`` structure defined above accepts ``POINTER(c_int)`` pointers or :class:`c_int` arrays for its ``values`` field, but not instances of other types::
es: A veces se tienen instancias de tipos incompatibles. En C, puedes cambiar un tipo por otro tipo. :mod:`ctypes` proporciona una función :func:`cast` qué puede ser usada de la misma manera. La estructura ``Bar`` definida arriba acepta punteros ``POINTER(c_int)`` o arreglos :class:`c_int`` para su campo ``values``, pero no instancias de otros tipos::

source: For these cases, the :func:`cast` function is handy.
es: Para estos casos, la función :func:`cast` es muy útil.
