Repository: python/python-docs-es
Catalog: library/ctypes.po
Languages: es

source: Field names must be unique within one structure or union. This is not checked, only one field can be accessed when names are repeated.
es: Los nombres de los campos deben ser únicos dentro de una estructura o unión. Esto no se comprueba, sólo se puede acceder a un campo cuando los nombres se repiten.

source: It is possible to define the :attr:`_fields_` class variable *after* the class statement that defines the Structure subclass, this allows creating data types that directly or indirectly reference themselves::
es: Es posible definir la variable de clase :attr:`_fields_` *después* de la sentencia de clase que define la subclase Estructura, esto permite crear tipos de datos que se refieren directa o indirectamente a sí mismos::

source: The :attr:`_fields_` class variable must, however, be defined before the type is first used (an instance is created, :func:`sizeof` is called on it, and so on). Later assignments to the :attr:`_fields_` class variable will raise an AttributeError.
es: Sin embargo, la variable de clase :attr:`_fields_` debe ser definida antes de que el tipo sea usado por primera vez (se crea una instancia, se llama a :func:`sizeof`, y así sucesivamente). Las asignaciones posteriores a la variable de clase :attr:`_fields_` lanzarán un AttributeError.

source: It is possible to define sub-subclasses of structure types, they inherit the fields of the base class plus the :attr:`_fields_` defined in the sub-subclass, if any.
es: Es posible definir subclases de tipos de estructura, que heredan los campos de la clase base más el :attr:`_fields_` definido en la subclase, si existe.

source: An optional sequence that lists the names of unnamed (anonymous) fields. :attr:`_anonymous_` must be already defined when :attr:`_fields_` is assigned, otherwise it will have no effect.
es: Una secuencia opcional que enumera los nombres de los campos sin nombre (anónimos). :attr:`_anonymous_` debe estar ya definida cuando se asigna :attr:`_fields_`, de lo contrario no tendrá ningún efecto.

source: The fields listed in this variable must be structure or union type fields. :mod:`ctypes` will create descriptors in the structure type that allows accessing the nested fields directly, without the need to create the structure or union field.
es: Los campos listados en esta variable deben ser campos de tipo estructura o unión. :mod:`ctypes` creará descriptores en el tipo de estructura que permitan acceder a los campos anidados directamente, sin necesidad de crear el campo de estructura o unión.

source: Here is an example type (Windows)::
es: Aquí hay un tipo de ejemplo (Windows)::

source: The ``TYPEDESC`` structure describes a COM data type, the ``vt`` field specifies which one of the union fields is valid. Since the ``u`` field is defined as anonymous field, it is now possible to access the members directly off the TYPEDESC instance. ``td.lptdesc`` and ``td.u.lptdesc`` are equivalent, but the former is faster since it does not need to create a temporary union instance::
es: La estructura ``TYPEDESC`` describe un tipo de datos COM, el campo ``vt`` especifica cuál de los campos de unión es válido. Como el campo ``u`` está definido como campo anónimo, ahora es posible acceder a los miembros directamente desde la instancia TYPEDESC. ``td.lptdesc`` y ``td.u.lptdesc`` son equivalentes, pero el primero es más rápido ya que no necesita crear una instancia de unión temporal::

source: It is possible to define sub-subclasses of structures, they inherit the fields of the base class. If the subclass definition has a separate :attr:`_fields_` variable, the fields specified in this are appended to the fields of the base class.
es: Es posible definir subclases de estructuras, que heredan los campos de la clase base. Si la definición de la subclase tiene una variable :attr:`_fields_` separada, los campos especificados en ella se añaden a los campos de la clase base.

source: Structure and union constructors accept both positional and keyword arguments. Positional arguments are used to initialize member fields in the same order as they are appear in :attr:`_fields_`. Keyword arguments in the constructor are interpreted as attribute assignments, so they will initialize :attr:`_fields_` with the same name, or create new attributes for names not present in :attr:`_fields_`.
es: Los constructores de estructuras y uniones aceptan tanto argumentos posicionales como de palabras clave. Los argumentos posicionales se usan para inicializar los campos de los miembros en el mismo orden en que aparecen en :attr:`_fields_`. Los argumentos de palabras clave en el constructor se interpretan como asignaciones de atributos, por lo que inicializarán :attr:`_fields_` con el mismo nombre, o crearán nuevos atributos para nombres no presentes en :attr:`_fields_`.

source: Arrays and pointers
es: Arreglos y punteros

source: Abstract base class for arrays.
es: Clase base abstracta para arreglos.

source: The recommended way to create concrete array types is by multiplying any :mod:`ctypes` data type with a non-negative integer. Alternatively, you can subclass this type and define :attr:`_length_` and :attr:`_type_` class variables. Array elements can be read and written using standard subscript and slice accesses; for slice reads, the resulting object is *not* itself an :class:`Array`.
es: La forma recomendada de crear tipos de arreglos concretos es multiplicando cualquier tipo de datos :mod:`ctypes` con un número entero no negativo. Como alternativa, puede subclasificar este tipo y definir variables de clase :attr:`_length_` y :attr:`_type_`. Los elementos del arreglo se pueden leer y escribir utilizando subíndices estándar y accesos de segmento; para lecturas de segmentos, el objeto resultante *no es* en sí mismo, un :class:`Array`.

source: A positive integer specifying the number of elements in the array. Out-of-range subscripts result in an :exc:`IndexError`. Will be returned by :func:`len`.
es: Un número entero positivo que especifica el número de elementos del conjunto. Los subíndices fuera de rango dan como resultado un :exc:`IndexError`. Será retornado por :func:`len`.

source: Specifies the type of each element in the array.
es: Especifica el tipo de cada elemento del arreglo.

source: Array subclass constructors accept positional arguments, used to initialize the elements in order.
es: Los constructores de subclases de arreglos aceptan argumentos posicionales, usados para inicializar los elementos en orden.

source: Private, abstract base class for pointers.
es: Clase base, privada y abstracta para punteros.

source: Concrete pointer types are created by calling :func:`POINTER` with the type that will be pointed to; this is done automatically by :func:`pointer`.
es: Los tipos de punteros concretos se crean llamando a :func:`POINTER` con el tipo que será apuntado; esto se hace automáticamente por :func:`pointer`.

source: If a pointer points to an array, its elements can be read and written using standard subscript and slice accesses. Pointer objects have no size, so :func:`len` will raise :exc:`TypeError`. Negative subscripts will read from the memory *before* the pointer (as in C), and out-of-range subscripts will probably crash with an access violation (if you're lucky).
es: Si un puntero apunta a un arreglo, sus elementos pueden ser leídos y escritos usando accesos de subíndices y cortes estándar. Los objetos punteros no tienen tamaño, así que :func:`len` lanzará un :exc:`TypeError`. Los subíndices negativos se leerán de la memoria *antes* que el puntero (como en C), y los subíndices fuera de rango probablemente se bloqueen con una violación de acceso (si tienes suerte).

source: Specifies the type pointed to.
es: Especifica el tipo apuntado.

source: Returns the object to which to pointer points. Assigning to this attribute changes the pointer to point to the assigned object.
es: Retorna el objeto al que el puntero apunta. Asignando a este atributo cambia el puntero para que apunte al objeto asignado.
