Repository: python/python-docs-es
Catalog: library/curses.panel.po
Languages: es

source: :mod:`curses.panel` --- A panel stack extension for curses
es: :mod:`curses.panel` --- Una extensión de pila de panel para curses

source: Panels are windows with the added feature of depth, so they can be stacked on top of each other, and only the visible portions of each window will be displayed. Panels can be added, moved up or down in the stack, and removed.
es: Los paneles son ventanas con la característica de profundidad añadida, por lo que se pueden apilar una encima de la otra, y solo se mostrarán las partes visibles de cada ventana. Los paneles se pueden agregar, mover hacia arriba o hacia abajo en la pila y eliminarse.

source: Functions
es: Funciones

source: The module :mod:`curses.panel` defines the following functions:
es: El módulo :mod:`curses.panel` define las siguientes funciones:

source: Returns the bottom panel in the panel stack.
es: Retorna el panel inferior en la pila del panel.

source: Returns a panel object, associating it with the given window *win*. Be aware that you need to keep the returned panel object referenced explicitly. If you don't, the panel object is garbage collected and removed from the panel stack.
es: Retorna un objeto de panel, asociándolo con la ventana dada *win*. Tenga en cuenta que debe mantener explícitamente el objeto de panel retornado al que se hace referencia. Si no lo hace, el objeto de panel se recoge como basura y elimina de la pila del panel.

source: Returns the top panel in the panel stack.
es: Retorna el panel superior de la pila de paneles.

source: Updates the virtual screen after changes in the panel stack. This does not call :func:`curses.doupdate`, so you'll have to do this yourself.
es: Actualiza la pantalla virtual después de los cambios en la pila del panel. Esto no llama a :func:`curses.doupdate`, por lo que tendrás que hacerlo tú mismo.

source: Panel Objects
es: Objetos de panel

source: Panel objects, as returned by :func:`new_panel` above, are windows with a stacking order. There's always a window associated with a panel which determines the content, while the panel methods are responsible for the window's depth in the panel stack.
es: Los objetos panel, retornados por :func:`new_panel` arriba, son ventanas con un orden de apilamiento. Siempre hay una ventana asociada a un panel que determina el contenido, mientras que los métodos del panel son responsables de la profundidad de la ventana en la pila del panel.

source: Panel objects have the following methods:
es: Los objetos de panel tienen los siguientes métodos:

source: Returns the panel above the current panel.
es: Retorna el panel situado encima del panel actual.

source: Returns the panel below the current panel.
es: Retorna el panel debajo del panel actual.

source: Push the panel to the bottom of the stack.
es: Empuja el panel hasta la parte inferior de la pila.

source: Returns ``True`` if the panel is hidden (not visible), ``False`` otherwise.
es: Retorna ``True`` si el panel está oculto (no visible), ``False`` en caso contrario.

source: Hide the panel. This does not delete the object, it just makes the window on screen invisible.
es: Ocultar el panel. Esto no elimina el objeto, solo hace que la ventana en la pantalla sea invisible.

source: Move the panel to the screen coordinates ``(y, x)``.
es: Mueve el panel a las coordenadas de pantalla ``(y, x)``.

source: Change the window associated with the panel to the window *win*.
es: Cambia la ventana asociada con el panel a la ventana *win*.

source: Set the panel's user pointer to *obj*. This is used to associate an arbitrary piece of data with the panel, and can be any Python object.
es: Establece el puntero de usuario del panel en *obj*. Esto se usa para asociar un dato arbitrario con el panel y puede ser cualquier objeto de Python.

source: Display the panel (which might have been hidden).
es: Muestra el panel (que podría haber estado oculto).

source: Push panel to the top of the stack.
es: Empuja el panel hacia la parte superior de la pila.

source: Returns the user pointer for the panel. This might be any Python object.
es: Retorna el puntero del usuario para el panel. Puede ser cualquier objeto de Python.

source: Returns the window object associated with the panel.
es: Retorna el objeto de ventana asociado con el panel.
