Repository: python/python-docs-es
Catalog: library/dataclasses.po
Languages: es_es

source: :mod:`dataclasses` --- Data Classes
es_es: :mod:`dataclasses` --- Clases de datos

source: **Source code:** :source:`Lib/dataclasses.py`
es_es: **Código fuente:** :source:`Lib/dataclasses.py`

source: This module provides a decorator and functions for automatically adding generated :term:`special method`\s such as :meth:`__init__` and :meth:`__repr__` to user-defined classes. It was originally described in :pep:`557`.
es_es: Este módulo provee un decorador y funciones para añadir :term:`métodos especiales <special method>` automáticamente, como :meth:`__init__` y :meth:`__repr__` por ejemplo, a clases definidas por el usuario. Fue originalmente descrito en :pep:`557`.

source: The member variables to use in these generated methods are defined using :pep:`526` type annotations. For example this code::
es_es: Las variables miembro a utilizar en estos métodos generados son definidas teniendo en cuenta anotaciones de tipo :pep:`526`. Por ejemplo, en este código::

source: Will add, among other things, a :meth:`__init__` that looks like::
es_es: Añadirá, además de otros métodos, un método :meth:`__init__` con la siguiente estructura::

source: Note that this method is automatically added to the class: it is not directly specified in the ``InventoryItem`` definition shown above.
es_es: Es importante observar que este método es añadido a la clase automáticamente; está implícito en la definición de ``InventoryItem`` implementada arriba.

source: Module-level decorators, classes, and functions
es_es: Decoradores, clases y funciones del módulo

source: This function is a :term:`decorator` that is used to add generated :term:`special method`\s to classes, as described below.
es_es: Esta función es un :term:`decorator` utilizado para añadir a las clases :term:`los métodos especiales <special method>` generados, como se describe a continuación.

source: The :func:`dataclass` decorator examines the class to find ``field``\s. A ``field`` is defined as class variable that has a :term:`type annotation <variable annotation>`. With two exceptions described below, nothing in :func:`dataclass` examines the type specified in the variable annotation.
es_es: El decorador :func:`dataclass` examina la clase para encontrar ``fields``. Un ``field`` ('campo') se define como una variable de clase que tiene una :term:`anotación de variable <variable annotation>`. A excepción de los dos casos descritos debajo, nada en :func:`dataclass` examina el tipo especificado en la anotación de variable.

source: The order of the fields in all of the generated methods is the order in which they appear in the class definition.
es_es: El orden de los campos en los métodos generados es el mismo en el que se encuentran en la definición de la clase.

source: The :func:`dataclass` decorator will add various "dunder" methods to the class, described below. If any of the added methods already exist on the class, the behavior depends on the parameter, as documented below. The decorator returns the same class that is called on; no new class is created.
es_es: El decorador :func:`dataclass` añade varios métodos "*dunder*" (abreviación de 'double underline') a la clase, descritos a continuación. Si alguno de los métodos añadidos ya existe en la definición de la clase, el comportamiento dependerá del parámetro, como se documenta abajo. El decorador retorna la misma clase con la que es llamado, no crea una nueva.

source: If :func:`dataclass` is used just as a simple decorator with no parameters, it acts as if it has the default values documented in this signature. That is, these three uses of :func:`dataclass` are equivalent::
es_es: Si :func:`dataclass` es llamado como un simple decorador sin parámetros, actúa con los valores por defecto documentados aquí. Específicamente, los siguientes tres usos de :func:`dataclass` son equivalentes::

source: The parameters to :func:`dataclass` are:
es_es: Los parámetros de :func:`dataclass` son:

source: ``init``: If true (the default), a :meth:`__init__` method will be generated.
es_es: ``init``: Si es verdadero (valor por defecto), el método :meth:`__init__` será generado.

source: If the class already defines :meth:`__init__`, this parameter is ignored.
es_es: Si la clase ya define :meth:`__init__`, este parámetro es ignorado.

source: ``repr``: If true (the default), a :meth:`__repr__` method will be generated. The generated repr string will have the class name and the name and repr of each field, in the order they are defined in the class. Fields that are marked as being excluded from the repr are not included. For example: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.
es_es: ``repr``: Si es verdadero (valor por defecto), el método :meth:`__repr__` es generado. La cadena de representación generada tendrá el nombre de la clase junto al nombre y la representación de cada uno de sus campos, en el mismo orden en el que están definidos en la clase. Es posible indicar que ciertos campos no sean incluidos en la representación. Por ejemplo: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.

source: If the class already defines :meth:`__repr__`, this parameter is ignored.
es_es: Si la clase ya define :meth:`__repr__`, este parámetro es ignorado.

source: ``eq``: If true (the default), an :meth:`__eq__` method will be generated. This method compares the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type.
es_es: ``eq``: Si es verdadero (por defecto), el método :meth:`__eq__` es generado. Este método compara entre instancias de la clase representando cada una de ellas mediante una tupla, siendo los elementos de la misma los campos de la clase ubicados en el mismo orden en el que fueron definidos (dos tuplas son iguales si, y sólo si, sus campos son iguales).

source: If the class already defines :meth:`__eq__`, this parameter is ignored.
es_es: Si la clase ya define :meth:`__eq__`, este parámetro es ignorado.

source: ``order``: If true (the default is ``False``), :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, and :meth:`__ge__` methods will be generated. These compare the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type. If ``order`` is true and ``eq`` is false, a :exc:`ValueError` is raised.
es_es: ``order``: Si es verdadero (``False`` es el valor por defecto), los métodos :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` y :meth:`__ge__` serán generados. Estos métodos comparan la clase como si fuera una tupla con sus campos, en orden. Ambas instancias en la comparación deben ser del mismo tipo. Si ``order`` es verdadero y ``eq`` falso, se lanza una excepción :exc:`ValueError`.

source: If the class already defines any of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`, then :exc:`TypeError` is raised.
es_es: Si la clase ya define :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` o :meth:`__ge__`, se lanza una excepción :exc:`TypeError`.

source: ``unsafe_hash``: If ``False`` (the default), a :meth:`__hash__` method is generated according to how ``eq`` and ``frozen`` are set.
es_es: ``unsafe_hash``: Si es ``False`` (por defecto), se genera el método :meth:`__hash__` de acuerdo a los valores de ``eq`` y ``frozen`` definidos.

source: :meth:`__hash__` is used by built-in :meth:`hash()`, and when objects are added to hashed collections such as dictionaries and sets. Having a :meth:`__hash__` implies that instances of the class are immutable. Mutability is a complicated property that depends on the programmer's intent, the existence and behavior of :meth:`__eq__`, and the values of the ``eq`` and ``frozen`` flags in the :func:`dataclass` decorator.
es_es: :meth:`__hash__` es utilizado por la función incorporada :meth:`hash()` y cuando los objetos definidos por la clase son añadidos a colecciones hash, como por ejemplo diccionarios y conjuntos. Definir el método :meth:`__hash__` en una clase implica que sus instancias son inmutables. La mutabilidad es una propiedad compleja, ya que depende de cómo el programador utilice el objeto, la existencia y comportamiento de :meth:`__eq__` y del valor asignado a las flags ``eq`` y ``frozen`` en el decorador :func:`dataclass`.

source: By default, :func:`dataclass` will not implicitly add a :meth:`__hash__` method unless it is safe to do so. Neither will it add or change an existing explicitly defined :meth:`__hash__` method. Setting the class attribute ``__hash__ = None`` has a specific meaning to Python, as described in the :meth:`__hash__` documentation.
es_es: Por defecto, :func:`dataclass` no añade de forma implícita el método :meth:`__hash__` a menos que sea seguro hacerlo. Tampoco añade o cambia un método :meth:`__hash__` previamente definido de forma explícita. Definir el atributo de clase ``__hash__ = None`` tiene un significado específico en Python, descrito en la documentación dedicada a :meth:`__hash__`.

source: If :meth:`__hash__` is not explicit defined, or if it is set to ``None``, then :func:`dataclass` *may* add an implicit :meth:`__hash__` method. Although not recommended, you can force :func:`dataclass` to create a :meth:`__hash__` method with ``unsafe_hash=True``. This might be the case if your class is logically immutable but can nonetheless be mutated. This is a specialized use case and should be considered carefully.
es_es: Si :meth:`__hash__` no está definido explícitamente o si es designado como ``None``, :func:`dataclass` *puede* añadir implícitamente el método :meth:`__hash__`. Aunque no sea recomendable, es posible forzar que :func:`dataclass` cree un método :meth:`__hash__` mediante ``unsafe_hash=True``; esto es factible si su clase es lógicamente inmutable pero, sin embargo, puede ser modificada. Este es un caso especial de uso que debe ser considerado cuidadosamente.

source: Here are the rules governing implicit creation of a :meth:`__hash__` method. Note that you cannot both have an explicit :meth:`__hash__` method in your dataclass and set ``unsafe_hash=True``; this will result in a :exc:`TypeError`.
es_es: A continuación se explican las reglas que se aplican en la creación implícita del método :meth:`__hash__`. Observar que no es compatible definir explícitamente un método :meth:`__hash__` en su clase de datos y al mismo tiempo asignar ``unsafe_hash=True``; esto lanza una excepción :exc:`TypeError`.

source: If ``eq`` and ``frozen`` are both true, by default :func:`dataclass` will generate a :meth:`__hash__` method for you. If ``eq`` is true and ``frozen`` is false, :meth:`__hash__` will be set to ``None``, marking it unhashable (which it is, since it is mutable). If ``eq`` is false, :meth:`__hash__` will be left untouched meaning the :meth:`__hash__` method of the superclass will be used (if the superclass is :class:`object`, this means it will fall back to id-based hashing).
es_es: Si ``eq`` y ``frozen`` son ambos verdaderos, :func:`dataclass` genera por defecto un método :meth:`hash` por ti. En el caso que ``eq`` sea verdadero y ``frozen`` falso, a :meth:`__hash__` se le asigna ``None``, en consecuencia será *unhashable* (lo cual es deseable, ya que es mutable). Si ``eq`` es falso, :meth:`__hash__` permanece sin cambios, por lo que en este caso se hará uso del método :meth:`hash` heredado de la superclase (lo que implica que si la superclase es :class:`object`, se aplicará el *hashing* basado en el id de los objetos).

source: ``frozen``: If true (the default is ``False``), assigning to fields will generate an exception. This emulates read-only frozen instances. If :meth:`__setattr__` or :meth:`__delattr__` is defined in the class, then :exc:`TypeError` is raised. See the discussion below.
es_es: ``frozen``: Si es verdadero (el valor por defecto es ``False``), cualquier intento de asignación a un campo de la clase lanza una excepción. Esto emula el comportamiento de las instancias congeladas (*frozen*) de sólo lectura. Si :meth:`__setattr__` o :meth:`__delattr__` son definidos en la clase, se lanzará una excepción :exc:`TypeError`. Esto es ampliado más abajo.

source: ``field``\s may optionally specify a default value, using normal Python syntax::
es_es: Los ``fields`` pueden especificar un valor por defecto opcionalmente, simplemente usando la sintaxis normal de Python::

source: In this example, both ``a`` and ``b`` will be included in the added :meth:`__init__` method, which will be defined as::
es_es: En este ejemplo, tanto ``a`` como ``b`` serán incluidos en el método :meth:`__init__` agregado, el cual será definido como sigue::

source: :exc:`TypeError` will be raised if a field without a default value follows a field with a default value. This is true either when this occurs in a single class, or as a result of class inheritance.
es_es: Si, en la definición de una clase, a un campo con valor por defecto le sigue un campo sin valor por defecto será lanzada una excepción :exc:`TypeError`. Esto se aplica también a la implementación de una clase única o como resultado de herencia de clases.

source: For common and simple use cases, no other functionality is required. There are, however, some dataclass features that require additional per-field information. To satisfy this need for additional information, you can replace the default field value with a call to the provided :func:`field` function. For example::
es_es: Para casos de uso común, estas funcionalidades son suficientes. Sin embargo, existen otras características de las clases de datos que requieren información adicional en ciertos campos. Para satisfacer esta necesidad, es posible reemplazar cualquier valor por defecto de un campo mediante una llamada a la función :func:`field`. Por ejemplo::

source: As shown above, the ``MISSING`` value is a sentinel object used to detect if the ``default`` and ``default_factory`` parameters are provided. This sentinel is used because ``None`` is a valid value for ``default``. No code should directly use the ``MISSING`` value.
es_es: Como se muestra arriba, el valor ``MISSING`` es un objeto centinela utilizado para detectar si los parámetros ``default`` y ``default_factory`` son provistos. Este objeto centinela es utilizado debido a que ``None`` es un valor válido para ``default``. Ningún procedimiento debe utilizar directamente el valor ``MISSING``.

source: The parameters to :func:`field` are:
es_es: Los parámetros de :func:`field` son:

source: ``default``: If provided, this will be the default value for this field. This is needed because the :meth:`field` call itself replaces the normal position of the default value.
es_es: ``default``: Si es provisto, este será el valor por defecto para este campo. Es necesario que sea definido ya que la propia llamada a :meth:`field` reemplaza la posición normal del valor por defecto.

source: ``default_factory``: If provided, it must be a zero-argument callable that will be called when a default value is needed for this field. Among other purposes, this can be used to specify fields with mutable default values, as discussed below. It is an error to specify both ``default`` and ``default_factory``.
es_es: ``default_factory``: Si es provisto, debe ser un objeto invocable sin argumentos, el cual será llamado cuando el valor por defecto de este campo sea necesario. Además de otros propósitos, puede ser utilizado para especificar campos con valores por defecto mutables, como se explica a continuación. Especificar tanto ``default`` como ``default_factory`` resulta en un error.

source: ``init``: If true (the default), this field is included as a parameter to the generated :meth:`__init__` method.
es_es: ``init``: Si es verdadero (por defecto), este campo es incluido como parámetro del método :meth:`__init__` generado.

source: ``repr``: If true (the default), this field is included in the string returned by the generated :meth:`__repr__` method.
es_es: ``repr``: Si es verdadero (por defecto), este campo es incluido en la cadena de caracteres que retorna el método :meth:`__repr__` generado.

source: ``compare``: If true (the default), this field is included in the generated equality and comparison methods (:meth:`__eq__`, :meth:`__gt__`, et al.).
es_es: ``compare``: Si es verdadero (por defecto), este campo es incluido en los métodos de comparación generados (:meth:`__eq__`, :meth:`__gt__` y otros).

source: ``hash``: This can be a bool or ``None``. If true, this field is included in the generated :meth:`__hash__` method. If ``None`` (the default), use the value of ``compare``: this would normally be the expected behavior. A field should be considered in the hash if it's used for comparisons. Setting this value to anything other than ``None`` is discouraged.
es_es: ``hash``: Su valor puede ser de tipo booleano o ``None``. Si es verdadero, este campo es incluido en el método :meth:`__hash__` generado. Si es ``None`` (por defecto), utiliza el valor de ``compare``: normalmente éste es el comportamiento esperado. Un campo debería ser considerado para el *hash* si es compatible con operaciones de comparación. Está desaconsejado establecer este valor en algo que no sea ``None``.

source: One possible reason to set ``hash=False`` but ``compare=True`` would be if a field is expensive to compute a hash value for, that field is needed for equality testing, and there are other fields that contribute to the type's hash value. Even if a field is excluded from the hash, it will still be used for comparisons.
es_es: Una posible razón para definir ``hash=False`` y ``compare=True`` podría ser el caso en el que computar el valor *hash* para dicho campo es costoso pero el campo es necesario para los métodos de comparación, siempre que existan otros campos que contribuyen al valor hash del tipo. Incluso si un campo se excluye del hash, se seguirá utilizando a la hora de comparar.

source: ``metadata``: This can be a mapping or None. None is treated as an empty dict. This value is wrapped in :func:`~types.MappingProxyType` to make it read-only, and exposed on the :class:`Field` object. It is not used at all by Data Classes, and is provided as a third-party extension mechanism. Multiple third-parties can each have their own key, to use as a namespace in the metadata.
es_es: ``metadata``: Puede ser un mapeo o *None*. *None* es tratado como un diccionario vacío. Este valor es envuelto en :func:`~types.MappingProxyType` para que sea de sólo lectura y visible en el objeto :class:`Field`. No es utilizado por las clases de datos, mas bien es provisto como un mecanismo de extensión de terceros. Varios terceros pueden tener su propia clave para utilizar como espacio de nombres en *metadata*.

source: If the default value of a field is specified by a call to :func:`field()`, then the class attribute for this field will be replaced by the specified ``default`` value. If no ``default`` is provided, then the class attribute will be deleted. The intent is that after the :func:`dataclass` decorator runs, the class attributes will all contain the default values for the fields, just as if the default value itself were specified. For example, after::
es_es: Si el valor por defecto de un campo es especificado por una llamada a :func:`field()`, los atributos de clase para este campo serán reemplazados por los especificados en el valor ``default``. Si el valor de ``default`` no es provisto, el atributo de clase será eliminado. La idea es que, después que la ejecución del decorador :func:`dataclass`, todos los atributos de la clase contengan los valores por defecto de cada campo, como si fueran definidos uno por uno. Por ejemplo, luego de::

source: The class attribute ``C.z`` will be ``10``, the class attribute ``C.t`` will be ``20``, and the class attributes ``C.x`` and ``C.y`` will not be set.
es_es: El atributo de clase ``C.z`` será ``10``, el atributo de clase ``C.t`` será ``20`` y los atributos de clase ``C.x`` y ``C.y`` no serán definidos.

source: :class:`Field` objects describe each defined field. These objects are created internally, and are returned by the :func:`fields` module-level method (see below). Users should never instantiate a :class:`Field` object directly. Its documented attributes are:
es_es: Los objetos :class:`Field` describen cada campo definido. Estos objetos son creados internamente y son retornados por el método :func:`fields` definido en este módulo (explicado más abajo). Los usuarios no deben instanciar un objeto :class:`Field` directamente. Sus atributos documentados son:

source: ``name``: The name of the field.
es_es: ``name``: El nombre del campo.

source: ``type``: The type of the field.
es_es: ``type``: El tipo del campo.

source: ``default``, ``default_factory``, ``init``, ``repr``, ``hash``, ``compare``, and ``metadata`` have the identical meaning and values as they do in the :func:`field` declaration.
es_es: ``default``, ``default_factory``, ``init``, ``repr``, ``hash``, ``compare`` y ``metadata`` tienen los mismos valores y significados respecto a la declaración de :func:`field` (ver arriba).

source: Other attributes may exist, but they are private and must not be inspected or relied on.
es_es: Pueden existir otros atributos, pero son privados y no deberían ser considerados ni depender de ellos.

source: Returns a tuple of :class:`Field` objects that define the fields for this dataclass. Accepts either a dataclass, or an instance of a dataclass. Raises :exc:`TypeError` if not passed a dataclass or instance of one. Does not return pseudo-fields which are ``ClassVar`` or ``InitVar``.
es_es: Retorna una tupla de objetos :class:`Field` que definen los campos para esta clase de datos. Acepta tanto una clase de datos como una instancia de esta. Lanza una excepción :exc:`TypeError` si se le pasa cualquier otro objeto. No retorna pseudocampos, que son ``ClassVar`` o ``InitVar``.

source: Converts the dataclass ``instance`` to a dict (by using the factory function ``dict_factory``). Each dataclass is converted to a dict of its fields, as ``name: value`` pairs. dataclasses, dicts, lists, and tuples are recursed into. For example::
es_es: Convierte la clase de datos ``instance`` en un diccionario (usando la función fábrica ``dict_factory``). Cada clase de datos es convertida a un diccionario con sus campos como parejas ``name: value``. Las clases de datos, diccionarios, listas y tuplas son convertidas recursivamente. Por ejemplo::

source: Raises :exc:`TypeError` if ``instance`` is not a dataclass instance.
es_es: Lanza una excepción :exc:`TypeError` si ``instance`` no es una instancia de una clase de datos.

source: Converts the dataclass ``instance`` to a tuple (by using the factory function ``tuple_factory``). Each dataclass is converted to a tuple of its field values. dataclasses, dicts, lists, and tuples are recursed into.
es_es: Convierte la clase de datos ``instance`` a una tupla (usando la función fábrica ``tuple_factory``). Cada clase de datos es convertida a una tupla con los valores de sus campos. Las clases de datos, diccionarios, listas y tuplas son convertidas recursivamente.

source: Continuing from the previous example::
es_es: Continuando con el ejemplo anterior::
