Repository: python/python-docs-es
Catalog: library/dataclasses.po
Languages: es_es

source: Creates a new dataclass with name ``cls_name``, fields as defined in ``fields``, base classes as given in ``bases``, and initialized with a namespace as given in ``namespace``. ``fields`` is an iterable whose elements are each either ``name``, ``(name, type)``, or ``(name, type, Field)``. If just ``name`` is supplied, ``typing.Any`` is used for ``type``. The values of ``init``, ``repr``, ``eq``, ``order``, ``unsafe_hash``, and ``frozen`` have the same meaning as they do in :func:`dataclass`.
es_es: Crea una nueva clase de datos con el nombre ``cls_name``, con los campos definidos en ``fields``, con las clases base dadas en ``bases`` e inicializada con el espacio de nombres dado en ``namespace``. ``fields`` es un iterable que cumple con una de estas formas: ``name``, ``(name, type)`` o ``(name, type, Field)``. Si solo ``name`` es proporcionado, ``typing.Any`` es usado para ``type``. Los valores ``init``, ``repr``, ``eq``, ``order``, ``unsafe_hash`` y ``frozen`` tienen el mismo significado que en la función :func:`dataclass`.

source: This function is not strictly required, because any Python mechanism for creating a new class with ``__annotations__`` can then apply the :func:`dataclass` function to convert that class to a dataclass. This function is provided as a convenience. For example::
es_es: Esta función no es estrictamente necesaria debido a que cualquier mecanismo de Python para crear una nueva clase con ``__annotations__`` puede usar la función :func:`dataclass` para convertir esa clase en una clase de datos. Esta función se proporciona simplemente por comodidad. Por ejemplo::

source: Is equivalent to::
es_es: Es equivalente a::

source: Creates a new object of the same type of ``instance``, replacing fields with values from ``changes``. If ``instance`` is not a Data Class, raises :exc:`TypeError`. If values in ``changes`` do not specify fields, raises :exc:`TypeError`.
es_es: Crea un nuevo objeto del mismo tipo que ``instance``, reemplazando los campos correspondientes con los valores de ``changes``. Si ``instance`` no es una clase de datos se lanza una excepción :exc:`TypeError`. Si los valores en ``changes`` no especifican campos, también se lanza una excepción :exc:`TypeError`.

source: The newly returned object is created by calling the :meth:`__init__` method of the dataclass. This ensures that :meth:`__post_init__`, if present, is also called.
es_es: El objeto recién retornado es creado llamando al método :meth:`__init__` de la clase de datos. Esto asegura que :meth:`__post_init__`, si existe, también será llamado.

source: Init-only variables without default values, if any exist, must be specified on the call to :func:`replace` so that they can be passed to :meth:`__init__` and :meth:`__post_init__`.
es_es: Las variables de solo inicialización sin valores predeterminados, si existen, deben especificarse en la llamada a :func:`replace` para que puedan pasarse a :meth:`__init__` y :meth:`__post_init__`.

source: It is an error for ``changes`` to contain any fields that are defined as having ``init=False``. A :exc:`ValueError` will be raised in this case.
es_es: Es un error que ``changes`` contenga cualquier campo que esté definido como ``init=False``. Una excepción :exc:`ValueError` se lanzará en este caso.

source: Be forewarned about how ``init=False`` fields work during a call to :func:`replace`. They are not copied from the source object, but rather are initialized in :meth:`__post_init__`, if they're initialized at all. It is expected that ``init=False`` fields will be rarely and judiciously used. If they are used, it might be wise to have alternate class constructors, or perhaps a custom ``replace()`` (or similarly named) method which handles instance copying.
es_es: Tenga en cuenta cómo funcionan los campos ``init=False`` durante una llamada a :func:`replace`. No se copian del objeto de origen, sino que, de inicializarse, lo hacen en :meth:`__post_init__`. Se espera que los campos ``init=False`` se utilicen en contadas ocasiones y con prudencia. Si se utilizan, podría ser conveniente tener constructores de clase alternativos, o quizás un método personalizado ``replace()`` (o con un nombre similar) que maneje la copia de instancias.

source: Return ``True`` if its parameter is a dataclass or an instance of one, otherwise return ``False``.
es_es: Retorna ``True`` si su parámetro es una clase de datos o una instancia de una, en caso contrario retorna ``False``.

source: If you need to know if a class is an instance of a dataclass (and not a dataclass itself), then add a further check for ``not isinstance(obj, type)``::
es_es: Si se necesita conocer si una clase es una instancia de *dataclass* (y no una clase de datos en si misma), se debe agregar una verificación adicional para ``not isinstance(obj, type)``::

source: Post-init processing
es_es: Procesamiento posterior a la inicialización

source: The generated :meth:`__init__` code will call a method named :meth:`__post_init__`, if :meth:`__post_init__` is defined on the class. It will normally be called as ``self.__post_init__()``. However, if any ``InitVar`` fields are defined, they will also be passed to :meth:`__post_init__` in the order they were defined in the class. If no :meth:`__init__` method is generated, then :meth:`__post_init__` will not automatically be called.
es_es: El código del método generado :meth:`__init__` llamará a un método llamado :meth:`__post_init__`, si :meth:`__post_init__` está definido en la clase. Normalmente se llamará como ``self.__post_init__()``. Sin embargo, si se define algún campo ``InitVar``, también se pasarán a :meth:`__post_init__` en el orden en que se definieron en la clase. Si no se genera el método :meth:`__init__`, entonces :meth:`__post_init__` no se llamará automáticamente.

source: Among other uses, this allows for initializing field values that depend on one or more other fields. For example::
es_es: Entre otros usos, esto permite inicializar valores de campo que dependen de uno o más campos. Por ejemplo::

source: See the section below on init-only variables for ways to pass parameters to :meth:`__post_init__`. Also see the warning about how :func:`replace` handles ``init=False`` fields.
es_es: Consulta la sección sobre variables de solo inicialización que hay a continuación para conocer las posibles formas de pasar parámetros a :meth:`__post_init__`. También vea la advertencia sobre cómo :func:`replace` maneja los campos ``init = False``.

source: Class variables
es_es: Variables de clase

source: One of two places where :func:`dataclass` actually inspects the type of a field is to determine if a field is a class variable as defined in :pep:`526`. It does this by checking if the type of the field is ``typing.ClassVar``. If a field is a ``ClassVar``, it is excluded from consideration as a field and is ignored by the dataclass mechanisms. Such ``ClassVar`` pseudo-fields are not returned by the module-level :func:`fields` function.
es_es: Uno de los dos casos donde :func:`dataclass` realmente inspecciona el tipo de un campo, es para determinar si dicho campo es una variable de clase como se define en :pep:`526`. Lo hace comprobando si el tipo del campo es ``typing.ClassVar``. Si un campo es una ``ClassVar``, se deja de considerar como campo y los mecanismos de las clases de datos lo ignoran. Tales pseudocampos ``ClassVar`` no son retornados por la función del módulo :func:`fields`.

source: Init-only variables
es_es: Variable de solo inicialización

source: The other place where :func:`dataclass` inspects a type annotation is to determine if a field is an init-only variable. It does this by seeing if the type of a field is of type ``dataclasses.InitVar``. If a field is an ``InitVar``, it is considered a pseudo-field called an init-only field. As it is not a true field, it is not returned by the module-level :func:`fields` function. Init-only fields are added as parameters to the generated :meth:`__init__` method, and are passed to the optional :meth:`__post_init__` method. They are not otherwise used by dataclasses.
es_es: El otro caso donde :func:`dataclass` inspecciona una anotación de tipo es para determinar si un campo es una variable de solo inicialización. Lo hace comprobando si el tipo de un campo es ``dataclasses.InitVar``. Si un campo es un ``InitVar``, se considera un pseudocampo llamado 'campo de solo inicialización'. Como no es un campo verdadero, no es retornado por la función del módulo :func:`fields`. Los campos de solo inicialización se agregan como parámetros al método generado :meth:`__init__` y se pasan al método opcional :meth:`__post_init__`. No son utilizados de otra manera por las clases de datos.

source: For example, suppose a field will be initialized from a database, if a value is not provided when creating the class::
es_es: Por ejemplo, supongamos que se va a inicializar un campo desde una base de datos, de no proporcionarse un valor al crear la clase::

source: In this case, :func:`fields` will return :class:`Field` objects for ``i`` and ``j``, but not for ``database``.
es_es: En este caso, :func:`fields` retornará objetos :class:`Field` para ``i`` y ``j``, pero no para ``database``.

source: Frozen instances
es_es: Instancias congeladas

source: It is not possible to create truly immutable Python objects. However, by passing ``frozen=True`` to the :meth:`dataclass` decorator you can emulate immutability. In that case, dataclasses will add :meth:`__setattr__` and :meth:`__delattr__` methods to the class. These methods will raise a :exc:`FrozenInstanceError` when invoked.
es_es: No es posible crear objetos verdaderamente inmutables en Python. Sin embargo, se puede emular la inmutabilidad pasando ``frozen=True`` al decorador :meth:`dataclass`. En este caso, las clases de datos añadirán los métodos :meth:`__setattr__` y :meth:`__delattr__` a la clase. Estos métodos lanzarán una excepción :exc:`FrozenInstanceError` cuando sean llamados.

source: There is a tiny performance penalty when using ``frozen=True``: :meth:`__init__` cannot use simple assignment to initialize fields, and must use :meth:`object.__setattr__`.
es_es: Hay una pequeña penalización de rendimiento cuando se usa ``frozen=True``, esto se debe a que :meth:`__init__` no puede usar una asignación simple para inicializar campos, viéndose obligado a usar :meth:`object.__setattr__`.

source: Inheritance
es_es: Herencia

source: When the dataclass is being created by the :meth:`dataclass` decorator, it looks through all of the class's base classes in reverse MRO (that is, starting at :class:`object`) and, for each dataclass that it finds, adds the fields from that base class to an ordered mapping of fields. After all of the base class fields are added, it adds its own fields to the ordered mapping. All of the generated methods will use this combined, calculated ordered mapping of fields. Because the fields are in insertion order, derived classes override base classes. An example::
es_es: Cuando la clase de datos está siendo creada por el decorador :meth:`dataclass`, revisa todas las clases base de la clase en el MRO invertido (es decir, comenzando en :class:`object`) y, para cada clase de datos que encuentra, agrega los campos de esa clase base a un mapeo ordenado. Después de agregar todos los campos de la clase base, agrega sus propios campos al mapeo. Todos los métodos generados utilizarán este mapeo ordenado calculado combinando los campos. Como los campos están en orden de inserción, las clases derivadas anulan las clases base. Un ejemplo::

source: The final list of fields is, in order, ``x``, ``y``, ``z``. The final type of ``x`` is ``int``, as specified in class ``C``.
es_es: La lista final de campos es, en orden, ``x``, ``y``, ``z``. El tipo final de ``x`` es ``int``, como se especifica en la clase ``C``.

source: The generated :meth:`__init__` method for ``C`` will look like::
es_es: El método :meth:`__init__` generado para ``C`` se verá como::

source: Default factory functions
es_es: Funciones fábrica por defecto

source: If a :func:`field` specifies a ``default_factory``, it is called with zero arguments when a default value for the field is needed. For example, to create a new instance of a list, use::
es_es: Si un :func:`field` especifica una ``default_factory``, se llama sin argumentos cuando se necesita un valor predeterminado para el campo. Por ejemplo, para crear una nueva instancia de una lista, debe usarse::

source: If a field is excluded from :meth:`__init__` (using ``init=False``) and the field also specifies ``default_factory``, then the default factory function will always be called from the generated :meth:`__init__` function. This happens because there is no other way to give the field an initial value.
es_es: Si un campo está excluido de :meth:`__init__` (usando ``init = False``) y el campo también especifica ``default_factory``, entonces la función de fábrica predeterminada siempre se llamará desde la función generada :meth:`__init__`. Esto sucede porque no existe otra forma de darle al campo un valor inicial.

source: Mutable default values
es_es: Valores por defecto mutables

source: Python stores default member variable values in class attributes. Consider this example, not using dataclasses::
es_es: Python almacena los valores miembros por defecto en atributos de clase. Considera este ejemplo, sin usar clases de datos::

source: Note that the two instances of class ``C`` share the same class variable ``x``, as expected.
es_es: Tenga en cuenta que, tal como cabe esperar, las dos instancias de la clase ``C`` comparten la misma variable de clase ``x``.

source: Using dataclasses, *if* this code was valid::
es_es: Usando clases de datos, *si* este código fuera válido:

source: it would generate code similar to::
es_es: generaría un código similar a::

source: This has the same issue as the original example using class ``C``. That is, two instances of class ``D`` that do not specify a value for ``x`` when creating a class instance will share the same copy of ``x``. Because dataclasses just use normal Python class creation they also share this behavior. There is no general way for Data Classes to detect this condition. Instead, dataclasses will raise a :exc:`TypeError` if it detects a default parameter of type ``list``, ``dict``, or ``set``. This is a partial solution, but it does protect against many common errors.
es_es: Este tiene el mismo problema que el ejemplo original usando la clase ``C``. Es decir, dos instancias de la clase ``D`` que no especifican un valor para ``x``, al crear una instancia de la clase, compartirán la misma copia de ``x``. Debido a que las clases de datos usan simplemente el mecanismo normal de creación de clases de Python, también comparten este comportamiento. No existe una forma genérica de que las clases de datos detecten esta condición. En su lugar, las clases de datos generarán una excepción :exc:`TypeError` si detectan un parámetro predeterminado de tipo ``list``, ``dict`` o ``set`` (contenedores incorporados mutables). Esta es una solución parcial, pero protege contra muchos de los errores más comunes.

source: Using default factory functions is a way to create new instances of mutable types as default values for fields::
es_es: Usar las funciones fábrica por defecto es una forma de crear nuevas instancias de tipos mutables como valores por defecto para campos::

source: Exceptions
es_es: Excepciones

source: Raised when an implicitly defined :meth:`__setattr__` or :meth:`__delattr__` is called on a dataclass which was defined with ``frozen=True``.
es_es: Es lanzada cuando un método :meth:`__setattr__` o :meth:`__delattr__` definido implícitamente es llamado en una clase de datos que ha sido definida con ``frozen=True``.
