Repository: python/python-docs-es
Catalog: library/dbm.po
Languages: es

source: :mod:`dbm` --- Interfaces to Unix "databases"
es: :mod:`dbm` --- Interfaces para "bases de datos" de Unix

source: **Source code:** :source:`Lib/dbm/__init__.py`
es: **Código fuente:** :source:`Lib/dbm/__init__.py`

source: :mod:`dbm` is a generic interface to variants of the DBM database --- :mod:`dbm.gnu` or :mod:`dbm.ndbm`. If none of these modules is installed, the slow-but-simple implementation in module :mod:`dbm.dumb` will be used. There is a `third party interface <https://www.jcea.es/programacion/pybsddb.htm>`_ to the Oracle Berkeley DB.
es: :mod:`dbm` es una interfaz genérica para variantes de la base de datos DBM — :mod:`dbm.gnu` o :mod:`dbm.ndbm`. Si ninguno de estos módulos son instalados, se utilizará la implementación lenta pero sencilla en el módulo :mod:`dbm.dumb`. Existe una `interfaz de terceros <https://www.jcea.es/programacion/pybsddb.htm>`_ para la Oracle Berkeley DB.

source: A tuple containing the exceptions that can be raised by each of the supported modules, with a unique exception also named :exc:`dbm.error` as the first item --- the latter is used when :exc:`dbm.error` is raised.
es: Una tupla que contiene las excepciones que pueden ser lanzadas por cada uno de los módulos soportados, con una excepción única también denominada :exc:`dbm.error` como el primer elemento — el último se usa cuando se genera :exc:`dbm.error`.

source: This function attempts to guess which of the several simple database modules available --- :mod:`dbm.gnu`, :mod:`dbm.ndbm` or :mod:`dbm.dumb` --- should be used to open a given file.
es: Esta función intenta adivinar cuál de los varios módulos de base de datos simples disponibles --- :mod:`dbm.gnu`, :mod:`dbm.ndbm` o :mod:`dbm.dumb` --- deberán usarse para abrir un archivo.

source: Returns one of the following values: ``None`` if the file can't be opened because it's unreadable or doesn't exist; the empty string (``''``) if the file's format can't be guessed; or a string containing the required module name, such as ``'dbm.ndbm'`` or ``'dbm.gnu'``.
es: Retorna uno de los siguientes valores: ``None`` si el archivo no se puede abrir porque no se puede leer o no existe; la cadena de caracteres vacía (``''``) si no se puede adivinar el formato del archivo; o una cadena de caracteres que contenga el nombre del módulo requerido, como ``'dbm.ndbm'`` o ``'dbm.gnu'``.

source: Accepts :term:`path-like object` for filename.
es: Acepta :term:`path-like object` como nombre de archivo.

source: Open the database file *file* and return a corresponding object.
es: Abre el archivo *file* de la base de datos y retorna un objeto correspondiente.

source: If the database file already exists, the :func:`whichdb` function is used to determine its type and the appropriate module is used; if it does not exist, the first module listed above that can be imported is used.
es: Si el archivo de la base de datos existe, la función :func:`whichdb` es usada para determinar su tipo y el módulo apropiado se utiliza; sino existe, se utiliza el primer módulo listado anteriormente que se puede importar.

source: The optional *flag* argument can be:
es: El argumento opcional *flag* puede ser:

source: Value
es: Valor

source: Meaning
es: Significado

source: Open existing database for reading only (default)
es: Abre la base de datos existente solo para lectura (predeterminado)

source: Open existing database for reading and writing
es: Abre la base de datos existente para leer y escribir

source: Open database for reading and writing, creating it if it doesn't exist
es: Abre la base de datos para lectura y escritura, creándola si no existe

source: Always create a new, empty database, open for reading and writing
es: Siempre cree una base de datos nueva, vacía, abierta para lectura y escritura

source: The optional *mode* argument is the Unix mode of the file, used only when the database has to be created. It defaults to octal ``0o666`` (and will be modified by the prevailing umask).
es: El argumento opcional *mode* es el modo Unix del archivo, usado solamente cuando la base de datos tiene que ser creada. Su valor predeterminado es octal ``0o666`` (y será modificado por el umask vigente).

source: The object returned by :func:`.open` supports the same basic functionality as dictionaries; keys and their corresponding values can be stored, retrieved, and deleted, and the :keyword:`in` operator and the :meth:`keys` method are available, as well as :meth:`get` and :meth:`setdefault`.
es: El objeto retornado por :func:`.open` admite la misma funcionalidad básica que los diccionarios; las claves y sus valores correspondientes se pueden almacenar, recuperar y eliminar, y el operador :keyword:`in` y el método :meth:`keys` están disponibles, así como :meth:`get` y :meth:`setdefault`.

source: :meth:`get` and :meth:`setdefault` are now available in all database modules.
es: :meth:`get` y :meth:`setdefault` ya están disponibles en todos los módulos de base de datos.

source: Deleting a key from a read-only database raises database module specific error instead of :exc:`KeyError`.
es: Al eliminar una clave de una base de datos de solo lectura lanza un error específico del módulo de la base de datos en lugar de :exc:`KeyError`.

source: Accepts :term:`path-like object` for file.
es: Acepta :term:`path-like object` como nombre de archivo.

source: Key and values are always stored as bytes. This means that when strings are used they are implicitly converted to the default encoding before being stored.
es: La clave y los valores siempre se almacenan como bytes. Esto significa que cuando se utilizan cadenas de caracteres, se convierten implícitamente a la codificación predeterminada antes de almacenarse.

source: These objects also support being used in a :keyword:`with` statement, which will automatically close them when done.
es: Estos objetos también admiten el uso en una instrucción :keyword:`with`, que los cerrará automáticamente cuando termine.

source: Added native support for the context management protocol to the objects returned by :func:`.open`.
es: Se agregó soporte nativo para el protocolo de administración de contexto a los objetos retornados por :func:`.open`.

source: The following example records some hostnames and a corresponding title, and then prints out the contents of the database::
es: El siguiente ejemplo registra algunos nombres de host y un título correspondiente, y luego imprime el contenido de la base de datos::

source: Module :mod:`shelve`
es: Módulo :mod:`shelve`

source: Persistence module which stores non-string data.
es: Módulo de persistencia que almacena datos que no son cadenas de caracteres.

source: The individual submodules are described in the following sections.
es: Los submódulos individuales se describen en las siguientes secciones.

source: :mod:`dbm.gnu` --- GNU's reinterpretation of dbm
es: :mod:`dbm.gnu` --- La reinterpretación de GNU de dbm

source: **Source code:** :source:`Lib/dbm/gnu.py`
es: **Código fuente:** :source:`Lib/dbm/gnu.py`

source: This module is quite similar to the :mod:`dbm` module, but uses the GNU library ``gdbm`` instead to provide some additional functionality. Please note that the file formats created by :mod:`dbm.gnu` and :mod:`dbm.ndbm` are incompatible.
es: Este módulo es bastante similar al módulo :mod:`dbm`, pero usa la biblioteca GNU ``gdbm`` en su lugar para proporcionar alguna funcionalidad adicional. Tenga en cuenta que los formatos de archivo creados por :mod:`dbm.gnu` y :mod:`dbm.ndbm` son incompatibles.

source: The :mod:`dbm.gnu` module provides an interface to the GNU DBM library. ``dbm.gnu.gdbm`` objects behave like mappings (dictionaries), except that keys and values are always converted to bytes before storing. Printing a ``gdbm`` object doesn't print the keys and values, and the :meth:`items` and :meth:`values` methods are not supported.
es: El módulo :mod:`dbm.gnu` proporciona una interfaz a la biblioteca GNU DBM. Los objetos ``dbm.gnu.gdbm`` se comportan como asignaciones (diccionarios), excepto que las claves y los valores siempre se convierten a bytes antes de almacenarlos. La impresión de un objeto ``gdbm`` no imprime las llaves y los valores, y los métodos :meth:`items` y :meth:`values` no son compatibles.

source: Raised on :mod:`dbm.gnu`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
es: Se lanza en errores específicos :mod:`dbm.gnu`, como errores de E/S. :exc:`KeyError` se genera para errores generales de asignación, como especificar una clave incorrecta.

source: Open a ``gdbm`` database and return a :class:`gdbm` object. The *filename* argument is the name of the database file.
es: Abre una base de datos ``gdbm`` y retorna un objeto :class:`gdbm`. El argumento *filename* es el nombre del archivo de la base de datos.

source: The following additional characters may be appended to the flag to control how the database is opened:
es: Los siguientes caracteres adicionales se pueden agregar al flag para controlar cómo se abre la base de datos:

source: Open the database in fast mode. Writes to the database will not be synchronized.
es: Abre la base de datos en modo rápido. Las escrituras en la base de datos no se sincronizarán.

source: Synchronized mode. This will cause changes to the database to be immediately written to the file.
es: Modo sincronizado. Esto hará que los cambios en la base de datos se escriban inmediatamente en el archivo.

source: Do not lock database.
es: No bloquea la base de datos.

source: Not all flags are valid for all versions of ``gdbm``. The module constant :const:`open_flags` is a string of supported flag characters. The exception :exc:`error` is raised if an invalid flag is specified.
es: No todos los flags son válidas para todas las versiones de ``gdbm``. La constante del módulo :const:`open_flags` es una cadena de caracteres de flags soportadas. La excepción :exc:`error` se lanza si se especifica un flag no válido.

source: The optional *mode* argument is the Unix mode of the file, used only when the database has to be created. It defaults to octal ``0o666``.
es: El argumento opcional *mode* es el modo Unix del archivo, usado solo cuando la base de datos tiene que ser creada. Su valor predeterminado es octal ``0o666``.

source: In addition to the dictionary-like methods, ``gdbm`` objects have the following methods:
es: Además de los métodos similares a los diccionarios, los objetos ``gdbm`` tienen los siguientes métodos:

source: It's possible to loop over every key in the database using this method and the :meth:`nextkey` method. The traversal is ordered by ``gdbm``'s internal hash values, and won't be sorted by the key values. This method returns the starting key.
es: Es posible recorrer cada clave en la base de datos usando este método y el método :meth:`nextkey`. El recorrido está ordenado por los valores hash internos de ``gdbm`` y no se ordenará por los valores clave. Este método retorna la clave de inicio.

source: Returns the key that follows *key* in the traversal. The following code prints every key in the database ``db``, without having to create a list in memory that contains them all::
es: Retorna la clave que sigue a *key* en el recorrido. El siguiente código imprime todas las claves en la base de datos ``db``, sin tener que crear una lista en la memoria que las contenga todas::

source: If you have carried out a lot of deletions and would like to shrink the space used by the ``gdbm`` file, this routine will reorganize the database. ``gdbm`` objects will not shorten the length of a database file except by using this reorganization; otherwise, deleted file space will be kept and reused as new (key, value) pairs are added.
es: Si ha realizado muchas eliminaciones y desea reducir el espacio utilizado por el archivo ``gdbm``, esta rutina reorganizará la base de datos. Los objetos ``gdbm`` no acortarán la longitud de un archivo de base de datos excepto al usar esta reorganización; de lo contrario, el espacio de archivo eliminado se conservará y reutilizará cuando se agreguen nuevos pares (clave, valor).

source: When the database has been opened in fast mode, this method forces any unwritten data to be written to the disk.
es: Cuando la base de datos se ha abierto en modo rápido, este método obliga a que los datos no escritos se escriban en el disco.

source: Close the ``gdbm`` database.
es: Cierra la base de datos ``gdbm``.

source: :mod:`dbm.ndbm` --- Interface based on ndbm
es: :mod:`dbm.ndbm` --- Interfaz basada en ndbm

source: **Source code:** :source:`Lib/dbm/ndbm.py`
es: **Código fuente:** :source:`Lib/dbm/ndbm.py`

source: The :mod:`dbm.ndbm` module provides an interface to the Unix "(n)dbm" library. Dbm objects behave like mappings (dictionaries), except that keys and values are always stored as bytes. Printing a ``dbm`` object doesn't print the keys and values, and the :meth:`items` and :meth:`values` methods are not supported.
es: El módulo :mod:`dbm.ndbm` proporciona una interfaz a la biblioteca "(n)dbm" de Unix. Los objetos DBM se comportan como asignaciones (diccionarios), excepto que las claves y los valores siempre se almacenan como bytes. La impresión de un objeto ``dbm`` no imprime las claves y los valores, y los métodos :meth:`items` y :meth:`values` no son compatibles.

source: This module can be used with the "classic" ndbm interface or the GNU GDBM compatibility interface. On Unix, the :program:`configure` script will attempt to locate the appropriate header file to simplify building this module.
es: Este módulo se puede utilizar con la interfaz ndbm "clásica" o la interfaz de compatibilidad GNU GDBM. En Unix, el código :program:`configure` intentará localizar el archivo de encabezado apropiado para simplificar la construcción de este módulo.

source: Raised on :mod:`dbm.ndbm`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
es: Se lanza en errores específicos :mod:`bm.ndbm`, como errores de E/S. :exc:`KeyError` lanza para errores generales de asignación, como especificar una clave incorrecta.

source: Name of the ``ndbm`` implementation library used.
es: Nombre de la biblioteca de implementación ``ndbm`` utilizada.

source: Open a dbm database and return a ``ndbm`` object. The *filename* argument is the name of the database file (without the :file:`.dir` or :file:`.pag` extensions).
es: Abre una base de datos dbm y retorna un objeto ``ndbm``. El argumento **filename** es el nombre de la base de datos (sin las extensiones :file:`.dir` y :file:`.pag`).

source: The optional *flag* argument must be one of these values:
es: El argumento *flag* opcional debe ser uno de estos valores:

source: In addition to the dictionary-like methods, ``ndbm`` objects provide the following method:
es: Además de los métodos similares a los de un diccionario, los objetos ``ndbm`` proporcionan el siguiente método:

source: Close the ``ndbm`` database.
es: Cierra la base de datos ``ndbm``.

source: :mod:`dbm.dumb` --- Portable DBM implementation
es: :mod:`dbm.dumb` --- Implementación de DBM portátil

source: **Source code:** :source:`Lib/dbm/dumb.py`
es: **Código fuente:** :source:`Lib/dbm/dumb.py`

source: The :mod:`dbm.dumb` module is intended as a last resort fallback for the :mod:`dbm` module when a more robust module is not available. The :mod:`dbm.dumb` module is not written for speed and is not nearly as heavily used as the other database modules.
es: El módulo :mod:`dbm.dumb` está pensado como último recurso para el módulo :mod:`dbm` cuando no hay disponible un módulo más robusto. El módulo :mod:`dbm.dymb` no está escrito para velocidad y no se usa tanto como los otros módulos de base de datos.

source: The :mod:`dbm.dumb` module provides a persistent dictionary-like interface which is written entirely in Python. Unlike other modules such as :mod:`dbm.gnu` no external library is required. As with other persistent mappings, the keys and values are always stored as bytes.
es: El módulo :mod:`dbm.dumb` proporciona una interfaz persistente similar a un diccionario que está escrita completamente en Python. A diferencia de otros módulos como :mod:`dbm.gnu`, no se requiere una biblioteca externa. Al igual que con otras asignaciones persistentes, las claves y los valores siempre se almacenan como bytes.

source: The module defines the following:
es: El módulo define lo siguiente:

source: Raised on :mod:`dbm.dumb`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
es: Se lanza en errores específicos :mod:`dbm.dumb`, como errores de E/S. :exc:`KeyError` se lanza para errores de mapeo generales como especificar una clave incorrecta.

source: Open a ``dumbdbm`` database and return a dumbdbm object. The *filename* argument is the basename of the database file (without any specific extensions). When a dumbdbm database is created, files with :file:`.dat` and :file:`.dir` extensions are created.
es: Abre una base de datos ``dumbdbm`` y retorna un objeto dumbdbm. El argumento del *filename* es el nombre base del archivo de la base de datos (sin extensiones específicas). Cuando una base de datos dumbdbm se crea, archivos con la extensión :file:`.dat` y :file:`.dir` se crean.

source: It is possible to crash the Python interpreter when loading a database with a sufficiently large/complex entry due to stack depth limitations in Python's AST compiler.
es: Es posible bloquear el intérprete de Python cuando se carga una base de datos con una entrada suficientemente grande/compleja debido a las limitaciones de profundidad de la pila en el compilador AST de Python.

source: :func:`.open` always creates a new database when the flag has the value ``'n'``.
es: :func:`.open` siempre crea una nueva base de datos cuando el flag tiene valor de ``'n'``.

source: A database opened with flags ``'r'`` is now read-only. Opening with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist.
es: Una base de datos abierta con flags ``'r'`` ahora es de solo lectura. Abrir con los flags ``'r'`` y ``'w'`` ya no crea una base de datos si no existe.

source: In addition to the methods provided by the :class:`collections.abc.MutableMapping` class, :class:`dumbdbm` objects provide the following methods:
es: Además de los métodos proporcionados por la clase :class:`collections.abc.MutableMapping`, los objetos :class:`dumbdbm` proporcionan los siguientes métodos:

source: Synchronize the on-disk directory and data files. This method is called by the :meth:`Shelve.sync` method.
es: Sincroniza el directorio en disco y los archivos de datos. Este método es llamado por el método :meth:`Shelve.sync`.

source: Close the ``dumbdbm`` database.
es: Cierra la base de datos ``dumbdbm``.
