Repository: python/python-docs-es
Catalog: library/difflib.po
Languages: es

source: SequenceMatcher objects get three data attributes: *bjunk* is the set of elements of *b* for which *isjunk* is ``True``; *bpopular* is the set of non-junk elements considered popular by the heuristic (if it is not disabled); *b2j* is a dict mapping the remaining elements of *b* to a list of positions where they occur. All three are reset whenever *b* is reset with :meth:`set_seqs` or :meth:`set_seq2`.
es: Los objetos `SequenceMatcher` reciben tres atributos: *bjunk* es el conjunto de elementos de *b* para los cuales *isjunk* es ``True``; *bpopular* es el set de elementos que no son basura considerados populares por la heurística (si no es que fue deshabilitada); *b2j* es un diccionario que mapea elementos de *b* a una lista de posiciones donde estos ocurren. Los tres atributos son reseteados cuando *b* es reseteado mediante :meth:`set_seqs` o :meth:`set_seq2`.

source: The *bjunk* and *bpopular* attributes.
es: Los atributos *bjunk* y *bpopular*.

source: :class:`SequenceMatcher` objects have the following methods:
es: Los objetos :class:`SequenceMatcher` tienen los siguientes métodos:

source: Set the two sequences to be compared.
es: Establece las dos secuencias a ser comparadas.

source: :class:`SequenceMatcher` computes and caches detailed information about the second sequence, so if you want to compare one sequence against many sequences, use :meth:`set_seq2` to set the commonly used sequence once and call :meth:`set_seq1` repeatedly, once for each of the other sequences.
es: :class:`SequenceMatcher` calcula y almacena información detallada sobre la segunda secuencia, con lo cual si quieres comparar una secuencia contra muchas otras, usa :meth:`set_seq2` para establecer la secuencia común una sola vez y llamar :meth:`set_seq1` repetidamente, una vez por cada una de las otras secuencias.

source: Set the first sequence to be compared. The second sequence to be compared is not changed.
es: Establece la primer secuencia a ser comparada. La segunda secuencia a ser comparada no es modificada.

source: Set the second sequence to be compared. The first sequence to be compared is not changed.
es: Establece la segunda secuencia a ser comparada. La primera secuencia a ser comparada no es modificada.

source: Find longest matching block in ``a[alo:ahi]`` and ``b[blo:bhi]``.
es: Encuentra el bloque de coincidencia mas largo en ``a[alo:ahi]`` y ``b[blo:bhi]``.

source: If *isjunk* was omitted or ``None``, :meth:`find_longest_match` returns ``(i, j, k)`` such that ``a[i:i+k]`` is equal to ``b[j:j+k]``, where ``alo <= i <= i+k <= ahi`` and ``blo <= j <= j+k <= bhi``. For all ``(i', j', k')`` meeting those conditions, the additional conditions ``k >= k'``, ``i <= i'``, and if ``i == i'``, ``j <= j'`` are also met. In other words, of all maximal matching blocks, return one that starts earliest in *a*, and of all those maximal matching blocks that start earliest in *a*, return the one that starts earliest in *b*.
es: Si *isjunk* fue omitido o es ``None``, :meth:`find_longest_match` retorna ``(i, j, k)`` tal que ``a[i:i+k]`` es igual a ``b[j:j+k]``, donde ``alo <= i <= i+k <= ahi`` y ``blo <= j <= j+k <= bhi``. Para todo ``(i', j', k')`` cumpliendo esas condiciones, las condiciones adicionales ``k >= k'``, ``i <= i'``, y si ``i == i'``, ``j <= j'`` también se cumplen. En otras palabras, de todos los bloques coincidentes máximos, retorna aquel que comienza antes en *a*, y de todos esos bloques coincidentes máximos que comienzan antes en *a*, retorna aquel que comienza antes en *b*.

source: If *isjunk* was provided, first the longest matching block is determined as above, but with the additional restriction that no junk element appears in the block. Then that block is extended as far as possible by matching (only) junk elements on both sides. So the resulting block never matches on junk except as identical junk happens to be adjacent to an interesting match.
es: Si se porporcionó *isjunk*, primero se determina el bloque coincidente mas largo como fue indicado anteriormente, pero con la restricción adicional de que no aparezca ningún elemento no deseado en el bloque. Entonces, ese bloque se extiende tan lejos como sea posible haciendo coincidir (solo) elementos no deseados de ambos lados. Por lo tanto, el bloque resultante nunca hará coincidir ningún elemento no deseado, excepto que un elemento no deseado idéntico pase a ser adyacente a una coincidencia interesante.

source: Here's the same example as before, but considering blanks to be junk. That prevents ``' abcd'`` from matching the ``' abcd'`` at the tail end of the second sequence directly. Instead only the ``'abcd'`` can match, and matches the leftmost ``'abcd'`` in the second sequence:
es: Este es el mismo ejemplo que el mostrado anteriormente, pero considerando elementos en blanco como no deseados. Esto previene que ``' abcd'`` sea coincidente con ``'abcd'`` en el final de la segunda secuencia directamente. En cambio, sólo el ``'abcd'`` puede coincidir, y coincide con el ``'abcd'`` que se encuentre mas a la izquierda en la segunda secuencia:

source: If no blocks match, this returns ``(alo, blo, 0)``.
es: Si no coincide ningún bloque, esto retorna ``(alo, blo, 0)``.

source: This method returns a :term:`named tuple` ``Match(a, b, size)``.
es: Este método retorna un :term:`named tuple` ``Match(a, b, size)``.

source: Added default arguments.
es: Se agregaron argumentos predeterminados.

source: Return list of triples describing non-overlapping matching subsequences. Each triple is of the form ``(i, j, n)``, and means that ``a[i:i+n] == b[j:j+n]``. The triples are monotonically increasing in *i* and *j*.
es: Retorna una lista de triplas (tuplas de tres elementos) describiendo subsecuencias coincidentes no superpuestas. Cada tripla sigue el formato ``(i, j, n)``, y significa que ``a[i:i+n] == b[j:j+n]``. Las triplas son monótonamente crecientes en *i* y *j*.

source: The last triple is a dummy, and has the value ``(len(a), len(b), 0)``. It is the only triple with ``n == 0``. If ``(i, j, n)`` and ``(i', j', n')`` are adjacent triples in the list, and the second is not the last triple in the list, then ``i+n < i'`` or ``j+n < j'``; in other words, adjacent triples always describe non-adjacent equal blocks.
es: La última tripla es un objeto ficticio (dummy), y tiene el valor ``(len(a), len(b), 0)``. Es la única tripla con ``n == 0``. Si ``(i, j, n)`` y ``(i', j', n')`` son triplas adyacentes en la lista, y la segunda no es el último elemento de la lista, entonces ``i+n < i'`` o ``j+n < j'``; en otras palabras, las triplas adyacentes describen bloques iguales no adyacentes.

source: Return list of 5-tuples describing how to turn *a* into *b*. Each tuple is of the form ``(tag, i1, i2, j1, j2)``. The first tuple has ``i1 == j1 == 0``, and remaining tuples have *i1* equal to the *i2* from the preceding tuple, and, likewise, *j1* equal to the previous *j2*.
es: Retorna una lista de quíntuplas (tuplas de cinco elementos) describiendo como convertir *a* en *b*. Cada tupla tiene la forma ``(tag, i1, i2, j1, j2)``. En la primer tupla se cumple que ``i1 == j1 == 0``, y las tuplas restantes tienen *i1* igual al *i2* de la tupla precedente, y de igual manera, *j1* igual al *j2* de la tupla anterior.

source: The *tag* values are strings, with these meanings:
es: Los valores de *tag* son cadenas de caracteres, con el siguiente significado:

source: Value
es: Valor

source: ``a[i1:i2]`` should be replaced by ``b[j1:j2]``.
es: ``a[i1:i2]`` debe ser reemplazado por ``b[j1:j2]``.

source: ``a[i1:i2]`` should be deleted. Note that ``j1 == j2`` in this case.
es: ``a[i1:i2]`` debe ser eliminado. Nótese que en este caso ``j1 == j2``.

source: ``b[j1:j2]`` should be inserted at ``a[i1:i1]``. Note that ``i1 == i2`` in this case.
es: ``b[j1:j2]`` debe ser insertado en ``a[i1:i1]``. Nótese que en este caso ``i1 == i2``.

source: ``a[i1:i2] == b[j1:j2]`` (the sub-sequences are equal).
es: ``a[i1:i2] == b[j1:j2]`` (las subsecuencias son iguales).

source: For example::
es: Por ejemplo:

source: Return a :term:`generator` of groups with up to *n* lines of context.
es: Retorna un :term:`generator` de grupos de hasta *n* líneas de contexto.

source: Starting with the groups returned by :meth:`get_opcodes`, this method splits out smaller change clusters and eliminates intervening ranges which have no changes.
es: Empezando con los grupos retornados por :meth:`get_opcodes`, este método separa grupos con cambios menores y elimina los rangos intermedios que no tienen cambios.

source: The groups are returned in the same format as :meth:`get_opcodes`.
es: Los grupos son retornados en el mismo formato que :meth:`get_opcodes`.

source: Return a measure of the sequences' similarity as a float in the range [0, 1].
es: Retorna una medida de la similitud de las secuencias como un flotante en el rango [0, 1].

source: Where T is the total number of elements in both sequences, and M is the number of matches, this is 2.0\*M / T. Note that this is ``1.0`` if the sequences are identical, and ``0.0`` if they have nothing in common.
es: Donde T es el número total de elementos en ambas secuencias y M es el número de coincidencias, esto es 2.0\*M / T. Nótese que esto es ``1.0`` si las secuencias son idénticas y ``0.0`` si no tienen nada en común.

source: This is expensive to compute if :meth:`get_matching_blocks` or :meth:`get_opcodes` hasn't already been called, in which case you may want to try :meth:`quick_ratio` or :meth:`real_quick_ratio` first to get an upper bound.
es: Esto es computacionalmente costoso si :meth:`get_matching_blocks` o :meth:`get_opcodes` no fueron ejecutados, in tal caso deberías considerar primero :meth:`quick_ratio` o :meth:`real_quick_ratio` para obtener un límite superior.

source: Caution: The result of a :meth:`ratio` call may depend on the order of the arguments. For instance::
es: Precaución: El resultado de una llamada a :meth:`ratio` puede depender del orden de los argumentos. Por ejemplo::

source: Return an upper bound on :meth:`ratio` relatively quickly.
es: Retorna un límite superior en :meth:`ratio` relativamente rápido.

source: Return an upper bound on :meth:`ratio` very quickly.
es: Retorna un límite superior en :meth:`ratio` muy rápido.

source: SequenceMatcher Examples
es: :class:`SequenceMatcher` Ejemplos

source: This example compares two strings, considering blanks to be "junk":
es: Este ejemplo compara dos cadenas de texto, considerando los espacios en blanco como caracteres no deseados:

source: The :func:`get_close_matches` function in this module which shows how simple code building on :class:`SequenceMatcher` can be used to do useful work.
es: La función :func:`get_close_matches` en este módulo que muestra lo simple que es el código que construye :class:`SequenceMatcher` puede ser utilizada para hacer un trabajo útil.

source: `Simple version control recipe <https://code.activestate.com/recipes/576729/>`_ for a small application built with :class:`SequenceMatcher`.
es: `Una receta simple de un controlador de versiones <https://code.activestate.com/recipes/576729/>`_ para una aplicación pequeña construida con :class:`SequenceMatcher`.

source: Differ Objects
es: Objetos *Differ*

source: Note that :class:`Differ`\ -generated deltas make no claim to be **minimal** diffs. To the contrary, minimal diffs are often counter-intuitive, because they synch up anywhere possible, sometimes accidental matches 100 pages apart. Restricting synch points to contiguous matches preserves some notion of locality, at the occasional cost of producing a longer diff.
es: Nótese que los deltas generados por :class:`Differ` no dicen ser diferencias **mínimas**. Todo lo contrario, las diferencias mínimas suelen ser contra-intuitivas, ya que se sincronizan en cualquier lugar posible, a veces coinciden accidentalmente con 100 páginas de diferencia. Restringiendo los puntos de sincronización a coincidencias contiguas se preserva cierta noción de cercanía, con el costo adicional de producir diferencias mas largas.

source: The :class:`Differ` class has this constructor:
es: La clase :class:`Differ` tiene el siguiente constructor:

source: Optional keyword parameters *linejunk* and *charjunk* are for filter functions (or ``None``):
es: Parámetros de palabra clave opcionales *linejunk* y *charjunk* son para funciones de filtrado (o ``None``):

source: *linejunk*: A function that accepts a single string argument, and returns true if the string is junk. The default is ``None``, meaning that no line is considered junk.
es: *linejunk*: Una función que acepta una sola cadena de texto como argumento y retorna verdadero si la cadena de texto es un elemento no deseado. Su valor por defecto es ``None``, lo que significa que ninguna línea es considerada no deseada.

source: *charjunk*: A function that accepts a single character argument (a string of length 1), and returns true if the character is junk. The default is ``None``, meaning that no character is considered junk.
es: *charjunk*: Una función que acepta un solo carácter como argumento (una cadena de caracteres de longitud 1) y retorna verdadero si el carácter es un elemento no deseado. Su valor por defecto es ``None``, lo que significa que ningún carácter es considerado no deseado.

source: These junk-filtering functions speed up matching to find differences and do not cause any differing lines or characters to be ignored. Read the description of the :meth:`~SequenceMatcher.find_longest_match` method's *isjunk* parameter for an explanation.
es: Estas funciones de elementos no deseados aceleran la coincidencia para encontrar diferencies y no hacen que se ignoren líneas o caracteres diferentes. Lea la descripción del parámetro *isjunk* en el método :meth:`~SequenceMatcher.find_longest_match` para una explicación mas detallada.

source: :class:`Differ` objects are used (deltas generated) via a single method:
es: Los objetos :class:`Differ` son usados (una vez generados los deltas) mediante un solo método:

source: Compare two sequences of lines, and generate the delta (a sequence of lines).
es: Compara dos secuencias de líneas y genera el delta correspondiente (una secuencia de líneas).

source: Each sequence must contain individual single-line strings ending with newlines. Such sequences can be obtained from the :meth:`~io.IOBase.readlines` method of file-like objects. The delta generated also consists of newline-terminated strings, ready to be printed as-is via the :meth:`~io.IOBase.writelines` method of a file-like object.
es: Cada secuencia debe contener cadenas de texto individuales de una sola linea terminadas con una línea nueva. Este tipo de secuencias pueden ser obtenidas mediante el método :meth:`~io.IOBase.readlines` de objetos de tipo archivo. Los delta generados consisten también en cadenas de texto terminadas en nuevas lineas, listas para imprimirse tal cual a través del método :meth:`~io.IOBase.writelines` de un objeto de tipo archivo.

source: Differ Example
es: Ejemplo de *Differ*

source: Next we instantiate a Differ object:
es: Luego instanciamos el objeto *Differ*:

source: Note that when instantiating a :class:`Differ` object we may pass functions to filter out line and character "junk." See the :meth:`Differ` constructor for details.
es: Nótese que cuando instanciamos un objeto :class:`Differ` deberíamos pasar funciones para filtrar lineas y caracteres no deseados. Consulte el constructor de :meth:`Differ` para mas detalles.

source: Finally, we compare the two:
es: Finalmente, comparamos las dos:

source: ``result`` is a list of strings, so let's pretty-print it:
es: ``result`` es una lista de cadenas de caracteres, entonces vamos a mostrarlo de una forma elegante:

source: As a single multi-line string it looks like this:
es: Representado como una sola cadena de caracteres de múltiples líneas se ve así:

source: A command-line interface to difflib
es: Una interfaz de línea de comandos para :mod:`difflib`
