Repository: python/python-docs-es
Catalog: library/difflib.po
Languages: es

source: :mod:`difflib` --- Helpers for computing deltas
es: :mod:`difflib` --- Funciones auxiliares para calcular deltas

source: **Source code:** :source:`Lib/difflib.py`
es: **Código fuente:** :source:`Lib/difflib.py`

source: This module provides classes and functions for comparing sequences. It can be used for example, for comparing files, and can produce information about file differences in various formats, including HTML and context and unified diffs. For comparing directories and files, see also, the :mod:`filecmp` module.
es: Este módulo proporciona clases y funciones para comparar secuencias. Se puede utilizar, por ejemplo, para comparar archivos y puede producir información sobre diferencias de archivo en varios formatos, incluidos HTML y contexto y diferencias unificadas. Para comparar directorios y archivos, consulte también el módulo :mod:`filecmp`.

source: This is a flexible class for comparing pairs of sequences of any type, so long as the sequence elements are :term:`hashable`. The basic algorithm predates, and is a little fancier than, an algorithm published in the late 1980's by Ratcliff and Obershelp under the hyperbolic name "gestalt pattern matching." The idea is to find the longest contiguous matching subsequence that contains no "junk" elements; these "junk" elements are ones that are uninteresting in some sense, such as blank lines or whitespace. (Handling junk is an extension to the Ratcliff and Obershelp algorithm.) The same idea is then applied recursively to the pieces of the sequences to the left and to the right of the matching subsequence. This does not yield minimal edit sequences, but does tend to yield matches that "look right" to people.
es: Esta es una clase flexible para comparar pares de secuencias de cualquier tipo, siempre que los elementos de la secuencia sean :term:`hashable`. El algoritmo básico es anterior, y un poco mas agradable, que el publicado a fines de los 80' por Ratcliff y Obershelp, bajo el nombre hiperbólico de "*gestalt pattern matching*". La idea es encontrar la subsecuencia coincidente contigua mas larga que no contenga elementos "no deseados"; estos elementos "no deseados" son aquellos que no son de interés por algún motivo, como ser lineas en blanco o espacios. (El tratamiento de elementos no deseados es una extensión al algoritmo de Ratcliff y Obershelp). La misma idea se aplica recursivamente a las partes de la secuencia a la derecha e izquierda de cada subsecuencia correspondiente. Esto no proporciona secuencias de edición mínimas, pero tiende a producir coincidencias que "parecen correctas" a las personas.

source: **Timing:** The basic Ratcliff-Obershelp algorithm is cubic time in the worst case and quadratic time in the expected case. :class:`SequenceMatcher` is quadratic time for the worst case and has expected-case behavior dependent in a complicated way on how many elements the sequences have in common; best case time is linear.
es: **Complejidad temporal:** En el peor de los casos el algoritmo Ratcliff-Obershelp básico es de complejidad cúbica y de complejidad temporal cuadrática en el caso esperado. :class:`SequenceMatcher` es de complejidad temporal cuadrática en el peor de los casos y el comportamiento del caso esperado depende de manera complicada de cuántos elementos tienen en común las secuencias; en el mejor de los casos la complejidad temporal es lineal.

source: **Automatic junk heuristic:** :class:`SequenceMatcher` supports a heuristic that automatically treats certain sequence items as junk. The heuristic counts how many times each individual item appears in the sequence. If an item's duplicates (after the first one) account for more than 1% of the sequence and the sequence is at least 200 items long, this item is marked as "popular" and is treated as junk for the purpose of sequence matching. This heuristic can be turned off by setting the ``autojunk`` argument to ``False`` when creating the :class:`SequenceMatcher`.
es: **Heurística automática de elementos no deseados:** :class:`SequenceMatcher` implementa un método heurístico que identifica automáticamente a ciertos elementos como no deseados. El método heurístico consiste en contar cuantas veces aparece cada elemento en la secuencia. Si las apariciones del duplicado de un elemento (después del primero) contabilizan mas del 1% de la secuencia, y a su vez la secuencia contiene mas de 200 elementos, este es identificado como "popular" y es considerado no deseado. Este método heurístico puede desactivarse estableciendo el argumento ``autojunk`` como ``False`` al crear la clase :class:`SequenceMatcher`.

source: The *autojunk* parameter.
es: El parámetro *autojunk*.

source: This is a class for comparing sequences of lines of text, and producing human-readable differences or deltas. Differ uses :class:`SequenceMatcher` both to compare sequences of lines, and to compare sequences of characters within similar (near-matching) lines.
es: Esta clase se utiliza para comparar secuencias de lineas de texto y producir diferencias o deltas en una forma legible por humanos. Differ usa :class:`SequenceMatcher` tanto para comparar secuencias de lineas, como para comparar secuencias de caracteres entre lineas similares.

source: Each line of a :class:`Differ` delta begins with a two-letter code:
es: Cada linea de un delta de :class:`Differ` comienza con un código de dos letras:

source: Code
es: Código

source: Meaning
es: Significado

source: line unique to sequence 1
es: línea única para la secuencia 1

source: line unique to sequence 2
es: línea única para la secuencia 2

source: line common to both sequences
es: línea común a ambas secuencias

source: line not present in either input sequence
es: línea ausente en todas las secuencias de entrada

source: This class can be used to create an HTML table (or a complete HTML file containing the table) showing a side by side, line by line comparison of text with inter-line and intra-line change highlights. The table can be generated in either full or contextual difference mode.
es: Esta clase puede ser usada para crear una tabla HTML (o un archivo HTML completo que contenga la tabla) mostrando comparaciones lado a lado y linea por linea del texto, con cambios interlineales e intralineales. La tabla se puede generar en modo de diferencia completa o contextual.

source: The constructor for this class is:
es: El constructor de esta clase es:

source: Initializes instance of :class:`HtmlDiff`.
es: Inicializa una instancia de :class:`HtmlDiff`.

source: *tabsize* is an optional keyword argument to specify tab stop spacing and defaults to ``8``.
es: *tabsize* es un argumento por palabra clave opcional para especificar el espaciado de tabulación. Su valor predeterminado es ``8``.

source: *wrapcolumn* is an optional keyword to specify column number where lines are broken and wrapped, defaults to ``None`` where lines are not wrapped.
es: *wrapcolumn* es un argumento por palabra clave opcional para especificar el número de columnas donde las lineas serán divididas y ajustadas al ancho de columna, su valor por defecto es ``None``, donde las lineas no son ajustadas.

source: *linejunk* and *charjunk* are optional keyword arguments passed into :func:`ndiff` (used by :class:`HtmlDiff` to generate the side by side HTML differences). See :func:`ndiff` documentation for argument default values and descriptions.
es: *linejunk* y *charjunk* son argumentos por palabra clave opcionales que serán pasados a :func:`ndiff` (que es utilizado por :class:`HtmlDiff` para generar las diferencias lado a lado en HTML). Refiérase a la documentación de :func:`ndiff` para conocer los detalles y valores por defecto de sus argumentos.

source: The following methods are public:
es: Los siguientes métodos son públicos:

source: Compares *fromlines* and *tolines* (lists of strings) and returns a string which is a complete HTML file containing a table showing line by line differences with inter-line and intra-line changes highlighted.
es: Compara *fromlines* y *tolines* (listas de cadenas de texto) y retorna una cadena de caracteres que representa un archivo HTML completo que contiene una tabla mostrando diferencias línea por línea del texto con cambios interlineales e intralineales resaltados.

source: *fromdesc* and *todesc* are optional keyword arguments to specify from/to file column header strings (both default to an empty string).
es: *fromdesc* y *todesc* son argumentos por palabra clave opcionales para especificar los encabezados de las columnas desde *fromdesc* hasta *todesc* en el archivo (ambas cadenas están vacías por defecto).

source: *context* and *numlines* are both optional keyword arguments. Set *context* to ``True`` when contextual differences are to be shown, else the default is ``False`` to show the full files. *numlines* defaults to ``5``. When *context* is ``True`` *numlines* controls the number of context lines which surround the difference highlights. When *context* is ``False`` *numlines* controls the number of lines which are shown before a difference highlight when using the "next" hyperlinks (setting to zero would cause the "next" hyperlinks to place the next difference highlight at the top of the browser without any leading context).
es: *context* y *numlines* son parámetros opcionales. Establezca *context* como ``True`` para mostrar diferencias contextuales, de lo contrario su valor por defecto es ``False`` que muestra los archivos completos. El valor por defecto de *numlines* es ``5``. Cuando *context* es ``True``, *numlines* controla el número de lineas de contexto que rodean las diferencias resaltadas. Cuando *context* es ``False``, *numlines* controla el número de líneas que se muestran antes de una diferencia resaltada cuando se usan los hipervínculos "next" (un valor de cero produce que los hipervínculos "next" ubiquen el siguiente resaltado en la parte superior del navegador, sin ningún contexto principal).

source: *fromdesc* and *todesc* are interpreted as unescaped HTML and should be properly escaped while receiving input from untrusted sources.
es: *fromdesc* y *todesc* se interpretan como HTML no escapado y se deben escapar correctamente si los datos son recibidos de fuentes no confiables.

source: *charset* keyword-only argument was added. The default charset of HTML document changed from ``'ISO-8859-1'`` to ``'utf-8'``.
es: Se agregó el argumento sólo de palabra clave *charset*. La codificación de caracteres por defecto para documentos HTML se cambió de ``'ISO-8859-1'`` a ``'utf-8'``.

source: Compares *fromlines* and *tolines* (lists of strings) and returns a string which is a complete HTML table showing line by line differences with inter-line and intra-line changes highlighted.
es: Compara *fromlines* y *tolines* (listas de cadenas de texto) y retorna una cadena de caracteres que representa una tabla HTML mostrando comparaciones lado a lado y línea por línea del texto con cambios interlineales e intralineales.

source: The arguments for this method are the same as those for the :meth:`make_file` method.
es: Los argumentos para este método son los mismos que los del método :meth:`make_file`.

source: Compare *a* and *b* (lists of strings); return a delta (a :term:`generator` generating the delta lines) in context diff format.
es: Compara *a* y *b* (listas de cadenas de texto); retorna un delta (un :term:`generator` que genera las lineas delta) en formato de diferencias de contexto.

source: Context diffs are a compact way of showing just the lines that have changed plus a few lines of context. The changes are shown in a before/after style. The number of context lines is set by *n* which defaults to three.
es: El formato de diferencias de contexto es una forma compacta de mostrar solamente las líneas que fueron modificadas y algunas líneas adicionales de contexto. Los cambios son mostrados utilizando el estilo antes/después. El número de líneas de contexto es determinado por *n*, cuyo valor por defecto es ``3``.

source: By default, the diff control lines (those with ``***`` or ``---``) are created with a trailing newline. This is helpful so that inputs created from :func:`io.IOBase.readlines` result in diffs that are suitable for use with :func:`io.IOBase.writelines` since both the inputs and outputs have trailing newlines.
es: Por defecto, las líneas de control (aquellas que comienzan con ``***`` o ``---``) son creadas con una línea nueva. Esto es de ayuda para que las entradas creadas por :func:`io.IOBase.readlines` generen diferencias que puedan ser utilizadas con :func:`io.IOBase.writelines` ya que ambas, la entrada y la salida, tienen líneas nuevas al final.

source: For inputs that do not have trailing newlines, set the *lineterm* argument to ``""`` so that the output will be uniformly newline free.
es: Para entradas que no tienen nuevas líneas finales, establezca el argumento *lineterm* como ``""`` de forma que la salida sea uniforme y libre de nuevas líneas.

source: The context diff format normally has a header for filenames and modification times. Any or all of these may be specified using strings for *fromfile*, *tofile*, *fromfiledate*, and *tofiledate*. The modification times are normally expressed in the ISO 8601 format. If not specified, the strings default to blanks.
es: El formato de diferencias de contexto normalmente tiene un encabezado para nombres de archivos y tiempos de modificaciones. Alguno o todos estos debe ser especificado utilizando las cadenas de texto para *fromfile*, *tofile*, *fromfiledate* y *tofiledate*. Los tiempos de modificación son normalmente expresados en formato ISO 8601. Si no es especificado las cadenas por defecto son espacios en blanco.

source: See :ref:`difflib-interface` for a more detailed example.
es: Vea :ref:`difflib-interface` para un ejemplo mas detallado.

source: Return a list of the best "good enough" matches. *word* is a sequence for which close matches are desired (typically a string), and *possibilities* is a list of sequences against which to match *word* (typically a list of strings).
es: Retorna una lista de las mejores coincidencias "lo suficientemente buenas". *word* es una secuencia para la cual coincidencias cercanas son deseadas (usualmente una cadena de texto), y *possibilities* es una lista de secuencias contra la cual se compara *word* (comúnmente una lista de cadenas de caracteres).

source: Optional argument *n* (default ``3``) is the maximum number of close matches to return; *n* must be greater than ``0``.
es: Argumento opcional *n* (por defecto ``3``) es el máximo número de coincidencias cercanas a retornar; *n* debe ser mayor que ``0``.

source: Optional argument *cutoff* (default ``0.6``) is a float in the range [0, 1]. Possibilities that don't score at least that similar to *word* are ignored.
es: Argumento opcional *cutoff* (por defecto ``0.6``) es un flotante en el rango [0, 1]. Las posibilidades que no alcanzan un puntaje al menos similar al de *word* son ignoradas.

source: The best (no more than *n*) matches among the possibilities are returned in a list, sorted by similarity score, most similar first.
es: Las mejores (no mas de *n*) coincidencias entre las posibilidades son retornadas en una lista, ordenadas por similitud de puntaje, las mas similares primero.

source: Compare *a* and *b* (lists of strings); return a :class:`Differ`\ -style delta (a :term:`generator` generating the delta lines).
es: Compara *a* y *b* (listas de cadenas de texto); retorna un delta del estilo :class:`Differ` (un :term:`generator` que genera los deltas de las líneas).

source: Optional keyword parameters *linejunk* and *charjunk* are filtering functions (or ``None``):
es: Parámetros de palabra clave opcional *linejunk* y *charjunk* son funciones de filtrado (o ``None``):

source: *linejunk*: A function that accepts a single string argument, and returns true if the string is junk, or false if not. The default is ``None``. There is also a module-level function :func:`IS_LINE_JUNK`, which filters out lines without visible characters, except for at most one pound character (``'#'``) -- however the underlying :class:`SequenceMatcher` class does a dynamic analysis of which lines are so frequent as to constitute noise, and this usually works better than using this function.
es: *linejunk*: Una función que acepta una sola cadena de caracteres como argumento, y retorna verdadero si la cadena de texto es un elemento no deseado, o falso si no lo es. Su valor por defecto es ``None``. Hay también una función a nivel del módulo :func:`IS_LINE_JUNK`, que filtra líneas sin caracteres visibles, excepto como mucho un carácter de libra (``'#'``) -- de cualquier forma la clase subyacente :class:`SequenceMatcher` realiza un análisis dinámico sobre cuáles lineas son tan frecuentes como para constituir ruido, y esto usualmente funciona mejor que utilizando esta función.

source: *charjunk*: A function that accepts a character (a string of length 1), and returns if the character is junk, or false if not. The default is module-level function :func:`IS_CHARACTER_JUNK`, which filters out whitespace characters (a blank or tab; it's a bad idea to include newline in this!).
es: *charjunk*: Una función que acepta un carácter (una cadena de caracteres de longitud 1) como argumento, y retorna `True` si el carácter es un elemento no deseado, o `False` si no lo es. El valor por defecto es una función a nivel del módulo :func:`IS_CHARACTER_JUNK`, que filtra caracteres de espacios en blanco (un espacio en blanco o tabulación; es una mala idea incluir saltos de lineas en esto!)

source: Return one of the two sequences that generated a delta.
es: Retorna uno de las dos secuencias que generaron un delta.

source: Given a *sequence* produced by :meth:`Differ.compare` or :func:`ndiff`, extract lines originating from file 1 or 2 (parameter *which*), stripping off line prefixes.
es: Dada una *sequence* producida por :meth:`Differ.compare` o :func:`ndiff`, extrae las líneas originadas por el archivo 1 o 2 (parámetro *which*), quitando los prefijos de la línea.

source: Example:
es: Ejemplo:

source: Compare *a* and *b* (lists of strings); return a delta (a :term:`generator` generating the delta lines) in unified diff format.
es: Compara *a* y *b* (listas de cadenas de caracteres); retorna un delta (un :term:`generator` que genera los delta de líneas) en formato de diferencias unificado.

source: Unified diffs are a compact way of showing just the lines that have changed plus a few lines of context. The changes are shown in an inline style (instead of separate before/after blocks). The number of context lines is set by *n* which defaults to three.
es: Las diferencias unificadas son una forma compacta de mostrar sólo las líneas que presentan cambios y algunas líneas de contexto adicionales. Los cambios son mostrados en una sola línea (en lugar de bloques separados antes y después). El número de líneas de contexto se establece mediante *n*, cuyo valor por defecto es tres.

source: By default, the diff control lines (those with ``---``, ``+++``, or ``@@``) are created with a trailing newline. This is helpful so that inputs created from :func:`io.IOBase.readlines` result in diffs that are suitable for use with :func:`io.IOBase.writelines` since both the inputs and outputs have trailing newlines.
es: Por defecto, las líneas de control de diferencias (aquellas con ``---``, ``+++``, o ``@@``) son creadas con un salto de línea nuevo. Esto es de ayuda para que las entradas creadas por :func:`io.IOBase.readlines` generen diferencias que puedan ser utilizadas con :func:`io.IOBase.writelines` ya que ambas, la entrada y la salida, tienen líneas nuevas al final.

source: Compare *a* and *b* (lists of bytes objects) using *dfunc*; yield a sequence of delta lines (also bytes) in the format returned by *dfunc*. *dfunc* must be a callable, typically either :func:`unified_diff` or :func:`context_diff`.
es: Compara *a* y *b* (listas de objetos de bytes) usando *dfunc*; produce una secuencia de líneas delta (también bytes) en el formato retornado por *dfunc*. *dfunc* debe ser invocable, comúnmente cualquiera de :func:`unified_diff` o :func:`context_diff`.

source: Allows you to compare data with unknown or inconsistent encoding. All inputs except *n* must be bytes objects, not str. Works by losslessly converting all inputs (except *n*) to str, and calling ``dfunc(a, b, fromfile, tofile, fromfiledate, tofiledate, n, lineterm)``. The output of *dfunc* is then converted back to bytes, so the delta lines that you receive have the same unknown/inconsistent encodings as *a* and *b*.
es: Permite comparar datos con codificación desconocida o inconsistente. Todas las entradas, excepto *n*, deben ser objetos de bytes, no cadenas de texto. Funciona convirtiendo sin pérdidas todas las entradas (excepto *n*) a cadenas de texto, e invoca ``dfunc(a, b, fromfile, tofile, fromfiledate, tofiledate, n, lineterm)``. La salida de *dfunc* es entonces convertida nuevamente a bytes, de forma que las líneas delta que son recibidas tienen la misma codificación desconocida/inconsistente que *a* y *b*.

source: Return ``True`` for ignorable lines. The line *line* is ignorable if *line* is blank or contains a single ``'#'``, otherwise it is not ignorable. Used as a default for parameter *linejunk* in :func:`ndiff` in older versions.
es: Retorna ``True`` para líneas que deben ser ignoradas. La línea *line* es ignorada si *line* es un espacio vacío o contiene un solo ``'#'``, en cualquier otro caso no es ignorado. Es usado como valor por defecto para el parámetro *linejunk* por :func:`ndiff` en versiones anteriores.

source: Return ``True`` for ignorable characters. The character *ch* is ignorable if *ch* is a space or tab, otherwise it is not ignorable. Used as a default for parameter *charjunk* in :func:`ndiff`.
es: Retorna ``True`` para los caracteres que deben ser ignorados. El carácter *ch* es ignorado si *ch* es un espacio en blanco o tabulación, en cualquier otro caso no es ignorado. Es utilizado como valor por defecto para el parámetro *charjunk* en :func:`ndiff`.

source: SequenceMatcher Objects
es: Objetos *SequenceMatcher*

source: The :class:`SequenceMatcher` class has this constructor:
es: La clase :class:`SequenceMatcher` tiene este constructor:

source: Optional argument *isjunk* must be ``None`` (the default) or a one-argument function that takes a sequence element and returns true if and only if the element is "junk" and should be ignored. Passing ``None`` for *isjunk* is equivalent to passing ``lambda x: False``; in other words, no elements are ignored. For example, pass::
es: El argumento opcional *isjunk* debe ser ``None`` (que es su valor por defecto) o una función de un solo argumento que reciba un elemento de la secuencia y retorne verdadero si y solo si el elemento es no deseado y deba ser ignorado. Pasar el argumento *isjunk* como ``None`` es equivalente a pasar ``lambda x: False``; en otras palabras, ningún elemento es ignorado. Por ejemplo, pasar:

source: if you're comparing lines as sequences of characters, and don't want to synch up on blanks or hard tabs.
es: si se están comparando líneas como secuencias de caracteres, y no se quiere sincronizar en espacios blancos o tabulaciones.

source: The optional arguments *a* and *b* are sequences to be compared; both default to empty strings. The elements of both sequences must be :term:`hashable`.
es: Los argumentos opcionales *a* y *b* son las secuencias a comparar; ambos tienen como valor por defecto una cadena de texto vacía. Los elementos de ambas secuencias deben ser :term:`hashable`.

source: The optional argument *autojunk* can be used to disable the automatic junk heuristic.
es: El argumento opcional *autojunk* puede ser usado para deshabilitar la heurística automática de elementos no deseados.
