Repository: python/python-docs-es
Catalog: library/dis.po
Languages: es

source: Implements ``TOS.name = TOS1``, where *namei* is the index of name in :attr:`co_names`.
es: Implementa ``TOS.name = TOS1``, donde *namei* es el índice del nombre en :attr:`co_names`.

source: Implements ``del TOS.name``, using *namei* as index into :attr:`co_names`.
es: Implementa ``del TOS.name``, usando *namei* como índice en :attr:`co_names`.

source: Works as :opcode:`STORE_NAME`, but stores the name as a global.
es: Funciona como :opcode:`STORE_NAME`, pero almacena el nombre como global.

source: Works as :opcode:`DELETE_NAME`, but deletes a global name.
es: Funciona como :opcode:`DELETE_NAME`, pero elimina un nombre global.

source: Pushes ``co_consts[consti]`` onto the stack.
es: Apila ``co_consts[consti]`` en la pila.

source: Pushes the value associated with ``co_names[namei]`` onto the stack.
es: Apila el valor asociado con ``co_names [namei]`` en la pila.

source: Creates a tuple consuming *count* items from the stack, and pushes the resulting tuple onto the stack.
es: Crea una tupla que consume elementos *count* de la pila, y apila la tupla resultante a la pila.

source: Works as :opcode:`BUILD_TUPLE`, but creates a list.
es: Funciona como :opcode:`BUILD_TUPLE`, pero crea una lista.

source: Works as :opcode:`BUILD_TUPLE`, but creates a set.
es: Funciona como :opcode:`BUILD_TUPLE`, pero crea un conjunto.

source: Pushes a new dictionary object onto the stack. Pops ``2 * count`` items so that the dictionary holds *count* entries: ``{..., TOS3: TOS2, TOS1: TOS}``.
es: Apila un nuevo objeto de diccionario en la pila. Desapila ``2 * count`` elementos para que el diccionario contenga *count* entradas: ``{..., TOS3: TOS2, TOS1: TOS}``.

source: The dictionary is created from stack items instead of creating an empty dictionary pre-sized to hold *count* items.
es: El diccionario se crea a partir de elementos de la pila en lugar de crear un diccionario vacío dimensionado previamente para contener *count* elementos.

source: The version of :opcode:`BUILD_MAP` specialized for constant keys. Pops the top element on the stack which contains a tuple of keys, then starting from ``TOS1``, pops *count* values to form values in the built dictionary.
es: La versión de :opcode:`BUILD_MAP` especializada para claves constantes. Desapila el elemento superior en la pila que contiene una tupla de claves, luego, a partir de ``TOS1``, muestra los valores *count* para formar valores en el diccionario incorporado.

source: Concatenates *count* strings from the stack and pushes the resulting string onto the stack.
es: Concatena *count* cadenas de caracteres de la pila y empuja la cadena de caracteres resultante en la pila.

source: Pops a list from the stack and pushes a tuple containing the same values.
es: Saca una lista de la pila y empuja una tupla que contiene los mismos valores.

source: Calls ``list.extend(TOS1[-i], TOS)``. Used to build lists.
es: Llama a ``list.extend(TOS1[-i], TOS)``. Se utiliza para crear listas.

source: Calls ``set.update(TOS1[-i], TOS)``. Used to build sets.
es: Llama a ``set.update(TOS1[-i], TOS)``. Se usa para construir decorados.

source: Calls ``dict.update(TOS1[-i], TOS)``. Used to build dicts.
es: Llama a ``dict.update(TOS1[-i], TOS)``. Se usa para construir dictados.

source: Like :opcode:`DICT_UPDATE` but raises an exception for duplicate keys.
es: Como :opcode:`DICT_UPDATE` pero lanza una excepción para claves duplicadas.

source: Replaces TOS with ``getattr(TOS, co_names[namei])``.
es: Reemplaza TOS con ``getattr(TOS, co_names[namei])``.

source: Performs a Boolean operation. The operation name can be found in ``cmp_op[opname]``.
es: Realiza una operación booleana. El nombre de la operación se puede encontrar en ``cmp_op[opname]``.

source: Performs ``is`` comparison, or ``is not`` if ``invert`` is 1.
es: Realiza una comparación ``is`` o ``is not`` si ``invert`` es 1.

source: Performs ``in`` comparison, or ``not in`` if ``invert`` is 1.
es: Realiza una comparación ``in`` o ``not in`` si ``invert`` es 1.

source: Imports the module ``co_names[namei]``. TOS and TOS1 are popped and provide the *fromlist* and *level* arguments of :func:`__import__`. The module object is pushed onto the stack. The current namespace is not affected: for a proper import statement, a subsequent :opcode:`STORE_FAST` instruction modifies the namespace.
es: Importa el módulo ``co_names[namei]``. TOS y TOS1 aparecen y proporcionan los argumentos *fromlist* y *level* de :func:`__import__`. El objeto del módulo se empuja a la pila. El espacio de nombres actual no se ve afectado: para una instrucción de importación adecuada, una instrucción posterior :opcode:`STORE_FAST` modifica el espacio de nombres.

source: Loads the attribute ``co_names[namei]`` from the module found in TOS. The resulting object is pushed onto the stack, to be subsequently stored by a :opcode:`STORE_FAST` instruction.
es: Carga el atributo ``co_names[namei]`` del módulo que se encuentra en TOS. El objeto resultante se apila en la pila, para luego ser almacenado por la instrucción :opcode:`STORE_FAST`.

source: Increments bytecode counter by *delta*.
es: Incrementa el contador de bytecode en *delta*.

source: TOS is an :term:`iterator`. Call its :meth:`~iterator.__next__` method. If this yields a new value, push it on the stack (leaving the iterator below it). If the iterator indicates it is exhausted, TOS is popped, and the byte code counter is incremented by *delta*.
es: TOS es un :term:`iterador`. Llama a su método :meth:`~iterator.__next__`. Si esto produce un nuevo valor, lo apila en la pila (dejando el iterador debajo de él). Si el iterador indica que está agotado, se abre TOS y el contador de código de bytes se incrementa en *delta*.

source: Pushes a reference to the local ``co_varnames[var_num]`` onto the stack.
es: Apila una referencia al local ``co_varnames[var_num]`` sobre la pila.

source: Stores TOS into the local ``co_varnames[var_num]``.
es: Almacena TOS en el local ``co_varnames[var_num]``.

source: Deletes local ``co_varnames[var_num]``.
es: Elimina la ``co_varnames[var_num]`` local.

source: Much like :opcode:`LOAD_DEREF` but first checks the locals dictionary before consulting the cell. This is used for loading free variables in class bodies.
es: Al igual que :opcode:`LOAD_DEREF` pero primero verifica el diccionario local antes de consultar la celda. Esto se usa para cargar variables libres en los cuerpos de clase.

source: Raises an exception using one of the 3 forms of the ``raise`` statement, depending on the value of *argc*:
es: Provoca una excepción utilizando una de las 3 formas de la declaración ``raise``, dependiendo del valor de *argc*:

source: 0: ``raise`` (re-raise previous exception)
es: 0: ``raise`` (vuelve a lanzar la excepción anterior)

source: 1: ``raise TOS`` (raise exception instance or type at ``TOS``)
es: 1: ``raise TOS`` (lanza instancia de excepción o un tipo en ``TOS``)

source: 2: ``raise TOS1 from TOS`` (raise exception instance or type at ``TOS1`` with ``__cause__`` set to ``TOS``)
es: 2: ``raise TOS1 desde TOS`` (lanza una instancia de excepción o tipo en ``TOS1`` con ``__cause__`` establecida en ``TOS``)

source: Calls a callable object with variable set of positional and keyword arguments. If the lowest bit of *flags* is set, the top of the stack contains a mapping object containing additional keyword arguments. Before the callable is called, the mapping object and iterable object are each "unpacked" and their contents passed in as keyword and positional arguments respectively. ``CALL_FUNCTION_EX`` pops all arguments and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
es: Llama a un objeto invocable con un conjunto variable de argumentos posicionales y de palabras clave. Si se establece el bit más bajo de *flags*, la parte superior de la pila contiene un objeto de mapeo que contiene argumentos de palabras clave adicionales. Antes de que se llame al invocable, el objeto de mapeo y el objeto iterable se "desempaquetan" y su contenido se pasa como palabra clave y argumentos posicionales, respectivamente. ``CALL_FUNCTION_EX`` saca todos los argumentos y el objeto invocable de la pila, llama al objeto invocable con esos argumentos y empuja el valor de retorno devuelto por el objeto invocable.

source: Pushes a new function object on the stack. From bottom to top, the consumed stack must consist of values if the argument carries a specified flag value
es: Apila un nuevo objeto de función en la pila. De abajo hacia arriba, la pila consumida debe constar de valores si el argumento lleva un valor de marca especificado

source: ``0x01`` a tuple of default values for positional-only and positional-or-keyword parameters in positional order
es: ``0x01``, una tupla de valores predeterminados para solo parámetros posicionales y posicionales o de palabras clave en orden posicional

source: ``0x02`` a dictionary of keyword-only parameters' default values
es: ``0x02`` un diccionario de valores predeterminados de solo palabras clave

source: ``0x04`` a tuple of strings containing parameters' annotations
es: ``0x04`` una tupla de cadenas de caracteres que contiene anotaciones de parámetros

source: ``0x08`` a tuple containing cells for free variables, making a closure
es: ``0x08`` una tupla que contiene celdas para variables libres, haciendo un cierre (*closure*)

source: the code associated with the function (at TOS1)
es: el código asociado con la función (en TOS1)

source: the :term:`qualified name` of the function (at TOS)
es: el :term:`nombre calificado` de la función (en TOS)

source: Flag value ``0x04`` is a tuple of strings instead of dictionary
es: El valor indicador ``0x04`` es una tupla de cadena de caracteres en vez de un diccionario

source: Pushes a slice object on the stack. *argc* must be 2 or 3. If it is 2, ``slice(TOS1, TOS)`` is pushed; if it is 3, ``slice(TOS2, TOS1, TOS)`` is pushed. See the :func:`slice` built-in function for more information.
es: Apila un objeto de rebanada en la pila. *argc* debe ser 2 o 3. Si es 2, se apila ``slice(TOS1, TOS)``; si es 3, se apila ``slice(TOS2, TOS1, TOS)``. Consulte la función incorporada :func:`slice` para obtener más información.

source: Prefixes any opcode which has an argument too big to fit into the default one byte. *ext* holds an additional byte which act as higher bits in the argument. For each opcode, at most three prefixal ``EXTENDED_ARG`` are allowed, forming an argument from two-byte to four-byte.
es: Prefija cualquier código de operación que tenga un argumento demasiado grande para caber en el byte predeterminado. *ext* contiene un byte adicional que actúa como bits más altos en el argumento. Para cada opcode, como máximo se permiten tres prefijos ``EXTENDED_ARG``, formando un argumento de dos bytes a cuatro bytes.

source: Used for implementing formatted literal strings (f-strings). Pops an optional *fmt_spec* from the stack, then a required *value*. *flags* is interpreted as follows:
es: Se utiliza para implementar cadenas literales formateadas (cadenas de caracteres f). Desapila un *fmt_spec* opcional de la pila, luego un *value* requerido. *flags* se interpreta de la siguiente manera:

source: ``(flags & 0x03) == 0x00``: *value* is formatted as-is.
es: ``(flags & 0x03) == 0x00``: *value* es formateado como está.

source: ``(flags & 0x03) == 0x01``: call :func:`str` on *value* before formatting it.
es: ``(flags & 0x03) == 0x01``: llama :func:`str` sobre *value* antes de formatearlo.

source: ``(flags & 0x03) == 0x02``: call :func:`repr` on *value* before formatting it.
es: ``(flags & 0x03) == 0x02``: llama :func:`repr` sobre *value* antes de formatearlo.

source: ``(flags & 0x03) == 0x03``: call :func:`ascii` on *value* before formatting it.
es: ``(flags & 0x03) == 0x03``: llama :func:`ascii` sobre *value* antes de formatearlo.

source: ``(flags & 0x04) == 0x04``: pop *fmt_spec* from the stack and use it, else use an empty *fmt_spec*.
es: ``(flags & 0x04) == 0x04``: desapila *fmt_spec* de la pila y lo usa, de lo contrario usa un *fmt_spec* vacío.

source: Formatting is performed using :c:func:`PyObject_Format`. The result is pushed on the stack.
es: El formateo se realiza usando :c:func:`PyObject_Format`. El resultado se apila en la pila.

source: TOS is a tuple of keyword attribute names, TOS1 is the class being matched against, and TOS2 is the match subject. *count* is the number of positional sub-patterns.
es: TOS es una tupla de nombres de atributos clave, TOS1 es la clase contra la cual se hace la coincidencia, y TOS2 es el sujeto de la coincidencia. *count* es el número de sub-patrones posicionales.

source: This is not really an opcode. It identifies the dividing line between opcodes which don't use their argument and those that do (``< HAVE_ARGUMENT`` and ``>= HAVE_ARGUMENT``, respectively).
es: Esto no es realmente un opcode. Identifica la línea divisoria entre los opcode que no usan su argumento y los que lo hacen (``< HAVE_ARGUMENT`` y ``>= HAVE_ARGUMENT``, respectivamente).

source: Now every instruction has an argument, but opcodes ``< HAVE_ARGUMENT`` ignore it. Before, only opcodes ``>= HAVE_ARGUMENT`` had an argument.
es: Ahora cada instrucción tiene un argumento, pero los códigos de operación ``<HAVE_ARGUMENT`` la ignoran. Antes, solo los códigos de operación ``> = HAVE_ARGUMENT`` tenían un argumento.

source: Opcode collections
es: Colecciones opcode

source: These collections are provided for automatic introspection of bytecode instructions:
es: Estas colecciones se proporcionan para la introspección automática de instrucciones de bytecode:

source: Sequence of operation names, indexable using the bytecode.
es: Secuencia de nombres de operaciones, indexable utilizando el bytecode.

source: Dictionary mapping operation names to bytecodes.
es: Nombres de operaciones de mapeo de diccionario a bytecodes.

source: Sequence of all compare operation names.
es: Secuencia de todos los nombres de operaciones de comparación.

source: Sequence of bytecodes that access a constant.
es: Secuencia de bytecodes que acceden a una constante.

source: Sequence of bytecodes that access a free variable (note that 'free' in this context refers to names in the current scope that are referenced by inner scopes or names in outer scopes that are referenced from this scope. It does *not* include references to global or builtin scopes).
es: Secuencia de bytecodes que acceden a una variable libre (tenga en cuenta que 'libre' en este contexto se refiere a nombres en el alcance actual a los que hacen referencia los ámbitos internos o los nombres en los ámbitos externos a los que se hace referencia desde este ámbito. **No** incluye referencias a ámbitos globales o integrados).

source: Sequence of bytecodes that access an attribute by name.
es: Secuencia de bytecodes que acceden a un atributo por nombre.

source: Sequence of bytecodes that have a relative jump target.
es: Secuencia de bytecodes que tienen un objetivo de salto relativo.

source: Sequence of bytecodes that have an absolute jump target.
es: Secuencia de bytecodes que tienen un objetivo de salto absoluto.

source: Sequence of bytecodes that access a local variable.
es: Secuencia de códigos de bytes que acceden a una variable local.

source: Sequence of bytecodes of Boolean operations.
es: Secuencia de bytecodes de operaciones booleanas.
