Repository: python/python-docs-es
Catalog: library/dis.po
Languages: es

source: :mod:`dis` --- Disassembler for Python bytecode
es: :mod:`dis` --- Desensamblador para bytecode de Python

source: **Source code:** :source:`Lib/dis.py`
es: **Código fuente:** :source:`Lib/dis.py`

source: The :mod:`dis` module supports the analysis of CPython :term:`bytecode` by disassembling it. The CPython bytecode which this module takes as an input is defined in the file :file:`Include/opcode.h` and used by the compiler and the interpreter.
es: El módulo :mod:`dis` admite el análisis de CPython :term:`bytecode` al desarmarlo. El bytecode de CPython que este módulo toma como entrada se define en el archivo :file:`Include/opcode.h` y lo utilizan el compilador y el intérprete.

source: Bytecode is an implementation detail of the CPython interpreter. No guarantees are made that bytecode will not be added, removed, or changed between versions of Python. Use of this module should not be considered to work across Python VMs or Python releases.
es: Bytecode es un detalle de implementación del intérprete CPython. No se garantiza que el bytecode no se agregará, eliminará ni cambiará entre las versiones de Python. El uso de este módulo no debe considerarse para trabajar en diferentes máquinas virtuales Python o versiones de Python.

source: Use 2 bytes for each instruction. Previously the number of bytes varied by instruction.
es: Use 2 bytes para cada instrucción. Anteriormente, el número de bytes variaba según la instrucción.

source: Example: Given the function :func:`myfunc`::
es: Ejemplo: dada la función :func:`myfunc`::

source: (The "2" is a line number).
es: (El "2" es un número de línea).

source: Bytecode analysis
es: Análisis de bytecode

source: The bytecode analysis API allows pieces of Python code to be wrapped in a :class:`Bytecode` object that provides easy access to details of the compiled code.
es: La API de análisis de bytecode permite que partes del código Python se envuelvan en un objeto :class:`Bytecode` que proporciona un fácil acceso a los detalles del código compilado.

source: Analyse the bytecode corresponding to a function, generator, asynchronous generator, coroutine, method, string of source code, or a code object (as returned by :func:`compile`).
es: Analiza el bytecode correspondiente a una función, generador, generador asíncrono, corutina, método, cadena de código fuente o un objeto de código (como lo retorna :func:`compile`).

source: This is a convenience wrapper around many of the functions listed below, most notably :func:`get_instructions`, as iterating over a :class:`Bytecode` instance yields the bytecode operations as :class:`Instruction` instances.
es: Este es un contenedor conveniente para muchas de las funciones enumeradas a continuación, en particular :func:`get_instructions`, ya que iterar sobre una instancia de :class:`Bytecode` produce las operaciones de bytecode como instancias de :class:`Instruction`.

source: If *first_line* is not ``None``, it indicates the line number that should be reported for the first source line in the disassembled code. Otherwise, the source line information (if any) is taken directly from the disassembled code object.
es: Si *first_line* no es ``None``, indica el número de línea que se debe informar para la primera línea de origen en el código desmontado. De lo contrario, la información de la línea de origen (si la hay) se toma directamente del objeto de código desmontado.

source: If *current_offset* is not ``None``, it refers to an instruction offset in the disassembled code. Setting this means :meth:`.dis` will display a "current instruction" marker against the specified opcode.
es: Si *current_offset* no es ``None``, se refiere a un desplazamiento de instrucción en el código desmontado. Establecer esto significa :meth:`.dis` mostrará un marcador de "instrucción actual" contra el código de operación especificado.

source: Construct a :class:`Bytecode` instance from the given traceback, setting *current_offset* to the instruction responsible for the exception.
es: Construye una instancia de :class:`Bytecode` a partir del *traceback* dado, estableciendo *current_offset* en la instrucción responsable de la excepción.

source: The compiled code object.
es: El objeto de código compilado.

source: The first source line of the code object (if available)
es: La primera línea de origen del objeto de código (si está disponible)

source: Return a formatted view of the bytecode operations (the same as printed by :func:`dis.dis`, but returned as a multi-line string).
es: Retorna una vista formateada de las operaciones de bytecode (lo mismo que impreso por :func:`dis.dis`, pero retornado como una cadena de caracteres multilínea).

source: Return a formatted multi-line string with detailed information about the code object, like :func:`code_info`.
es: Retorna una cadena de caracteres multilínea formateada con información detallada sobre el objeto de código, como :func:`code_info`.

source: This can now handle coroutine and asynchronous generator objects.
es: Esto ahora puede manejar objetos generadores asíncronos y de corutinas.

source: Analysis functions
es: Funciones de análisis

source: The :mod:`dis` module also defines the following analysis functions that convert the input directly to the desired output. They can be useful if only a single operation is being performed, so the intermediate analysis object isn't useful:
es: El módulo :mod:`dis` también define las siguientes funciones de análisis que convierten la entrada directamente en la salida deseada. Pueden ser útiles si solo se realiza una sola operación, por lo que el objeto de análisis intermedio no es útil:

source: Return a formatted multi-line string with detailed code object information for the supplied function, generator, asynchronous generator, coroutine, method, source code string or code object.
es: Retorna una cadena de caracteres multilínea formateada con información detallada del objeto de código para la función, generador, generador asíncrono, corutina, método, cadena de código fuente u objeto de código suministrados.

source: Note that the exact contents of code info strings are highly implementation dependent and they may change arbitrarily across Python VMs or Python releases.
es: Tenga en cuenta que el contenido exacto de las cadenas de información de código depende en gran medida de la implementación y puede cambiar arbitrariamente en las diferentes máquinas virtuales Python o las versiones de Python.

source: Print detailed code object information for the supplied function, method, source code string or code object to *file* (or ``sys.stdout`` if *file* is not specified).
es: Imprime información detallada del objeto de código para la función, método, cadena de código fuente u objeto de código suministrado en *file* (o ``sys.stdout`` si *file* no está especificado).

source: This is a convenient shorthand for ``print(code_info(x), file=file)``, intended for interactive exploration at the interpreter prompt.
es: Esta es una abreviatura conveniente para ``print(code_info(x), file=file)``, destinado a la exploración interactiva en el indicador del intérprete (*prompt*).

source: Added *file* parameter.
es: Agrega un parámetro *file*.

source: Disassemble the *x* object. *x* can denote either a module, a class, a method, a function, a generator, an asynchronous generator, a coroutine, a code object, a string of source code or a byte sequence of raw bytecode. For a module, it disassembles all functions. For a class, it disassembles all methods (including class and static methods). For a code object or sequence of raw bytecode, it prints one line per bytecode instruction. It also recursively disassembles nested code objects (the code of comprehensions, generator expressions and nested functions, and the code used for building nested classes). Strings are first compiled to code objects with the :func:`compile` built-in function before being disassembled. If no object is provided, this function disassembles the last traceback.
es: Desmontar el objeto *x*. *x* puede denotar un módulo, una clase, un método, una función, un generador, un generador asíncrono, una corutina, un objeto de código, una cadena de código fuente o una secuencia de bytes de código de bytes sin procesar. Para un módulo, desmonta todas las funciones. Para una clase, desmonta todos los métodos (incluidos los métodos de clase y estáticos). Para un objeto de código o secuencia de bytecode sin procesar, imprime una línea por instrucción de bytecode. También desmonta recursivamente objetos de código anidados (el código de comprensiones, expresiones generadoras y funciones anidadas, y el código utilizado para construir clases anidadas). Las cadenas de caracteres se compilan primero en objetos de código con la función incorporada :func:`compile` antes de desmontarse. Si no se proporciona ningún objeto, esta función desmonta el último rastreo.

source: The disassembly is written as text to the supplied *file* argument if provided and to ``sys.stdout`` otherwise.
es: El desensamblaje se escribe como texto en el argumento *file* proporcionado si se proporciona y, de lo contrario, ``sys.stdout``.

source: The maximal depth of recursion is limited by *depth* unless it is ``None``. ``depth=0`` means no recursion.
es: La profundidad máxima de recursión está limitada por *depth* a menos que sea ``None``. ``depth=0`` significa que no hay recursión.

source: Implemented recursive disassembling and added *depth* parameter.
es: Desensamblaje recursivo implementado y parámetro agregado *depth*.

source: Disassemble the top-of-stack function of a traceback, using the last traceback if none was passed. The instruction causing the exception is indicated.
es: Desmonta la función de inicio de pila de un rastreo, utilizando el último rastreo si no se pasó ninguno. Se indica la instrucción que causa la excepción.

source: Disassemble a code object, indicating the last instruction if *lasti* was provided. The output is divided in the following columns:
es: Desmonta un objeto de código, que indica la última instrucción si se proporcionó *lasti*. La salida se divide en las siguientes columnas:

source: the line number, for the first instruction of each line
es: el número de línea, para la primera instrucción de cada línea

source: the current instruction, indicated as ``-->``,
es: la instrucción actual, indicada como ``-->``,

source: a labelled instruction, indicated with ``>>``,
es: una instrucción etiquetada, indicada con ``>>``,

source: the address of the instruction,
es: la dirección de la instrucción,

source: the operation code name,
es: el nombre del código de operación,

source: operation parameters, and
es: parámetros de operación, y

source: interpretation of the parameters in parentheses.
es: interpretación de los parámetros entre paréntesis.

source: The parameter interpretation recognizes local and global variable names, constant values, branch targets, and compare operators.
es: La interpretación de parámetros reconoce nombres de variables locales y globales, valores constantes, objetivos de ramificación y operadores de comparación.

source: Return an iterator over the instructions in the supplied function, method, source code string or code object.
es: Retorna un iterador sobre las instrucciones en la función, método, cadena de código fuente u objeto de código suministrado.

source: The iterator generates a series of :class:`Instruction` named tuples giving the details of each operation in the supplied code.
es: El iterador genera una serie de tuplas con nombre :class:`Instruction` que dan los detalles de cada operación en el código suministrado.

source: Line numbers can be decreasing. Before, they were always increasing.
es: Los números de línea pueden estar disminuyendo. Antes, siempre estaban aumentando.

source: Detect all offsets in the raw compiled bytecode string *code* which are jump targets, and return a list of these offsets.
es: Detecta todos los desplazamientos en la cadena de caracteres de código de byte compilada *code* que son objetivos de salto y retorna una lista de estos desplazamientos.

source: Compute the stack effect of *opcode* with argument *oparg*.
es: Calcula el efecto de pila de *opcode* con el argumento *oparg*.

source: If the code has a jump target and *jump* is ``True``, :func:`~stack_effect` will return the stack effect of jumping. If *jump* is ``False``, it will return the stack effect of not jumping. And if *jump* is ``None`` (default), it will return the maximal stack effect of both cases.
es: Si el código tiene un objetivo de salto y *jump* es ``True``, :func:`~stack_effect` retornará el efecto de pila del salto. Si *jump* es ``False``, retornará el efecto de acumulación de no saltar. Y si *jump* es ``None`` (predeterminado), retornará el efecto de acumulación máxima de ambos casos.

source: Added *jump* parameter.
es: Agrega un parámetro *jump*.

source: Python Bytecode Instructions
es: Instrucciones bytecode de Python

source: The :func:`get_instructions` function and :class:`Bytecode` class provide details of bytecode instructions as :class:`Instruction` instances:
es: La función :func:`get_instructions` y clase :class:`Bytecode` proporcionan detalles de las instrucciones bytecode como instancias :class:`Instruction`:

source: Details for a bytecode operation
es: Detalles para una operación de bytecode

source: numeric code for operation, corresponding to the opcode values listed below and the bytecode values in the :ref:`opcode_collections`.
es: código numérico para la operación, correspondiente a los valores del opcode listados a continuación y los valores de bytecode en :ref:`opcode_collections`.

source: human readable name for operation
es: nombre legible por humanos para la operación

source: numeric argument to operation (if any), otherwise ``None``
es: argumento numérico para la operación (si existe), de lo contrario ``None``

source: start index of operation within bytecode sequence
es: índice de inicio de operación dentro de la secuencia de bytecode

source: line started by this opcode (if any), otherwise ``None``
es: línea iniciada por este código de operación (si existe), de lo contrario ``None``

source: ``True`` if other code jumps to here, otherwise ``False``
es: ``True`` si otro código salta aquí, de lo contrario, ``False``

source: The Python compiler currently generates the following bytecode instructions.
es: El compilador de Python actualmente genera las siguientes instrucciones de bytecode.

source: **General instructions**
es: **Instrucciones generales**

source: Removes the top-of-stack (TOS) item.
es: Elimina el elemento de la parte superior de la pila (TOS).

source: **Unary operations**
es: **Operaciones unarias**

source: Unary operations take the top of the stack, apply the operation, and push the result back on the stack.
es: Las operaciones unarias toman la parte superior de la pila, aplican la operación y retornan el resultado a la pila.

source: Implements ``TOS = +TOS``.
es: Implementa ``TOS = +TOS``.

source: Implements ``TOS = -TOS``.
es: Implementa ``TOS = -TOS``.

source: Implements ``TOS = not TOS``.
es: Implementa ``TOS = not TOS``.

source: Implements ``TOS = ~TOS``.
es: Implementa ``TOS = ~TOS``.

source: Implements ``TOS = iter(TOS)``.
es: Implementa ``TOS = iter(TOS)``.

source: If ``TOS`` is a :term:`generator iterator` or :term:`coroutine` object it is left as is. Otherwise, implements ``TOS = iter(TOS)``.
es: Si ``TOS`` es un :term:`iterador generador <generator iterator>` o un objeto :term:`corutina <coroutine>` se deja como está. De lo contrario, implementa ``TOS = iter(TOS)``.

source: Binary operations remove the top of the stack (TOS) and the second top-most stack item (TOS1) from the stack. They perform the operation, and put the result back on the stack.
es: Las operaciones binarias eliminan el elemento superior de la pila (TOS) y el segundo elemento de la pila superior (TOS1) de la pila. Realizan la operación y retornan el resultado a la pila.

source: In-place operations are like binary operations, in that they remove TOS and TOS1, and push the result back on the stack, but the operation is done in-place when TOS1 supports it, and the resulting TOS may be (but does not have to be) the original TOS1.
es: Las operaciones en el lugar son como operaciones binarias, ya que eliminan TOS y TOS1, y retornan el resultado a la pila, pero la operación se realiza en el lugar cuando TOS1 lo admite, y el TOS resultante puede ser (pero no tiene ser) el TOS1 original.

source: Implements ``TOS = TOS1[TOS]``.
es: Implementa ``TOS = TOS1[TOS]``.

source: Implements ``TOS1[TOS] = TOS2``.
es: Implementa ``TOS1[TOS] = TOS2``.

source: Implements ``del TOS1[TOS]``.
es: Implementa ``del TOS1[TOS]``.

source: **Coroutine opcodes**
es: **Opcodes de corutinas**

source: Implements ``TOS = get_awaitable(TOS)``, where ``get_awaitable(o)`` returns ``o`` if ``o`` is a coroutine object or a generator object with the CO_ITERABLE_COROUTINE flag, or resolves ``o.__await__``.
es: Implementa ``TOS = get_awaitable(TOS)``, donde ``get_awaitable(o)`` retorna ``o`` si ``o`` es un objeto de corutina o un objeto generador con el indicador CO_ITERABLE_COROUTINE, o resuelve ``o.__await__``.

source: Implements ``TOS = TOS.__aiter__()``.
es: Implementa ``TOS = TOS.__aiter__()``.

source: Returning awaitable objects from ``__aiter__`` is no longer supported.
es: Ya no se admite el retorno de objetos *awaitable* de ``__aiter__``.

source: Resolves ``__aenter__`` and ``__aexit__`` from the object on top of the stack. Pushes ``__aexit__`` and result of ``__aenter__()`` to the stack.
es: Resuelve ``__aenter__`` y ``__aexit__`` del objeto en la parte superior de la pila. Apila ``__aexit__`` y el resultado de ``__aenter__()`` a la pila.

source: **Miscellaneous opcodes**
es: **Opcodes misceláneos**

source: Implements the expression statement for the interactive mode. TOS is removed from the stack and printed. In non-interactive mode, an expression statement is terminated with :opcode:`POP_TOP`.
es: Implementa la declaración de expresión para el modo interactivo. TOS se elimina de la pila y se imprime. En modo no interactivo, una declaración de expresión termina con :opcode:`POP_TOP`.

source: Calls ``set.add(TOS1[-i], TOS)``. Used to implement set comprehensions.
es: Llama a ``set.add(TOS1[-i], TOS)``. Se utiliza para implementar comprensiones de conjuntos.

source: Calls ``list.append(TOS1[-i], TOS)``. Used to implement list comprehensions.
es: Llama a ``list.append(TOS1[-i], TOS)``. Se utiliza para implementar listas por comprensión.

source: Calls ``dict.__setitem__(TOS1[-i], TOS1, TOS)``. Used to implement dict comprehensions.
es: Llama a ``dict.__setitem__(TOS1[-i], TOS1, TOS)``. Se utiliza para implementar comprensiones de diccionarios.

source: Map value is TOS and map key is TOS1. Before, those were reversed.
es: El valor del mapa es TOS y la clave del mapa es TOS1. Antes, esos fueron revertidos.

source: For all of the :opcode:`SET_ADD`, :opcode:`LIST_APPEND` and :opcode:`MAP_ADD` instructions, while the added value or key/value pair is popped off, the container object remains on the stack so that it is available for further iterations of the loop.
es: Para todas las instrucciones :opcode:`SET_ADD`, :opcode:`LIST_APPEND` y :opcode:`MAP_ADD`, mientras el valor agregado o el par clave/valor aparece, el objeto contenedor permanece en la pila para que quede disponible para futuras iteraciones del bucle.

source: Returns with TOS to the caller of the function.
es: Retorna con TOS a quien llama la función.

source: Pops TOS and yields it from a :term:`generator`.
es: Desapila TOS y lo genera (*yield*) de un :term:`generator`.

source: Checks whether ``__annotations__`` is defined in ``locals()``, if not it is set up to an empty ``dict``. This opcode is only emitted if a class or module body contains :term:`variable annotations <variable annotation>` statically.
es: Comprueba si ``__anotaciones__`` está definido en ``locals()``, si no está configurado como un ``dict`` vacío. Este código de operación solo se emite si el cuerpo de una clase o módulo contiene :term:`anotaciones de variables <variable annotation>` estáticamente.

source: Loads all symbols not starting with ``'_'`` directly from the module TOS to the local namespace. The module is popped after loading all names. This opcode implements ``from module import *``.
es: Carga todos los símbolos que no comienzan con ``'_'`` directamente desde el TOS del módulo al espacio de nombres local. El módulo se desapila después de cargar todos los nombres. Este opcode implementa ``from module import *``.

source: Pushes :exc:`AssertionError` onto the stack. Used by the :keyword:`assert` statement.
es: Inserta :exc:`AssertionError` en la pila. Utilizado por la declaración :keyword:`assert`.

source: Push ``len(TOS)`` onto the stack.
es: Apila ``len(TOS)`` en la pila.

source: If TOS is an instance of :class:`collections.abc.Mapping` (or, more technically: if it has the :const:`Py_TPFLAGS_MAPPING` flag set in its :c:member:`~PyTypeObject.tp_flags`), push ``True`` onto the stack. Otherwise, push ``False``.
es: Si TOS es una instancia de :class:`collections.abc.Mapping` (o, más técnicamente, si tiene el indicador :const:`Py_TPFLAGS_MAPPING` establecido en su :c:member:`~PyTypeObject.tp_flags`), apila ``True`` en la pila. De lo contrario apila ``False``.

source: If TOS is an instance of :class:`collections.abc.Sequence` and is *not* an instance of :class:`str`/:class:`bytes`/:class:`bytearray` (or, more technically: if it has the :const:`Py_TPFLAGS_SEQUENCE` flag set in its :c:member:`~PyTypeObject.tp_flags`), push ``True`` onto the stack. Otherwise, push ``False``.
es: Si TOS es una instancia de :class:`collections.abc.Sequence` y *no* es una instancia de :class:`str`/:class:`bytes`/:class:`bytearray` (o, más técnicamente, si tiene el indicador :const:`Py_TPFLAGS_SEQUENCE` establecido en su :c:member:`~PyTypeObject.tp_flags`), apila ``True`` en la pila. De lo contrario apila ``False``.

source: Implements ``name = TOS``. *namei* is the index of *name* in the attribute :attr:`co_names` of the code object. The compiler tries to use :opcode:`STORE_FAST` or :opcode:`STORE_GLOBAL` if possible.
es: Implementa ``name = TOS``. *namei* es el índice de *name* en el atributo :attr:`co_names` del objeto de código. El compilador intenta usar :opcode:`STORE_FAST` o :opcode:`STORE_GLOBAL` si es posible.

source: Implements ``del name``, where *namei* is the index into :attr:`co_names` attribute of the code object.
es: Implementa ``del name``, donde *namei* es el índice en atributo :attr:`co_names` del objeto de código.

source: Unpacks TOS into *count* individual values, which are put onto the stack right-to-left.
es: Descomprime TOS en *count* valores individuales, que se colocan en la pila de derecha a izquierda.

source: Implements assignment with a starred target: Unpacks an iterable in TOS into individual values, where the total number of values can be smaller than the number of items in the iterable: one of the new values will be a list of all leftover items.
es: Implementa la asignación con un objetivo destacado: desempaqueta un iterable en TOS en valores individuales, donde el número total de valores puede ser menor que el número de elementos en el iterable: uno de los nuevos valores será una lista de todos los elementos sobrantes.

source: The low byte of *counts* is the number of values before the list value, the high byte of *counts* the number of values after it. The resulting values are put onto the stack right-to-left.
es: El byte bajo de *count* es el número de valores antes del valor de la lista, el byte alto de *count* es el número de valores después de él. Los valores resultantes se colocan en la pila de derecha a izquierda.
