Repository: python/python-docs-es
Catalog: library/distutils.po
Languages: es_mx

source: :mod:`distutils` --- Building and installing Python modules
es_mx: :mod:`distutils` --- Creación e instalación de módulos Python

source: The :mod:`distutils` package provides support for building and installing additional modules into a Python installation. The new modules may be either 100%-pure Python, or may be extension modules written in C, or may be collections of Python packages which include modules coded in both Python and C.
es_mx: El paquete :mod:`distutils` proporciona soporte para crear e instalar módulos adicionales en una instalación de Python. Los nuevos módulos pueden ser 100% Python puro, o pueden ser módulos de extensión escritos en C, o pueden ser colecciones de paquetes de Python que incluyen módulos programados en Python y C.

source: Most Python users will *not* want to use this module directly, but instead use the cross-version tools maintained by the Python Packaging Authority. In particular, `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ is an enhanced alternative to :mod:`distutils` that provides:
es_mx: La mayoría de los usuarios de Python *no* querrán utilizar este módulo directamente, sino que usarán las herramientas cross-version mantenidas por la Python Packaging Authority. En particular, `setuptools <https://setuptools.readthedocs.io/en/latest/>`__ es una alternativa mejorada a :mod:`distutils` que proporciona:

source: support for declaring project dependencies
es_mx: soporte para declarar dependencias del proyecto

source: additional mechanisms for configuring which files to include in source releases (including plugins for integration with version control systems)
es_mx: mecanismos adicionales para configurar cuáles archivos incluir en lanzamientos de código fuente (incluyendo plugins para la integración con sistemas de control de versiones)

source: the ability to declare project "entry points", which can be used as the basis for application plugin systems
es_mx: la capacidad de declarar "puntos de entrada" del proyecto, los cuales pueden ser utilizados como base para los sistemas de plugins de aplicaciones

source: the ability to automatically generate Windows command line executables at installation time rather than needing to prebuild them
es_mx: la capacidad de generar, automáticamente, ejecutables de línea de comandos de Windows en el momento de la instalación, en lugar de tener que compilarlos previamente

source: consistent behaviour across all supported Python versions
es_mx: comportamiento consistente en todas las versiones de Python soportadas

source: The recommended `pip <https://pip.pypa.io/>`__ installer runs all ``setup.py`` scripts with ``setuptools``, even if the script itself only imports ``distutils``. Refer to the `Python Packaging User Guide <https://packaging.python.org>`_ for more information.
es_mx: El instalador `pip <https://pip.pypa.io/>`__ recomendado ejecuta todos los scripts ``setup.py`` con ``setuptools``, incluso si el propio script sólo importa ``distutils``. Consulte la `Python Packaging User Guide <https://packaging.python.org>`_ para más información.

source: For the benefits of packaging tool authors and users seeking a deeper understanding of the details of the current packaging and distribution system, the legacy :mod:`distutils` based user documentation and API reference remain available:
es_mx: Para beneficio de los autores de herramientas de empaquetado y los usuarios que buscan una comprensión más profunda de los detalles del sistema actual de empaquetado y distribución, la documentación de usuario heredada basada en :mod:`distutils` y la referencia de la API permanecen disponibles:
