Repository: python/python-docs-es
Catalog: library/email.generator.po
Languages: es_ar

source: :mod:`email.generator`: Generating MIME documents
es_ar: :mod:`email.generator`: Generando documentos MIME

source: **Source code:** :source:`Lib/email/generator.py`
es_ar: **Código fuente:** :source:`Lib/email/generator.py`

source: One of the most common tasks is to generate the flat (serialized) version of the email message represented by a message object structure. You will need to do this if you want to send your message via :meth:`smtplib.SMTP.sendmail` or the :mod:`nntplib` module, or print the message on the console. Taking a message object structure and producing a serialized representation is the job of the generator classes.
es_ar: Una de las tareas más comunes es generar la versión plana (serializada) del mensaje de correo electrónico representado por una estructura de objeto de mensaje. Se tendrá que hacer esto si se desea enviar un mensaje a través de :meth:`smtplib.SMTP.sendmail`, o el módulo :mod:`nntplib`, o imprimir el mensaje en la consola. Tomar una estructura de objeto de mensaje y producir una representación serializada es el trabajo de las clases generadoras.

source: As with the :mod:`email.parser` module, you aren't limited to the functionality of the bundled generator; you could write one from scratch yourself. However the bundled generator knows how to generate most email in a standards-compliant way, should handle MIME and non-MIME email messages just fine, and is designed so that the bytes-oriented parsing and generation operations are inverses, assuming the same non-transforming :mod:`~email.policy` is used for both. That is, parsing the serialized byte stream via the :class:`~email.parser.BytesParser` class and then regenerating the serialized byte stream using :class:`BytesGenerator` should produce output identical to the input [#]_. (On the other hand, using the generator on an :class:`~email.message.EmailMessage` constructed by program may result in changes to the :class:`~email.message.EmailMessage` object as defaults are filled in.)
es_ar: Al igual que con el módulo :mod:`email.parser`, no se limita a la funcionalidad del generador incluido; se podría escribir uno desde cero. Sin embargo, el generador incluido sabe cómo generar la mayoría del correo electrónico de una manera compatible con los estándares, debería controlar los mensajes de correo electrónico MIME y no MIME bien. Está diseñado para que las operaciones de análisis y generación orientadas a bytes sean inversas, asumiendo que se utilice la misma :mod:`~email.policy` de no transformación para ambos. Es decir, analizar la secuencia de bytes serializada a través de la clase :class:`~email.parser.BytesParser` y, a continuación, regenerar la secuencia de bytes serializada mediante :class:`BytesGenerator` debe producir una salida idéntica a la entrada [#]_. (Por otro lado, el uso del generador en un :class:`~email.message.EmailMessage` construido por el programa puede dar lugar a cambios en el objeto :class:`~email.message.EmailMessage` a medida que se rellenan los valores predeterminados.)

source: The :class:`Generator` class can be used to flatten a message into a text (as opposed to binary) serialized representation, but since Unicode cannot represent binary data directly, the message is of necessity transformed into something that contains only ASCII characters, using the standard email RFC Content Transfer Encoding techniques for encoding email messages for transport over channels that are not "8 bit clean".
es_ar: La clase :class:`Generator` se puede utilizar para acoplar un mensaje en una representación serializada de texto (a diferencia de la binaria). Sin embargo, como Unicode no puede representar datos binarios directamente, el mensaje es necesariamente transformado en algo que contiene sólo caracteres ASCII. Se utiliza las técnicas de codificación de transferencia de contenido RFC de correo electrónico estándar para codificar mensajes de correo electrónico para el transporte a través de canales que no son "8 bits limpios".

source: To accommodate reproducible processing of SMIME-signed messages :class:`Generator` disables header folding for message parts of type ``multipart/signed`` and all subparts.
es_ar: Para adaptar procesamiento reproducible de mensajes firmados por SMIME, :class:`Generator` deshabilita el encabezamiento para las partes del mensaje de tipo ``multipart/signed`` y todas sus subpartes.

source: Return a :class:`BytesGenerator` object that will write any message provided to the :meth:`flatten` method, or any surrogateescape encoded text provided to the :meth:`write` method, to the :term:`file-like object` *outfp*. *outfp* must support a ``write`` method that accepts binary data.
es_ar: Retorna un objeto :class:`BytesGenerator` que escribirá cualquier mensaje provisto por el método :meth:`flatten`, o cualquier texto de escape sustituto cifrado con el método :meth:`write`, al :term:`file-like object` *outfp*. *outfp* debe soportar un método ``write`` que acepte datos binarios.

source: If optional *mangle_from_* is ``True``, put a ``>`` character in front of any line in the body that starts with the exact string ``"From "``, that is ``From`` followed by a space at the beginning of a line. *mangle_from_* defaults to the value of the :attr:`~email.policy.Policy.mangle_from_` setting of the *policy* (which is ``True`` for the :data:`~email.policy.compat32` policy and ``False`` for all others). *mangle_from_* is intended for use when messages are stored in Unix mbox format (see :mod:`mailbox` and `WHY THE CONTENT-LENGTH FORMAT IS BAD <https://www.jwz.org/doc/content-length.html>`_).
es_ar: Si *mangle_from_* opcional es ``True``, se coloca un carácter ''>'' delante de cualquier línea del cuerpo que comience con la cadena exacta ``"From "``, es decir, ``From`` seguido de un espacio al principio de una línea. *mangle_from_* vuelve de forma predeterminada al valor de la configuración :attr:`~email.policy.Policy.mangle_from_` de la *policy* (que es ``True`` para la política :data:`~email.policy.compat32` y ``False`` para todas las demás). *mangle_from_* está diseñado para su uso cuando los mensajes se almacenan en formato mbox de Unix (consulte :mod:`mailbox` y `WHY THE CONTENT-LENGTH FORMAT IS BAD <https://www.jwz.org/doc/content-length.html>`_).

source: If *maxheaderlen* is not ``None``, refold any header lines that are longer than *maxheaderlen*, or if ``0``, do not rewrap any headers. If *manheaderlen* is ``None`` (the default), wrap headers and other message lines according to the *policy* settings.
es_ar: Si *maxheaderlen* no es ``None``, se repliega las líneas de encabezado que son mayores que *maxheaderlen*, o si es ``0``, no se reenvuelve ningún encabezado. Si *manheaderlen* es ``None`` (predeterminado), se envuelven los encabezados y otras líneas de mensajes de acuerdo a los ajustes de *policy*.

source: If *policy* is specified, use that policy to control message generation. If *policy* is ``None`` (the default), use the policy associated with the :class:`~email.message.Message` or :class:`~email.message.EmailMessage` object passed to ``flatten`` to control the message generation. See :mod:`email.policy` for details on what *policy* controls.
es_ar: Si la *norma* es especificada, se usa esa norma para controlar la generación de mensajes. Si la *norma* es ``None`` (predeterminado), se usa la norma asociada con el :class:`~email.message.Message` o el objeto :class:`~email.message.EmailMessage` pasado para ``flatten`` para controlar la generación del mensaje. Se puede ver :mod:`email.policy` para detalles de que controla la *norma*.

source: Added the *policy* keyword.
es_ar: Agregada la palabra clave *norma*.

source: The default behavior of the *mangle_from_* and *maxheaderlen* parameters is to follow the policy.
es_ar: El comportamiento predeterminado de los parámetros *mangle_from_* y *maxheaderlen* es para seguir la norma.

source: Print the textual representation of the message object structure rooted at *msg* to the output file specified when the :class:`BytesGenerator` instance was created.
es_ar: Imprime la representación textual de la estructura del objeto de mensaje originada en *msg* al archivo de salida especificado cuando se creó la instancia :class:`BytesGenerator`.

source: If the :mod:`~email.policy` option :attr:`~email.policy.Policy.cte_type` is ``8bit`` (the default), copy any headers in the original parsed message that have not been modified to the output with any bytes with the high bit set reproduced as in the original, and preserve the non-ASCII :mailheader:`Content-Transfer-Encoding` of any body parts that have them. If ``cte_type`` is ``7bit``, convert the bytes with the high bit set as needed using an ASCII-compatible :mailheader:`Content-Transfer-Encoding`. That is, transform parts with non-ASCII :mailheader:`Content-Transfer-Encoding` (:mailheader:`Content-Transfer-Encoding: 8bit`) to an ASCII compatible :mailheader:`Content-Transfer-Encoding`, and encode RFC-invalid non-ASCII bytes in headers using the MIME ``unknown-8bit`` character set, thus rendering them RFC-compliant.
es_ar: Si el tipo :attr:`~email.policy.Policy.cte_type` de la opción :mod:`~email.policy` es ``8bit`` (valor predeterminado), se copia los encabezados en el mensaje analizado original que no se hayan modificado con ningún bytes a la salida con el conjunto de bits altos, reproducido como en el original, y se conserva el :mailheader:`Content-Transfer-Encoding` no ASCII de cualquier parte del cuerpo que los tenga. Si ``cte_type`` es ``7bit``, se convierte los bytes con el conjunto de bits altos según sea necesario utilizando un :mailheader:`Content-Transfer-Encoding` compatible con ASCII . Es decir, se transforma partes con :mailheader:`Content-Transfer-Encoding` no ASCII (:mailheader:`Content-Transfer-Encoding: 8bit`) en un conjunto de caracteres compatible con ASCII :mailheader:`Content-Transfer-Encoding`, y se codifica bytes inválidos RFC no ASCII en encabezados mediante el conjunto de caracteres MIME ``unknown-8bit``, lo que los convierte en compatibles con RFC.

source: If *unixfrom* is ``True``, print the envelope header delimiter used by the Unix mailbox format (see :mod:`mailbox`) before the first of the :rfc:`5322` headers of the root message object. If the root object has no envelope header, craft a standard one. The default is ``False``. Note that for subparts, no envelope header is ever printed.
es_ar: Si *unixfrom* es ``True``, se imprime el delimitador de encabezado de sobre utilizado por el formato de buzón de correo Unix (consulta :mod:`mailbox`) antes del primero de los encabezados :rfc:`5322` del objeto de mensaje raíz. Si el objeto raíz no tiene encabezado de sobre, se crea uno estándar. El valor predeterminado es ``False``. Tener en cuenta que para las subpartes, nunca se imprime ningún encabezado de sobre.

source: If *linesep* is not ``None``, use it as the separator character between all the lines of the flattened message. If *linesep* is ``None`` (the default), use the value specified in the *policy*.
es_ar: Si *linesep* no es ``None``, se usa como caracter separador entre todas las líneas del mensaje acoplado. Si *linesep* es ``None`` (predeterminado), se usa el valor especificado en la *norma*.

source: Return an independent clone of this :class:`BytesGenerator` instance with the exact same option settings, and *fp* as the new *outfp*.
es_ar: Retorna un clon independiente de esta instancia de :class:`BytesGenerator` con las mismas configuraciones exactas, y *fp* como el nuevo *outfp*.

source: Encode *s* using the ``ASCII`` codec and the ``surrogateescape`` error handler, and pass it to the *write* method of the *outfp* passed to the :class:`BytesGenerator`'s constructor.
es_ar: Codifica *s* usando el códec ``ASCII`` u el manipulador de error ``escape sustituto``, y lo pasa al método *write* del *outfp* pasado al constructor de la clase :class:`BytesGenerator`.

source: As a convenience, :class:`~email.message.EmailMessage` provides the methods :meth:`~email.message.EmailMessage.as_bytes` and ``bytes(aMessage)`` (a.k.a. :meth:`~email.message.EmailMessage.__bytes__`), which simplify the generation of a serialized binary representation of a message object. For more detail, see :mod:`email.message`.
es_ar: Como conveniencia, :class:`~email.message.EmailMessage` provee los métodos :meth:`~email.message.EmailMessage.as_bytes` y ``bytes(aMessage)`` (también conocido como :meth:`~email.message.EmailMessage.__bytes__`) que simplifican la generación de la representación serializada binaria de un objeto mensaje. Para más detalle, ver :mod:`email.message`.

source: Because strings cannot represent binary data, the :class:`Generator` class must convert any binary data in any message it flattens to an ASCII compatible format, by converting them to an ASCII compatible :mailheader:`Content-Transfer_Encoding`. Using the terminology of the email RFCs, you can think of this as :class:`Generator` serializing to an I/O stream that is not "8 bit clean". In other words, most applications will want to be using :class:`BytesGenerator`, and not :class:`Generator`.
es_ar: Dado que las cadenas de caracteres no pueden representar datos binarios, la clase :class:`Generator` debe convertir los datos binarios en cualquier mensaje que aplane a un formato compatible con ASCII, convirtiéndolos en un :mailheader:`Content-Transfer_Encoding` compatible con ASCII. Usando la terminología de RFC de correo electrónico, se puede pensar en esto como :class:`Generator` serializando a una secuencia de E/S que no es *"8 bit clean"*. En otras palabras, la mayoría de las aplicaciones querrán usar :class:`BytesGenerator`, y no :class:`Generator`.

source: Return a :class:`Generator` object that will write any message provided to the :meth:`flatten` method, or any text provided to the :meth:`write` method, to the :term:`file-like object` *outfp*. *outfp* must support a ``write`` method that accepts string data.
es_ar: Retorna un objeto :class:`Generator` que escribirá cualquier mensaje provisto al método :meth:`flatten`, o cualquier texto provisto al método :meth:`write`, al :term:`file-like object` *outfp*. *outfp* debe soportar un método ``write`` que acepte datos de cadena de caracteres.

source: Print the textual representation of the message object structure rooted at *msg* to the output file specified when the :class:`Generator` instance was created.
es_ar: Imprime la representación textual de la estructura del objeto de mensaje originado en el *msg* al archivo especificado de salida cuando la instancia de :class:`Generator` fue creada.

source: If the :mod:`~email.policy` option :attr:`~email.policy.Policy.cte_type` is ``8bit``, generate the message as if the option were set to ``7bit``. (This is required because strings cannot represent non-ASCII bytes.) Convert any bytes with the high bit set as needed using an ASCII-compatible :mailheader:`Content-Transfer-Encoding`. That is, transform parts with non-ASCII :mailheader:`Content-Transfer-Encoding` (:mailheader:`Content-Transfer-Encoding: 8bit`) to an ASCII compatible :mailheader:`Content-Transfer-Encoding`, and encode RFC-invalid non-ASCII bytes in headers using the MIME ``unknown-8bit`` character set, thus rendering them RFC-compliant.
es_ar: Si la opción :mod:`~email.policy` :attr:`~email.policy.Policy.cte_type` es ``8bit``, se genera el mensaje como si la opción estuviera establecida en ``7bit``. (Esto es necesario porque las cadenas de caracteres no pueden representar bytes que no sean ASCII). Convierte cualesquiera bytes con el conjunto de bits alto según sea necesario utilizando un :mailheader:`Content-Transfer-Encoding` compatible con ASCII. Es decir, transforma partes con :mailheader:`Content-Transfer-Encoding` (:mailheader:`Content-Transfer-Encoding: 8bit`) no ASCII en un conjunto de caracteres :mailheader:`Content-Transfer-Encoding` compatible con ASCII. Y codifica bytes no ASCII RFC inválidos ASCII en encabezados mediante el conjunto de caracteres MIME ``unknown-8bit``, lo que los convierte en compatibles con RFC.

source: Added support for re-encoding ``8bit`` message bodies, and the *linesep* argument.
es_ar: Agrega soporte para el recodificado de cuerpos de mensajes ``8bit``, y el argumento *linesep*.

source: Return an independent clone of this :class:`Generator` instance with the exact same options, and *fp* as the new *outfp*.
es_ar: Retorna un clon independiente de esta instancia de :class:`Generator` con las mismas opciones exactas y *fp* como la nueva *outfp*.

source: Write *s* to the *write* method of the *outfp* passed to the :class:`Generator`'s constructor. This provides just enough file-like API for :class:`Generator` instances to be used in the :func:`print` function.
es_ar: Escribe *s* al método *write* del *outfp* pasado al constructor de la :class:`Generator`. Esto provee justo la suficiente API de tipo archivo para instancias de :class:`Generator` para ser usadas en la función :func:`print`.

source: As a convenience, :class:`~email.message.EmailMessage` provides the methods :meth:`~email.message.EmailMessage.as_string` and ``str(aMessage)`` (a.k.a. :meth:`~email.message.EmailMessage.__str__`), which simplify the generation of a formatted string representation of a message object. For more detail, see :mod:`email.message`.
es_ar: Para conveniencia, :class:`~email.message.EmailMessage` provee los métodos :meth:`~email.message.EmailMessage.as_string` y ``str(aMessage)`` (también conocido como :meth:`~email.message.EmailMessage.__str__`), que simplifican la generación de una representación de una cadena de caracteres formateada de un objeto mensaje. Para más detalles, ver :mod:`email.message`.

source: The :mod:`email.generator` module also provides a derived class, :class:`DecodedGenerator`, which is like the :class:`Generator` base class, except that non-\ :mimetype:`text` parts are not serialized, but are instead represented in the output stream by a string derived from a template filled in with information about the part.
es_ar: El módulo :mod:`email.generator` también provee una clase derivada, :class:`DecodedGenerator`, la cual es como la clase base :class:`Generator`, excepto que las partes no \ :mimetype:`text` no están serializadas, sino que en su lugar, están representadas en el flujo de salida por una cadena de caracteres derivada de una plantilla llenada con información sobre la parte.

source: Act like :class:`Generator`, except that for any subpart of the message passed to :meth:`Generator.flatten`, if the subpart is of main type :mimetype:`text`, print the decoded payload of the subpart, and if the main type is not :mimetype:`text`, instead of printing it fill in the string *fmt* using information from the part and print the resulting filled-in string.
es_ar: Se actúa como :class:`Generator`, excepto para cualquier subparte del mensaje pasado a :meth:`Generator.flatten`, si la subparte es de tipo principal :mimetype:`text`, se imprime la carga útil decodificada de la subparte, y si el tipo principal no es :mimetype:`text`, en lugar de imprimirlo se rellena la cadena de caracteres *fmt* utilizando la información de la parte y se imprime la cadena de caracteres rellenada resultante.

source: To fill in *fmt*, execute ``fmt % part_info``, where ``part_info`` is a dictionary composed of the following keys and values:
es_ar: Para llenar *fmt*, se ejecuta ``fmt % part_info``, donde ``part_info`` es un diccionario compuesto por las siguientes claves y valores:

source: ``type`` -- Full MIME type of the non-\ :mimetype:`text` part
es_ar: ``type`` -- Todo el tipo MIME de la parte no\ :mimetype:`text`

source: ``maintype`` -- Main MIME type of the non-\ :mimetype:`text` part
es_ar: ``maintype`` -- Principal tipo MIME de la parte no\ :mimetype:`text`

source: ``subtype`` -- Sub-MIME type of the non-\ :mimetype:`text` part
es_ar: ``subtype`` -- Tipo sub-MIME de la parte no-\ :mimetype:`text`

source: ``filename`` -- Filename of the non-\ :mimetype:`text` part
es_ar: ``filename`` -- Nombre de archivo de la parte no\ :mimetype:`text`

source: ``description`` -- Description associated with the non-\ :mimetype:`text` part
es_ar: ``description`` -- Descripción asociada con la parte no\ :mimetype:`text`

source: ``encoding`` -- Content transfer encoding of the non-\ :mimetype:`text` part
es_ar: ``encoding`` -- Codificado de la transferencia del contenido de la parte no-\ :mimetype:`text`

source: If *fmt* is ``None``, use the following default *fmt*:
es_ar: Si *fmt* es ``None``, se usa el siguiente *fmt* predeterminado:

source: Optional *_mangle_from_* and *maxheaderlen* are as with the :class:`Generator` base class.
es_ar: Los opcionales *_mangle_from_* y *maxheaderlen* son como en la clase base :class:`Generator`.

source: Footnotes
es_ar: Notas al pie

source: This statement assumes that you use the appropriate setting for ``unixfrom``, and that there are no :mod:`email.policy` settings calling for automatic adjustments (for example, :attr:`~email.policy.EmailPolicy.refold_source` must be ``none``, which is *not* the default). It is also not 100% true, since if the message does not conform to the RFC standards occasionally information about the exact original text is lost during parsing error recovery. It is a goal to fix these latter edge cases when possible.
es_ar: Esta instrucción supone que se utiliza la configuración adecuada para ``unixfrom``, y que no hay ninguna configuración :mod:`email.policy` que llame a ajustes automáticos (por ejemplo, :attr:`~email.policy.EmailPolicy.refold_source` debe ser ``none``, que es *no* es el valor predeterminado). Esto tampoco es 100% verdadero, ya que si el mensaje no se ajusta a los estándares RFC ocasionalmente la información sobre el texto original exacto se pierde durante la el análisis de recuperación de errores. Es un objetivo fijar estos últimos casos extremos cuando sea posible.
