Repository: python/python-docs-es
Catalog: library/email.errors.po
Languages: es

source: :mod:`email.errors`: Exception and Defect classes
es: :mod:`email.errors`: Clases de excepción y defecto

source: **Source code:** :source:`Lib/email/errors.py`
es: **Código fuente:** :source:`Lib/email/errors.py`

source: The following exception classes are defined in the :mod:`email.errors` module:
es: Las siguientes clases de excepción se definen en el módulo :mod:`email.errors`:

source: This is the base class for all exceptions that the :mod:`email` package can raise. It is derived from the standard :exc:`Exception` class and defines no additional methods.
es: Esta es la clase base para todas las excepciones que el paquete :mod:`email` puede lanzar. Se deriva de la clase estándar :exc:`Exception` y no define métodos adicionales.

source: This is the base class for exceptions raised by the :class:`~email.parser.Parser` class. It is derived from :exc:`MessageError`. This class is also used internally by the parser used by :mod:`~email.headerregistry`.
es: Esta es la clase base para las excepciones generadas por la clase :class:`~email.parser.Parser`. Se deriva de :exc:`MessageError`. Esta clase también es utilizada internamente por el analizador sintáctico utilizado por :mod:`~email.headerregistry`.

source: Raised under some error conditions when parsing the :rfc:`5322` headers of a message, this class is derived from :exc:`MessageParseError`. The :meth:`~email.message.EmailMessage.set_boundary` method will raise this error if the content type is unknown when the method is called. :class:`~email.header.Header` may raise this error for certain base64 decoding errors, and when an attempt is made to create a header that appears to contain an embedded header (that is, there is what is supposed to be a continuation line that has no leading whitespace and looks like a header).
es: Lanzada en algunas condiciones de error al analizar los encabezados :rfc:`5322` de un mensaje, esta clase se deriva de :exc:`MessageParseError`. El método :meth:`~email.message.EmailMessage.set_boundary` lanzará este error si el tipo de contenido es desconocido cuando se llama al método. :class:`~email.header.Header` puede lanzar este error para ciertos errores de decodificación de base64, y cuando se intenta crear un encabezado que parece contener un encabezado incrustado (es decir, hay lo que se supone que es un línea de continuación que no tiene espacios en blanco iniciales y parece un encabezado).

source: Deprecated and no longer used.
es: Deprecada y no utilizada actualmente.

source: Raised when a payload is added to a :class:`~email.message.Message` object using :meth:`add_payload`, but the payload is already a scalar and the message's :mailheader:`Content-Type` main type is not either :mimetype:`multipart` or missing. :exc:`MultipartConversionError` multiply inherits from :exc:`MessageError` and the built-in :exc:`TypeError`.
es: Se lanza cuando se agrega una carga útil (*payload*) a un objeto :class:`~email.message.Message` usando :meth:`add_payload`, pero la carga útil ya es un número escalar y el tipo principal del mensaje :mailheader:`Content-Type` no es :mimetype:`multipart` ni perdido (*missing*). :exc:`MultipartConversionError` hereda al mismo tiempo de :exc:`MessageError` y el incorporado :exc:`TypeError`.

source: Since :meth:`Message.add_payload` is deprecated, this exception is rarely raised in practice. However the exception may also be raised if the :meth:`~email.message.Message.attach` method is called on an instance of a class derived from :class:`~email.mime.nonmultipart.MIMENonMultipart` (e.g. :class:`~email.mime.image.MIMEImage`).
es: Dado que :meth:`Message.add_payload` está en desuso, esta excepción rara vez se presenta en la práctica. Sin embargo, la excepción también se puede lanzar si se llama al método :meth:`~email.message.Message.attach` en una instancia de una clase derivada de :class:`~email.mime.nonmultipart.MIMENonMultipart` (por ejemplo :class:`~email.mime.image.MIMEImage`).

source: Here is the list of the defects that the :class:`~email.parser.FeedParser` can find while parsing messages. Note that the defects are added to the message where the problem was found, so for example, if a message nested inside a :mimetype:`multipart/alternative` had a malformed header, that nested message object would have a defect, but the containing messages would not.
es: Aquí está la lista de defectos que :class:`~email.parser.FeedParser` puede encontrar mientras analiza mensajes. Tenga en cuenta que los defectos se agregan al mensaje donde se encontró el problema, por ejemplo, si un mensaje anidado dentro de un :mimetype:`multipart/alternative` tenía un encabezado mal formado, ese objeto de mensaje anidado tendría un defecto, pero el contenido los mensajes no lo harían.

source: All defect classes are subclassed from :class:`email.errors.MessageDefect`.
es: Todas las clases de defectos se derivan de :class:`email.errors.MessageDefect`.

source: :class:`NoBoundaryInMultipartDefect` -- A message claimed to be a multipart, but had no :mimetype:`boundary` parameter.
es: :class:`NoBoundaryInMultipartDefect` -- Un mensaje que se dice que es multiparte, pero que no tiene el parámetro :mimetype:`boundary`.

source: :class:`StartBoundaryNotFoundDefect` -- The start boundary claimed in the :mailheader:`Content-Type` header was never found.
es: :class:`StartBoundaryNotFoundDefect` -- El límite de inicio reclamado en el encabezado :mailheader:`Content-Type` nunca se encontró.

source: :class:`CloseBoundaryNotFoundDefect` -- A start boundary was found, but no corresponding close boundary was ever found.
es: :class:`CloseBoundaryNotFoundDefect` -- Se encontró un límite de inicio, pero nunca se encontró un límite cercano correspondiente.

source: :class:`FirstHeaderLineIsContinuationDefect` -- The message had a continuation line as its first header line.
es: :class:`FirstHeaderLineIsContinuationDefect` -- El mensaje tenía una línea de continuación como primera línea de encabezado.

source: :class:`MisplacedEnvelopeHeaderDefect` - A "Unix From" header was found in the middle of a header block.
es: :class:`MisplacedEnvelopeHeaderDefect` -- Se encontró un encabezado "*Unix From*" en medio de un bloque de encabezado.

source: :class:`MissingHeaderBodySeparatorDefect` - A line was found while parsing headers that had no leading white space but contained no ':'. Parsing continues assuming that the line represents the first line of the body.
es: :class:`MissingHeaderBodySeparatorDefect` - Se encontró una línea al analizar sintácticamente los encabezados que no tenían espacios en blanco iniciales pero que no contenían ':'. El análisis continúa asumiendo que la línea representa la primera línea del cuerpo.

source: :class:`MalformedHeaderDefect` -- A header was found that was missing a colon, or was otherwise malformed.
es: :class:`MalformedHeaderDefect` -- Se encontró un encabezado al que le faltaban dos puntos o tenía un formato incorrecto.

source: This defect has not been used for several Python versions.
es: Este defecto no se ha utilizado por varias versiones de Python.

source: :class:`MultipartInvariantViolationDefect` -- A message claimed to be a :mimetype:`multipart`, but no subparts were found. Note that when a message has this defect, its :meth:`~email.message.Message.is_multipart` method may return ``False`` even though its content type claims to be :mimetype:`multipart`.
es: :class:`MultipartInvariantViolationDefect`-- Un mensaje que se afirma ser :mimetype:`multipart`, pero no se encontraron subpartes. Tenga en cuenta que cuando un mensaje tiene este defecto, su método :meth:`~email.message.Message.is_multipart` puede retornar ``False`` aunque su tipo de contenido afirma ser :mimetype:`multipart`.

source: :class:`InvalidBase64PaddingDefect` -- When decoding a block of base64 encoded bytes, the padding was not correct. Enough padding is added to perform the decode, but the resulting decoded bytes may be invalid.
es: :class:`InvalidBase64PaddingDefect` -- Al decodificar un bloque de bytes codificados en base64, el relleno no era correcto. Se agrega suficiente relleno (*padding*) para realizar la decodificación, pero los bytes decodificados resultantes pueden no ser válidos.

source: :class:`InvalidBase64CharactersDefect` -- When decoding a block of base64 encoded bytes, characters outside the base64 alphabet were encountered. The characters are ignored, but the resulting decoded bytes may be invalid.
es: :class:`InvalidBase64CharactersDefect` -- Al decodificar un bloque de bytes codificados en `base64`, se encontraron caracteres fuera del alfabeto `base64`. Los caracteres se ignoran, pero los bytes decodificados resultantes pueden no ser válidos.

source: :class:`InvalidBase64LengthDefect` -- When decoding a block of base64 encoded bytes, the number of non-padding base64 characters was invalid (1 more than a multiple of 4). The encoded block was kept as-is.
es: :class:`InvalidBase64LengthDefect` -- Al decodificar un bloque de bytes codificados en `base64`, el número de caracteres `base64` sin relleno no era válido (1 más que un múltiplo de 4). El bloque codificado se mantuvo tal cual.
