Repository: python/python-docs-es
Catalog: library/email.parser.po
Languages: es_ar

source: Some non-standards-compliant messages may not be internally consistent about their :mimetype:`multipart`\ -edness. Such messages may have a :mailheader:`Content-Type` header of type :mimetype:`multipart`, but their :meth:`~email.message.EmailMessage.is_multipart` method may return ``False``. If such messages were parsed with the :class:`~email.parser.FeedParser`, they will have an instance of the :class:`~email.errors.MultipartInvariantViolationDefect` class in their *defects* attribute list. See :mod:`email.errors` for details.
es_ar: Algunos mensajes de conformidad no estándar pueden no ser internamente consistentes acerca de su :mimetype:`multipart`\ -idad. Tales mensajes pueden tener una cabecera :mailheader:`Content-Type` de tipo :mimetype:`multipart`, pero su método :meth:`~email.message.EmailMessage.is_multipart` puede retornar ``False``. Si tales mensajes son analizados con :class:`~email.parser.FeedParser`, tendrán una instancia de la clase :class:`~email.errors.MultipartInvariantViolationDefect` en su lista de atributos *defects*. Véase :mod:`email.errors` para más detalles.
