Repository: python/python-docs-es
Catalog: library/email.encoders.po
Languages: es

source: :mod:`email.encoders`: Encoders
es: :mod:`email.encoders`: Codificadores

source: **Source code:** :source:`Lib/email/encoders.py`
es: **Código fuente:** :source:`Lib/email/encoders.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API the functionality is provided by the *cte* parameter of the :meth:`~email.message.EmailMessage.set_content` method.
es: Este módulo forma parte de la anterior API de correo electrónico (``Compat32``). En la nueva API, la funcionalidad la proporciona el parámetro *cte* del método :meth:`~email.message.EmailMessage.set_content`.

source: This module is deprecated in Python 3. The functions provided here should not be called explicitly since the :class:`~email.mime.text.MIMEText` class sets the content type and CTE header using the *_subtype* and *_charset* values passed during the instantiation of that class.
es: Este módulo está obsoleto en Python 3. Las funciones que aparecen aquí no deberían ser llamadas explícitamente ya que la clase :class:`~email.mime.text.MIMEText` establece el tipo de contenido y el encabezado CTE utilizando los valores del *_subtype* y del *_charset* que se pasan cuando se instancia esa clase.

source: The remaining text in this section is the original documentation of the module.
es: El texto que viene a continuación corresponde a la documentación original del módulo.

source: When creating :class:`~email.message.Message` objects from scratch, you often need to encode the payloads for transport through compliant mail servers. This is especially true for :mimetype:`image/\*` and :mimetype:`text/\*` type messages containing binary data.
es: Cuando se crean objetos :class:`~email.message.Message` desde 0, a menudo se necesita codificar el contenido del mensaje para transportarlo a través de servidores de correo electrónico adecuados. Esto es así especialmente para el tipo de mensajes :mimetype:`image/\*` y :mimetype:`text/\*` que contienen datos binarios.

source: The :mod:`email` package provides some convenient encoders in its :mod:`~email.encoders` module. These encoders are actually used by the :class:`~email.mime.audio.MIMEAudio` and :class:`~email.mime.image.MIMEImage` class constructors to provide default encodings. All encoder functions take exactly one argument, the message object to encode. They usually extract the payload, encode it, and reset the payload to this newly encoded value. They should also set the :mailheader:`Content-Transfer-Encoding` header as appropriate.
es: El paquete :mod:`email` proporciona algunos codificadores adecuados en su módulo :mod:`~email.encoders`. Estos codificadores son en realidad utilizados por los constructores de las clases :class:`~email.mime.audio.MIMEAudio` y :class:`~email.mime.image.MIMEImage` para proporcionar codificadores por defecto. Todas las funciones de codificación tienen exactamente un argumento, el mensaje a codificar. Normalmente extraen el contenido, lo codifican y borran el contenido para introducir el nuevo contenido codificado. También deberían marcar el encabezado :mailheader:`Content-Transfer-Encoding` como apropiado.

source: Note that these functions are not meaningful for a multipart message. They must be applied to individual subparts instead, and will raise a :exc:`TypeError` if passed a message whose type is multipart.
es: Ten en cuenta que estas funciones no sirven para un mensaje con múltiples partes. En lugar de aplicarlo al mensaje completo, las funciones deben aplicarse a cada subparte individual. Si se pasa un mensaje de múltiples partes como argumento se activara un mensaje de error :exc:`TypeError`.

source: Here are the encoding functions provided:
es: A continuación, una lista de las funciones de codificación facilitadas:

source: Encodes the payload into quoted-printable form and sets the :mailheader:`Content-Transfer-Encoding` header to ``quoted-printable`` [#]_. This is a good encoding to use when most of your payload is normal printable data, but contains a few unprintable characters.
es: Codifica el contenido en formularios entrecomillados e imprimibles y marca el encabezado :mailheader:`Content-Transfer-Encoding` como ``quoted-printable`` [#]_. Es un buen codificador para usar cuando la mayoría del contenido son datos imprimibles normales pero hay algún dato que no es imprimible.

source: Encodes the payload into base64 form and sets the :mailheader:`Content-Transfer-Encoding` header to ``base64``. This is a good encoding to use when most of your payload is unprintable data since it is a more compact form than quoted-printable. The drawback of base64 encoding is that it renders the text non-human readable.
es: Codifica el contenido en un formulario base64 y marca el encabezado :mailheader:`Content-Transfer-Encoding` como ``base64``. Esta codificación es buena cuando la mayoría del contenido son datos no imprimibles ya que es un formulario más compacto que formularios entrecomillados e imprimibles. La desventaja es que incluye el texto que no es leíble por los humanos.

source: This doesn't actually modify the message's payload, but it does set the :mailheader:`Content-Transfer-Encoding` header to either ``7bit`` or ``8bit`` as appropriate, based on the payload data.
es: Esto, en realidad, no modifica el contenido del mensaje, pero fija el encabezado :mailheader:`Content-Transfer-Encoding` a ``7bit`` u ``8bit``, lo que considere más adecuado en función del contenido del mensaje.

source: This does nothing; it doesn't even set the :mailheader:`Content-Transfer-Encoding` header.
es: Esto no hace nada; ni siquiera fija el encabezado :mailheader:`Content-Transfer-Encoding`.

source: Footnotes
es: Notas

source: Note that encoding with :meth:`encode_quopri` also encodes all tabs and space characters in the data.
es: El codificado con :meth:`encode_quopri` también codifica todas las tabulaciones y caracteres de espacios en los datos.
