Repository: python/python-docs-es
Catalog: library/ensurepip.po
Languages: es

source: :mod:`ensurepip` --- Bootstrapping the ``pip`` installer
es: :mod:`ensurepip` --- Ejecutando el instalador ``pip``

source: The :mod:`ensurepip` package provides support for bootstrapping the ``pip`` installer into an existing Python installation or virtual environment. This bootstrapping approach reflects the fact that ``pip`` is an independent project with its own release cycle, and the latest available stable version is bundled with maintenance and feature releases of the CPython reference interpreter.
es: El paquete :mod:`ensurepip` proporciona soporte para ejecutar el instalador ``pip`` en una instalación de Python existente o en un entorno virtual. Este enfoque de arranque refleja el hecho de que ``pip`` es un proyecto independiente con su propio ciclo de lanzamiento, y la última versión estable disponible se incluye con el mantenimiento y las versiones de características del intérprete de referencia CPython.

source: In most cases, end users of Python shouldn't need to invoke this module directly (as ``pip`` should be bootstrapped by default), but it may be needed if installing ``pip`` was skipped when installing Python (or when creating a virtual environment) or after explicitly uninstalling ``pip``.
es: En la mayoría de los casos, los usuarios finales de Python no deberían tener que invocar este módulo directamente (como ``pip`` deben arrancarse de forma predeterminada), pero puede ser necesario si se omitió la instalación de ``pip`` al instalar Python (o al crear un entorno virtual) o después de desinstalar explícitamente ``pip``.

source: This module *does not* access the internet. All of the components needed to bootstrap ``pip`` are included as internal parts of the package.
es: Este módulo *no* accede a Internet. Todos los componentes necesarios para ejecutar ``pip`` se incluyen como partes internas del paquete.

source: The end user guide for installing Python packages
es: La guía del usuario final para instalar paquetes python

source: :pep:`453`: Explicit bootstrapping of pip in Python installations
es: :pep:`453`: Arranque explícito de pip en instalaciones de Python

source: The original rationale and specification for this module.
es: La justificación original y la especificación de este módulo.

source: Command line interface
es: Interfaz de línea de comandos

source: The command line interface is invoked using the interpreter's ``-m`` switch.
es: La interfaz de línea de comandos se invoca mediante el modificador ``-m`` del intérprete.

source: The simplest possible invocation is::
es: La invocación más simple posible es::

source: This invocation will install ``pip`` if it is not already installed, but otherwise does nothing. To ensure the installed version of ``pip`` is at least as recent as the one available in ``ensurepip``, pass the ``--upgrade`` option::
es: Esta invocación instalará ``pip`` si aún no está instalado, pero de lo contrario no hace nada. Para asegurarse de que la versión instalada de ``pip`` sea al menos tan reciente como la disponible en ``ensurepip``, pase la opción ``--upgrade``:

source: By default, ``pip`` is installed into the current virtual environment (if one is active) or into the system site packages (if there is no active virtual environment). The installation location can be controlled through two additional command line options:
es: De forma predeterminada, ``pip`` se instala en el entorno virtual actual (si uno está activo) o en los paquetes de sitio del sistema (si no hay ningún entorno virtual activo). La ubicación de instalación se puede controlar a través de dos opciones de línea de comandos adicionales:

source: ``--user``: Installs ``pip`` into the user site packages directory rather than globally for the current Python installation (this option is not permitted inside an active virtual environment).
es: ``--user``: Instala ``pip`` en el directorio de paquetes de sitio de usuario en lugar de globalmente para la instalación actual de Python (esta opción no está permitida dentro de un entorno virtual activo).

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the version of Python used to invoke ``ensurepip``). The scripts installed can be controlled through two additional command line options:
es: De forma predeterminada, se instalarán los scripts ``pipX`` y ``pipX.Y`` (donde X.Y representa la versión de Python utilizada para invocar ``ensurepip``). Los scripts instalados se pueden controlar a través de dos opciones de línea de comandos adicionales:

source: ``--altinstall``: if an alternate installation is requested, the ``pipX`` script will *not* be installed.
es: ``--altinstall``: si se solicita una instalación alternativa, *no* se instalará el script ``pipX``.

source: ``--default-pip``: if a "default pip" installation is requested, the ``pip`` script will be installed in addition to the two regular scripts.
es: ``--default-pip``: si se solicita una instalación de "pip predeterminado", se instalará el script ``pip`` además de los dos scripts regulares.

source: Providing both of the script selection options will trigger an exception.
es: Proporcionar ambas opciones de selección de script desencadenará una excepción.

source: Module API
es: API del módulo

source: :mod:`ensurepip` exposes two functions for programmatic use:
es: :mod:`ensurepip` expone dos funciones para su uso programático:

source: Returns a string specifying the available version of pip that will be installed when bootstrapping an environment.
es: Retorna una cadena que especifica la versión disponible de pip que se instalará al arrancar un entorno.

source: Bootstraps ``pip`` into the current or designated environment.
es: Ejecuta ``pip`` en el entorno actual o designado.

source: *root* specifies an alternative root directory to install relative to. If *root* is ``None``, then installation uses the default install location for the current environment.
es: *root* especifica un directorio raíz alternativo para instalar en relación con. Si *root* es ``None``, la instalación utiliza la ubicación de instalación predeterminada para el entorno actual.

source: *upgrade* indicates whether or not to upgrade an existing installation of an earlier version of ``pip`` to the available version.
es: *upgrade* indica si se debe actualizar o no una instalación existente de una versión anterior de ``pip`` a la versión disponible.

source: *user* indicates whether to use the user scheme rather than installing globally.
es: *user* indica si se debe utilizar el esquema de usuario en lugar de instalar globalmente.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the current version of Python).
es: De forma predeterminada, se instalarán los scripts ``pipX`` y ``pipX.Y`` (donde X.Y representa la versión actual de Python).

source: If *altinstall* is set, then ``pipX`` will *not* be installed.
es: Si se establece *altinstall*, *no* se instalará ``pipX``.

source: If *default_pip* is set, then ``pip`` will be installed in addition to the two regular scripts.
es: Si se establece *default_pip*, se instalará ``pip`` además de los dos scripts normales.

source: Setting both *altinstall* and *default_pip* will trigger :exc:`ValueError`.
es: Establecer tanto *altinstall* como *default_pip* desencadenará :exc:`ValueError`.

source: *verbosity* controls the level of output to :data:`sys.stdout` from the bootstrapping operation.
es: *verbosity* controla el nivel de salida a :data:`sys.stdout` de la operación de ejecución.

source: Raises an :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` with argument ``root``.
es: Genera un evento :ref:`auditing <auditing>` ``ensurepip.bootstrap`` con el argumento ``root``.

source: The bootstrapping process has side effects on both ``sys.path`` and ``os.environ``. Invoking the command line interface in a subprocess instead allows these side effects to be avoided.
es: El proceso de ejecución tiene efectos secundarios tanto en ``sys.path`` como ``os.environ``. Invocar la interfaz de línea de comandos en un subproceso en su lugar permite evitar estos efectos secundarios.

source: The bootstrapping process may install additional modules required by ``pip``, but other software should not assume those dependencies will always be present by default (as the dependencies may be removed in a future version of ``pip``).
es: El proceso de ejecución puede instalar módulos adicionales requeridos por ``pip``, pero otro software no debe asumir que esas dependencias siempre estarán presentes de forma predeterminada (ya que las dependencias se pueden eliminar en una versión futura de ``pip``).
