Repository: python/python-docs-es
Catalog: library/enum.po
Languages: es

source: Out-of-range values lose their *Flag* membership and revert to :class:`int`. This is the default for :class:`IntFlag`::
es: Los valores fuera de rango pierden su pertenencia a *Flag* y vuelven a :class:`int`. Este es el valor predeterminado para :class:`IntFlag`::

source: Out-of-range values are kept, and the *Flag* membership is kept. This is used for some stdlib flags:
es: Se mantienen los valores fuera de rango y se mantiene la pertenencia a *Flag*. Esto se usa para algunas banderas stdlib:

source: Supported ``__dunder__`` names
es: Nombres soportados ``__dunder__``

source: :attr:`__members__` is a read-only ordered mapping of ``member_name``:``member`` items. It is only available on the class.
es: :attr:`__members__` es una asignación ordenada de solo lectura de artículos ``member_name``:``member``. Solo está disponible en la clase.

source: :meth:`__new__`, if specified, must create and return the enum members; it is also a very good idea to set the member's :attr:`_value_` appropriately. Once all the members are created it is no longer used.
es: :meth:`__new__`, si se especifica, debe crear y retornar los miembros de enumeración; también es una muy buena idea establecer el :attr:`_value_` del miembro apropiadamente. Una vez que se crean todos los miembros, ya no se usa.

source: Supported ``_sunder_`` names
es: Nombres ``_sunder_`` compatibles

source: ``_name_`` -- name of the member
es: ``_name_``— nombre del miembro

source: ``_value_`` -- value of the member; can be set / modified in ``__new__``
es: ``_value_`` — valor del miembro; se puede definir / modificar en ``__new__``

source: ``_missing_`` -- a lookup function used when a value is not found; may be overridden
es: ``_missing_`` — una función de búsqueda utilizada cuando no se encuentra un valor; puede ser anulado

source: ``_ignore_`` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
es: ``_ignore_`` -- una lista de nombres, ya sea como una :func:`list` o una :func:`str` que no será transformada en miembros, y que se eliminará de la clase final

source: ``_order_`` -- used in Python 2/3 code to ensure member order is consistent (class attribute, removed during class creation)
es: ``_order_`` — usado en código Python 2/3 para asegurar que el orden de los miembros sea consistente (atributo de clase, eliminado durante la creación de la clase)

source: ``_generate_next_value_`` -- used to get an appropriate value for an enum member; may be overridden
es: ``_generate_next_value_``: se usa para obtener un valor apropiado para un miembro de enumeración; puede ser anulado

source: For standard :class:`Enum` classes the next value chosen is the last value seen incremented by one.
es: Para las clases :class:`Enum` estándar, el siguiente valor elegido es el último valor visto incrementado en uno.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two, regardless of the last value seen.
es: Para las clases :class:`Flag`, el siguiente valor elegido será la siguiente potencia de dos más alta, independientemente del último valor visto.

source: Utilities and Decorators
es: Utilidades y decoradores

source: *auto* can be used in place of a value. If used, the *Enum* machinery will call an *Enum*'s :meth:`_generate_next_value_` to get an appropriate value. For *Enum* and *IntEnum* that appropriate value will be the last value plus one; for *Flag* and *IntFlag* it will be the first power-of-two greater than the last value; for *StrEnum* it will be the lower-cased version of the member's name.
es: *auto* se puede utilizar en lugar de un valor. Si se usa, la maquinaria *Enum* llamará a :meth:`_generate_next_value_` de *Enum* para obtener un valor apropiado. Para *Enum* y *IntEnum*, ese valor apropiado será el último valor más uno; para *Flag* y *IntFlag* será la primera potencia de dos mayor que el último valor; para *StrEnum* será la versión en minúsculas del nombre del miembro.

source: ``_generate_next_value_`` can be overridden to customize the values used by *auto*.
es: ``_generate_next_value_`` se puede anular para personalizar los valores utilizados por *auto*.

source: in 3.13 the default ``"generate_next_value_`` will always return the highest member value incremented by 1, and will fail if any member is an incompatible type.
es: en 3.13, el ``"generate_next_value_`` predeterminado siempre retornará el valor de miembro más alto incrementado en 1 y fallará si algún miembro es de un tipo incompatible.

source: A decorator similar to the built-in *property*, but specifically for enumerations. It allows member attributes to have the same names as members themselves.
es: Un decorador similar al *property* integrado, pero específico para enumeraciones. Permite que los atributos de los miembros tengan los mismos nombres que los propios miembros.

source: the *property* and the member must be defined in separate classes; for example, the *value* and *name* attributes are defined in the *Enum* class, and *Enum* subclasses can define members with the names ``value`` and ``name``.
es: el *property* y el miembro deben definirse en clases separadas; por ejemplo, los atributos *value* y *name* se definen en la clase *Enum* y las subclases *Enum* pueden definir miembros con los nombres ``value`` y ``name``.

source: A :keyword:`class` decorator specifically for enumerations. It searches an enumeration's :attr:`__members__`, gathering any aliases it finds; if any are found :exc:`ValueError` is raised with the details::
es: Un decorador :keyword:`class` específicamente para enumeraciones. Busca el :attr:`__members__` de una enumeración, recopilando cualquier alias que encuentre; si se encuentra alguno, se genera :exc:`ValueError` con los detalles:

source: A :keyword:`class` decorator specifically for enumerations. Members from :class:`EnumCheck` are used to specify which constraints should be checked on the decorated enumeration.
es: Un decorador :keyword:`class` específicamente para enumeraciones. Los miembros de :class:`EnumCheck` se utilizan para especificar qué restricciones deben verificarse en la enumeración decorada.

source: A decorator for use in enums: its target will become a member.
es: Un decorador para usar en enumeraciones: su objetivo se convertirá en miembro.

source: A decorator for use in enums: its target will not become a member.
es: Un decorador para usar en enumeraciones: su destino no se convertirá en miembro.

source: A decorator to change the :class:`str() <str>` and :func:`repr` of an enum to show its members as belonging to the module instead of its class. Should only be used when the enum members are exported to the module global namespace (see :class:`re.RegexFlag` for an example).
es: Un decorador para cambiar el :class:`str() <str>` y :func:`repr` de una enumeración para mostrar sus miembros como pertenecientes al módulo en lugar de a su clase. Solo debe usarse cuando los miembros de la enumeración se exportan al espacio de nombres global del módulo (consulte :class:`re.RegexFlag` para ver un ejemplo).

source: Return a list of all power-of-two integers contained in a flag *value*.
es: Retorna una lista de todos los enteros de potencia de dos contenidos en un indicador *value*.

source: Notes
es: Notas

source: :class:`IntEnum`, :class:`StrEnum`, and :class:`IntFlag`
es: :class:`IntEnum`, :class:`StrEnum` y :class:`IntFlag`

source: These three enum types are designed to be drop-in replacements for existing integer- and string-based values; as such, they have extra limitations:
es: Estos tres tipos de enumeración están diseñados para ser reemplazos directos de los valores existentes basados ​​en cadenas y enteros; como tales, tienen limitaciones adicionales:

source: ``__str__`` uses the value and not the name of the enum member
es: ``__str__`` usa el valor y no el nombre del miembro de enumeración

source: ``__format__``, because it uses ``__str__``, will also use the value of the enum member instead of its name
es: ``__format__``, debido a que usa ``__str__``, también usará el valor del miembro de enumeración en lugar de su nombre

source: If you do not need/want those limitations, you can either create your own base class by mixing in the ``int`` or ``str`` type yourself::
es: Si no necesita/quiere esas limitaciones, puede crear su propia clase base mezclando el tipo ``int`` o ``str`` usted mismo:

source: or you can reassign the appropriate :meth:`str`, etc., in your enum::
es: o puede reasignar el :meth:`str` apropiado, etc., en su enumeración::
