Repository: python/python-docs-es
Catalog: library/enum.po
Languages: es

source: :mod:`enum` --- Support for enumerations
es: :mod:`enum` — Soporte para enumeraciones

source: **Source code:** :source:`Lib/enum.py`
es: **Código fuente:** :source:`Lib/enum.py`

source: This page contains the API reference information. For tutorial information and discussion of more advanced topics, see
es: Esta página contiene la información de referencia de la API. Para obtener información sobre tutoriales y debates sobre temas más avanzados, consulte

source: :ref:`Basic Tutorial <enum-basic-tutorial>`
es: :ref:`Tutorial básico <enum-basic-tutorial>`

source: :ref:`Advanced Tutorial <enum-advanced-tutorial>`
es: :ref:`Tutorial avanzado <enum-advanced-tutorial>`

source: :ref:`Enum Cookbook <enum-cookbook>`
es: :ref:`Libro de recetas Enum <enum-cookbook>`

source: An enumeration:
es: Una enumeración:

source: is a set of symbolic names (members) bound to unique values
es: es un conjunto de nombres simbólicos (miembros) vinculados a valores únicos

source: can be iterated over to return its members in definition order
es: se puede iterar para retornar sus miembros en orden de definición

source: uses *call* syntax to return members by value
es: usa la sintaxis *call* para retornar miembros por valor

source: uses *index* syntax to return members by name
es: usa la sintaxis *index* para retornar miembros por nombre

source: Enumerations are created either by using :keyword:`class` syntax, or by using function-call syntax::
es: Las enumeraciones se crean mediante la sintaxis :keyword:`class` o mediante la sintaxis de llamadas a funciones:

source: Even though we can use :keyword:`class` syntax to create Enums, Enums are not normal Python classes. See :ref:`How are Enums different? <enum-class-differences>` for more details.
es: Aunque podemos usar la sintaxis :keyword:`class` para crear enumeraciones, las enumeraciones no son clases normales de Python. Ver :ref:`¿En qué se diferencian las enumeraciones? <enum-class-differences>` para más detalles.

source: Nomenclature
es: Nomenclatura

source: The class :class:`Color` is an *enumeration* (or *enum*)
es: La clase :class:`Color` es una *enumeración* (o *enum*)

source: The attributes :attr:`Color.RED`, :attr:`Color.GREEN`, etc., are *enumeration members* (or *members*) and are functionally constants.
es: Los atributos :attr:`Color.RED`, :attr:`Color.GREEN`, etc., son *enumeraciones miembros* (o *miembros*) y son funcionalmente constantes.

source: The enum members have *names* and *values* (the name of :attr:`Color.RED` is ``RED``, the value of :attr:`Color.BLUE` is ``3``, etc.)
es: Los miembros de la enumeración tienen *nombres* y *valores* (el nombre de :attr:`Color.RED` es ``ROJO``, el valor de :attr:`Color.BLUE` es ``3``, etc. )

source: Module Contents
es: Contenido del Módulo

source: The ``type`` for Enum and its subclasses.
es: El ``type`` para Enum y sus subclases.

source: Base class for creating enumerated constants.
es: Clase base para crear constantes enumeradas.

source: Base class for creating enumerated constants that are also subclasses of :class:`int`. (`Notes`_)
es: Clase base para crear constantes enumeradas que también son subclases de :class:`int`. (`Notes`_)

source: Base class for creating enumerated constants that are also subclasses of :class:`str`. (`Notes`_)
es: Clase base para crear constantes enumeradas que también son subclases de :class:`str`. (`Notes`_)

source: Base class for creating enumerated constants that can be combined using the bitwise operations without losing their :class:`Flag` membership.
es: Clase base para crear constantes enumeradas que se pueden combinar utilizando las operaciones *bitwise* sin perder su membresía :class:`Flag`.

source: Base class for creating enumerated constants that can be combined using the bitwise operators without losing their :class:`IntFlag` membership. :class:`IntFlag` members are also subclasses of :class:`int`. (`Notes`_)
es: Clase base para crear constantes enumeradas que se pueden combinar mediante los operadores bit a bit sin perder su pertenencia a :class:`IntFlag`. Los miembros :class:`IntFlag` también son subclases de :class:`int`. (`Notes`_)

source: Used by :class:`IntEnum`, :class:`StrEnum`, and :class:`IntFlag` to keep the :class:`str() <str>` of the mixed-in type.
es: Usado por :class:`IntEnum`, :class:`StrEnum` y :class:`IntFlag` para mantener el :class:`str() <str>` del tipo mixto.

source: An enumeration with the values ``CONTINUOUS``, ``NAMED_FLAGS``, and ``UNIQUE``, for use with :func:`verify` to ensure various constraints are met by a given enumeration.
es: Una enumeración con los valores ``CONTINUOUS``, ``NAMED_FLAGS`` y ``UNIQUE``, para usar con :func:`verify` para garantizar que una enumeración determinada cumpla varias restricciones.

source: An enumeration with the values ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP`` which allows for more fine-grained control over how invalid values are dealt with in an enumeration.
es: Una enumeración con los valores ``STRICT``, ``CONFORM``, ``EJECT`` y ``KEEP`` que permite un control más detallado sobre cómo se tratan los valores no válidos en una enumeración.

source: Instances are replaced with an appropriate value for Enum members. :class:`StrEnum` defaults to the lower-cased version of the member name, while other Enums default to 1 and increase from there.
es: Las instancias se reemplazan con un valor apropiado para los miembros de Enum. :class:`StrEnum` usa de manera predeterminada la versión en minúsculas del nombre del miembro, mientras que otras enumeraciones tienen el valor predeterminado de 1 y aumentan a partir de ahí.

source: Allows :class:`Enum` members to have attributes without conflicting with member names.
es: Permite que los miembros :class:`Enum` tengan atributos sin entrar en conflicto con los nombres de los miembros.

source: Enum class decorator that ensures only one name is bound to any one value.
es: El decorador de clase Enum que garantiza que solo un nombre esté vinculado a cualquier valor.

source: Enum class decorator that checks user-selectable constraints on an enumeration.
es: Decorador de clase Enum que verifica las restricciones seleccionables por el usuario en una enumeración.

source: Make ``obj`` a member. Can be used as a decorator.
es: Convierta a ``obj`` en miembro. Se puede utilizar como decorador.

source: Do not make ``obj`` a member. Can be used as a decorator.
es: No convierta a ``obj`` en miembro. Se puede utilizar como decorador.

source: Modify the :class:`str() <str>` and :func:`repr` of an enum to show its members as belonging to the module instead of its class. Should only be used if the enum members will be exported to the module global namespace.
es: Modifique :class:`str() <str>` y :func:`repr` de una enumeración para mostrar sus miembros como pertenecientes al módulo en lugar de a su clase. Solo debe usarse si los miembros de la enumeración se exportarán al espacio de nombres global del módulo.

source: Return a list of all power-of-two integers contained in a flag.
es: Retorna una lista de todos los enteros de potencia de dos contenidos en una bandera.

source: Data Types
es: Tipos de datos

source: *EnumType* is the :term:`metaclass` for *enum* enumerations. It is possible to subclass *EnumType* -- see :ref:`Subclassing EnumType <enumtype-examples>` for details.
es: *EnumType* es el :term:`metaclass` para enumeraciones *enum*. Es posible subclasificar *EnumType*; consulte :ref:`Subclassing EnumType <enumtype-examples>` para obtener más detalles.

source: *EnumType* is responsible for setting the correct :meth:`__repr__`, :meth:`__str__`, :meth:`__format__`, and :meth:`__reduce__` methods on the final *enum*, as well as creating the enum members, properly handling duplicates, providing iteration over the enum class, etc.
es: *EnumType* es responsable de configurar los métodos :meth:`__repr__`, :meth:`__str__`, :meth:`__format__` y :meth:`__reduce__` correctos en el *enum* final, así como de crear los miembros de enumeración, manejar correctamente los duplicados, proporcionar iteración sobre la clase de enumeración, etc.

source: Returns ``True`` if member belongs to the ``cls``::
es: Retorna ``True`` si el miembro pertenece a ``cls``::

source: In Python 3.12 it will be possible to check for member values and not just members; until then, a ``TypeError`` will be raised if a non-Enum-member is used in a containment check.
es: En Python 3.12, será posible verificar los valores de los miembros y no solo los miembros; hasta entonces, se generará un ``TypeError`` si se usa un miembro que no sea Enum en una verificación de contención.

source: Returns ``['__class__', '__doc__', '__members__', '__module__']`` and the names of the members in *cls*::
es: Retorna ``['__class__', '__doc__', '__members__', '__module__']`` y los nombres de los miembros en *cls*::

source: Returns the Enum member in *cls* matching *name*, or raises an :exc:`AttributeError`::
es: Retorna el miembro Enum en *cls* que coincide con *name*, o genera un :exc:`AttributeError`::

source: Returns the Enum member in *cls* matching *name*, or raises an :exc:`KeyError`::
es: Retorna el miembro Enum en *cls* que coincide con *name*, o genera un :exc:`KeyError`::

source: Returns each member in *cls* in definition order::
es: Retorna cada miembro en *cls* en orden de definición::

source: Returns the number of member in *cls*::
es: Retorna el número de miembro en *cls*::

source: Returns each member in *cls* in reverse definition order::
es: Retorna cada miembro en *cls* en orden de definición inverso:

source: *Enum* is the base class for all *enum* enumerations.
es: *Enum* es la clase base para todas las enumeraciones *enum*.

source: The name used to define the ``Enum`` member::
es: El nombre utilizado para definir el miembro ``Enum``::

source: The value given to the ``Enum`` member::
es: El valor dado al miembro ``Enum``:

source: Enum member values
es: Valores de miembros de Enum

source: Member values can be anything: :class:`int`, :class:`str`, etc.. If the exact value is unimportant you may use :class:`auto` instances and an appropriate value will be chosen for you. Care must be taken if you mix :class:`auto` with other values.
es: Los valores de los miembros pueden ser cualquier cosa: :class:`int`, :class:`str`, etc.. Si el valor exacto no es importante, puede usar instancias :class:`auto` y se elegirá un valor apropiado para usted. Se debe tener cuidado si se mezcla :class:`auto` con otros valores.

source: ``_ignore_`` is only used during creation and is removed from the enumeration once creation is complete.
es: ``_ignore_`` solo se usa durante la creación y se elimina de la enumeración una vez que se completa la creación.

source: ``_ignore_`` is a list of names that will not become members, and whose names will also be removed from the completed enumeration. See :ref:`TimePeriod <enum-time-period>` for an example.
es: ``_ignore_`` es una lista de nombres que no se convertirán en miembros y cuyos nombres también se eliminarán de la enumeración completa. Consulte :ref:`TimePeriod <enum-time-period>` para ver un ejemplo.

source: This method is called in two different ways:
es: Este método se llama de dos maneras diferentes:

source: to look up an existing member:
es: para buscar un miembro existente:

source: The enum class being called.
es: La clase de enumeración que se llama.

source: The value to lookup.
es: El valor a buscar.

source: to use the ``cls`` enum to create a new enum:
es: para usar la enumeración ``cls`` para crear una nueva enumeración:

source: The name of the new Enum to create.
es: El nombre del nuevo Enum para crear.

source: The names/values of the members for the new Enum.
es: Los nombres/valores de los miembros para el nuevo Enum.

source: The name of the module the new Enum is created in.
es: El nombre del módulo en el que se crea el nuevo Enum.

source: The actual location in the module where this Enum can be found.
es: La ubicación real en el módulo donde se puede encontrar este Enum.

source: A mix-in type for the new Enum.
es: Un tipo de mezcla para el nuevo Enum.

source: The first integer value for the Enum (used by :class:`auto`)
es: El primer valor entero para Enum (usado por :class:`auto`)

source: How to handle out-of-range values from bit operations (:class:`Flag` only)
es: Cómo manejar valores fuera de rango de operaciones de bits (solo :class:`Flag`)

source: Returns ``['__class__', '__doc__', '__module__', 'name', 'value']`` and any public methods defined on *self.__class__*::
es: Retorna ``['__class__', '__doc__', '__module__', 'name', 'value']`` y cualquier método público definido en *self.__class__*:

source: The name of the member being defined (e.g. 'RED').
es: El nombre del miembro que se está definiendo (por ejemplo, 'RED').

source: The start value for the Enum; the default is 1.
es: El valor inicial de Enum; el valor predeterminado es 1.

source: The number of members currently defined, not including this one.
es: El número de miembros actualmente definidos, sin incluir este.

source: A list of the previous values.
es: Una lista de los valores anteriores.

source: A *staticmethod* that is used to determine the next value returned by :class:`auto`::
es: Un *staticmethod* que se usa para determinar el siguiente valor retornado por :class:`auto`:

source: A *classmethod* that is used to further configure subsequent subclasses. By default, does nothing.
es: Un *classmethod* que se usa para configurar más subclases subsiguientes. Por defecto, no hace nada.

source: A *classmethod* for looking up values not found in *cls*. By default it does nothing, but can be overridden to implement custom search behavior::
es: Un *classmethod* para buscar valores que no se encuentran en *cls*. De forma predeterminada, no hace nada, pero se puede anular para implementar un comportamiento de búsqueda personalizado:

source: Returns the string used for *repr()* calls. By default, returns the *Enum* name, member name, and value, but can be overridden::
es: Retorna la cadena utilizada para las llamadas *repr()*. De forma predeterminada, retorna el nombre *Enum*, el nombre del miembro y el valor, pero se puede anular:

source: Returns the string used for *str()* calls. By default, returns the *Enum* name and member name, but can be overridden::
es: Retorna la cadena utilizada para las llamadas *str()*. De forma predeterminada, retorna el nombre *Enum* y el nombre del miembro, pero se puede anular:

source: Returns the string used for *format()* and *f-string* calls. By default, returns :meth:`__str__` returns, but can be overridden::
es: Retorna la cadena utilizada para las llamadas *format()* y *f-string*. De forma predeterminada, retorna :meth:`__str__`, pero se puede anular:

source: Using :class:`auto` with :class:`Enum` results in integers of increasing value, starting with ``1``.
es: El uso de :class:`auto` con :class:`Enum` da como resultado números enteros de valor creciente, comenzando con ``1``.

source: *IntEnum* is the same as *Enum*, but its members are also integers and can be used anywhere that an integer can be used. If any integer operation is performed with an *IntEnum* member, the resulting value loses its enumeration status.
es: *IntEnum* es lo mismo que *Enum*, pero sus miembros también son números enteros y se pueden usar en cualquier lugar donde se pueda usar un número entero. Si se realiza alguna operación con enteros con un miembro *IntEnum*, el valor resultante pierde su estado de enumeración.

source: Using :class:`auto` with :class:`IntEnum` results in integers of increasing value, starting with ``1``.
es: El uso de :class:`auto` con :class:`IntEnum` da como resultado números enteros de valor creciente, comenzando con ``1``.

source: :meth:`__str__` is now :func:`int.__str__` to better support the *replacement of existing constants* use-case. :meth:`__format__` was already :func:`int.__format__` for that same reason.
es: :meth:`__str__` ahora es :func:`int.__str__` para admitir mejor el caso de uso de *replacement of existing constants*. :meth:`__format__` ya era :func:`int.__format__` por la misma razón.

source: *StrEnum* is the same as *Enum*, but its members are also strings and can be used in most of the same places that a string can be used. The result of any string operation performed on or with a *StrEnum* member is not part of the enumeration.
es: *StrEnum* es lo mismo que *Enum*, pero sus miembros también son cadenas y se pueden usar en la mayoría de los mismos lugares en los que se puede usar una cadena. El resultado de cualquier operación de cadena realizada en o con un miembro *StrEnum* no forma parte de la enumeración.

source: There are places in the stdlib that check for an exact :class:`str` instead of a :class:`str` subclass (i.e. ``type(unknown) == str`` instead of ``isinstance(unknown, str)``), and in those locations you will need to use ``str(StrEnum.member)``.
es: Hay lugares en stdlib que buscan un :class:`str` exacto en lugar de una subclase :class:`str` (es decir, ``type(unknown) == str`` en lugar de ``isinstance(unknown, str)``), y en esos lugares necesitará usar ``str(StrEnum.member)``.

source: Using :class:`auto` with :class:`StrEnum` results in the lower-cased member name as the value.
es: El uso de :class:`auto` con :class:`StrEnum` da como resultado el nombre de miembro en minúsculas como valor.

source: :meth:`__str__` is :func:`str.__str__` to better support the *replacement of existing constants* use-case. :meth:`__format__` is likewise :func:`str.__format__` for that same reason.
es: :meth:`__str__` es :func:`str.__str__` para admitir mejor el caso de uso de *replacement of existing constants*. :meth:`__format__` también es :func:`str.__format__` por la misma razón.

source: *Flag* members support the bitwise operators ``&`` (*AND*), ``|`` (*OR*), ``^`` (*XOR*), and ``~`` (*INVERT*); the results of those operators are members of the enumeration.
es: Los miembros *Flag* admiten los operadores bit a bit ``&`` (*AND*), ``|`` (*OR*), ``^`` (*XOR*) y ``~`` (*INVERT*); los resultados de esos operadores son miembros de la enumeración.

source: Returns *True* if value is in self::
es: Retorna *True* si el valor está en sí mismo::

source: Returns all contained members::
es: Retorna todos los miembros contenidos::

source: Returns number of members in flag::
es: Retorna el número de miembros en la bandera::

source: Returns *True* if any members in flag, *False* otherwise::
es: Retorna *True* si hay algún miembro en la bandera, *False* de lo contrario:

source: Returns current flag binary or'ed with other::
es: Retorna la bandera actual binaria o con otra:

source: Returns current flag binary and'ed with other::
es: Retorna el binario de la bandera actual y se combina con otro::

source: Returns current flag binary xor'ed with other::
es: Retorna la bandera actual binaria xor'ed con otra:

source: Returns all the flags in *type(self)* that are not in self::
es: Retorna todas las banderas en *type(self)* que no están en uno mismo::

source: Function used to format any remaining unnamed numeric values. Default is the value's repr; common choices are :func:`hex` and :func:`oct`.
es: Función utilizada para dar formato a los valores numéricos restantes sin nombre. El valor predeterminado es la repr del valor; las opciones comunes son :func:`hex` y :func:`oct`.

source: Using :class:`auto` with :class:`Flag` results in integers that are powers of two, starting with ``1``.
es: El uso de :class:`auto` con :class:`Flag` da como resultado números enteros que son potencias de dos, comenzando con ``1``.

source: The *repr()* of zero-valued flags has changed. It is now::
es: El *repr()* de las banderas de valor cero ha cambiado. Esto es ahora::

source: *IntFlag* is the same as *Flag*, but its members are also integers and can be used anywhere that an integer can be used.
es: *IntFlag* es lo mismo que *Flag*, pero sus miembros también son números enteros y se pueden usar en cualquier lugar donde se pueda usar un número entero.

source: If any integer operation is performed with an *IntFlag* member, the result is not an *IntFlag*::
es: Si se realiza alguna operación con enteros con un miembro *IntFlag*, el resultado no es un *IntFlag*::

source: If a *Flag* operation is performed with an *IntFlag* member and:
es: Si se realiza una operación *Flag* con un miembro *IntFlag* y:

source: the result is a valid *IntFlag*: an *IntFlag* is returned
es: el resultado es un *IntFlag* válido: se retorna un *IntFlag*

source: the result is not a valid *IntFlag*: the result depends on the *FlagBoundary* setting
es: el resultado no es un *IntFlag* válido: el resultado depende de la configuración de *FlagBoundary*

source: The *repr()* of unnamed zero-valued flags has changed. It is now:
es: El *repr()* de indicadores de valor cero sin nombre ha cambiado. Esto es ahora:

source: Using :class:`auto` with :class:`IntFlag` results in integers that are powers of two, starting with ``1``.
es: El uso de :class:`auto` con :class:`IntFlag` da como resultado números enteros que son potencias de dos, comenzando con ``1``.

source: :class:`!ReprEum` uses the :meth:`repr() <Enum.__repr__>` of :class:`Enum`, but the :class:`str() <str>` of the mixed-in data type:
es: :class:`!ReprEum` usa el :meth:`repr() <Enum.__repr__>` de :class:`Enum`, pero el :class:`str() <str>` del tipo de datos mixto:

source: :meth:`!int.__str__` for :class:`IntEnum` and :class:`IntFlag`
es: :meth:`!int.__str__` para :class:`IntEnum` y :class:`IntFlag`

source: :meth:`!str.__str__` for :class:`StrEnum`
es: :meth:`!str.__str__` para :class:`StrEnum`

source: Inherit from :class:`!ReprEnum` to keep the :class:`str() <str> / :func:`format` of the mixed-in data type instead of using the :class:`Enum`-default :meth:`str() <Enum.__str__>`.
es: Heredar de :class:`!ReprEnum` para mantener :class:`str() <str> / :func:`format` del tipo de datos mixto en lugar de utilizar el :class:`Enum` por defecto :meth:`str() <Enum.__str__>`.

source: *EnumCheck* contains the options used by the :func:`verify` decorator to ensure various constraints; failed constraints result in a :exc:`ValueError`.
es: *EnumCheck* contiene las opciones utilizadas por el decorador :func:`verify` para garantizar diversas restricciones; las restricciones fallidas dan como resultado un :exc:`ValueError`.

source: Ensure that each value has only one name::
es: Asegúrese de que cada valor tenga un solo nombre:

source: Ensure that there are no missing values between the lowest-valued member and the highest-valued member::
es: Asegúrese de que no falten valores entre el miembro de menor valor y el miembro de mayor valor::

source: Ensure that any flag groups/masks contain only named flags -- useful when values are specified instead of being generated by :func:`auto`
es: Asegúrese de que los grupos/máscaras de banderas contengan solo banderas con nombre, lo cual es útil cuando se especifican valores en lugar de generarlos :func:`auto`.

source: CONTINUOUS and NAMED_FLAGS are designed to work with integer-valued members.
es: CONTINUOUS y NAMED_FLAGS están diseñados para funcionar con miembros con valores enteros.

source: *FlagBoundary* controls how out-of-range values are handled in *Flag* and its subclasses.
es: *FlagBoundary* controla cómo se manejan los valores fuera de rango en *Flag* y sus subclases.

source: Out-of-range values cause a :exc:`ValueError` to be raised. This is the default for :class:`Flag`::
es: Los valores fuera de rango hacen que se genere un :exc:`ValueError`. Este es el valor predeterminado para :class:`Flag`::

source: Out-of-range values have invalid values removed, leaving a valid *Flag* value::
es: Los valores fuera de rango tienen valores no válidos eliminados, dejando un valor *Flag* válido:
