Repository: python/python-docs-es
Catalog: library/exceptions.po
Languages: es

source: Built-in Exceptions
es: Excepciones incorporadas

source: In Python, all exceptions must be instances of a class that derives from :class:`BaseException`. In a :keyword:`try` statement with an :keyword:`except` clause that mentions a particular class, that clause also handles any exception classes derived from that class (but not exception classes from which *it* is derived). Two exception classes that are not related via subclassing are never equivalent, even if they have the same name.
es: En Python, todas las excepciones deben ser instancias de una clase que se derive de :class:`BaseException`. En una instrucción :keyword:`try` con una cláusula :keyword:`except` que menciona una clase determinada, esa cláusula también controla las clases de excepción derivadas de esa clase (excepto las clases de excepción de las que se deriva *it*). Dos clases de excepción que no están relacionadas mediante subclases nunca son equivalentes, incluso si tienen el mismo nombre.

source: The built-in exceptions listed below can be generated by the interpreter or built-in functions. Except where mentioned, they have an "associated value" indicating the detailed cause of the error. This may be a string or a tuple of several items of information (e.g., an error code and a string explaining the code). The associated value is usually passed as arguments to the exception class's constructor.
es: Las excepciones predefinidas enumeradas a continuación pueden ser generadas por el intérprete o funciones predefinidas. Excepto donde se mencione lo contrario, tienen un *associated value* que indica la causa detallada del error. Esto podría una cadena de caracteres o una tupla elementos con grandes elementos de información (por ejemplo, un código de error y una cadena que explica el código). El valor asociado generalmente se pasa como argumentos al constructor de la clase de excepción.

source: User code can raise built-in exceptions. This can be used to test an exception handler or to report an error condition "just like" the situation in which the interpreter raises the same exception; but beware that there is nothing to prevent user code from raising an inappropriate error.
es: El código de usuario puede lanzar excepciones predefinidas. Esto puede ser usado para probar un gestor de excepciones o para notificar una condición de error "igual" a la situación en la cual el intérprete lance la misma excepción; pero tenga en cuenta que no hay nada que impida que el código del usuario produzca un error inapropiado.

source: The built-in exception classes can be subclassed to define new exceptions; programmers are encouraged to derive new exceptions from the :exc:`Exception` class or one of its subclasses, and not from :exc:`BaseException`. More information on defining exceptions is available in the Python Tutorial under :ref:`tut-userexceptions`.
es: Las clases de excepción predefinidas pueden ser usadas como subclases para definir otras nuevas; se recomienda a los programadores que deriven nuevas excepciones a partir de la clase :exc:`Exception` o de una de sus subclases, y no de :exc:`BaseException`. Hay disponible más información sobre la definición de excepciones en el Tutorial de Python en :ref:`tut-userexceptions`.

source: Exception context
es: Contexto de una excepción

source: When raising a new exception while another exception is already being handled, the new exception's :attr:`__context__` attribute is automatically set to the handled exception. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used.
es: Al lanzar una nueva excepción mientras otra excepción está siendo manejada, el atributo :attr:`__context__` de la nueva excepción es automáticamente asignado a la excepción manejada. Una excepción puede ser manejada cuando se utiliza la cláusula :keyword:`except` o :keyword:`finally`, o con la sentencia :keyword:`with`.

source: This implicit exception context can be supplemented with an explicit cause by using :keyword:`!from` with :keyword:`raise`::
es: Este contexto de excepción implícita se puede complementar con una causa explícita usando :keyword:`!from` con :keyword:`raise`::

source: The expression following :keyword:`from<raise>` must be an exception or ``None``. It will be set as :attr:`__cause__` on the raised exception. Setting :attr:`__cause__` also implicitly sets the :attr:`__suppress_context__` attribute to ``True``, so that using ``raise new_exc from None`` effectively replaces the old exception with the new one for display purposes (e.g. converting :exc:`KeyError` to :exc:`AttributeError`), while leaving the old exception available in :attr:`__context__` for introspection when debugging.
es: La expresión que sigue a :keyword:`from<raise>` debe ser una excepción o ``None``. Se establecerá como :attr:`__cause__` en la excepción generada. La configuración de :attr:`__cause__` también establece implícitamente el atributo :attr:`__suppress_context__` en ``True``, de modo que el uso de ``raise new_exc from None`` reemplaza efectivamente la excepción anterior con la nueva para fines de visualización (por ejemplo, conversión de :exc:`KeyError` a :exc:`AttributeError`), dejando la excepción anterior disponible en :attr:`__context__` para introspección durante la depuración.

source: The default traceback display code shows these chained exceptions in addition to the traceback for the exception itself. An explicitly chained exception in :attr:`__cause__` is always shown when present. An implicitly chained exception in :attr:`__context__` is shown only if :attr:`__cause__` is :const:`None` and :attr:`__suppress_context__` is false.
es: La visualización por defecto de la traza de error muestra estas excepciones encadenadas además de la traza de la propia excepción. Siempre se muestra una excepción encadenada explícitamente en :attr:`__cause__` cuando está presente. Una excepción implícitamente encadenada en :attr:`__context__` solo se muestra si :attr:`__cause__` es :const:`None` y :attr:`__suppress_context__` es falso.

source: In either case, the exception itself is always shown after any chained exceptions so that the final line of the traceback always shows the last exception that was raised.
es: En cualquier caso, la excepción en sí siempre se muestra después de cualquier excepción encadenada para que la línea final del seguimiento siempre muestre la última excepción que se generó.

source: Inheriting from built-in exceptions
es: Heredando de excepciones incorporadas

source: User code can create subclasses that inherit from an exception type. It's recommended to only subclass one exception type at a time to avoid any possible conflicts between how the bases handle the ``args`` attribute, as well as due to possible memory layout incompatibilities.
es: El código del usuario puede crear subclases que heredan de una excepción. Se recomienda heredar solo de una clase de tipo excepción a la vez para evitar cualquier conflicto posible en el manejo del atributo ``args`` por parte de las clases base, como también por posibles incompatibilidades en de la memoria.

source: Most built-in exceptions are implemented in C for efficiency, see: :source:`Objects/exceptions.c`. Some have custom memory layouts which makes it impossible to create a subclass that inherits from multiple exception types. The memory layout of a type is an implementation detail and might change between Python versions, leading to new conflicts in the future. Therefore, it's recommended to avoid subclassing multiple exception types altogether.
es: La mayoría de las excepciones integradas están implementadas en C por eficiencia, vea: :source:`Objects/exceptions.c`. Algunas tienen distribuciones de memoria personalizadas, lo que hace imposible crear una subclase que herede de múltiples tipos de excepciones. La distribución de memoria de un tipo es un detalle de implementación y podría cambiar entre versiones de Python, llevando a nuevos conflictos en el futuro. Por lo tanto, se recomienda evitar la herencia de múltiples tipos de excepción.

source: Base classes
es: Clases base

source: The following exceptions are used mostly as base classes for other exceptions.
es: Las siguientes excepciones se utilizan principalmente como clases base para otras excepciones.

source: The base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes (for that, use :exc:`Exception`). If :func:`str` is called on an instance of this class, the representation of the argument(s) to the instance are returned, or the empty string when there were no arguments.
es: La clase base para todas las excepciones predefinidas. No está pensada para ser heredada directamente por las clases definidas por el usuario (para eso, use :exc:`Exception`). Si se llama a :func:`str` en una instancia de esta clase, se retorna la representación de los argumentos de la instancia o la cadena vacía cuando no había argumentos.

source: The tuple of arguments given to the exception constructor. Some built-in exceptions (like :exc:`OSError`) expect a certain number of arguments and assign a special meaning to the elements of this tuple, while others are usually called only with a single string giving an error message.
es: La tupla de argumentos dada al constructor de excepción. Algunas excepciones predefinidas (como :exc:`OSError`) esperan un cierto número de argumentos y asignan un significado especial a los elementos de esta tupla, mientras que otras normalmente se llaman solo con una sola cadena que da un mensaje de error.

source: This method sets *tb* as the new traceback for the exception and returns the exception object. It was more commonly used before the exception chaining features of :pep:`3134` became available. The following example shows how we can convert an instance of ``SomeException`` into an instance of ``OtherException`` while preserving the traceback. Once raised, the current frame is pushed onto the traceback of the ``OtherException``, as would have happened to the traceback of the original ``SomeException`` had we allowed it to propagate to the caller. ::
es: Este método establece *tb* como el nuevo rastreo para la excepción y retorna el objeto de excepción. Se usaba con más frecuencia antes de que las características de encadenamiento de excepciones de :pep:`3134` estuvieran disponibles. El siguiente ejemplo muestra cómo podemos convertir una instancia de ``SomeException`` en una instancia de ``OtherException`` mientras se conserva el rastreo. Una vez generado, el marco actual se inserta en el rastreo del ``OtherException``, como habría sucedido con el rastreo del ``SomeException`` original si hubiéramos permitido que se propagara al llamador. ::

source: Add the string ``note`` to the exception's notes which appear in the standard traceback after the exception string. A :exc:`TypeError` is raised if ``note`` is not a string.
es: Agrega la cadena ``note`` a las notas de la excepción, las cuales aparecen en el rastreo después de la cadena de la excepción. Se lanza un :exc:`TypeError` si ``note`` no es una cadena de caracteres.

source: A list of the notes of this exception, which were added with :meth:`add_note`. This attribute is created when :meth:`add_note` is called.
es: Una lista de las notas de esta excepción, las cuales fueron añadidas con el método :meth:`add_note`. Este atributo es creado cuando se llama a :meth:`add_note`.

source: All built-in, non-system-exiting exceptions are derived from this class. All user-defined exceptions should also be derived from this class.
es: Todas las excepciones predefinidas *non-system-exiting*, que no salen del sistema se derivan de esta clase. Todas las excepciones definidas por el usuario también deben derivarse de esta clase.

source: The base class for those built-in exceptions that are raised for various arithmetic errors: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
es: La clase base para las excepciones predefinidas que se generan para varios errores aritméticos: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.

source: Raised when a :ref:`buffer <bufferobjects>` related operation cannot be performed.
es: Se genera cuando :ref:`buffer <bufferobjects>` no se puede realizar una operación relacionada.

source: The base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid: :exc:`IndexError`, :exc:`KeyError`. This can be raised directly by :func:`codecs.lookup`.
es: La clase base para las excepciones que se generan cuando una clave o índice utilizado en un mapa o secuencia que no es válido: :exc:`IndexError`, :exc:`KeyError`. Esto se puede lanzar directamente por :func:`codecs.lookup`.

source: Concrete exceptions
es: Excepciones específicas

source: The following exceptions are the exceptions that are usually raised.
es: Las siguientes excepciones son las excepciones que normalmente se generan.

source: Raised when an :keyword:`assert` statement fails.
es: Se genera cuando se produce un error en una instrucción :keyword:`assert`.

source: Raised when an attribute reference (see :ref:`attribute-references`) or assignment fails. (When an object does not support attribute references or attribute assignments at all, :exc:`TypeError` is raised.)
es: Se genera cuando se produce un error en una referencia de atributo (ver :ref:`attribute-references`) o la asignación falla. (Cuando un objeto no admite referencias de atributos o asignaciones de atributos en absoluto, se genera :exc:`TypeError`.)

source: The :attr:`name` and :attr:`obj` attributes can be set using keyword-only arguments to the constructor. When set they represent the name of the attribute that was attempted to be accessed and the object that was accessed for said attribute, respectively.
es: Los atributos :attr:`name` y :attr:`obj` se pueden configurar utilizando argumentos de solo palabras clave para el constructor. Cuando se establecen, representan el nombre del atributo al que se intentó acceder y el objeto al que se accedió para dicho atributo, respectivamente.

source: Added the :attr:`name` and :attr:`obj` attributes.
es: Se agregaron los atributos :attr:`name` y :attr:`obj`.

source: Raised when the :func:`input` function hits an end-of-file condition (EOF) without reading any data. (N.B.: the :meth:`io.IOBase.read` and :meth:`io.IOBase.readline` methods return an empty string when they hit EOF.)
es: Se genera cuando la función :func:`input` alcanza una condición de fin de archivo (EOF) sin leer ningún dato. (Note que el :meth:`io. IOBase.read` y :meth:`io.IOBase.readline` retornan una cadena vacía cuando llegan a EOF.)

source: Not currently used.
es: No se usa actualmente.

source: Raised when a :term:`generator` or :term:`coroutine` is closed; see :meth:`generator.close` and :meth:`coroutine.close`. It directly inherits from :exc:`BaseException` instead of :exc:`Exception` since it is technically not an error.
es: Se genera cuando un :term:`generator` o :term:`coroutine` está cerrado; ver :meth:`generator.close` y :meth:`coroutine.close`. Hereda directamente de :exc:`BaseException` en lugar de :exc:`Exception` ya que técnicamente no es un error.

source: Raised when the :keyword:`import` statement has troubles trying to load a module. Also raised when the "from list" in ``from ... import`` has a name that cannot be found.
es: Se genera cuando la instrucción :keyword:`import` tiene problemas al intentar cargar un módulo. También se produce cuando la *from list* en ``from ... import`` tiene un nombre que no se puede encontrar.

source: The :attr:`name` and :attr:`path` attributes can be set using keyword-only arguments to the constructor. When set they represent the name of the module that was attempted to be imported and the path to any file which triggered the exception, respectively.
es: Los atributos :attr:`name` y :attr:`path` solo se pueden establecer utilizando argumentos de palabra clave en el constructor. Cuando se establece, representan el nombre del módulo que se intentó importar y la ruta de acceso a cualquier archivo que desencadenó la excepción, respectivamente.

source: Added the :attr:`name` and :attr:`path` attributes.
es: Se han añadido los atributos :attr:`name` y :attr:`path`.

source: A subclass of :exc:`ImportError` which is raised by :keyword:`import` when a module could not be located. It is also raised when ``None`` is found in :data:`sys.modules`.
es: Una subclase de :exc:`ImportError` que se genera mediante :keyword:`import` cuando no se pudo encontrar un módulo. También se genera cuando ``None`` se encuentra en :data:`sys.modules`.

source: Raised when a sequence subscript is out of range. (Slice indices are silently truncated to fall in the allowed range; if an index is not an integer, :exc:`TypeError` is raised.)
es: Se genera cuando un subíndice de secuencia está fuera del rango. (Los índices de la rebanada son truncados silenciosamente para caer en el intervalo permitido; si un índice no es un entero, se genera :exc:`TypeError`.)

source: Raised when a mapping (dictionary) key is not found in the set of existing keys.
es: Se genera cuando no se encuentra una clave de asignación (diccionario) en el conjunto de claves existentes (mapa).

source: Raised when the user hits the interrupt key (normally :kbd:`Control-C` or :kbd:`Delete`). During execution, a check for interrupts is made regularly. The exception inherits from :exc:`BaseException` so as to not be accidentally caught by code that catches :exc:`Exception` and thus prevent the interpreter from exiting.
es: Se genera cuando el usuario pulsa la tecla de interrupción (normalmente :kbd:`Control-C` o :kbd:`Delete`). Durante la ejecución, se realiza una comprobación de interrupciones con regularidad. La excepción hereda de :exc:`BaseException` para no ser detectada de forma accidental por :exc:`Exception` y, por lo tanto, prevenir que el intérprete salga.

source: Catching a :exc:`KeyboardInterrupt` requires special consideration. Because it can be raised at unpredictable points, it may, in some circumstances, leave the running program in an inconsistent state. It is generally best to allow :exc:`KeyboardInterrupt` to end the program as quickly as possible or avoid raising it entirely. (See :ref:`handlers-and-exceptions`.)
es: Capturar una :exc:`KeyboardInterrupt` requiere especial consideración. Debido a que puede ser lanzada en puntos impredecibles, puede, en algunas circunstancias, dejar al programa en ejecución en un estado inconsistente. Por lo general, es mejor permitir que :exc:`KeyboardInterrupt` termine el programa tan pronto como sea o evitar lanzarla por completo. (Vea :ref:`handlers-and-exceptions`.)

source: Raised when an operation runs out of memory but the situation may still be rescued (by deleting some objects). The associated value is a string indicating what kind of (internal) operation ran out of memory. Note that because of the underlying memory management architecture (C's :c:func:`malloc` function), the interpreter may not always be able to completely recover from this situation; it nevertheless raises an exception so that a stack traceback can be printed, in case a run-away program was the cause.
es: Se genera cuando una operación se queda sin memoria pero la situación aún puede ser recuperada (eliminando algunos objetos). El valor asociado es una cadena que indica que tipo de operación (interna) se quedó sin memoria. Tenga en cuenta que debido a la arquitectura de administración de memoria (función :c:func:`malloc` de C), el intérprete no siempre puede recuperarse completamente de esta situación; sin embargo, plantea una excepción para que se pueda imprimir un seguimiento de la pila, en caso de que un programa fuera de servicio fuera lo causa.

source: Raised when a local or global name is not found. This applies only to unqualified names. The associated value is an error message that includes the name that could not be found.
es: Se genera cuando no se encuentra un nombre local o global. Esto se aplica solo a nombres no calificados. El valor asociado es un mensaje de error que incluye el nombre que no se pudo encontrar.

source: The :attr:`name` attribute can be set using a keyword-only argument to the constructor. When set it represent the name of the variable that was attempted to be accessed.
es: El atributo :attr:`name` se puede establecer utilizando un argumento de solo palabra clave para el constructor. Cuando se establece, representa el nombre de la variable a la que se intentó acceder.

source: Added the :attr:`name` attribute.
es: Se agregó el atributo :attr:`name`.

source: This exception is derived from :exc:`RuntimeError`. In user defined base classes, abstract methods should raise this exception when they require derived classes to override the method, or while the class is being developed to indicate that the real implementation still needs to be added.
es: Esta excepción se deriva de :exc:`RuntimeError`. En las clases base definidas por el usuario, los métodos abstractos deberían lanzar esta excepción cuando requieren clases derivadas para anular el método, o mientras se desarrolla la clase para indicar que la implementación real aún necesita ser agregada.

source: It should not be used to indicate that an operator or method is not meant to be supported at all -- in that case either leave the operator / method undefined or, if a subclass, set it to :data:`None`.
es: No debe usarse para indicar que un operador o método no debe ser admitido en absoluto -- en ese caso, deje el operador / método sin definir o, si es una subclase, se establece en :data:`None`.

source: ``NotImplementedError`` and ``NotImplemented`` are not interchangeable, even though they have similar names and purposes. See :data:`NotImplemented` for details on when to use it.
es: ``NotImplementedError`` y ``NotImplemented`` no son intercambiables, a pesar de que tienen nombres y propósitos similares. Consulte :data:`NotImplemented` para obtener detalles sobre cuándo usarlo.

source: This exception is raised when a system function returns a system-related error, including I/O failures such as "file not found" or "disk full" (not for illegal argument types or other incidental errors).
es: Esta excepción se produce cuando una función del sistema retorna un error relacionado con el sistema, que incluye fallas de E/S como ``file not found`` o ``disk full`` (no para tipos de argumentos ilegales u otros errores incidentales).

source: The second form of the constructor sets the corresponding attributes, described below. The attributes default to :const:`None` if not specified. For backwards compatibility, if three arguments are passed, the :attr:`~BaseException.args` attribute contains only a 2-tuple of the first two constructor arguments.
es: La segunda forma del constructor establece los atributos correspondientes, que se describen a continuación. Los atributos predeterminados son :const:`None` si no se especifican. Para compatibilidad con versiones anteriores, si se pasan tres argumentos, el atributo :attr:`~BaseException.args` contiene solo una tupla de 2 de los dos primeros argumentos del constructor.

source: The constructor often actually returns a subclass of :exc:`OSError`, as described in `OS exceptions`_ below. The particular subclass depends on the final :attr:`.errno` value. This behaviour only occurs when constructing :exc:`OSError` directly or via an alias, and is not inherited when subclassing.
es: El constructor a menudo retorna una subclase de :exc:`OSError`, como se describe en `OS exceptions`_ a continuación. La subclase particular depende del valor final :attr:`.errno`. Este comportamiento solo ocurre cuando se construye :exc:`OSError` directamente o mediante un alias, y no se hereda al derivar.
