Repository: python/python-docs-es
Catalog: library/exceptions.po
Languages: es

source: Raised when a file or directory is requested but doesn't exist. Corresponds to :c:data:`errno` :py:data:`~errno.ENOENT`.
es: Se genera cuando se solicita un archivo o directorio pero no existe. Corresponde a :c:data:`errno` :py:data:`~errno.ENOENT`.

source: Raised when a system call is interrupted by an incoming signal. Corresponds to :c:data:`errno` :py:data:`~errno.EINTR`.
es: Se genera cuando una llamada entrante interrumpe una llamada del sistema. Corresponde a :c:data:`errno` :py:data:`~errno.EINTR`.

source: Python now retries system calls when a syscall is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
es: Python ahora vuelve a intentar las llamadas del sistema cuando una señal interrumpe un *syscall*, excepto si el gestor de señales lanza una excepción (ver :pep:`475` para la justificación), en lugar de lanzar :exc:`InterruptedError`.

source: Raised when a file operation (such as :func:`os.remove`) is requested on a directory. Corresponds to :c:data:`errno` :py:data:`~errno.EISDIR`.
es: Se genera cuando se solicita una operación de archivo (como :func:`os.remove`) en un directorio. Corresponde a: :c:data:`errno` :py:data:`~errno.EISDIR`.

source: Raised when a directory operation (such as :func:`os.listdir`) is requested on something which is not a directory. On most POSIX platforms, it may also be raised if an operation attempts to open or traverse a non-directory file as if it were a directory. Corresponds to :c:data:`errno` :py:data:`~errno.ENOTDIR`.
es: Se genera cuando se solicita una operación de directorio (como :func:`os.listdir`) en algo que no es un directorio. En la mayoría de las plataformas POSIX, también se puede lanzar si una operación intenta abrir o recorrer un archivo que no es de directorio como si fuera un directorio. Corresponde a :c:data:`errno` :py:data:`~errno.ENOTDIR`.

source: Raised when trying to run an operation without the adequate access rights - for example filesystem permissions. Corresponds to :c:data:`errno` :py:data:`~errno.EACCES`, :py:data:`~errno.EPERM`, and :py:data:`~errno.ENOTCAPABLE`.
es: Se genera cuando se intenta ejecutar una operación sin los permisos de acceso adecuados - por ejemplo permisos del sistema de archivos. Corresponde a :c:data:`errno` :py:data:`~errno.EACCES`, :py:data:`~errno.EPERM`, y :py:data:`~errno.ENOTCAPABLE`.

source: WASI's :py:data:`~errno.ENOTCAPABLE` is now mapped to :exc:`PermissionError`.
es: WASI's :py:data:`~errno.ENOTCAPABLE` ahora se mapea a :exc:`PermissionError`.

source: Raised when a given process doesn't exist. Corresponds to :c:data:`errno` :py:data:`~errno.ESRCH`.
es: Generado cuando un proceso dado no existe. Corresponde a :c:data:`errno` :py:data:`~errno.ESRCH`.

source: Raised when a system function timed out at the system level. Corresponds to :c:data:`errno` :py:data:`~errno.ETIMEDOUT`.
es: Se genera cuando se agota el tiempo de espera de una función del sistema a nivel del sistema. Corresponde a :c:data:`errno` :py:data:`~errno.ETIMEDOUT`.

source: All the above :exc:`OSError` subclasses were added.
es: Por lo anterior se agregaron las subclases :exc:`OSError`.

source: :pep:`3151` - Reworking the OS and IO exception hierarchy
es: :pep:`3151` - Reelaborando el sistema operativo y la jerarquía de excepciones E/S

source: Warnings
es: Advertencias

source: The following exceptions are used as warning categories; see the :ref:`warning-categories` documentation for more details.
es: Las siguientes excepciones se utilizan como categorías de advertencia; consulte la documentación de :ref:`warning-categories` para obtener más detalles.

source: Base class for warning categories.
es: Clase base para categorías de advertencia.

source: Base class for warnings generated by user code.
es: Clase base para advertencias generadas por código de usuario.

source: Base class for warnings about deprecated features when those warnings are intended for other Python developers.
es: Clase base para advertencias sobre características obsoletas cuando esas advertencias están destinadas a otros desarrolladores de Python.

source: Ignored by the default warning filters, except in the ``__main__`` module (:pep:`565`). Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
es: Ignorado por los filtros de advertencia predeterminados, excepto en el módulo ``__main__`` (:pep:`565`). Habilitando :ref:`Modo Desarrollo de Python <devmode>` muestra esta advertencia.

source: The deprecation policy is described in :pep:`387`.
es: La política de obsolescencia se describe en :pep:`387`.

source: Base class for warnings about features which are obsolete and expected to be deprecated in the future, but are not deprecated at the moment.
es: Clase base para advertencias sobre características que están obsoletas y que se espera que sean obsoletas en el futuro, pero que no lo son en este momento.

source: This class is rarely used as emitting a warning about a possible upcoming deprecation is unusual, and :exc:`DeprecationWarning` is preferred for already active deprecations.
es: Esta clase rara vez se usa para emitir una advertencia sobre una posible desaprobación próxima es inusual, y :exc:`DeprecationWarning` se prefiere para las desaprobaciones ya activas.

source: Ignored by the default warning filters. Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
es: Ignorado por los filtros de advertencia predeterminados. Habilitando :ref:`Modo Desarrollo de Python <devmode>` muestra esta advertencia.

source: Base class for warnings about dubious syntax.
es: Clase base para advertencias sobre sintaxis dudosa.

source: Base class for warnings about dubious runtime behavior.
es: Clase base para advertencias sobre comportamiento dudoso en tiempo de ejecución.

source: Base class for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
es: Clase base para advertencias sobre características en desuso cuando esas advertencias están destinadas a usuarios finales de aplicaciones escritas en Python.

source: Base class for warnings about probable mistakes in module imports.
es: Clase base para advertencias sobre posibles errores en la importación de módulos.

source: Base class for warnings related to Unicode.
es: Clase base para advertencias relacionadas con Unicode.

source: Base class for warnings related to encodings.
es: Clase base para advertencias relacionadas con codificaciones.

source: See :ref:`io-encoding-warning` for details.
es: Consulte :ref:`io-encoding-warning` para obtener más detalles.

source: Base class for warnings related to :class:`bytes` and :class:`bytearray`.
es: Clase base para advertencias relacionadas con :class:`bytes` y :class:`bytearray`.

source: Base class for warnings related to resource usage.
es: Clase base para advertencias relacionadas con el uso de recursos.

source: Exception groups
es: Grupos de excepciones

source: The following are used when it is necessary to raise multiple unrelated exceptions. They are part of the exception hierarchy so they can be handled with :keyword:`except` like all other exceptions. In addition, they are recognised by :keyword:`except*<except_star>`, which matches their subgroups based on the types of the contained exceptions.
es: Las siguientes se utilizan cuando es necesario lanzar múltiples excepciones no relacionadas. Forman parte de la jerarquía de excepciones, por lo que pueden ser manejadas con :keyword:`except` como todas las demás excepciones. Además, son reconocidas por :keyword:`except*<except_star>`, lo que hace coincidir sus subgrupos basándose en los tipos de las excepciones contenidas.

source: Both of these exception types wrap the exceptions in the sequence ``excs``. The ``msg`` parameter must be a string. The difference between the two classes is that :exc:`BaseExceptionGroup` extends :exc:`BaseException` and it can wrap any exception, while :exc:`ExceptionGroup` extends :exc:`Exception` and it can only wrap subclasses of :exc:`Exception`. This design is so that ``except Exception`` catches an :exc:`ExceptionGroup` but not :exc:`BaseExceptionGroup`.
es: Ambos tipos de excepción envuelven las excepciones en la secuencia ``excs``. El parámetro ``msg`` debe ser una cadena de caracteres. La diferencia entre las dos clases es que :exc:`BaseExceptionGroup` extiende a :exc:`BaseException` y puede envolver cualquier excepción, mientras que :exc:`ExceptionGroup` extiende a :exc:`Exception` y solo puede envolver subclases de :exc:`Exception`. Este diseño está pensado para que ``except Exception`` capture un :exc:`ExceptionGroup` pero no :exc:`BaseExceptionGroup`

source: The :exc:`BaseExceptionGroup` constructor returns an :exc:`ExceptionGroup` rather than a :exc:`BaseExceptionGroup` if all contained exceptions are :exc:`Exception` instances, so it can be used to make the selection automatic. The :exc:`ExceptionGroup` constructor, on the other hand, raises a :exc:`TypeError` if any contained exception is not an :exc:`Exception` subclass.
es: El constructor :exc:`BaseExceptionGroup` retorna una :exc:`ExceptionGroup` en lugar de una :exc:`BaseExceptionGroup` si todas las excepciones contenidas son instancias de :exc:`Exception` , por lo que puede utilizarse para hacer la selección automática. El constructor :exc:`ExceptionGroup`, por su parte, lanza un :exc:`TypeError` si alguna de las excepciones contenidas no es una subclase de :exc:`Exception`.

source: The ``msg`` argument to the constructor. This is a read-only attribute.
es: El argumento ``msg`` para el constructor. Este atributo es de sólo lectura.

source: A tuple of the exceptions in the ``excs`` sequence given to the constructor. This is a read-only attribute.
es: Una tupla de la excepciones en la secuencia ``excs`` pasada al constructor. Este atributo es de sólo lectura.

source: Returns an exception group that contains only the exceptions from the current group that match *condition*, or ``None`` if the result is empty.
es: Retorna un grupo de excepciones que contiene sólo las excepciones del grupo actual que cumplen con *condition*, o ``None`` si el resultado está vacío.

source: The condition can be either a function that accepts an exception and returns true for those that should be in the subgroup, or it can be an exception type or a tuple of exception types, which is used to check for a match using the same check that is used in an ``except`` clause.
es: La condición puede ser una función que acepta una excepción y retorna *True* para aquellas que deberían estar en el subgrupo, o puede ser un tipo de excepción o una tupla de tipos de excepción, que se utiliza para comprobar una coincidencia utilizando la misma comprobación que se utiliza en una cláusula ``except``.

source: The nesting structure of the current exception is preserved in the result, as are the values of its :attr:`message`, :attr:`__traceback__`, :attr:`__cause__`, :attr:`__context__` and :attr:`__notes__` fields. Empty nested groups are omitted from the result.
es: La estructura de anidamiento de la excepción actual se conserva en el resultado, así como también los valores de sus campos :attr:`message`, :attr:`__traceback__`, :attr:`__cause__`, :attr:`__context__` y :attr:`__notes__`. Los grupos anidados vacíos son omitidos del resultado.

source: The condition is checked for all exceptions in the nested exception group, including the top-level and any nested exception groups. If the condition is true for such an exception group, it is included in the result in full.
es: La condición se comprueba para todas las excepciones del grupo de excepción anidado, incluyendo el nivel superior y cualquier grupo de excepción anidado. Si la condición es verdadera para dicho grupo de excepción, se incluye en el resultado en su totalidad.

source: Like :meth:`subgroup`, but returns the pair ``(match, rest)`` where ``match`` is ``subgroup(condition)`` and ``rest`` is the remaining non-matching part.
es: Al igual que :meth:`subgroup`, pero retorna el par ``(match, rest)`` donde ``match`` es ``subgroup(condition)`` y ``rest`` es la parte restante que no coincide.

source: Returns an exception group with the same :attr:`message`, :attr:`__traceback__`, :attr:`__cause__`, :attr:`__context__` and :attr:`__notes__` but which wraps the exceptions in ``excs``.
es: Retorna un grupo de excepción con los mismos :attr:`message`, :attr:`__traceback__`, :attr:`__cause__`, :attr:`__context__` y :attr:`__notes__` pero que envuelve las excepciones en ``excs``.

source: This method is used by :meth:`subgroup` and :meth:`split`. A subclass needs to override it in order to make :meth:`subgroup` and :meth:`split` return instances of the subclass rather than :exc:`ExceptionGroup`. ::
es: Este método es usado por :meth:`subgroup` y :meth:`split`. Se necesita una subclase que lo sobrescriba para que :meth:`subgroup` y :meth:`split` retornan instancias de la subclase en lugar de :exc:`ExceptionGroup`. ::

source: Exception hierarchy
es: Jerarquía de excepción

source: The class hierarchy for built-in exceptions is:
es: La jerarquía de clases para las excepciones incorporadas es:
