Repository: python/python-docs-es
Catalog: library/exceptions.po
Languages: es

source: A numeric error code from the C variable :c:data:`errno`.
es: Un código de error numérico de la variable C, :c:data:`errno`.

source: Under Windows, this gives you the native Windows error code. The :attr:`.errno` attribute is then an approximate translation, in POSIX terms, of that native error code.
es: En Windows, esto le proporciona el código de error nativo de Windows. El atributo :attr:`.errno` es entonces una traducción aproximada, en términos POSIX, de ese código de error nativo.

source: Under Windows, if the *winerror* constructor argument is an integer, the :attr:`.errno` attribute is determined from the Windows error code, and the *errno* argument is ignored. On other platforms, the *winerror* argument is ignored, and the :attr:`winerror` attribute does not exist.
es: En Windows, si el argumento del constructor ``winerror`` es un entero, el atributo :attr:`.errno` se determina a partir del código de error de Windows y el argumento ``errno`` se ignora. En otras plataformas, el argumento ``winerror`` se ignora y el atributo :attr:`winerror` no existe.

source: The corresponding error message, as provided by the operating system. It is formatted by the C functions :c:func:`perror` under POSIX, and :c:func:`FormatMessage` under Windows.
es: El mensaje de error correspondiente, tal como lo proporciona el sistema operativo. Está formateado por las funciones de C, :c:func:`perror` en POSIX, y :c:func:`FormatMessage` en Windows.

source: For exceptions that involve a file system path (such as :func:`open` or :func:`os.unlink`), :attr:`filename` is the file name passed to the function. For functions that involve two file system paths (such as :func:`os.rename`), :attr:`filename2` corresponds to the second file name passed to the function.
es: Para las excepciones que involucran una ruta del sistema de archivos (como :func:`open` o :func:`os.unlink`), :attr:`filename` es el nombre del archivo pasado a la función. Para las funciones que involucran dos rutas del sistema de archivos (como :func:`os.rename`), :attr:`filename2` corresponde al segundo nombre de archivo pasado a la función.

source: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` and :exc:`mmap.error` have been merged into :exc:`OSError`, and the constructor may return a subclass.
es: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` y :exc:`mmap.error` se han fusionado en :exc:`OSError`, y el constructor puede retornar una subclase.

source: The :attr:`filename` attribute is now the original file name passed to the function, instead of the name encoded to or decoded from the :term:`filesystem encoding and error handler`. Also, the *filename2* constructor argument and attribute was added.
es: El atributo :attr:`filename` es ahora el nombre de archivo original pasado a la función, en lugar del nombre codificado o decodificado desde :term:`filesystem encoding and error handler`. Además, se agregaron el argumento y atributo del constructor *filename2*.

source: Raised when the result of an arithmetic operation is too large to be represented. This cannot occur for integers (which would rather raise :exc:`MemoryError` than give up). However, for historical reasons, OverflowError is sometimes raised for integers that are outside a required range. Because of the lack of standardization of floating point exception handling in C, most floating point operations are not checked.
es: Se genera cuando el resultado de una operación aritmética es demasiado grande para ser representado. Esto no puede ocurrir para los enteros (para lo cual es mejor lanzar :exc:`MemoryError` que darse por vencido). Sin embargo, por razones históricas, ``OverflowError`` a veces se genera para enteros que están fuera del rango requerido. Debido a la falta de estandarización del manejo de excepciones de coma flotante en C, la mayoría de las operaciones de coma flotante no se verifican.

source: This exception is derived from :exc:`RuntimeError`. It is raised when the interpreter detects that the maximum recursion depth (see :func:`sys.getrecursionlimit`) is exceeded.
es: Esta excepción se deriva de :exc:`RuntimeError`. Se lanza cuando el intérprete detecta que se excede la profundidad máxima de recursión (ver :func:`sys.getrecursionlimit`).

source: Previously, a plain :exc:`RuntimeError` was raised.
es: Anteriormente, se planteó un simple :exc:`RuntimeError`.

source: This exception is raised when a weak reference proxy, created by the :func:`weakref.proxy` function, is used to access an attribute of the referent after it has been garbage collected. For more information on weak references, see the :mod:`weakref` module.
es: Esta excepción se produce cuando un proxy de referencia débil, creado por la función :func:`weakref.proxy`, se utiliza para acceder a un atributo del referente después de que se ha recolectado basura. Para obtener más información sobre referencias débiles, consulte el módulo :mod:`weakref` .

source: Raised when an error is detected that doesn't fall in any of the other categories. The associated value is a string indicating what precisely went wrong.
es: Se genera cuando se detecta un error que no corresponde a ninguna de las otras categorías. El valor asociado es una cadena que indica exactamente qué salió mal.

source: Raised by built-in function :func:`next` and an :term:`iterator`\'s :meth:`~iterator.__next__` method to signal that there are no further items produced by the iterator.
es: Generado por la función incorporada :func:`next` y un :term:`iterator`\'s :meth:`~iterator.__next__` para indicar que no hay más elementos producidos por el iterador.

source: The exception object has a single attribute :attr:`value`, which is given as an argument when constructing the exception, and defaults to :const:`None`.
es: El objeto de excepción tiene un solo atributo :attr:`value`, que se proporciona como argumento al construir la excepción, y por defecto es :const:`None`.

source: When a :term:`generator` or :term:`coroutine` function returns, a new :exc:`StopIteration` instance is raised, and the value returned by the function is used as the :attr:`value` parameter to the constructor of the exception.
es: Cuando se retorna una función :term:`generator` o :term:`coroutine`, se genera una nueva instancia :exc:`StopIteration`, y el valor retornado por la función se utiliza como parámetro :attr:`value` para constructor de la excepción.

source: If a generator code directly or indirectly raises :exc:`StopIteration`, it is converted into a :exc:`RuntimeError` (retaining the :exc:`StopIteration` as the new exception's cause).
es: Si un generador lanza directa o indirectamente :exc:`StopIteration`, se convierte en :exc:`RuntimeError` (conservando :exc:`StopIteration` como la causa de la nueva excepción).

source: Added ``value`` attribute and the ability for generator functions to use it to return a value.
es: Se agregó el atributo `*value*` y la capacidad de las funciones del generador de usarlo para retornar un valor.

source: Introduced the RuntimeError transformation via ``from __future__ import generator_stop``, see :pep:`479`.
es: Introdujo la transformación *RuntimeError* a través de ``from __future__ import generator_stop``, ver :pep:`479`.

source: Enable :pep:`479` for all code by default: a :exc:`StopIteration` error raised in a generator is transformed into a :exc:`RuntimeError`.
es: Habilitar :pep:`479` para todo el código por defecto: a :exc:`StopIteration` generado en un generador se transforma en :exc:`RuntimeError`.

source: Must be raised by :meth:`__anext__` method of an :term:`asynchronous iterator` object to stop the iteration.
es: Se debe lanzar mediante :meth:`__anext__` de un objeto :term:`asynchronous iterator` para detener la iteración.

source: Raised when the parser encounters a syntax error. This may occur in an :keyword:`import` statement, in a call to the built-in functions :func:`compile`, :func:`exec`, or :func:`eval`, or when reading the initial script or standard input (also interactively).
es: Se genera cuando el analizador encuentra un error de sintaxis. Esto puede ocurrir en una instrucción :keyword:`import`, en una llamada a las funciones integradas :func:`compile`, :func:`exec` o :func:`eval`, o al leer el script inicial o la entrada estándar (también de forma interactiva).

source: The :func:`str` of the exception instance returns only the error message. Details is a tuple whose members are also available as separate attributes.
es: El :func:`str` de la instancia de excepción retorna solo el mensaje de error. Detalles es una tupla cuyos miembros también están disponibles como atributos separados.

source: The name of the file the syntax error occurred in.
es: El nombre del archivo en el que se produjo el error de sintaxis.

source: Which line number in the file the error occurred in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
es: En qué número de línea del archivo se produjo el error. Tiene un índice 1: la primera línea del archivo tiene un ``lineno`` de 1.

source: The column in the line where the error occurred. This is 1-indexed: the first character in the line has an ``offset`` of 1.
es: La columna de la línea donde ocurrió el error. Está indexado a 1: el primer carácter de la línea tiene un ``offset`` de 1.

source: The source code text involved in the error.
es: El texto del código fuente involucrado en el error.

source: Which line number in the file the error occurred ends in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
es: En qué número de línea del archivo termina el error. Está indexado a 1: la primera línea del archivo tiene un ``lineno`` de 1.

source: The column in the end line where the error occurred finishes. This is 1-indexed: the first character in the line has an ``offset`` of 1.
es: Finaliza la columna de la línea final donde ocurrió el error. Está indexado a 1: el primer carácter de la línea tiene un ``offset`` de 1.

source: For errors in f-string fields, the message is prefixed by "f-string: " and the offsets are offsets in a text constructed from the replacement expression. For example, compiling f'Bad {a b} field' results in this args attribute: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
es: Para errores en los campos de cadena f, el mensaje tiene el prefijo "cadena f:" y las compensaciones son compensaciones en un texto construido a partir de la expresión de reemplazo. Por ejemplo, compilar f'Bad {ab} field 'da como resultado este atributo args: (' f-string: ... ', (' ', 1, 2,' (ab) \ n ', 1, 5)) .

source: Added the :attr:`end_lineno` and :attr:`end_offset` attributes.
es: Se agregaron los atributos :attr:`end_lineno` y :attr:`end_offset`.

source: Base class for syntax errors related to incorrect indentation. This is a subclass of :exc:`SyntaxError`.
es: Clase base para errores de sintaxis relacionados con sangría incorrecta. Esta es una subclase de :exc:`SyntaxError`.

source: Raised when indentation contains an inconsistent use of tabs and spaces. This is a subclass of :exc:`IndentationError`.
es: Se genera cuando la sangría contiene un uso inconsistente de pestañas y espacios. Esta es una subclase de :exc:`IndentationError`.

source: Raised when the interpreter finds an internal error, but the situation does not look so serious to cause it to abandon all hope. The associated value is a string indicating what went wrong (in low-level terms).
es: Se genera cuando el intérprete encuentra un error interno, pero la situación no parece tan grave como para abandonar toda esperanza. El valor asociado es una cadena que indica qué salió mal (a bajo nivel).

source: You should report this to the author or maintainer of your Python interpreter. Be sure to report the version of the Python interpreter (``sys.version``; it is also printed at the start of an interactive Python session), the exact error message (the exception's associated value) and if possible the source of the program that triggered the error.
es: Debe informar esto al autor o responsable de su intérprete de Python. Asegúrese de informar la versión del intérprete de Python (``sys.version``; también se imprime al comienzo de una sesión interactiva de Python), el mensaje de error exacto (el valor asociado de la excepción) y, si es posible, la fuente del programa que activó el error.

source: This exception is raised by the :func:`sys.exit` function. It inherits from :exc:`BaseException` instead of :exc:`Exception` so that it is not accidentally caught by code that catches :exc:`Exception`. This allows the exception to properly propagate up and cause the interpreter to exit. When it is not handled, the Python interpreter exits; no stack traceback is printed. The constructor accepts the same optional argument passed to :func:`sys.exit`. If the value is an integer, it specifies the system exit status (passed to C's :c:func:`exit` function); if it is ``None``, the exit status is zero; if it has another type (such as a string), the object's value is printed and the exit status is one.
es: Esta excepción es provocada por la función :func:`sys.exit`. Hereda de :exc:`BaseException` en lugar de :exc:`Exception` para que no sea gestionada accidentalmente por el código que captura :exc:`Exception`. Esto permite que la excepción se propague correctamente y que el intérprete salga. Cuando no se maneja, el intérprete de Python sale; no se imprime el seguimiento de pila. El constructor acepta el mismo argumento opcional pasado a :func:`sys.exit`. Si el valor es un entero, especifica el estado de salida del sistema (se pasa a la función :c:func:`exit` de C); si es ``None``, el estado de salida es cero; Si tiene otro tipo (como una cadena), se imprime el valor del objeto y el estado de salida es uno.

source: A call to :func:`sys.exit` is translated into an exception so that clean-up handlers (:keyword:`finally` clauses of :keyword:`try` statements) can be executed, and so that a debugger can execute a script without running the risk of losing control. The :func:`os._exit` function can be used if it is absolutely positively necessary to exit immediately (for example, in the child process after a call to :func:`os.fork`).
es: Una llamada :func:`sys.exit` se traduce en una excepción para que los gestores de limpieza (:keyword:`finally` cláusulas de :keyword:`try`) puedan ejecutarse, y para que un depurador pueda ejecutar un *script* sin correr el riesgo de perder el control. La función :func:`os._exit` se puede usar si es absolutamente necesario salir (por ejemplo, en el proceso secundario después de una llamada a :func:`os.fork`).

source: The exit status or error message that is passed to the constructor. (Defaults to ``None``.)
es: El estado de salida o mensaje de error que se pasa al constructor. (El valor predeterminado es ``None``.)

source: Raised when an operation or function is applied to an object of inappropriate type. The associated value is a string giving details about the type mismatch.
es: Se genera cuando una operación o función se aplica a un objeto de tipo inapropiado. El valor asociado es una cadena que proporciona detalles sobre la falta de coincidencia de tipos.

source: This exception may be raised by user code to indicate that an attempted operation on an object is not supported, and is not meant to be. If an object is meant to support a given operation but has not yet provided an implementation, :exc:`NotImplementedError` is the proper exception to raise.
es: El código de usuario puede lanzar esta excepción para indicar que un intento de operación en un objeto no es compatible y no debe serlo. Si un objeto está destinado a soportar una operación dada pero aún no ha proporcionado una implementación, :exc:`NotImplementedError` es la excepción adecuada para lanzar.

source: Passing arguments of the wrong type (e.g. passing a :class:`list` when an :class:`int` is expected) should result in a :exc:`TypeError`, but passing arguments with the wrong value (e.g. a number outside expected boundaries) should result in a :exc:`ValueError`.
es: Pasar argumentos del tipo incorrecto (por ejemplo, pasar a :class:`list` cuando se espera un :class:`int`) debería dar como resultado :exc:`TypeError`, pero pasar argumentos con el valor incorrecto (por ejemplo, un número fuera límites esperados) debería dar como resultado :exc:`ValueError`.

source: Raised when a reference is made to a local variable in a function or method, but no value has been bound to that variable. This is a subclass of :exc:`NameError`.
es: Se genera cuando se hace referencia a una variable local en una función o método, pero no se ha vinculado ningún valor a esa variable. Esta es una subclase de :exc:`NameError`.

source: Raised when a Unicode-related encoding or decoding error occurs. It is a subclass of :exc:`ValueError`.
es: Se genera cuando se produce un error de codificación o decodificación relacionado con Unicode. Es una subclase de :exc:`ValueError`.

source: :exc:`UnicodeError` has attributes that describe the encoding or decoding error. For example, ``err.object[err.start:err.end]`` gives the particular invalid input that the codec failed on.
es: :exc:`UnicodeError` tiene atributos que describen el error de codificación o decodificación. Por ejemplo, ``err.object[err.start:err.end]`` proporciona la entrada inválida particular en la que falló el códec.

source: The name of the encoding that raised the error.
es: El nombre de la codificación que provocó el error.

source: A string describing the specific codec error.
es: Una cadena que describe el error de códec específico.

source: The object the codec was attempting to encode or decode.
es: El objeto que el códec intentaba codificar o decodificar.

source: The first index of invalid data in :attr:`object`.
es: El primer índice de datos no válidos en :attr:`object`.

source: The index after the last invalid data in :attr:`object`.
es: El índice después de los últimos datos no válidos en :attr:`object`.

source: Raised when a Unicode-related error occurs during encoding. It is a subclass of :exc:`UnicodeError`.
es: Se genera cuando se produce un error relacionado con Unicode durante la codificación. Es una subclase de :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during decoding. It is a subclass of :exc:`UnicodeError`.
es: Se genera cuando se produce un error relacionado con Unicode durante la codificación. Es una subclase de :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during translating. It is a subclass of :exc:`UnicodeError`.
es: Se genera cuando se produce un error relacionado con Unicode durante la codificación. Es una subclase de :exc:`UnicodeError`.

source: Raised when an operation or function receives an argument that has the right type but an inappropriate value, and the situation is not described by a more precise exception such as :exc:`IndexError`.
es: Se genera cuando una operación o función recibe un argumento que tiene el tipo correcto pero un valor inapropiado, y la situación no se describe con una excepción más precisa como :exc:`IndexError`.

source: Raised when the second argument of a division or modulo operation is zero. The associated value is a string indicating the type of the operands and the operation.
es: Se genera cuando el segundo argumento de una operación de división o módulo es cero. El valor asociado es una cadena que indica el tipo de operandos y la operación.

source: The following exceptions are kept for compatibility with previous versions; starting from Python 3.3, they are aliases of :exc:`OSError`.
es: Las siguientes excepciones se mantienen por compatibilidad con versiones anteriores; a partir de Python 3.3, son alias de :exc:`OSError`.

source: Only available on Windows.
es: Solo disponible en Windows.

source: OS exceptions
es: Excepciones del sistema operativo

source: The following exceptions are subclasses of :exc:`OSError`, they get raised depending on the system error code.
es: Las siguientes excepciones son subclases de :exc:`OSError`, se generan según el código de error del sistema.

source: Raised when an operation would block on an object (e.g. socket) set for non-blocking operation. Corresponds to :c:data:`errno` :py:data:`~errno.EAGAIN`, :py:data:`~errno.EALREADY`, :py:data:`~errno.EWOULDBLOCK` and :py:data:`~errno.EINPROGRESS`.
es: Se lanza cuando una operación se bloquearía en un objeto (ejemplo: socket) configurado para una operación no bloqueante. Corresponde a :c:data:`errno` :py:data:`~errno.EAGAIN`, :py:data:`~errno.EALREADY`, :py:data:`~errno.EWOULDBLOCK` y :py:data:`~errno.EINPROGRESS`.

source: In addition to those of :exc:`OSError`, :exc:`BlockingIOError` can have one more attribute:
es: Además de los de :exc:`OSError`, :exc:`BlockingIOError` puede tener un atributo más:

source: An integer containing the number of characters written to the stream before it blocked. This attribute is available when using the buffered I/O classes from the :mod:`io` module.
es: Un entero que contiene el número de caracteres escritos en la secuencia antes de que se bloquee. Este atributo está disponible cuando se utilizan las clases de E/S almacenadas en el modulo :mod:`io`.

source: Raised when an operation on a child process failed. Corresponds to :c:data:`errno` :py:data:`~errno.ECHILD`.
es: Se genera cuando falla una operación en un proceso secundario. Corresponde a :c:data:`errno` :py:data:`~errno.ECHILD`.

source: A base class for connection-related issues.
es: Una clase base para problemas relacionados con la conexión.

source: Subclasses are :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` and :exc:`ConnectionResetError`.
es: Las subclases son :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` y :exc:`ConnectionResetError`.

source: A subclass of :exc:`ConnectionError`, raised when trying to write on a pipe while the other end has been closed, or trying to write on a socket which has been shutdown for writing. Corresponds to :c:data:`errno` :py:data:`~errno.EPIPE` and :py:data:`~errno.ESHUTDOWN`.
es: Una subclase de :exc:`ConnectionError`, que se genera cuando se intenta escribir en una tubería mientras el otro extremo se ha cerrado, o cuando se intenta escribir en un *socket* que se ha cerrado por escritura. Corresponde a :c:data:`errno` :py:data:`~errno.EPIPE` y :py:data:`~errno.ESHUTDOWN`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is aborted by the peer. Corresponds to :c:data:`errno` :py:data:`~errno.ECONNABORTED`.
es: Una subclase de :exc:`ConnectionError`, que se genera cuando el par interrumpe un intento de conexión. Corresponde a :c:data:`errno` :py:data:`~errno.ECONNABORTED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is refused by the peer. Corresponds to :c:data:`errno` :py:data:`~errno.ECONNREFUSED`.
es: Una subclase de :exc:`ConnectionError`, que se genera cuando el par interrumpe un intento de conexión. Corresponde a :c:data:`errno` :py:data:`~errno.ECONNREFUSED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection is reset by the peer. Corresponds to :c:data:`errno` :py:data:`~errno.ECONNRESET`.
es: Una subclase de :exc:`ConnectionError`, que se genera cuando el par restablece una conexión. Corresponde a :c:data:`errno` :py:data:`~errno.ECONNRESET`.

source: Raised when trying to create a file or directory which already exists. Corresponds to :c:data:`errno` :py:data:`~errno.EEXIST`.
es: Se genera al intentar crear un archivo o directorio que ya existe. Corresponde a :c:data:`errno` :py:data:`~errno.EEXIST`.
