Repository: python/python-docs-es
Catalog: library/formatter.po
Languages: es

source: :mod:`formatter` --- Generic output formatting
es: :mod:`formatter` --- Formateo de salida genérica

source: Due to lack of usage, the formatter module has been deprecated.
es: Debido a la falta de uso, el módulo formateador ha quedado obsoleto.

source: This module supports two interface definitions, each with multiple implementations: The *formatter* interface, and the *writer* interface which is required by the formatter interface.
es: Este módulo admite dos definiciones de interfaz, cada una con múltiples implementaciones: la interfaz *formateador* y la interfaz *escritor* que es requerida por la interfaz formateadora.

source: Formatter objects transform an abstract flow of formatting events into specific output events on writer objects. Formatters manage several stack structures to allow various properties of a writer object to be changed and restored; writers need not be able to handle relative changes nor any sort of "change back" operation. Specific writer properties which may be controlled via formatter objects are horizontal alignment, font, and left margin indentations. A mechanism is provided which supports providing arbitrary, non-exclusive style settings to a writer as well. Additional interfaces facilitate formatting events which are not reversible, such as paragraph separation.
es: Los objetos formateadores transforman un flujo abstracto de eventos de formato en eventos de salida específicos en los objetos del escritor. Los formateadores gestionan varias estructuras de pila para permitir cambiar y restaurar varias propiedades de un objeto escritor; los escritores no necesitan poder manejar cambios relativos ni ningún tipo de operación de "retroceso". Las propiedades específicas del escritor que se pueden controlar a través de los objetos del formateador son la alineación horizontal, la fuente y las sangrías del margen izquierdo. Se proporciona un mecanismo que también permite proporcionar configuraciones de estilo arbitrarias y no exclusivas a un escritor. Las interfaces adicionales facilitan el formateo de eventos que no son reversibles, como la separación de párrafos.

source: Writer objects encapsulate device interfaces. Abstract devices, such as file formats, are supported as well as physical devices. The provided implementations all work with abstract devices. The interface makes available mechanisms for setting the properties which formatter objects manage and inserting data into the output.
es: Los objetos escritores encapsulan las interfaces de los dispositivos. Se admiten dispositivos abstractos, como formatos de archivo, así como dispositivos físicos. Todas las implementaciones proporcionadas funcionan con dispositivos abstractos. La interfaz pone a disposición mecanismos para establecer las propiedades que administran los objetos del formateador e insertar datos en la salida.

source: The Formatter Interface
es: La interfaz Formateador

source: Interfaces to create formatters are dependent on the specific formatter class being instantiated. The interfaces described below are the required interfaces which all formatters must support once initialized.
es: Las interfaces para crear formateadores dependen de la clase de formateador específica que se instancia. Las interfaces que se describen a continuación son las interfaces necesarias que todos los formateadores deben admitir una vez inicializados.

source: One data element is defined at the module level:
es: Un elemento de datos se define a nivel de módulo:

source: Value which can be used in the font specification passed to the ``push_font()`` method described below, or as the new value to any other ``push_property()`` method. Pushing the ``AS_IS`` value allows the corresponding ``pop_property()`` method to be called without having to track whether the property was changed.
es: Valor que se puede usar en la especificación de fuente pasada al método ``push_font ()`` descrito a continuación, o como el nuevo valor a cualquier otro método ``push_property()``. Al presionar el valor ``AS_IS``, se puede llamar al método correspondiente ``pop_property()`` sin tener que rastrear si se cambió la propiedad.

source: The following attributes are defined for formatter instance objects:
es: Los siguientes atributos están definidos para los objetos de instancia del formateador:

source: The writer instance with which the formatter interacts.
es: La instancia de escritor con la que interactúa el formateador.

source: Close any open paragraphs and insert at least *blanklines* before the next paragraph.
es: Cierra todos los párrafos abiertos e inserta al menos *blanklines* antes del siguiente párrafo.

source: Add a hard line break if one does not already exist. This does not break the logical paragraph.
es: Agrega un salto de línea duro si aún no existe uno. Esto no rompe el párrafo lógico.

source: Insert a horizontal rule in the output. A hard break is inserted if there is data in the current paragraph, but the logical paragraph is not broken. The arguments and keywords are passed on to the writer's :meth:`send_line_break` method.
es: Inserta una regla horizontal en la salida. Se inserta una ruptura dura si hay datos en el párrafo actual, pero el párrafo lógico no está roto. Los argumentos y palabras clave se pasan al método del escritor :meth:`send_line_break`.

source: Provide data which should be formatted with collapsed whitespace. Whitespace from preceding and successive calls to :meth:`add_flowing_data` is considered as well when the whitespace collapse is performed. The data which is passed to this method is expected to be word-wrapped by the output device. Note that any word-wrapping still must be performed by the writer object due to the need to rely on device and font information.
es: Proporciona datos que deben formatearse con espacios en blanco contraídos. Los espacios en blanco de llamadas anteriores y sucesivas a :meth:`add_flowing_data` también se consideran cuando se realiza el colapso de espacios en blanco. Se espera que los datos que se pasan a este método estén envueltos en palabras por el dispositivo de salida. Tenga en cuenta que el objeto escritor debe realizar cualquier ajuste de texto debido a la necesidad de depender de la información del dispositivo y la fuente.

source: Provide data which should be passed to the writer unchanged. Whitespace, including newline and tab characters, are considered legal in the value of *data*.
es: Proporciona datos que deben pasarse al escritor sin cambios. Los espacios en blanco, incluidos los caracteres de nueva línea y tabulación, se consideran legales en el valor de *data*.

source: Insert a label which should be placed to the left of the current left margin. This should be used for constructing bulleted or numbered lists. If the *format* value is a string, it is interpreted as a format specification for *counter*, which should be an integer. The result of this formatting becomes the value of the label; if *format* is not a string it is used as the label value directly. The label value is passed as the only argument to the writer's :meth:`send_label_data` method. Interpretation of non-string label values is dependent on the associated writer.
es: Inserta una etiqueta que debe colocarse a la izquierda del margen izquierdo actual. Esto debe usarse para construir listas numeradas o con viñetas. Si el valor de *format* es una cadena, se interpreta como una especificación de formato para *counter*, que debe ser un número entero. El resultado de este formato se convierte en el valor de la etiqueta; si *format* no es una cadena, se utiliza directamente como valor de etiqueta. El valor de la etiqueta se pasa como el único argumento del método del escritor :meth:`send_label_data`. La interpretación de valores de etiquetas que no son cadenas depende del escritor asociado.

source: Format specifications are strings which, in combination with a counter value, are used to compute label values. Each character in the format string is copied to the label value, with some characters recognized to indicate a transform on the counter value. Specifically, the character ``'1'`` represents the counter value formatter as an Arabic number, the characters ``'A'`` and ``'a'`` represent alphabetic representations of the counter value in upper and lower case, respectively, and ``'I'`` and ``'i'`` represent the counter value in Roman numerals, in upper and lower case. Note that the alphabetic and roman transforms require that the counter value be greater than zero.
es: Las especificaciones de formato son cadenas que, en combinación con un valor de contador, se utilizan para calcular valores de etiqueta. Cada carácter de la cadena de formato se copia al valor de la etiqueta, y algunos caracteres se reconocen para indicar una transformación en el valor del contador. Específicamente, el carácter ``'1'`` representa el formateador del valor del contador como un número arábigo, los caracteres ``'A'`` y ``'a'`` representan representaciones alfabéticas del valor del contador en mayúsculas y minúsculas , respectivamente, y ``'I'`` y ``'i'`` representan el valor del contador en números romanos, en mayúsculas y minúsculas. Tenga en cuenta que las transformaciones alfabética y romana requieren que el valor del contador sea mayor que cero.

source: Send any pending whitespace buffered from a previous call to :meth:`add_flowing_data` to the associated writer object. This should be called before any direct manipulation of the writer object.
es: Envía cualquier espacio en blanco pendiente almacenado en búfer de una llamada anterior a :meth:`add_flowing_data` al objeto escritor asociado. Esto debe llamarse antes de cualquier manipulación directa del objeto de escritura.

source: Push a new alignment setting onto the alignment stack. This may be :const:`AS_IS` if no change is desired. If the alignment value is changed from the previous setting, the writer's :meth:`new_alignment` method is called with the *align* value.
es: Empuja una nueva configuración de alineación en la pila de alineación. Puede ser :const:`AS_IS` si no se desea ningún cambio. Si el valor de alineación se cambia con respecto a la configuración anterior, se llama al método del escritor :meth:`new_alignment` con el valor *align*.

source: Restore the previous alignment.
es: Restaura la alineación anterior.

source: Change some or all font properties of the writer object. Properties which are not set to :const:`AS_IS` are set to the values passed in while others are maintained at their current settings. The writer's :meth:`new_font` method is called with the fully resolved font specification.
es: Cambia algunas o todas las propiedades de fuente del objeto de escritura. Las propiedades que no se establecen en :const:`AS_IS` se establecen en los valores pasados, mientras que otras se mantienen en su configuración actual. Se llama al método del escritor :meth:`new_font` con la especificación de fuente completamente resuelta.

source: Restore the previous font.
es: Restaura la fuente anterior.

source: Increase the number of left margin indentations by one, associating the logical tag *margin* with the new indentation. The initial margin level is ``0``. Changed values of the logical tag must be true values; false values other than :const:`AS_IS` are not sufficient to change the margin.
es: Aumenta el número de sangrías del margen izquierdo en uno, asociando la etiqueta lógica *margin* con la nueva sangría. El nivel de margen inicial es ``0``. Los valores modificados de la etiqueta lógica deben ser valores verdaderos; los valores falsos distintos de :const:`AS_IS` no son suficientes para cambiar el margen.

source: Restore the previous margin.
es: Restaura el margen anterior.

source: Push any number of arbitrary style specifications. All styles are pushed onto the styles stack in order. A tuple representing the entire stack, including :const:`AS_IS` values, is passed to the writer's :meth:`new_styles` method.
es: Empuja cualquier número de especificaciones de estilo arbitrarias. Todos los estilos se insertan en la pila de estilos en orden. Una tupla que representa la pila completa, incluidos los valores :const:`AS_IS`, se pasa al método :meth:`new_styles` del escritor.

source: Pop the last *n* style specifications passed to :meth:`push_style`. A tuple representing the revised stack, including :const:`AS_IS` values, is passed to the writer's :meth:`new_styles` method.
es: Muestra las últimas *n* especificaciones de estilo pasadas a :meth:`push_style`. Una tupla que representa la pila revisada, que incluye los valores :const:`AS_IS`, se pasa al método :meth:`new_styles` del escritor.

source: Set the spacing style for the writer.
es: Establece el estilo de espaciado para el escritor.

source: Inform the formatter that data has been added to the current paragraph out-of-band. This should be used when the writer has been manipulated directly. The optional *flag* argument can be set to false if the writer manipulations produced a hard line break at the end of the output.
es: Informa al formateador que se han agregado datos al párrafo actual fuera de banda. Esto debe usarse cuando el escritor haya sido manipulado directamente. El argumento *flag* opcional se puede establecer en falso si las manipulaciones del escritor produjeron un salto de línea duro al final de la salida.

source: Formatter Implementations
es: Implementaciones del formateador

source: Two implementations of formatter objects are provided by this module. Most applications may use one of these classes without modification or subclassing.
es: Este módulo proporciona dos implementaciones de objetos formateadores. La mayoría de las aplicaciones pueden utilizar una de estas clases sin modificación ni subclases.

source: A formatter which does nothing. If *writer* is omitted, a :class:`NullWriter` instance is created. No methods of the writer are called by :class:`NullFormatter` instances. Implementations should inherit from this class if implementing a writer interface but don't need to inherit any implementation.
es: Un formateador que no hace nada. Si se omite *writer*, se crea una instancia :class:`NullWriter`. Ningún método del escritor es llamado por instancias :class:`NullFormatter`. Las implementaciones deben heredar de esta clase si implementan una interfaz de escritor, pero no necesitan heredar ninguna implementación.

source: The standard formatter. This implementation has demonstrated wide applicability to many writers, and may be used directly in most circumstances. It has been used to implement a full-featured World Wide Web browser.
es: El formateador estándar. Esta implementación ha demostrado una amplia aplicabilidad para muchos escritores y puede usarse directamente en la mayoría de las circunstancias. Se ha utilizado para implementar un navegador World Wide Web con todas las funciones.

source: The Writer Interface
es: La interfaz Escritor

source: Interfaces to create writers are dependent on the specific writer class being instantiated. The interfaces described below are the required interfaces which all writers must support once initialized. Note that while most applications can use the :class:`AbstractFormatter` class as a formatter, the writer must typically be provided by the application.
es: Las interfaces para crear escritores dependen de la clase de escritor específica que se instancia. Las interfaces que se describen a continuación son las interfaces necesarias que todos los escritores deben admitir una vez inicializadas. Tenga en cuenta que, si bien la mayoría de las aplicaciones pueden usar la clase :class:`AbstractFormatter` como formateador, el escritor generalmente debe ser proporcionado por la aplicación.

source: Flush any buffered output or device control events.
es: Vacía cualquier salida almacenada o eventos de control de dispositivos.

source: Set the alignment style. The *align* value can be any object, but by convention is a string or ``None``, where ``None`` indicates that the writer's "preferred" alignment should be used. Conventional *align* values are ``'left'``, ``'center'``, ``'right'``, and ``'justify'``.
es: Define el estilo de alineación. El valor *align* puede ser cualquier objeto, pero por convención es una cadena o ``None``, donde ``None`` indica que se debe usar la alineación "preferida" del escritor. Los valores de *align* convencionales son `'left'``, ``'center'``, ``'right'``, y ``'justify'``.

source: Set the font style. The value of *font* will be ``None``, indicating that the device's default font should be used, or a tuple of the form ``(size, italic, bold, teletype)``. Size will be a string indicating the size of font that should be used; specific strings and their interpretation must be defined by the application. The *italic*, *bold*, and *teletype* values are Boolean values specifying which of those font attributes should be used.
es: Establece el estilo de fuente. El valor de *font* será ``None``, lo que indica que se debe usar la fuente predeterminada del dispositivo, o una tupla de la forma ``(tamaño, cursiva, negrita, teletipo)``. El tamaño será una cadena que indica el tamaño de fuente que se debe utilizar; cadenas específicas y su interpretación deben ser definidas por la aplicación. Los valores *cursiva*, *negrita* y *teletipo* son valores booleanos que especifican cuál de esos atributos de fuente debe usarse.

source: Set the margin level to the integer *level* and the logical tag to *margin*. Interpretation of the logical tag is at the writer's discretion; the only restriction on the value of the logical tag is that it not be a false value for non-zero values of *level*.
es: Establece el nivel de margen en el entero *level* y la etiqueta lógica en *margin*. La interpretación de la etiqueta lógica queda a discreción del escritor; la única restricción sobre el valor de la etiqueta lógica es que no sea un valor falso para valores distintos de cero de *level*.

source: Set the spacing style to *spacing*.
es: Establece el estilo de espaciado en *spacing*.

source: Set additional styles. The *styles* value is a tuple of arbitrary values; the value :const:`AS_IS` should be ignored. The *styles* tuple may be interpreted either as a set or as a stack depending on the requirements of the application and writer implementation.
es: Establece estilos adicionales. El valor de *styles* es una tupla de valores arbitrarios; el valor :const:`AS_IS` debe ignorarse. La tupla *styles* se puede interpretar como un conjunto o como una pila dependiendo de los requisitos de la aplicación y la implementación del escritor.

source: Break the current line.
es: Rompe la línea actual.

source: Produce a paragraph separation of at least *blankline* blank lines, or the equivalent. The *blankline* value will be an integer. Note that the implementation will receive a call to :meth:`send_line_break` before this call if a line break is needed; this method should not include ending the last line of the paragraph. It is only responsible for vertical spacing between paragraphs.
es: Produce una separación de párrafos de al menos *blankline* líneas en blanco, o su equivalente. El valor de *blankline* será un número entero. Tenga en cuenta que la implementación recibirá una llamada a :meth:`send_line_break` antes de esta llamada si se necesita un salto de línea; este método no debe incluir terminar la última línea del párrafo. Solo es responsable del espacio vertical entre párrafos.

source: Display a horizontal rule on the output device. The arguments to this method are entirely application- and writer-specific, and should be interpreted with care. The method implementation may assume that a line break has already been issued via :meth:`send_line_break`.
es: Muestra una regla horizontal en el dispositivo de salida. Los argumentos de este método son completamente específicos de la aplicación y del escritor, y deben interpretarse con cuidado. La implementación del método puede asumir que ya se ha emitido un salto de línea a través de :meth:`send_line_break`.

source: Output character data which may be word-wrapped and re-flowed as needed. Within any sequence of calls to this method, the writer may assume that spans of multiple whitespace characters have been collapsed to single space characters.
es: Datos de caracteres de salida que se pueden ajustar en palabras y volver a fluir según sea necesario. Dentro de cualquier secuencia de llamadas a este método, el escritor puede asumir que se han contraído tramos de múltiples caracteres de espacio en blanco a caracteres de un solo espacio.

source: Output character data which has already been formatted for display. Generally, this should be interpreted to mean that line breaks indicated by newline characters should be preserved and no new line breaks should be introduced. The data may contain embedded newline and tab characters, unlike data provided to the :meth:`send_formatted_data` interface.
es: Salida de datos de caracteres que ya se formatearon para su visualización. En general, esto debe interpretarse en el sentido de que los saltos de línea indicados por caracteres de nueva línea deben conservarse y no deben introducirse nuevos saltos de línea. Los datos pueden contener caracteres de tabulación y nueva línea incrustados, a diferencia de los datos proporcionados en la interfaz :meth:`send_formatted_data`.

source: Set *data* to the left of the current left margin, if possible. The value of *data* is not restricted; treatment of non-string values is entirely application- and writer-dependent. This method will only be called at the beginning of a line.
es: Establece *data* a la izquierda del margen izquierdo actual, si es posible. El valor de *data* no está restringido; el tratamiento de los valores que no son cadenas depende completamente de la aplicación y del escritor. Este método solo se llamará al comienzo de una línea.

source: Writer Implementations
es: Implementaciones del escritor

source: Three implementations of the writer object interface are provided as examples by this module. Most applications will need to derive new writer classes from the :class:`NullWriter` class.
es: Este módulo proporciona tres implementaciones de la interfaz de objetos del escritor como ejemplos. La mayoría de las aplicaciones necesitarán derivar nuevas clases de escritor de la clase :class:`NullWriter`.

source: A writer which only provides the interface definition; no actions are taken on any methods. This should be the base class for all writers which do not need to inherit any implementation methods.
es: Un escritor que solo proporciona la definición de la interfaz; no se toman acciones sobre ningún método. Esta debería ser la clase base para todos los escritores que no necesitan heredar ningún método de implementación.

source: A writer which can be used in debugging formatters, but not much else. Each method simply announces itself by printing its name and arguments on standard output.
es: Un escritor que se puede utilizar para depurar formateadores, pero no mucho más. Cada método simplemente se anuncia a sí mismo imprimiendo su nombre y argumentos en la salida estándar.

source: Simple writer class which writes output on the :term:`file object` passed in as *file* or, if *file* is omitted, on standard output. The output is simply word-wrapped to the number of columns specified by *maxcol*. This class is suitable for reflowing a sequence of paragraphs.
es: Clase de escritor simple que escribe la salida en el :term:`file object` pasado como *file* o, si se omite *file*, en la salida estándar. La salida simplemente se ajusta en palabras al número de columnas especificado por *maxcol*. Esta clase es adecuada para reajustar una secuencia de párrafos.
