Repository: python/python-docs-es
Catalog: library/ftplib.po
Languages: es

source: :mod:`ftplib` --- FTP protocol client
es: :mod:`ftplib` --- cliente de protocolo FTP

source: **Source code:** :source:`Lib/ftplib.py`
es: **Código fuente** :source:`Lib/ftplib.py`

source: This module defines the class :class:`FTP` and a few related items. The :class:`FTP` class implements the client side of the FTP protocol. You can use this to write Python programs that perform a variety of automated FTP jobs, such as mirroring other FTP servers. It is also used by the module :mod:`urllib.request` to handle URLs that use FTP. For more information on FTP (File Transfer Protocol), see Internet :rfc:`959`.
es: Este módulo define la clase :class:`FTP` y algunos elementos relacionados. La clase :class:`FTP` implementa el lado cliente del protocolo FTP. Puedes usarlo para escribir programas en Python que realizan una variedad de trabajos FTP automatizados, como reflejar otros servidores FTP. También es utilizado por el módulo :mod:`urllib.request` para manejar URLs que usan FTP. Para más información sobre FTP (Protocolo de transferencia de archivos), véase Internet :rfc:`959`.

source: Here's a sample session using the :mod:`ftplib` module::
es: Aquí hay una sesión de ejemplo usando el módulo :mod:`ftplib`::

source: The module defines the following items:
es: El módulo define los siguientes elementos:

source: The :class:`FTP` class supports the :keyword:`with` statement, e.g.:
es: La clase :class:`FTP` admite la instrucción :keyword:`with`, por ejemplo:

source: Support for the :keyword:`with` statement was added.
es: Se agregó compatibilidad con la instrucción :keyword:`with`.

source: *source_address* parameter was added.
es: Se agregó el parámetro *source_address*.

source: A :class:`FTP` subclass which adds TLS support to FTP as described in :rfc:`4217`. Connect as usual to port 21 implicitly securing the FTP control connection before authenticating. Securing the data connection requires the user to explicitly ask for it by calling the :meth:`prot_p` method. *context* is a :class:`ssl.SSLContext` object which allows bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure. Please read :ref:`ssl-security` for best practices.
es: Una subclase :class:`FTP` que agrega compatibilidad con TLS a FTP como se describe en :rfc:`4217`. Conéctate como de costumbre al puerto 21 asegurando implícitamente la conexión de control antes de autenticar. Proteger la conexión de datos requiere que el usuario la solicite explícitamente llamando al método :meth:`prot_p`. *context* es un objeto :class:`ssl.SSLContext` que permite agrupar opciones de configuración SSL, certificados y claves privadas en una sola estructura (potencialmente de larga duración). Por favor, lee :ref:`ssl-security` para conocer las mejores prácticas.

source: *keyfile* and *certfile* are a legacy alternative to *context* -- they can point to PEM-formatted private key and certificate chain files (respectively) for the SSL connection.
es: *keyfile* y *certfile* son una alternativa de legado a *context* -- pueden apuntar a una clave privada en formato PEM y certificar archivos de cadena (respectivamente) para la conexión SSL.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
es: La clase ahora admite el chequeo del nombre de *host* con :attr:`ssl.SSLContext.check_hostname` y *Server Name Indication* (véase :data:`ssl.HAS_SNI`).

source: *keyfile* and *certfile* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
es: *keyfile* y *certfile* son rechazados a favor de *context*. Por favor, usa :meth:`ssl.SSLContext.load_cert_chain` en su lugar, o deja que :func:`ssl.create_default_context` seleccione los certificados CA confiables para ti.

source: Here's a sample session using the :class:`FTP_TLS` class::
es: Aquí hay una sesión de ejemplo que usa la clase :class:`FTP_TLS`::

source: Exception raised when an unexpected reply is received from the server.
es: Se lanza una excepción cuando una respuesta inesperada se recibe del servidor.

source: Exception raised when an error code signifying a temporary error (response codes in the range 400--499) is received.
es: Se genera una excepción cuando se recibe un código de error que refiere a un error temporal (códigos de respuesta en el rango 400-499).

source: Exception raised when an error code signifying a permanent error (response codes in the range 500--599) is received.
es: Se lanza una excepción cuando se recibe un código de error que refiere a un error permanente (códigos de respuesta en el rango 500--599).

source: Exception raised when a reply is received from the server that does not fit the response specifications of the File Transfer Protocol, i.e. begin with a digit in the range 1--5.
es: Se lanza una excepción cuando se recibe una respuesta del servidor que no coincide con las especificaciones de respuesta del protocolo de transferencia de archivos (FTP), es decir, que comienza con un dígito en el rango 1--5.

source: The set of all exceptions (as a tuple) that methods of :class:`FTP` instances may raise as a result of problems with the FTP connection (as opposed to programming errors made by the caller). This set includes the four exceptions listed above as well as :exc:`OSError` and :exc:`EOFError`.
es: El conjunto de todas las excepciones (como una tupla) que los métodos de instancias :class:`FTP` pueden lanzar como resultado de problemas con la conexión FTP (a diferencia de los errores de programación hechos por el autor de la llamada). Este conjunto incluye las cuatro excepciones enumeradas anteriormente, como también :exc:`OSError` y :exc:`EOFError`.

source: Module :mod:`netrc`
es: Módulo :mod:`netrc`

source: Parser for the :file:`.netrc` file format. The file :file:`.netrc` is typically used by FTP clients to load user authentication information before prompting the user.
es: Analizador para el formato de archivo :file:`.netrc`. El archivo :file:`.netrc` suele ser utilizado por clientes FTP para cargar la información de autenticación de usuario antes de solicitarlo al usuario.

source: FTP Objects
es: Objetos FTP

source: :class:`FTP` instances have the following methods:
es: Las instancias de :class:`FTP` tienen los siguientes métodos:

source: Set the instance's debugging level. This controls the amount of debugging output printed. The default, ``0``, produces no debugging output. A value of ``1`` produces a moderate amount of debugging output, generally a single line per request. A value of ``2`` or higher produces the maximum amount of debugging output, logging each line sent and received on the control connection.
es: Establece el nivel de depuración de la isntancia. Esto controla la cantidad de salida de depuración impresa. El valor predeterminado, ``0``, no produce una salida de depuración. Un valor de ``1`` produce una cantidad moderada de salida de depuración, generalmente una sola línea por solicitud. Un valor de ``2`` produce la cantidad máxima de salida de depuración, registrando cada línea enviada y recibida en la conexión de control.

source: Connect to the given host and port. The default port number is ``21``, as specified by the FTP protocol specification. It is rarely needed to specify a different port number. This function should be called only once for each instance; it should not be called at all if a host was given when the instance was created. All other methods can only be used after a connection has been made. The optional *timeout* parameter specifies a timeout in seconds for the connection attempt. If no *timeout* is passed, the global default timeout setting will be used. *source_address* is a 2-tuple ``(host, port)`` for the socket to bind to as its source address before connecting.
es: Conéctate al puerto y al *host* dados. El número de puerto por defecto es ``21``, como se establece en la especificación de protocolo FTP. Raramente se necesita un número de puerto diferente. Esta función debería llamarse una vez por cada instancia; no debería llamarse si el *host* fue dado cuando se creó la instancia. Todos los otros métodos se pueden usar solo después de que se hizo una conexión. Si no se pasa ningún parámetro opcional *timeout* en segundos para el intento de conexión. Si no se pasa ningún *timeout*, se usará la configuración de tiempo de espera global. *source_address* is una tupla de 2 ``(host, port)`` para que el socket se enlace como su dirección de origen antes de conectarse.

source: Raises an :ref:`auditing event <auditing>` ``ftplib.connect`` with arguments ``self``, ``host``, ``port``.
es: Lanza un :ref:`evento auditor <auditing>` ``ftplib.connect`` con los argumentos ``self``, ``host``, ``port``.

source: Return the welcome message sent by the server in reply to the initial connection. (This message sometimes contains disclaimers or help information that may be relevant to the user.)
es: Retornar el mensaje de bienvenida enviado por el servidor como respuesta a la conexión inicial. (Este mensaje a veces contiene renuncias de responsabilidad o información de ayuda que puede ser relevante para el usuario.)

source: Log in as the given *user*. The *passwd* and *acct* parameters are optional and default to the empty string. If no *user* is specified, it defaults to ``'anonymous'``. If *user* is ``'anonymous'``, the default *passwd* is ``'anonymous@'``. This function should be called only once for each instance, after a connection has been established; it should not be called at all if a host and user were given when the instance was created. Most FTP commands are only allowed after the client has logged in. The *acct* parameter supplies "accounting information"; few systems implement this.
es: Inicia sesión como el *usuario* dado. Los parámetros *passwd* y *acct* son opcionales y tienen como valor predeterminado la cadena vacía. Si no se especifica ningún *usuario*, toma como valor predeterminado ``'anónimo'``, el valor predeterminado de *passwd* es ``'anonymous@'``. Esta función debería ser invocada solo una vez por cada instancia, luego de que se haya establecido una conexión; no debería invocarse en lo absoluto si se dio un anfitrión y un usuario cuando se creó la instancia. La mayoría de los comandos FTP solo están permitidos luego de que el cliente ha iniciado sesión. El parámetro *acct* proporciona "información contable"; pocos sistemas implementan esto.

source: Abort a file transfer that is in progress. Using this does not always work, but it's worth a try.
es: Anula una transferencia de archivo que está en progreso. Usarlo no siempre funciona, pero vale la pena intentarlo.

source: Send a simple command string to the server and return the response string.
es: Envía una cadena de comando simple al servidor y retorna la cadena de caracteres de respuesta.

source: Raises an :ref:`auditing event <auditing>` ``ftplib.sendcmd`` with arguments ``self``, ``cmd``.
es: Genera un :ref:`evento auditor <auditing>` ``ftplib.sendcmd`` con los argumentos ``self``, ``cmd``.

source: Send a simple command string to the server and handle the response. Return nothing if a response code corresponding to success (codes in the range 200--299) is received. Raise :exc:`error_reply` otherwise.
es: Envía una cadena de caracteres como comando simple al servidor y maneja la respuesta. No retorna nada si recibe el código de respuesta que corresponde a una transferencia exitosa (códigos en el rango 200--299).Lanza :exc:`error_reply` de lo contrario.

source: Retrieve a file in binary transfer mode. *cmd* should be an appropriate ``RETR`` command: ``'RETR filename'``. The *callback* function is called for each block of data received, with a single bytes argument giving the data block. The optional *blocksize* argument specifies the maximum chunk size to read on the low-level socket object created to do the actual transfer (which will also be the largest size of the data blocks passed to *callback*). A reasonable default is chosen. *rest* means the same thing as in the :meth:`transfercmd` method.
es: Recupera un archivo en el modo de transferencia binaria. *cmd* debería ser un comando ``RETR``apropiado: ``'RETR filename'``. La función *callback* es invocada por cada bloque de datos recibido, con un único argumento bytes que proporciona el bloque de datos. El argumento opcional *blocksize* especifica el tamaño máximo de fragmento que se leerá en el socket de bajo nivel creado para hacer la transferencia real (que también será el tamaño máximo de fragmento que se pasará a *callback*). Se elige un valor predeterminado razonable. *rest* significa lo mismo que en el método :meth:`transfercmd`.

source: Enable "passive" mode if *val* is true, otherwise disable passive mode. Passive mode is on by default.
es: Habilita el modo pasivo si *val* es verdadero, de lo contrario lo inhabilita. El modo pasivo es el valor predeterminado.

source: Store a file in binary transfer mode. *cmd* should be an appropriate ``STOR`` command: ``"STOR filename"``. *fp* is a :term:`file object` (opened in binary mode) which is read until EOF using its :meth:`~io.IOBase.read` method in blocks of size *blocksize* to provide the data to be stored. The *blocksize* argument defaults to 8192. *callback* is an optional single parameter callable that is called on each block of data after it is sent. *rest* means the same thing as in the :meth:`transfercmd` method.
es: Almacena un archivo en el modo de transferencia binaria. *cmd* debería ser un comando ``STOR``apropiado: ``"STOR filename"``. *fp* es un :term:`file object` (abierto en modo binario) que es leído hasta EOF (final del archivo) usando el método :meth:`~io.IOBase.read` en bloques de tamaño *blocksize* para proporcionar los datos que serán almacenados. El argumento *blocksize* toma 8192 como valor predeterminado. *callback* es un único parámetro invocable que se llama en cada bloque de datos luego de que fue enviado. *rest* significa lo mismo que en el método :meth:`transfercmd`.

source: *rest* parameter added.
es: Se agregó el parámetro *rest*.

source: Initiate a transfer over the data connection. If the transfer is active, send an ``EPRT`` or ``PORT`` command and the transfer command specified by *cmd*, and accept the connection. If the server is passive, send an ``EPSV`` or ``PASV`` command, connect to it, and start the transfer command. Either way, return the socket for the connection.
es: Inicia una transferencia sobre la conexión de datos. Si la transferencia es activa, envía un comando ``EPRT`` o ``PORT`` y el comando de transferencia especificado por *cmd*, y acepta la conexión. Si el servidor es pasivo, envía un comando ``EPSV`` o ``PASV``, lo conecta, e inicia el comando de transferencia. De cualquier manera, retorna el socket para la conexión.

source: Like :meth:`transfercmd`, but returns a tuple of the data connection and the expected size of the data. If the expected size could not be computed, ``None`` will be returned as the expected size. *cmd* and *rest* means the same thing as in :meth:`transfercmd`.
es: Como :meth:`transfercmd`, pero retorna una tupla de conexión de datos y el tamaño esperado de los datos. Si el tamaño esperado no se pudo computar, retornará ``None`` como tal. *cmd* y *rest* significan lo mismo que en :meth:`transfercmd`.

source: If your server supports the command, :meth:`mlsd` offers a better API.
es: Si tu servidor admite el comando, :meth:`mlsd` ofrece una API mejor.

source: Produce a directory listing as returned by the ``LIST`` command, printing it to standard output. The optional *argument* is a directory to list (default is the current server directory). Multiple arguments can be used to pass non-standard options to the ``LIST`` command. If the last argument is a function, it is used as a *callback* function as for :meth:`retrlines`; the default prints to ``sys.stdout``. This method returns ``None``.
es: Produce una lista de directorios como se retorna por el comando ``LIST``, imprimiéndola en una salida estándar. El *argument* opcional es un directorio a ser listado (el valor predeterminado es el directorio del servidor actual). Se pueden utilizar argumentos múltiples para pasar las opciones que no son estándar al comando ``LIST``. Si el último argumento es una función, se usa como función *callback* como en :meth:`retrlines`; el valor predeterminado imprime a ``sys.stdout``. Este método retorna ``None``.

source: Rename file *fromname* on the server to *toname*.
es: Asigna un nombre nuevo al archivo en el servidor desde *fromname* a *toname*.

source: Remove the file named *filename* from the server. If successful, returns the text of the response, otherwise raises :exc:`error_perm` on permission errors or :exc:`error_reply` on other errors.
es: Remueve el archivo nombrado *filename* del servidor. De ser exitoso, retorna el texto de la respuesta, de lo contrario, lanza :exc:`error_perm` sobre errores de permiso o :exc:`error_reply` sobre otros errores.

source: Set the current directory on the server.
es: Configura el directorio actual en el servidor.

source: Create a new directory on the server.
es: Crea un nuevo directorio en el servidor.

source: Return the pathname of the current directory on the server.
es: Retorna el nombre de ruta del directorio actual en el servidor.

source: Remove the directory named *dirname* on the server.
es: Elimina el directorio en el servidor llamado *dirname*.

source: Request the size of the file named *filename* on the server. On success, the size of the file is returned as an integer, otherwise ``None`` is returned. Note that the ``SIZE`` command is not standardized, but is supported by many common server implementations.
es: Solicita el tamaño del archivo llamado *filename* en el servidor. De ser exitoso, se retorna el tamaño del archivo como un entero, de lo contrario retorna ``None``. Nótese que el comando ``SIZE`` no está estandarizado, pero es admitido por muchas implementaciones comunes de servidor.

source: Send a ``QUIT`` command to the server and close the connection. This is the "polite" way to close a connection, but it may raise an exception if the server responds with an error to the ``QUIT`` command. This implies a call to the :meth:`close` method which renders the :class:`FTP` instance useless for subsequent calls (see below).
es: Envía un comando ``QUIT`` al servidor y cierra la conexión. Esta es la forma "políticamente correcta" de cerrar una conexión, pero puede lanzar una excepción si el servidor responde con un error al comando ``QUIT``. Esto implica una llamada al método :meth:`close` que hace inútil la instancia de :class:`FTP` para llamadas posteriores (véase más adelante).

source: Close the connection unilaterally. This should not be applied to an already closed connection such as after a successful call to :meth:`~FTP.quit`. After this call the :class:`FTP` instance should not be used any more (after a call to :meth:`close` or :meth:`~FTP.quit` you cannot reopen the connection by issuing another :meth:`login` method).
es: Cierra la conexión de forma unilateral. Esto no debería aplicarse a una conexión ya cerrada, como luego de una llamada exitosa a :meth:`~FTP.quit`. Después de esta llamada, la instancia :class:`FTP` ya no debería utilizarse (luego de una llamada a :meth:`close` o :meth:`~FTP.quit` no puedes abrir nuevamente la conexión emitiendo otro método :meth:`login`.

source: FTP_TLS Objects
es: Objetos FTP_TLS

source: :class:`FTP_TLS` class inherits from :class:`FTP`, defining these additional objects:
es: La clase :class:`FTP_TLS` hereda de :class:`FTP`, definiendo los siguientes objetos adicionales:

source: The SSL version to use (defaults to :attr:`ssl.PROTOCOL_SSLv23`).
es: La versión SSL para usar (toma como predeterminado :attr:`ssl.PROTOCOL_SSLv23`).

source: Set up a secure control connection by using TLS or SSL, depending on what is specified in the :attr:`ssl_version` attribute.
es: Establece una conexión de control segura usando TLS o SSL, dependiendo de qué esté especificado en el atributo :attr:`ssl_version`.

source: The method now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
es: El método ahora admite el chequeo del nombre de *host* con :attr:`ssl.SSLContext.check_hostname` y *Server Name Indication* (véase :data:`ssl.HAS_SNI`).

source: Revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports.
es: Revierte el canal de control a texto plano. Esto puede ser útil para aprovechar cortafuegos que saben manejar NAT con FTP no-seguro sin abrir puertos fijos.

source: Set up secure data connection.
es: Configura conexión de datos segura.

source: Set up clear text data connection.
es: Configura la conexión de datos de tipo texto común.
