Repository: python/python-docs-es
Catalog: library/functools.po
Languages: es

source: :mod:`functools` --- Higher-order functions and operations on callable objects
es: :mod:`functools` --- Funciones de orden superior y operaciones sobre objetos invocables

source: **Source code:** :source:`Lib/functools.py`
es: **Código fuente:** :source:`Lib/functools.py`

source: The :mod:`functools` module is for higher-order functions: functions that act on or return other functions. In general, any callable object can be treated as a function for the purposes of this module.
es: El módulo :mod:`functools` es para funciones de orden superior: funciones que actúan o retornan otras funciones. En general, cualquier objeto invocable puede ser tratado como una función para los propósitos de este módulo.

source: The :mod:`functools` module defines the following functions:
es: El módulo :mod:`functools` define las siguientes funciones:

source: Simple lightweight unbounded function cache. Sometimes called `"memoize" <https://en.wikipedia.org/wiki/Memoization>`_.
es: Caché de funciones ilimitado, ligero y simple. Aveces llamado `"memoización" <https://es.wikipedia.org/wiki/Memoizaci%C3%B3n>`_.

source: Returns the same as ``lru_cache(maxsize=None)``, creating a thin wrapper around a dictionary lookup for the function arguments. Because it never needs to evict old values, this is smaller and faster than :func:`lru_cache()` with a size limit.
es: Retorna lo mismo que ``lru_cache(maxsize=None)``, creando una envoltura delgada alrededor de una búsqueda de diccionario para los argumentos de la función. Debido a que nunca necesita desalojar los valores antiguos, esto es más pequeño y más rápido que :func:`lru_cache()` con un límite de tamaño.

source: For example::
es: Por ejemplo::

source: Transform a method of a class into a property whose value is computed once and then cached as a normal attribute for the life of the instance. Similar to :func:`property`, with the addition of caching. Useful for expensive computed properties of instances that are otherwise effectively immutable.
es: Transforma un método de una clase en una propiedad cuyo valor se computa una vez y luego se almacena como un atributo normal durante la vida de la instancia. Similar a :func:`property`, con la adición de caching. Útil para propiedades calculadas costosas de instancias que de otra manera son efectivamente inmutables.

source: Example::
es: Ejemplo::

source: The mechanics of :func:`cached_property` are somewhat different from :func:`property`. A regular property blocks attribute writes unless a setter is defined. In contrast, a *cached_property* allows writes.
es: La mecánica de :func:`cached_property` es algo diferente de :func:`property`. Un atributo de bloques de propiedad normal escribe a menos que se defina un establecedor. Por el contrario, *cached_property* permite escrituras.

source: The *cached_property* decorator only runs on lookups and only when an attribute of the same name doesn't exist. When it does run, the *cached_property* writes to the attribute with the same name. Subsequent attribute reads and writes take precedence over the *cached_property* method and it works like a normal attribute.
es: El decorador *cached_property* solo se ejecuta en búsquedas y solo cuando no existe un atributo con el mismo nombre. Cuando se ejecuta, *cached_property* escribe en el atributo con el mismo nombre. Las lecturas y escrituras de atributos posteriores tienen prioridad sobre el método *cached_property* y funciona como un atributo normal.

source: The cached value can be cleared by deleting the attribute. This allows the *cached_property* method to run again.
es: El valor en caché se puede borrar eliminando el atributo. Esto permite que el método *cached_property* se ejecute nuevamente.

source: Note, this decorator interferes with the operation of :pep:`412` key-sharing dictionaries. This means that instance dictionaries can take more space than usual.
es: Tenga en cuenta que este decorador interfiere con el funcionamiento de diccionarios de intercambio de claves :pep:`412`. Esto significa que los diccionarios de instancias pueden ocupar más espacio de lo habitual.

source: Also, this decorator requires that the ``__dict__`` attribute on each instance be a mutable mapping. This means it will not work with some types, such as metaclasses (since the ``__dict__`` attributes on type instances are read-only proxies for the class namespace), and those that specify ``__slots__`` without including ``__dict__`` as one of the defined slots (as such classes don't provide a ``__dict__`` attribute at all).
es: Además, este decorador requiere que el atributo ``__dict__`` en cada instancia sea un mapeo mutable. Esto significa que no funcionará con algunos tipos, como las metaclases (ya que los atributos ``__dict__`` en las instancias de tipos son proxies de solo lectura para el espacio de nombres de la clase) y aquellos que especifican ``__slots__`` sin incluir ``__dict__`` como una de las ranuras definidas (ya que tales clases no proporcionan un atributo ``__dict__`` en absoluto).

source: Transform an old-style comparison function to a :term:`key function`. Used with tools that accept key functions (such as :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). This function is primarily used as a transition tool for programs being converted from Python 2 which supported the use of comparison functions.
es: Transformar una función de comparación de estilo antiguo en una :term:`key function`. Se utiliza con herramientas que aceptan funciones clave (como :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). Esta función se utiliza principalmente como una herramienta de transición para los programas que se están convirtiendo a partir de Python 2, que soportaba el uso de funciones de comparación.

source: A comparison function is any callable that accepts two arguments, compares them, and returns a negative number for less-than, zero for equality, or a positive number for greater-than. A key function is a callable that accepts one argument and returns another value to be used as the sort key.
es: Una función de comparación es cualquier invocable que acepta dos argumentos, los compara y devuelve un número negativo para menor que, cero para igualdad o un número positivo para mayor que. Una función clave es una función invocable que acepta un argumento y devuelve otro valor para usar como clave de ordenación.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
es: Para ejemplos de clasificación y un breve tutorial de clasificación, ver :ref:`sortinghowto`.

source: Decorator to wrap a function with a memoizing callable that saves up to the *maxsize* most recent calls. It can save time when an expensive or I/O bound function is periodically called with the same arguments.
es: Decorador para envolver una función con un memorizador invocable que guarda hasta el *maxsize* de las llamadas más recientes. Puede salvar el tiempo cuando una función costosa o de E/S es llamada periódicamente con los mismos argumentos.

source: Distinct argument patterns may be considered to be distinct calls with separate cache entries. For example, ``f(a=1, b=2)`` and ``f(b=2, a=1)`` differ in their keyword argument order and may have two separate cache entries.
es: Los patrones de argumentos distintos pueden considerarse llamadas distintas con entradas de memoria caché separadas. Por ejemplo, ``f(a=1, b=2)`` y ``f(b=2, a=1)`` difieren en el orden de sus argumentos de palabras clave y pueden tener dos entradas de caché separadas.

source: If *user_function* is specified, it must be a callable. This allows the *lru_cache* decorator to be applied directly to a user function, leaving the *maxsize* at its default value of 128::
es: Si se especifica *user_function*, debe ser una llamada. Esto permite que el decorador *lru_cache* se aplique directamente a una función de usuario, dejando el *maxsize* en su valor por defecto de 128::

source: If *maxsize* is set to ``None``, the LRU feature is disabled and the cache can grow without bound.
es: Si *maxsize* está configurado como ``None``, la función LRU está desactivada y la caché puede crecer sin límites.

source: If *typed* is set to true, function arguments of different types will be cached separately. If *typed* is false, the implementation will usually regard them as equivalent calls and only cache a single result. (Some types such as *str* and *int* may be cached separately even when *typed* is false.)
es: Si *typed* se establece en verdadero, los argumentos de función de diferentes tipos se almacenarán en caché por separado. Si *typed* es falso, la implementación generalmente las considerará como llamadas equivalentes y solo almacenará en caché un único resultado. (Algunos tipos como *str* y *int* pueden almacenarse en caché por separado incluso cuando *typed* es falso).

source: Note, type specificity applies only to the function's immediate arguments rather than their contents. The scalar arguments, ``Decimal(42)`` and ``Fraction(42)`` are be treated as distinct calls with distinct results. In contrast, the tuple arguments ``('answer', Decimal(42))`` and ``('answer', Fraction(42))`` are treated as equivalent.
es: Tenga en cuenta que la especificidad de tipo se aplica solo a los argumentos inmediatos de la función en lugar de a su contenido. Los argumentos escalares, ``Decimal(42)`` y ``Fraction(42)`` se tratan como llamadas distintas con resultados distintos. Por el contrario, los argumentos de tupla ``('answer', Decimal(42))`` y ``('answer', Fraction(42))`` se tratan como equivalentes.

source: The wrapped function is instrumented with a :func:`cache_parameters` function that returns a new :class:`dict` showing the values for *maxsize* and *typed*. This is for information purposes only. Mutating the values has no effect.
es: La función envuelta está instrumentada con una función :func:`cache_parameters` que retorna un nuevo :class:`dict` que muestra los valores para *maxsize* y *typed*. Esto es solo para fines informativos. La mutación de los valores no tiene ningún efecto.

source: To help measure the effectiveness of the cache and tune the *maxsize* parameter, the wrapped function is instrumented with a :func:`cache_info` function that returns a :term:`named tuple` showing *hits*, *misses*, *maxsize* and *currsize*.
es: Para ayudar a medir la efectividad de la caché y afinar el parámetro *maxsize*, la función envolvente está instrumentada con una función :func:`cache_info` que retorna un :term:`named tuple` mostrando *hits*, *misses*, *maxsize* y *currsize*.

source: The decorator also provides a :func:`cache_clear` function for clearing or invalidating the cache.
es: El decorador también proporciona una función :func:`cache_clear` para limpiar o invalidar la caché.

source: The original underlying function is accessible through the :attr:`__wrapped__` attribute. This is useful for introspection, for bypassing the cache, or for rewrapping the function with a different cache.
es: La función subyacente original es accesible a través del atributo :attr:`__wrapped__`. Esto es útil para la introspección, para evitar el caché, o para volver a envolver la función con un caché diferente.

source: The cache keeps references to the arguments and return values until they age out of the cache or until the cache is cleared.
es: La caché mantiene referencias de los argumentos y retorna los valores hasta que se caduquen de la caché o hasta que se borre la caché.

source: If a method is cached, the ``self`` instance argument is included in the cache. See :ref:`faq-cache-method-calls`
es: Si un método se almacena en caché, el argumento de la instancia ``self`` se incluye en el caché. Ver :ref:`faq-cache-method-calls`

source: An `LRU (least recently used) cache <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_recently_used_(LRU)>`_ works best when the most recent calls are the best predictors of upcoming calls (for example, the most popular articles on a news server tend to change each day). The cache's size limit assures that the cache does not grow without bound on long-running processes such as web servers.
es: Un `caché LRU (menos usado recientemente) <https://es.wikipedia.org/wiki/Algoritmo_de_cach%C3%A9#Menos_usado_recientemente_(LRU)>`_ funciona mejor cuando las llamadas más recientes son los mejores predictores de las próximas llamadas (por ejemplo, el los artículos más populares en un servidor de noticias tienden a cambiar cada día). El límite de tamaño de la caché asegura que la caché no crezca sin límites en procesos de larga ejecución como servidores web.

source: Example of an LRU cache for static web content::
es: Ejemplo de un caché de la LRU para contenido web estático::

source: Example of efficiently computing `Fibonacci numbers <https://en.wikipedia.org/wiki/Fibonacci_number>`_ using a cache to implement a `dynamic programming <https://en.wikipedia.org/wiki/Dynamic_programming>`_ technique::
es: Ejemplo de computar eficientemente los `números de Fibonacci <https://en.wikipedia.org/wiki/Fibonacci_number>`_ usando una memoria caché para implementar una técnica de `programación dinámica <https://en.wikipedia.org/wiki/Dynamic_programming>`_::

source: Added the *typed* option.
es: Añadida la opción *typed* option.

source: Added the *user_function* option.
es: Añadida la opción *user_function*.

source: Added the function :func:`cache_parameters`
es: Añadida la función :func:`cache_parameters`

source: Given a class defining one or more rich comparison ordering methods, this class decorator supplies the rest. This simplifies the effort involved in specifying all of the possible rich comparison operations:
es: Dada una clase que define uno o más métodos de ordenamiento de comparación ricos, este decorador de clase suministra el resto. Esto simplifica el esfuerzo de especificar todas las posibles operaciones de comparación rica:

source: The class must define one of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`. In addition, the class should supply an :meth:`__eq__` method.
es: La clase debe definir uno de :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, o :meth:`__ge__`. Además, la clase debe suministrar un método :meth:`__eq__`. Dada una clase que define uno o más métodos de ordenamiento de comparación ricos, este decorador de clase suministra el resto. Esto simplifica el esfuerzo de especificar todas las posibles operaciones de comparación rica.

source: While this decorator makes it easy to create well behaved totally ordered types, it *does* come at the cost of slower execution and more complex stack traces for the derived comparison methods. If performance benchmarking indicates this is a bottleneck for a given application, implementing all six rich comparison methods instead is likely to provide an easy speed boost.
es: Mientras que este decorador facilita la creación de tipos bien comportados y totalmente ordenados, *does* a costa de una ejecución más lenta y de trazos de pila (*stack traces*) más complejos para los métodos de comparación derivados. Si la evaluación comparativa del rendimiento indica que se trata de un cuello de botella para una aplicación determinada, la aplicación de los seis métodos de comparación ricos en su lugar es probable que proporcione un fácil aumento de la velocidad.

source: This decorator makes no attempt to override methods that have been declared in the class *or its superclasses*. Meaning that if a superclass defines a comparison operator, *total_ordering* will not implement it again, even if the original method is abstract.
es: Este decorador no intenta anular métodos que han sido declarados en la clase *sus superclases*. Lo que significa que si una superclase define un operador de comparación, *total_ordering* no lo implementará de nuevo, incluso si el método original es abstracto.

source: Returning NotImplemented from the underlying comparison function for unrecognised types is now supported.
es: Retornando NotImplemented de la función de comparación subyacente para los tipos no reconocidos está ahora soportado.

source: Return a new :ref:`partial object<partial-objects>` which when called will behave like *func* called with the positional arguments *args* and keyword arguments *keywords*. If more arguments are supplied to the call, they are appended to *args*. If additional keyword arguments are supplied, they extend and override *keywords*. Roughly equivalent to::
es: Retorna un nuevo :ref:`partial object<partial-objects>` que cuando sea llamado se comportará como *func* llamado con los argumentos posicionales *args* y los argumentos de palabras clave *keywords*. Si se suministran más argumentos a la llamada, se añaden a *args*. Si se suministran más argumentos de palabras clave, se extienden y anulan las *keywords*. Aproximadamente equivalente a::

source: The :func:`partial` is used for partial function application which "freezes" some portion of a function's arguments and/or keywords resulting in a new object with a simplified signature. For example, :func:`partial` can be used to create a callable that behaves like the :func:`int` function where the *base* argument defaults to two:
es: El :func:`partial` se utiliza para la aplicación de funciones parciales que "congela" (*freezes*) alguna porción de los argumentos y/o palabras clave de una función dando como resultado un nuevo objeto con una firma simplificada. Por ejemplo, :func:`partial` puede usarse para crear una llamada que se comporte como la función :func:`int` donde el argumento *base* tiene un valor por defecto de dos:

source: Return a new :class:`partialmethod` descriptor which behaves like :class:`partial` except that it is designed to be used as a method definition rather than being directly callable.
es: Retorna un nuevo descriptor :class:`partialmethod` que se comporta como :class:`partial` excepto que está diseñado para ser usado como una definición de método en lugar de ser directamente invocable.

source: *func* must be a :term:`descriptor` or a callable (objects which are both, like normal functions, are handled as descriptors).
es: *func* debe ser un :term:`descriptor` o un invocable (los objetos que son ambos, como las funciones normales, se manejan como descriptores).

source: When *func* is a descriptor (such as a normal Python function, :func:`classmethod`, :func:`staticmethod`, :func:`abstractmethod` or another instance of :class:`partialmethod`), calls to ``__get__`` are delegated to the underlying descriptor, and an appropriate :ref:`partial object<partial-objects>` returned as the result.
es: Cuando *func* es un descriptor (como una función Python normal, :func:`classmethod`, :func:`staticmethod`, :func:`abstractmethod` u otra instancia de :class:`partialmethod`), las llamadas a ``__get__`` se delegan al descriptor subyacente, y se retorna un :ref:`partial object<partial-objects>` apropiado como resultado.

source: When *func* is a non-descriptor callable, an appropriate bound method is created dynamically. This behaves like a normal Python function when used as a method: the *self* argument will be inserted as the first positional argument, even before the *args* and *keywords* supplied to the :class:`partialmethod` constructor.
es: Cuando *func* es una llamada no descriptiva, se crea dinámicamente un método de unión apropiado. Esto se comporta como una función Python normal cuando se usa como método: el argumento *self* se insertará como el primer argumento posicional, incluso antes de las *args* y *keywords* suministradas al constructor :class:`partialmethod`.

source: Apply *function* of two arguments cumulatively to the items of *iterable*, from left to right, so as to reduce the iterable to a single value. For example, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` calculates ``((((1+2)+3)+4)+5)``. The left argument, *x*, is the accumulated value and the right argument, *y*, is the update value from the *iterable*. If the optional *initializer* is present, it is placed before the items of the iterable in the calculation, and serves as a default when the iterable is empty. If *initializer* is not given and *iterable* contains only one item, the first item is returned.
es: Aplicar una *función* de dos argumentos acumulativos a los elementos de *iterable*, de izquierda a derecha, para reducir los itables a un solo valor. Por ejemplo, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` calcula ``((((1+2)+3)+4)+5)``. El argumento de la izquierda, *x*, es el valor acumulado y el de la derecha, *y*, es el valor de actualización del *iterable*. Si el *initializer* opcional está presente, se coloca antes de los ítems de la iterable en el cálculo, y sirve como predeterminado cuando la *iterable* está vacía. Si no se da el *initializer* y el *iterable* contiene sólo un elemento, se retorna el primer elemento.

source: Roughly equivalent to::
es: Aproximadamente equivalente a::

source: See :func:`itertools.accumulate` for an iterator that yields all intermediate values.
es: Ver :func:`itertools.accumulate` para un iterador que produce todos los valores intermedios.

source: Transform a function into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
es: Transformar una función en una :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic function, decorate it with the ``@singledispatch`` decorator. When defining a function using ``@singledispatch``, note that the dispatch happens on the type of the first argument::
es: Para definir una función genérica, decórala con el decorador ``@singledispatch``. Al definir una función usando ``@singledispatch``, tenga en cuenta que el envío ocurre en el tipo del primer argumento:

source: To add overloaded implementations to the function, use the :func:`register` attribute of the generic function, which can be used as a decorator. For functions annotated with types, the decorator will infer the type of the first argument automatically::
es: Para agregar implementaciones sobrecargadas a la función, use el atributo :func:`register` de la función genérica, que se puede usar como decorador. Para las funciones anotadas con tipos, el decorador inferirá automáticamente el tipo del primer argumento:

source: :data:`types.UnionType` and :data:`typing.Union` can also be used::
es: También se pueden utilizar :data:`types.UnionType` y :data:`typing.Union`:

source: For code which doesn't use type annotations, the appropriate type argument can be passed explicitly to the decorator itself::
es: Para el código que no utiliza anotaciones de tipo, el argumento de tipo apropiado puede ser pasado explícitamente al propio decorador::

source: To enable registering :term:`lambdas<lambda>` and pre-existing functions, the :func:`register` attribute can also be used in a functional form::
es: Para habilitar el registro de :term:`lambdas<lambda>` y funciones preexistentes, el atributo :func:`register` también se puede utilizar de forma funcional:

source: The :func:`register` attribute returns the undecorated function. This enables decorator stacking, :mod:`pickling<pickle>`, and the creation of unit tests for each variant independently::
es: El atributo :func:`register` devuelve la función sin decorar. Esto permite el apilamiento de decoradores, :mod:`pickling<pickle>`, y la creación de pruebas unitarias para cada variante de forma independiente:

source: When called, the generic function dispatches on the type of the first argument::
es: Cuando se llama, la función genérica despacha sobre el tipo del primer argumento::
