Repository: python/python-docs-es
Catalog: library/functools.po
Languages: es

source: Where there is no registered implementation for a specific type, its method resolution order is used to find a more generic implementation. The original function decorated with ``@singledispatch`` is registered for the base :class:`object` type, which means it is used if no better implementation is found.
es: Cuando no hay una implementación registrada para un tipo específico, se usa su orden de resolución de métodos para encontrar una implementación más genérica. La función original decorada con ``@singledispatch`` está registrada para el tipo base :class:`object`, lo que significa que se usa si no se encuentra una implementación mejor.

source: If an implementation is registered to an :term:`abstract base class`, virtual subclasses of the base class will be dispatched to that implementation::
es: Si una implementación está registrada en un :term:`abstract base class`, las subclases virtuales de la clase base se enviarán a esa implementación:

source: To check which implementation the generic function will choose for a given type, use the ``dispatch()`` attribute::
es: Para verificar qué implementación elegirá la función genérica para un tipo dado, use el atributo ``dispatch()``:

source: To access all registered implementations, use the read-only ``registry`` attribute::
es: Para acceder a todas las implementaciones registradas, utilice el atributo ``registry`` de sólo lectura::

source: The :func:`register` attribute now supports using type annotations.
es: El atributo :func:`register` ahora admite el uso de anotaciones de tipo.

source: The :func:`register` attribute now supports :data:`types.UnionType` and :data:`typing.Union` as type annotations.
es: El atributo :func:`register` ahora admite :data:`types.UnionType` y :data:`typing.Union` como anotaciones de tipo.

source: Transform a method into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
es: Transformar un método en un :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic method, decorate it with the ``@singledispatchmethod`` decorator. When defining a function using ``@singledispatchmethod``, note that the dispatch happens on the type of the first non-*self* or non-*cls* argument::
es: Para definir un método genérico, decóralo con el decorador ``@singledispatchmethod``. Al definir una función usando ``@singledispatchmethod``, tenga en cuenta que el envío ocurre en el tipo del primer argumento no *self* o no *cls*:

source: ``@singledispatchmethod`` supports nesting with other decorators such as :func:`@classmethod<classmethod>`. Note that to allow for ``dispatcher.register``, ``singledispatchmethod`` must be the *outer most* decorator. Here is the ``Negator`` class with the ``neg`` methods bound to the class, rather than an instance of the class::
es: ``@singledispatchmethod`` admite la anidación con otros decoradores como :func:`@classmethod<classmethod>`. Tenga en cuenta que para permitir ``dispatcher.register``, ``singledispatchmethod`` debe ser el decorador *más externo*. Aquí está la clase ``Negator`` con los métodos ``neg`` vinculados a la clase, en lugar de una instancia de la clase:

source: The same pattern can be used for other similar decorators: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>`, and others.
es: El mismo patrón se puede utilizar para otros decoradores similares: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>` y otros.

source: Update a *wrapper* function to look like the *wrapped* function. The optional arguments are tuples to specify which attributes of the original function are assigned directly to the matching attributes on the wrapper function and which attributes of the wrapper function are updated with the corresponding attributes from the original function. The default values for these arguments are the module level constants ``WRAPPER_ASSIGNMENTS`` (which assigns to the wrapper function's ``__module__``, ``__name__``, ``__qualname__``, ``__annotations__`` and ``__doc__``, the documentation string) and ``WRAPPER_UPDATES`` (which updates the wrapper function's ``__dict__``, i.e. the instance dictionary).
es: Actualiza una función *wrapper* para que se parezca a la función *wrapped*. Los argumentos opcionales son tuplas para especificar qué atributos de la función original se asignan directamente a los atributos coincidentes en la función contenedora y qué atributos de la función contenedora se actualizan con los atributos correspondientes de la función original. Los valores predeterminados para estos argumentos son las constantes de nivel de módulo ``WRAPPER_ASSIGNMENTS`` (que se asigna a la función contenedora ``__module__``, ``__name__``, ``__qualname__``, ``__annotations__`` y ``__doc__``, la cadena de caracteres de documentación) y ``WRAPPER_UPDATES`` (que actualiza el ``__dict__`` de la función contenedora, es decir, el diccionario de instancia).

source: To allow access to the original function for introspection and other purposes (e.g. bypassing a caching decorator such as :func:`lru_cache`), this function automatically adds a ``__wrapped__`` attribute to the wrapper that refers to the function being wrapped.
es: Para permitir el acceso a la función original para la introspección y otros propósitos (por ejemplo, evitando un decorador de caché como :func:`lru_cache`), esta función añade automáticamente un atributo ``__wrapped__`` al envoltorio que se refiere a la función que se está envolviendo.

source: The main intended use for this function is in :term:`decorator` functions which wrap the decorated function and return the wrapper. If the wrapper function is not updated, the metadata of the returned function will reflect the wrapper definition rather than the original function definition, which is typically less than helpful.
es: El principal uso previsto para esta función es en :term:`decorator` functions que envuelven la función decorada y retornan el envoltorio. Si la función de envoltura no se actualiza, los metadatos de la función retornada reflejarán la definición de la envoltura en lugar de la definición de la función original, lo que normalmente no es de gran ayuda.

source: :func:`update_wrapper` may be used with callables other than functions. Any attributes named in *assigned* or *updated* that are missing from the object being wrapped are ignored (i.e. this function will not attempt to set them on the wrapper function). :exc:`AttributeError` is still raised if the wrapper function itself is missing any attributes named in *updated*.
es: :func:`update_wrapper` puede ser usado con otros invocables que no sean funciones. Cualquier atributo nombrado en *assigned* o *updated* que falte en el objeto que se está invoca se ignora (es decir, esta función no intentará establecerlos en la función de envoltura (*wrapper*)). :exc:`AttributeError` sigue apareciendo si la propia función de envoltura no tiene ningún atributo nombrado en *updated*.

source: Automatic addition of the ``__wrapped__`` attribute.
es: Adición automática de ``__wrapped__`` attribute.

source: Copying of the ``__annotations__`` attribute by default.
es: Copia del atributo ``__annotations__`` por defecto.

source: Missing attributes no longer trigger an :exc:`AttributeError`.
es: Los atributos faltantes ya no desencadenan un :exc:`AtributoError`.

source: The ``__wrapped__`` attribute now always refers to the wrapped function, even if that function defined a ``__wrapped__`` attribute. (see :issue:`17482`)
es: El atributo ``__wrapped__`` ahora siempre se refiere a la función envuelta, incluso si esa función definió un atributo ``__wrapped__``. (see :issue:`17482`)

source: This is a convenience function for invoking :func:`update_wrapper` as a function decorator when defining a wrapper function. It is equivalent to ``partial(update_wrapper, wrapped=wrapped, assigned=assigned, updated=updated)``. For example::
es: Esta es una función conveniente para invocar :func:`update_wrapper` como decorador de la función cuando se define una función de envoltura (*wrapper*). Es equivalente a ``partial(update_wrapper, wrapped=wrapped, assigned=assigned, updated=updated)``. Por ejemplo::

source: Without the use of this decorator factory, the name of the example function would have been ``'wrapper'``, and the docstring of the original :func:`example` would have been lost.
es: Sin el uso de esta fábrica de decoradores, el nombre de la función de ejemplo habría sido ``'wrapper'``, y el docstring de la :func:`example` se habría perdido.

source: :class:`partial` Objects
es: :class:`partial` Objetos

source: :class:`partial` objects are callable objects created by :func:`partial`. They have three read-only attributes:
es: Los objetos :class:`partial` son objetos invocables creados por :func:`partial`. Tienen tres atributos de sólo lectura:

source: A callable object or function. Calls to the :class:`partial` object will be forwarded to :attr:`func` with new arguments and keywords.
es: Un objeto o función invocable. Las llamadas al objeto :class:`partial` serán reenviadas a :attr:`func` con nuevos argumentos y palabras clave.

source: The leftmost positional arguments that will be prepended to the positional arguments provided to a :class:`partial` object call.
es: Los argumentos posicionales de la izquierda que se prepararán para los argumentos posicionales proporcionados un llamado al objeto :class:`partial`.

source: The keyword arguments that will be supplied when the :class:`partial` object is called.
es: Los argumentos de la palabra clave que se suministrarán cuando se llame al objeto :class:`partial`.

source: :class:`partial` objects are like :class:`function` objects in that they are callable, weak referencable, and can have attributes. There are some important differences. For instance, the :attr:`~definition.__name__` and :attr:`__doc__` attributes are not created automatically. Also, :class:`partial` objects defined in classes behave like static methods and do not transform into bound methods during instance attribute look-up.
es: Los objetos :class:`partial` son como los objetos :class:`function` que son invocables, de referencia débil y pueden tener atributos. Hay algunas diferencias importantes. Por ejemplo, los atributos :attr:`~definition.__name__` y :attr:`__doc__` no se crean automáticamente. Además, los objetos :class:`partial` definidos en las clases se comportan como métodos estáticos y no se transforman en métodos vinculados durante la búsqueda de atributos de la instancia.
