Repository: python/python-docs-es
Catalog: library/gc.po
Languages: es

source: :mod:`gc` --- Garbage Collector interface
es: :mod:`gc` --- Interfaz del recolector de basura

source: This module provides an interface to the optional garbage collector. It provides the ability to disable the collector, tune the collection frequency, and set debugging options. It also provides access to unreachable objects that the collector found but cannot free. Since the collector supplements the reference counting already used in Python, you can disable the collector if you are sure your program does not create reference cycles. Automatic collection can be disabled by calling ``gc.disable()``. To debug a leaking program call ``gc.set_debug(gc.DEBUG_LEAK)``. Notice that this includes ``gc.DEBUG_SAVEALL``, causing garbage-collected objects to be saved in gc.garbage for inspection.
es: Este módulo proporciona una interfaz para el recolector de basura opcional (recolector de basura cíclico generacional). Proporciona la capacidad de deshabilitar el recolector, ajustar la frecuencia de recolección y establecer opciones de depuración. También proporciona acceso a objetos inaccesibles (*unreachables*) que el recolector encontró pero no pudo liberar. Dado que el recolector de basura complementa el conteo de referencias, que ya se utiliza en Python, es posible desactivarlo siempre que se esté seguro de que el programa no crea referencias cíclicas. La recolección automática se puede desactivar llamando a ``gc.disable()``. Para depurar un programa con fugas de memoria, se debe llamar a ``gc.set_debug(gc.DEBUG_LEAK)``. Se debe tener en cuenta que la llamada anterior incluye ``gc.DEBUG_SAVEALL``, lo que hace que los objetos recolectados se guarden en *gc.garbage* para su inspección.

source: The :mod:`gc` module provides the following functions:
es: El módulo :mod:`gc` proporciona las siguientes funciones:

source: Enable automatic garbage collection.
es: Habilita la recolección automática de basura.

source: Disable automatic garbage collection.
es: Deshabilita la recolección automática de basura.

source: Return ``True`` if automatic collection is enabled.
es: Retorna ``True`` si la recolección automática está habilitada.

source: With no arguments, run a full collection. The optional argument *generation* may be an integer specifying which generation to collect (from 0 to 2). A :exc:`ValueError` is raised if the generation number is invalid. The number of unreachable objects found is returned.
es: Sin argumentos, ejecuta una recolección completa. El argumento opcional *generation* debe ser un número entero que especifica qué generación recolectar (de 0 a 2). Una excepción :exc:`ValueError` será lanzada si el número de generación no es válido. Se retorna el número de objetos inaccesibles encontrados.

source: The free lists maintained for a number of built-in types are cleared whenever a full collection or collection of the highest generation (2) is run. Not all items in some free lists may be freed due to the particular implementation, in particular :class:`float`.
es: Las listas libres mantenidas para varios tipos incorporados son borradas cada vez que se ejecuta una recolección completa o una recolección de la generación más alta (2). No obstante, no todos los elementos de algunas listas libres pueden ser liberados, particularmente :class:`float`, debido a su implementación particular.

source: The effect of calling ``gc.collect()`` while the interpreter is already performing a collection is undefined.
es: El efecto de llamar a ``gc.collect()`` mientras el intérprete ya está realizando una recolección es indefinido.

source: Set the garbage collection debugging flags. Debugging information will be written to ``sys.stderr``. See below for a list of debugging flags which can be combined using bit operations to control debugging.
es: Establece las flags de depuración para la recolección de basura. La información de depuración se escribirá en ``sys.stderr``. A continuación se puede consultar una lista con las flags de depuración disponibles, que se pueden combinar mediante operaciones de bits para controlar la depuración.

source: Return the debugging flags currently set.
es: Retorna las flags de depuración actualmente establecidas.

source: Returns a list of all objects tracked by the collector, excluding the list returned. If *generation* is not None, return only the objects tracked by the collector that are in that generation.
es: Retorna una lista de todos los objetos rastreados por el recolector, excluyendo la lista retornada. Si *generation* no es ``None``, retorna solo los objetos rastreados por el recolector que pertenecen a esa generación.

source: New *generation* parameter.
es: Se agregó el parámetro *generation*.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_objects`` with argument ``generation``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``gc.get_objects`` con el argumento ``generation``.

source: Return a list of three per-generation dictionaries containing collection statistics since interpreter start. The number of keys may change in the future, but currently each dictionary will contain the following items:
es: Retorna una lista de tres diccionarios, uno por cada generación, que contienen estadísticas de recolección desde el inicio del intérprete. El número de claves puede cambiar en el futuro, pero actualmente cada diccionario contendrá los siguientes elementos:

source: ``collections`` is the number of times this generation was collected;
es: ``collections`` es el número de veces que se recolectó esta generación;

source: ``collected`` is the total number of objects collected inside this generation;
es: ``collected`` es el número total de objetos recolectados dentro de esta generación;

source: ``uncollectable`` is the total number of objects which were found to be uncollectable (and were therefore moved to the :data:`garbage` list) inside this generation.
es: ``uncollectable`` es el número total de objetos que se consideraron no recolectables (y por lo tanto, se movieron a la lista :data:`garbage`) dentro de esta generación.

source: Set the garbage collection thresholds (the collection frequency). Setting *threshold0* to zero disables collection.
es: Establece los umbrales de recolección (la frecuencia de recolección). Si se establece *threshold0* en cero se deshabilita la recolección.

source: The GC classifies objects into three generations depending on how many collection sweeps they have survived. New objects are placed in the youngest generation (generation ``0``). If an object survives a collection it is moved into the next older generation. Since generation ``2`` is the oldest generation, objects in that generation remain there after a collection. In order to decide when to run, the collector keeps track of the number object allocations and deallocations since the last collection. When the number of allocations minus the number of deallocations exceeds *threshold0*, collection starts. Initially only generation ``0`` is examined. If generation ``0`` has been examined more than *threshold1* times since generation ``1`` has been examined, then generation ``1`` is examined as well. With the third generation, things are a bit more complicated, see `Collecting the oldest generation <https://devguide.python.org/garbage_collector/#collecting-the-oldest-generation>`_ for more information.
es: El recolector de basura (GC por sus siglas en inglés) clasifica los objetos en tres generaciones dependiendo de cuántos barridos de colección hayan sobrevivido. Los nuevos objetos se colocan en la generación más joven (generación ``0``). Si un objeto sobrevive a una colección, se traslada a la siguiente generación anterior. Dado que la generación ``2`` es la generación más antigua, los objetos de esa generación permanecen allí después de una colección. Para decidir cuándo ejecutar, el recopilador realiza un seguimiento del número de asignaciones y desasignaciones de objetos desde la última recopilación. Cuando el número de asignaciones menos el número de desasignaciones supera el *treshold0*, comienza la recopilación. Inicialmente solo se examina la generación ``0``. Si la generación ``0`` se ha examinado más de *treshold1* veces desde que se examinó la generación ``1``, también se examina la generación ``1``. Con la tercera generación, las cosas son un poco más complicadas, consulte `Recopilación de la generación más antigua <https://devguide.python.org/garbage_collector/#collecting-the-oldest-generation>`_ para obtener más información.

source: Return the current collection counts as a tuple of ``(count0, count1, count2)``.
es: Retorna los recuentos de la recolección actual como una tupla de la forma ``(count0, count1, count2)``.

source: Return the current collection thresholds as a tuple of ``(threshold0, threshold1, threshold2)``.
es: Retorna los umbrales de la recolección actual como una tupla de la forma ``(threshold0, threshold1, threshold2)``.

source: Return the list of objects that directly refer to any of objs. This function will only locate those containers which support garbage collection; extension types which do refer to other objects but do not support garbage collection will not be found.
es: Retorna la lista de objetos que referencian de forma directa a cualquiera de *objs*. Esta función solo localizará aquellos contenedores que admitan la recolección de basura; no se localizarán los tipos de extensión que referencian a otros objetos pero que no admiten la recolección de basura.

source: Note that objects which have already been dereferenced, but which live in cycles and have not yet been collected by the garbage collector can be listed among the resulting referrers. To get only currently live objects, call :func:`collect` before calling :func:`get_referrers`.
es: Téngase en cuenta que los objetos que ya se han desreferenciado, pero que tienen referencias cíclicas y aún no han sido recolectados por el recolector de basura pueden enumerarse entre las referencias resultantes. Para obtener solo los objetos activos actualmente, llame a :func:`collect` antes de llamar a :func:`get_referrers`.

source: Care must be taken when using objects returned by :func:`get_referrers` because some of them could still be under construction and hence in a temporarily invalid state. Avoid using :func:`get_referrers` for any purpose other than debugging.
es: Se debe tener un especial cuidado cuando se usan objetos retornados por :func:`get_referrers` dado que algunos de ellos aún podrían estar en construcción y por tanto en un estado temporalmente inválido. Debe evitarse el uso de :func:`get_referrers` para cualquier propósito que no sea la depuración.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referrers`` with argument ``objs``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``gc.get_referrers`` con el argumento ``objs``.

source: Return a list of objects directly referred to by any of the arguments. The referents returned are those objects visited by the arguments' C-level :c:member:`~PyTypeObject.tp_traverse` methods (if any), and may not be all objects actually directly reachable. :c:member:`~PyTypeObject.tp_traverse` methods are supported only by objects that support garbage collection, and are only required to visit objects that may be involved in a cycle. So, for example, if an integer is directly reachable from an argument, that integer object may or may not appear in the result list.
es: Retorna una lista de objetos a los que hace referencia directamente cualquiera de los argumentos. Las referencias retornadas son aquellos objetos visitados por los métodos :c:member:`~PyTypeObject.tp_traverse` a nivel de C de los argumentos (si los hay) y es posible que no todos los objetos sean directamente accesibles realmente. Los métodos :c:member:`~PyTypeObject.tp_traverse` solo son compatibles con los objetos que admiten recolección de basura y solo se requieren para visitar objetos que pueden estar involucrados en un ciclo de referencias. Lo que quiere decir que, por ejemplo, si se puede acceder directamente a un número entero desde uno de los argumento, ese objeto entero puede aparecer o no en la lista de resultados.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referents`` with argument ``objs``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``gc.get_referents`` con el argumento ``objs``.

source: Returns ``True`` if the object is currently tracked by the garbage collector, ``False`` otherwise. As a general rule, instances of atomic types aren't tracked and instances of non-atomic types (containers, user-defined objects...) are. However, some type-specific optimizations can be present in order to suppress the garbage collector footprint of simple instances (e.g. dicts containing only atomic keys and values)::
es: Retorna ``True`` si el recolector de basura rastrea actualmente el objeto y ``False`` en caso contrario. Como regla general, las instancias de tipos atómicos no se rastrean y las instancias de tipos no atómicos (contenedores, objetos definidos por el usuario ...) sí. Sin embargo, algunas optimizaciones específicas de tipo pueden estar presentes para suprimir el impacto del recolector de basura en instancias simples (por ejemplo, diccionarios que contienen solo claves y valores atómicos)::

source: Returns ``True`` if the given object has been finalized by the garbage collector, ``False`` otherwise. ::
es: Retorna ``True`` si el objeto dado ha sido finalizado por el recolector de basura, ``False`` en caso contrario. ::

source: Freeze all the objects tracked by the garbage collector; move them to a permanent generation and ignore them in all the future collections.
es: Congela todos los objetos rastreados por el recolector de basura; los mueve a una generación permanente y los ignora en todas las recolecciones futuras.

source: If a process will ``fork()`` without ``exec()``, avoiding unnecessary copy-on-write in child processes will maximize memory sharing and reduce overall memory usage. This requires both avoiding creation of freed "holes" in memory pages in the parent process and ensuring that GC collections in child processes won't touch the ``gc_refs`` counter of long-lived objects originating in the parent process. To accomplish both, call ``gc.disable()`` early in the parent process, ``gc.freeze()`` right before ``fork()``, and ``gc.enable()`` early in child processes.
es: Si un proceso va a llamar a ``fork()`` sin llamar a ``exec()``, evitar la copia en escritura innecesaria en procesos secundarios maximizará el intercambio de memoria y reducirá el uso general de la memoria. Esto requiere tanto evitar la creación de "agujeros" liberados en las páginas de memoria del proceso principal y garantizar que las colecciones de GC en los procesos secundarios no tocarán el contador ``gc_refs`` de objetos de larga duración que se originan en el proceso principal. Para lograr ambas cosas, llame a ``gc.disable()`` al principio del proceso principal, a ``gc.freeze()`` justo antes de ``fork()`` y a ``gc.enable()`` al principio. en procesos secundarios.

source: Unfreeze the objects in the permanent generation, put them back into the oldest generation.
es: Descongela los objetos de la generación permanente y vuelve a colocarlos en la generación más antigua.

source: Return the number of objects in the permanent generation.
es: Retorna el número de objetos de la generación permanente.

source: The following variables are provided for read-only access (you can mutate the values but should not rebind them):
es: Las siguientes variables se proporcionan para acceso de solo lectura (se pueden mutar los valores pero no se deben vincular de nuevo):

source: A list of objects which the collector found to be unreachable but could not be freed (uncollectable objects). Starting with Python 3.4, this list should be empty most of the time, except when using instances of C extension types with a non-``NULL`` ``tp_del`` slot.
es: Una lista de objetos que el recolector consideró inaccesibles pero que no pudieron ser liberados (objetos que no se pueden recolectar). A partir de Python 3.4, esta lista debe estar vacía la mayor parte del tiempo, excepto cuando se utilizan instancias de tipos de extensión C en los que la ranura (*slot*) ``tp_del`` no sea ``NULL``.

source: If :const:`DEBUG_SAVEALL` is set, then all unreachable objects will be added to this list rather than freed.
es: Si se establece :const:`DEBUG_SAVEALL`, todos los objetos inaccesibles se agregarán a esta lista en lugar de ser liberados.

source: If this list is non-empty at :term:`interpreter shutdown`, a :exc:`ResourceWarning` is emitted, which is silent by default. If :const:`DEBUG_UNCOLLECTABLE` is set, in addition all uncollectable objects are printed.
es: Si la lista no está vacía en el momento del :term:`interpreter shutdown`, se emite un :exc:`ResourceWarning`, que es silencioso de forma predeterminada. Si se establece :const:`DEBUG_UNCOLLECTABLE`, además se imprimen todos los objetos no recolectables.

source: Following :pep:`442`, objects with a :meth:`~object.__del__` method don't end up in :data:`gc.garbage` anymore.
es: Siguiendo con :pep:`442`, los objetos con un método :meth:`~object.__del__` ya no terminan en :data:`gc.garbage`.

source: A list of callbacks that will be invoked by the garbage collector before and after collection. The callbacks will be called with two arguments, *phase* and *info*.
es: Una lista de retrollamadas que el recolector de basura invocará antes y después de la recolección. Las retrollamadas serán llamadas con dos argumentos, *phase* e *info*.

source: *phase* can be one of two values:
es: *phase* puede tomar uno de estos valores:

source: "start": The garbage collection is about to start.
es: "start": la recolección de basura está a punto de comenzar.

source: "stop": The garbage collection has finished.
es: "stop": la recolección de basura ha terminado.

source: *info* is a dict providing more information for the callback. The following keys are currently defined:
es: *info* es un diccionario que proporciona información adicional para la retrollamada. Las siguientes claves están definidas actualmente:

source: "generation": The oldest generation being collected.
es: "generation": la generación más antigua que ha sido recolectada.

source: "collected": When *phase* is "stop", the number of objects successfully collected.
es: "collected": cuando *phase* es "stop", el número de objetos recolectados satisfactoriamente.

source: "uncollectable": When *phase* is "stop", the number of objects that could not be collected and were put in :data:`garbage`.
es: "uncollectable": cuando *phase* es "stop", el número de objetos que no pudieron ser recolectados y fueron ubicados en :data:`garbage`.

source: Applications can add their own callbacks to this list. The primary use cases are:
es: Las aplicaciones pueden agregar sus propias retrollamadas a esta lista. Los principales casos de uso son:

source: Gathering statistics about garbage collection, such as how often various generations are collected, and how long the collection takes.
es: Recopilar estadísticas sobre la recolección de basura, como la frecuencia con la que se recolectan varias generaciones y cuánto tiempo lleva la recolección.

source: Allowing applications to identify and clear their own uncollectable types when they appear in :data:`garbage`.
es: Permitir que las aplicaciones identifiquen y borren sus propios tipos no recolectables cuando aparecen en :data:`garbage`.

source: The following constants are provided for use with :func:`set_debug`:
es: Las siguientes constantes son proporcionadas para ser usadas con :func:`set_debug`:

source: Print statistics during collection. This information can be useful when tuning the collection frequency.
es: Imprime estadísticas durante la recolección. Esta información puede resultar útil para ajustar la frecuencia de recolección.

source: Print information on collectable objects found.
es: Imprime información sobre los objetos recolectables encontrados.

source: Print information of uncollectable objects found (objects which are not reachable but cannot be freed by the collector). These objects will be added to the ``garbage`` list.
es: Imprime información sobre los objetos no recolectables encontrados (objetos inaccesibles, pero que el recolector no puede liberar). Estos objetos se agregarán a la lista ``garbage``.

source: Also print the contents of the :data:`garbage` list at :term:`interpreter shutdown`, if it isn't empty.
es: También imprime el contenido de la lista :data:`garbage` durante :term:`interpreter shutdown`, si no está vacía.

source: When set, all unreachable objects found will be appended to *garbage* rather than being freed. This can be useful for debugging a leaking program.
es: Cuando se establece, todos los objetos inaccesibles encontrados se agregarán a *garbage* en lugar de ser liberados. Esto puede resultar útil para depurar un programa con fugas de memoria.

source: The debugging flags necessary for the collector to print information about a leaking program (equal to ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
es: Las flags de depuración necesarias para que el recolector imprima información sobre un programa con fugas de memoria (igual a ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
