Repository: python/python-docs-es
Catalog: library/getpass.po
Languages: es

source: :mod:`getpass` --- Portable password input
es: :mod:`getpass` --- Entrada de contraseña portátil

source: **Source code:** :source:`Lib/getpass.py`
es: **Código fuente:** :source:`Lib/getpass.py`

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulta :ref:`wasm-availability` para obtener más información.

source: The :mod:`getpass` module provides two functions:
es: El módulo :mod:`getpass` proporciona dos funciones:

source: Prompt the user for a password without echoing. The user is prompted using the string *prompt*, which defaults to ``'Password: '``. On Unix, the prompt is written to the file-like object *stream* using the replace error handler if needed. *stream* defaults to the controlling terminal (:file:`/dev/tty`) or if that is unavailable to ``sys.stderr`` (this argument is ignored on Windows).
es: Solicita al usuario una contraseña sin hacer eco. Se solicita al usuario mediante la cadena *prompt*, que por defecto es ``'Password: '``. En Unix, el indicador se escribe en el objeto similar a un archivo *stream* usando el controlador de errores de reemplazo si es necesario. *stream* toma por defecto el terminal de control (:file:`/dev/tty`) o si no está disponible para ``sys.stderr`` (este argumento se ignora en Windows).

source: If echo free input is unavailable getpass() falls back to printing a warning message to *stream* and reading from ``sys.stdin`` and issuing a :exc:`GetPassWarning`.
es: Si la entrada sin *echo* no está disponible, getpass() recurre a imprimir un mensaje de advertencia en *stream* y leer de ``sys.stdin`` y lanza un :exc:`GetPassWarning`.

source: If you call getpass from within IDLE, the input may be done in the terminal you launched IDLE from rather than the idle window itself.
es: Si llama a getpass desde IDLE, la entrada puede realizarse en la terminal desde la que inició IDLE en lugar de en la ventana inactiva en sí.

source: A :exc:`UserWarning` subclass issued when password input may be echoed.
es: Una subclase :exc:`UserWarning` lanzada cuando la entrada de la contraseña puede repetirse.

source: Return the "login name" of the user.
es: Retorna el "nombre de inicio de sesión" del usuario.

source: This function checks the environment variables :envvar:`LOGNAME`, :envvar:`USER`, :envvar:`LNAME` and :envvar:`USERNAME`, in order, and returns the value of the first one which is set to a non-empty string. If none are set, the login name from the password database is returned on systems which support the :mod:`pwd` module, otherwise, an exception is raised.
es: Esta función verifica las variables de entorno :envvar:`LOGNAME`, :envvar:`USER`, :envvar:`LNAME` and :envvar:`USERNAME`, en orden, y retorna el valor del primero que se establece en un cadena no vacía. Si no se establece ninguno, el nombre de inicio de sesión de la base de datos de contraseñas se retorna en los sistemas que admiten el módulo :mod:`pwd`; de lo contrario, se lanza una excepción.

source: In general, this function should be preferred over :func:`os.getlogin()`.
es: En general, esta función debería preferirse respecto a :func:`os.getlogin()`.
