Repository: python/python-docs-es
Catalog: library/gettext.po
Languages: es

source: :class:`GNUTranslations` parses optional metadata out of the translation catalog. It is convention with GNU :program:`gettext` to include metadata as the translation for the empty string. This metadata is in :rfc:`822`\ -style ``key: value`` pairs, and should contain the ``Project-Id-Version`` key. If the key ``Content-Type`` is found, then the ``charset`` property is used to initialize the "protected" :attr:`_charset` instance variable, defaulting to ``None`` if not found. If the charset encoding is specified, then all message ids and message strings read from the catalog are converted to Unicode using this encoding, else ASCII is assumed.
es: :class:`GNUTranslations` analiza los metadatos opcionales del catálogo de traducción. Es una convención con GNU :program:`gettext` para incluir metadatos como la traducción de la cadena vacía. Estos metadatos están en estilos pares :rfc:`822`\ ``key: value``, y deben contener la clave ``Project-Id-Version``. Si se encuentra la clave ``Content-Type``, entonces la propiedad ``charset`` se usa para inicializar la variable de instancia "*protected*" :attr:`_charset`, con el valor predeterminado ``None`` si no se encuentra. Si se especifica la codificación del juego de caracteres, todos los identificadores de mensajes y las cadenas de mensajes leídos del catálogo se convierten a Unicode utilizando esta codificación, de lo contrario se asume ASCII.

source: Since message ids are read as Unicode strings too, all :meth:`*gettext` methods will assume message ids as Unicode strings, not byte strings.
es: Dado que los identificadores de mensaje también se leen como cadenas Unicode, todos los métodos :meth:`*gettext` asumirán los identificadores de mensaje como cadenas Unicode, no cadenas de bytes.

source: The entire set of key/value pairs are placed into a dictionary and set as the "*protected*" :attr:`_info` instance variable.
es: El conjunto completo de pares clave/valor se coloca en un diccionario y se establece como la variable de instancia "protegida" :attr:`_info`.

source: If the :file:`.mo` file's magic number is invalid, the major version number is unexpected, or if other problems occur while reading the file, instantiating a :class:`GNUTranslations` class can raise :exc:`OSError`.
es: Si el número mágico del archivo :file:`.mo` no es válido, el número de versión principal es inesperado, o si se producen otros problemas al leer el archivo, se crea una instancia de :class:`GNUTranslations` puede generar :exc:`OSError`.

source: The following methods are overridden from the base class implementation:
es: Los siguientes métodos se anulan desde la implementación de la clase base:

source: Look up the *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id, and a fallback has been set, the look up is forwarded to the fallback's :meth:`~NullTranslations.gettext` method. Otherwise, the *message* id is returned.
es: Busca el *message* id en el catálogo y retorna la cadena de caracteres de mensaje correspondiente, como una cadena Unicode. Si no hay una entrada en el catálogo para el *message* id, y se ha establecido una retroceso (*fallback*), la búsqueda se reenvía al método de retroceso :meth:`~NullTranslations.gettext`. De lo contrario, se retorna el *message* id.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use. The returned message string is a Unicode string.
es: Realiza una búsqueda de formas plurales de una identificación de mensaje. *singular* se usa como la identificación del mensaje para fines de búsqueda en el catálogo, mientras que *n* se usa para determinar qué forma plural usar. La cadena del mensaje retornado es una cadena de caracteres Unicode.

source: If the message id is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`~NullTranslations.ngettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
es: Si la identificación del mensaje no se encuentra en el catálogo y se especifica una reserva, la solicitud se reenvía al método de reserva :meth:`~NullTranslations.ngettext`. De lo contrario, cuando *n* es 1 se retorna *singular*, y *plural* se retorna en todos los demás casos.

source: Here is an example::
es: Aquí hay un ejemplo::

source: Look up the *context* and *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id and *context*, and a fallback has been set, the look up is forwarded to the fallback's :meth:`pgettext` method. Otherwise, the *message* id is returned.
es: Busca el *context* y *message* id en el catálogo y retorna la cadena de de caracteres mensaje correspondiente, como una cadena de caracteres Unicode. Si no hay ninguna entrada en el catálogo para el *message* id y *context*, y se ha establecido un retroceso (*fallback*), la búsqueda se reenvía al método de retroceso :meth:`pgettext`. De lo contrario, se retorna el *message* id.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use.
es: Realiza una búsqueda de formas plurales de una identificación de mensaje. *singular* se usa como la identificación del mensaje para fines de búsqueda en el catálogo, mientras que *n* se usa para determinar qué forma plural usar.

source: If the message id for *context* is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`npgettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
es: Si la identificación del mensaje para *context* no se encuentra en el catálogo y se especifica una reserva, la solicitud se reenvía al método de reserva :meth:`npgettext`. De lo contrario, cuando *n * es 1 se retorna *singular*, y *plural* se retorna en todos los demás casos.

source: Equivalent to :meth:`.gettext` and :meth:`.ngettext`, but the translation is returned as a byte string encoded in the preferred system encoding if no encoding was explicitly set with :meth:`~NullTranslations.set_output_charset`.
es: Equivalente a :meth:`.gettext` y :meth:`.ngettext`, pero la traducción se retorna como una cadena de bytes codificada en la codificación del sistema preferida si no se estableció explícitamente ninguna codificación con :meth:`~NullTranslations.set_output_charset`.

source: Solaris message catalog support
es: Soporte de catálogo de mensajes de Solaris

source: The Solaris operating system defines its own binary :file:`.mo` file format, but since no documentation can be found on this format, it is not supported at this time.
es: El sistema operativo Solaris define su propio formato de archivo binario :file:`.mo`, pero como no se puede encontrar documentación sobre este formato, no es compatible en este momento.

source: The Catalog constructor
es: El constructor del catálogo

source: GNOME uses a version of the :mod:`gettext` module by James Henstridge, but this version has a slightly different API. Its documented usage was::
es: GNOME usa una versión del módulo :mod:`gettext` de James Henstridge, pero esta versión tiene una API ligeramente diferente. Su uso documentado fue::

source: For compatibility with this older module, the function :func:`Catalog` is an alias for the :func:`translation` function described above.
es: Para la compatibilidad con este módulo anterior, la función :func:`Catalog` es un alias para la función :func:`translation` descrita anteriormente.

source: One difference between this module and Henstridge's: his catalog objects supported access through a mapping API, but this appears to be unused and so is not currently supported.
es: Una diferencia entre este módulo y el de Henstridge: sus objetos de catálogo admitían el acceso a través de una API de mapeo, pero esto parece estar sin usar y, por lo tanto, actualmente no es compatible.

source: Internationalizing your programs and modules
es: Internacionalizando sus programas y módulos

source: Internationalization (I18N) refers to the operation by which a program is made aware of multiple languages. Localization (L10N) refers to the adaptation of your program, once internationalized, to the local language and cultural habits. In order to provide multilingual messages for your Python programs, you need to take the following steps:
es: La internacionalización (I18N) se refiere a la operación mediante la cual un programa conoce varios idiomas. La localización (L10N) se refiere a la adaptación de su programa, una vez internacionalizado, al idioma local y los hábitos culturales. Para proporcionar mensajes multilingües para sus programas de Python, debe seguir los siguientes pasos:

source: prepare your program or module by specially marking translatable strings
es: prepare su programa o módulo marcando especialmente cadenas traducibles

source: run a suite of tools over your marked files to generate raw messages catalogs
es: ejecuta un conjunto de herramientas sobre tus archivos marcados para generar catálogos de mensajes sin procesar

source: create language-specific translations of the message catalogs
es: crear traducciones específicas del idioma de los catálogos de mensajes

source: use the :mod:`gettext` module so that message strings are properly translated
es: use el módulo :mod:`gettext` para que las cadenas de caracteres de mensajes se traduzcan correctamente

source: In order to prepare your code for I18N, you need to look at all the strings in your files. Any string that needs to be translated should be marked by wrapping it in ``_('...')`` --- that is, a call to the function :func:`_`. For example::
es: Para preparar su código para I18N, debe mirar todas las cadenas en sus archivos. Cualquier cadena que deba traducirse debe marcarse envolviéndola en ``_('...')`` --- es decir, una llamada a la función :func:`_`. Por ejemplo::

source: In this example, the string ``'writing a log message'`` is marked as a candidate for translation, while the strings ``'mylog.txt'`` and ``'w'`` are not.
es: En este ejemplo, la cadena de caracteres ``'writing a log message'`` está marcada como candidata para la traducción, mientras que las cadenas ``'mylog.txt'`` y ``'w'`` no lo están.

source: There are a few tools to extract the strings meant for translation. The original GNU :program:`gettext` only supported C or C++ source code but its extended version :program:`xgettext` scans code written in a number of languages, including Python, to find strings marked as translatable. `Babel <http://babel.pocoo.org/>`__ is a Python internationalization library that includes a :file:`pybabel` script to extract and compile message catalogs. François Pinard's program called :program:`xpot` does a similar job and is available as part of his `po-utils package <https://github.com/pinard/po-utils>`__.
es: Existen algunas herramientas para extraer las cadenas destinadas a la traducción. El programa GNU original :program:`gettext` solo admitía el código fuente C o C++, pero su versión extendida :program:`xgettext` escanea el código escrito en varios idiomas, incluido Python, para encontrar cadenas marcadas como traducibles. `Babel <http://babel.pocoo.org/>`__ es una biblioteca de internacionalización de Python que incluye un script :file:`pybabel` para extraer y compilar catálogos de mensajes. El programa de *François Pinard* llamado :program:`xpot` hace un trabajo similar y está disponible como parte de su paquete `po-utils <https://github.com/pinard/po-utils>`__.

source: (Python also includes pure-Python versions of these programs, called :program:`pygettext.py` and :program:`msgfmt.py`; some Python distributions will install them for you. :program:`pygettext.py` is similar to :program:`xgettext`, but only understands Python source code and cannot handle other programming languages such as C or C++. :program:`pygettext.py` supports a command-line interface similar to :program:`xgettext`; for details on its use, run ``pygettext.py --help``. :program:`msgfmt.py` is binary compatible with GNU :program:`msgfmt`. With these two programs, you may not need the GNU :program:`gettext` package to internationalize your Python applications.)
es: (Python también incluye versiones de Python puro de estos programas, llamadas :program:`pygettext.py` y :program:`msgfmt.py`; algunas distribuciones de Python las instalarán por usted. :program:`pygettext.py` es similar a :program:`xgettext`, pero solo entiende el código fuente de Python y no puede manejar otros lenguajes de programación como C o C++. :program:`pygettext.py` admite una interfaz de línea de comandos similar a :program:`xgettext`; para detalles sobre su uso, ejecute ``pygettext.py --help``. :program:`msgfmt.py` es binario compatible con GNU :program:`msgfmt`. Con estos dos programas, es posible que no necesite el paquete GNU :program:`gettext` para internacionalizar sus aplicaciones Python.)

source: :program:`xgettext`, :program:`pygettext`, and similar tools generate :file:`.po` files that are message catalogs. They are structured human-readable files that contain every marked string in the source code, along with a placeholder for the translated versions of these strings.
es: :program:`xgettext`, :program:`pygettext`, y herramientas similares generan archivos :file:`.po` que son catálogos de mensajes. Son archivos estructurados legibles por humanos que contienen cada cadena marcada en el código fuente, junto con un marcador de posición para las versiones traducidas de estas cadenas.

source: Copies of these :file:`.po` files are then handed over to the individual human translators who write translations for every supported natural language. They send back the completed language-specific versions as a :file:`<language-name>.po` file that's compiled into a machine-readable :file:`.mo` binary catalog file using the :program:`msgfmt` program. The :file:`.mo` files are used by the :mod:`gettext` module for the actual translation processing at run-time.
es: Las copias de estos archivos :file:`.po` se entregan a los traductores humanos individuales que escriben traducciones para cada lenguaje natural compatible. Envían las versiones completas específicas del idioma como un archivo :file:`<nombre-idioma >.po` que se compila en un archivo binario :file:`.mo` de lectura mecánica utilizando el programa :program:`msgfmt` . Los archivos :file:`.mo` son utilizados por el módulo :mod:`gettext` para el procesamiento de traducción real en tiempo de ejecución.

source: How you use the :mod:`gettext` module in your code depends on whether you are internationalizing a single module or your entire application. The next two sections will discuss each case.
es: Como use el módulo :mod:`gettext` en su código depende de si está internacionalizando un solo módulo o toda su aplicación. Las siguientes dos secciones discutirán cada caso.

source: Let's say your module is called "spam" and the module's various natural language translation :file:`.mo` files reside in :file:`/usr/share/locale` in GNU :program:`gettext` format. Here's what you would put at the top of your module::
es: Digamos que su módulo se llama "spam" y los diversos archivos :file:`.mo` de traducciones del lenguaje natural del módulo residen en :file:`/usr/share/locale` en formato GNU :program:`gettext`. Esto es lo que pondría en la parte superior de su módulo::

source: In the simple case then, you need only add the following bit of code to the main driver file of your application::
es: En el caso simple, entonces, solo necesita agregar el siguiente bit de código al archivo del controlador principal de su aplicación:

source: If you need to set the locale directory, you can pass it into the :func:`install` function::
es: Si necesita establecer el directorio de configuración regional, puede pasarlo a la función :func:`install`::

source: Changing languages on the fly
es: Cambiar idiomas sobre la marcha

source: If your program needs to support many languages at the same time, you may want to create multiple translation instances and then switch between them explicitly, like so::
es: Si su programa necesita admitir muchos idiomas al mismo tiempo, es posible que desee crear varias instancias de traducción y luego cambiar entre ellas explícitamente, de esta manera:

source: Deferred translations
es: Traducciones diferidas

source: In most coding situations, strings are translated where they are coded. Occasionally however, you need to mark strings for translation, but defer actual translation until later. A classic example is::
es: En la mayoría de las situaciones de codificación, las cadenas se traducen donde se codifican. Sin embargo, ocasionalmente, debe marcar cadenas para la traducción, pero diferir la traducción real hasta más tarde. Un ejemplo clásico es::

source: Here, you want to mark the strings in the ``animals`` list as being translatable, but you don't actually want to translate them until they are printed.
es: Aquí, desea marcar las cadenas en la lista de ``animals`` como traducibles, pero en realidad no desea traducirlas hasta que se impriman.

source: Here is one way you can handle this situation::
es: Aquí hay una manera de manejar esta situación:

source: This works because the dummy definition of :func:`_` simply returns the string unchanged. And this dummy definition will temporarily override any definition of :func:`_` in the built-in namespace (until the :keyword:`del` command). Take care, though if you have a previous definition of :func:`_` in the local namespace.
es: Esto funciona porque la definición ficticia de :func:`_` simplemente retorna la cadena sin cambios. Y esta definición ficticia anulará temporalmente cualquier definición de :func:`_` en el espacio de nombres incorporado (hasta el comando :keyword:`del`). Sin embargo, tenga cuidado si tiene una definición previa de :func:`_` en el espacio de nombres local.

source: Note that the second use of :func:`_` will not identify "a" as being translatable to the :program:`gettext` program, because the parameter is not a string literal.
es: Tenga en cuenta que el segundo uso de :func:`_` no identificará "a" como traducible al programa :program:`gettext`, porque el parámetro no es un literal de cadena.

source: Another way to handle this is with the following example::
es: Otra forma de manejar esto es con el siguiente ejemplo:

source: In this case, you are marking translatable strings with the function :func:`N_`, which won't conflict with any definition of :func:`_`. However, you will need to teach your message extraction program to look for translatable strings marked with :func:`N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, and :program:`xpot` all support this through the use of the :option:`!-k` command-line switch. The choice of :func:`N_` here is totally arbitrary; it could have just as easily been :func:`MarkThisStringForTranslation`.
es: En este caso, está marcando cadenas traducibles con la función :func:`N_`, que no entrará en conflicto con ninguna definición de :func:`_`. Sin embargo, deberá enseñar a su programa de extracción de mensajes a buscar cadenas traducibles marcadas con :func:`N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, y :program:`xpot` todos soportan esto mediante el uso de :option:`!-k` interruptor de línea de comando. La elección de :func:`N_` aquí es totalmente arbitraria; podría haber sido igual de fácil :func:`MarkThisStringForTranslation`.

source: Acknowledgements
es: Agradecimientos

source: The following people contributed code, feedback, design suggestions, previous implementations, and valuable experience to the creation of this module:
es: Las siguientes personas contribuyeron con código, comentarios, sugerencias de diseño, implementaciones anteriores y una valiosa experiencia para la creación de este módulo:

source: Footnotes
es: Notas al pie

source: The default locale directory is system dependent; for example, on RedHat Linux it is :file:`/usr/share/locale`, but on Solaris it is :file:`/usr/lib/locale`. The :mod:`gettext` module does not try to support these system dependent defaults; instead its default is :file:`{sys.base_prefix}/share/locale` (see :data:`sys.base_prefix`). For this reason, it is always best to call :func:`bindtextdomain` with an explicit absolute path at the start of your application.
es: El directorio de configuración regional predeterminado depende del sistema; por ejemplo, en RedHat Linux es :file:`/usr/share/locale`, pero en Solaris es :file:`/usr/lib/locale`. El módulo :mod:`gettext` no intenta admitir estos valores predeterminados dependientes del sistema; en cambio, su valor predeterminado es :file:`{sys.base_prefix}/share/locale` (ver :data:`sys.base_prefix`). Por esta razón, siempre es mejor llamar a :func:`bindtextdomain` con una ruta absoluta explícita al inicio de su aplicación.

source: See the footnote for :func:`bindtextdomain` above.
es: Vea la nota al pie de página para :func:`bindtextdomain` arriba.
