Repository: python/python-docs-es
Catalog: library/gettext.po
Languages: es

source: :mod:`gettext` --- Multilingual internationalization services
es: :mod:`gettext` --- Servicios de internacionalización multilingües

source: **Source code:** :source:`Lib/gettext.py`
es: **Código fuente:** :source:`Lib/gettext.py`

source: The :mod:`gettext` module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. It supports both the GNU :program:`gettext` message catalog API and a higher level, class-based API that may be more appropriate for Python files. The interface described below allows you to write your module and application messages in one natural language, and provide a catalog of translated messages for running under different natural languages.
es: El módulo :mod:`gettext` proporciona servicios de internacionalización (I18N) y localización (L10N) para sus módulos y aplicaciones Python. Admite tanto la API del catálogo de mensajes GNU :program:`gettext` como una API basada en clases de nivel superior que puede ser más apropiada para los archivos Python. La interfaz que se describe a continuación le permite escribir sus mensajes de módulo y aplicación en un idioma natural, y proporcionar un catálogo de mensajes traducidos para ejecutar en diferentes idiomas naturales.

source: Some hints on localizing your Python modules and applications are also given.
es: También se dan algunas sugerencias para localizar sus módulos y aplicaciones Python.

source: GNU :program:`gettext` API
es: GNU API :program:`gettext`

source: The :mod:`gettext` module defines the following API, which is very similar to the GNU :program:`gettext` API. If you use this API you will affect the translation of your entire application globally. Often this is what you want if your application is monolingual, with the choice of language dependent on the locale of your user. If you are localizing a Python module, or if your application needs to switch languages on the fly, you probably want to use the class-based API instead.
es: El módulo :mod:`gettext` define la siguiente API, que es muy similar al programa GNU :program:`gettext` API. Si usa esta API, afectará la traducción de toda su aplicación a nivel mundial. A menudo, esto es lo que desea si su aplicación es monolingüe, y la elección del idioma depende de la configuración regional de su usuario. Si está localizando un módulo de Python, o si su aplicación necesita cambiar idiomas sobre la marcha, probablemente desee utilizar la API basada en clases.

source: Bind the *domain* to the locale directory *localedir*. More concretely, :mod:`gettext` will look for binary :file:`.mo` files for the given domain using the path (on Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, where *language* is searched for in the environment variables :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG` respectively.
es: Enlaza (*bind*) el *domain* al directorio de configuración regional *localedir*. Más concretamente, :mod:`gettext` buscará archivos binarios :file:`.mo` para el dominio dado usando la ruta (en Unix): :file:`{localedir}/{language}/LC_MESSAGES /{domain}.mo`, donde se busca *language* en las variables de entorno :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` y :envvar:`LANG` respectivamente.

source: If *localedir* is omitted or ``None``, then the current binding for *domain* is returned. [#]_
es: Si *localedir* se omite o es ``None``, se retorna el enlace actual para *domain*. [#]_

source: Bind the *domain* to *codeset*, changing the encoding of byte strings returned by the :func:`lgettext`, :func:`ldgettext`, :func:`lngettext` and :func:`ldngettext` functions. If *codeset* is omitted, then the current binding is returned.
es: Enlaza (*bind*) el *domain* al *codeset*, cambiando la codificación de las cadenas de bytes retornadas por las funciones :func:`lgettext`, :func:`ldgettext`, :func:`lngettext` y :func:`ldngettext`. Si se omite *codeset*, se retorna el enlace (*binding*) actual.

source: Change or query the current global domain. If *domain* is ``None``, then the current global domain is returned, otherwise the global domain is set to *domain*, which is returned.
es: Cambia o consulta el dominio global actual. Si *domain* es ``None``, se retorna el dominio global actual; de lo contrario, el dominio global se establece en *domain*, que se retorna.

source: Return the localized translation of *message*, based on the current global domain, language, and locale directory. This function is usually aliased as :func:`_` in the local namespace (see examples below).
es: Retorna la traducción localizada de *message*, en función del dominio global actual, el idioma y el directorio de configuración regional. Esta función generalmente tiene un alias como :func:`_` en el espacio de nombres local (ver ejemplos a continuación).

source: Like :func:`.gettext`, but look the message up in the specified *domain*.
es: Como :func:`.gettext`, pero busque el mensaje en el *domain* especificado.

source: Like :func:`.gettext`, but consider plural forms. If a translation is found, apply the plural formula to *n*, and return the resulting message (some languages have more than two plural forms). If no translation is found, return *singular* if *n* is 1; return *plural* otherwise.
es: Como :func:`.gettext`, pero considere formas plurales. Si se encuentra una traducción, aplique la fórmula plural a *n* y retorna el mensaje resultante (algunos idiomas tienen más de dos formas plurales). Si no se encuentra ninguna traducción, retorna *singular* if *n* es 1; retorna *plural* de lo contrario.

source: The Plural formula is taken from the catalog header. It is a C or Python expression that has a free variable *n*; the expression evaluates to the index of the plural in the catalog. See `the GNU gettext documentation <https://www.gnu.org/software/gettext/manual/gettext.html>`__ for the precise syntax to be used in :file:`.po` files and the formulas for a variety of languages.
es: La fórmula Plural se toma del encabezado del catálogo. Es una expresión C o Python que tiene una variable libre *n*; la expresión se evalúa como el índice del plural en el catálogo. Consulte `la documentación de GNU gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`__ para conocer la sintaxis precisa que se utilizará en archivos :file:`.po` y las fórmulas para un variedad de idiomas.

source: Like :func:`ngettext`, but look the message up in the specified *domain*.
es: Como :func:`ngettext`, pero busque el mensaje en el *domain* especificado.

source: Similar to the corresponding functions without the ``p`` in the prefix (that is, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), but the translation is restricted to the given message *context*.
es: Similar a las funciones correspondientes sin la ``p`` en el prefijo (es decir, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), pero la traducción está restringida al mensaje dado *context*.

source: Equivalent to the corresponding functions without the ``l`` prefix (:func:`.gettext`, :func:`dgettext`, :func:`ngettext` and :func:`dngettext`), but the translation is returned as a byte string encoded in the preferred system encoding if no other encoding was explicitly set with :func:`bind_textdomain_codeset`.
es: Equivalente a las funciones correspondientes sin el prefijo ``l`` (:func:`.gettext`, :func:`dgettext`, :func:`ngettext` y :func:`dngettext`), pero la traducción se retorna como una cadena de bytes codificada en la codificación del sistema preferida si no se estableció explícitamente otra codificación con :func:`bind_textdomain_codeset`.

source: These functions should be avoided in Python 3, because they return encoded bytes. It's much better to use alternatives which return Unicode strings instead, since most Python applications will want to manipulate human readable text as strings instead of bytes. Further, it's possible that you may get unexpected Unicode-related exceptions if there are encoding problems with the translated strings.
es: Estas funciones deben evitarse en Python 3, ya que retornan bytes codificados. Es mucho mejor usar alternativas que retornan cadenas Unicode, ya que la mayoría de las aplicaciones de Python querrán manipular el texto legible por humanos como cadenas en lugar de bytes. Además, es posible que obtenga excepciones inesperadas relacionadas con Unicode si hay problemas de codificación con las cadenas traducidas.

source: Note that GNU :program:`gettext` also defines a :func:`dcgettext` method, but this was deemed not useful and so it is currently unimplemented.
es: Tenga en cuenta que GNU :program:`gettext` también define un método :func:`dcgettext`, pero esto no se consideró útil, por lo que actualmente no está implementado.

source: Here's an example of typical usage for this API::
es: Aquí hay un ejemplo del uso típico de esta API::

source: Class-based API
es: API basada en clases

source: The class-based API of the :mod:`gettext` module gives you more flexibility and greater convenience than the GNU :program:`gettext` API. It is the recommended way of localizing your Python applications and modules. :mod:`!gettext` defines a :class:`GNUTranslations` class which implements the parsing of GNU :file:`.mo` format files, and has methods for returning strings. Instances of this class can also install themselves in the built-in namespace as the function :func:`_`.
es: La API basada en clases del módulo :mod:`gettext` le brinda más flexibilidad y mayor comodidad que la API GNU :program:`gettext`. Es la forma recomendada de localizar sus aplicaciones y módulos de Python. :mod:`!gettext` define una clase :class:`GNUTranslations` que implementa el análisis de archivos de formato GNU :file:`.mo`, y tiene métodos para retornar cadenas. Las instancias de esta clase también pueden instalarse en el espacio de nombres incorporado como la función :func:`_`.

source: This function implements the standard :file:`.mo` file search algorithm. It takes a *domain*, identical to what :func:`textdomain` takes. Optional *localedir* is as in :func:`bindtextdomain`. Optional *languages* is a list of strings, where each string is a language code.
es: Esta función implementa el algoritmo de búsqueda de archivos estándar :file:`.mo`. Toma un *domain*, idéntico al que toma :func:`textdomain`. Opcional *localedir* es como en :func:`bindtextdomain`. *languages* opcionales es una lista de cadenas, donde cada cadena es un código de idioma.

source: If *localedir* is not given, then the default system locale directory is used. [#]_ If *languages* is not given, then the following environment variables are searched: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG`. The first one returning a non-empty value is used for the *languages* variable. The environment variables should contain a colon separated list of languages, which will be split on the colon to produce the expected list of language code strings.
es: Si no se proporciona *localedir*, se utiliza el directorio de configuración regional predeterminado del sistema. [#]_ Si no se proporcionan *languages*, se buscan las siguientes variables de entorno: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, y :envvar:`LANG`. El primero que retorna un valor no vacío se usa para la variable *languages*. Las variables de entorno deben contener una lista de idiomas separados por dos puntos, que se dividirá en dos puntos para producir la lista esperada de cadenas de código de idioma.

source: :func:`find` then expands and normalizes the languages, and then iterates through them, searching for an existing file built of these components:
es: :func:`find` luego expande y normaliza los idiomas, y luego los itera, buscando un archivo existente construido con estos componentes:

source: The first such file name that exists is returned by :func:`find`. If no such file is found, then ``None`` is returned. If *all* is given, it returns a list of all file names, in the order in which they appear in the languages list or the environment variables.
es: El primer nombre de archivo que existe es retornado por :func:`find`. Si no se encuentra dicho archivo, se retorna ``None``. Si se proporciona *all*, retorna una lista de todos los nombres de archivo, en el orden en que aparecen en la lista de idiomas o las variables de entorno.

source: Return a :class:`*Translations` instance based on the *domain*, *localedir*, and *languages*, which are first passed to :func:`find` to get a list of the associated :file:`.mo` file paths. Instances with identical :file:`.mo` file names are cached. The actual class instantiated is *class_* if provided, otherwise :class:`GNUTranslations`. The class's constructor must take a single :term:`file object` argument. If provided, *codeset* will change the charset used to encode translated strings in the :meth:`~NullTranslations.lgettext` and :meth:`~NullTranslations.lngettext` methods.
es: Retorna una instancia de :class:`*Translations` basada en *domain*, *localedir* y *languages*, que primero se pasan a :func:`find` para obtener una lista del archivo asociado de rutas :file:`.mo`. Instancias con idéntico nombres de archivo :file:`.mo` se almacenan en caché. La clase real instanciada es *class_* si se proporciona, de lo contrario :class:`GNUTranslations`. El constructor de la clase debe tomar un solo argumento :term:`file object`. Si se proporciona, *codeset* cambiará el juego de caracteres utilizado para codificar cadenas traducidas en los métodos :meth:`~NullTranslations.lgettext` y :meth:`~NullTranslations.lngettext`.

source: If multiple files are found, later files are used as fallbacks for earlier ones. To allow setting the fallback, :func:`copy.copy` is used to clone each translation object from the cache; the actual instance data is still shared with the cache.
es: Si se encuentran varios archivos, los archivos posteriores se utilizan como retrocesos para los anteriores. Para permitir la configuración de la reserva, :func:`copy.copy` se utiliza para clonar cada objeto de traducción del caché; los datos de la instancia real aún se comparten con el caché.

source: If no :file:`.mo` file is found, this function raises :exc:`OSError` if *fallback* is false (which is the default), and returns a :class:`NullTranslations` instance if *fallback* is true.
es: Si no se encuentra el archivo :file:`.mo`, esta función genera :exc:`OSError` si *fallback* es falso (que es el valor predeterminado) y retorna una instancia de :class:`NullTranslations` si *fallback* is verdadero.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`.
es: :exc:`IOError` solía aparecer en lugar de :exc:`OSError`.

source: The *codeset* parameter.
es: El parámetro *codeset*.

source: This installs the function :func:`_` in Python's builtins namespace, based on *domain*, *localedir*, and *codeset* which are passed to the function :func:`translation`.
es: Esto instala la función :func:`_` en el espacio de nombres incorporado de Python, basado en *domain*, *localedir* y *codeset* que se pasan a la función :func:`translation`.

source: For the *names* parameter, please see the description of the translation object's :meth:`~NullTranslations.install` method.
es: Para el parámetro *names*, consulte la descripción del método del objeto de traducción :meth:`~NullTranslations.install`.

source: As seen below, you usually mark the strings in your application that are candidates for translation, by wrapping them in a call to the :func:`_` function, like this::
es: Como se ve a continuación, generalmente marca las cadenas en su aplicación que son candidatas para la traducción, envolviéndolas en una llamada a la función :func:`_`, como esta::

source: For convenience, you want the :func:`_` function to be installed in Python's builtins namespace, so it is easily accessible in all modules of your application.
es: Para mayor comodidad, desea que la función :func:`_` se instale en el espacio de nombres integrado de Python, para que sea fácilmente accesible en todos los módulos de su aplicación.

source: The :class:`NullTranslations` class
es: La clase :class:`NullTranslations`

source: Translation classes are what actually implement the translation of original source file message strings to translated message strings. The base class used by all translation classes is :class:`NullTranslations`; this provides the basic interface you can use to write your own specialized translation classes. Here are the methods of :class:`!NullTranslations`:
es: Las clases de traducción son las que realmente implementan la traducción de cadenas de mensajes del archivo fuente original a cadenas de mensajes traducidas. La clase base utilizada por todas las clases de traducción es :class:`NullTranslations`; Esto proporciona la interfaz básica que puede utilizar para escribir sus propias clases de traducción especializadas. Estos son los métodos de :class:`!NullTranslations`:

source: Takes an optional :term:`file object` *fp*, which is ignored by the base class. Initializes "protected" instance variables *_info* and *_charset* which are set by derived classes, as well as *_fallback*, which is set through :meth:`add_fallback`. It then calls ``self._parse(fp)`` if *fp* is not ``None``.
es: Toma un término opcional :term:`file object` *fp*, que es ignorado por la clase base. Inicializa las variables de instancia "protegidas" *_info* y *_charset* que se establecen mediante clases derivadas, así como *_fallback*, que se establece a través de :meth:`add_fallback`. Luego llama a ``self._parse(fp)`` if *fp* no es ``None``.

source: Add *fallback* as the fallback object for the current translation object. A translation object should consult the fallback if it cannot provide a translation for a given message.
es: Agrega *fallback* como el objeto de respaldo para el objeto de traducción actual. Un objeto de traducción debe consultar la reserva si no puede proporcionar una traducción para un mensaje dado.

source: If a fallback has been set, forward :meth:`!gettext` to the fallback. Otherwise, return *message*. Overridden in derived classes.
es: Si se ha establecido una reserva, reenvíe :meth:`!gettext` a la reserva. De lo contrario, retorna *message*. Anulado en clases derivadas.

source: If a fallback has been set, forward :meth:`!ngettext` to the fallback. Otherwise, return *singular* if *n* is 1; return *plural* otherwise. Overridden in derived classes.
es: Si se ha establecido una reserva, reenvíe :meth:`!ngettext` a la reserva. De lo contrario, retorna *singular* si *n* es 1; volver *plural* de lo contrario. Anulado en clases derivadas.

source: If a fallback has been set, forward :meth:`pgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
es: Si se ha establecido una reserva, reenvía :meth:`pgettext` a la reserva. De lo contrario, retorna el mensaje traducido. Anulado en clases derivadas.

source: If a fallback has been set, forward :meth:`npgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
es: Si se ha establecido una reserva, reenvía :meth:`npgettext` a la reserva. De lo contrario, retorna el mensaje traducido. Anulado en clases derivadas.

source: Equivalent to :meth:`.gettext` and :meth:`.ngettext`, but the translation is returned as a byte string encoded in the preferred system encoding if no encoding was explicitly set with :meth:`set_output_charset`. Overridden in derived classes.
es: Equivalente a :meth:`.gettext` y :meth:`.ngettext`, pero la traducción se retorna como una cadena de bytes codificada en la codificación del sistema preferida si no se estableció explícitamente ninguna codificación con :meth:`set_output_charset`. Anulado en clases derivadas.

source: These methods should be avoided in Python 3. See the warning for the :func:`lgettext` function.
es: Estos métodos deben evitarse en Python 3. Consulte la advertencia para la función :func:`lgettext`.

source: Return the "protected" :attr:`_info` variable, a dictionary containing the metadata found in the message catalog file.
es: Retorna la variable "*protected*" :attr:`_info`, un diccionario que contiene los metadatos encontrados en el archivo del catálogo de mensajes.

source: Return the encoding of the message catalog file.
es: Retorna la codificación del archivo de catálogo de mensajes.

source: Return the encoding used to return translated messages in :meth:`.lgettext` and :meth:`.lngettext`.
es: Retorna la codificación utilizada para retornar mensajes traducidos en :meth:`.lgettext` y :meth:`.lngettext`.

source: Change the encoding used to return translated messages.
es: Cambiar la codificación utilizada para retornar mensajes traducidos.

source: This method installs :meth:`.gettext` into the built-in namespace, binding it to ``_``.
es: Este método instala :meth:`.gettext` en el espacio de nombres incorporado, vinculándolo a ``_``.

source: If the *names* parameter is given, it must be a sequence containing the names of functions you want to install in the builtins namespace in addition to :func:`_`. Supported names are ``'gettext'``, ``'ngettext'``, ``'pgettext'``, ``'npgettext'``, ``'lgettext'``, and ``'lngettext'``.
es: Si se proporciona el parámetro *names*, debe ser una secuencia que contenga los nombres de las funciones que desea instalar en el espacio de nombres incorporado además de :func:`_`. Los nombres admitidos son ``'gettext'``, ``'ngettext'``, ``'pgettext'``, ``'npgettext'``, ``'lgettext'``, y ``'lngettext'``.

source: Note that this is only one way, albeit the most convenient way, to make the :func:`_` function available to your application. Because it affects the entire application globally, and specifically the built-in namespace, localized modules should never install :func:`_`. Instead, they should use this code to make :func:`_` available to their module::
es: Tenga en cuenta que esta es solo una forma, aunque la más conveniente, para que la función :func:`_` esté disponible para su aplicación. Debido a que afecta a toda la aplicación globalmente, y específicamente al espacio de nombres incorporado, los módulos localizados nunca deberían instalarse :func:`_`. En su lugar, deberían usar este código para hacer que :func:`_` esté disponible para su módulo::

source: This puts :func:`_` only in the module's global namespace and so only affects calls within this module.
es: Esto pone :func:`_` solo en el espacio de nombres global del módulo y, por lo tanto, solo afecta las llamadas dentro de este módulo.

source: Added ``'pgettext'`` and ``'npgettext'``.
es: Se agregó ``'pgettext'`` y ``'npgettext'``.

source: The :class:`GNUTranslations` class
es: La clase :class:`GNUTranslations`

source: The :mod:`gettext` module provides one additional class derived from :class:`NullTranslations`: :class:`GNUTranslations`. This class overrides :meth:`_parse` to enable reading GNU :program:`gettext` format :file:`.mo` files in both big-endian and little-endian format.
es: El módulo :mod:`gettext` proporciona una clase adicional derivada de :class:`NullTranslations`: :class:`GNUTranslations`. Esta clase anula :meth:`_parse` para permitir la lectura de formato GNU :program:`gettext` archivos :file:`.mo` en formato big-endian y little-endian.
