Repository: python/python-docs-es
Catalog: library/glob.po
Languages: es

source: :mod:`glob` --- Unix style pathname pattern expansion
es: :mod:`glob` --- Expansión del patrón de nombres de ruta de estilo Unix

source: **Source code:** :source:`Lib/glob.py`
es: **Código fuente:** :source:`Lib/glob.py`

source: The :mod:`glob` module finds all the pathnames matching a specified pattern according to the rules used by the Unix shell, although results are returned in arbitrary order. No tilde expansion is done, but ``*``, ``?``, and character ranges expressed with ``[]`` will be correctly matched. This is done by using the :func:`os.scandir` and :func:`fnmatch.fnmatch` functions in concert, and not by actually invoking a subshell.
es: El módulo :mod:`glob` encuentra todos los nombres de rutas que se asemejan a un patrón especificado de acuerdo a las reglas que se siguen en una terminal Unix, aunque los resultados se retornan con un orden arbitrario. No se realiza expansión de virgulilla (*tilde ("~") expansion* en inglés) pero ``*``, ``?`` y caracteres de rango expresados mediante ``[]`` serán emparejados correctamente. Esto se realiza usando las funciones :func:`os.scandir` y :func:`fnmatch.fnmatch` de forma concertada sin invocar, realmente, a una *subshell*.

source: Note that files beginning with a dot (``.``) can only be matched by patterns that also start with a dot, unlike :func:`fnmatch.fnmatch` or :func:`pathlib.Path.glob`. (For tilde and shell variable expansion, use :func:`os.path.expanduser` and :func:`os.path.expandvars`.)
es: Nótese que, los archivos que comienzan con un punto (``.``) solo se puede combinar con patrones que también comiencen con un punto, a diferencia de :func:`fnmatch.fnmatch`, o :func:`pathlib.Path.glob`. (Para la expansión de virgulilla o variable de terminal, use :func:`os.path.expanduser` y :func:`os.path.expandvars`.)

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
es: Para una coincidencia literal, envuelve los meta-caracteres en corchetes. Por ejemplo, ``'[?]'`` empareja el caracter ``'?'``.

source: The :mod:`pathlib` module offers high-level path objects.
es: El módulo :mod:`pathlib` ofrece objetos ruta de alto nivel.

source: If *root_dir* is not ``None``, it should be a :term:`path-like object` specifying the root directory for searching. It has the same effect on :func:`glob` as changing the current directory before calling it. If *pathname* is relative, the result will contain paths relative to *root_dir*.
es: Si *root_dir* no es ``None``, debería ser un :term:`path-like object` que especifique el directorio raíz para la búsqueda. Tiene el mismo efecto en :func:`glob` que cambiar el directorio actual antes de llamarlo. Si *pathname* es relativo, el resultado contendrá rutas relativas a *root_dir*.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
es: Esta función puede admitir :ref:`rutas relativas a descriptores de directorio <dir_fd>` con el parámetro *dir_fd*.

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
es: Si *recursive* es verdadero, el patrón "``**``" coincidirá con cualquier fichero y cero o más directorios, subdirectorios y enlaces simbólicos a directorios. Si el patrón va seguido de un :data:`os.sep` o :data:`os.altsep` los ficheros no coincidirán.

source: If *include_hidden* is true, "``**``" pattern will match hidden directories.
es: Si *include_hidden* es verdadero, el patrón "``**``" coincidirá con los directorios ocultos.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``glob.glob`` con los argumentos ``pathname``, ``recursive``.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob/2`` with arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
es: Lanza un :ref:`auditing event <auditing>` ``glob.glob/2`` con argumentos ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
es: El uso del patrón "``**``" en árboles de directorios grandes podría consumir una cantidad de tiempo excesiva.

source: Support for recursive globs using "``**``".
es: Soporte para globs recursivos usando "``**``".

source: Added the *root_dir* and *dir_fd* parameters.
es: Se agregaron los parámetros *root_dir* y *dir_fd*.

source: Added the *include_hidden* parameter.
es: Agregado el parámetro *include_hidden*.

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
es: Retorna un :term:`iterador` el cual produce los mismos valores que :func:`glob` sin necesidad de almacenarlos todos de forma simultánea.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
es: Escapa todos los caracteres especiales (``'?'``, ``'*'`` y ``'['``). Esto es útil si deseas coincidir una cadena de caracteres literal arbitraria que podría contener caracteres especiales. Los caracteres especiales en unidades compartidas/UNC no se eluden, e.g. en Windows ``escape('//?/c:/Quo vadis?.txt')`` retorna ``'//?/c:/Quo vadis[?].txt'``.

source: For example, consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
es: Por ejemplo, considera un directorio que contenga los siguientes ficheros: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` y un subdirectorio :file:`sub` el cual contenga solo el fichero :file:`3.txt`. :func:`glob` producirá los siguientes resultados. Nótese como se preservará cualquier componente inicial de la ruta. ::

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
es: Si un directorio contiene ficheros que comienzan con ``.`` no coincidirá por defecto. Por ejemplo, considera un directorio que contiene :file:`card.gif` y :file:`.card.gif`::

source: Module :mod:`fnmatch`
es: Módulo :mod:`fnmatch`

source: Shell-style filename (not path) expansion
es: Expansión de nombre de fichero (no de ruta) al estilo de la terminal
