Repository: python/python-docs-es
Catalog: library/hashlib.po
Languages: es

source: :mod:`hashlib` --- Secure hashes and message digests
es: :mod:`hashlib` --- Hashes seguros y resúmenes de mensajes

source: **Source code:** :source:`Lib/hashlib.py`
es: **Código fuente:** :source:`Lib/hashlib.py`

source: If you want the adler32 or crc32 hash functions, they are available in the :mod:`zlib` module.
es: Si quieres las funciones de hash adler32 o crc32, están disponibles en el módulo :mod:`zlib`.

source: Hash algorithms
es: Algoritmos de hash

source: :func:`blake2b` and :func:`blake2s` were added.
es: Fueron añadidas :func:`blake2b` y :func:`blake2s`.

source: All hashlib constructors take a keyword-only argument *usedforsecurity* with default value ``True``. A false value allows the use of insecure and blocked hashing algorithms in restricted environments. ``False`` indicates that the hashing algorithm is not used in a security context, e.g. as a non-cryptographic one-way compression function.
es: Todos los constructores hashlib toman un argumento de solo palabra clave *usedforsecurity* con el valor predeterminado ``True``. Un valor falso permite el uso de algoritmos hash inseguros y bloqueados en entornos restringidos. ``False`` indica que el algoritmo hash no se utiliza en un contexto de seguridad, por ejemplo, como una función de compresión unidireccional no criptográfica.

source: More condensed:
es: Más resumido:

source: A set containing the names of the hash algorithms guaranteed to be supported by this module on all platforms. Note that 'md5' is in this list despite some upstream vendors offering an odd "FIPS compliant" Python build that excludes it.
es: Un conjunto que contiene los nombres de los algoritmos garantizados a ser soportados por este módulo en todas las plataformas. Ten en cuenta que 'md5' se encuentra en esta lista a pesar de que algunos proveedores ofrecen una extraña construcción Python "compatible con FIPS" que la excluye.

source: A set containing the names of the hash algorithms that are available in the running Python interpreter. These names will be recognized when passed to :func:`new`. :attr:`algorithms_guaranteed` will always be a subset. The same algorithm may appear multiple times in this set under different names (thanks to OpenSSL).
es: Un conjunto que contiene los nombres de los algoritmos de hash que están disponibles en el intérprete de Python en ejecución. Estos nombres serán reconocidos cuando sean pasados a :func:`new`. :attr:`algorithms_guaranteed` siempre será un subconjunto. El mismo algoritmo puede aparecer múltiples veces en este conjunto bajo diferentes nombres (gracias a OpenSSL).

source: The following values are provided as constant attributes of the hash objects returned by the constructors:
es: Los siguientes valores son provistos como atributos constantes de los objetos hash retornados por los constructores:

source: The size of the resulting hash in bytes.
es: El tamaño del hash resultante en bytes.

source: The internal block size of the hash algorithm in bytes.
es: El tamaño del bloque interno del algoritmo de hash en bytes.

source: A hash object has the following attributes:
es: Un objeto hash tiene los siguientes atributos:

source: The canonical name of this hash, always lowercase and always suitable as a parameter to :func:`new` to create another hash of this type.
es: El nombre canónico de este hash, siempre en minúsculas y siempre adecuado como un parámetro a :func:`new` para crear otro hash de este tipo.

source: The name attribute has been present in CPython since its inception, but until Python 3.4 was not formally specified, so may not exist on some platforms.
es: El atributo *name* ha estado presente en CPython desde su inicio, pero desde Python 3.4 no fue especificado formalmente, por lo que puede no existir en algunas plataformas.

source: A hash object has the following methods:
es: Un objeto hash tiene los siguientes métodos:

source: Update the hash object with the :term:`bytes-like object`. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a+b)``.
es: Actualiza el objeto de hash con el :term:`bytes-like object`. Invocaciones repetidas son equivalentes a una única invocación con la concatenación de todos los argumentos: ``m.update(a); m.update(b)`` es equivalente a ``m.update(a+b)``.

source: Return the digest of the data passed to the :meth:`update` method so far. This is a bytes object of size :attr:`digest_size` which may contain bytes in the whole range from 0 to 255.
es: Retorna el resumen de los datos pasados al método :meth:`update` hasta el momento. Este es un objeto de bytes de tamaño :attr:`digest_size` el cual puede contener bytes en el rango completo desde 0 a 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
es: Como :meth:`digest` excepto que el resumen es retornado como un objeto de cadena del doble de largo, conteniendo sólo dígitos hexadecimales. Este puede ser usado para intercambiar el valor de forma segura en correos electrónicos u otros entornos no binarios.

source: Return a copy ("clone") of the hash object. This can be used to efficiently compute the digests of data sharing a common initial substring.
es: Retorna una copia ("clon") del objeto hash. Este puede ser usado para calcular eficientemente los resúmenes de datos compartiendo una subcadena inicial común.

source: SHAKE variable length digests
es: Resúmenes SHAKE de largo variable

source: The :func:`shake_128` and :func:`shake_256` algorithms provide variable length digests with length_in_bits//2 up to 128 or 256 bits of security. As such, their digest methods require a length. Maximum length is not limited by the SHAKE algorithm.
es: Los algoritmos :func:`shake_128` y :func:`shake_256` proveen resúmenes de largo variable con largo_en_bits//2 hasta 128 ó 256 bits de seguridad. Como tales, sus métodos de resumen requieren un largo. El largo máximo no está limitado por el algoritmo SHAKE.

source: File hashing
es: Cifrado de archivos

source: The hashlib module provides a helper function for efficient hashing of a file or file-like object.
es: El módulo hashlib proporciona una función de ayuda para el cifrado eficiente de un archivo o un objeto similar a un archivo.

source: Return a digest object that has been updated with contents of file object.
es: Retorna un objeto digest que ha sido actualizado con el contenido del objeto de tipo archivo.

source: *fileobj* must be a file-like object opened for reading in binary mode. It accepts file objects from builtin :func:`open`, :class:`~io.BytesIO` instances, SocketIO objects from :meth:`socket.socket.makefile`, and similar. The function may bypass Python's I/O and use the file descriptor from :meth:`~io.IOBase.fileno` directly. *fileobj* must be assumed to be in an unknown state after this function returns or raises. It is up to the caller to close *fileobj*.
es: *fileobj* debe ser un objeto similar a un archivo abierto para lectura en modo binario. Acepta objetos fichero de instancias :func:`open`, :class:`~io.BytesIO`, objetos SocketIO de :meth:`socket.socket.makefile`, y similares. La función puede saltarse la E/S de Python y usar directamente el descriptor de fichero de :meth:`~io.IOBase.fileno`. Debe asumirse que *fileobj* está en un estado desconocido después de que esta función devuelva o lance. Es responsabilidad del que llama cerrar *fileobj*.

source: *digest* must either be a hash algorithm name as a *str*, a hash constructor, or a callable that returns a hash object.
es: *digest* debe ser un nombre de algoritmo de cifrado como *str*, un constructor de cifrado o un invocable que devuelva un objeto cifrado.

source: Example:
es: Ejemplo:

source: Key derivation
es: Derivación de clave

source: Key derivation and key stretching algorithms are designed for secure password hashing. Naive algorithms such as ``sha1(password)`` are not resistant against brute-force attacks. A good password hashing function must be tunable, slow, and include a `salt <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.
es: Los algoritmos de derivación de clave y estiramiento de clave están diseñados para el cifrado seguro de contraseña. Algoritmos ingenuos como ``sha1(password)`` no son resistentes contra ataques de fuerza bruta. Una buena función hash de contraseña debe ser afinable, lenta e incluir una `sal <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.

source: The function provides PKCS#5 password-based key derivation function 2. It uses HMAC as pseudorandom function.
es: La función provee contraseñas PKCS#5 basadas en función de derivación de clave 2. Usa HMAC como función de pseudoaleatoriedad.

source: The string *hash_name* is the desired name of the hash digest algorithm for HMAC, e.g. 'sha1' or 'sha256'. *password* and *salt* are interpreted as buffers of bytes. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
es: La cadena *hash_name* es el nombre deseado del algoritmo de resumen de hash para HMAC, ej. 'sha1' o 'sha256'. *password* y *salt* son interpretados como búferes de bytes. Aplicaciones y bibliotecas deberían limitar *password* a un largo razonable (ej. 1024). *salt* debería ser sobre 16 o más bytes desde una fuente adecuada, ej. :func:`os.urandom`.

source: The number of *iterations* should be chosen based on the hash algorithm and computing power. As of 2022, hundreds of thousands of iterations of SHA-256 are suggested. For rationale as to why and how to choose what is best for your application, read *Appendix A.2.2* of NIST-SP-800-132_. The answers on the `stackexchange pbkdf2 iterations question`_ explain in detail.
es: El número de *iterations* debe elegirse en función del algoritmo de cifrado y la potencia de cálculo. A partir de 2022, se sugieren cientos de miles de iteraciones de SHA-256. Para saber por qué y cómo elegir lo mejor para su aplicación, lea el *Apéndice A.2.2* de NIST-SP-800-132_. Las respuestas sobre `stackexchange pbkdf2 iterations question`_ lo explican en detalle.

source: *dklen* is the length of the derived key. If *dklen* is ``None`` then the digest size of the hash algorithm *hash_name* is used, e.g. 64 for SHA-512.
es: *dklen* es el largo de la clave derivada. Si *dklen* es ``None`` entonces el tamaño de resumen del algoritmo de hash *hash_name* es usado, ej. 64 para SHA-512.

source: The function provides scrypt password-based key derivation function as defined in :rfc:`7914`.
es: La función provee una contraseña scrypt basada en una función derivación de clave como es definida en :rfc:`7914`.

source: *password* and *salt* must be :term:`bytes-like objects <bytes-like object>`. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
es: *password* y *salt* deben ser :term:`objetos de bytes <bytes-like object>`. Aplicaciones y bibliotecas deberían limitar *password* a un largo razonable (ej. 1024). *salt* debería ser aproximadamente 16 o más bytes de una fuente adecuada, ej. :func:`os.unrandom`.

source: *n* is the CPU/Memory cost factor, *r* the block size, *p* parallelization factor and *maxmem* limits memory (OpenSSL 1.1.0 defaults to 32 MiB). *dklen* is the length of the derived key.
es: *n* es el factor de coste de CPU/Memoria, *r* el tamaño de bloque, *p* el factor de paralelización y *maxmem* limita la memoria (OpenSSL 1.1.0 por defecto a 32 MiB). *dklen* es el largo de la clave derivada.

source: BLAKE2_ is a cryptographic hash function defined in :rfc:`7693` that comes in two flavors:
es: BLAKE2_ es una función de hash criptográfico definida en :rfc:`7693` que viene en dos sabores:

source: **BLAKE2b**, optimized for 64-bit platforms and produces digests of any size between 1 and 64 bytes,
es: **BLAKE2b**, optimizada para plataformas de 64 bits y produce resúmenes de cualquier tamaño entre 1 y 64 bytes,

source: **BLAKE2s**, optimized for 8- to 32-bit platforms and produces digests of any size between 1 and 32 bytes.
es: **BLAKE2s**, optimizada para plataformas de 8 a 32 bits y produce resúmenes de cualquier tamaño entre 1 y 32 bytes.

source: BLAKE2 supports **keyed mode** (a faster and simpler replacement for HMAC_), **salted hashing**, **personalization**, and **tree hashing**.
es: BLAKE2 proporciona el **modo keyed** (un remplazamiento más simple rápido para HMAC_), **cifrado salado** (*salted hashing*), **personalización** y **cifrado de árbol**.

source: Hash objects from this module follow the API of standard library's :mod:`hashlib` objects.
es: Los objetos hash de este módulo siguen los estándares de los objetos de la biblioteca :mod:`hashlib`.

source: Creating hash objects
es: Creando objetos hash

source: New hash objects are created by calling constructor functions:
es: Se crean nuevos objetos hash invocando a las funciones de constructor:

source: These functions return the corresponding hash objects for calculating BLAKE2b or BLAKE2s. They optionally take these general parameters:
es: Estas funciones retornan los objetos hash correspondientes para calcular BLAKE2b o BLAKE2s. Ellas toman opcionalmente estos parámetros generales:

source: *data*: initial chunk of data to hash, which must be :term:`bytes-like object`. It can be passed only as positional argument.
es: *data*: trozo inicial de datos a cifrar, el cual debe ser un :term:`bytes-like object`. Puede ser pasado sólo como argumento posicional.

source: *digest_size*: size of output digest in bytes.
es: *digest_size*: tamaño del resumen de salida en bytes.

source: *key*: key for keyed hashing (up to 64 bytes for BLAKE2b, up to 32 bytes for BLAKE2s).
es: *key*: clave para el cifrado de clave (*keyed hashing*) (hasta 64 bytes para BLAKE2b, hasta 32 bytes para BLAKE2s).

source: *salt*: salt for randomized hashing (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
es: *salt*: sal para el cifrado aleatorio (hasta 16 bytes para BLAKE2b, hasta 8 bytes para BLAKE2s).

source: *person*: personalization string (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
es: *person*: cadena de personalización (hasta 16 bytes para BLAKE2b, hasta 8 bytes para BLAKE2s).

source: The following table shows limits for general parameters (in bytes):
es: La siguiente tabla muestra los límites para parámetros generales (en bytes):

source: Hash
es: Cifrado

source: BLAKE2 specification defines constant lengths for salt and personalization parameters, however, for convenience, this implementation accepts byte strings of any size up to the specified length. If the length of the parameter is less than specified, it is padded with zeros, thus, for example, ``b'salt'`` and ``b'salt\x00'`` is the same value. (This is not the case for *key*.)
es: La especificación BLAKE2 define largos constantes para los parámetros de sal y personalización, sin embargo, por conveniencia, esta implementación acepta cadenas de bytes de cualquier tamaño hasta el largo especificado. Si el largo del parámetro es menor que el especificado, es acolchado con ceros, por lo tanto, por ejemplo, ``b'salt'`` y ``b'salt\x00'`` es el mismo valor. (Este no es el caso para *key*.)

source: These sizes are available as module `constants`_ described below.
es: Estos tamaños están disponibles como `constantes`_ del módulo descritas abajo.

source: Constructor functions also accept the following tree hashing parameters:
es: Las funciones constructoras también aceptan los siguientes parámetros de cifrado de árbol:

source: *fanout*: fanout (0 to 255, 0 if unlimited, 1 in sequential mode).
es: *fanout*: despliegue en abanico (0 a 255, 0 si ilimitado, 1 en modo secuencial).

source: *depth*: maximal depth of tree (1 to 255, 255 if unlimited, 1 in sequential mode).
es: *depth*: profundidad máxima del árbol (1 a 255, 255 si ilimitado, 1 en modo secuencial).

source: *leaf_size*: maximal byte length of leaf (0 to ``2**32-1``, 0 if unlimited or in sequential mode).
es: *leaf_size*: tamaño máximo en bytes de hoja (0 a ``2**32-1``, 0 si ilimitado o en modo secuencial).

source: *node_offset*: node offset (0 to ``2**64-1`` for BLAKE2b, 0 to ``2**48-1`` for BLAKE2s, 0 for the first, leftmost, leaf, or in sequential mode).
es: *node_offset*: desplazamiento del nodo (0 a ``2**64-1`` para BLAKE2b, 0 a ``2**48-1`` para BLAKE2s, 0 para la primera hoja más a la izquierda, o en modo secuencial).

source: *node_depth*: node depth (0 to 255, 0 for leaves, or in sequential mode).
es: *node_depth*: profundidad de nodo (0 a 255, 0 para hojas o en modo secuencial).

source: *inner_size*: inner digest size (0 to 64 for BLAKE2b, 0 to 32 for BLAKE2s, 0 in sequential mode).
es: *inner_size*: tamaño interno del resumen (0 a 64 para BLAKE2b, 0 a 32 para BLAKE2s, 0 en modo secuencial).

source: *last_node*: boolean indicating whether the processed node is the last one (``False`` for sequential mode).
es: *last_node*: booleano indicando si el nodo procesado es el último (``False`` para modo secuencial).

source: Explanation of tree mode parameters.
es: Explicación de los parámetros del modo árbol.

source: Constants
es: Constantes

source: Salt length (maximum length accepted by constructors).
es: Largo de sal (largo máximo aceptado por los constructores).

source: Personalization string length (maximum length accepted by constructors).
es: Largo de cadena de personalización (largo máximo aceptado por los constructores).

source: Maximum key size.
es: Tamaño máximo de clave.

source: Maximum digest size that the hash function can output.
es: Tamaño máximo de resumen que puede producir la función hash.

source: Examples
es: Ejemplos

source: Simple hashing
es: Cifrado simple

source: As a shortcut, you can pass the first chunk of data to update directly to the constructor as the positional argument:
es: Como atajo, puedes pasar el primer trozo de datos para actualizar directamente el constructor como el argumento posicional:

source: You can call :meth:`hash.update` as many times as you need to iteratively update the hash:
es: Puedes invocar :meth:`hash.update` tantas veces como necesites para actualizar el hash iterativamente:

source: Using different digest sizes
es: Usar diferentes tamaños de resumen

source: BLAKE2 has configurable size of digests up to 64 bytes for BLAKE2b and up to 32 bytes for BLAKE2s. For example, to replace SHA-1 with BLAKE2b without changing the size of output, we can tell BLAKE2b to produce 20-byte digests:
es: BLAKE2 tiene tamaño de resúmenes configurables de hasta 64 bytes para BLAKE2b y 32 bytes para BLAKE2s. Por ejemplo, para remplazar SHA-1 con BLAKE2b sin cambiar el tamaño de la salida, puedes decirle a BLAKE2b que produzca resúmenes de 20 bytes:

source: Hash objects with different digest sizes have completely different outputs (shorter hashes are *not* prefixes of longer hashes); BLAKE2b and BLAKE2s produce different outputs even if the output length is the same:
es: Objetos hash con diferentes tamaños de resumen tienen salidas completamente diferentes (hashes más cortos *no* son prefijos de hashes más largos); BLAKE2b y BLAKE2s producen salidas diferentes incluso si el largo de salida es el mismo:

source: Keyed hashing
es: Cifrado de clave

source: Keyed hashing can be used for authentication as a faster and simpler replacement for `Hash-based message authentication code <https://en.wikipedia.org/wiki/HMAC>`_ (HMAC). BLAKE2 can be securely used in prefix-MAC mode thanks to the indifferentiability property inherited from BLAKE.
es: El cifrado de clave puede ser usado para autentificación como un remplazo más rápido y simple para `Código de autentificación de mensajes en clave-hash <https://es.wikipedia.org/wiki/HMAC>`_ (HMAC). BLAKE2 puede ser usado de forma segura en modo de prefijo MAC gracias a la propiedad de indiferenciabilidad heredada de BLAKE.

source: This example shows how to get a (hex-encoded) 128-bit authentication code for message ``b'message data'`` with key ``b'pseudorandom key'``::
es: Este ejemplo muestra como obtener un código de autentificación (codificado como hexadecimal) de 128 bits para el mensaje ``b'message data'`` con la clave ``b'pseudorandom key'``::

source: As a practical example, a web application can symmetrically sign cookies sent to users and later verify them to make sure they weren't tampered with::
es: Como ejemplo práctico, una aplicación web puede firmar simétricamente cookies enviadas a los usuarios y verificarlas más tarde para asegurar que no fueron manipuladas con::

source: Even though there's a native keyed hashing mode, BLAKE2 can, of course, be used in HMAC construction with :mod:`hmac` module::
es: Incluso aunque hay un modo de cifrado de claves nativo, BLAKE2 puede, por supuesto, ser usado en construcción de HMAC con el módulo :mod:`hmac`::

source: Randomized hashing
es: Cifrado aleatorio

source: By setting *salt* parameter users can introduce randomization to the hash function. Randomized hashing is useful for protecting against collision attacks on the hash function used in digital signatures.
es: Definiendo el parámetro *salt* los usuarios pueden introducir aleatoriedad a la función hash. El cifrado aleatorio es útil para proteger contra ataques de colisión en la función hash usada en firmas digitales.
