Repository: python/python-docs-es
Catalog: library/hashlib.po
Languages: es

source: Randomized hashing is designed for situations where one party, the message preparer, generates all or part of a message to be signed by a second party, the message signer. If the message preparer is able to find cryptographic hash function collisions (i.e., two messages producing the same hash value), then they might prepare meaningful versions of the message that would produce the same hash value and digital signature, but with different results (e.g., transferring $1,000,000 to an account, rather than $10). Cryptographic hash functions have been designed with collision resistance as a major goal, but the current concentration on attacking cryptographic hash functions may result in a given cryptographic hash function providing less collision resistance than expected. Randomized hashing offers the signer additional protection by reducing the likelihood that a preparer can generate two or more messages that ultimately yield the same hash value during the digital signature generation process --- even if it is practical to find collisions for the hash function. However, the use of randomized hashing may reduce the amount of security provided by a digital signature when all portions of the message are prepared by the signer.
es: El cifrado aleatorio está diseñado para situaciones en las que una parte, el preparador del mensaje, genera todo o parte de un mensaje para ser firmado por una segunda parte, el firmante del mensaje. Si el preparador del mensaje es capaz de encontrar colisiones de funciones hash criptográficas (ej., dos mensajes produciendo el mismo valor de hash), entonces ellos pueden preparar versiones significativas del mensaje que producirían el mismo valor de hash y firma digital, pero con diferentes resultados (ej., transfiriendo 1,000,000 $ a una cuenta, en lugar de 10 $), Las funciones de hash criptográfico han sido diseñadas con resistencia de colisión como objetivo principal, pero la concentración actual en el ataque a las funciones hash criptográficas puede resultar en una función hash criptográfica dada que provea menor resistencia de colisión de la esperada. El cifrado aleatorio ofrece al firmante protección adicional reduciendo la probabilidad de que un preparador puede generar dos o más mensajes que en última instancia producen el mismo valor hash durante el proceso de generación de la firma digital, --- incluso si es práctico encontrar colisiones para la función hash. Sin embargo, el uso de cifrado aleatorio puede reducir la cantidad de seguridad provista por una firma digital cuando todas las porciones del mensaje son preparadas por el firmante.

source: In BLAKE2 the salt is processed as a one-time input to the hash function during initialization, rather than as an input to each compression function.
es: En BLAKE2 la sal es procesada como una entrada de una vez a la función hash durante la inicialización, en lugar de como una entrada para cada función de compresión.

source: Personalization
es: Personalización

source: Sometimes it is useful to force hash function to produce different digests for the same input for different purposes. Quoting the authors of the Skein hash function:
es: A veces es útil forzar a la función hash para producir diferentes resúmenes para la misma entrada para diferentes propósitos. Citando a los autores de la función hash Skein:

source: We recommend that all application designers seriously consider doing this; we have seen many protocols where a hash that is computed in one part of the protocol can be used in an entirely different part because two hash computations were done on similar or related data, and the attacker can force the application to make the hash inputs the same. Personalizing each hash function used in the protocol summarily stops this type of attack.
es: Recomendamos que todos los diseñadores de aplicaciones consideren seriamente hacer esto; hemos visto muchos protocolos donde un hash que es calculado en una parte del protocolo puede ser usado en una parte completamente diferente porque dos cálculos hash fueron realizados en datos similares o relacionados, y el atacante puede forzar a la aplicación a hacer las entradas hash iguales. Personalizar cada función hash usada en el protocolo resumidamente detiene este tipo de ataque.

source: BLAKE2 can be personalized by passing bytes to the *person* argument::
es: BLAKE2 puede ser personalizado pasando bytes al argumento *person*::

source: Personalization together with the keyed mode can also be used to derive different keys from a single one.
es: Se puede usar también personalización en conjunto con el modo de clave para derivar diferentes claves desde una sola.

source: Tree mode
es: Modo de árbol

source: Here's an example of hashing a minimal tree with two leaf nodes::
es: Aquí hay un ejemplo de cifrar un árbol mínimo con dos nodos de hoja::

source: This example uses 64-byte internal digests, and returns the 32-byte final digest::
es: Este ejemplo usa resúmenes internos de 64 bytes, y retorna el resumen final de 32 bytes::

source: Credits
es: Créditos

source: BLAKE2_ was designed by *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn*, and *Christian Winnerlein* based on SHA-3_ finalist BLAKE_ created by *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier*, and *Raphael C.-W. Phan*.
es: BLAKE2_ fue diseñado por *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn* y *Christian Winnerlein* basado en el SHA-3_ finalista BLAKE_ creado por *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier* y *Raphael C.-W. Phan*.

source: It uses core algorithm from ChaCha_ cipher designed by *Daniel J. Bernstein*.
es: Usa el algoritmo núcleo del cifrado ChaCha_ diseñado por *Daniel J. Bernstein*.

source: The stdlib implementation is based on pyblake2_ module. It was written by *Dmitry Chestnykh* based on C implementation written by *Samuel Neves*. The documentation was copied from pyblake2_ and written by *Dmitry Chestnykh*.
es: La implementación stdlib está basada en el módulo pyblake2_. Fue escrita por *Dmitry Chestnykh* basada en la implementación C escrita por *Samuel Neves*. La documentación fue copiada desde pyblake2_ y escrita por *Dmitry Chestnykh*.

source: The C code was partly rewritten for Python by *Christian Heimes*.
es: El código C fue parcialmente reescrito para Python por *Christian Heimes*.

source: The following public domain dedication applies for both C hash function implementation, extension code, and this documentation:
es: La siguiente dedicación de dominio público aplica tanto para la implementación de la función hash C, el código de extensión y su documentación:

source: To the extent possible under law, the author(s) have dedicated all copyright and related and neighboring rights to this software to the public domain worldwide. This software is distributed without any warranty.
es: En la medida en que la ley lo permite, el/los autor/es han dedicado todos los derechos de autor y los derechos relacionados y vecinos de este software al dominio público mundial. Este software se distribuye sin ninguna garantía.

source: You should have received a copy of the CC0 Public Domain Dedication along with this software. If not, see https://creativecommons.org/publicdomain/zero/1.0/.
es: Deberías haber recibido una copia de la Dedicación CC0 de Dominio Público junto a este software. Si no, consulta https://creativecommons.org/publicdomain/zero/1.0/.

source: The following people have helped with development or contributed their changes to the project and the public domain according to the Creative Commons Public Domain Dedication 1.0 Universal:
es: Las siguientes personas han ayudado con el desarrollo o contribuyeron con sus cambios al proyecto y el dominio público de acuerdo a Creative Commons Public Domain Dedication 1.0 Universal:

source: Module :mod:`hmac`
es: Módulo :mod:`hmac`

source: A module to generate message authentication codes using hashes.
es: Un módulo para generar mensajes de códigos de autentificación usando hashes.

source: Module :mod:`base64`
es: Módulo :mod:`base64`

source: Another way to encode binary hashes for non-binary environments.
es: Otra forma de codificar hashes binarios para entornos no binarios.

source: Official BLAKE2 website.
es: Sitio web oficial de BLAKE2.

source: Wikipedia article with information on which algorithms have known issues and what that means regarding their use.
es: Artículo de Wikipedia con información sobre cuáles algoritmos tienen errores conocidos y lo que eso significa con respecto a su uso.

source: NIST Recommendation for Password-Based Key Derivation.
es: Recomendación de NIST para la derivación de claves basadas en contraseña.
