Repository: python/python-docs-es
Catalog: library/heapq.po
Languages: es

source: :mod:`heapq` --- Heap queue algorithm
es: :mod:`heapq` --- Algoritmo de colas con prioridad o montículos

source: **Source code:** :source:`Lib/heapq.py`
es: **Código fuente:** :source:`Lib/heapq.py`

source: This module provides an implementation of the heap queue algorithm, also known as the priority queue algorithm.
es: Este módulo proporciona una implementación del algoritmo de montículos, también conocido como algoritmo de cola con prioridad.

source: Heaps are binary trees for which every parent node has a value less than or equal to any of its children. This implementation uses arrays for which ``heap[k] <= heap[2*k+1]`` and ``heap[k] <= heap[2*k+2]`` for all *k*, counting elements from zero. For the sake of comparison, non-existing elements are considered to be infinite. The interesting property of a heap is that its smallest element is always the root, ``heap[0]``.
es: Los montículos son árboles binarios para los cuales cada nodo padre tiene un valor menor o igual que cualquiera de sus hijos. Esta implementación utiliza matrices para las cuales ``heap[k] <= heap[2*k+1]`` y ``heap[k] <= heap[2*k+2]`` para todo *k*, contando los elementos desde cero. Para poder comparar, los elementos inexistentes se consideran infinitos. La propiedad interesante de un montículo es que su elemento más pequeño es siempre la raíz, ``heap[0]``.

source: The API below differs from textbook heap algorithms in two aspects: (a) We use zero-based indexing. This makes the relationship between the index for a node and the indexes for its children slightly less obvious, but is more suitable since Python uses zero-based indexing. (b) Our pop method returns the smallest item, not the largest (called a "min heap" in textbooks; a "max heap" is more common in texts because of its suitability for in-place sorting).
es: El API que se presenta a continuación difiere de los algoritmos de los libros de texto en dos aspectos: a) Utilizamos la indexación basada en cero. Esto hace que la relación entre el índice de un nodo y los índices de sus hijos sea un poco menos evidente, pero es más adecuado ya que Python utiliza la indexación basada en cero. b) Nuestro método "pop" devuelve el elemento más pequeño, no el más grande (llamado "min heap" o montículo por mínimo en los libros de texto; un "max heap" o montículo por máximos es más común en los textos debido a su idoneidad para la clasificación in situ).

source: These two make it possible to view the heap as a regular Python list without surprises: ``heap[0]`` is the smallest item, and ``heap.sort()`` maintains the heap invariant!
es: Estos dos permiten ver el montículo como una lista Python normal sin sorpresas: ``heap[0]`` es el ítem más pequeño, y ``heap.sort()`` mantiene el montículo invariable!

source: To create a heap, use a list initialized to ``[]``, or you can transform a populated list into a heap via function :func:`heapify`.
es: Para crear un montículo, usa una lista inicializada como ``[]``, o puedes transformar una lista poblada en un montículo a través de la función :func:`heapify`.

source: The following functions are provided:
es: Las siguientes funciones están previstas:

source: Push the value *item* onto the *heap*, maintaining the heap invariant.
es: Empujar el valor *item* en el *montículo*, manteniendo el montículo invariable.

source: Pop and return the smallest item from the *heap*, maintaining the heap invariant. If the heap is empty, :exc:`IndexError` is raised. To access the smallest item without popping it, use ``heap[0]``.
es: Desapile o *pop* y devuelva el artículo más pequeño del *montículo*, manteniendo el montículo invariable. Si el montículo está vacío, :exc:``IndexError`` se lanza. Para acceder al elemento más pequeño sin necesidad de desapilar, usa``heap[0]``.

source: Push *item* on the heap, then pop and return the smallest item from the *heap*. The combined action runs more efficiently than :func:`heappush` followed by a separate call to :func:`heappop`.
es: Apila el artículo o *iem* en el montículo, y luego desapila y devuelve el artículo más pequeño del montículo. La acción combinada se ejecuta más eficientemente que :func:`heappush` seguido de una llamada separada a :func:`heappop`.

source: Transform list *x* into a heap, in-place, in linear time.
es: Transformar la lista *x* en un montículo, en el lugar, en tiempo lineal.

source: Pop and return the smallest item from the *heap*, and also push the new *item*. The heap size doesn't change. If the heap is empty, :exc:`IndexError` is raised.
es: Desapile y devuelve el artículo más pequeño del *montículo*, y también apile el nuevo *artículo*. El tamaño del montículo no cambia. Si el montículo está vacío, :exc:`IndexError` se eleva.

source: This one step operation is more efficient than a :func:`heappop` followed by :func:`heappush` and can be more appropriate when using a fixed-size heap. The pop/push combination always returns an element from the heap and replaces it with *item*.
es: Esta operación de un solo paso es más eficiente que un :func:`heappop` seguido por :func:`heappush` y puede ser más apropiada cuando se utiliza un montículo de tamaño fijo. La combinación pop/push siempre devuelve un elemento del montículo y lo reemplaza con *item*.

source: The value returned may be larger than the *item* added. If that isn't desired, consider using :func:`heappushpop` instead. Its push/pop combination returns the smaller of the two values, leaving the larger value on the heap.
es: El valor devuelto puede ser mayor que el *articulo* añadido. Si no se desea eso, considere usar :func:`heappushpop` en su lugar. Su combinación push/pop devuelve el menor de los dos valores, dejando el mayor valor en el montículo.

source: The module also offers three general purpose functions based on heaps.
es: El módulo también ofrece tres funciones de propósito general basadas en los montículos.

source: Merge multiple sorted inputs into a single sorted output (for example, merge timestamped entries from multiple log files). Returns an :term:`iterator` over the sorted values.
es: Fusionar varias entradas ordenadas en una sola salida ordenada (por ejemplo, fusionar entradas con marca de tiempo de varios archivos de registro). Devuelva un :term:`iterator` sobre los valores ordenados.

source: Similar to ``sorted(itertools.chain(*iterables))`` but returns an iterable, does not pull the data into memory all at once, and assumes that each of the input streams is already sorted (smallest to largest).
es: Similar a ``sorted(itertools.chain(*iterables))`` pero devuelve un iterable, no hala los datos a la memoria de una sola vez, y asume que cada uno de los flujos de entrada ya están ordenado (de menor a mayor).

source: Has two optional arguments which must be specified as keyword arguments.
es: Tiene dos argumentos opcionales que deben ser especificados como argumentos de palabras clave.

source: *key* specifies a :term:`key function` of one argument that is used to extract a comparison key from each input element. The default value is ``None`` (compare the elements directly).
es: *key* especifica una :term:`key function` de un argumento que se utiliza para extraer una clave de comparación de cada elemento de entrada. El valor por defecto es ``None`` (compara los elementos directamente).

source: *reverse* is a boolean value. If set to ``True``, then the input elements are merged as if each comparison were reversed. To achieve behavior similar to ``sorted(itertools.chain(*iterables), reverse=True)``, all iterables must be sorted from largest to smallest.
es: *reverse* es un valor booleano. Si se establece en ``True``, entonces los elementos de entrada se fusionan como si cada comparación se invirtiera. Para lograr un comportamiento similar a ``sorted(itertools.chain(*iterables), reverse=True)``, todos los iterables deben ser ordenados de mayor a menor.

source: Added the optional *key* and *reverse* parameters.
es: Añadió los parámetros opcionales de *key* y *reverse*.

source: Return a list with the *n* largest elements from the dataset defined by *iterable*. *key*, if provided, specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). Equivalent to: ``sorted(iterable, key=key, reverse=True)[:n]``.
es: Devuelve una lista con los *n* elementos más grandes del conjunto de datos definidos por *iterable*. *key*, si se proporciona, especifica una función de un argumento que se utiliza para extraer una clave de comparación de cada elemento en *iterable* (por ejemplo, ``key=str.lower``). Equivalente a: ``sorted(iterable, key=clave, reverse=True)[:n]``.

source: Return a list with the *n* smallest elements from the dataset defined by *iterable*. *key*, if provided, specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). Equivalent to: ``sorted(iterable, key=key)[:n]``.
es: Devuelve una lista con los *n* elementos más pequeños del conjunto de datos definidos por *iterable*. *key*, si se proporciona, especifica una función de un argumento que se utiliza para extraer una clave de comparación de cada elemento en *iterable* (por ejemplo, ``key=str.lower``). Equivalente a: ``sorted(iterable, key=clave)[:n]``.

source: The latter two functions perform best for smaller values of *n*. For larger values, it is more efficient to use the :func:`sorted` function. Also, when ``n==1``, it is more efficient to use the built-in :func:`min` and :func:`max` functions. If repeated usage of these functions is required, consider turning the iterable into an actual heap.
es: Las dos últimas funciones funcionan mejor para valores más pequeños de *n*. Para valores más grandes, es más eficiente usar la función :func:`sorted`. Además, cuando ``n==1``, es más eficiente usar las funciones incorporadas :func:`min` y :func:`max``. Si se requiere el uso repetido de estas funciones, considere convertir lo iterable en un verdadero montículo.

source: Basic Examples
es: Ejemplos Básicos

source: A `heapsort <https://en.wikipedia.org/wiki/Heapsort>`_ can be implemented by pushing all values onto a heap and then popping off the smallest values one at a time::
es: Un `heapsort" <https://en.wikipedia.org/wiki/Heapsort>`_ puede ser implementado empujando todos los valores en un montículo y luego desapilando los valores más pequeños uno a la vez::

source: This is similar to ``sorted(iterable)``, but unlike :func:`sorted`, this implementation is not stable.
es: Esto es similar a ``sorted(iterable)``, pero a diferencia de :func:`sorted`, esta implementación no es estable.

source: Heap elements can be tuples. This is useful for assigning comparison values (such as task priorities) alongside the main record being tracked::
es: Los elementos del montículo pueden ser tuplas. Esto es útil para asignar valores de comparación (como las prioridades de las tareas) junto con el registro principal que se está rastreando::

source: Priority Queue Implementation Notes
es: Notas de Aplicación de la Cola de Prioridades

source: A `priority queue <https://en.wikipedia.org/wiki/Priority_queue>`_ is common use for a heap, and it presents several implementation challenges:
es: Una `cola de prioridad <https://en.wikipedia.org/wiki/Priority_queue>`_ es de uso común para un montículo, y presenta varios desafíos de implementación:

source: Sort stability: how do you get two tasks with equal priorities to be returned in the order they were originally added?
es: Estabilidad de la clasificación: ¿cómo se consigue que dos tareas con iguales prioridades sean devueltas en el orden en que fueron añadidas originalmente?

source: Tuple comparison breaks for (priority, task) pairs if the priorities are equal and the tasks do not have a default comparison order.
es: Interrupciones de comparación en tupla para pares (prioridad, tarea) si las prioridades son iguales y las tareas no tienen un orden de comparación por defecto.

source: If the priority of a task changes, how do you move it to a new position in the heap?
es: ¿Si la prioridad de una tarea cambia, cómo la mueves a una nueva posición en el montículo?

source: Or if a pending task needs to be deleted, how do you find it and remove it from the queue?
es: ¿O si una tarea pendiente necesita ser borrada, cómo la encuentras y la eliminas de la cola?

source: A solution to the first two challenges is to store entries as 3-element list including the priority, an entry count, and the task. The entry count serves as a tie-breaker so that two tasks with the same priority are returned in the order they were added. And since no two entry counts are the same, the tuple comparison will never attempt to directly compare two tasks.
es: Una solución a los dos primeros desafíos es almacenar las entradas como una lista de 3 elementos que incluya la prioridad, un recuento de entradas y la tarea. El recuento de entradas sirve como un desempate para que dos tareas con la misma prioridad sean devueltas en el orden en que fueron añadidas. Y como no hay dos recuentos de entradas iguales, la comparación tupla nunca intentará comparar directamente dos tareas.

source: Another solution to the problem of non-comparable tasks is to create a wrapper class that ignores the task item and only compares the priority field::
es: Otra solución al problema de las tareas no comparables es crear una clase envolvente que ignore el elemento de la tarea y sólo compare el campo de prioridad::

source: The remaining challenges revolve around finding a pending task and making changes to its priority or removing it entirely. Finding a task can be done with a dictionary pointing to an entry in the queue.
es: Los desafíos restantes giran en torno a encontrar una tarea pendiente y hacer cambios en su prioridad o eliminarla por completo. Encontrar una tarea se puede hacer con un diccionario que apunta a una entrada en la cola.

source: Removing the entry or changing its priority is more difficult because it would break the heap structure invariants. So, a possible solution is to mark the entry as removed and add a new entry with the revised priority::
es: Eliminar la entrada o cambiar su prioridad es más difícil porque rompería las invariantes de la estructura del montículo. Por lo tanto, una posible solución es marcar la entrada como eliminada y añadir una nueva entrada con la prioridad revisada::

source: Theory
es: Teoría

source: Heaps are arrays for which ``a[k] <= a[2*k+1]`` and ``a[k] <= a[2*k+2]`` for all *k*, counting elements from 0. For the sake of comparison, non-existing elements are considered to be infinite. The interesting property of a heap is that ``a[0]`` is always its smallest element.
es: Los montículos son conjuntos para los cuales``a[k] <= a[2*k+1]`` y "a[k] <= a[2*k+2]`` para todos los *k*, contando los elementos desde 0. Para comparar, los elementos no existentes se consideran infinitos. La interesante propiedad de un montículo es que ``a[0]`` es siempre su elemento más pequeño.

source: The strange invariant above is meant to be an efficient memory representation for a tournament. The numbers below are *k*, not ``a[k]``::
es: La extraña invariante de arriba intenta ser una representación eficiente de la memoria para un torneo. Los números de abajo son *k*, no``a[k]``::

source: In the tree above, each cell *k* is topping ``2*k+1`` and ``2*k+2``. In a usual binary tournament we see in sports, each cell is the winner over the two cells it tops, and we can trace the winner down the tree to see all opponents s/he had. However, in many computer applications of such tournaments, we do not need to trace the history of a winner. To be more memory efficient, when a winner is promoted, we try to replace it by something else at a lower level, and the rule becomes that a cell and the two cells it tops contain three different items, but the top cell "wins" over the two topped cells.
es: En el árbol de arriba, cada celda *k* está coronada por ``2*k+1`` y ``2*k+2``. En un torneo binario habitual que vemos en los deportes, cada celda es el ganador sobre las dos celdas que supera, y podemos rastrear al ganador hasta el árbol para ver todos los oponentes que tuvo. Sin embargo, en muchas aplicaciones informáticas de tales torneos, no necesitamos rastrear la historia de un ganador. Para ser más eficientes en la memoria, cuando un ganador es ascendido, tratamos de reemplazarlo por algo más en un nivel inferior, y la regla se convierte en que una celda y las dos celdas que supera contienen tres elementos diferentes, pero la celda superior "gana" sobre las dos celdas superiores.

source: If this heap invariant is protected at all time, index 0 is clearly the overall winner. The simplest algorithmic way to remove it and find the "next" winner is to move some loser (let's say cell 30 in the diagram above) into the 0 position, and then percolate this new 0 down the tree, exchanging values, until the invariant is re-established. This is clearly logarithmic on the total number of items in the tree. By iterating over all items, you get an O(n log n) sort.
es: Si esta invariante del montículo está protegida en todo momento, el índice 0 es claramente el ganador general. La forma algorítmica más simple de eliminarlo y encontrar el "próximo" ganador es mover algún perdedor (digamos la celda 30 en el diagrama de arriba) a la posición 0, y luego filtrar este nuevo 0 por el árbol, intercambiando valores, hasta que la invariante se reestablezca. Esto es claramente logarítmico en el número total de elementos del árbol. Al iterar sobre todos los elementos, se obtiene una clasificación O(n log n).

source: A nice feature of this sort is that you can efficiently insert new items while the sort is going on, provided that the inserted items are not "better" than the last 0'th element you extracted. This is especially useful in simulation contexts, where the tree holds all incoming events, and the "win" condition means the smallest scheduled time. When an event schedules other events for execution, they are scheduled into the future, so they can easily go into the heap. So, a heap is a good structure for implementing schedulers (this is what I used for my MIDI sequencer :-).
es: Una buena característica de este tipo es que puedes insertar nuevos elementos de manera eficiente mientras se realiza la clasificación, siempre y cuando los elementos insertados no sean "mejores" que el último 0'th elemento que has extraído. Esto es especialmente útil en contextos de simulación, donde el árbol contiene todos los eventos entrantes, y la condición de "ganar" significa el menor tiempo programado. Cuando un evento programa otros eventos para su ejecución, se programan en el futuro, para que puedan ir fácilmente al montículo. Por lo tanto, un montículo es una buena estructura para implementar planificadores o *schedulers* (esto es lo que usé para mi secuenciador MIDI :-).

source: Various structures for implementing schedulers have been extensively studied, and heaps are good for this, as they are reasonably speedy, the speed is almost constant, and the worst case is not much different than the average case. However, there are other representations which are more efficient overall, yet the worst cases might be terrible.
es: Se han estudiado extensamente varias estructuras para implementar los planificadores, y los montículos son buenos para ello, ya que son razonablemente rápidos, la velocidad es casi constante, y el peor de los casos no es muy diferente del caso promedio. Sin embargo, hay otras representaciones que son más eficientes en general, aunque los peores casos podrían ser terribles.

source: Heaps are also very useful in big disk sorts. You most probably all know that a big sort implies producing "runs" (which are pre-sorted sequences, whose size is usually related to the amount of CPU memory), followed by a merging passes for these runs, which merging is often very cleverly organised [#]_. It is very important that the initial sort produces the longest runs possible. Tournaments are a good way to achieve that. If, using all the memory available to hold a tournament, you replace and percolate items that happen to fit the current run, you'll produce runs which are twice the size of the memory for random input, and much better for input fuzzily ordered.
es: Los montículos también son muy útiles en las grandes ordenaciónes de elementos en discos de memoria. Lo más probable es que todos sepan que un tipo grande implica la producción de "corridas" (que son secuencias preclasificadas, cuyo tamaño suele estar relacionado con la cantidad de memoria de la CPU), seguidas de una fusión de pases para estas corridas, cuya fusión suele estar muy inteligentemente organizada [#]_. Es muy importante que la clasificación inicial produzca las ejecuciones posibles más largas. Los torneos son una buena manera de lograrlo. Si, utilizando toda la memoria disponible para celebrar un torneo, sustituyes y filtras los elementos que encajan en la carrera actual, producirás carreras que tienen el doble del tamaño de la memoria para la entrada aleatoria, y mucho mejor para la entrada ordenada de forma difusa.

source: Moreover, if you output the 0'th item on disk and get an input which may not fit in the current tournament (because the value "wins" over the last output value), it cannot fit in the heap, so the size of the heap decreases. The freed memory could be cleverly reused immediately for progressively building a second heap, which grows at exactly the same rate the first heap is melting. When the first heap completely vanishes, you switch heaps and start a new run. Clever and quite effective!
es: Además, si se da salida al *0’th item* en el disco y se obtiene una entrada que no puede caber en el torneo actual (porque el valor "gana" sobre el último valor de salida), no puede caber en el montículo, por lo que el tamaño del montículo disminuye. La memoria liberada podría ser ingeniosamente reutilizada inmediatamente para construir progresivamente un segundo montículo, que crece exactamente al mismo ritmo que el primer montículo se está fundiendo. Cuando el primer montículo se desvanece completamente, se cambia de montículo y se inicia una nueva carrera. ¡Ingenioso y muy efectivo!

source: In a word, heaps are useful memory structures to know. I use them in a few applications, and I think it is good to keep a 'heap' module around. :-)
es: En una palabra, los montículos son estructuras de memoria útiles que conocer. Las uso en algunas aplicaciones, y creo que es bueno tener un módulo 'heap' alrededor. :-)

source: Footnotes
es: Notas al Pie de Pagina
