Repository: python/python-docs-es
Catalog: library/hmac.po
Languages: es

source: :mod:`hmac` --- Keyed-Hashing for Message Authentication
es: :mod:`hmac` --- *Hash* con clave para autenticación de mensajes

source: **Source code:** :source:`Lib/hmac.py`
es: **Código fuente:** :source:`Lib/hmac.py`

source: This module implements the HMAC algorithm as described by :rfc:`2104`.
es: Este módulo implementa el algoritmo HMAC como se describe en la :rfc:`2104`.

source: Return a new hmac object. *key* is a bytes or bytearray object giving the secret key. If *msg* is present, the method call ``update(msg)`` is made. *digestmod* is the digest name, digest constructor or module for the HMAC object to use. It may be any name suitable to :func:`hashlib.new`. Despite its argument position, it is required.
es: Retorna un nuevo objeto hmac. *key* es un objeto *bytes* o *bytearray* que proporciona la clave secreta. Si *msg* está presente, se realiza la llamada al método ``update(msg)``. *digestmod* es el nombre del resumen, constructor o módulo del resumen para el objeto HMAC que se va a usar. Puede ser cualquier nombre adecuado para :func:`hashlib.new`. Se requiere este argumento a pesar de su posición.

source: Parameter *key* can be a bytes or bytearray object. Parameter *msg* can be of any type supported by :mod:`hashlib`. Parameter *digestmod* can be the name of a hash algorithm.
es: El parámetro *key* puede ser un objeto *bytes* o *bytearray*. El parámetro *msg* puede ser de cualquier tipo soportado por :mod:`hashlib`. El parámetro *digestmod* puede ser el nombre del algoritmo de *hash*.

source: MD5 as implicit default digest for *digestmod* is deprecated. The digestmod parameter is now required. Pass it as a keyword argument to avoid awkwardness when you do not have an initial msg.
es: MD5 como resumen por defecto implícito para *digestmod* está obsoleto. Ahora se requiere el parámetro digestmod. Páselo como un argumento de palabra clave para evitar dificultades cuando no tiene un msg inicial.

source: Return digest of *msg* for given secret *key* and *digest*. The function is equivalent to ``HMAC(key, msg, digest).digest()``, but uses an optimized C or inline implementation, which is faster for messages that fit into memory. The parameters *key*, *msg*, and *digest* have the same meaning as in :func:`~hmac.new`.
es: Retorna el resumen de *msg* para una clave *key* secreta y un resumen *digest* dados. La función es equivalente a ``HMAC(key, msg, digest).digest()``, pero utiliza una implementación optimizada en C o *inline*, que es más rápida para mensajes que caben en memoria. Los parámetros *key*, *msg* y *digest* tienen el mismo significado que en :func:`~hmac.new`.

source: CPython implementation detail, the optimized C implementation is only used when *digest* is a string and name of a digest algorithm, which is supported by OpenSSL.
es: Un detalle de la implementación de CPython: la implementación optimizada en C solo se usa cuando *digest* es una cadena de caracteres y el nombre de un algoritmo de resumen, que está soportado por OpenSSL.

source: An HMAC object has the following methods:
es: Un objeto HMAC tiene los siguientes métodos:

source: Update the hmac object with *msg*. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a + b)``.
es: Actualiza el objeto hmac con *msg*. Las llamadas repetidas equivalen a una sola llamada con la concatenación de todos los argumentos: ``m.update(a); m.update(b)`` es equivalente a ``m.update(a + b)``.

source: Parameter *msg* can be of any type supported by :mod:`hashlib`.
es: El parámetro *msg* puede ser de cualquier tipo soportado por :mod:`hashlib`.

source: Return the digest of the bytes passed to the :meth:`update` method so far. This bytes object will be the same length as the *digest_size* of the digest given to the constructor. It may contain non-ASCII bytes, including NUL bytes.
es: Retorna el resumen de los *bytes* que se pasaron al método :meth:`update` hasta el momento. Este objeto *bytes* será de la misma longitud que el *digest_size* del resumen que se pasa al constructor. Puede contener *bytes* no ASCII, incluyendo *bytes* NUL.

source: When comparing the output of :meth:`digest` to an externally supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
es: Cuando se compara la salida de :meth:`digest` a un resumen provisto externamente durante una rutina de verificación, se recomienda utilizar la función :func:`compare_digest` en lugar del operador ``==`` para reducir la vulnerabilidad a ataques de temporización.

source: Like :meth:`digest` except the digest is returned as a string twice the length containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
es: Como :meth:`digest` excepto que el resumen se retorna como una cadena de caracteres de dos veces la longitud conteniendo solo dígitos hexadecimales. Esto se puede utilizar para intercambiar el valor de forma segura en email u otros entornos no binarios.

source: When comparing the output of :meth:`hexdigest` to an externally supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
es: Cuando se compara la salida de :meth:`hexdigest` a un resumen provisto externamente durante una rutina de verificación, se recomienda utilizar la función :func:`compare_digest` en lugar del operador ``==`` para reducir la vulnerabilidad a ataques de temporización.

source: Return a copy ("clone") of the hmac object. This can be used to efficiently compute the digests of strings that share a common initial substring.
es: Retorna una copia ("clon") del objeto hmac. Esto se puede utilizar para calcular de forma eficiente los resúmenes de las cadenas de caracteres que comparten una subcadena de caracteres inicial común.

source: A hash object has the following attributes:
es: Un objeto *hash* tiene los siguientes atributos:

source: The size of the resulting HMAC digest in bytes.
es: El tamaño del resumen HMAC resultante en *bytes*.

source: The internal block size of the hash algorithm in bytes.
es: El tamaño de bloque interno del algoritmo de *hash* en *bytes*.

source: The canonical name of this HMAC, always lowercase, e.g. ``hmac-md5``.
es: El nombre canónico de este HMAC, siempre en minúsculas, por ejemplo ``hmac-md5``.

source: The undocumented attributes ``HMAC.digest_cons``, ``HMAC.inner``, and ``HMAC.outer`` are internal implementation details and will be removed in Python 3.10.
es: Los atributos no documentados ``HMAC.digest_cons``, ``HMAC.inner`` y ``HMAC.outer`` son detalles de implementación interna y se eliminarán en Python 3.10.

source: This module also provides the following helper function:
es: Este módulo también provee las siguiente funciones auxiliares:

source: Return ``a == b``. This function uses an approach designed to prevent timing analysis by avoiding content-based short circuiting behaviour, making it appropriate for cryptography. *a* and *b* must both be of the same type: either :class:`str` (ASCII only, as e.g. returned by :meth:`HMAC.hexdigest`), or a :term:`bytes-like object`.
es: Retorna ``a == b``. Esta función utiliza un enfoque diseñado para prevenir el análisis de temporización evitando el comportamiento de cortocircuito basado en contenido, haciéndolo adecuado para criptografía. *a* y *b* deben ser del mismo tipo: ya sea :class:`str` (solo ASCII, como por ejemplo retornado por :meth:`HMAC.hexdigest`), o un :term:`objeto tipo binario <bytes-like object>`.

source: If *a* and *b* are of different lengths, or if an error occurs, a timing attack could theoretically reveal information about the types and lengths of *a* and *b*—but not their values.
es: Si *a* y *b* son de diferente longitud, o si ocurre un error, un ataque de temporización teóricamente podría revelar información sobre los tipos y longitudes de *a* y *b*—pero no sus valores.

source: The function uses OpenSSL's ``CRYPTO_memcmp()`` internally when available.
es: La función utiliza ``CRYPTO_memcmp()`` de OpenSSL internamente cuando está disponible.

source: Module :mod:`hashlib`
es: Módulo :mod:`hashlib`

source: The Python module providing secure hash functions.
es: El módulo de Python que provee funciones de *hash* seguras.
