Repository: python/python-docs-es
Catalog: library/http.client.po
Languages: es_ar

source: :mod:`http.client` --- HTTP protocol client
es_ar: :mod:`http.client` --- Cliente de protocolo HTTP

source: **Source code:** :source:`Lib/http/client.py`
es_ar: **Código fuente:** :source:`Lib/http/client.py`

source: This module defines classes that implement the client side of the HTTP and HTTPS protocols. It is normally not used directly --- the module :mod:`urllib.request` uses it to handle URLs that use HTTP and HTTPS.
es_ar: Este módulo define clases que implementan el lado del cliente de los protocolos HTTP y HTTPS. Normalmente no se usa directamente --- el módulo :mod:`urllib.request` lo usa para gestionar URLs que utilizan HTTP y HTTPS.

source: HTTPS support is only available if Python was compiled with SSL support (through the :mod:`ssl` module).
es_ar: El soporte HTTPS solo está disponible si Python se compiló con soporte SSL (a través del módulo :mod:`ssl`).

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es_ar: Este módulo no funciona o no está disponible en plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Véase :ref:`wasm-availability` para más información.

source: The module provides the following classes:
es_ar: El módulo proporciona las siguientes clases:

source: An :class:`HTTPConnection` instance represents one transaction with an HTTP server. It should be instantiated by passing it a host and optional port number. If no port number is passed, the port is extracted from the host string if it has the form ``host:port``, else the default HTTP port (80) is used. If the optional *timeout* parameter is given, blocking operations (like connection attempts) will timeout after that many seconds (if it is not given, the global default timeout setting is used). The optional *source_address* parameter may be a tuple of a (host, port) to use as the source address the HTTP connection is made from. The optional *blocksize* parameter sets the buffer size in bytes for sending a file-like message body.
es_ar: Una instancia :class:`HTTPConnection` representa una transacción con un servidor HTTP. Se debe instanciar pasándole un host y un número de puerto opcional. Si no se pasa ningún número de puerto, el puerto se extrae de la cadena de host si tiene la forma ``host:port``; de lo contrario, se utiliza el puerto HTTP predeterminado (80). Si se proporciona el parámetro opcional *timeout*, las operaciones de bloqueo (como los intentos de conexión) expirarán después de esos segundos (si no se proporciona, se usa la configuración de tiempo de espera global predeterminada). El parámetro opcional *source_address* puede ser una tupla de un (host, puerto) para usar como la dirección de origen desde la que se realiza la conexión HTTP. El parámetro opcional *blocksize* establece el tamaño del búfer en bytes para enviar un cuerpo de mensaje similar a un archivo.

source: For example, the following calls all create instances that connect to the server at the same host and port::
es_ar: Por ejemplo, las siguientes llamadas crean instancias que se conectan al servidor en el mismo host y puerto::

source: *source_address* was added.
es_ar: *source_address* fue adicionado.

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
es_ar: Se eliminó el argumento *strict*. Las "Respuestas Simples" de estilo HTTP 0.9 ya no son compatibles.

source: *blocksize* parameter was added.
es_ar: argumento *blocksize* fue adicionado.

source: A subclass of :class:`HTTPConnection` that uses SSL for communication with secure servers. Default port is ``443``. If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options.
es_ar: Una subclase de :class:`HTTPConnection` que usa SSL para la comunicación con servidores seguros. El puerto predeterminado es ``443``. Si se especifica *context*, debe ser una instancia de :class:`ssl.SSLContext` que describa las diversas opciones de SSL.

source: Please read :ref:`ssl-security` for more information on best practices.
es_ar: Por favor lea :ref:`ssl-security` para obtener más información sobre las mejores prácticas.

source: *source_address*, *context* and *check_hostname* were added.
es_ar: *source_address*, *context* y *check_hostname* fueron adicionados.

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
es_ar: Se eliminó el argumento *strict*. Las "Respuestas Simples" de estilo HTTP 0.9 ya no son compatibles.

source: This class now performs all the necessary certificate and hostname checks by default. To revert to the previous, unverified, behavior :func:`ssl._create_unverified_context` can be passed to the *context* parameter.
es_ar: Esta clase ahora realiza todas las comprobaciones necesarias de certificados y nombres de host de forma predeterminada. Para volver al comportamiento anterior no verificado :func:`ssl._create_unverified_context` se puede pasar al argumento *context*.

source: This class now enables TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` for the default *context* or when *cert_file* is passed with a custom *context*.
es_ar: Esta clase ahora habilita TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` para el *context* predeterminado o cuando *cert_file* se pasa con un *context* personalizado.

source: This class now sends an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocol`.
es_ar: Esta clase ahora envía una extensión ALPN con el indicador de protocolo ``http/1.1`` cuando no se proporciona *context*. El *context* personalizado debe configurar los protocolos ALPN con :meth:`~ssl.SSLContext.set_alpn_protocol`.

source: Class whose instances are returned upon successful connection. Not instantiated directly by user.
es_ar: Clase cuyas instancias se retornan tras una conexión exitosa. No son instancias realizadas directamente por el usuario.

source: The *strict* parameter was removed. HTTP 0.9 style "Simple Responses" are no longer supported.
es_ar: Se eliminó el argumento *strict*. Las "Respuestas Simples" del estilo HTTP 0.9 ya no están soportadas.

source: This module provides the following function:
es_ar: Este módulo proporciona la siguiente función:

source: Parse the headers from a file pointer *fp* representing a HTTP request/response. The file has to be a :class:`BufferedIOBase` reader (i.e. not text) and must provide a valid :rfc:`2822` style header.
es_ar: Analiza los encabezados desde un puntero de archivo *fp* que representa una solicitud/respuesta HTTP. El archivo debe ser un lector :class:`BufferedIOBase` (es decir, no texto) y debe proporcionar un encabezado de estilo válido :rfc:`2822`.

source: This function returns an instance of :class:`http.client.HTTPMessage` that holds the header fields, but no payload (the same as :attr:`HTTPResponse.msg` and :attr:`http.server.BaseHTTPRequestHandler.headers`). After returning, the file pointer *fp* is ready to read the HTTP body.
es_ar: Esta función retorna una instancia de :class:`http.client.HTTPMessage` que contiene los campos de encabezado, pero no un *payload* (lo mismo que :attr:`HTTPResponse.msg` y :attr:`http.server.BaseHTTPRequestHandler.headers` ) Después de regresar, el puntero de archivo *fp* está listo para leer el cuerpo HTTP.

source: :meth:`parse_headers` does not parse the start-line of a HTTP message; it only parses the ``Name: value`` lines. The file has to be ready to read these field lines, so the first line should already be consumed before calling the function.
es_ar: :meth:`parse_headers` no analiza la línea de inicio de un mensaje HTTP; solo analiza las líneas ``Name: value``. El archivo tiene que estar listo para leer estas líneas de campo, por lo que la primera línea ya debe consumirse antes de llamar a la función.

source: The following exceptions are raised as appropriate:
es_ar: Las siguientes excepciones son lanzadas según corresponda:

source: The base class of the other exceptions in this module. It is a subclass of :exc:`Exception`.
es_ar: La clase base de las otras excepciones en este módulo. Es una subclase de :exc:`Exception`.

source: A subclass of :exc:`HTTPException`.
es_ar: Una subclase de :exc:`HTTPException`.

source: A subclass of :exc:`HTTPException`, raised if a port is given and is either non-numeric or empty.
es_ar: Una subclase de :exc:`HTTPException`, es lanzada si se proporciona un puerto y no es numérico o está vacío.

source: A subclass of :exc:`ImproperConnectionState`.
es_ar: Una subclase de :exc:`ImproperConnectionState`.

source: A subclass of :exc:`HTTPException`. Raised if a server responds with a HTTP status code that we don't understand.
es_ar: Una subclase de :exc:`HTTPException`. Es lanzada si un servidor responde con un código de estado HTTP que no entendemos.

source: A subclass of :exc:`HTTPException`. Raised if an excessively long line is received in the HTTP protocol from the server.
es_ar: Una subclase de :exc:`HTTPException`. Es lanzada si se recibe una línea excesivamente larga en el protocolo HTTP del servidor.

source: A subclass of :exc:`ConnectionResetError` and :exc:`BadStatusLine`. Raised by :meth:`HTTPConnection.getresponse` when the attempt to read the response results in no data read from the connection, indicating that the remote end has closed the connection.
es_ar: Una subclase de :exc:`ConnectionResetError` y :exc:`BadStatusLine`. Lanzada por :meth:`HTTPConnection.getresponse` cuando el intento de leer la respuesta no produce datos leídos de la conexión, indica que el extremo remoto ha cerrado la conexión.

source: Previously, :exc:`BadStatusLine`\ ``('')`` was raised.
es_ar: Previamente, :exc:`BadStatusLine`\ ``('')`` fue lanzada.

source: The constants defined in this module are:
es_ar: Las constantes definidas en este módulo son:

source: The default port for the HTTP protocol (always ``80``).
es_ar: El puerto predeterminado para el protocolo HTTP (siempre ``80``).

source: The default port for the HTTPS protocol (always ``443``).
es_ar: El puerto predeterminado para el protocolo HTTPS (siempre ``443``).

source: This dictionary maps the HTTP 1.1 status codes to the W3C names.
es_ar: Este diccionario asigna los códigos de estado HTTP 1.1 a los nombres W3C.

source: Example: ``http.client.responses[http.client.NOT_FOUND]`` is ``'Not Found'``.
es_ar: Ejemplo: ``http.client.responses[http.client.NOT_FOUND]`` es ``'Not Found'``.

source: See :ref:`http-status-codes` for a list of HTTP status codes that are available in this module as constants.
es_ar: Consulte :ref:`http-status-codes` para obtener una lista de los códigos de estado HTTP que están disponibles en este módulo como constantes.

source: HTTPConnection Objects
es_ar: Objetos de ``HTTPConnection``

source: :class:`HTTPConnection` instances have the following methods:
es_ar: Las instancias :class:`HTTPConnection` tienen los siguientes métodos:

source: If *body* is specified, the specified data is sent after the headers are finished. It may be a :class:`str`, a :term:`bytes-like object`, an open :term:`file object`, or an iterable of :class:`bytes`. If *body* is a string, it is encoded as ISO-8859-1, the default for HTTP. If it is a bytes-like object, the bytes are sent as is. If it is a :term:`file object`, the contents of the file is sent; this file object should support at least the ``read()`` method. If the file object is an instance of :class:`io.TextIOBase`, the data returned by the ``read()`` method will be encoded as ISO-8859-1, otherwise the data returned by ``read()`` is sent as is. If *body* is an iterable, the elements of the iterable are sent as is until the iterable is exhausted.
es_ar: Si se especifica *body*, los datos especificados se envían una vez finalizados los encabezados. Puede ser :class:`str`, un objeto :term:`bytes-like object`, un objeto :term:`file object` abierto, o un iterable de :class:`bytes`. Si *body* es una cadena, se codifica como ISO-8859-1, el valor predeterminado para HTTP. Si es un objeto de tipo bytes, los bytes se envían tal cual. Si es un objeto :term:`file object`, se envía el contenido del archivo; Este objeto de archivo debe soportar al menos el método ``read()``. Si el objeto de archivo es una instancia de :class:`io.TextIOBase`, los datos retornados por el método ``read()`` se codificarán como ISO-8859-1, de lo contrario, los datos retornados por ``read()`` se envía como está. Si *body* es un iterable, los elementos del iterable se envían tal cual hasta que se agota el iterable.

source: If *headers* contains neither Content-Length nor Transfer-Encoding, but there is a request body, one of those header fields will be added automatically. If *body* is ``None``, the Content-Length header is set to ``0`` for methods that expect a body (``PUT``, ``POST``, and ``PATCH``). If *body* is a string or a bytes-like object that is not also a :term:`file <file object>`, the Content-Length header is set to its length. Any other type of *body* (files and iterables in general) will be chunk-encoded, and the Transfer-Encoding header will automatically be set instead of Content-Length.
es_ar: Si *headers* no contiene ``Content-Length`` ni Transfer-Encoding, pero hay un cuerpo de solicitud, uno de esos campos de encabezado se agregará automáticamente. Si *body* es ``None``, el encabezado ``Content-Length`` se establece en ``0`` para los métodos que esperan un cuerpo (``PUT``, ``POST`` y ``PATCH``) . Si *body* es una cadena de caracteres o un objeto similar a bytes que no es también un :term:`file <file object>`, el encabezado ``Content-Length`` se establece en su longitud. Cualquier otro tipo de *body* (archivos e iterables en general) se codificará en fragmentos, y el encabezado ``Transfer-Encoding`` se establecerá automáticamente en lugar de ``Content-Length``.

source: The *encode_chunked* argument is only relevant if Transfer-Encoding is specified in *headers*. If *encode_chunked* is ``False``, the HTTPConnection object assumes that all encoding is handled by the calling code. If it is ``True``, the body will be chunk-encoded.
es_ar: El argumento *encode_chunked* solo es relevante si ``Transfer-Encoding`` se especifica en *headers*. Si *encode_chunked* es ``False``, el objeto ``HTTPConnection`` supone que toda la codificación es manejada por el código de llamada. Si es ``True``, el cuerpo estará codificado en fragmentos.

source: Chunked transfer encoding has been added to the HTTP protocol version 1.1. Unless the HTTP server is known to handle HTTP 1.1, the caller must either specify the Content-Length, or must pass a :class:`str` or bytes-like object that is not also a file as the body representation.
es_ar: La codificación de transferencia fragmentada se ha agregado al protocolo HTTP versión 1.1. A menos que se sepa que el servidor HTTP maneja HTTP 1.1, el llamador debe especificar la longitud del contenido o debe pasar un :class:`str` o un objeto similar a bytes que no sea también un archivo como la representación del cuerpo.

source: *body* can now be an iterable.
es_ar: *body* ahora puede ser un iterable.

source: If neither Content-Length nor Transfer-Encoding are set in *headers*, file and iterable *body* objects are now chunk-encoded. The *encode_chunked* argument was added. No attempt is made to determine the Content-Length for file objects.
es_ar: Si ni ``Content-Length`` ni ``Transfer-Encoding`` están configurados en *headers*, el archivo y los objetos iterables *body* ahora están codificados en fragmentos. Se agregó el argumento *encode_chunked*. No se intenta determinar la longitud del contenido para los objetos de archivo.

source: Should be called after a request is sent to get the response from the server. Returns an :class:`HTTPResponse` instance.
es_ar: Debe llamarse después de enviar una solicitud para obtener la respuesta del servidor. Retorna una instancia de :class:`HTTPResponse`.

source: Note that you must have read the whole response before you can send a new request to the server.
es_ar: Tenga en cuenta que debe haber leído la respuesta completa antes de poder enviar una nueva solicitud al servidor.

source: If a :exc:`ConnectionError` or subclass is raised, the :class:`HTTPConnection` object will be ready to reconnect when a new request is sent.
es_ar: Si una :exc:`ConnectionError` o una subclase fue lanzada, el objeto :class:`HTTPConnection` estará listo para volver a conectarse cuando se envíe una nueva solicitud.

source: Set the debugging level. The default debug level is ``0``, meaning no debugging output is printed. Any value greater than ``0`` will cause all currently defined debug output to be printed to stdout. The ``debuglevel`` is passed to any new :class:`HTTPResponse` objects that are created.
es_ar: Establecer el nivel de depuración. El nivel de depuración predeterminado es ``0``, lo que significa que no se imprime ninguna salida de depuración. Cualquier valor mayor que ``0`` hará que todos los resultados de depuración definidos actualmente se impriman en *stdout*. El ``debuglevel`` se pasa a cualquier objeto nuevo :class:`HTTPResponse` que se cree.

source: Set the host and the port for HTTP Connect Tunnelling. This allows running the connection through a proxy server.
es_ar: Configure el host y el puerto para el túnel de conexión HTTP. Esto permite ejecutar la conexión a través de un servidor proxy.

source: For example, to tunnel through a HTTPS proxy server running locally on port 8080, we would pass the address of the proxy to the :class:`HTTPSConnection` constructor, and the address of the host that we eventually want to reach to the :meth:`~HTTPConnection.set_tunnel` method::
es_ar: Por ejemplo, para hacer un túnel a través de un servidor proxy HTTPS que se ejecuta localmente en el puerto 8080, pasaríamos la dirección del proxy al constructor :class:`HTTPSConnection`, y la dirección del host al que finalmente queremos llegar al método :meth:`~HTTPConnection.set_tunnel`::

source: Connect to the server specified when the object was created. By default, this is called automatically when making a request if the client does not already have a connection.
es_ar: Se conecta al servidor especificado cuando el objeto fue creado. Por defecto, esto se llama automáticamente cuando se realiza una solicitud si el cliente aún no tiene una conexión.

source: Raises an :ref:`auditing event <auditing>` ``http.client.connect`` with arguments ``self``, ``host``, ``port``.
es_ar: Lanza un :ref:`evento de auditoría <auditing>` ``http.client.connect`` con los argumentos ``self``, ``host``, ``port``.

source: Close the connection to the server.
es_ar: Cierre la conexión al servidor.

source: Buffer size in bytes for sending a file-like message body.
es_ar: Tamaño del búfer en bytes para enviar un archivo como cuerpo del mensaje.

source: As an alternative to using the :meth:`request` method described above, you can also send your request step by step, by using the four functions below.
es_ar: Como alternativa al uso del método :meth:`request` descrito anteriormente, también puede enviar su solicitud paso a paso, utilizando las cuatro funciones a continuación.

source: This should be the first call after the connection to the server has been made. It sends a line to the server consisting of the *method* string, the *url* string, and the HTTP version (``HTTP/1.1``). To disable automatic sending of ``Host:`` or ``Accept-Encoding:`` headers (for example to accept additional content encodings), specify *skip_host* or *skip_accept_encoding* with non-False values.
es_ar: Esta debería ser la primera llamada después de que se haya realizado la conexión al servidor. Envía una línea al servidor que consta de la cadena de caracteres *method*, la cadena de caracteres *url* y la versión HTTP (``HTTP/1.1``). Para deshabilitar el envío automático de encabezados ``Host:`` o ``Accept-Encoding:`` (por ejemplo, para aceptar codificaciones de contenido adicionales), especifique *skip_host* o *skip_accept_encoding* con valores no Falsos.

source: Send an :rfc:`822`\ -style header to the server. It sends a line to the server consisting of the header, a colon and a space, and the first argument. If more arguments are given, continuation lines are sent, each consisting of a tab and an argument.
es_ar: Envía un encabezado de estilo :rfc:`822`\ al servidor. Este envía una línea al servidor que consta del encabezado, dos puntos y un espacio, y el primer argumento. Si se dan más argumentos, se envían líneas de continuación, cada una de las cuales consta de tabulación y un argumento.

source: Send a blank line to the server, signalling the end of the headers. The optional *message_body* argument can be used to pass a message body associated with the request.
es_ar: Envía una línea en blanco al servidor, señalando el final de los encabezados. El argumento opcional *message_body* se puede usar para pasar un cuerpo de mensaje asociado a la solicitud.

source: If *encode_chunked* is ``True``, the result of each iteration of *message_body* will be chunk-encoded as specified in :rfc:`7230`, Section 3.3.1. How the data is encoded is dependent on the type of *message_body*. If *message_body* implements the :ref:`buffer interface <bufferobjects>` the encoding will result in a single chunk. If *message_body* is a :class:`collections.abc.Iterable`, each iteration of *message_body* will result in a chunk. If *message_body* is a :term:`file object`, each call to ``.read()`` will result in a chunk. The method automatically signals the end of the chunk-encoded data immediately after *message_body*.
es_ar: Si *encode_chunked* es ``True``, el resultado de cada iteración de *message_body* se codificará en fragmentos como se especifica en :rfc:`7230`, Sección 3.3.1. La forma en que se codifican los datos depende del tipo de *message_body*. Si *message_body* implementa :ref:`buffer interface <bufferobjects>` la codificación dará como resultado un solo fragmento. Si *message_body* es una :class:`collections.abc.Iterable`, cada iteración de *message_body* dará como resultado un fragmento. Si *message_body* es un objeto :term:`file object`, cada llamada a ``.read()`` dará como resultado un fragmento. El método señala automáticamente el final de los datos codificados en fragmentos inmediatamente después de *message_body*.

source: Due to the chunked encoding specification, empty chunks yielded by an iterator body will be ignored by the chunk-encoder. This is to avoid premature termination of the read of the request by the target server due to malformed encoding.
es_ar: Debido a la especificación de codificación fragmentada, fragmentos vacíos producidos por un cuerpo iterador será ignorado por el codificador de fragmentos. Esto es para evitar la terminación prematura de la lectura de la solicitud por parte del servidor de destino debido a una codificación con formato incorrecto.

source: Chunked encoding support. The *encode_chunked* parameter was added.
es_ar: Soporte de codificación fragmentada. Se agregó el parámetro *encode_chunked*.

source: Send data to the server. This should be used directly only after the :meth:`endheaders` method has been called and before :meth:`getresponse` is called.
es_ar: Envía datos al servidor. Esto debe usarse directamente solo después de que se haya llamado al método :meth:`endheaders` y antes de que se llame al método :meth:`getresponse`.

source: Raises an :ref:`auditing event <auditing>` ``http.client.send`` with arguments ``self``, ``data``.
es_ar: Lanza un :ref:`evento de auditoría <auditing>` ``http.client.send`` con los argumentos ``self``, ``data``.

source: HTTPResponse Objects
es_ar: Objetos de ``HTTPResponse``
