Repository: python/python-docs-es
Catalog: library/http.server.po
Languages: es

source: :mod:`http.server` --- HTTP servers
es: :mod:`http.server` --- Servidores HTTP

source: **Source code:** :source:`Lib/http/server.py`
es: **Código fuente:** :source:`Lib/http/server.py`

source: This module defines classes for implementing HTTP servers.
es: Este módulo define clases para implementar servidores HTTP.

source: :mod:`http.server` is not recommended for production. It only implements :ref:`basic security checks <http.server-security>`.
es: :mod:`http.server` no se recomienda para producción. Sólo implementa :ref:`controles de seguridad básicos <http.server-security>`.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para obtener más información.

source: One class, :class:`HTTPServer`, is a :class:`socketserver.TCPServer` subclass. It creates and listens at the HTTP socket, dispatching the requests to a handler. Code to create and run the server looks like this::
es: Una clase, :class:`HTTPServer`, es una subclase :class:`socketserver.TCPServer`. Crea y escucha en el socket HTTP, enviando las peticiones a un handler. El código para crear y ejecutar el servidor se ve así::

source: This class builds on the :class:`~socketserver.TCPServer` class by storing the server address as instance variables named :attr:`server_name` and :attr:`server_port`. The server is accessible by the handler, typically through the handler's :attr:`server` instance variable.
es: Esta clase se basa en la clase :class:`~socketserver.TCPServer` almacenando la dirección del servidor como variables de instancia llamadas :attr:`nombre_del_servidor` y :attr:`puerto_del_servidor`. El servidor es accesible por el handler, típicamente a través de la variable de instancia :attr:`servidor` del handler.

source: This class is identical to HTTPServer but uses threads to handle requests by using the :class:`~socketserver.ThreadingMixIn`. This is useful to handle web browsers pre-opening sockets, on which :class:`HTTPServer` would wait indefinitely.
es: Esta clase es idéntica a HTTPServer, pero utiliza subprocesos para controlar las solicitudes mediante el uso de :class:`~socketserver.ThreadingMixIn`. Esto es útil para controlar los sockets de pre-apertura de los navegadores web, en los que :class:`HTTPServer` esperaría indefinidamente.

source: The :class:`HTTPServer` and :class:`ThreadingHTTPServer` must be given a *RequestHandlerClass* on instantiation, of which this module provides three different variants:
es: El :class:`HTTPServer` y :class:`ThreadingHTTPServer` deben recibir un *RequestHandlerClass* en la creación de instancias, de los cuales este módulo proporciona tres variantes diferentes:

source: This class is used to handle the HTTP requests that arrive at the server. By itself, it cannot respond to any actual HTTP requests; it must be subclassed to handle each request method (e.g. GET or POST). :class:`BaseHTTPRequestHandler` provides a number of class and instance variables, and methods for use by subclasses.
es: Esta clase se utiliza para controlar las solicitudes HTTP que llegan al servidor. Por sí mismo, no puede responder a ninguna solicitud HTTP real; debe ser subclase para manejar cada método de solicitud (por ejemplo, GET o POST). :class:`BaseHTTPRequestHandler` proporciona una serie de variables de clase e instancia, y métodos para su uso por subclases.

source: The handler will parse the request and the headers, then call a method specific to the request type. The method name is constructed from the request. For example, for the request method ``SPAM``, the :meth:`do_SPAM` method will be called with no arguments. All of the relevant information is stored in instance variables of the handler. Subclasses should not need to override or extend the :meth:`__init__` method.
es: El controlador analizará la solicitud y los encabezados y, a continuación, llamará a un método específico del tipo de solicitud. El nombre del método se construye a partir de la solicitud. Por ejemplo, para el método de solicitud ``SPAM``, se llamará al método :meth:`do_SPAM` sin argumentos. Toda la información relevante se almacena en variables de instancia del controlador. Las subclases no deben tener que reemplazar o extender el método :meth:`__init__`.

source: :class:`BaseHTTPRequestHandler` has the following instance variables:
es: :class:`BaseHTTPRequestHandler` tiene las siguientes variables de instancia:

source: Contains a tuple of the form ``(host, port)`` referring to the client's address.
es: Contiene una tupla con el formato ``(host, port)`` que hace referencia a la dirección del cliente.

source: Contains the server instance.
es: Contiene la instancia del servidor.

source: Boolean that should be set before :meth:`handle_one_request` returns, indicating if another request may be expected, or if the connection should be shut down.
es: Booleano que se debe establecer antes de :meth:`handle_one_request` retorna, que indica si se puede esperar otra solicitud o si la conexión debe cerrarse.

source: Contains the string representation of the HTTP request line. The terminating CRLF is stripped. This attribute should be set by :meth:`handle_one_request`. If no valid request line was processed, it should be set to the empty string.
es: Contiene la representación de cadena de la línea de solicitud HTTP. Se elimina el CRLF de terminación. Este atributo debe establecerse mediante :meth:`handle_one_request`. Si no se ha procesado ninguna línea de solicitud válida, debe establecerse en la cadena vacía.

source: Contains the command (request type). For example, ``'GET'``.
es: Contiene el comando (tipo de petición). Por ejemplo, ``'GET'``.

source: Contains the request path. If query component of the URL is present, then ``path`` includes the query. Using the terminology of :rfc:`3986`, ``path`` here includes ``hier-part`` and the ``query``.
es: Contiene la ruta de la solicitud. Si el componente de consulta de la URL está presente, ``path`` incluye la consulta. Usando la terminología de: rfc: `3986`, ``path`` aquí incluye ``hier-part`` y ``query``.

source: Contains the version string from the request. For example, ``'HTTP/1.0'``.
es: Contiene la versión de la cadena de caracteres para la petición. Por ejemplo, ``HTTP/1.0'``.

source: Holds an instance of the class specified by the :attr:`MessageClass` class variable. This instance parses and manages the headers in the HTTP request. The :func:`~http.client.parse_headers` function from :mod:`http.client` is used to parse the headers and it requires that the HTTP request provide a valid :rfc:`2822` style header.
es: Contiene una instancia de la clase especificada por la variable de clase :attr:`MessageClass`. Esta instancia analiza y gestiona las cabeceras de la petición HTTP. La función :func:`~http.client.parse_headers` de :mod:`http.client` se usa para parsear las cabeceras y requiere que la petición HTTP proporcione una cabecera válida de estilo :rfc:`2822`.

source: An :class:`io.BufferedIOBase` input stream, ready to read from the start of the optional input data.
es: Un flujo de entrada :class:`io.BufferedIOBase`, listo para leer desde el inicio de los datos de entrada opcionales.

source: Contains the output stream for writing a response back to the client. Proper adherence to the HTTP protocol must be used when writing to this stream in order to achieve successful interoperation with HTTP clients.
es: Contiene el flujo de salida para escribir una respuesta al cliente. Se debe utilizar la adherencia apropiada al protocolo HTTP cuando se escribe en este flujo para lograr una interoperación exitosa con los clientes HTTP.

source: This is an :class:`io.BufferedIOBase` stream.
es: Este es un flujo de :class:`io.BufferedIOBase`.

source: :class:`BaseHTTPRequestHandler` has the following attributes:
es: :class:`BaseHTTPRequestHandler` tiene los siguientes atributos:

source: Specifies the server software version. You may want to override this. The format is multiple whitespace-separated strings, where each string is of the form name[/version]. For example, ``'BaseHTTP/0.2'``.
es: Especifica la versión del software del servidor. Es posible que desee anular esto. El formato es de múltiples cadenas separadas por espacio en blanco, donde cada cadena es de la forma nombre[/versión]. Por ejemplo, ``BaseHTTP/0.2'``.

source: Contains the Python system version, in a form usable by the :attr:`version_string` method and the :attr:`server_version` class variable. For example, ``'Python/1.4'``.
es: Contiene la versión del sistema Python, en una forma utilizable por el método :attr:`version_string` y la variable de clase :attr:`server_version`. Por ejemplo, ``Python/1.4'``.

source: Specifies a format string that should be used by :meth:`send_error` method for building an error response to the client. The string is filled by default with variables from :attr:`responses` based on the status code that passed to :meth:`send_error`.
es: Especifica una cadena de formato que debe ser usada por el método :meth:`send_error` para construir una respuesta de error al cliente. La cadena se rellena por defecto con variables de :attr:`responses` basadas en el código de estado que pasó a :meth:`send_error`.

source: Specifies the Content-Type HTTP header of error responses sent to the client. The default value is ``'text/html'``.
es: Especifica el encabezado *HTTP Content-Type* de las respuestas de error enviadas al cliente. El valor predeterminado es ``'text/html'``.

source: Specifies the HTTP version to which the server is conformant. It is sent in responses to let the client know the server's communication capabilities for future requests. If set to ``'HTTP/1.1'``, the server will permit HTTP persistent connections; however, your server *must* then include an accurate ``Content-Length`` header (using :meth:`send_header`) in all of its responses to clients. For backwards compatibility, the setting defaults to ``'HTTP/1.0'``.
es: Especifica la versión de HTTP con la cual el servidor es conforme. Es enviada como respuesta para informarle al cliente sobre las capacidades de comunicación del servidor para siguientes peticiones. Si se establece en ``'HTTP/1.1'``, el servidor permitirá conexiones persistentes HTTP; sin embargo, el servidor *debe* incluir un encabezado exacto ``Content-Length`` (usando :meth:`send_header`) en todas sus respuestas a los clientes. Para la compatibilidad con versiones anteriores, el valor predeterminado es ``'HTTP/1.0'``.

source: Specifies an :class:`email.message.Message`\ -like class to parse HTTP headers. Typically, this is not overridden, and it defaults to :class:`http.client.HTTPMessage`.
es: Especifica una :class:`email.message.Message`\ -como clase para analizar los encabezados HTTP. Típicamente, esto no es anulado, y por defecto es :class:`http.client.HTTPMessage`.

source: This attribute contains a mapping of error code integers to two-element tuples containing a short and long message. For example, ``{code: (shortmessage, longmessage)}``. The *shortmessage* is usually used as the *message* key in an error response, and *longmessage* as the *explain* key. It is used by :meth:`send_response_only` and :meth:`send_error` methods.
es: Este atributo contiene una asignación de enteros de código de error a tuplas de dos elementos que contienen un mensaje corto y largo. Por ejemplo, ``{code (shortmessage, longmessage)}``. El *shortmessage* se utiliza normalmente como la clave *message* en una respuesta de error, y *longmessage* como la clave *explain*. Es utilizado por :meth:`send_response_only` y :meth:`send_error` métodos.

source: A :class:`BaseHTTPRequestHandler` instance has the following methods:
es: Una instancia :class:`BaseHTTPRequestHandler` tiene los siguientes métodos:

source: Calls :meth:`handle_one_request` once (or, if persistent connections are enabled, multiple times) to handle incoming HTTP requests. You should never need to override it; instead, implement appropriate :meth:`do_\*` methods.
es: Llama :meth:`handle_one_request` una vez (o, si las conexiones persistentes están habilitadas, varias veces) para manejar las peticiones HTTP entrantes. Nunca debería necesitar anularlo; en su lugar, implemente los métodos apropiados de :meth:`do_\*`.

source: This method will parse and dispatch the request to the appropriate :meth:`do_\*` method. You should never need to override it.
es: Este método analizará y enviará la solicitud al método apropiado :meth:`do_\*`. Nunca deberías necesitar anularlo.

source: When an HTTP/1.1 conformant server receives an ``Expect: 100-continue`` request header it responds back with a ``100 Continue`` followed by ``200 OK`` headers. This method can be overridden to raise an error if the server does not want the client to continue. For e.g. server can choose to send ``417 Expectation Failed`` as a response header and ``return False``.
es: Cuando un servidor compatible con HTTP/1.1 recibe un encabezado de solicitud ``Expect: 100-continue``, responde con un ``100 Continue`` seguido de encabezados ``200 OK``. Este método se puede anular para generar un error si el servidor no desea que el cliente continúe. Por ejemplo, el servidor puede optar por enviar ``417 Expectation Failed`` como encabezado de respuesta y ``return False``.

source: The error response includes a Content-Length header. Added the *explain* argument.
es: La respuesta de error incluye un encabezado de longitud de contenido. Añadido el argumento *explain*.

source: Adds a response header to the headers buffer and logs the accepted request. The HTTP response line is written to the internal buffer, followed by *Server* and *Date* headers. The values for these two headers are picked up from the :meth:`version_string` and :meth:`date_time_string` methods, respectively. If the server does not intend to send any other headers using the :meth:`send_header` method, then :meth:`send_response` should be followed by an :meth:`end_headers` call.
es: Agrega un encabezado de respuesta al búfer de encabezados y registra la solicitud aceptada. La línea de respuesta HTTP se escribe en el búfer interno, seguido de los encabezados *Server* y *Date*. Los valores de estos dos encabezados se recogen de los métodos :meth:`version_string` y :meth:`date_time_string`, respectivamente. Si el servidor no tiene la intención de enviar ningún otro encabezado utilizando el método :meth:`send_header`, entonces :meth:`send_response` debe ir seguido de una llamada :meth:`end_headers`.

source: Headers are stored to an internal buffer and :meth:`end_headers` needs to be called explicitly.
es: Los encabezados se almacenan en un búfer interno y :meth:`end_headers` debe llamarse explícitamente.

source: Adds the HTTP header to an internal buffer which will be written to the output stream when either :meth:`end_headers` or :meth:`flush_headers` is invoked. *keyword* should specify the header keyword, with *value* specifying its value. Note that, after the send_header calls are done, :meth:`end_headers` MUST BE called in order to complete the operation.
es: Agrega el encabezado HTTP a un búfer interno que se escribirá en la secuencia de salida cuando se invoca :meth:`end_headers` o :meth:`flush_headers`. *keyword* debe especificar la palabra clave *header*, con *value* especificando su valor. Tenga en cuenta que, después de que se realizan las llamadas *send_header*, :meth:`end_headers` DEBE llamarse para completar la operación.

source: Headers are stored in an internal buffer.
es: Los encabezados se almacenan en un búfer interno.

source: Sends the response header only, used for the purposes when ``100 Continue`` response is sent by the server to the client. The headers not buffered and sent directly the output stream.If the *message* is not specified, the HTTP message corresponding the response *code* is sent.
es: Envía el encabezado de respuesta solamente, usado para los propósitos cuando la respuesta ``100 Continue`` es enviada por el servidor al cliente. Los encabezados no se almacenan en el buffer y envían directamente el flujo de salida. Si no se especifica el *message*, se envía el mensaje HTTP correspondiente al *code* de respuesta.

source: Adds a blank line (indicating the end of the HTTP headers in the response) to the headers buffer and calls :meth:`flush_headers()`.
es: Añade una línea en blanco (indicando el final de las cabeceras HTTP en la respuesta) al buffer de cabeceras y llama a :meth:`flush_headers()`.

source: The buffered headers are written to the output stream.
es: Los encabezados del buffer se escriben en el flujo de salida.

source: Finally send the headers to the output stream and flush the internal headers buffer.
es: Finalmente envía los encabezados al flujo de salida y limpia el buffer interno de los cabezales.

source: Logs an accepted (successful) request. *code* should specify the numeric HTTP code associated with the response. If a size of the response is available, then it should be passed as the *size* parameter.
es: Registra una solicitud aceptada (exitosa). El *code* debe especificar el código numérico HTTP asociado a la respuesta. Si un tamaño de la respuesta está disponible, entonces debe ser pasado como el parámetro *size*.

source: Logs an error when a request cannot be fulfilled. By default, it passes the message to :meth:`log_message`, so it takes the same arguments (*format* and additional values).
es: Registra un error cuando una solicitud no puede ser cumplida. Por defecto, pasa el mensaje a :meth:`log_message`, por lo que toma los mismos argumentos (*format* y valores adicionales).

source: Logs an arbitrary message to ``sys.stderr``. This is typically overridden to create custom error logging mechanisms. The *format* argument is a standard printf-style format string, where the additional arguments to :meth:`log_message` are applied as inputs to the formatting. The client ip address and current date and time are prefixed to every message logged.
es: Registra un mensaje arbitrario en ``sys.stderr``. Normalmente se anula para crear mecanismos personalizados de registro de errores. El argumento *format* es una cadena de formato estándar de estilo de impresión, donde los argumentos adicionales a :meth:`log_message` se aplican como entradas al formato. La dirección ip del cliente y la fecha y hora actual son prefijadas a cada mensaje registrado.

source: Returns the server software's version string. This is a combination of the :attr:`server_version` and :attr:`sys_version` attributes.
es: Retorna la cadena de versiones del software del servidor. Esta es una combinación de los atributos :attr:`server_version` y :attr:`sys_version`.

source: Returns the date and time given by *timestamp* (which must be ``None`` or in the format returned by :func:`time.time`), formatted for a message header. If *timestamp* is omitted, it uses the current date and time.
es: Retorna la fecha y la hora dadas por *timestamp* (que debe ser ``None`` o en el formato retornado por :func:`time.time``), formateado para un encabezado de mensaje. Si se omite *timestamp*, utiliza la fecha y la hora actuales.

source: The result looks like ``'Sun, 06 Nov 1994 08:49:37 GMT'``.
es: El resultado se muestra como ``Sun, 06 Nov 1994 08:49:37 GMT'``.

source: Returns the current date and time, formatted for logging.
es: Retorna la fecha y la hora actuales, formateadas para el registro.

source: Returns the client address.
es: Retorna la dirección del cliente.

source: Previously, a name lookup was performed. To avoid name resolution delays, it now always returns the IP address.
es: Anteriormente, se realizó una búsqueda de nombres. Para evitar retrasos en la resolución del nombre, ahora siempre retorna la dirección IP.

source: This class serves files from the directory *directory* and below, or the current directory if *directory* is not provided, directly mapping the directory structure to HTTP requests.
es: Esta clase sirve archivos del directorio *directory* e inferior, o del directorio actual si no se proporciona *directory*, mapeando directamente la estructura del directorio a las solicitudes HTTP.

source: The *directory* parameter.
es: El parámetro *directory*.

source: The *directory* parameter accepts a :term:`path-like object`.
es: El parámetro *directory* acepta un :term:`path-like object`.

source: A lot of the work, such as parsing the request, is done by the base class :class:`BaseHTTPRequestHandler`. This class implements the :func:`do_GET` and :func:`do_HEAD` functions.
es: La carga de trabajo, como el análisis de la solicitud, lo hace la clase base :class:`BaseHTTPRequestHandler`. Esta clase implementa las funciones :func:`do_GET` y :func:`do_HEAD`.

source: The following are defined as class-level attributes of :class:`SimpleHTTPRequestHandler`:
es: Los siguientes se definen como atributos de clase de :class:`SimpleHTTPRequestHandler`:

source: This will be ``"SimpleHTTP/" + __version__``, where ``__version__`` is defined at the module level.
es: Esto sería ``"SimpleHTTP/" + __version__``, donde ``__version__`` se define a nivel de módulo.

source: A dictionary mapping suffixes into MIME types, contains custom overrides for the default system mappings. The mapping is used case-insensitively, and so should contain only lower-cased keys.
es: Un diccionario que asigna sufijos a tipos MIME contiene sobreescrituras personalizadas para las asignaciones predeterminadas del sistema. El mapeo se usa sin distinción entre mayúsculas y minúsculas, por lo que solo debe contener claves en minúsculas.

source: This dictionary is no longer filled with the default system mappings, but only contains overrides.
es: Este diccionario ya no contiene las asignaciones predeterminadas del sistema, sino que solo contiene anulaciones.

source: The :class:`SimpleHTTPRequestHandler` class defines the following methods:
es: Una instancia :class:`SimpleHTTPRequestHandler` tiene los siguientes métodos:

source: This method serves the ``'HEAD'`` request type: it sends the headers it would send for the equivalent ``GET`` request. See the :meth:`do_GET` method for a more complete explanation of the possible headers.
es: Este método sirve para el tipo de petición: ``'HEAD'`` envía los encabezados que enviaría para la petición equivalente ``GET``. Ver el método :meth:`do_GET` para una explicación más completa de los posibles encabezados.

source: The request is mapped to a local file by interpreting the request as a path relative to the current working directory.
es: La solicitud se asigna a un archivo local interpretando la solicitud como una ruta relativa al directorio de trabajo actual.

source: If the request was mapped to a directory, the directory is checked for a file named ``index.html`` or ``index.htm`` (in that order). If found, the file's contents are returned; otherwise a directory listing is generated by calling the :meth:`list_directory` method. This method uses :func:`os.listdir` to scan the directory, and returns a ``404`` error response if the :func:`~os.listdir` fails.
es: Si la solicitud fue mapeada a un directorio, el directorio se comprueba para un archivo llamado ``index.html`` or ``index.htm`` (en ese orden). Si se encuentra, se retorna el contenido del archivo; de lo contrario, se genera un listado del directorio llamando al método :meth:`list_directory`. Este método utiliza :func:`os.listdir` para escanear el directorio, y retorna una respuesta de error ``404`` si falla el :func:`~os.listdir`.
