Repository: python/python-docs-es
Catalog: library/http.client.po
Languages: es_ar

source: An :class:`HTTPResponse` instance wraps the HTTP response from the server. It provides access to the request headers and the entity body. The response is an iterable object and can be used in a with statement.
es_ar: Una instancia de :class:`HTTPResponse` envuelve la respuesta HTTP del servidor. Proporciona acceso a los encabezados de la solicitud y al cuerpo de la entidad. La respuesta es un objeto iterable y puede usarse en una declaración ``with``.

source: The :class:`io.BufferedIOBase` interface is now implemented and all of its reader operations are supported.
es_ar: La interfaz :class:`io.BufferedIOBase` ahora está implementada y todas sus operaciones de lectura están soportadas.

source: Reads and returns the response body, or up to the next *amt* bytes.
es_ar: Lee y retorna el cuerpo de respuesta, o hasta los siguientes bytes *amt*.

source: Reads up to the next len(b) bytes of the response body into the buffer *b*. Returns the number of bytes read.
es_ar: Lee hasta los siguientes bytes ``len(b)`` del cuerpo de respuesta en el búfer *b*. Retorna el número de bytes leídos.

source: Return the value of the header *name*, or *default* if there is no header matching *name*. If there is more than one header with the name *name*, return all of the values joined by ', '. If *default* is any iterable other than a single string, its elements are similarly returned joined by commas.
es_ar: Retorna el valor del encabezado *name*, o *default* si no hay un encabezado que coincida con *name*. Si hay más de un encabezado con el nombre *name*, retorne todos los valores unidos por ', '. Si 'default' es cualquier iterable que no sea una sola cadena de caracteres sus elementos se retornan, de manera similar, unidos por comas.

source: Return a list of (header, value) tuples.
es_ar: Retorna una lista de tuplas (encabezado, valor).

source: Return the ``fileno`` of the underlying socket.
es_ar: Retorna el ``fileno`` del socket implícito.

source: A :class:`http.client.HTTPMessage` instance containing the response headers. :class:`http.client.HTTPMessage` is a subclass of :class:`email.message.Message`.
es_ar: Una instancia :class:`http.client.HTTPMessage` que contiene los encabezados de respuesta. :class:`http.client.HTTPMessage` es una subclase de :class:`email.message.Message`.

source: HTTP protocol version used by server. 10 for HTTP/1.0, 11 for HTTP/1.1.
es_ar: Versión del protocolo HTTP utilizada por el servidor. 10 para HTTP/1.0, 11 para HTTP/1.1.

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
es_ar: URL del recurso recuperado, comúnmente utilizado para determinar si se siguió una redirección.

source: Headers of the response in the form of an :class:`email.message.EmailMessage` instance.
es_ar: Cabeceras de la respuesta en forma de una instancia :class:`email.message.EmailMessage`.

source: Status code returned by server.
es_ar: Código del estado retornado por el servidor.

source: Reason phrase returned by server.
es_ar: Una frase de la razón es retornada por el servidor.

source: A debugging hook. If :attr:`debuglevel` is greater than zero, messages will be printed to stdout as the response is read and parsed.
es_ar: Un depurador. Si :attr:`debuglevel` es mayor que cero, los mensajes se imprimirán en ``stdout`` a medida que se lee y analiza la respuesta.

source: Is ``True`` if the stream is closed.
es_ar: Es ``True`` si la transmisión está cerrada.

source: Deprecated in favor of :attr:`~HTTPResponse.url`.
es_ar: Deprecada a favor de :attr:`~HTTPResponse.url`.

source: Deprecated in favor of :attr:`~HTTPResponse.headers`.
es_ar: Deprecada a favor de :attr:`~HTTPResponse.headers`.

source: Deprecated in favor of :attr:`~HTTPResponse.status`.
es_ar: Deprecada a favor de :attr:`~HTTPResponse.status`.

source: Examples
es_ar: Ejemplos

source: Here is an example session that uses the ``GET`` method::
es_ar: Aquí hay una sesión de ejemplo que usa el método ``GET`` *method*::

source: Here is an example session that uses the ``HEAD`` method. Note that the ``HEAD`` method never returns any data. ::
es_ar: Aquí hay una sesión de ejemplo que usa el método ``HEAD``. Tenga en cuenta que el método ``HEAD`` nunca retorna ningún dato. ::

source: Here is an example session that uses the ``POST`` method::
es_ar: Aquí hay una sesión de ejemplo que usa el método ``POST``::

source: Client side HTTP ``PUT`` requests are very similar to ``POST`` requests. The difference lies only on the server side where HTTP servers will allow resources to be created via ``PUT`` requests. It should be noted that custom HTTP methods are also handled in :class:`urllib.request.Request` by setting the appropriate method attribute. Here is an example session that uses the ``PUT`` method::
es_ar: Las solicitudes HTTP ``PUT`` del lado del cliente son muy similares a las solicitudes ``POST``. La diferencia radica solo en el lado del servidor donde los servidores HTTP permitirán que se creen recursos a través de la solicitud ``PUT``. Cabe señalar que los métodos HTTP personalizados también se manejan en :class:`urllib.request.Request` configurando el atributo de método apropiado. Aquí hay una sesión de ejemplo que muestra cómo enviar una solicitud ``PUT``::

source: HTTPMessage Objects
es_ar: Objetos de ``HTTPMessage``

source: An :class:`http.client.HTTPMessage` instance holds the headers from an HTTP response. It is implemented using the :class:`email.message.Message` class.
es_ar: Una instancia de :class:`http.client.HTTPMessage` contiene los encabezados de una respuesta HTTP. Se implementa utilizando la clase :class:`email.message.Message`.
