Repository: python/python-docs-es
Catalog: library/http.server.po
Languages: es

source: If the request was mapped to a file, it is opened. Any :exc:`OSError` exception in opening the requested file is mapped to a ``404``, ``'File not found'`` error. If there was a ``'If-Modified-Since'`` header in the request, and the file was not modified after this time, a ``304``, ``'Not Modified'`` response is sent. Otherwise, the content type is guessed by calling the :meth:`guess_type` method, which in turn uses the *extensions_map* variable, and the file contents are returned.
es: Si la solicitud fue asignada a un archivo, se abre. Cualquier excepción :exc:`OSError` al abrir el archivo solicitado se asigna a un error ``404``, ``'File not found'``. Si había un encabezado ``'If-Modified-Since'`` en la solicitud, y el archivo no fue modificado después de este tiempo, se envía una respuesta ``304``, ``'Not Modified'``. De lo contrario, el tipo de contenido se adivina llamando al método :meth:`guess_type`, que a su vez utiliza la variable *extensions_map*, y se retorna el contenido del archivo.

source: A ``'Content-type:'`` header with the guessed content type is output, followed by a ``'Content-Length:'`` header with the file's size and a ``'Last-Modified:'`` header with the file's modification time.
es: Un encabezado de ``'Content-type:'`` con el tipo de contenido adivinado, seguido de un encabezado de ``'Content-Length:'`` con el tamaño del archivo y un encabezado de ``'Last-Modified:'`` con el tiempo de modificación del archivo.

source: Then follows a blank line signifying the end of the headers, and then the contents of the file are output. If the file's MIME type starts with ``text/`` the file is opened in text mode; otherwise binary mode is used.
es: Luego sigue una línea en blanco que significa el final de los encabezados, y luego se imprime el contenido del archivo. Si el tipo MIME del archivo comienza con ``text/`` el archivo se abre en modo de texto; en caso contrario se utiliza el modo binario.

source: For example usage, see the implementation of the ``test`` function in :source:`Lib/http/server.py`.
es: Por ejemplo, ver la implementación de la función ``test`` en :source:`Lib/http/server.py`.

source: Support of the ``'If-Modified-Since'`` header.
es: Soporta la cabecera ``'If-Modified-Since'``.

source: The :class:`SimpleHTTPRequestHandler` class can be used in the following manner in order to create a very basic webserver serving files relative to the current directory::
es: La clase :class:`SimpleHTTPRequestHandler` puede ser usada de la siguiente manera para crear un servidor web muy básico que sirva archivos relativos al directorio actual::

source: :mod:`http.server` can also be invoked directly using the :option:`-m` switch of the interpreter. Similar to the previous example, this serves files relative to the current directory::
es: :mod:`http.server` también puede ser invocado directamente usando la opción :option:`-m` del intérprete. Como en el ejemplo anterior, esto sirve a los archivos relativos al directorio actual::

source: The server listens to port 8000 by default. The default can be overridden by passing the desired port number as an argument::
es: Por defecto, el servidor escucha en el puerto 8000. El valor predeterminado se puede anular pasando el número de puerto deseado como argumento::

source: By default, the server binds itself to all interfaces. The option ``-b/--bind`` specifies a specific address to which it should bind. Both IPv4 and IPv6 addresses are supported. For example, the following command causes the server to bind to localhost only::
es: Por defecto, el servidor se vincula a todas las interfaces. La opción ``-b/--bind`` especifica una dirección específica a la que se vinculará. Tanto las direcciones IPv4 como las IPv6 están soportadas. Por ejemplo, el siguiente comando hace que el servidor se vincule sólo al localhost::

source: ``--bind`` argument was introduced.
es: Se introdujo el argumento ``--bind`` .

source: ``--bind`` argument enhanced to support IPv6
es: El argumento ``--bind`` se ha mejorado para soportar IPv6

source: By default, the server uses the current directory. The option ``-d/--directory`` specifies a directory to which it should serve the files. For example, the following command uses a specific directory::
es: Por defecto, el servidor utiliza el directorio actual. La opción ``-d/--directory`` especifica un directorio al que debe servir los archivos. Por ejemplo, el siguiente comando utiliza un directorio específico::

source: ``--directory`` argument was introduced.
es: Se introdujo el argumento ``—directory`` .

source: By default, the server is conformant to HTTP/1.0. The option ``-p/--protocol`` specifies the HTTP version to which the server is conformant. For example, the following command runs an HTTP/1.1 conformant server::
es: Por defecto, el servidor es conforme con HTTP/1.0. La opción ``-p/--protocol`` especifica la versión HTTP con la que cumple el servidor. Por ejemplo, el siguiente comando ejecuta un servidor conforme con HTTP/1.1::

source: ``--protocol`` argument was introduced.
es: Se introdujo el argumento ``—protocol`` .

source: This class is used to serve either files or output of CGI scripts from the current directory and below. Note that mapping HTTP hierarchic structure to local directory structure is exactly as in :class:`SimpleHTTPRequestHandler`.
es: Esta clase se utiliza para servir tanto a los archivos como a la salida de los scripts CGI del directorio actual y del siguiente. Note que el mapeo de la estructura jerárquica de HTTP a la estructura del directorio local es exactamente como en :class:`SimpleHTTPRequestHandler`.

source: CGI scripts run by the :class:`CGIHTTPRequestHandler` class cannot execute redirects (HTTP code 302), because code 200 (script output follows) is sent prior to execution of the CGI script. This pre-empts the status code.
es: Los scripts CGI ejecutados por la clase :class:`CGIHTTPRequestHandler` no pueden ejecutar redirecciones (código HTTP 302), porque el código 200 (la salida del script sigue) se envía antes de la ejecución del script CGI. Esto adelanta el código de estado.

source: The class will however, run the CGI script, instead of serving it as a file, if it guesses it to be a CGI script. Only directory-based CGI are used --- the other common server configuration is to treat special extensions as denoting CGI scripts.
es: La clase, sin embargo, ejecutará el script CGI, en lugar de servirlo como un archivo, si adivina que es un script CGI. Sólo se usan CGI basados en directorios --- la otra configuración común del servidor es tratar las extensiones especiales como denotando los scripts CGI.

source: The :func:`do_GET` and :func:`do_HEAD` functions are modified to run CGI scripts and serve the output, instead of serving files, if the request leads to somewhere below the ``cgi_directories`` path.
es: Las funciones :func:`do_GET` y :func:`do_HEAD` se modifican para ejecutar scripts CGI y servir la salida, en lugar de servir archivos, si la petición lleva a algún lugar por debajo de la ruta ``cgi_directories``.

source: The :class:`CGIHTTPRequestHandler` defines the following data member:
es: La :class:`CGIHTTPRequestHandler` define el siguiente miembro de datos:

source: This defaults to ``['/cgi-bin', '/htbin']`` and describes directories to treat as containing CGI scripts.
es: Esto por defecto es ``['/cgi-bin', '/htbin']`` y describe los directorios a tratar como si contuvieran scripts CGI.

source: The :class:`CGIHTTPRequestHandler` defines the following method:
es: La :class:`CGIHTTPRequestHandler` define el siguiente método:

source: This method serves the ``'POST'`` request type, only allowed for CGI scripts. Error 501, "Can only POST to CGI scripts", is output when trying to POST to a non-CGI url.
es: Este método sirve para el tipo de petición ``'POST'``, sólo permitido para scripts CGI. El error 501, "Can only POST to CGI scripts", se produce cuando se intenta enviar a una url no CGI.

source: Note that CGI scripts will be run with UID of user nobody, for security reasons. Problems with the CGI script will be translated to error 403.
es: Tenga en cuenta que los scripts CGI se ejecutarán con UID de usuario *nobody*, por razones de seguridad. Los problemas con el script CGI serán traducidos al error 403.

source: :class:`CGIHTTPRequestHandler` can be enabled in the command line by passing the ``--cgi`` option::
es: :class:`CGIHTTPRequestHandler` puede ser activado en la línea de comandos pasando la opción ``--cgi``::

source: Security Considerations
es: Consideraciones de seguridad

source: :class:`SimpleHTTPRequestHandler` will follow symbolic links when handling requests, this makes it possible for files outside of the specified directory to be served.
es: :class:`SimpleHTTPRequestHandler` seguirá los enlaces simbólicos cuando gestione peticiones, esto hace posible que se sirvan ficheros fuera del directorio especificado.
