Repository: python/python-docs-es
Catalog: library/idle.po
Languages: es

source: Access local Python documentation, if installed, or start a web browser and open docs.python.org showing the latest Python documentation.
es: Accede a la documentación local de Python, si está instalada, o inicia un navegador web y abre docs.python.org mostrando la última documentación de Python.

source: Turtle Demo
es: Demostración Turtle

source: Run the turtledemo module with example Python code and turtle drawings.
es: Ejecuta el módulo turtledemo con ejemplos de código Python y dibujos de tortugas.

source: Additional help sources may be added here with the Configure IDLE dialog under the General tab. See the :ref:`Help sources <help-sources>` subsection below for more on Help menu choices.
es: Se pueden agregar fuentes de ayuda adicionales aquí con el cuadro de diálogo Configurar IDLE en la pestaña General. Consultar la subsección :ref:`Fuentes de ayuda <help-sources>` a continuación para obtener más información sobre las opciones del menú Ayuda.

source: Context menus
es: Menús contextuales

source: Open a context menu by right-clicking in a window (Control-click on macOS). Context menus have the standard clipboard functions also on the Edit menu.
es: Se abre un menú contextual haciendo click derecho en una ventana (Control-click en macOS). Los menús contextuales tienen las funciones estándar del portapapeles también en el menú Editar.

source: Editor windows also have breakpoint functions. Lines with a breakpoint set are specially marked. Breakpoints only have an effect when running under the debugger. Breakpoints for a file are saved in the user's ``.idlerc`` directory.
es: Las ventanas del editor también tienen funciones de breakpoint. Las líneas con un conjunto de breakpoints están especialmente marcadas. Los breakpoints solo tienen efecto cuando se ejecutan bajo el depurador. Los breakpoints para un archivo se guardan en el directorio ``.idlerc`` del usuario.

source: Set Breakpoint
es: Establecer breakpoint

source: Set a breakpoint on the current line.
es: Establecer un breakpoint en la línea actual.

source: Clear Breakpoint
es: Eliminar breakpoint

source: Clear the breakpoint on that line.
es: Eliminar el breakpoint en esa línea.

source: Shell and Output windows also have the following.
es: Las ventanas de shell y de salida también tienen los siguientes elementos.

source: Go to file/line
es: Ir a archivo/línea

source: Same as in Debug menu.
es: Hace lo mismo que el menú depurar.

source: The Shell window also has an output squeezing facility explained in the *Python Shell window* subsection below.
es: La ventana de shell también tiene una función de *squeezing* de salida explicada en la subsección *ventana de shell de Python* a continuación.

source: Squeeze
es: Exprimir

source: If the cursor is over an output line, squeeze all the output between the code above and the prompt below down to a 'Squeezed text' label.
es: Si el cursor está sobre una línea de salida, comprime toda la salida entre el código de arriba y el mensaje de abajo hasta la etiqueta 'Texto *squeezed*'.

source: Editing and Navigation
es: Edición y navegación

source: Editor windows
es: Ventana del editor

source: IDLE may open editor windows when it starts, depending on settings and how you start IDLE. Thereafter, use the File menu. There can be only one open editor window for a given file.
es: IDLE puede abrir ventanas del editor cuando se inicia, dependiendo de la configuración y de cómo inicies el IDLE. A partir de ahí, usar el menú Archivo. Solo puede haber una ventana de editor abierta para un archivo determinado.

source: The title bar contains the name of the file, the full path, and the version of Python and IDLE running the window. The status bar contains the line number ('Ln') and column number ('Col'). Line numbers start with 1; column numbers with 0.
es: La barra de título contiene el nombre del archivo, la ruta completa y la versión de Python e IDLE que ejecuta la ventana. La barra de estado contiene el número de línea ('Ln') y el número de columna ('Col'). Los números de línea comienzan con 1; los números de columna con 0.

source: IDLE assumes that files with a known .py* extension contain Python code and that other files do not. Run Python code with the Run menu.
es: El IDLE supone que los archivos con una extensión .py* conocida contienen código Python y que los otros archivos no. Ejecuta el código Python con el menú Ejecutar.

source: Key bindings
es: Atajos de teclado

source: In this section, 'C' refers to the :kbd:`Control` key on Windows and Unix and the :kbd:`Command` key on macOS.
es: En esta sección, 'C' hace referencia a la tecla :kbd:`Control` en Windows y Unix y la tecla :kbd:`Command` en macOS.

source: :kbd:`Backspace` deletes to the left; :kbd:`Del` deletes to the right
es: :kbd:`Backspace` borra hacia la izquierda; :kbd:`Del` borra hacia la derecha

source: :kbd:`C-Backspace` delete word left; :kbd:`C-Del` delete word to the right
es: :kbd:`C-Backspace` borra la palabra a la izquierda; :kbd:`C-Del` borra la palabra a la derecha

source: Arrow keys and :kbd:`Page Up`/:kbd:`Page Down` to move around
es: Las teclas con flechas y :kbd:`Page Up`/:kbd:`Page Down` para moverse alrededor

source: :kbd:`C-LeftArrow` and :kbd:`C-RightArrow` moves by words
es: :kbd:`C-LeftArrow` y :kbd:`C-RightArrow` para moverse por palabras

source: :kbd:`Home`/:kbd:`End` go to begin/end of line
es: :kbd:`Home`/:kbd:`End` para ir al inicio/fin de la línea

source: :kbd:`C-Home`/:kbd:`C-End` go to begin/end of file
es: :kbd:`C-Home`/:kbd:`C-End` para ir al inicio/fin del archivo

source: Some useful Emacs bindings are inherited from Tcl/Tk:
es: Algunos atajos útiles de Emacs son heredados de Tcl / Tk:

source: :kbd:`C-a` beginning of line
es: :kbd:`C-a` al inicio de la línea

source: :kbd:`C-e` end of line
es: :kbd:`C-e` al final de la línea

source: :kbd:`C-k` kill line (but doesn't put it in clipboard)
es: :kbd:`C-k` corta la línea (pero no la pone en el portapapeles)

source: :kbd:`C-l` center window around the insertion point
es: :kbd:`C-l` centra la ventana alrededor del punto de inserción

source: :kbd:`C-b` go backward one character without deleting (usually you can also use the cursor key for this)
es: :kbd:`C-b` retrocede un carácter sin eliminarlo (generalmente también se puede usar la tecla de cursor para esto)

source: :kbd:`C-f` go forward one character without deleting (usually you can also use the cursor key for this)
es: :kbd:`C-f` avanza un carácter sin eliminarlo (generalmente también se puede usar la tecla de cursor para esto)

source: :kbd:`C-p` go up one line (usually you can also use the cursor key for this)
es: :kbd:`C-p` sube una línea (generalmente también se puede usar la tecla del cursor para esto)

source: :kbd:`C-d` delete next character
es: :kbd:`C-d` borra el siguiente carácter

source: Standard keybindings (like :kbd:`C-c` to copy and :kbd:`C-v` to paste) may work. Keybindings are selected in the Configure IDLE dialog.
es: Las combinaciones de teclas estándar (como :kbd:`C-c` para copiar y :kbd:`C-v` para pegar) pueden funcionar. Las combinaciones de teclas se seleccionan en el cuadro de diálogo Configurar IDLE.

source: Automatic indentation
es: Indentación automática

source: After a block-opening statement, the next line is indented by 4 spaces (in the Python Shell window by one tab). After certain keywords (break, return etc.) the next line is dedented. In leading indentation, :kbd:`Backspace` deletes up to 4 spaces if they are there. :kbd:`Tab` inserts spaces (in the Python Shell window one tab), number depends on Indent width. Currently, tabs are restricted to four spaces due to Tcl/Tk limitations.
es: Después de una declaración de apertura de bloque, la siguiente línea está indentada por 4 espacios (en la ventana del shell de Python por un tab). Después de ciertas palabras clave (saltar, retornar, etc.), la siguiente línea se deindenta. En la indentación principal, :kbd:`Backspace` elimina hasta 4 espacios si están allí. :kbd:`Tab` inserta espacios (en la ventana del shell de Python un tab), el número depende del tamaño de la indentación. Actualmente, los tabs están restringidos a cuatro espacios debido a las limitaciones de Tcl/Tk.

source: See also the indent/dedent region commands on the :ref:`Format menu <format-menu>`.
es: Consulte también los comandos de zona de indexación/deindentación en :ref:`Menú de formato <format-menu>`.

source: Search and Replace
es: Buscar y reemplazar

source: Any selection becomes a search target. However, only selections within a line work because searches are only performed within lines with the terminal newline removed. If ``[x] Regular expression`` is checked, the target is interpreted according to the Python re module.
es: Cualquier selección se convierte en un objetivo de búsqueda. Sin embargo, solo funcionan las selecciones dentro de una línea porque las búsquedas solo se realizan dentro de las líneas con la nueva línea de terminal eliminada. Si se marca la ``[x] Expresión regular``, el objetivo se interpreta de acuerdo al módulo `re` de Python.

source: Completions
es: Terminaciones

source: Completions are supplied, when requested and available, for module names, attributes of classes or functions, or filenames. Each request method displays a completion box with existing names. (See tab completions below for an exception.) For any box, change the name being completed and the item highlighted in the box by typing and deleting characters; by hitting :kbd:`Up`, :kbd:`Down`, :kbd:`PageUp`, :kbd:`PageDown`, :kbd:`Home`, and :kbd:`End` keys; and by a single click within the box. Close the box with :kbd:`Escape`, :kbd:`Enter`, and double :kbd:`Tab` keys or clicks outside the box. A double click within the box selects and closes.
es: Cuando se solicitan y están disponibles, se suministran complementos para los nombres de los módulos, los atributos de las clases o las funciones, o los nombres de los archivos. Cada método de solicitud muestra un cuadro para completar con los nombres existentes. (Para cualquier cuadro, cambie el nombre que se está completando y el elemento resaltado en el cuadro escribiendo y borrando caracteres; pulsando las teclas :kbd:`Up`, :kbd:`Down`, :kbd:`PageUp`, :kbd:`PageDown`, :kbd:`Home`, y :kbd:`End`; y con un solo clic dentro del cuadro. Cierra la caja con las teclas :kbd:`Escape`, :kbd:`Enter` y doble :kbd:`Tab` o con clics fuera de la caja. Un doble clic dentro de la caja selecciona y cierra.

source: One way to open a box is to type a key character and wait for a predefined interval. This defaults to 2 seconds; customize it in the settings dialog. (To prevent auto popups, set the delay to a large number of milliseconds, such as 100000000.) For imported module names or class or function attributes, type '.'. For filenames in the root directory, type :data:`os.sep` or :data:`os.altsep` immediately after an opening quote. (On Windows, one can specify a drive first.) Move into subdirectories by typing a directory name and a separator.
es: Una forma de abrir una caja es escribir un carácter clave y esperar un intervalo predefinido. Este intervalo es por defecto de 2 segundos; se puede modificar en el diálogo de configuración. (Para evitar las ventanas emergentes automáticas, establezca el retardo a un número grande de milisegundos, como 100000000). Para nombres de módulos importados o atributos de clases o funciones, escriba '.'. Para nombres de archivos en el directorio raíz, escriba :data:`os.sep` o :data:`os.altsep` inmediatamente después de una comilla de apertura. (En Windows, se puede especificar una unidad de disco primero.) Muévase a los subdirectorios escribiendo un nombre de directorio y un separador.

source: Instead of waiting, or after a box is closed, open a completion box immediately with Show Completions on the Edit menu. The default hot key is :kbd:`C-space`. If one types a prefix for the desired name before opening the box, the first match or near miss is made visible. The result is the same as if one enters a prefix after the box is displayed. Show Completions after a quote completes filenames in the current directory instead of a root directory.
es: En lugar de esperar, o después de cerrar una caja, abra una caja de finalización inmediatamente con Mostrar finalizaciones en el menú Edición. La tecla rápida por defecto es :kbd:`C-espacio`. Si se teclea un prefijo para el nombre deseado antes de abrir el cuadro, la primera coincidencia o casi coincidencia se hace visible. El resultado es el mismo que si se introduce un prefijo después de mostrar la caja. Mostrar las terminaciones después de una cita completa de los nombres de archivo en el directorio actual en lugar de un directorio raíz.

source: Hitting :kbd:`Tab` after a prefix usually has the same effect as Show Completions. (With no prefix, it indents.) However, if there is only one match to the prefix, that match is immediately added to the editor text without opening a box.
es: Pulsar :kbd:`Tab` después de un prefijo suele tener el mismo efecto que el de mostrar las terminaciones. (Sin prefijo, se indenta.) Sin embargo, si solo hay una coincidencia con el prefijo, esa coincidencia se añade inmediatamente al texto del editor sin abrir una caja.

source: Invoking 'Show Completions', or hitting :kbd:`Tab` after a prefix, outside of a string and without a preceding '.' opens a box with keywords, builtin names, and available module-level names.
es: Al invocar 'Mostrar las terminaciones', o al pulsar :kbd:`Tab` después de un prefijo, fuera de una cadena y sin un '.' precedente, se abre un cuadro con las palabras clave, los nombres incorporados y los nombres disponibles a nivel de módulo.

source: When editing code in an editor (as oppose to Shell), increase the available module-level names by running your code and not restarting the Shell thereafter. This is especially useful after adding imports at the top of a file. This also increases possible attribute completions.
es: Cuando se edita el código en un editor (a diferencia de Shell), aumentar los nombres disponibles a nivel de módulo mediante la ejecución de su código y no reiniciar el Shell después. Esto es especialmente útil después de añadir importaciones en la parte superior de un archivo. Esto también aumenta las posibles terminaciones de atributos.

source: Completion boxes initially exclude names beginning with '_' or, for modules, not included in '__all__'. The hidden names can be accessed by typing '_' after '.', either before or after the box is opened.
es: Los cuadros de excluyen inicialmente los valores que empiezan por '_' o, en el caso de los módulos, no incluidos en '__all__'. Se puede acceder a los nombres ocultos escribiendo '_' después de '.', ya sea antes o después de abrir la caja.

source: Calltips
es: Sugerencias de llamada

source: A calltip is shown automatically when one types :kbd:`(` after the name of an *accessible* function. A function name expression may include dots and subscripts. A calltip remains until it is clicked, the cursor is moved out of the argument area, or :kbd:`)` is typed. Whenever the cursor is in the argument part of a definition, select Edit and "Show Call Tip" on the menu or enter its shortcut to display a calltip.
es: Se muestra una sugerencia de llamada cuando se escribe :kbd:`(` después del nombre de una función *accesible*. Una expresión de nombre puede incluir puntos y subíndices. Una sugerencia permanece hasta que se hace click, el cursor se mueve fuera del área de argumento o es escrito :kbd:`)`. Cada vez que el cursor está en la parte del argumento de una definición, el menú o acceso directo muestra una sugerencia de llamada.

source: The calltip consists of the function's signature and docstring up to the latter's first blank line or the fifth non-blank line. (Some builtin functions lack an accessible signature.) A '/' or '*' in the signature indicates that the preceding or following arguments are passed by position or name (keyword) only. Details are subject to change.
es: La sugerencia de llamada consiste en la firma de la función y el docstring hasta la primera línea en blanco de este último o la quinta línea no en blanco. (Algunas funciones incorporadas carecen de una firma accesible.) Un '/' o '*' en la firma indica que los argumentos anteriores o posteriores se pasan solo por posición o por nombre (palabra clave). Los detalles están sujetos a cambios.

source: In Shell, the accessible functions depends on what modules have been imported into the user process, including those imported by Idle itself, and which definitions have been run, all since the last restart.
es: En Shell, las funciones accesibles dependen de los módulos que se hayan importado en el proceso del usuario, incluidos los importados por el propio Idle, y de las definiciones que se hayan ejecutado, todo ello desde el último reinicio.

source: For example, restart the Shell and enter ``itertools.count(``. A calltip appears because Idle imports itertools into the user process for its own use. (This could change.) Enter ``turtle.write(`` and nothing appears. Idle does not itself import turtle. The menu entry and shortcut also do nothing. Enter ``import turtle``. Thereafter, ``turtle.write(`` will display a calltip.
es: Por ejemplo, reinicie el Shell e ingrese ``itertools.count(``. Una sugerencia de llamada aparece porque el Idle importa itertools en el proceso del usuario para su propio uso. (Esto puede cambiar.) Al ingresar ``turtle.write(`` nada aparece. El Idle no importa turtle. El menú o el acceso directo tampoco hace nada. Al ingresar ``import turtle`` y luego ``turtle.write(`` funcionará.

source: In an editor, import statements have no effect until one runs the file. One might want to run a file after writing import statements, after adding function definitions, or after opening an existing file.
es: En un editor, las declaraciones de importación no tienen efecto hasta que se ejecuta el archivo. Es posible que desee ejecutar un archivo después de escribir las declaraciones de importación en la parte superior o ejecutar inmediatamente un archivo existente antes de editarlo.

source: Code Context
es: Contexto del código

source: Within an editor window containing Python code, code context can be toggled in order to show or hide a pane at the top of the window. When shown, this pane freezes the opening lines for block code, such as those beginning with ``class``, ``def``, or ``if`` keywords, that would have otherwise scrolled out of view. The size of the pane will be expanded and contracted as needed to show the all current levels of context, up to the maximum number of lines defined in the Configure IDLE dialog (which defaults to 15). If there are no current context lines and the feature is toggled on, a single blank line will display. Clicking on a line in the context pane will move that line to the top of the editor.
es: Dentro de una ventana del editor que contiene código Python, el contexto del código se puede alternar para mostrar u ocultar un panel en la parte superior de la ventana. Cuando se muestra, este panel congela las líneas de apertura por bloques de código, como aquellos que comienzan con las palabras clave ``class``, ``def``, o ``if``, que de otro modo se habrían desplazado fuera de la vista. El tamaño del panel se expandirá y contraerá según sea necesario para mostrar todos los niveles actuales de contexto, hasta el número máximo de líneas definidas en el cuadro de diálogo Configurar IDLE (que por defecto es 15). Si no hay líneas de contexto actuales y la función está activada, se visualizará una sola línea en blanco. Al hacer click en una línea en el panel de contexto, esa línea se moverá a la parte superior del editor.

source: The text and background colors for the context pane can be configured under the Highlights tab in the Configure IDLE dialog.
es: El texto y los colores de fondo para el panel de contexto se pueden configurar en la pestaña destacados en el cuadro de diálogo Configurar IDLE.

source: Shell window
es: Ventana de Shell

source: In IDLE's Shell, enter, edit, and recall complete statements. (Most consoles and terminals only work with a single physical line at a time).
es: Con el Shell del IDLE, se ingresa, edita y recupera declaraciones completas. (La mayoría de consolas y terminales solo funcionan con una sola línea física a la vez).

source: Submit a single-line statement for execution by hitting :kbd:`Return` with the cursor anywhere on the line. If a line is extended with Backslash (:kbd:`\\`), the cursor must be on the last physical line. Submit a multi-line compound statement by entering a blank line after the statement.
es: Envía una declaración de una sola línea para su ejecución al presionar :kbd:`Return` con el cursor en cualquier parte de la línea. Si una línea se extiende con una barra invertida (:kbd:`\\`), el cursor debe estar en la última línea física. Envía una declaración compuesta de varias líneas al ingresar una línea vacía después de la declaración.

source: When one pastes code into Shell, it is not compiled and possibly executed until one hits :kbd:`Return`, as specified above. One may edit pasted code first. If one pastes more than one statement into Shell, the result will be a :exc:`SyntaxError` when multiple statements are compiled as if they were one.
es: Cuando se pega código en el Shell, este no se compila y posiblemente se ejecuta hasta que se teclea :kbd:`Return`, como se especifica arriba. Se puede editar el código pegado primero. Si se pega más de una declaración en el Shell, el resultado será un :exc:`SyntaxError` cuando se compilan varias declaraciones como si fueran una sola.

source: Lines containing ``RESTART`` mean that the user execution process has been re-started. This occurs when the user execution process has crashed, when one requests a restart on the Shell menu, or when one runs code in an editor window.
es: Las líneas que contienen ``RESTART`` significan que el proceso de ejecución del usuario se ha reiniciado. Esto ocurre cuando falla el proceso de ejecución del usuario, solicita un reinicio en el menú del Shell o ejecuta código en una ventana del editor.

source: The editing features described in previous subsections work when entering code interactively. IDLE's Shell window also responds to the following keys.
es: Las funciones de edición descritas en subsecciones anteriores funcionan cuando se ingresa código de forma interactiva. La ventana de shell del IDLE también responde a las siguientes combinaciones de teclas.

source: :kbd:`C-c` interrupts executing command
es: :kbd:`C-c` interrumpe la ejecución del comando

source: :kbd:`C-d` sends end-of-file; closes window if typed at a ``>>>`` prompt
es: :kbd:`C-d` lo envía el final del archivo; la ventana se cierra si se escribe en un mensaje ``>>>``

source: :kbd:`Alt-/` (Expand word) is also useful to reduce typing
es: :kbd:`Alt-/` (Expandir palabra) también es útil para reducir la escritura

source: Command history
es: Historial de comandos

source: :kbd:`Alt-p` retrieves previous command matching what you have typed. On macOS use :kbd:`C-p`.
es: :kbd:`Alt-p` recupera el comando anterior que coincide con lo que ha escrito. En macOS use :kbd:`C-p`.

source: :kbd:`Alt-n` retrieves next. On macOS use :kbd:`C-n`.
es: :kbd:`Alt-n` recupera el siguiente. En macOS use :kbd:`C-n`.

source: :kbd:`Return` while the cursor is on any previous command retrieves that command
es: :kbd:`Return` mientras el cursor está en cualquier comando anterior recupera ese comando

source: Text colors
es: Colores del texto
