Repository: python/python-docs-es
Catalog: library/idle.po
Languages: es

source: **Source code:** :source:`Lib/idlelib/`
es: **Código fuente:** :source:`Lib/idlelib/`

source: IDLE is Python's Integrated Development and Learning Environment.
es: IDLE es el entorno de desarrollo integrado de Python.

source: IDLE has the following features:
es: IDLE tiene las siguientes características:

source: coded in 100% pure Python, using the :mod:`tkinter` GUI toolkit
es: escrito 100% en Python puro, usando el kit de herramientas GUI :mod:`tkinter`

source: cross-platform: works mostly the same on Windows, Unix, and macOS
es: multiplataforma: funciona en su mayoría igual en Windows, Unix y macOS

source: Python shell window (interactive interpreter) with colorizing of code input, output, and error messages
es: La ventana del shell de Python (interprete interactivo) con coloreado de código de entrada, salida y mensajes de error

source: multi-window text editor with multiple undo, Python colorizing, smart indent, call tips, auto completion, and other features
es: editor de texto multiventana con deshacer múltiple, coloreación Python, indentado inteligente, sugerencias de llamadas a funciones, autocompletado y otras características

source: search within any window, replace within editor windows, and search through multiple files (grep)
es: búsqueda dentro de cualquier ventana, reemplazo dentro de las ventanas del editor, y búsqueda a través de múltiples archivos (grep)

source: debugger with persistent breakpoints, stepping, and viewing of global and local namespaces
es: depurador con breakpoints persistentes, por pasos y visualización de espacios de nombres globales y locales

source: configuration, browsers, and other dialogs
es: configuración, navegadores y otros cuadros de diálogo

source: Menus
es: Menús

source: IDLE has two main window types, the Shell window and the Editor window. It is possible to have multiple editor windows simultaneously. On Windows and Linux, each has its own top menu. Each menu documented below indicates which window type it is associated with.
es: IDLE tiene dos tipos de ventana principales, la ventana del shell y la ventana del editor. Es posible tener múltiples ventanas de edición simultáneamente. En Windows y Linux, cada una tiene su propio menú principal. Cada menú documentado abajo indica con cuál tipo de ventana está asociada esta.

source: Output windows, such as used for Edit => Find in Files, are a subtype of editor window. They currently have the same top menu but a different default title and context menu.
es: Las ventanas de salida, como las que se usan para Editar => Encontrar en archivos, son un subtipo de la ventana de edición. Actualmente tienen el mismo menú principal pero un título predeterminado y un menú contextual diferente.

source: On macOS, there is one application menu. It dynamically changes according to the window currently selected. It has an IDLE menu, and some entries described below are moved around to conform to Apple guidelines.
es: En macOS, hay un menú de aplicación. Este cambia dinámicamente de acuerdo la ventana actualmente seleccionada. Tiene un menú IDLE y algunas de las entradas descritas a continuación se mueven de acuerdo con las pautas de Apple.

source: File menu (Shell and Editor)
es: Menú de archivo (Shell y Editor)

source: New File
es: Nuevo archivo

source: Create a new file editing window.
es: Crea una nueva ventana de edición de archivos.

source: Open...
es: Abrir...

source: Open an existing file with an Open dialog.
es: Abre un archivo existente con un cuadro de dialogo para abrir.

source: Open Module...
es: Abrir módulo...

source: Open an existing module (searches sys.path).
es: Abre un módulo existente (buscar en sys.path).

source: Recent Files
es: Archivos recientes

source: Open a list of recent files. Click one to open it.
es: Abre una lista de archivos recientes. Haga click en alguno para abrirlo.

source: Module Browser
es: Navegador de módulo

source: Show functions, classes, and methods in the current Editor file in a tree structure. In the shell, open a module first.
es: Muestra las funciones, clases y métodos en estructura de árbol en el archivo actual del Editor. En el shell, primero abra un módulo.

source: Path Browser
es: Navegador de ruta

source: Show sys.path directories, modules, functions, classes and methods in a tree structure.
es: Muestra directorios, módulos, funciones, clases y métodos de sys.path en una estructura de árbol.

source: Save
es: Guardar

source: Save the current window to the associated file, if there is one. Windows that have been changed since being opened or last saved have a \* before and after the window title. If there is no associated file, do Save As instead.
es: Guarda la ventana actual en el archivo asociado, si existe alguno. Las ventanas que han sido modificadas desde que se abrieron o se guardaron por última vez tienen un \* antes y después del título de la ventana. Si no hay un archivo asociado, ejecute Guardar como en su lugar.

source: Save As...
es: Guardar como...

source: Save the current window with a Save As dialog. The file saved becomes the new associated file for the window. (If your file namager is set to hide extensions, the current extension will be omitted in the file name box. If the new filename has no '.', '.py' and '.txt' will be added for Python and text files, except that on macOS Aqua,'.py' is added for all files.)
es: Guarda la ventana actual con el cuadro de diálogo Guardar como. El archivo guardado se convierte en un archivo nuevo asociado para la ventana. (Si su administrador de nombres está configurado para ocultar extensiones, la extensión actual se omitirá en el cuadro de nombre de archivo. Si el nombre de archivo nuevo no tiene '.', se agregarán '.py' y '.txt' para Python y los archivos de texto, excepto que en macOS Aqua se agregará '.py' para todos los archivos.)

source: Save Copy As...
es: Guardar copia como...

source: Save the current window to different file without changing the associated file. (See Save As note above about filename extensions.)
es: Guarda la ventana actual en un archivo diferente sin cambiar el archivo asociado. (Consultar la nota anterior Guardar como sobre las extensiones de nombre de archivo.)

source: Print Window
es: Imprimir ventana

source: Print the current window to the default printer.
es: Imprime la ventana actual en la impresora predeterminada.

source: Close Window
es: Cerrar ventana

source: Close the current window (if an unsaved editor, ask to save; if an unsaved Shell, ask to quit execution). Calling ``exit()`` or ``close()`` in the Shell window also closes Shell. If this is the only window, also exit IDLE.
es: Cierra la ventana actual (si es un editor no guardado, solicita guardar; si es un Shell no guardado, solicita salir de la ejecución). Llamar a ``exit()`` o ``close()`` en la ventana de Shell también cierra el Shell. Si esta es la única ventana, también sale del IDLE.

source: Exit IDLE
es: Salir del IDLE

source: Close all windows and quit IDLE (ask to save unsaved edit windows).
es: Cierra todas las ventanas y sale del IDLE (solicita guardar ventanas de edición no guardadas).

source: Edit menu (Shell and Editor)
es: Menú editar (Shell y Editor)

source: Undo
es: Deshacer

source: Undo the last change to the current window. A maximum of 1000 changes may be undone.
es: Deshace el último cambio a la ventana actual. Se puede deshacer un máximo de 1000 cambios.

source: Redo
es: Rehacer

source: Redo the last undone change to the current window.
es: Vuelve a aplicar el último cambio deshecho a la ventana actual.

source: Select All
es: Seleccionar todo

source: Select the entire contents of the current window.
es: Selecciona el contenido completo de la ventana actual.

source: Cut
es: Cortar

source: Copy selection into the system-wide clipboard; then delete the selection.
es: Copia la selección en el portapapeles global; después elimina la selección.

source: Copy
es: Copiar

source: Copy selection into the system-wide clipboard.
es: Copia la selección en el portapapeles global.

source: Paste
es: Pegar

source: Insert contents of the system-wide clipboard into the current window.
es: Inserta el contenido del portapapeles global en la ventana actual.

source: The clipboard functions are also available in context menus.
es: Las funciones del portapapeles también están disponibles en los menús contextuales.

source: Find...
es: Encontrar...

source: Open a search dialog with many options
es: Abre un cuadro de diálogo de búsqueda con muchas opciones

source: Find Again
es: Buscar de nuevo

source: Repeat the last search, if there is one.
es: Repite la última búsqueda, si hay alguna.

source: Find Selection
es: Encontrar selección

source: Search for the currently selected string, if there is one.
es: Busca la cadena de caracteres seleccionada actualmente, si hay alguna.

source: Find in Files...
es: Encontrar en Archivos...

source: Open a file search dialog. Put results in a new output window.
es: Abre un cuadro de diálogo de búsqueda de archivos. Presenta los resultados en una nueva ventana de salida.

source: Replace...
es: Reemplazar...

source: Open a search-and-replace dialog.
es: Abre un cuadro de diálogo de búsqueda y reemplazo.

source: Go to Line
es: Ir a la línea

source: Move the cursor to the beginning of the line requested and make that line visible. A request past the end of the file goes to the end. Clear any selection and update the line and column status.
es: Mueve el cursor al inicio de la línea solicitada y hace que esa línea sea visible. Una solicitud a partir del final del archivo lo lleva al final. Borra cualquier selección y actualiza el estado de la línea y la columna.

source: Show Completions
es: Mostrar complementos

source: Open a scrollable list allowing selection of existing names. See :ref:`Completions <completions>` in the Editing and navigation section below.
es: Abre una lista navegable que permite la selección de valores existentes. Consultar :ref:`Terminaciones <completions>` en la sección Edición y Navegación a continuación.

source: Expand Word
es: Expandir palabra

source: Expand a prefix you have typed to match a full word in the same window; repeat to get a different expansion.
es: Completa un prefijo que se ha escrito para que coincida con una palabra completa en la misma ventana; intente nuevamente para obtener un complemento diferente.

source: Show Call Tip
es: Mostrar sugerencias de llamada

source: After an unclosed parenthesis for a function, open a small window with function parameter hints. See :ref:`Calltips <calltips>` in the Editing and navigation section below.
es: Después de un paréntesis abierto para una función, abre una pequeña ventana con sugerencias sobre parámetros de función. Consultar :ref:`Sugerencias de llamada <calltips>` en la sección Edición y navegación a continuación.

source: Show Surrounding Parens
es: Mostrar los paréntesis alrededor

source: Highlight the surrounding parenthesis.
es: Resalta los paréntesis.

source: Format menu (Editor window only)
es: Menú de formato (solo ventana del Editor)

source: Format Paragraph
es: Formatear párrafo

source: Reformat the current blank-line-delimited paragraph in comment block or multiline string or selected line in a string. All lines in the paragraph will be formatted to less than N columns, where N defaults to 72.
es: Reformatea el párrafo actual delimitado por líneas en blanco en un bloque de comentarios o una cadena de caracteres multilínea o una línea seleccionada en una cadena de caracteres. Todas las líneas en el párrafo estarán formateadas con menos de N columnas, donde N por defecto es 72.

source: Indent Region
es: Zona de indentación

source: Shift selected lines right by the indent width (default 4 spaces).
es: Desplaza las líneas seleccionadas a la derecha en un nivel de indentación (por defecto 4 espacios).

source: Dedent Region
es: Zona de deindentación

source: Shift selected lines left by the indent width (default 4 spaces).
es: Desplaza las líneas seleccionadas hacia la izquierda en un nivel de indentación (por defecto 4 espacios).

source: Comment Out Region
es: Zona comentada

source: Insert ## in front of selected lines.
es: Inserta ## delante de las líneas seleccionadas.

source: Uncomment Region
es: Zona descomentada

source: Remove leading # or ## from selected lines.
es: Elimina los # o ## al inicio de las líneas seleccionadas.

source: Tabify Region
es: Zona tabulada

source: Turn *leading* stretches of spaces into tabs. (Note: We recommend using 4 space blocks to indent Python code.)
es: Transforma los tramos de espacios *iniciales* en tabs. (Nota: Recomendamos usar 4 bloques de espacio para indentar el código de Python).

source: Untabify Region
es: Zona destabulada

source: Turn *all* tabs into the correct number of spaces.
es: Transforma *todos* los tabs en el número correcto de espacios.

source: Toggle Tabs
es: Alternar tabs

source: Open a dialog to switch between indenting with spaces and tabs.
es: Abre un cuadro de diálogo para cambiar entre indentado con espacios y tabs.

source: New Indent Width
es: Nuevo tamaño de indentación

source: Open a dialog to change indent width. The accepted default by the Python community is 4 spaces.
es: Abre un cuadro de diálogo para cambiar el tamaño de indentación. El valor predeterminado aceptado por la comunidad de Python es de 4 espacios.

source: Strip Trailing Chitespace
es: Remover espacios en blanco al final

source: Remove trailing space and other whitespace characters after the last non-whitespace character of a line by applying str.rstrip to each line, including lines within multiline strings. Except for Shell windows, remove extra newlines at the end of the file.
es: Elimina el espacio final en la línea y otros caracteres de espacio en blanco después del último carácter que no sea un espacio en blanco aplicando str.rstrip a cada línea, incluyendo las líneas dentro de cadenas de caracteres multilíneas. Excepto para las ventanas de consola, elimina nuevas líneas adicionales al final del archivo.

source: Run menu (Editor window only)
es: Menú ejecutar (solo ventana Editor)

source: Run Module
es: Módulo ejecutar

source: Do :ref:`Check Module <check-module>`. If no error, restart the shell to clean the environment, then execute the module. Output is displayed in the Shell window. Note that output requires use of ``print`` or ``write``. When execution is complete, the Shell retains focus and displays a prompt. At this point, one may interactively explore the result of execution. This is similar to executing a file with ``python -i file`` at a command line.
es: Hace lo que dice en :ref:`Verificar módulo <check-module>`. Si no hay errores, reinicia el shell para limpiar el entorno, luego ejecuta el módulo. La salida es mostrada en la ventana de shell. Tener en cuenta que la visualización requiere el uso de ``print`` o ``write``. Cuando finaliza la ejecución, el shell permanece activo y muestra un mensaje. En este punto, se puede explorar interactivamente el resultado de la ejecución. Esto es similar a ejecutar un archivo con ``python -i file`` en una línea de comando.

source: Run... Customized
es: Ejecutar... Personalizado

source: Same as :ref:`Run Module <run-module>`, but run the module with customized settings. *Command Line Arguments* extend :data:`sys.argv` as if passed on a command line. The module can be run in the Shell without restarting.
es: Igual que :ref:`Módulo ejecutar <run-module>`, pero ejecuta el módulo con parámetros personalizados. *Los argumentos de la línea de comandos* extienden :data:`sys.argv` como si se pasaran por una línea de comando. El módulo se puede ejecutar en el shell sin reiniciar.

source: Check Module
es: Verificar módulo

source: Check the syntax of the module currently open in the Editor window. If the module has not been saved IDLE will either prompt the user to save or autosave, as selected in the General tab of the Idle Settings dialog. If there is a syntax error, the approximate location is indicated in the Editor window.
es: Comprueba la sintaxis del módulo actualmente abierto en la ventana de edición. Si el módulo no ha sido guardado IDLE solicitará al usuario que guarde o guarde automáticamente, como se seleccionó en la pestaña General del cuadro de diálogo Configuración de inactividad. Si hay algún error de sintaxis, la ubicación aproximada será indicada en la ventana del Editor.

source: Python Shell
es: Shell de Python

source: Open or wake up the Python Shell window.
es: Abrir o activar la ventana del shell de Python.

source: Shell menu (Shell window only)
es: Menú de shell (solo ventana de shell)

source: View Last Restart
es: Ver el último reinicio

source: Scroll the shell window to the last Shell restart.
es: Navega la ventana del shell hasta el último reinicio del mismo.

source: Restart Shell
es: Reiniciar shell

source: Restart the shell to clean the environment and reset display and exception handling.
es: Reinicia el shell para limpiar el entorno.

source: Previous History
es: Historial anterior

source: Cycle through earlier commands in history which match the current entry.
es: Recorre los comandos anteriores en el historial que coinciden con la entrada actual.

source: Next History
es: Historial siguiente

source: Cycle through later commands in history which match the current entry.
es: Recorre los comandos posteriores en el historial que coinciden con la entrada actual.

source: Interrupt Execution
es: Ejecución de interrupción

source: Stop a running program.
es: Detiene un programa en ejecución.

source: Debug menu (Shell window only)
es: Menú de depuración (solo ventana de shell)

source: Go to File/Line
es: Ir al Archivo/Línea

source: Look on the current line. with the cursor, and the line above for a filename and line number. If found, open the file if not already open, and show the line. Use this to view source lines referenced in an exception traceback and lines found by Find in Files. Also available in the context menu of the Shell window and Output windows.
es: Busca en la línea actual, con el cursor y la línea de arriba para un nombre de archivo y número de línea. Si lo encuentra, abre el archivo si aún no está abierto y muestra la línea. Usa esto para ver las líneas de origen referenciadas en un rastreo de excepción y las líneas encontradas por Buscar en archivos. También disponible en el menú contextual de la ventana del shell y las ventanas de salida.

source: Debugger (toggle)
es: Depurador (alternar)

source: When activated, code entered in the Shell or run from an Editor will run under the debugger. In the Editor, breakpoints can be set with the context menu. This feature is still incomplete and somewhat experimental.
es: Cuando esta función está habilitada, el código ingresado en el shell o ejecutado desde el editor se ejecutará con el depurador. En el editor, los breakpoints se pueden establecer con el menú contextual. Esta funcionalidad aún está incompleta y es en cierto modo experimental.

source: Stack Viewer
es: Visualizador de pila

source: Show the stack traceback of the last exception in a tree widget, with access to locals and globals.
es: Muestra el seguimiento de la pila de la última excepción en un complemento de árbol, con acceso a locales y globales.

source: Auto-open Stack Viewer
es: Auto-abrir visualizador de pila

source: Toggle automatically opening the stack viewer on an unhandled exception.
es: Activa/desactiva automáticamente el visualizador de pila en una excepción no controlada.

source: Options menu (Shell and Editor)
es: Menú de opciones (Shell y editor)

source: Configure IDLE
es: Configurar IDLE

source: Open a configuration dialog and change preferences for the following: fonts, indentation, keybindings, text color themes, startup windows and size, additional help sources, and extensions. On macOS, open the configuration dialog by selecting Preferences in the application menu. For more details, see :ref:`Setting preferences <preferences>` under Help and preferences.
es: Abre un cuadro de diálogo de configuración y cambia las preferencias por lo siguiente: fuentes, indentación, combinaciones de teclas, temas de color de texto, ventanas y tamaño de inicio, fuentes de ayuda adicionales y extensiones. En macOS, abre el cuadro de diálogo de configuración seleccionando Preferencias en el menú de la aplicación. Para obtener más detalles, consultar :ref:`Configurar preferencias <preferences>` en Ayuda y preferencias.

source: Most configuration options apply to all windows or all future windows. The option items below only apply to the active window.
es: La mayoría de los ajustes de configuración se aplican a todas las ventanas, abiertas o no. Los siguientes elementos de opción se aplican solo a la ventana activa.

source: Show/Hide Code Context (Editor Window only)
es: Mostrar/Ocultar el contexto del código (solo ventana del Editor)

source: Open a pane at the top of the edit window which shows the block context of the code which has scrolled above the top of the window. See :ref:`Code Context <code-context>` in the Editing and Navigation section below.
es: Abre un panel en la parte superior de la ventana de edición el cual muestra el contexto de bloque de código que se ha desplazado sobre la parte superior de la ventana. Consultar :ref:`Contexto de código <code-context>` en la sección Edición y Navegación a continuación.

source: Show/Hide Line Numbers (Editor Window only)
es: Mostrar/Ocultar números de línea (solo ventana del Editor)

source: Open a column to the left of the edit window which shows the number of each line of text. The default is off, which may be changed in the preferences (see :ref:`Setting preferences <preferences>`).
es: Abre una columna a la izquierda de la ventana de edición que muestra el número de cada línea de texto. El valor por defecto de esta característica es desactivado, este puede modificarse en las preferencias (consultar :ref:`Configuración de preferencias <preferences>`).

source: Zoom/Restore Height
es: Ampliar/Restaurar altura

source: Toggles the window between normal size and maximum height. The initial size defaults to 40 lines by 80 chars unless changed on the General tab of the Configure IDLE dialog. The maximum height for a screen is determined by momentarily maximizing a window the first time one is zoomed on the screen. Changing screen settings may invalidate the saved height. This toggle has no effect when a window is maximized.
es: Alterna la ventana entre el tamaño normal y la altura máxima. El tamaño inicial predeterminado es 40 líneas por 80 caracteres a menos que se cambie en la pestaña General del cuadro de diálogo Configurar IDLE. La altura máxima para una pantalla es determinada maximizando momentáneamente una ventana la primera vez que se acerca la pantalla. Cambiar la configuración de la pantalla puede invalidar la altura guardada. Este alternado no tiene efecto cuando se maximiza una ventana.

source: Window menu (Shell and Editor)
es: Menú de ventana (shell y editor)

source: Lists the names of all open windows; select one to bring it to the foreground (deiconifying it if necessary).
es: Enumera los nombres de todas las ventanas abiertas; seleccione uno para ponerlo en primer plano (deiconificándolo si es necesario).

source: Help menu (Shell and Editor)
es: Menú de ayuda (shell y editor)

source: About IDLE
es: Acerca de IDLE

source: Display version, copyright, license, credits, and more.
es: Muestra la versión, derechos de autor, licencia, créditos y más.

source: IDLE Help
es: Ayuda de IDLE

source: Display this IDLE document, detailing the menu options, basic editing and navigation, and other tips.
es: Muestra este documento IDLE, que detalla las opciones del menú, edición y navegación básica y otros consejos.

source: Python Docs
es: Documentación de Python
