Repository: python/python-docs-es
Catalog: library/idle.po
Languages: es

source: Idle defaults to black on white text, but colors text with special meanings. For the shell, these are shell output, shell error, user output, and user error. For Python code, at the shell prompt or in an editor, these are keywords, builtin class and function names, names following ``class`` and ``def``, strings, and comments. For any text window, these are the cursor (when present), found text (when possible), and selected text.
es: El idle por defecto es negro sobre texto blanco, pero colorea el texto con significados especiales. Para el shell, estos son: la salida del shell, error del shell, salida del usuario y error del usuario. Para el código Python, en el indicador de comandos de shell o en un editor, estos son: palabras clave, nombres de funciones y clases incorporadas, los siguientes nombres ``class`` and ``def``, cadenas de caracteres y comentarios. Para cualquier ventana de texto, estos son: el cursor (cuando está presente), el texto encontrado (cuando sea posible) y el texto seleccionado.

source: IDLE also highlights the :ref:`soft keywords <soft-keywords>` :keyword:`match`, :keyword:`case <match>`, and :keyword:`_ <wildcard-patterns>` in pattern-matching statements. However, this highlighting is not perfect and will be incorrect in some rare cases, including some ``_``-s in ``case`` patterns.
es: IDLE también resalta las :ref:`palabras claves ligeras <soft-keywords>` :keyword:`match`, :keyword:`case <match>`, y :keyword:`_ <wildcard-patterns>` en sentencias de patrones coincidentes. Sin embargo, este resaltado no es perfecto y será incorrecto en algunos raras ocasiones, incluyendo algunos ``_``-s en patrones ``case``.

source: Text coloring is done in the background, so uncolorized text is occasionally visible. To change the color scheme, use the Configure IDLE dialog Highlighting tab. The marking of debugger breakpoint lines in the editor and text in popups and dialogs is not user-configurable.
es: La coloración del texto se realiza en segundo plano, por lo que ocasionalmente se puede ver el texto sin colorear. Para cambiar la combinación de colores, use la pestaña Resaltar en el cuadro de diálogo Configurar IDLE. El marcado de líneas de breakpoint del depurador en el editor y el texto en ventanas emergentes y cuadros de diálogo no es configurable por el usuario.

source: Startup and Code Execution
es: Inicio y ejecución de código

source: Upon startup with the ``-s`` option, IDLE will execute the file referenced by the environment variables :envvar:`IDLESTARTUP` or :envvar:`PYTHONSTARTUP`. IDLE first checks for ``IDLESTARTUP``; if ``IDLESTARTUP`` is present the file referenced is run. If ``IDLESTARTUP`` is not present, IDLE checks for ``PYTHONSTARTUP``. Files referenced by these environment variables are convenient places to store functions that are used frequently from the IDLE shell, or for executing import statements to import common modules.
es: Al iniciar con la opción ``-s``, el IDLE ejecutará el archivo al que hacen referencia las variables de entorno :envvar:`IDLESTARTUP` o :envvar:`PYTHONSTARTUP`. El IDLE primero verifica ``IDLESTARTUP``; si ``IDLESTARTUP`` está presente, se ejecuta el archivo al que se hace referencia. Si ``IDLESTARTUP`` no está presente, IDLE verifica ``PYTHONSTARTUP``. Los archivos referenciados por estas variables de entorno son lugares convenientes para almacenar funciones que son usadas con frecuencia desde el shell del IDLE o para ejecutar declaraciones importadas para importar módulos comunes.

source: In addition, ``Tk`` also loads a startup file if it is present. Note that the Tk file is loaded unconditionally. This additional file is ``.Idle.py`` and is looked for in the user's home directory. Statements in this file will be executed in the Tk namespace, so this file is not useful for importing functions to be used from IDLE's Python shell.
es: Además, ``Tk`` también carga un archivo de inicio si este está presente. Tenga en cuenta que el archivo Tk se carga incondicionalmente. Este archivo adicional es ``.Idle.py`` y es buscado en el directorio de inicio del usuario. Las declaraciones en este archivo se ejecutarán en el espacio de nombres Tk, por lo que este archivo no es útil para importar funciones que se utilizarán desde el shell de Python del IDLE.

source: Command line usage
es: Uso de línea de comando

source: If there are arguments:
es: Si están los argumentos:

source: If ``-``, ``-c``, or ``r`` is used, all arguments are placed in ``sys.argv[1:...]`` and ``sys.argv[0]`` is set to ``''``, ``'-c'``, or ``'-r'``. No editor window is opened, even if that is the default set in the Options dialog.
es: Si se usa ``-``, ``-c`` o ``r``, todos los argumentos se colocan en ``sys.argv [1:...]`` y ``sys.argv[0]`` se establece en ``''``, ``'-c'`` o ``'-r'``. No se abre ninguna ventana del editor, incluso si ese es el conjunto predeterminado en el cuadro de diálogo opciones.

source: Otherwise, arguments are files opened for editing and ``sys.argv`` reflects the arguments passed to IDLE itself.
es: De lo contrario, los argumentos son archivos abiertos para edición y ``sys.argv`` refleja los argumentos pasados al IDLE.

source: Startup failure
es: Error de inicio

source: IDLE uses a socket to communicate between the IDLE GUI process and the user code execution process. A connection must be established whenever the Shell starts or restarts. (The latter is indicated by a divider line that says 'RESTART'). If the user process fails to connect to the GUI process, it usually displays a ``Tk`` error box with a 'cannot connect' message that directs the user here. It then exits.
es: El IDLE usa un socket para comunicarse entre el proceso del GUI de IDLE y el proceso de ejecución del código de usuario. Se debe establecer una conexión cada vez que el Shell se inicia o reinicia. (Esto último se indica mediante una línea divisoria que dice 'REINICIAR' (*RESTART*)). Si el proceso del usuario no se conecta al proceso de la GUI, muestra un cuadro de error ``Tk`` con un mensaje de 'no se puede conectar' que dirige al usuario aquí. Y después se detiene.

source: One specific connection failure on Unix systems results from misconfigured masquerading rules somewhere in a system's network setup. When IDLE is started from a terminal, one will see a message starting with ``** Invalid host:``. The valid value is ``127.0.0.1 (idlelib.rpc.LOCALHOST)``. One can diagnose with ``tcpconnect -irv 127.0.0.1 6543`` in one terminal window and ``tcplisten <same args>`` in another.
es: Una falla de conexión específica en sistemas Unix es el resultado de una mala configuración de las reglas de enmascarado en algún lugar de la configuración del sistema de red. Cuando el IDLE inicia desde la terminal, puede verse un mensaje que comienza con **``** Invalid host:``. The valid value is ``127.0.0.1 (idlelib.rpc.LOCALHOST)``**. Se puede diagnosticar con ``tcpconnect -irv 127.0.0.1 6543`` en una ventana de la terminal y ``tcplisten <same args>`` en otra.

source: A common cause of failure is a user-written file with the same name as a standard library module, such as *random.py* and *tkinter.py*. When such a file is located in the same directory as a file that is about to be run, IDLE cannot import the stdlib file. The current fix is to rename the user file.
es: Una causa común de falla se da cuando un archivo escrito por el usuario tiene el mismo nombre de un módulo de biblioteca estándar, como *random.py* y *tkinter.py*. Cuando dicho archivo se encuentra en el mismo directorio que un archivo que está por ejecutarse, el IDLE no puede importar el archivo stdlib. La solución actual es cambiar el nombre del archivo del usuario.

source: Though less common than in the past, an antivirus or firewall program may stop the connection. If the program cannot be taught to allow the connection, then it must be turned off for IDLE to work. It is safe to allow this internal connection because no data is visible on external ports. A similar problem is a network mis-configuration that blocks connections.
es: Aunque es menos común que en el pasado, un programa de antivirus o firewall puede detener la conexión. Si el programa no se puede configurar para permitir la conexión, debe estar apagado para que funcione el IDLE. Es seguro permitir esta conexión interna porque no hay datos visibles en puertos externos. Un problema similar es una configuración incorrecta de la red que bloquea las conexiones.

source: Python installation issues occasionally stop IDLE: multiple versions can clash, or a single installation might need admin access. If one undo the clash, or cannot or does not want to run as admin, it might be easiest to completely remove Python and start over.
es: Los problemas de instalación de Python ocasionalmente detienen el IDLE: puede darse un conflicto entre versiones o una sola instalación puede requerir privilegios de administrador. Si se soluciona el conflicto o no se puede o quiere ejecutar como administrador, puede ser más fácil desinstalar completamente Python y comenzar de nuevo.

source: A zombie pythonw.exe process could be a problem. On Windows, use Task Manager to check for one and stop it if there is. Sometimes a restart initiated by a program crash or Keyboard Interrupt (control-C) may fail to connect. Dismissing the error box or using Restart Shell on the Shell menu may fix a temporary problem.
es: Un proceso zombie pythonw.exe podría ser un problema. En Windows, use el Administrador de tareas para buscar uno y detenerlo si lo hay. A veces, un reinicio iniciado por un bloqueo del programa o una interrupción del teclado (control-C) puede fallar al conectarse. Descartar el cuadro de error o usar Reiniciar Shell en el menú del Shell puede solucionar un problema temporal.

source: When IDLE first starts, it attempts to read user configuration files in ``~/.idlerc/`` (~ is one's home directory). If there is a problem, an error message should be displayed. Leaving aside random disk glitches, this can be prevented by never editing the files by hand. Instead, use the configuration dialog, under Options. Once there is an error in a user configuration file, the best solution may be to delete it and start over with the settings dialog.
es: Cuando el IDLE se inicia por primera vez, intenta leer los archivos de configuración de usuario en ``~/.idlerc/`` (~ este es el directorio principal). Si hay un problema, se mostrará un mensaje de error. Dejando de lado los fallos aleatorios del disco, esto se puede evitar si nunca se editan los archivos a mano. En su lugar, utilice el cuadro de diálogo de configuración, en Opciones. Una vez que hay un error en un archivo de configuración de usuario, la mejor solución puede ser eliminarlo y empezar de nuevo con el cuadro de diálogo de configuración.

source: If IDLE quits with no message, and it was not started from a console, try starting it from a console or terminal (``python -m idlelib``) and see if this results in an error message.
es: Si el IDLE se cierra sin mensaje y este no fue iniciado desde una consola, intente iniciarlo desde una consola o terminal (``python -m idlelib``) y observe si esto genera un mensaje de error.

source: On Unix-based systems with tcl/tk older than ``8.6.11`` (see ``About IDLE``) certain characters of certain fonts can cause a tk failure with a message to the terminal. This can happen either if one starts IDLE to edit a file with such a character or later when entering such a character. If one cannot upgrade tcl/tk, then re-configure IDLE to use a font that works better.
es: En sistemas basados en Unix con tcl/tk más antiguos que ``8.6.11`` (ver ``About IDLE``) ciertos caracteres de ciertas fuentes pueden causar un fallo a tk con un mensaje hacia la terminal. Esto puede pasar cuando se inicia el IDLE para editar un archivo con dicho carácter o luego cuando se ingresa ese carácter. Si no se puede actualizar tcl/tk, entonces re configurar el IDLE para usar una fuente que funcione mejor.

source: Running user code
es: Ejecutando código del usuario

source: With rare exceptions, the result of executing Python code with IDLE is intended to be the same as executing the same code by the default method, directly with Python in a text-mode system console or terminal window. However, the different interface and operation occasionally affect visible results. For instance, ``sys.modules`` starts with more entries, and ``threading.active_count()`` returns 2 instead of 1.
es: Con raras excepciones, el resultado de ejecutar el código de Python con el IDLE se supone es el mismo que al ejecutar el mismo código por el método predeterminado, directamente con Python en una consola de sistema en modo de texto o una ventana de terminal. Sin embargo, las diferentes interfaces y operaciones ocasionalmente afectan los resultados visibles. Por ejemplo, ``sys.modules`` comienza con más entradas y ``threading.activeCount()`` retorna 2 en lugar de 1.

source: By default, IDLE runs user code in a separate OS process rather than in the user interface process that runs the shell and editor. In the execution process, it replaces ``sys.stdin``, ``sys.stdout``, and ``sys.stderr`` with objects that get input from and send output to the Shell window. The original values stored in ``sys.__stdin__``, ``sys.__stdout__``, and ``sys.__stderr__`` are not touched, but may be ``None``.
es: De forma predeterminada, el IDLE ejecuta el código de usuario en un proceso separado del sistema operativo en lugar de hacerlo en el proceso de la interfaz de usuario que ejecuta el shell y el editor. En el proceso de ejecución, este reemplaza ``sys.stdin``, ``sys.stdout``, y ``sys.stderr`` con objetos que recuperan las entradas desde y envían las salidas hacia la ventana de la consola. Los valores originales almacenados en ``sys.__stdin__``, ``sys.__stdout__``, y ``sys.__stderr__`` no se ven afectados, pero pueden ser ``None``.

source: Sending print output from one process to a text widget in another is slower than printing to a system terminal in the same process. This has the most effect when printing multiple arguments, as the string for each argument, each separator, the newline are sent separately. For development, this is usually not a problem, but if one wants to print faster in IDLE, format and join together everything one wants displayed together and then print a single string. Both format strings and :meth:`str.join` can help combine fields and lines.
es: El envío de la salida de impresión de un proceso a un widget de texto en otro es más lento que la impresión a un terminal del sistema en el mismo proceso. Esto tiene el mayor efecto cuando se imprimen múltiples argumentos, ya que la cadena de cada argumento, cada separador y la nueva línea se envían por separado. Para el desarrollo, esto no suele ser un problema, pero si uno quiere imprimir más rápido en IDLE, formatea y une todo lo que quiere mostrar junto y luego imprime una sola cadena. Tanto las cadenas de formato como :meth:`str.join` pueden ayudar a combinar campos y líneas.

source: IDLE's standard stream replacements are not inherited by subprocesses created in the execution process, whether directly by user code or by modules such as multiprocessing. If such subprocess use ``input`` from sys.stdin or ``print`` or ``write`` to sys.stdout or sys.stderr, IDLE should be started in a command line window. (On Windows, use ``python`` or ``py`` rather than ``pythonw`` or ``pyw``.) The secondary subprocess will then be attached to that window for input and output.
es: Las sustituciones de flujo estándar del IDLE no son heredadas por subprocesos creados en el proceso de ejecución, siendo directamente por código de usuario o por módulos como el multiprocesamiento. Si tal subproceso usa ``input`` desde sys.stdin o ``print`` o ``write`` hacia sys.stdout o sys.stderr, el IDLE debe ser iniciado en una ventana de línea de comando. (En Windows, utilice ``python`` o ``py`` en lugar de ``pythonw`` o ``pyw``.) El subproceso secundario será adjuntado a esa ventana para entrada y salida.

source: If ``sys`` is reset by user code, such as with ``importlib.reload(sys)``, IDLE's changes are lost and input from the keyboard and output to the screen will not work correctly.
es: Si ``sys`` es restablecido mediante un código de usuario, tal como ``importlib.reload(sys)``, los cambios del IDLE se perderán y la entrada del teclado y la salida de la pantalla no funcionarán correctamente.

source: When Shell has the focus, it controls the keyboard and screen. This is normally transparent, but functions that directly access the keyboard and screen will not work. These include system-specific functions that determine whether a key has been pressed and if so, which.
es: Cuando el shell está en primer plano, controla el teclado y la pantalla. Este es transparente normalmente, pero las funciones que acceden directamente al teclado y la pantalla no funcionarán. Estas incluyen funciones específicas del sistema que determinan si se ha presionado una tecla y de ser así, cuál.

source: The IDLE code running in the execution process adds frames to the call stack that would not be there otherwise. IDLE wraps ``sys.getrecursionlimit`` and ``sys.setrecursionlimit`` to reduce the effect of the additional stack frames.
es: La ejecución de código del IDLE en el proceso de ejecución agrega marcos a la pila de llamadas que de otro modo no estarían allí. el IDLE encapsula ``sys.getrecursionlimit`` y ``sys.setrecursionlimit`` para reducir el efecto de los marcos de pila adicionales.

source: When user code raises SystemExit either directly or by calling sys.exit, IDLE returns to a Shell prompt instead of exiting.
es: Cuando el código de usuario genera SystemExit directamente o llamando a sys.exit, el IDLE regresa al visualizador del Shell en lugar de salir.

source: User output in Shell
es: Salida del usuario en consola

source: When a program outputs text, the result is determined by the corresponding output device. When IDLE executes user code, ``sys.stdout`` and ``sys.stderr`` are connected to the display area of IDLE's Shell. Some of its features are inherited from the underlying Tk Text widget. Others are programmed additions. Where it matters, Shell is designed for development rather than production runs.
es: Cuando un programa muestra texto, el resultado está determinado por el dispositivo de salida correspondiente. Cuando el IDLE ejecuta el código de usuario ``sys.stdout`` y ``sys.stderr`` se conectan al área de visualización del Shell del IDLE. Algunas de estas características son heredadas de los widgets de texto Tk subyacentes. Otras son adiciones programadas. Donde es importante, el shell está diseñado para el desarrollo en lugar de la ejecución de producción.

source: For instance, Shell never throws away output. A program that sends unlimited output to Shell will eventually fill memory, resulting in a memory error. In contrast, some system text windows only keep the last n lines of output. A Windows console, for instance, keeps a user-settable 1 to 9999 lines, with 300 the default.
es: Por ejemplo, el Shell nunca elimina la salida. Un programa que envía salidas ilimitadas al Shell eventualmente llenará la memoria, lo que resultará en un error de memoria. Por el contrario, algunas ventanas de texto del sistema solo conservan las últimas n líneas de salida. Una consola de Windows, por ejemplo, mantiene una línea configurable por el usuario de 1 a 9999, con 300 por defecto.

source: A Tk Text widget, and hence IDLE's Shell, displays characters (codepoints) in the BMP (Basic Multilingual Plane) subset of Unicode. Which characters are displayed with a proper glyph and which with a replacement box depends on the operating system and installed fonts. Tab characters cause the following text to begin after the next tab stop. (They occur every 8 'characters'). Newline characters cause following text to appear on a new line. Other control characters are ignored or displayed as a space, box, or something else, depending on the operating system and font. (Moving the text cursor through such output with arrow keys may exhibit some surprising spacing behavior.) ::
es: Un widget de texto de Tk, y por lo tanto el Shell de IDLE, muestra caracteres (puntos de código) en el subconjunto BMP (plano multilingual básico) de Unicode. Aquellos caracteres que se muestran con un glifo adecuado y los cuales con una caja de reemplazo depende del sistema operativo y las fuentes instaladas. Los caracteres de tabulación hacen que el texto siguiente comience después de la siguiente tabulación. (Ocurre cada 8 'caracteres'). Los caracteres de nueva línea hacen que el texto siguiente aparezca en una nueva línea. Otros caracteres de control se omiten o se muestran como un espacio, cuadro u otra cosa, dependiendo del sistema operativo y la fuente. (Mover el cursor del texto a través de esa salida con las teclas de flecha puede mostrar algún comportamiento de espaciado sorpresivo.) ::

source: The ``repr`` function is used for interactive echo of expression values. It returns an altered version of the input string in which control codes, some BMP codepoints, and all non-BMP codepoints are replaced with escape codes. As demonstrated above, it allows one to identify the characters in a string, regardless of how they are displayed.
es: La función ``repr`` es usada para la visualización interactiva del valor de las expresiones. Esta retorna una versión modificada de la cadena de caracteres de entrada en la que los códigos de control, algunos puntos de código BMP y todos los puntos de código que no son BMP son reemplazados con caracteres de escape. Como se demostró anteriormente, esto permite identificar los caracteres en una cadena de caracteres, independientemente de cómo sean mostrados.

source: Normal and error output are generally kept separate (on separate lines) from code input and each other. They each get different highlight colors.
es: La salida normal y de error generalmente se mantienen separadas (en líneas separadas) de la entrada de código y entre sí. Cada una obtiene diferentes colores de resaltado.

source: For SyntaxError tracebacks, the normal '^' marking where the error was detected is replaced by coloring the text with an error highlight. When code run from a file causes other exceptions, one may right click on a traceback line to jump to the corresponding line in an IDLE editor. The file will be opened if necessary.
es: Para el *traceback* de SyntaxError, el marcado normal '^' dónde se detectó el error se reemplaza coloreando el texto con un resaltado de error. Cuando el código ejecutado desde un archivo causa otras excepciones, se puede hacer click derecho en un *traceback* para saltar a la línea correspondiente en un editor del IDLE. El archivo se abrirá si es necesario.

source: Shell has a special facility for squeezing output lines down to a 'Squeezed text' label. This is done automatically for output over N lines (N = 50 by default). N can be changed in the PyShell section of the General page of the Settings dialog. Output with fewer lines can be squeezed by right clicking on the output. This can be useful lines long enough to slow down scrolling.
es: El Shell tiene una funcionalidad especial para exprimir las líneas de salida hasta una etiqueta de 'Texto *Squeezed*'. Esto se hace automáticamente para una salida sobre N líneas (N = 50 por defecto). N se puede cambiar en la sección PyShell de la página General del cuadro de diálogo Configuración. La salida con menos líneas puede ser *squeezed* haciendo click derecho en la salida. Esto puede ser útil en líneas suficientemente largas para bajar el tiempo de desplazamiento.
