Repository: python/python-docs-es
Catalog: library/imghdr.po
Languages: es

source: :mod:`imghdr` --- Determine the type of an image
es: :mod:`imghdr` --- Determinar el tipo de imagen

source: **Source code:** :source:`Lib/imghdr.py`
es: **Código fuente:** :source:`Lib/imghdr.py`

source: The :mod:`imghdr` module is deprecated (see :pep:`PEP 594 <594#imghdr>` for details and alternatives).
es: El módulo :mod:`imghdr` está obsoleto (ver :pep:`PEP 594 <594#imghdr>` para detalles y alternativas).

source: The :mod:`imghdr` module determines the type of image contained in a file or byte stream.
es: El módulo :mod:`imghdr` determina el tipo de imagen contenida en un archivo o secuencia de bytes.

source: The :mod:`imghdr` module defines the following function:
es: El módulo :mod:`imghdr` define la siguiente función:

source: Test the image data contained in the file named *file* and return a string describing the image type. If *h* is provided, the *file* argument is ignored and *h* is assumed to contain the byte stream to test.
es: Prueba los datos de imagen contenidos en el archivo nombrado por *file* y retorna una cadena que describe el tipo de imagen. Si se proporciona *h*, se ignora el argumento *file* y se supone que *h* contiene el flujo de bytes para probar.

source: Accepts a :term:`path-like object`.
es: Acepta un :term:`path-like object`.

source: The following image types are recognized, as listed below with the return value from :func:`what`:
es: Se reconocen los siguientes tipos de imagen, enumerados a continuación con el valor devuelto de :func:`what`:

source: Value
es: Valor

source: Image format
es: Formato de imagen

source: SGI ImgLib Files
es: Archivos SGI ImgLib

source: GIF 87a and 89a Files
es: Archivos GIF 87a y 89a

source: Portable Bitmap Files
es: Archivos Portable Bitmap

source: Portable Graymap Files
es: Archivos Portable Graymap

source: Portable Pixmap Files
es: Archivos Portable Pixmap

source: TIFF Files
es: Archivos TIFF

source: Sun Raster Files
es: Archivos Sun Raster

source: X Bitmap Files
es: Archivos X Bitmap

source: JPEG data in JFIF or Exif formats
es: Datos JPEG en formatos JFIF o Exif

source: BMP files
es: Archivos BMP

source: WebP files
es: Archivos WebP

source: OpenEXR Files
es: Archivos OpenEXR

source: The *exr* and *webp* formats were added.
es: Se añadieron los formatos *exr* y *webp*.

source: You can extend the list of file types :mod:`imghdr` can recognize by appending to this variable:
es: Puede ampliar la lista de tipos de archivo que :mod:`imghdr` puede reconocer agregándolos a esta variable:

source: A list of functions performing the individual tests. Each function takes two arguments: the byte-stream and an open file-like object. When :func:`what` is called with a byte-stream, the file-like object will be ``None``.
es: Una lista de funciones que realizan las comprobaciones individuales. Cada función toma dos argumentos: la secuencia de bytes y un objeto abierto de tipo archivo. Cuando :func:`what` es llamada con una secuencia de bytes, el objeto de tipo archivo será ``None``.

source: The test function should return a string describing the image type if the test succeeded, or ``None`` if it failed.
es: La función de comprobación debería retornar una cadena de caracteres que describa el tipo de imagen si la comprobación se realizó correctamente o ''Ninguno'' si ha fallado.

source: Example::
es: Ejemplo::
