Repository: python/python-docs-es
Catalog: library/imp.po
Languages: es_ar

source: :mod:`imp` --- Access the :ref:`import <importsystem>` internals
es_ar: :mod:`imp` --- Acceda a :ref:`import <importsystem>`internamente

source: **Source code:** :source:`Lib/imp.py`
es_ar: **Código fuente:** :source:`Lib/imp.py`

source: The :mod:`imp` package is pending deprecation in favor of :mod:`importlib`.
es_ar: El paquete :mod:`imp` está pendiente de desuso en favor de :mod:`importlib`.

source: This module provides an interface to the mechanisms used to implement the :keyword:`import` statement. It defines the following constants and functions:
es_ar: Este módulo proporciona una interfaz a los mecanismos utilizados para implementar la sentencia :keyword:`import`. Define las siguientes constantes y funciones:

source: Return the magic string value used to recognize byte-compiled code files (:file:`.pyc` files). (This value may be different for each Python version.)
es_ar: Devuelve el valor de cadena mágica utilizado para reconocer archivos de código compilados por bytes (:file:'.pyc' archivos). (Este valor puede ser diferente para cada versión de Python.)

source: Use :attr:`importlib.util.MAGIC_NUMBER` instead.
es_ar: Utilice :attr:`importlib.util.MAGIC_NUMBER` en su lugar.

source: Return a list of 3-element tuples, each describing a particular type of module. Each triple has the form ``(suffix, mode, type)``, where *suffix* is a string to be appended to the module name to form the filename to search for, *mode* is the mode string to pass to the built-in :func:`open` function to open the file (this can be ``'r'`` for text files or ``'rb'`` for binary files), and *type* is the file type, which has one of the values :const:`PY_SOURCE`, :const:`PY_COMPILED`, or :const:`C_EXTENSION`, described below.
es_ar: Devuelve una lista de tuplas de 3 elementos, cada una de las que describe un tipo determinado de módulo. Cada triple tiene la forma ``(suffix, mode, type)``, donde *suffix* es una cadena que se anexará al nombre del módulo para formar el nombre de archivo para buscar, *mode* es la cadena de modo para pasar a la función incorporada :func:`open` para abrir el archivo (esto puede ser ``'r'`` para archivos de texto o ``'rb'`` para archivos binarios), y *type* , que tiene uno de los valores :const:`PY_SOURCE`, :const:`PY_COMPILED`, o :const:`C_EXTENSION`, que se describe a continuación.

source: Use the constants defined on :mod:`importlib.machinery` instead.
es_ar: Utilice las constantes definidas en :mod:`importlib.machinery` en su lugar.

source: Try to find the module *name*. If *path* is omitted or ``None``, the list of directory names given by ``sys.path`` is searched, but first a few special places are searched: the function tries to find a built-in module with the given name (:const:`C_BUILTIN`), then a frozen module (:const:`PY_FROZEN`), and on some systems some other places are looked in as well (on Windows, it looks in the registry which may point to a specific file).
es_ar: Intente encontrar el módulo *name*. Si se omite *path* o ``None``, se busca la lista de nombres de directorio dados por ``sys.path``, pero primero se buscan algunos lugares especiales: la función intenta encontrar un módulo integrado con el nombre dado (:const:`C_BUILTIN`), a continuación, un módulo congelado (:const:`PY_FROZEN`), y en algunos sistemas algunos otros lugares se buscan también (en Windows, se ve en el registro que puede apuntar a un archivo específico).

source: Otherwise, *path* must be a list of directory names; each directory is searched for files with any of the suffixes returned by :func:`get_suffixes` above. Invalid names in the list are silently ignored (but all list items must be strings).
es_ar: De lo contrario, *path* debe ser una lista de nombres de directorio; cada directorio se busca archivos con cualquiera de los sufijos devueltos por :func:`get_suffixes` arriba. Los nombres no válidos de la lista se omiten silenciosamente (pero todos los elementos de lista deben ser cadenas).

source: If search is successful, the return value is a 3-element tuple ``(file, pathname, description)``:
es_ar: Si la búsqueda se realiza correctamente, el valor devuelto es una tupla de 3 elementos ``(file, pathname, description)``:

source: *file* is an open :term:`file object` positioned at the beginning, *pathname* is the pathname of the file found, and *description* is a 3-element tuple as contained in the list returned by :func:`get_suffixes` describing the kind of module found.
es_ar: *file* es un abierto :term:`file object` posicionado al principio, *pathname* es el nombre de ruta del archivo encontrado, y *description* es una tupla de 3 elementos tal como se encuentra en la lista devuelta por :func:`get_suffixes` que describe el tipo de módulo encontrado.

source: If the module is built-in or frozen then *file* and *pathname* are both ``None`` and the *description* tuple contains empty strings for its suffix and mode; the module type is indicated as given in parentheses above. If the search is unsuccessful, :exc:`ImportError` is raised. Other exceptions indicate problems with the arguments or environment.
es_ar: Si el módulo no vive en un archivo, el archivo *file* devuelto es ``None``, *pathname* es la cadena vacía y la tupla *description* contiene cadenas vacías para su sufijo y modo; el tipo de módulo se indica como se indica entre paréntesis arriba. Si la búsqueda no se realiza correctamente, se provoca :exc:`ImportError`. Otras excepciones indican problemas con los argumentos o el entorno.

source: If the module is a package, *file* is ``None``, *pathname* is the package path and the last item in the *description* tuple is :const:`PKG_DIRECTORY`.
es_ar: Si el módulo es un paquete, *file* es ``None``, *pathname* es la ruta de acceso del paquete y el último elemento de la tupla *description* es :const:`PKG_DIRECTORY`.

source: This function does not handle hierarchical module names (names containing dots). In order to find *P.M*, that is, submodule *M* of package *P*, use :func:`find_module` and :func:`load_module` to find and load package *P*, and then use :func:`find_module` with the *path* argument set to ``P.__path__``. When *P* itself has a dotted name, apply this recipe recursively.
es_ar: Esta función no controla los nombres de módulo jerárquico (nombres que contienen puntos). Para encontrar *P.M*, es decir, submódulo *M* del paquete *P*, use :func:`find_module` y :func:`load_module` para buscar y cargar el paquete *P*, y luego use :func:`find_module` con el argumento *path* establecido en ``P.__path__``. Cuando *P* tenga un nombre punteado, aplique esta receta de forma recursiva.

source: Use :func:`importlib.util.find_spec` instead unless Python 3.3 compatibility is required, in which case use :func:`importlib.find_loader`. For example usage of the former case, see the :ref:`importlib-examples` section of the :mod:`importlib` documentation.
es_ar: Utilice :func:`importlib.util.find_spec` en su lugar a menos que se requiera compatibilidad con Python 3.3, en cuyo caso use :func:`importlib.find_loader`. Para ver el uso del caso anterior, consulte la sección :ref:`importlib-examples` de la documentación :mod:`importlib`.

source: Load a module that was previously found by :func:`find_module` (or by an otherwise conducted search yielding compatible results). This function does more than importing the module: if the module was already imported, it will reload the module! The *name* argument indicates the full module name (including the package name, if this is a submodule of a package). The *file* argument is an open file, and *pathname* is the corresponding file name; these can be ``None`` and ``''``, respectively, when the module is a package or not being loaded from a file. The *description* argument is a tuple, as would be returned by :func:`get_suffixes`, describing what kind of module must be loaded.
es_ar: Cargue un módulo que fue encontrado anteriormente por :func:`find_module` (o por una búsqueda realizada de otro modo que produce resultados compatibles). Esta función hace más que importar el módulo: si el módulo ya estaba importado, se recargará el módulo! El argumento *name* indica el nombre completo del módulo (incluido el nombre del paquete, si se trata de un submódulo de un paquete). El argumento *file* es un archivo abierto y *pathname* es el nombre de archivo correspondiente; pueden ser ``None`` y ``''``, respectivamente, cuando el módulo es un paquete o no se carga desde un archivo. El argumento *description* es una tupla, como sería devuelta por :func:`get_suffixes`, que describe qué tipo de módulo se debe cargar.

source: If the load is successful, the return value is the module object; otherwise, an exception (usually :exc:`ImportError`) is raised.
es_ar: Si la carga se realiza correctamente, el valor devuelto es el objeto modulo; de lo contrario, se produce una excepción (normalmente :exc:`ImportError`).

source: **Important:** the caller is responsible for closing the *file* argument, if it was not ``None``, even when an exception is raised. This is best done using a :keyword:`try` ... :keyword:`finally` statement.
es_ar: **Importante:** el autor de la llamada es responsable de cerrar el argumento *file*, si no era ``None``, incluso cuando se genera una excepción. Esto se hace mejor usando una declaración :keyword:`try` ... :keyword:`finally`.

source: If previously used in conjunction with :func:`imp.find_module` then consider using :func:`importlib.import_module`, otherwise use the loader returned by the replacement you chose for :func:`imp.find_module`. If you called :func:`imp.load_module` and related functions directly with file path arguments then use a combination of :func:`importlib.util.spec_from_file_location` and :func:`importlib.util.module_from_spec`. See the :ref:`importlib-examples` section of the :mod:`importlib` documentation for details of the various approaches.
es_ar: Si se utiliza anteriormente junto con :func:`imp.find_module` considere usar :func:`importlib.import_module`, de lo contrario utilice el cargador devuelto por el reemplazo que eligió para :func:`imp.find_module`. Si llamó a :func:`imp.load_module` y funciones relacionadas directamente con argumentos de ruta de archivo, utilice una combinación de :func:`importlib.util.spec_from_file_location` y :func:`importlib.util.module_from_spec`. Consulte la sección :ref:`importlib-examples` de la documentación :mod:`importlib` para obtener más información sobre los distintos enfoques.

source: Return a new empty module object called *name*. This object is *not* inserted in ``sys.modules``.
es_ar: Devuelve un nuevo objeto de módulo vacío denominado *name*. Este objeto es *not* insertado en ``sys.modules``.

source: Use :func:`importlib.util.module_from_spec` instead.
es_ar: Utilice :func:`importlib.util.module_from_spec` en su lugar.

source: Reload a previously imported *module*. The argument must be a module object, so it must have been successfully imported before. This is useful if you have edited the module source file using an external editor and want to try out the new version without leaving the Python interpreter. The return value is the module object (the same as the *module* argument).
es_ar: Vuelva a cargar un *módulo* importado anteriormente. El argumento debe ser un objeto module, por lo que debe haberse importado correctamente antes. Esto es útil si ha editado el archivo de origen del módulo utilizando un editor externo y desea probar la nueva versión sin salir del intérprete de Python. El valor devuelto es el objeto module (el mismo que el argumento *module*).

source: When ``reload(module)`` is executed:
es_ar: Cuando se ejecuta ``reload(module)``:

source: Python modules' code is recompiled and the module-level code reexecuted, defining a new set of objects which are bound to names in the module's dictionary. The ``init`` function of extension modules is not called a second time.
es_ar: El código de los módulos de Python se vuelve a compilar y se vuelve a ejecutar el código de nivel de módulo, definiendo un nuevo conjunto de objetos que están enlazados a nombres en el diccionario del módulo. La función ``init`` de los módulos de extensión no se llama una segunda vez.

source: As with all other objects in Python the old objects are only reclaimed after their reference counts drop to zero.
es_ar: Al igual que con todos los demás objetos de Python, los objetos antiguos solo se recuperan después de que sus recuentos de referencia caigan a cero.

source: The names in the module namespace are updated to point to any new or changed objects.
es_ar: Los nombres del espacio de nombres del módulo se actualizan para que apunten a cualquier objeto nuevo o modificado.

source: Other references to the old objects (such as names external to the module) are not rebound to refer to the new objects and must be updated in each namespace where they occur if that is desired.
es_ar: Otras referencias a los objetos antiguos (como nombres externos al módulo) no se rebotan para hacer referencia a los nuevos objetos y deben actualizarse en cada espacio de nombres donde se producen si se desea.

source: There are a number of other caveats:
es_ar: Hay una serie de otras advertencias:

source: When a module is reloaded, its dictionary (containing the module's global variables) is retained. Redefinitions of names will override the old definitions, so this is generally not a problem. If the new version of a module does not define a name that was defined by the old version, the old definition remains. This feature can be used to the module's advantage if it maintains a global table or cache of objects --- with a :keyword:`try` statement it can test for the table's presence and skip its initialization if desired::
es_ar: Cuando se vuelve a cargar un módulo, se conserva su diccionario (que contiene las variables globales del módulo). Las redefiniciones de nombres invalidarán las definiciones antiguas, por lo que esto generalmente no es un problema. Si la nueva versión de un módulo no define un nombre previamente definido, la definición anterior permanece. Esta característica se puede utilizar en beneficio del módulo si mantiene una tabla global o caché de objetos --- con una instrucción :keyword:`try` puede probar la presencia de la tabla y omitir su inicialización si se desea:

source: It is legal though generally not very useful to reload built-in or dynamically loaded modules, except for :mod:`sys`, :mod:`__main__` and :mod:`builtins`. In many cases, however, extension modules are not designed to be initialized more than once, and may fail in arbitrary ways when reloaded.
es_ar: Es legal, aunque generalmente no es muy útil para recargar módulos incorporados o cargados dinámicamente, excepto para :mod:`sys`, :mod:`__main__` y :mod:`builtins`. En muchos casos, sin embargo, los módulos de extensión no están diseñados para inicializarse más de una vez y pueden fallar de forma arbitraria cuando se vuelven a cargar.

source: If a module imports objects from another module using :keyword:`from` ... :keyword:`import` ..., calling :func:`reload` for the other module does not redefine the objects imported from it --- one way around this is to re-execute the :keyword:`!from` statement, another is to use :keyword:`!import` and qualified names (*module*.*name*) instead.
es_ar: Si un módulo importa objetos de otro módulo utilizando :keyword:`from`... :keyword:`import` ..., llamando a :func:`reload` para el otro módulo no redefine los objetos importados de él --- de una manera alrededor de esto es volver a ejecutar la sentencia :keyword:`!from`, otra es usar :keyword:`!import` y nombres calificados (*module*.*name*) en su lugar.

source: If a module instantiates instances of a class, reloading the module that defines the class does not affect the method definitions of the instances --- they continue to use the old class definition. The same is true for derived classes.
es_ar: Si un módulo crea instancias de una clase, volver a cargar el módulo que define la clase no afecta a las definiciones de método de las instancias --- siguen utilizando la definición de clase antigua. Lo mismo es cierto para las clases derivadas.

source: Relies on both ``__name__`` and ``__loader__`` being defined on the module being reloaded instead of just ``__name__``.
es_ar: Se basa en que tanto ``__name__`` como ``__loader__`` que se definen en el módulo que se está recargando en lugar de simplemente ``__name__``.

source: Use :func:`importlib.reload` instead.
es_ar: Utilice :func:`importlib.reload` en su lugar.

source: The following functions are conveniences for handling :pep:`3147` byte-compiled file paths.
es_ar: Las siguientes funciones son comodidades para controlar las rutas de acceso de archivo :pep:`3147` compiladas en bytes.

source: Return the :pep:`3147` path to the byte-compiled file associated with the source *path*. For example, if *path* is ``/foo/bar/baz.py`` the return value would be ``/foo/bar/__pycache__/baz.cpython-32.pyc`` for Python 3.2. The ``cpython-32`` string comes from the current magic tag (see :func:`get_tag`; if :attr:`sys.implementation.cache_tag` is not defined then :exc:`NotImplementedError` will be raised). By passing in ``True`` or ``False`` for *debug_override* you can override the system's value for ``__debug__``, leading to optimized bytecode.
es_ar: Devuelve la ruta de acceso :pep:`3147` al archivo compilado por bytes asociado con la ruta *path* de origen. Por ejemplo, si *path* es ``/foo/bar/baz.py`` el valor devuelto sería ``/foo/bar/__pycache__/baz.cpython-32.pyc`` para Python 3.2. La cadena ``cpython-32`` proviene de la etiqueta mágica actual (consulte :func:`get_tag`; si :attr:`sys.implementation.cache_tag` no está definida entonces :exc:`NotImplementedError` se generará). Al pasar ``True`` o ``False`` para *debug_override* puede reemplazar el valor del sistema para ``__debug__``, lo que da lugar a un código de bytes optimizado.

source: *path* need not exist.
es_ar: *ruta* no necesita existir.

source: If :attr:`sys.implementation.cache_tag` is ``None``, then :exc:`NotImplementedError` is raised.
es_ar: Lanza :exc:`NotImplementedError` cuando no se define :attr:`sys.implementation.cache_tag`.

source: Use :func:`importlib.util.cache_from_source` instead.
es_ar: Utilice :func:`importlib.util.source_from_cache` en su lugar.

source: The *debug_override* parameter no longer creates a ``.pyo`` file.
es_ar: El parámetro *debug_override* ya no crea un archivo ``.pyo``.

source: Given the *path* to a :pep:`3147` file name, return the associated source code file path. For example, if *path* is ``/foo/bar/__pycache__/baz.cpython-32.pyc`` the returned path would be ``/foo/bar/baz.py``. *path* need not exist, however if it does not conform to :pep:`3147` format, a :exc:`ValueError` is raised. If :attr:`sys.implementation.cache_tag` is not defined, :exc:`NotImplementedError` is raised.
es_ar: Dada la ruta *path* a un nombre de archivo :pep:`3147`, devuelva la ruta de acceso del archivo de código fuente asociada. Por ejemplo, si *path* es ``/foo/bar/__pycache__/baz.cpython-32.pyc`` la ruta devuelta sería ``/foo/bar/baz.py``. *path* no necesita existir, sin embargo, si no se ajusta al formato :pep:`3147`, se genera un :exc:`ValueError`. Si :attr:`sys.implementation.cache_tag` no está definido, se genera :exc:`NotImplementedError`.

source: Raise :exc:`NotImplementedError` when :attr:`sys.implementation.cache_tag` is not defined.
es_ar: Provoca :exc:`NotImplementedError` cuando no se define :attr:`sys.implementation.cache_tag`.

source: Use :func:`importlib.util.source_from_cache` instead.
es_ar: Utilice :func:`importlib.util.source_from_cache` en su lugar.

source: Return the :pep:`3147` magic tag string matching this version of Python's magic number, as returned by :func:`get_magic`.
es_ar: Devuelve la cadena de etiqueta mágica :pep:`3147` que coincida con esta versión del número mágico de Python, devuelta por :func:`get_magic`.

source: Use :attr:`sys.implementation.cache_tag` directly starting in Python 3.3.
es_ar: Utilice :attr:`sys.implementation.cache_tag` directamente a partir de Python 3.3.

source: The following functions help interact with the import system's internal locking mechanism. Locking semantics of imports are an implementation detail which may vary from release to release. However, Python ensures that circular imports work without any deadlocks.
es_ar: Las siguientes funciones ayudan a interactuar con el mecanismo de bloqueo interno del sistema de importación. La semántica de bloqueo de las importaciones es un detalle de implementación que puede variar de una versión a una. Sin embargo, Python garantiza que las importaciones circulares funcionen sin interbloqueos.

source: Return ``True`` if the global import lock is currently held, else ``False``. On platforms without threads, always return ``False``.
es_ar: Devuelve ``True`` si el bloqueo de importación global se mantiene actualmente, de lo contrario ``False``. En plataformas sin subprocesos, siempre devuelve ``False``.

source: On platforms with threads, a thread executing an import first holds a global import lock, then sets up a per-module lock for the rest of the import. This blocks other threads from importing the same module until the original import completes, preventing other threads from seeing incomplete module objects constructed by the original thread. An exception is made for circular imports, which by construction have to expose an incomplete module object at some point.
es_ar: En plataformas con subprocesos, un subproceso que ejecuta una importación primero contiene un bloqueo de importación global y, a continuación, configura un bloqueo por módulo para el resto de la importación. Esto impide que otros subprocesos importen el mismo módulo hasta que se complete la importación original, lo que impide que otros subprocesos vean objetos de módulo incompletos construidos por el subproceso original. Se hace una excepción para las importaciones circulares, que por construcción tienen que exponer un objeto de módulo incompleto en algún momento.

source: The locking scheme has changed to per-module locks for the most part. A global import lock is kept for some critical tasks, such as initializing the per-module locks.
es_ar: El esquema de bloqueo ha cambiado a bloqueos por módulo en su mayor parte. Se mantiene un bloqueo de importación global para algunas tareas críticas, como la inicialización de los bloqueos por módulo.

source: Acquire the interpreter's global import lock for the current thread. This lock should be used by import hooks to ensure thread-safety when importing modules.
es_ar: Adquiera el bloqueo de importación global del intérprete para el subproceso actual. Este bloqueo debe ser utilizado por los ganchos de importación para garantizar la seguridad de subprocesos al importar módulos.

source: Once a thread has acquired the import lock, the same thread may acquire it again without blocking; the thread must release it once for each time it has acquired it.
es_ar: Una vez que un subproceso ha adquirido el bloqueo de importación, el mismo subproceso puede adquirirlo de nuevo sin bloquear; el subproceso debe liberarlo una vez por cada vez que lo ha adquirido.

source: On platforms without threads, this function does nothing.
es_ar: En plataformas sin subprocesos, esta función no hace nada.

source: Release the interpreter's global import lock. On platforms without threads, this function does nothing.
es_ar: Suelte el bloqueo de importación global del intérprete. En plataformas sin subprocesos, esta función no hace nada.
