Repository: python/python-docs-es
Catalog: library/imp.po
Languages: es_ar

source: The following constants with integer values, defined in this module, are used to indicate the search result of :func:`find_module`.
es_ar: Las siguientes constantes con valores enteros, definidas en este módulo, se utilizan para indicar el resultado de búsqueda de :func:`find_module`.

source: The module was found as a source file.
es_ar: El módulo se encontró como un archivo de origen.

source: The module was found as a compiled code object file.
es_ar: El módulo se encontró como un archivo de objeto de código compilado.

source: The module was found as dynamically loadable shared library.
es_ar: El módulo se encontró como biblioteca compartida cargable dinámicamente.

source: The module was found as a package directory.
es_ar: El módulo se encontró como un directorio de paquetes.

source: The module was found as a built-in module.
es_ar: El módulo fue encontrado como un módulo incorporado.

source: The module was found as a frozen module.
es_ar: El módulo fue encontrado como un módulo congelado.

source: The :class:`NullImporter` type is a :pep:`302` import hook that handles non-directory path strings by failing to find any modules. Calling this type with an existing directory or empty string raises :exc:`ImportError`. Otherwise, a :class:`NullImporter` instance is returned.
es_ar: El tipo :class:`NullImporter` es un enlace de importación :pep:`302` que controla cadenas de ruta de acceso que no son de directorio al no encontrar ningún módulo. Llamar a este tipo con un directorio existente o una cadena vacía genera :exc:`ImportError`. De lo contrario, se devuelve una instancia :class:`NullImporter`.

source: Instances have only one method:
es_ar: Las instancias solo tienen un método:

source: This method always returns ``None``, indicating that the requested module could not be found.
es_ar: Este método siempre devuelve ``None``, lo que indica que no se pudo encontrar el módulo solicitado.

source: ``None`` is inserted into ``sys.path_importer_cache`` instead of an instance of :class:`NullImporter`.
es_ar: ``None`` se inserta en ``sys.path_importer_cache`` en lugar de una instancia de :class:`NullImporter`.

source: Insert ``None`` into ``sys.path_importer_cache`` instead.
es_ar: Inserte ``None`` en ``sys.path_importer_cache`` en su lugar.

source: Examples
es_ar: Ejemplos

source: The following function emulates what was the standard import statement up to Python 1.4 (no hierarchical module names). (This *implementation* wouldn't work in that version, since :func:`find_module` has been extended and :func:`load_module` has been added in 1.4.) ::
es_ar: La siguiente función emula lo que era la instrucción de importación estándar hasta Python 1.4 (sin nombres de módulo jerárquico). (Esta *implementación* no funcionaría en esa versión, ya que :func:`find_module` se ha ampliado y :func:`load_module` se ha añadido en 1.4.) ::
