Repository: python/python-docs-es
Catalog: library/importlib.metadata.po
Languages: es_ar

source: :mod:`!importlib.metadata` -- Accessing package metadata
es_ar: :mod:`!importlib.metadata` -- Acceso a los metadatos de los paquetes

source: ``importlib.metadata`` is no longer provisional.
es_ar: ``importlib.metadata`` ya no es provisional.

source: These are *not* necessarily equivalent to or correspond 1:1 with the top-level *import package* names that can be imported inside Python code. One *distribution package* can contain multiple *import packages* (and single modules), and one top-level *import package* may map to multiple *distribution packages* if it is a namespace package. You can use :ref:`package_distributions() <package-distributions>` to get a mapping between them.
es_ar: Estos *no* son necesariamente equivalentes o se corresponden 1:1 con los nombres de *paquetes de importación* de nivel superior que pueden ser importados dentro del código Python. Un *paquete de distribución* puede contener múltiples *paquetes de importación* (y módulos individuales), y un *paquete de importación* de nivel superior puede corresponder a múltiples *paquetes de distribución* si es un paquete de espacio de nombres. Puede usar :ref:`package_distributions() <package-distributions>` para obtener un mapeo entre ellos.

source: By default, distribution metadata can live on the file system or in zip archives on :data:`sys.path`. Through an extension mechanism, the metadata can live almost anywhere.
es_ar: Por defecto, los metadatos de distribución pueden vivir en el sistema de ficheros o en archivos zip en :data:`sys.path`. A través de un mecanismo de extensión, los metadatos pueden vivir casi en cualquier lugar.

source: The documentation for ``importlib_metadata``, which supplies a backport of ``importlib.metadata``. This includes an `API reference <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ for this module's classes and functions, as well as a `migration guide <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ for existing users of ``pkg_resources``.
es_ar: La documentación de ``importlib_metadata``, que proporciona un backport de ``importlib.metadata``. Esto incluye una `Referencia API <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ para las clases y funciones de este módulo, así como una `Guía de migración <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ para los usuarios existentes de ``pkg_resources``.

source: Overview
es_ar: Descripción general

source: You can get the version string for ``wheel`` by running the following:
es_ar: Se puede obtener la cadena de versión para ``wheel`` ejecutando lo siguiente:

source: You can get the :ref:`metadata for a distribution <metadata>`::
es_ar: Se pueden obtener los :ref:`metadatos para una distribución <metadata>`::

source: You can also get a :ref:`distribution's version number <version>`, list its :ref:`constituent files <files>`, and get a list of the distribution's :ref:`requirements`.
es_ar: También se puede obtener el :ref:`número de versión de una distribución <version>`, enumerar sus :ref:`archivos constituyentes <files>` y obtener una lista de los :ref:`requirements` de la distribución.

source: Functional API
es_ar: API funcional

source: This package provides the following functionality via its public API.
es_ar: Este paquete provee la siguiente funcionalidad a través de su API pública.

source: Entry points
es_ar: Puntos de entrada

source: The ``entry_points()`` function returns a collection of entry points. Entry points are represented by ``EntryPoint`` instances; each ``EntryPoint`` has a ``.name``, ``.group``, and ``.value`` attributes and a ``.load()`` method to resolve the value. There are also ``.module``, ``.attr``, and ``.extras`` attributes for getting the components of the ``.value`` attribute.
es_ar: La función ``entry_points()`` retorna una colección de todos los puntos de entrada. Los puntos de entrada están representados por instancias de ``EntryPoint``. Cada ``EntryPoint`` tiene los atributos ``.name``, ``.group`` y ``.value``, y un método ``.load()`` para resolver el valor. También hay atributos ``.module``, ``.attr`` y ``.extras`` para obtener los componentes del atributo ``.value``.

source: Query all entry points::
es_ar: Consultar todos los puntos de entrada::

source: ``EntryPoints`` has a ``select`` method to select entry points matching specific properties. Select entry points in the ``console_scripts`` group::
es_ar: ``EntryPoints`` tiene un método ``select`` para seleccionar puntos de entrada que coincidan con propiedades específicas. Seleccione los puntos de entrada en el grupo ``console_scripts``::

source: Equivalently, since ``entry_points`` passes keyword arguments through to select::
es_ar: De manera equivalente, ya que ``entry_points`` para argumentos de palabra clave para seleccionar::

source: Pick out a specific script named "wheel" (found in the wheel project)::
es_ar: Elige un script específico llamado "wheel" (que se encuentra en el proyecto *wheel*)::

source: Equivalently, query for that entry point during selection::
es_ar: De manera equivalente, consulta por ese punto de entrada durante la selección::

source: Inspect the resolved entry point::
es_ar: Inspeccionar el punto de entrada resuelto::

source: *Compatibility Note*
es_ar: *Nota de compatibilidad*

source: Distribution metadata
es_ar: Metadatos de distribución

source: The keys of the returned data structure, a ``PackageMetadata``, name the metadata keywords, and the values are returned unparsed from the distribution metadata::
es_ar: Las claves de la estructura de datos retornada un ``PackageMetadata``, nombran las palabras clave de los metadatos y sus valores se retornan sin analizar de los metadatos de distribución::

source: ``PackageMetadata`` also presents a ``json`` attribute that returns all the metadata in a JSON-compatible form per :PEP:`566`::
es_ar: ``PackageMetadata`` también presenta un atributo ``json`` que retorna todos los metadatos en un formulario compatible con JSON por :PEP:`566`::

source: The actual type of the object returned by ``metadata()`` is an implementation detail and should be accessed only through the interface described by the `PackageMetadata protocol <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.
es_ar: El tipo actual del objeto retornado por ``metadata()`` es un detalle de la implementación y sólo debe accederse a él a través de la interfaz descrita por el protocolo `PackageMetadata <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.

source: The ``Description`` is now included in the metadata when presented through the payload. Line continuation characters have been removed.
es_ar: La ``Descripción`` ahora se incluye en los metadatos cuando se presenta a través de la carga útil. Se han eliminado los caracteres de continuación de línea.

source: The ``json`` attribute was added.
es_ar: El atributo ``json`` fue añadido.

source: Distribution versions
es_ar: Versiones de distribución

source: Distribution files
es_ar: Archivos de distribución

source: Once you have the file, you can also read its contents::
es_ar: Una vez que se tiene el archivo, también se puede leer su contenido::

source: You can also use the ``locate`` method to get a the absolute path to the file::
es_ar: También puede usar el método ``locate`` para obtener la ruta absoluta al archivo:

source: In the case where the metadata file listing files (RECORD or SOURCES.txt) is missing, ``files()`` will return ``None``. The caller may wish to wrap calls to ``files()`` in `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ or otherwise guard against this condition if the target distribution is not known to have the metadata present.
es_ar: En el caso de que el archivo de metadatos que enumera los archivos (RECORD o SOURCES.txt) falte, ``files()`` retornará ``None``. Para evitar esta condición, si no se sabe si la distribución de destino contiene los metadatos, se puede envolver las llamadas a ``files()`` con `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ u otra protección similar.

source: Distribution requirements
es_ar: Requerimientos de la distribución

source: Mapping import to distribution packages
es_ar: Mapeo de paquetes de importación a distribución

source: A convenience method to resolve the `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name (or names, in the case of a namespace package) that provide each importable top-level Python module or `Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::
es_ar: Un método práctico para resolver el nombre del `Paquete de distribución <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ (o nombres, en el caso de un paquete de espacio de nombres) que proporciona cada módulo Python de nivel superior importable o `Paquete de importación <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::

source: Some editable installs, `do not supply top-level names <https://github.com/pypa/packaging-problems/issues/609>`_, and thus this function is not reliable with such installs.
es_ar: Algunas instalaciones editables, `no suministran nombres de nivel superior <https://github.com/pypa/packaging-problems/issues/609>`_, por lo que esta función no es fiable con dichas instalaciones.

source: Distributions
es_ar: Distribuciones

source: Thus, an alternative way to get the version number is through the ``Distribution`` instance::
es_ar: Por lo tanto, una forma alternativa de obtener el número de versión es mediante la instancia de ``Distribución``:

source: There are all kinds of additional metadata available on the ``Distribution`` instance::
es_ar: Hay todo tipo de metadatos disponibles adicionales en la instancia de ``Distribution``:

source: By default, this package provides built-in support for discovery of metadata for file system and zip file `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\s. This metadata finder search defaults to ``sys.path``, but varies slightly in how it interprets those values from how other import machinery does. In particular:
es_ar: Por defecto, este paquete proporciona soporte incorporado para el descubrimiento de metadatos para el sistema de archivos y archivos zip `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\s. Este buscador de metadatos busca por defecto ``sys.path``, pero varía ligeramente en cómo interpreta esos valores respecto a cómo lo hace otra maquinaria de importación. En particular:

source: ``importlib.metadata`` will incidentally honor :py:class:`pathlib.Path` objects on ``sys.path`` even though such values will be ignored for imports.
es_ar: ``importlib.metadata`` respetará incidentalmente los objetos :py:class:`pathlib.Path`` en ``sys.path`` aunque tales valores serán ignorados para las importaciones.

source: Extending the search algorithm
es_ar: Extendiendo el algoritmo de búsqueda

source: By default ``importlib.metadata`` installs a finder for distribution packages found on the file system. This finder doesn't actually find any *distributions*, but it can find their metadata.
es_ar: Por defecto ``importlib.metadata`` instala un buscador de paquetes de distribución encontrados en el sistema de ficheros. Este buscador en realidad no encuentra ninguna *distribución*, pero puede encontrar sus metadatos.

source: The abstract class :py:class:`importlib.abc.MetaPathFinder` defines the interface expected of finders by Python's import system. ``importlib.metadata`` extends this protocol by looking for an optional ``find_distributions`` callable on the finders from :data:`sys.meta_path` and presents this extended interface as the ``DistributionFinder`` abstract base class, which defines this abstract method::
es_ar: La clase abstracta :py:class:`importlib.abc.MetaPathFinder` define la interfaz que se espera de los buscadores por el sistema de importación de Python. ``importlib.metadata`` amplía este protocolo buscando una ``find_distributions`` opcional invocable en los buscadores desde :data:`sys.meta_path` y presenta esta interfaz extendida como la clase base abstracta ``DistributionFinder``, que define este método abstracto::

source: The ``DistributionFinder.Context`` object provides ``.path`` and ``.name`` properties indicating the path to search and name to match and may supply other relevant context.
es_ar: El objeto ``DistributionFinder.Context`` proporciona propiedades ``.path`` y ``.name`` que indican la ruta de búsqueda y los nombres que deben coincidir y puede proporcionar otro contexto relevante.

source: What this means in practice is that to support finding distribution package metadata in locations other than the file system, subclass ``Distribution`` and implement the abstract methods. Then from a custom finder, return instances of this derived ``Distribution`` in the ``find_distributions()`` method.
es_ar: Lo que esto significa en la práctica es que, para soportar la búsqueda de metadatos en paquetes de distribución en ubicaciones distintas al sistema de archivos, se debe subclasificar ``Distribution`` e implementar sus métodos abstractos. Luego, en el método ``find_distributions()`` de un buscador personalizado no hay más que retornar instancias de esta ``Distribution`` derivada.
