Repository: python/python-docs-es
Catalog: library/importlib.po
Languages: es

source: :mod:`!importlib` --- The implementation of :keyword:`!import`
es: :mod:`!importlib` --- La implementación de :keyword:`!import`

source: **Source code:** :source:`Lib/importlib/__init__.py`
es: **Código fuente:** :source:`Lib/importlib/__init__.py`

source: Introduction
es: Introducción

source: The purpose of the :mod:`importlib` package is two-fold. One is to provide the implementation of the :keyword:`import` statement (and thus, by extension, the :func:`__import__` function) in Python source code. This provides an implementation of :keyword:`!import` which is portable to any Python interpreter. This also provides an implementation which is easier to comprehend than one implemented in a programming language other than Python.
es: El propósito del paquete :mod:`importlib` es doble. Uno es proveer la implementación de la declaración de :keyword:`import`, (y así, por extensión, el método :func:`__import__` ) en el código fuente de Python. Esto provee una implementación de la :keyword:`!import` la cual es compatible con cualquier interprete de Python. También provee una implementación que es más fácil de comprender que otras implementaciones, en lenguajes diferentes a Python.

source: Two, the components to implement :keyword:`import` are exposed in this package, making it easier for users to create their own custom objects (known generically as an :term:`importer`) to participate in the import process.
es: Dos, los componentes incluidos para implementar :keyword:`import` están expuestos en este paquete para que sea más fácil para los usuarios crear sus propios objetos (conocidos de forma genérica como :term:`importer`) para participar en el proceso de importación.

source: The language reference for the :keyword:`import` statement.
es: La referencia en el lenguaje para la declaración de :keyword:`import`.

source: `Packages specification <https://www.python.org/doc/essays/packages/>`__
es: `Especificaciones de paquetes <https://www.python.org/doc/essays/packages/>`__

source: Original specification of packages. Some semantics have changed since the writing of this document (e.g. redirecting based on ``None`` in :data:`sys.modules`).
es: Especificaciones originales de los paquetes. Algunas semánticas han cambiado desde que este documento fue escrito (ejemplo, redirección de acuerdo a ``None`` en :data:`sys.modules`).

source: The :func:`.__import__` function
es: La función :func:`.__import__`

source: The :keyword:`import` statement is syntactic sugar for this function.
es: La declaración de :keyword:`import` es una decoración sintáctica para esta función.

source: Import on Case-Insensitive Platforms
es: Importar en sistemas que no distinguen entre mayúsculas y minúsculas

source: Defining Python Source Code Encodings
es: Definiendo las codificaciones del código fuente de Python

source: New Import Hooks
es: Nuevos ganchos de importación

source: Imports: Multi-Line and Absolute/Relative
es: Importaciones: Multilíneas, y absolutos/relativos

source: Main module explicit relative imports
es: Importaciones relativas, explicitas, del módulo principal

source: Implicit namespace packages
es: Paquetes implícitos en el espacio de nombres

source: A ModuleSpec Type for the Import System
es: Un tipo de ModuleSpec para el sistema de importación

source: Elimination of PYO files
es: Eliminación de archivos PYO

source: Multi-phase extension module initialization
es: Inicialización de extensión de módulo en múltiples fases

source: Deterministic pycs
es: Pycs determinísticos

source: Using UTF-8 as the Default Source Encoding
es: Usando UTF-8 como la codificación fuente por defecto

source: PYC Repository Directories
es: Repositorio de directorios PYC

source: Functions
es: Funciones

source: An implementation of the built-in :func:`__import__` function.
es: Una implementación de la función :func:`__import__` incorporada.

source: Programmatic importing of modules should use :func:`import_module` instead of this function.
es: La importación programática los módulos debe usar :func:`import_module` en lugar de esta función.

source: Import a module. The *name* argument specifies what module to import in absolute or relative terms (e.g. either ``pkg.mod`` or ``..mod``). If the name is specified in relative terms, then the *package* argument must be set to the name of the package which is to act as the anchor for resolving the package name (e.g. ``import_module('..mod', 'pkg.subpkg')`` will import ``pkg.mod``).
es: Importar un módulo. El argumento llamado *name* especifica qué módulo importar en términos absolutos o relativos (ejemplo, puede ser ``pkg.mod`` o ``..mod``). Si el nombre fuera especificado en términos relativos, entonces el argumento llamado *package* debe ser igual al nombre del paquete que será el ancla para resolver el nombre del paquete (ejemplo ``import_module('..mod', 'pkg.subpkg')`` importará ``pkg.mod``).

source: The :func:`import_module` function acts as a simplifying wrapper around :func:`importlib.__import__`. This means all semantics of the function are derived from :func:`importlib.__import__`. The most important difference between these two functions is that :func:`import_module` returns the specified package or module (e.g. ``pkg.mod``), while :func:`__import__` returns the top-level package or module (e.g. ``pkg``).
es: La función :func:`import_module` actúa como un envoltorio simplificador alrededor de :func:`importlib.__import__`. Esto quiere decir que las semánticas de la función son derivadas de :func:`importlib.__import__`. La diferencia más importante entre las dos funciones es que :func:`import_module` retorna el paquete especificado o el módulo (ejemplo ``pkg.mod``), mientras que :func:`__import__` retorna el paquete o módulo del nivel superior (ejemplo ``pkg``).

source: If you are dynamically importing a module that was created since the interpreter began execution (e.g., created a Python source file), you may need to call :func:`invalidate_caches` in order for the new module to be noticed by the import system.
es: Si está importando dinámicamente un módulo que se creó desde que el intérprete comenzó la ejecución (por ejemplo, creó un archivo fuente de Python), es posible que deba llamar a :func:`invalidate_caches` para que el nuevo módulo sea detectado por el sistema de importación.

source: Parent packages are automatically imported.
es: Paquetes padres son importados automáticamente.

source: Find the loader for a module, optionally within the specified *path*. If the module is in :attr:`sys.modules`, then ``sys.modules[name].__loader__`` is returned (unless the loader would be ``None`` or is not set, in which case :exc:`ValueError` is raised). Otherwise a search using :attr:`sys.meta_path` is done. ``None`` is returned if no loader is found.
es: Encuentra el cargador de un módulo, opcionalmente con el especificado en *path*.Si el módulo esta en :attr:`sys.modules`, entonces retorna el `sys.modules[name].__loader__`` (a menos que el cargador sea ``None`` o no haya uno especificado, en tal caso se eleva un :exc:`ValueError`).Si no se encuentra ahí, se hace una búsqueda usando :attr:`sys.meta_path`. Se retorna ``None`` si no se encuentra un cargador.

source: A dotted name does not have its parents implicitly imported as that requires loading them and that may not be desired. To properly import a submodule you will need to import all parent packages of the submodule and use the correct argument to *path*.
es: Un nombre con puntos no tiene sus ascendientes importados implícitamente, ya que eso requeriría cargarlo y eso podría no ser deseado. Para importar un sub-módulo correctamente debes importar todos los paquetes ascendientes del sub-módulo y pase el argumento correcto a *path*.

source: If ``__loader__`` is not set, raise :exc:`ValueError`, just like when the attribute is set to ``None``.
es: Si el ``__loader__`` no está configurado, eleva un :exc:`ValueError`, igual a si el atributo fuera ``None``.

source: Use :func:`importlib.util.find_spec` instead.
es: Utilice :func:`importlib.util.find_spec` en su lugar.

source: Invalidate the internal caches of finders stored at :data:`sys.meta_path`. If a finder implements ``invalidate_caches()`` then it will be called to perform the invalidation. This function should be called if any modules are created/installed while your program is running to guarantee all finders will notice the new module's existence.
es: Invalide los cache internos de ubicadores encontrados en :data:`sys.meta_path`.Si un buscador implementa ``invalidate_caches()`` entonces será llamado para realizar la invalidación.Esta función debe ser llamada si cualquier módulo ha sido creado/instalado mientras tu programa esta siendo ejecutado para garantizar que todos los buscadores noten la existencia del nuevo módulo.

source: Reload a previously imported *module*. The argument must be a module object, so it must have been successfully imported before. This is useful if you have edited the module source file using an external editor and want to try out the new version without leaving the Python interpreter. The return value is the module object (which can be different if re-importing causes a different object to be placed in :data:`sys.modules`).
es: Recarga un *modulo* previamente importado. El argumento debe ser un objeto módulo, por lo que debe haber sido importado exitosamente. Esto es útil cuando has editado el código fuente de un archivo usando un editor externo y deseas probar la nueva versión sin abandonar el interprete de Python. El valor retornado es el objeto módulo (que puede ser diferente si la reimportación crea un nuevo objeto en :data:`sys.modules`).

source: When :func:`reload` is executed:
es: Cuando :func:`reload` es ejecutada:

source: Python module's code is recompiled and the module-level code re-executed, defining a new set of objects which are bound to names in the module's dictionary by reusing the :term:`loader` which originally loaded the module. The ``init`` function of extension modules is not called a second time.
es: El código de un módulo de Python es recompilado y el código del módulo reejecutado, definiendo un nuevo conjunto de objetos que son asignados a los nombres de los módulos en el diccionario, reusando el :term:`loader` que originalmente carga los módulos. El método ``init`` de los módulos de extension no es llamado de nuevo.

source: As with all other objects in Python the old objects are only reclaimed after their reference counts drop to zero.
es: Al igual que con todos los demás objetos en Python, los objetos antiguos solo se recuperan después de que sus recuentos de referencias caen a cero.

source: The names in the module namespace are updated to point to any new or changed objects.
es: Los nombres en el espacio de nombres del módulo se actualizan para señalar cualquier objeto nuevo o modificado.

source: Other references to the old objects (such as names external to the module) are not rebound to refer to the new objects and must be updated in each namespace where they occur if that is desired.
es: Otras referencias a los objetos antiguos (como los nombres externos al módulo) no se vuelven a vincular para hacer referencia a los nuevos objetos y deben actualizarse en cada espacio de nombres donde se produzcan si se desea.

source: There are a number of other caveats:
es: Hay una serie de otras advertencias:

source: When a module is reloaded, its dictionary (containing the module's global variables) is retained. Redefinitions of names will override the old definitions, so this is generally not a problem. If the new version of a module does not define a name that was defined by the old version, the old definition remains. This feature can be used to the module's advantage if it maintains a global table or cache of objects --- with a :keyword:`try` statement it can test for the table's presence and skip its initialization if desired::
es: Cuando se vuelve a cargar un módulo, se conserva su diccionario (que contiene las variables globales del módulo). Las redefiniciones de nombres anularán las antiguas definiciones, por lo que generalmente esto no es un problema. Si la nueva versión de un módulo no define un nombre que fue definido por la versión anterior, la definición anterior permanece. Esta característica se puede utilizar en beneficio del módulo si mantiene una tabla global o caché de objetos --- con una declaración :keyword:`try` puede probar la presencia de la tabla y omitir su inicialización si lo desea:

source: It is generally not very useful to reload built-in or dynamically loaded modules. Reloading :mod:`sys`, :mod:`__main__`, :mod:`builtins` and other key modules is not recommended. In many cases extension modules are not designed to be initialized more than once, and may fail in arbitrary ways when reloaded.
es: Por lo general, no es muy útil recargar módulos integrados o cargados dinámicamente. No se recomienda recargar :mod:`sys`, :mod:`__main__`, :mod:`builtins` y otros módulos clave. En muchos casos, los módulos de extensión no están diseñados para inicializarse más de una vez y pueden fallar de manera arbitraria cuando se vuelven a cargar.

source: If a module imports objects from another module using :keyword:`from` ... :keyword:`import` ..., calling :func:`reload` for the other module does not redefine the objects imported from it --- one way around this is to re-execute the :keyword:`!from` statement, another is to use :keyword:`!import` and qualified names (*module.name*) instead.
es: Si un módulo importa objetos de otro módulo usando :keyword:`from` ... :keyword:`import` ..., al llamar a :func:`reload` para el otro módulo no redefine los objetos importados de él --- una forma de evitar esto es volver a ejecutar la instrucción :keyword:`!from`, otra es usar :keyword:`!import` y nombres calificados (*module.name*) en su lugar.

source: If a module instantiates instances of a class, reloading the module that defines the class does not affect the method definitions of the instances --- they continue to use the old class definition. The same is true for derived classes.
es: Si un módulo crea instancias de una clase, volver a cargar el módulo que define la clase no afecta las definiciones de método de las instancias --- continúan usando la definición de clase anterior. Lo mismo ocurre con las clases derivadas.

source: :exc:`ModuleNotFoundError` is raised when the module being reloaded lacks a :class:`~importlib.machinery.ModuleSpec`.
es: :exc:`ModuleNotFoundError` se lanza cuando el módulo que se está recargando carece de :class:`~importlib.machinery.ModuleSpec`.

source: :mod:`importlib.abc` -- Abstract base classes related to import
es: :mod:`importlib.abc` -- Clases base abstractas relacionadas con la importación

source: **Source code:** :source:`Lib/importlib/abc.py`
es: **Código fuente:** :source:`Lib/importlib/abc.py`

source: The :mod:`importlib.abc` module contains all of the core abstract base classes used by :keyword:`import`. Some subclasses of the core abstract base classes are also provided to help in implementing the core ABCs.
es: El módulo :mod:`importlib.abc` contiene todas las clases base abstractas principales utilizadas por :keyword:`import`. También se proporcionan algunas subclases de las clases base abstractas centrales para ayudar a implementar los ABC centrales.

source: ABC hierarchy::
es: Jerarquía ABC::

source: An abstract base class representing a :term:`finder`.
es: Una clase base abstracta que representa :term:`finder`.

source: Use :class:`MetaPathFinder` or :class:`PathEntryFinder` instead.
es: Utilice :class:`MetaPathFinder` o :class:`PathEntryFinder` en su lugar.

source: An abstract method for finding a :term:`loader` for the specified module. Originally specified in :pep:`302`, this method was meant for use in :data:`sys.meta_path` and in the path-based import subsystem.
es: Un método abstracto para encontrar un :term:`loader` para el módulo especificado. Originalmente especificado en :pep:`302`, este método estaba destinado a ser utilizado en :data:`sys.meta_path` y en el subsistema de importación basado en rutas.

source: Returns ``None`` when called instead of raising :exc:`NotImplementedError`.
es: Retorna ``None`` cuando se llama en lugar de generar :exc:`NotImplementedError`.

source: Implement :meth:`MetaPathFinder.find_spec` or :meth:`PathEntryFinder.find_spec` instead.
es: Implemente :meth:`MetaPathFinder.find_spec` o :meth:`PathEntryFinder.find_spec` en su lugar.

source: An abstract base class representing a :term:`meta path finder`. For compatibility, this is a subclass of :class:`Finder`.
es: Una clase base abstracta que representa un :term:`meta path finder`. Por compatibilidad, esta es una subclase de :class:`Finder`.

source: No longer a subclass of :class:`Finder`.
es: Ya no hereda de :class:`Finder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`__path__` from the parent package. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``MetaPathFinders``.
es: Un método abstracto para encontrar un :term:`spec <module spec>` para el módulo especificado. Si se trata de una importación de nivel superior, el *path* será ``None``. De lo contrario, esta es una búsqueda de un subpaquete o módulo y *path* será el valor de :attr:`__path__` del paquete principal. Si no se puede encontrar una especificación, se retorna ``None``. Cuando se pasa, ``target`` es un objeto de módulo que el buscador puede usar para hacer una suposición más informada sobre qué especificación retornar. :func:`importlib.util.spec_from_loader` puede ser útil para implementar ``MetaPathFinders`` concretos.

source: A legacy method for finding a :term:`loader` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`__path__` from the parent package. If a loader cannot be found, ``None`` is returned.
es: Un método heredado para encontrar un :term:`loader` para el módulo especificado. Si se trata de una importación de nivel superior, el *path* será ``None``. De lo contrario, esta es una búsqueda de un subpaquete o módulo y *path* será el valor de :attr:`__path__` del paquete principal. Si no se puede encontrar un cargador, se retorna ``None``.

source: If :meth:`find_spec` is defined, backwards-compatible functionality is provided.
es: Si se define :meth:`find_spec`, se proporciona una funcionalidad compatible con versiones anteriores.

source: Returns ``None`` when called instead of raising :exc:`NotImplementedError`. Can use :meth:`find_spec` to provide functionality.
es: Retorna ``None`` cuando se llama en lugar de generar :exc:`NotImplementedError`. Puede usar :meth:`find_spec` para proporcionar funcionalidad.

source: Use :meth:`find_spec` instead.
es: Use :meth:`find_spec` en su lugar.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :func:`importlib.invalidate_caches` when invalidating the caches of all finders on :data:`sys.meta_path`.
es: Un método opcional que, cuando se llama, debería invalidar cualquier caché interno utilizado por el buscador. Utilizado por :func:`importlib.invalidate_caches` al invalidar los cachés de todos los buscadores en :data:`sys.meta_path`.

source: Returns ``None`` when called instead of ``NotImplemented``.
es: Retorna ``None`` cuando se llama en lugar de ``NotImplemented``.

source: An abstract base class representing a :term:`path entry finder`. Though it bears some similarities to :class:`MetaPathFinder`, ``PathEntryFinder`` is meant for use only within the path-based import subsystem provided by :class:`importlib.machinery.PathFinder`.
es: Una clase base abstracta que representa un :term:`buscador de entradas de ruta <path entry finder>`. Aunque tiene algunas similitudes con :class:`MetaPathFinder`, ``PathEntryFinder`` está diseñado para usarse solo dentro del subsistema de importación basado en rutas proporcionado por :class:`importlib.machinery.PathFinder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. The finder will search for the module only within the :term:`path entry` to which it is assigned. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``PathEntryFinders``.
es: Un método abstracto para encontrar un :term:`spec <module spec>` para el módulo especificado. El buscador buscará el módulo solo dentro del :term:`path entry` a la que está asignado. Si no se puede encontrar una especificación, se retorna ``None``. Cuando se pasa, ``target`` es un objeto de módulo que el buscador puede usar para hacer una suposición más informada sobre qué especificación retornar. :func:`importlib.util.spec_from_loader` puede ser útil para implementar ``PathEntryFinders`` concretos.

source: A legacy method for finding a :term:`loader` for the specified module. Returns a 2-tuple of ``(loader, portion)`` where ``portion`` is a sequence of file system locations contributing to part of a namespace package. The loader may be ``None`` while specifying ``portion`` to signify the contribution of the file system locations to a namespace package. An empty list can be used for ``portion`` to signify the loader is not part of a namespace package. If ``loader`` is ``None`` and ``portion`` is the empty list then no loader or location for a namespace package were found (i.e. failure to find anything for the module).
es: Un método heredado para encontrar un :term:`loader` para el módulo especificado. Retorna una tupla de 2 de ``(loader, portion)`` donde ``portion`` es una secuencia de ubicaciones del sistema de archivos que contribuyen a parte de un paquete de espacio de nombres. El cargador puede ser ``None`` mientras se especifica ``portion`` para indicar la contribución de las ubicaciones del sistema de archivos a un paquete de espacio de nombres. Se puede usar una lista vacía para ``portion`` para indicar que el cargador no es parte de un paquete de espacio de nombres. Si ``loader`` es ``None`` y ``portion`` es la lista vacía, entonces no se encontró ningún cargador o ubicación para un paquete de espacio de nombres (es decir, no se pudo encontrar nada para el módulo).

source: If :meth:`find_spec` is defined then backwards-compatible functionality is provided.
es: Si se define :meth:`find_spec`, se proporciona una funcionalidad compatible con versiones anteriores.

source: Returns ``(None, [])`` instead of raising :exc:`NotImplementedError`. Uses :meth:`find_spec` when available to provide functionality.
es: Retorna ``(None, [])`` en lugar de lanzar :exc:`NotImplementedError`. Usa :meth:`find_spec` cuando está disponible para proporcionar funcionalidad.

source: A concrete implementation of :meth:`Finder.find_module` which is equivalent to ``self.find_loader(fullname)[0]``.
es: Una implementación concreta de :meth:`Finder.find_module` que es equivalente a ``self.find_loader(fullname)[0]``.
