Repository: python/python-docs-es
Catalog: library/importlib.po
Languages: es

source: Set ``__loader__`` if set to ``None``, as if the attribute does not exist.
es: Establece ``__loader__`` si está configurado como ``None``, como si el atributo no existiera.

source: The import machinery takes care of this automatically.
es: La maquinaria de importación se encarga de esto automáticamente.

source: A :term:`decorator` for :meth:`importlib.abc.Loader.load_module` to set the :attr:`__package__` attribute on the returned module. If :attr:`__package__` is set and has a value other than ``None`` it will not be changed.
es: Un :term:`decorator` para :meth:`importlib.abc.Loader.load_module` para establecer el atributo :attr:`__package__` en el módulo retornado. Si :attr:`__package__` está configurado y tiene un valor diferente a ``None``, no se cambiará.

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on a loader. The parameters have the same meaning as they do for ModuleSpec. The function uses available :term:`loader` APIs, such as :meth:`InspectLoader.is_package`, to fill in any missing information on the spec.
es: Una función de fábrica para crear una instancia de :class:`~importlib.machinery.ModuleSpec` basada en un cargador. Los parámetros tienen el mismo significado que para ModuleSpec. La función utiliza APIs disponibles de :term:`loader`, tal como :meth:`InspectLoader.is_package`, para completar cualquier información que falte en la especificación.

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on the path to a file. Missing information will be filled in on the spec by making use of loader APIs and by the implication that the module will be file-based.
es: Una función de fábrica para crear una instancia de :class:`~importlib.machinery.ModuleSpec` basada en la ruta a un archivo. La información que falte se completará en la especificación mediante el uso de las API de loader y la implicación de que el módulo estará basado en archivos.

source: Return the hash of *source_bytes* as bytes. A hash-based ``.pyc`` file embeds the :func:`source_hash` of the corresponding source file's contents in its header.
es: Retorna el hash de *source_bytes* como bytes. Un archivo ``.pyc`` basado en hash incrusta :func:`source_hash` del contenido del archivo fuente correspondiente en su encabezado.

source: A class which postpones the execution of the loader of a module until the module has an attribute accessed.
es: Una clase que pospone la ejecución del cargador de un módulo hasta que el módulo tiene acceso a un atributo.

source: This class **only** works with loaders that define :meth:`~importlib.abc.Loader.exec_module` as control over what module type is used for the module is required. For those same reasons, the loader's :meth:`~importlib.abc.Loader.create_module` method must return ``None`` or a type for which its ``__class__`` attribute can be mutated along with not using :term:`slots <__slots__>`. Finally, modules which substitute the object placed into :attr:`sys.modules` will not work as there is no way to properly replace the module references throughout the interpreter safely; :exc:`ValueError` is raised if such a substitution is detected.
es: Esta clase **solo** funciona con cargadores que definen :meth:`~importlib.abc.Loader.exec_module` ya que se requiere control sobre qué tipo de módulo se usa para el módulo. Por esas mismas razones, el método del cargador :meth:`~importlib.abc.Loader.create_module` debe retornar ``None`` o un tipo para el cual su atributo ``__class__`` se puede mutar junto con no usar :term:`slots <__slots__>`. Finalmente, los módulos que sustituyen el objeto colocado en :attr:`sys.modules` no funcionarán ya que no hay forma de reemplazar correctamente las referencias del módulo en todo el intérprete de forma segura; :exc:`ValueError` se genera si se detecta tal sustitución.

source: For projects where startup time is critical, this class allows for potentially minimizing the cost of loading a module if it is never used. For projects where startup time is not essential then use of this class is **heavily** discouraged due to error messages created during loading being postponed and thus occurring out of context.
es: Para proyectos donde el tiempo de inicio es crítico, esta clase permite minimizar potencialmente el costo de cargar un módulo si nunca se usa. Para proyectos en los que el tiempo de inicio no es esencial, el uso de esta clase se desaconseja **en gran medida** debido a que los mensajes de error creados durante la carga se posponen y, por lo tanto, ocurren fuera de contexto.

source: Began calling :meth:`~importlib.abc.Loader.create_module`, removing the compatibility warning for :class:`importlib.machinery.BuiltinImporter` and :class:`importlib.machinery.ExtensionFileLoader`.
es: Comenzó a llamar :meth:`~importlib.abc.Loader.create_module`, eliminando la advertencia de compatibilidad para :class:`importlib.machinery.BuiltinImporter` y :class:`importlib.machinery.ExtensionFileLoader`.

source: A static method which returns a callable that creates a lazy loader. This is meant to be used in situations where the loader is passed by class instead of by instance. ::
es: Un método estático que devuelve un invocable que crea un cargador diferido. Esto está destinado a utilizarse en situaciones en las que el cargador se pasa por clase en lugar de por instancia. ::

source: Examples
es: Ejemplos

source: Importing programmatically
es: Importar programáticamente

source: To programmatically import a module, use :func:`importlib.import_module`. ::
es: Para importar un módulo mediante programación, use :func:`importlib.import_module`. ::

source: Checking if a module can be imported
es: Comprobando si se puede importar un módulo

source: If you need to find out if a module can be imported without actually doing the import, then you should use :func:`importlib.util.find_spec`. ::
es: Si necesita averiguar si un módulo se puede importar sin realmente realizar la importación, entonces debe usar :func:`importlib.util.find_spec`. ::

source: Importing a source file directly
es: Importar un archivo fuente directamente

source: To import a Python source file directly, use the following recipe (Python 3.5 and newer only)::
es: Para importar un archivo fuente de Python directamente, use la siguiente receta (solo Python 3.5 y más reciente)::

source: Implementing lazy imports
es: Implementar importaciones diferidas

source: The example below shows how to implement lazy imports::
es: El ejemplo de abajo muestra cómo implementar importaciones diferidas::

source: Setting up an importer
es: Configurar un importador

source: For deep customizations of import, you typically want to implement an :term:`importer`. This means managing both the :term:`finder` and :term:`loader` side of things. For finders there are two flavours to choose from depending on your needs: a :term:`meta path finder` or a :term:`path entry finder`. The former is what you would put on :attr:`sys.meta_path` while the latter is what you create using a :term:`path entry hook` on :attr:`sys.path_hooks` which works with :attr:`sys.path` entries to potentially create a finder. This example will show you how to register your own importers so that import will use them (for creating an importer for yourself, read the documentation for the appropriate classes defined within this package)::
es: Para personalizaciones profundas de la importación, normalmente desea implementar un :term:`importador`. Esto significa administrar tanto el lado :term:`finder` como :term:`loader` de las cosas. Para los buscadores, hay dos sabores para elegir según sus necesidades: un :term:`meta path finder` o un :term:`path entry finder`. El primero es lo que pondrías en :attr:`sys.meta_path` mientras que el segundo es lo que creas usando un :term:`path entry hook` en :attr:`sys.path_hooks` que funciona con :attr:`sys .path` entradas para crear potencialmente un buscador. Este ejemplo le mostrará cómo registrar sus propios importadores para que import los utilice (para crear un importador para usted, lea la documentación de las clases apropiadas definidas dentro de este paquete):

source: Approximating :func:`importlib.import_module`
es: Aproximando :func:`importlib.import_module`

source: Import itself is implemented in Python code, making it possible to expose most of the import machinery through importlib. The following helps illustrate the various APIs that importlib exposes by providing an approximate implementation of :func:`importlib.import_module` (Python 3.4 and newer for the importlib usage, Python 3.6 and newer for other parts of the code). ::
es: La importación en sí está implementada en código Python, lo que permite exponer la mayor parte de la maquinaria de importación a través de importlib. Lo siguiente ayuda a ilustrar las diversas API que importlib expone al proporcionar una implementación aproximada de :func:`importlib.import_module` (Python 3.4 y más reciente para el uso de importlib, Python 3.6 y más reciente para otras partes del código). ::
