Repository: python/python-docs-es
Catalog: library/importlib.po
Languages: es

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :meth:`importlib.machinery.PathFinder.invalidate_caches` when invalidating the caches of all cached finders.
es: Un método opcional que, cuando se llama, debería invalidar cualquier caché interno utilizado por el buscador. Usado por :meth:`importlib.machinery.PathFinder.invalidate_caches` al invalidar las cachés de todos los buscadores en caché.

source: An abstract base class for a :term:`loader`. See :pep:`302` for the exact definition for a loader.
es: Una clase base abstracta para un :term:`loader`. Consulte :pep:`302` para obtener la definición exacta de cargador.

source: Loaders that wish to support resource reading should implement a ``get_resource_reader(fullname)`` method as specified by :class:`importlib.abc.ResourceReader`.
es: Los cargadores que deseen admitir la lectura de recursos deben implementar un método ``get_resource_reader(fullname)`` según lo especificado por :class:`importlib.abc.ResourceReader`.

source: Introduced the optional ``get_resource_reader()`` method.
es: Introdujo el método opcional ``get_resource_reader()``.

source: A method that returns the module object to use when importing a module. This method may return ``None``, indicating that default module creation semantics should take place.
es: Un método que retorna el objeto de módulo que se utilizará al importar un módulo. Este método puede retornar ``None``, lo que indica que se debe llevar a cabo la semántica de creación de módulos predeterminada.

source: Starting in Python 3.6, this method will not be optional when :meth:`exec_module` is defined.
es: A partir de Python 3.6, este método no será opcional cuando se defina :meth:`exec_module`.

source: An abstract method that executes the module in its own namespace when a module is imported or reloaded. The module should already be initialized when ``exec_module()`` is called. When this method exists, :meth:`~importlib.abc.Loader.create_module` must be defined.
es: Un método abstracto que ejecuta el módulo en su propio espacio de nombres cuando se importa o se vuelve a cargar un módulo. El módulo ya debería estar inicializado cuando se llama a ``exec_module()``. Cuando existe este método, se debe definir :meth:`~importlib.abc.Loader.create_module`.

source: :meth:`~importlib.abc.Loader.create_module` must also be defined.
es: :meth:`~importlib.abc.Loader.create_module` también debe definirse.

source: A legacy method for loading a module. If the module cannot be loaded, :exc:`ImportError` is raised, otherwise the loaded module is returned.
es: Un método heredado para cargar un módulo. Si el módulo no se puede cargar, se lanza :exc:`ImportError`; de lo contrario, se retorna el módulo cargado.

source: If the requested module already exists in :data:`sys.modules`, that module should be used and reloaded. Otherwise the loader should create a new module and insert it into :data:`sys.modules` before any loading begins, to prevent recursion from the import. If the loader inserted a module and the load fails, it must be removed by the loader from :data:`sys.modules`; modules already in :data:`sys.modules` before the loader began execution should be left alone (see :func:`importlib.util.module_for_loader`).
es: Si el módulo solicitado ya existe en :data:`sys.modules`, ese módulo debe usarse y recargarse. De lo contrario, el cargador debe crear un nuevo módulo e insertarlo en :data:`sys.modules` antes de que comience la carga, para evitar la recursividad de la importación. Si el cargador insertó un módulo y la carga falla, el cargador debe eliminarlo de :data:`sys.modules`; los módulos que ya están en :data:`sys.modules` antes de que el cargador comenzara a ejecutarse deben dejarse en paz (ver :func:`importlib.util.module_for_loader`).

source: The loader should set several attributes on the module. (Note that some of these attributes can change when a module is reloaded):
es: El cargador debe establecer varios atributos en el módulo. (Tenga en cuenta que algunos de estos atributos pueden cambiar cuando se recarga un módulo):

source: The name of the module.
es: El nombre del módulo.

source: The path to where the module data is stored (not set for built-in modules).
es: La ruta hacia donde se almacenan los datos del módulo (no configurada para módulos integrados).

source: The path to where a compiled version of the module is/should be stored (not set when the attribute would be inappropriate).
es: La ruta a la que se debe almacenar una versión compilada del módulo (no se establece cuando el atributo sería inapropiado).

source: A list of strings specifying the search path within a package. This attribute is not set on modules.
es: Una lista de cadenas de caracteres que especifican la ruta de búsqueda dentro de un paquete. Este atributo no se establece en módulos.

source: The fully-qualified name of the package under which the module was loaded as a submodule (or the empty string for top-level modules). For packages, it is the same as :attr:`__name__`. The :func:`importlib.util.module_for_loader` decorator can handle the details for :attr:`__package__`.
es: El nombre completo del paquete bajo el cual se cargó el módulo como submódulo (o la cadena de caracteres vacía para los módulos de nivel superior). Para los paquetes, es lo mismo que :attr:`__name__`. El decorador :func:`importlib.util.module_for_loader` puede manejar los detalles de :attr:`__package__`.

source: The loader used to load the module. The :func:`importlib.util.module_for_loader` decorator can handle the details for :attr:`__package__`.
es: El cargador utilizado para cargar el módulo. El decorador :func:`importlib.util.module_for_loader` puede manejar los detalles de :attr:`__package__`.

source: When :meth:`exec_module` is available then backwards-compatible functionality is provided.
es: Cuando :meth:`exec_module` está disponible, se proporciona una funcionalidad compatible con versiones anteriores.

source: Raise :exc:`ImportError` when called instead of :exc:`NotImplementedError`. Functionality provided when :meth:`exec_module` is available.
es: Lanza :exc:`ImportError` cuando se llama en lugar de :exc:`NotImplementedError`. Funcionalidad proporcionada cuando :meth:`exec_module` está disponible.

source: The recommended API for loading a module is :meth:`exec_module` (and :meth:`create_module`). Loaders should implement it instead of load_module(). The import machinery takes care of all the other responsibilities of load_module() when exec_module() is implemented.
es: La API recomendada para cargar un módulo es :meth:`exec_module` (y :meth:`create_module`). Los cargadores deberían implementarlo en lugar de load_module(). La maquinaria de importación se encarga de todas las demás responsabilidades de load_module() cuando se implementa exec_module().

source: A legacy method which when implemented calculates and returns the given module's repr, as a string. The module type's default repr() will use the result of this method as appropriate.
es: Un método heredado que, cuando se implementa, calcula y retorna la repr del módulo dado, como una cadena. El repr() predeterminado del tipo de módulo utilizará el resultado de este método según corresponda.

source: Made optional instead of an abstractmethod.
es: Hecho opcional en vez de un método abstracto (*abstractmethod*)

source: The import machinery now takes care of this automatically.
es: La maquinaria de importación ahora se encarga de esto automáticamente.

source: *Superseded by TraversableResources*
es: *Reemplazada por TraversableResources*

source: An :term:`abstract base class` to provide the ability to read *resources*.
es: Un :term:`abstract base class` para proporcionar la capacidad de leer *resources*.

source: From the perspective of this ABC, a *resource* is a binary artifact that is shipped within a package. Typically this is something like a data file that lives next to the ``__init__.py`` file of the package. The purpose of this class is to help abstract out the accessing of such data files so that it does not matter if the package and its data file(s) are stored in a e.g. zip file versus on the file system.
es: Desde la perspectiva de este ABC, un *resource* es un artefacto binario que se envía dentro de un paquete. Por lo general, esto es algo así como un archivo de datos que se encuentra junto al archivo ``__init__.py`` del paquete. El propósito de esta clase es ayudar a abstraer el acceso a dichos archivos de datos de modo que no importe si el paquete y sus archivos de datos se almacenan en un, por ejemplo, zip en comparación con el sistema de archivos.

source: For any of methods of this class, a *resource* argument is expected to be a :term:`path-like object` which represents conceptually just a file name. This means that no subdirectory paths should be included in the *resource* argument. This is because the location of the package the reader is for, acts as the "directory". Hence the metaphor for directories and file names is packages and resources, respectively. This is also why instances of this class are expected to directly correlate to a specific package (instead of potentially representing multiple packages or a module).
es: Para cualquiera de los métodos de esta clase, se espera que un argumento *resource* sea un :term:`path-like object` que representa conceptualmente solo un nombre de archivo. Esto significa que no se deben incluir rutas de subdirectorio en el argumento *resource*. Esto se debe a que la ubicación del paquete para el que está ubicado el lector actúa como el "directorio". Por lo tanto, la metáfora de los directorios y los nombres de los archivos son los paquetes y los recursos, respectivamente. Esta es también la razón por la que se espera que las instancias de esta clase se correlacionen directamente con un paquete específico (en lugar de representar potencialmente varios paquetes o un módulo).

source: Loaders that wish to support resource reading are expected to provide a method called ``get_resource_reader(fullname)`` which returns an object implementing this ABC's interface. If the module specified by fullname is not a package, this method should return :const:`None`. An object compatible with this ABC should only be returned when the specified module is a package.
es: Se espera que los cargadores que deseen admitir la lectura de recursos proporcionen un método llamado ``get_resource_reader(fullname)`` que retorna un objeto que implementa la interfaz de este ABC. Si el módulo especificado por fullname no es un paquete, este método debería devolver :const:`None`. Un objeto compatible con este ABC solo debe retornarse cuando el módulo especificado es un paquete.

source: Returns an opened, :term:`file-like object` for binary reading of the *resource*.
es: Retorna un, :term:`file-like object` abierto para la lectura binaria del *resource*.

source: If the resource cannot be found, :exc:`FileNotFoundError` is raised.
es: Si no se puede encontrar el recurso, se lanza :exc:`FileNotFoundError`.

source: Returns the file system path to the *resource*.
es: Retorna la ruta del sistema de archivos al *resource*.

source: If the resource does not concretely exist on the file system, raise :exc:`FileNotFoundError`.
es: Si el recurso no existe concretamente en el sistema de archivos, lanza :exc:`FileNotFoundError`.

source: Returns ``True`` if the named *name* is considered a resource. :exc:`FileNotFoundError` is raised if *name* does not exist.
es: Retorna ``True`` si el *name* nombrado se considera un recurso. :exc:`FileNotFoundError` se lanza si *name* no existe.

source: Returns an :term:`iterable` of strings over the contents of the package. Do note that it is not required that all names returned by the iterator be actual resources, e.g. it is acceptable to return names for which :meth:`is_resource` would be false.
es: Retorna un :term:`iterable` de cadenas de caracteres sobre el contenido del paquete. Tenga en cuenta que no es necesario que todos los nombres retornados por el iterador sean recursos reales, por ejemplo, es aceptable retornar nombres para los que :meth:`is_resource` sería falso.

source: Allowing non-resource names to be returned is to allow for situations where how a package and its resources are stored are known a priori and the non-resource names would be useful. For instance, returning subdirectory names is allowed so that when it is known that the package and resources are stored on the file system then those subdirectory names can be used directly.
es: Al permitir que se retornen nombres que no son de recursos es para permitir situaciones en las que se conoce a priori cómo se almacenan un paquete y sus recursos y los nombres que no son de recursos serían útiles. Por ejemplo, se permite el retorno de nombres de subdirectorios para que cuando se sepa que el paquete y los recursos están almacenados en el sistema de archivos, esos nombres de subdirectorios se puedan usar directamente.

source: The abstract method returns an iterable of no items.
es: El método abstracto retorna un iterable de ningún elemento.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loading arbitrary resources from the storage back-end.
es: Una clase base abstracta para un :term:`loader` que implementa el protocolo opcional :pep:`302` para cargar recursos arbitrarios desde el back-end de almacenamiento.

source: This ABC is deprecated in favour of supporting resource loading through :class:`importlib.abc.ResourceReader`.
es: Este ABC está en desuso a favor de admitir la carga de recursos a través de :class:`importlib.abc.ResourceReader`.

source: An abstract method to return the bytes for the data located at *path*. Loaders that have a file-like storage back-end that allows storing arbitrary data can implement this abstract method to give direct access to the data stored. :exc:`OSError` is to be raised if the *path* cannot be found. The *path* is expected to be constructed using a module's :attr:`__file__` attribute or an item from a package's :attr:`__path__`.
es: Un método abstracto para devolver los bytes de los datos ubicados en *path*. Los cargadores que tienen un back-end de almacenamiento similar a un archivo que permite almacenar datos arbitrarios pueden implementar este método abstracto para dar acceso directo a los datos almacenados. :exc:`OSError` se lanza si no se puede encontrar el *path*. Se espera que la *path* se construya utilizando el atributo :attr:`__file__` de un módulo o un elemento de un paquete :attr:`__path__`.

source: Raises :exc:`OSError` instead of :exc:`NotImplementedError`.
es: Lanza :exc:`OSError` en vez de :exc:`NotImplementedError`.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loaders that inspect modules.
es: Una clase base abstracta para un :term:`loader` que implementa el protocolo opcional :pep:`302` para cargadores que inspeccionan módulos.

source: Return the code object for a module, or ``None`` if the module does not have a code object (as would be the case, for example, for a built-in module). Raise an :exc:`ImportError` if loader cannot find the requested module.
es: Retorna el objeto código para un módulo, o ``None`` si el módulo no tiene un objeto código (como sería el caso, por ejemplo, para un módulo integrado). Lanza un :exc:`ImportError` si el cargador no puede encontrar el módulo solicitado.

source: While the method has a default implementation, it is suggested that it be overridden if possible for performance.
es: Si bien el método tiene una implementación predeterminada, se sugiere que se anule si es posible para mejorar el rendimiento.

source: No longer abstract and a concrete implementation is provided.
es: Ya no es un método abstracto y se proporciona una implementación concreta.

source: An abstract method to return the source of a module. It is returned as a text string using :term:`universal newlines`, translating all recognized line separators into ``'\n'`` characters. Returns ``None`` if no source is available (e.g. a built-in module). Raises :exc:`ImportError` if the loader cannot find the module specified.
es: Un método abstracto para retornar la fuente de un módulo. Se retorna como una cadena de caracteres de texto usando :term:`universal newlines`, traduciendo todos los separadores de línea reconocidos en caracteres ``' '``. Retorna ``None`` si no hay una fuente disponible (por ejemplo, un módulo integrado). Lanza :exc:`ImportError` si el cargador no puede encontrar el módulo especificado.

source: Raises :exc:`ImportError` instead of :exc:`NotImplementedError`.
es: Lanza :exc:`ImportError` en vez de :exc:`NotImplementedError`.

source: An optional method to return a true value if the module is a package, a false value otherwise. :exc:`ImportError` is raised if the :term:`loader` cannot find the module.
es: Un método opcional para retornar un valor verdadero si el módulo es un paquete, un valor falso en caso contrario. Se lanza :exc:`ImportError` si el :term:`cargador <loader>` no puede encontrar el módulo.

source: Create a code object from Python source.
es: Cree un objeto de código a partir de la fuente de Python.

source: The *data* argument can be whatever the :func:`compile` function supports (i.e. string or bytes). The *path* argument should be the "path" to where the source code originated from, which can be an abstract concept (e.g. location in a zip file).
es: El argumento *data* puede ser cualquier cosa que admita la función :func:`compile` (es decir, cadena de caracteres o bytes). El argumento *path* debe ser la "ruta" de donde se originó el código fuente, que puede ser un concepto abstracto (por ejemplo, ubicación en un archivo zip).

source: With the subsequent code object one can execute it in a module by running ``exec(code, module.__dict__)``.
es: Con el objeto de código subsiguiente, uno puede ejecutarlo en un módulo ejecutando ``exec(code, module.__dict__)``.

source: Made the method static.
es: Hace el método estático.

source: Implementation of :meth:`Loader.exec_module`.
es: Implementación de :meth:`Loader.exec_module`.

source: Implementation of :meth:`Loader.load_module`.
es: Implementación de :meth:`Loader.load_module`.

source: use :meth:`exec_module` instead.
es: use :meth:`exec_module` en su lugar.

source: An abstract base class which inherits from :class:`InspectLoader` that, when implemented, helps a module to be executed as a script. The ABC represents an optional :pep:`302` protocol.
es: Una clase base abstracta que hereda de :class:`InspectLoader` que, cuando se implementa, ayuda a que un módulo se ejecute como un script. El ABC representa un protocolo opcional :pep:`302`.

source: An abstract method that is to return the value of :attr:`__file__` for the specified module. If no path is available, :exc:`ImportError` is raised.
es: Un método abstracto que retorna el valor de :attr:`__file__` para el módulo especificado. Si no hay una ruta disponible, se lanza :exc:`ImportError`.

source: If source code is available, then the method should return the path to the source file, regardless of whether a bytecode was used to load the module.
es: Si el código fuente está disponible, entonces el método debe devolver la ruta al archivo fuente, independientemente de si se utilizó un código de bytes para cargar el módulo.

source: An abstract base class which inherits from :class:`ResourceLoader` and :class:`ExecutionLoader`, providing concrete implementations of :meth:`ResourceLoader.get_data` and :meth:`ExecutionLoader.get_filename`.
es: Una clase base abstracta que hereda de :class:`ResourceLoader` y :class:`ExecutionLoader`, proporcionando implementaciones concretas de :meth:`ResourceLoader.get_data` y :meth:`ExecutionLoader.get_filename`.

source: The *fullname* argument is a fully resolved name of the module the loader is to handle. The *path* argument is the path to the file for the module.
es: El argumento *fullname* es un nombre completamente resuelto del módulo que el cargador debe manejar. El argumento *path* es la ruta al archivo del módulo.

source: The name of the module the loader can handle.
es: El nombre del módulo que puede manejar el cargador.

source: Path to the file of the module.
es: Ruta al archivo del módulo.

source: Calls super's ``load_module()``.
es: Llama a super's ``load_module()``.

source: Use :meth:`Loader.exec_module` instead.
es: Utilice :meth:`Loader.exec_module` en su lugar.

source: Returns :attr:`path`.
es: Retorna :attr:`path`.

source: Reads *path* as a binary file and returns the bytes from it.
es: Lee *path* como un archivo binario y devuelve los bytes de él.

source: An abstract base class for implementing source (and optionally bytecode) file loading. The class inherits from both :class:`ResourceLoader` and :class:`ExecutionLoader`, requiring the implementation of:
es: Una clase base abstracta para implementar la carga de archivos fuente (y opcionalmente bytecode). La clase hereda tanto de :class:`ResourceLoader` como de :class:`ExecutionLoader`, lo que requiere la implementación de:

source: Should only return the path to the source file; sourceless loading is not supported.
es: Solo debe devolver la ruta al archivo de origen; la carga sin fuente no es compatible.

source: The abstract methods defined by this class are to add optional bytecode file support. Not implementing these optional methods (or causing them to raise :exc:`NotImplementedError`) causes the loader to only work with source code. Implementing the methods allows the loader to work with source *and* bytecode files; it does not allow for *sourceless* loading where only bytecode is provided. Bytecode files are an optimization to speed up loading by removing the parsing step of Python's compiler, and so no bytecode-specific API is exposed.
es: Los métodos abstractos definidos por esta clase son para agregar soporte de archivo de código de bytes opcional. No implementar estos métodos opcionales (o hacer que se lance :exc:`NotImplementedError`) hace que el cargador solo funcione con el código fuente. La implementación de los métodos permite que el cargador trabaje con archivos fuente *y* código de bytes; no permite la carga *sin fuente* donde solo se proporciona un código de bytes. Los archivos de código de bytes son una optimización para acelerar la carga al eliminar el paso de análisis del compilador de Python, por lo que no se expone ninguna API específica de código de bytes.

source: Optional abstract method which returns a :class:`dict` containing metadata about the specified path. Supported dictionary keys are:
es: Método abstracto opcional que devuelve un :class:`dict` que contiene metadatos sobre la ruta especificada. Las claves de diccionario admitidas son:

source: ``'mtime'`` (mandatory): an integer or floating-point number representing the modification time of the source code;
es: ``'mtime'`` (obligatorio): un número entero o de punto flotante que representa la hora de modificación del código fuente;

source: ``'size'`` (optional): the size in bytes of the source code.
es: ``'size'`` (opcional): el tamaño en bytes del código fuente.

source: Any other keys in the dictionary are ignored, to allow for future extensions. If the path cannot be handled, :exc:`OSError` is raised.
es: Cualquier otra clave del diccionario se ignora para permitir futuras extensiones. Si no se puede manejar la ruta, se genera :exc:`OSError`.

source: Raise :exc:`OSError` instead of :exc:`NotImplementedError`.
es: Lanza :exc:`OSError` en vez de :exc:`NotImplementedError`.

source: Optional abstract method which returns the modification time for the specified path.
es: Método abstracto opcional que retorna la hora de modificación de la ruta especificada.
