Repository: python/python-docs-es
Catalog: library/importlib.po
Languages: es

source: This method is deprecated in favour of :meth:`path_stats`. You don't have to implement it, but it is still available for compatibility purposes. Raise :exc:`OSError` if the path cannot be handled.
es: Este método está obsoleto en favor de :meth:`path_stats`. No tiene que implementarlo, pero aún está disponible para fines de compatibilidad. Lanza :exc:`OSError` si la ruta no se puede manejar.

source: Optional abstract method which writes the specified bytes to a file path. Any intermediate directories which do not exist are to be created automatically.
es: Método abstracto opcional que escribe los bytes especificados en una ruta de archivo. Los directorios intermedios que no existan se crearán automáticamente.

source: When writing to the path fails because the path is read-only (:attr:`errno.EACCES`/:exc:`PermissionError`), do not propagate the exception.
es: Cuando la escritura en la ruta falla porque la ruta es de solo lectura (:attr:`errno.EACCES`/:exc:`PermissionError`), no propague la excepción.

source: No longer raises :exc:`NotImplementedError` when called.
es: Ya no lanza :exc:`NotImplementedError` cuando se llama.

source: Concrete implementation of :meth:`InspectLoader.get_code`.
es: Implementación concreta de :meth:`InspectLoader.get_code`.

source: Concrete implementation of :meth:`Loader.exec_module`.
es: Implementación concreta de :meth:`Loader.exec_module`.

source: Concrete implementation of :meth:`Loader.load_module`.
es: Implementación concreta de :meth:`Loader.load_module`.

source: Use :meth:`exec_module` instead.
es: Utilice :meth:`exec_module` en su lugar.

source: Concrete implementation of :meth:`InspectLoader.get_source`.
es: Implementación concreta de :meth:`InspectLoader.get_source`.

source: Concrete implementation of :meth:`InspectLoader.is_package`. A module is determined to be a package if its file path (as provided by :meth:`ExecutionLoader.get_filename`) is a file named ``__init__`` when the file extension is removed **and** the module name itself does not end in ``__init__``.
es: Implementación concreta de :meth:`InspectLoader.is_package`. Se determina que un módulo es un paquete si su ruta de archivo (proporcionada por :meth:`ExecutionLoader.get_filename`) es un archivo llamado ``__init__`` cuando se elimina la extensión del archivo **y** el nombre del módulo sí lo hace no termina en ``__init__``.

source: An object with a subset of pathlib.Path methods suitable for traversing directories and opening files.
es: Un objeto con un subconjunto de métodos pathlib.Path adecuados para recorrer directorios y abrir archivos.

source: An abstract base class for resource readers capable of serving the ``files`` interface. Subclasses ResourceReader and provides concrete implementations of the ResourceReader's abstract methods. Therefore, any loader supplying TraversableReader also supplies ResourceReader.
es: Una clase base abstracta para lectores de recursos capaz de servir la interfaz de ``files``. Subclases ResourceReader y proporciona implementaciones concretas de los métodos abstractos de ResourceReader. Por lo tanto, cualquier cargador que suministre TraversableReader también suministra ResourceReader.

source: Loaders that wish to support resource reading are expected to implement this interface.
es: Se espera que los cargadores que deseen admitir la lectura de recursos implementen esta interfaz.

source: :mod:`importlib.resources` -- Resources
es: :mod:`importlib.resources` -- Recursos

source: **Source code:** :source:`Lib/importlib/resources.py`
es: **Código fuente:** :source:`Lib/importlib/resources.py`

source: This module leverages Python's import system to provide access to *resources* within *packages*. If you can import a package, you can access resources within that package. Resources can be opened or read, in either binary or text mode.
es: Este módulo aprovecha el sistema de importación de Python para proporcionar acceso a *resources* dentro de *packages*. Si puede importar un paquete, puede acceder a los recursos dentro de ese paquete. Los recursos se pueden abrir o leer, ya sea en modo binario o texto.

source: Resources are roughly akin to files inside directories, though it's important to keep in mind that this is just a metaphor. Resources and packages **do not** have to exist as physical files and directories on the file system.
es: Los recursos son similares a los archivos dentro de los directorios, aunque es importante tener en cuenta que esto es solo una metáfora. Los recursos y paquetes **no** tienen que existir como archivos y directorios físicos en el sistema de archivos.

source: This module provides functionality similar to `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <http://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ without the performance overhead of that package. This makes reading resources included in packages easier, with more stable and consistent semantics.
es: Este módulo proporciona una funcionalidad similar a `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Acceso Básico a Recursos <http://setuptools.readthedocs.io/en/latest/pkg_resources. html#basic-resource-access>`_ sin la sobrecarga de rendimiento de ese paquete. Esto facilita la lectura de los recursos incluidos en los paquetes, con una semántica más estable y coherente.

source: The standalone backport of this module provides more information on `using importlib.resources <http://importlib-resources.readthedocs.io/en/latest/using.html>`_ and `migrating from pkg_resources to importlib.resources <http://importlib-resources.readthedocs.io/en/latest/migration.html>`_.
es: El backport independiente de este módulo proporciona más información sobre `usar importlib.resources <http://importlib-resources.readthedocs.io/en/latest/using.html>`_ y `migrar desde pkg_resources a importlib.resources <http: //importlib-resources.readthedocs.io/en/latest/migration.html>`_.

source: The following types are defined.
es: Se definen los siguientes tipos.

source: The ``Package`` type is defined as ``Union[str, ModuleType]``. This means that where the function describes accepting a ``Package``, you can pass in either a string or a module. Module objects must have a resolvable ``__spec__.submodule_search_locations`` that is not ``None``.
es: El tipo ``Package`` se define como ``Union[str, ModuleType]``. Esto significa que cuando la función describe la aceptación de un ``Package``, puede pasar una cadena de caracteres o un módulo. Los objetos de módulo deben tener un ``__spec__.submodule_search_locations`` que se pueda resolver que no sea ``None``.

source: This type describes the resource names passed into the various functions in this package. This is defined as ``Union[str, os.PathLike]``.
es: Este tipo describe los nombres de los recursos que se pasan a las distintas funciones de este paquete. Esto se define como ``Union[str, os.PathLike]``.

source: The following functions are available.
es: Están disponibles las siguientes funciones.

source: Returns an :class:`importlib.resources.abc.Traversable` object representing the resource container for the package (think directory) and its resources (think files). A Traversable may contain other containers (think subdirectories).
es: Retorna un objeto :class:`importlib.resources.abc.Traversable` que representa el contenedor de recursos para el paquete (directorio think) y sus recursos (archivos think). Un Traversable puede contener otros contenedores (subdirectorios think).

source: *package* is either a name or a module object which conforms to the ``Package`` requirements.
es: *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``.

source: Given a :class:`importlib.resources.abc.Traversable` object representing a file, typically from :func:`importlib.resources.files`, return a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
es: Dado un objeto :class:`importlib.resources.abc.Traversable` que representa un archivo, típicamente de :func:`importlib.resources.files`, retorna un gestor de contexto para su uso en una sentencia :keyword:`with`. El gestor de contexto proporciona un objeto :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file created when the resource was extracted from e.g. a zip file.
es: Salir del gestor de contexto limpia cualquier archivo temporal creado cuando se extrajo el recurso de, por ejemplo, un archivo zip.

source: Use ``as_file`` when the Traversable methods (``read_text``, etc) are insufficient and an actual file on the file system is required.
es: Use ``as_file` cuando los métodos Traversable (``read_text``, etc) sean insuficientes y se requiera un archivo real en el sistema de archivos.

source: Open for binary reading the *resource* within *package*.
es: Abra para lectura binaria el *resource* dentro del *package*.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). This function returns a ``typing.BinaryIO`` instance, a binary I/O stream open for reading.
es: *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``. *resource* es el nombre del recurso a abrir dentro de *package*; puede que no contenga separadores de ruta y puede que no tenga sub-recursos (es decir, no puede ser un directorio). Esta función retorna una instancia de ``typing.BinaryIO``, un flujo de E/S binario abierto para lectura.

source: Open for text reading the *resource* within *package*. By default, the resource is opened for reading as UTF-8.
es: Se abre para leer el texto del *resource* dentro del *package*. De forma predeterminada, el recurso está abierto para lectura como UTF-8.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). *encoding* and *errors* have the same meaning as with built-in :func:`open`.
es: *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``. *resource* es el nombre del recurso a abrir dentro de *package*; puede que no contenga separadores de ruta y puede que no tenga sub-recursos (es decir, no puede ser un directorio). *encoding* y *errors* tienen el mismo significado que con la función integrada :func:`open`.

source: This function returns a ``typing.TextIO`` instance, a text I/O stream open for reading.
es: Esta función retorna una instancia de ``typing.TextIO``, un flujo de E/S de texto abierto para lectura.

source: Read and return the contents of the *resource* within *package* as ``bytes``.
es: Lee y retorna el contenido del *resource* dentro del *package* como ``bytes``.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). This function returns the contents of the resource as :class:`bytes`.
es: *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``. *resource* es el nombre del recurso a abrir dentro de *package*; puede que no contenga separadores de ruta y puede que no tenga sub-recursos (es decir, no puede ser un directorio). Esta función retorna el contenido del recurso como :class:`bytes`.

source: Read and return the contents of *resource* within *package* as a ``str``. By default, the contents are read as strict UTF-8.
es: Lee y retorna el contenido de *resource* dentro de *package* como un ``str``. De forma predeterminada, los contenidos se leen como UTF-8 estricto.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). *encoding* and *errors* have the same meaning as with built-in :func:`open`. This function returns the contents of the resource as :class:`str`.
es: *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``. *resource* es el nombre del recurso a abrir dentro de *package*; puede que no contenga separadores de ruta y puede que no tenga sub-recursos (es decir, no puede ser un directorio). *encoding* y *errors* tienen el mismo significado que con la función integrada :func:`open`. Esta función retorna el contenido del recurso como :class:`str`.

source: Return the path to the *resource* as an actual file system path. This function returns a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
es: Retorna la ruta al *resource* como una ruta real del sistema de archivos. Esta función retorna un administrador de contexto para usar en una declaración :keyword:`with`. El administrador de contexto proporciona un objeto :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file created when the resource needs to be extracted from e.g. a zip file.
es: Salir del administrador de contexto limpia cualquier archivo temporal creado cuando el recurso necesita ser extraído, por ejemplo, un archivo zip.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory).
es: *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``. *resource* es el nombre del recurso a abrir dentro de *package*; puede que no contenga separadores de ruta y puede que no tenga sub-recursos (es decir, no puede ser un directorio).

source: Return ``True`` if there is a resource named *name* in the package, otherwise ``False``. Remember that directories are *not* resources! *package* is either a name or a module object which conforms to the ``Package`` requirements.
es: Retorna ``True`` si hay un recurso llamado *name* en el paquete; de lo contrario, ``False``. ¡Recuerde que los directorios *no* son recursos! *package* es un nombre o un objeto de módulo que cumple con los requisitos de ``Package``.

source: Return an iterable over the named items within the package. The iterable returns :class:`str` resources (e.g. files) and non-resources (e.g. directories). The iterable does not recurse into subdirectories.
es: Retorna un iterable sobre los elementos nombrados dentro del paquete. El iterable retorna recursos :class:`str` (por ejemplo, archivos) y no-recursos (por ejemplo, directorios). El iterable no recurre a subdirectorios.

source: :mod:`importlib.machinery` -- Importers and path hooks
es: :mod:`importlib.machinery` -- Importadores y enlaces de ruta

source: **Source code:** :source:`Lib/importlib/machinery.py`
es: **Código fuente:** :source:`Lib/importlib/machinery.py`

source: This module contains the various objects that help :keyword:`import` find and load modules.
es: Este módulo contiene varios objetos que ayudan :keyword:`import` buscar y cargar módulos.

source: A list of strings representing the recognized file suffixes for source modules.
es: Una lista de cadenas de caracteres que representan los sufijos de archivo reconocidos para los módulos de origen.

source: A list of strings representing the file suffixes for non-optimized bytecode modules.
es: Una lista de cadenas que representan los sufijos de archivo para módulos de código de bytes no optimizados.

source: Use :attr:`BYTECODE_SUFFIXES` instead.
es: Utilice :attr:`BYTECODE_SUFFIXES` en su lugar.

source: A list of strings representing the file suffixes for optimized bytecode modules.
es: Una lista de cadenas de caracteres que representan los sufijos de archivo para módulos de código de bytes optimizados.

source: A list of strings representing the recognized file suffixes for bytecode modules (including the leading dot).
es: Una lista de cadenas de caracteres que representan los sufijos de archivo reconocidos para los módulos de código de bytes (incluido el punto inicial).

source: The value is no longer dependent on ``__debug__``.
es: El valor ya no depende de ``__debug__``.

source: A list of strings representing the recognized file suffixes for extension modules.
es: Una lista de cadenas de caracteres que representan los sufijos de archivo reconocidos para los módulos de extensión.

source: Returns a combined list of strings representing all file suffixes for modules recognized by the standard import machinery. This is a helper for code which simply needs to know if a filesystem path potentially refers to a module without needing any details on the kind of module (for example, :func:`inspect.getmodulename`).
es: Retorna una lista combinada de cadenas de caracteres que representan todos los sufijos de archivo para módulos reconocidos por la maquinaria de importación estándar. Este es un ayudante para el código que simplemente necesita saber si una ruta del sistema de archivos potencialmente se refiere a un módulo sin necesidad de detalles sobre el tipo de módulo (por ejemplo, :func:`inspect.getmodulename`).

source: An :term:`importer` for built-in modules. All known built-in modules are listed in :data:`sys.builtin_module_names`. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
es: Un :term:`importer` para módulos integrados. Todos los módulos integrados conocidos se enumeran en :data:`sys.builtin_module_names`. Esta clase implementa los ABC :class:`importlib.abc.MetaPathFinder` y :class:`importlib.abc.InspectLoader`.

source: Only class methods are defined by this class to alleviate the need for instantiation.
es: Esta clase solo define los métodos de clase para aliviar la necesidad de instanciación.

source: As part of :pep:`489`, the builtin importer now implements :meth:`Loader.create_module` and :meth:`Loader.exec_module`
es: Como parte de :pep:`489`, el importador integrado ahora implementa :meth:`Loader.create_module` y :meth:`Loader.exec_module`

source: An :term:`importer` for frozen modules. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
es: Un :term:`importer` para módulos congelados. Esta clase implementa los ABC :class:`importlib.abc.MetaPathFinder` y :class:`importlib.abc.InspectLoader`.

source: Gained :meth:`~Loader.create_module` and :meth:`~Loader.exec_module` methods.
es: Métodos obtenidos :meth:`~Loader.create_module` y :meth:`~Loader.exec_module`.

source: :term:`Finder <finder>` for modules declared in the Windows registry. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
es: :term:`Finder <finder>` para los módulos declarados en el registro de Windows. Esta clase implementa el :class:`importlib.abc.MetaPathFinder` ABC.

source: Use :mod:`site` configuration instead. Future versions of Python may not enable this finder by default.
es: Utilice la configuración de :mod:`site` en su lugar. Es posible que las versiones futuras de Python no habiliten este buscador de forma predeterminada.

source: A :term:`Finder <finder>` for :data:`sys.path` and package ``__path__`` attributes. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
es: Un :term:`Finder <finder>` para :data:`sys.path` y atributos del paquete ``__path__``. Esta clase implementa el :class:`importlib.abc.MetaPathFinder` ABC.

source: Class method that attempts to find a :term:`spec <module spec>` for the module specified by *fullname* on :data:`sys.path` or, if defined, on *path*. For each path entry that is searched, :data:`sys.path_importer_cache` is checked. If a non-false object is found then it is used as the :term:`path entry finder` to look for the module being searched for. If no entry is found in :data:`sys.path_importer_cache`, then :data:`sys.path_hooks` is searched for a finder for the path entry and, if found, is stored in :data:`sys.path_importer_cache` along with being queried about the module. If no finder is ever found then ``None`` is both stored in the cache and returned.
es: Método de clase que intenta encontrar un :term:`spec <module spec>` para el módulo especificado por *fullname* en :data:`sys.path` o, si está definido, en *path*. Para cada entrada de ruta que se busca, se comprueba :data:`sys.path_importer_cache`. Si se encuentra un objeto que no es falso, se utiliza como :term:`path entry finder` para buscar el módulo que se está buscando. Si no se encuentra ninguna entrada en :data:`sys.path_importer_cache`, entonces :data:`sys.path_hooks` se busca un buscador para la entrada de ruta y, si se encuentra, se almacena en :data:`sys.path_importer_cache` junto con ser consultado sobre el módulo. Si nunca se encuentra ningún buscador, entonces ``None`` se almacena en el caché y se retorna.

source: If the current working directory -- represented by an empty string -- is no longer valid then ``None`` is returned but no value is cached in :data:`sys.path_importer_cache`.
es: Si el directorio de trabajo actual, representado por una cadena de caracteres vacía, ya no es válido, se retorna``None`` pero no se almacena ningún valor en :data:`sys.path_importer_cache`.

source: A legacy wrapper around :meth:`find_spec`.
es: Una envoltura heredada alrededor de :meth:`find_spec`.

source: Calls :meth:`importlib.abc.PathEntryFinder.invalidate_caches` on all finders stored in :data:`sys.path_importer_cache` that define the method. Otherwise entries in :data:`sys.path_importer_cache` set to ``None`` are deleted.
es: Llama :meth:`importlib.abc.PathEntryFinder.invalidate_caches` en todos los buscadores almacenados en :data:`sys.path_importer_cache` que definen el método. De lo contrario, las entradas en :data:`sys.path_importer_cache` establecidas en ``None`` se eliminan.

source: Entries of ``None`` in :data:`sys.path_importer_cache` are deleted.
es: Se eliminan las entradas de ``None`` en :data:`sys.path_importer_cache`.

source: Calls objects in :data:`sys.path_hooks` with the current working directory for ``''`` (i.e. the empty string).
es: Llama a objetos en :data:`sys.path_hooks` con el directorio de trabajo actual para ``''`` (es decir, la cadena de caracteres vacía).

source: A concrete implementation of :class:`importlib.abc.PathEntryFinder` which caches results from the file system.
es: Una implementación concreta de :class:`importlib.abc.PathEntryFinder` que almacena en caché los resultados del sistema de archivos.

source: The *path* argument is the directory for which the finder is in charge of searching.
es: El argumento *path* es el directorio que el buscador se encarga de buscar.

source: The *loader_details* argument is a variable number of 2-item tuples each containing a loader and a sequence of file suffixes the loader recognizes. The loaders are expected to be callables which accept two arguments of the module's name and the path to the file found.
es: El argumento *loader_details* es un número variable de tuplas de 2 elementos, cada una de las cuales contiene un cargador y una secuencia de sufijos de archivo que el cargador reconoce. Se espera que los cargadores sean invocables que acepten dos argumentos del nombre del módulo y la ruta al archivo encontrado.
