Repository: python/python-docs-es
Catalog: library/importlib.po
Languages: es

source: The finder will cache the directory contents as necessary, making stat calls for each module search to verify the cache is not outdated. Because cache staleness relies upon the granularity of the operating system's state information of the file system, there is a potential race condition of searching for a module, creating a new file, and then searching for the module the new file represents. If the operations happen fast enough to fit within the granularity of stat calls, then the module search will fail. To prevent this from happening, when you create a module dynamically, make sure to call :func:`importlib.invalidate_caches`.
es: El buscador almacenará en caché el contenido del directorio según sea necesario, haciendo llamadas estadísticas para cada búsqueda de módulo para verificar que la caché no esté desactualizada. Debido a que la obsolescencia de la caché se basa en la granularidad de la información de estado del sistema operativo del sistema de archivos, existe una condición de carrera potencial de buscar un módulo, crear un nuevo archivo y luego buscar el módulo que representa el nuevo archivo. Si las operaciones ocurren lo suficientemente rápido como para ajustarse a la granularidad de las llamadas estadísticas, la búsqueda del módulo fallará. Para evitar que esto suceda, cuando cree un módulo dinámicamente, asegúrese de llamar a :func:`importlib.invalidate_caches`.

source: The path the finder will search in.
es: La ruta en la que buscará el buscador.

source: Attempt to find the spec to handle *fullname* within :attr:`path`.
es: Intente encontrar la especificación para manejar *fullname* dentro de :attr:`path`.

source: Attempt to find the loader to handle *fullname* within :attr:`path`.
es: Intente encontrar el cargador para manejar *fullname* dentro de :attr:`path`.

source: Clear out the internal cache.
es: Borrar el caché interno.

source: A class method which returns a closure for use on :attr:`sys.path_hooks`. An instance of :class:`FileFinder` is returned by the closure using the path argument given to the closure directly and *loader_details* indirectly.
es: Un método de clase que devuelve un cierre para su uso en :attr:`sys.path_hooks`. Una instancia de :class:`FileFinder` es retornada por el cierre usando el argumento de ruta dado al cierre directamente y *loader_details* indirectamente.

source: If the argument to the closure is not an existing directory, :exc:`ImportError` is raised.
es: Si el argumento del cierre no es un directorio existente, se lanza :exc:`ImportError`.

source: A concrete implementation of :class:`importlib.abc.SourceLoader` by subclassing :class:`importlib.abc.FileLoader` and providing some concrete implementations of other methods.
es: Una implementación concreta de :class:`importlib.abc.SourceLoader` subclasificando :class:`importlib.abc.FileLoader` y proporcionando algunas implementaciones concretas de otros métodos.

source: The name of the module that this loader will handle.
es: El nombre del módulo que manejará este cargador.

source: The path to the source file.
es: La ruta al archivo de origen.

source: Return ``True`` if :attr:`path` appears to be for a package.
es: Devuelve ``True`` si :attr:`path` parece ser para un paquete.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.path_stats`.
es: Implementación concreta de :meth:`importlib.abc.SourceLoader.path_stats`.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.set_data`.
es: Implementación concreta de :meth:`importlib.abc.SourceLoader.set_data`.

source: Concrete implementation of :meth:`importlib.abc.Loader.load_module` where specifying the name of the module to load is optional.
es: Implementación concreta de :meth:`importlib.abc.Loader.load_module` donde especificar el nombre del módulo a cargar es opcional.

source: Use :meth:`importlib.abc.Loader.exec_module` instead.
es: Utilice :meth:`importlib.abc.Loader.exec_module` en su lugar.

source: A concrete implementation of :class:`importlib.abc.FileLoader` which can import bytecode files (i.e. no source code files exist).
es: Una implementación concreta de :class:`importlib.abc.FileLoader` que puede importar archivos de código de bytes (es decir, no existen archivos de código fuente).

source: Please note that direct use of bytecode files (and thus not source code files) inhibits your modules from being usable by all Python implementations or new versions of Python which change the bytecode format.
es: Tenga en cuenta que el uso directo de archivos de código de bytes (y, por lo tanto, no de archivos de código fuente) impide que sus módulos sean utilizables por todas las implementaciones de Python o las nuevas versiones de Python que cambian el formato de código de bytes.

source: The name of the module the loader will handle.
es: El nombre del módulo que manejará el cargador.

source: The path to the bytecode file.
es: La ruta al archivo de código de bytes.

source: Determines if the module is a package based on :attr:`path`.
es: Determina si el módulo es un paquete basado en :attr:`path`.

source: Returns the code object for :attr:`name` created from :attr:`path`.
es: Retorna el objeto de código para :attr:`name` creado a partir de :attr:`path`.

source: Returns ``None`` as bytecode files have no source when this loader is used.
es: Devuelve ``None`` ya que los archivos de código de bytes no tienen fuente cuando se usa este cargador.

source: A concrete implementation of :class:`importlib.abc.ExecutionLoader` for extension modules.
es: Una implementación concreta de :class:`importlib.abc.ExecutionLoader` para módulos de extensión.

source: The *fullname* argument specifies the name of the module the loader is to support. The *path* argument is the path to the extension module's file.
es: El argumento *fullname* especifica el nombre del módulo que el cargador debe admitir. El argumento *path* es la ruta al archivo del módulo de extensión.

source: Name of the module the loader supports.
es: Nombre del módulo que admite el cargador.

source: Path to the extension module.
es: Ruta al módulo de extensión.

source: Creates the module object from the given specification in accordance with :pep:`489`.
es: Crea el objeto de módulo a partir de la especificación dada de acuerdo con :pep:`489`.

source: Initializes the given module object in accordance with :pep:`489`.
es: Inicializa el objeto de módulo dado de acuerdo con :pep:`489`.

source: Returns ``True`` if the file path points to a package's ``__init__`` module based on :attr:`EXTENSION_SUFFIXES`.
es: Retorna ``True`` si la ruta del archivo apunta al módulo ``__init__`` de un paquete basado en :attr:`EXTENSION_SUFFIXES`.

source: Returns ``None`` as extension modules lack a code object.
es: Retorna ``None`` ya que los módulos de extensión carecen de un objeto de código.

source: Returns ``None`` as extension modules do not have source code.
es: Retorna ``None`` ya que los módulos de extensión no tienen código fuente.

source: A specification for a module's import-system-related state. This is typically exposed as the module's ``__spec__`` attribute. In the descriptions below, the names in parentheses give the corresponding attribute available directly on the module object. E.g. ``module.__spec__.origin == module.__file__``. Note however that while the *values* are usually equivalent, they can differ since there is no synchronization between the two objects. Thus it is possible to update the module's ``__path__`` at runtime, and this will not be automatically reflected in ``__spec__.submodule_search_locations``.
es: Una especificación para el estado relacionado con el sistema de importación de un módulo. Esto generalmente se expone como el atributo ``__spec__`` del módulo. En las descripciones siguientes, los nombres entre paréntesis dan el atributo correspondiente disponible directamente en el objeto del módulo, por ejemplo, ``module.__spec__.origin == module.__file__``. Sin embargo, tenga en cuenta que, si bien los *values* suelen ser equivalentes, pueden diferir ya que no hay sincronización entre los dos objetos. Por lo tanto, es posible actualizar el ``__path__`` del módulo en tiempo de ejecución, y esto no se reflejará automáticamente en ``__spec__.submodule_search_locations``.

source: A string for the fully-qualified name of the module.
es: Una cadena de caracteres para el nombre completo del módulo.

source: The :term:`Loader <loader>` that should be used when loading the module. :term:`Finders <finder>` should always set this.
es: El :term:`Loader <loader>` que debe usarse al cargar el módulo. :term:`Finders <finder>` siempre debe establecer esto.

source: Name of the place from which the module is loaded, e.g. "builtin" for built-in modules and the filename for modules loaded from source. Normally "origin" should be set, but it may be ``None`` (the default) which indicates it is unspecified (e.g. for namespace packages).
es: Nombre del lugar desde el que se carga el módulo, por ejemplo "incorporado" (*builtin*) para los módulos incorporados y el nombre de archivo para los módulos cargados desde la fuente. Normalmente se debe establecer "origen", pero puede ser ``None`` (el valor predeterminado), lo que indica que no está especificado (por ejemplo, para paquetes de espacio de nombres).

source: List of strings for where to find submodules, if a package (``None`` otherwise).
es: Lista de cadenas de caracteres de dónde encontrar submódulos, si es un paquete (``None`` de lo contrario).

source: Container of extra module-specific data for use during loading (or ``None``).
es: Contenedor de datos adicionales específicos del módulo para usar durante la carga (o ``None``).

source: String for where the compiled module should be stored (or ``None``).
es: Cadena de caracteres para el lugar donde se debe almacenar el módulo compilado (o ``None``).

source: (Read-only) The fully-qualified name of the package under which the module should be loaded as a submodule (or the empty string for top-level modules). For packages, it is the same as :attr:`__name__`.
es: (Solo lectura) El nombre completo del paquete bajo el cual se debe cargar el módulo como submódulo (o la cadena de caracteres vacía para los módulos de nivel superior). Para los paquetes, es lo mismo que :attr:`__name__`.

source: Boolean indicating whether or not the module's "origin" attribute refers to a loadable location.
es: Booleano que indica si el atributo "origen" del módulo se refiere a una ubicación cargable.

source: :mod:`importlib.util` -- Utility code for importers
es: :mod:`importlib.util` -- Código de utilidad para importadores

source: **Source code:** :source:`Lib/importlib/util.py`
es: **Código fuente:** :source:`Lib/importlib/util.py`

source: This module contains the various objects that help in the construction of an :term:`importer`.
es: Este módulo contiene los diversos objetos que ayudan en la construcción de un :term:`importer`.

source: The bytes which represent the bytecode version number. If you need help with loading/writing bytecode then consider :class:`importlib.abc.SourceLoader`.
es: Los bytes que representan el número de versión del código de bytes. Si necesita ayuda para cargar/escribir código de bytes, considere :class:`importlib.abc.SourceLoader`.

source: Return the :pep:`3147`/:pep:`488` path to the byte-compiled file associated with the source *path*. For example, if *path* is ``/foo/bar/baz.py`` the return value would be ``/foo/bar/__pycache__/baz.cpython-32.pyc`` for Python 3.2. The ``cpython-32`` string comes from the current magic tag (see :func:`get_tag`; if :attr:`sys.implementation.cache_tag` is not defined then :exc:`NotImplementedError` will be raised).
es: Retorna la ruta :pep:`3147`/:pep:`488` al archivo compilado por bytes asociado con la *path* de origen. Por ejemplo, si *path* es ``/foo/bar/baz.py``, el valor de retorno sería ``/foo/bar/__pycache__/baz.cpython-32.pyc`` para Python 3.2. La cadena de caracteres ``cpython-32`` proviene de la etiqueta mágica actual (ver :func:`get_tag`; si :attr:`sys.implementation.cache_tag` no está definido, se lanzará :exc:`NotImplementedError`).

source: The *optimization* parameter is used to specify the optimization level of the bytecode file. An empty string represents no optimization, so ``/foo/bar/baz.py`` with an *optimization* of ``''`` will result in a bytecode path of ``/foo/bar/__pycache__/baz.cpython-32.pyc``. ``None`` causes the interpreter's optimization level to be used. Any other value's string representation is used, so ``/foo/bar/baz.py`` with an *optimization* of ``2`` will lead to the bytecode path of ``/foo/bar/__pycache__/baz.cpython-32.opt-2.pyc``. The string representation of *optimization* can only be alphanumeric, else :exc:`ValueError` is raised.
es: El parámetro *optimization* se utiliza para especificar el nivel de optimización del archivo de código de bytes. Una cadena de caracteres vacía no representa optimización, por lo que ``/foo/bar/baz.py`` con una *optimization* de ``''`` dará como resultado una ruta de código de bytes de ``/foo/bar/__pycache__/baz.cpython-32.pyc``. ``None`` hace que se utilice el nivel de optimización del intérprete. Se usa la representación de cadena de caracteres de cualquier otro valor, por lo que ``/foo/bar/baz.py`` con una *optimization* de ``2`` conducirá a la ruta del código de bytes de ``/foo/bar/__pycache__/baz.cpython-32.opt-2.pyc``. La representación de cadena de caracteres *optimization* solo puede ser alfanumérica, de lo contrario se lanza :exc:`ValueError`.

source: The *debug_override* parameter is deprecated and can be used to override the system's value for ``__debug__``. A ``True`` value is the equivalent of setting *optimization* to the empty string. A ``False`` value is the same as setting *optimization* to ``1``. If both *debug_override* an *optimization* are not ``None`` then :exc:`TypeError` is raised.
es: El parámetro *debug_override* está obsoleto y se puede usar para anular el valor del sistema para ``__debug__``. Un valor ``True`` es el equivalente a establecer *optimization* en la cadena de caracteres vacía. Un valor ``False`` es lo mismo que establecer *optimization* en ``1``. Si tanto *debug_override* como *optimization* no es ``None``, entonces se lanza :exc:`TypeError`.

source: The *optimization* parameter was added and the *debug_override* parameter was deprecated.
es: Se agregó el parámetro *optimization* y el parámetro *debug_override* quedó obsoleto.

source: Accepts a :term:`path-like object`.
es: Acepta un :term:`path-like object`.

source: Given the *path* to a :pep:`3147` file name, return the associated source code file path. For example, if *path* is ``/foo/bar/__pycache__/baz.cpython-32.pyc`` the returned path would be ``/foo/bar/baz.py``. *path* need not exist, however if it does not conform to :pep:`3147` or :pep:`488` format, a :exc:`ValueError` is raised. If :attr:`sys.implementation.cache_tag` is not defined, :exc:`NotImplementedError` is raised.
es: Dado el *path* a un nombre de archivo :pep:`3147`, retorna la ruta del archivo del código fuente asociado. Por ejemplo, si *path* es ``/foo/bar/__pycache__/baz.cpython-32.pyc``, la ruta retornada sería ``/foo/bar/baz.py``. *path* no necesita existir, sin embargo, si no se ajusta al formato :pep:`3147` o :pep:`488`, se lanza un :exc:`ValueError`. Si :attr:`sys.implementation.cache_tag` no está definido, se lanza :exc:`NotImplementedError`.

source: Decode the given bytes representing source code and return it as a string with universal newlines (as required by :meth:`importlib.abc.InspectLoader.get_source`).
es: Decodifica los bytes dados que representan el código fuente y los retorna como una cadena de caracteres con nuevas líneas universales (como lo requiere :meth:`importlib.abc.InspectLoader.get_source`).

source: Resolve a relative module name to an absolute one.
es: Resuelve un nombre de módulo relativo a uno absoluto.

source: If **name** has no leading dots, then **name** is simply returned. This allows for usage such as ``importlib.util.resolve_name('sys', __spec__.parent)`` without doing a check to see if the **package** argument is needed.
es: Si **name** no tiene puntos iniciales, entonces **name** simplemente se retorna. Esto permite el uso como ``importlib.util.resolve_name('sys', __spec__.parent)`` sin hacer una verificación para ver si se necesita el argumento **package**.

source: :exc:`ImportError` is raised if **name** is a relative module name but **package** is a false value (e.g. ``None`` or the empty string). :exc:`ImportError` is also raised a relative name would escape its containing package (e.g. requesting ``..bacon`` from within the ``spam`` package).
es: :exc:`ImportError` se lanza si **name** es un nombre de módulo relativo pero **package** es un valor falso (por ejemplo, ``None`` o la cadena de caracteres vacía). También se lanza :exc:`ImportError` un nombre relativo que escaparía del paquete que lo contiene (por ejemplo, solicitando ``..bacon`` desde el paquete ``spam``).

source: To improve consistency with import statements, raise :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts.
es: Para mejorar la coherencia con las declaraciones de importación, aumente :exc:`ImportError` en lugar de :exc:`ValueError` para intentos de importación relativa no válidos.

source: Find the :term:`spec <module spec>` for a module, optionally relative to the specified **package** name. If the module is in :attr:`sys.modules`, then ``sys.modules[name].__spec__`` is returned (unless the spec would be ``None`` or is not set, in which case :exc:`ValueError` is raised). Otherwise a search using :attr:`sys.meta_path` is done. ``None`` is returned if no spec is found.
es: Busca el :term:`spec <module spec>` para un módulo, opcionalmente relativo al nombre del **package** especificado. Si el módulo está en :attr:`sys.modules`, se retorna ``sys.modules[name].__spec__`` (a menos que la especificación sea ``None`` o no esté establecida, en cuyo caso se lanza :exc:`ValueError`). De lo contrario, se realiza una búsqueda utilizando :attr:`sys.meta_path`. Se retorna ``None`` si no se encuentra ninguna especificación.

source: If **name** is for a submodule (contains a dot), the parent module is automatically imported.
es: Si **name** es para un submódulo (contiene un punto), el módulo principal se importa automáticamente.

source: **name** and **package** work the same as for :func:`import_module`.
es: **name** y **package** funcionan igual que para :func:`import_module`.

source: Raises :exc:`ModuleNotFoundError` instead of :exc:`AttributeError` if **package** is in fact not a package (i.e. lacks a :attr:`__path__` attribute).
es: Lanza :exc:`ModuleNotFoundError` en lugar de :exc:`AttributeError` si **package** no es de hecho un paquete (es decir, carece de un atributo :attr:`__path__`).

source: Create a new module based on **spec** and :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.
es: Cree un nuevo módulo basado en **spec** y :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.

source: If :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` does not return ``None``, then any pre-existing attributes will not be reset. Also, no :exc:`AttributeError` will be raised if triggered while accessing **spec** or setting an attribute on the module.
es: Si :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` no retorna ``None``, no se restablecerán los atributos preexistentes. Además, no se lanzará :exc:`AttributeError` si se activa mientras se accede a **spec** o se establece un atributo en el módulo.

source: This function is preferred over using :class:`types.ModuleType` to create a new module as **spec** is used to set as many import-controlled attributes on the module as possible.
es: Esta función es preferible a usar :class:`types.ModuleType` para crear un nuevo módulo ya que **spec** se usa para establecer tantos atributos de importación controlados en el módulo como sea posible.

source: A :term:`decorator` for :meth:`importlib.abc.Loader.load_module` to handle selecting the proper module object to load with. The decorated method is expected to have a call signature taking two positional arguments (e.g. ``load_module(self, module)``) for which the second argument will be the module **object** to be used by the loader. Note that the decorator will not work on static methods because of the assumption of two arguments.
es: Un :term:`decorator` para :meth:`importlib.abc.Loader.load_module` para manejar la selección del objeto de módulo adecuado para cargar. Se espera que el método decorado tenga una firma de llamada que tome dos argumentos posicionales (por ejemplo, ``load_module(self, module)``) para los cuales el segundo argumento será el módulo **object** que usará el cargador. Tenga en cuenta que el decorador no funcionará con métodos estáticos debido a la suposición de dos argumentos.

source: The decorated method will take in the **name** of the module to be loaded as expected for a :term:`loader`. If the module is not found in :data:`sys.modules` then a new one is constructed. Regardless of where the module came from, :attr:`__loader__` set to **self** and :attr:`__package__` is set based on what :meth:`importlib.abc.InspectLoader.is_package` returns (if available). These attributes are set unconditionally to support reloading.
es: El método decorado tomará el **name** del módulo que se cargará como se esperaba para un :term:`loader`. Si el módulo no se encuentra en :data:`sys.modules`, se construye uno nuevo. Independientemente de la procedencia del módulo, :attr:`__loader__` se establece en **self** y :attr:`__package__` se establece en función de lo que retorna :meth:`importlib.abc.InspectLoader.is_package` (si está disponible) . Estos atributos se establecen incondicionalmente para admitir la recarga.

source: If an exception is raised by the decorated method and a module was added to :data:`sys.modules`, then the module will be removed to prevent a partially initialized module from being in left in :data:`sys.modules`. If the module was already in :data:`sys.modules` then it is left alone.
es: Si el método decorado lanza una excepción y se agrega un módulo a :data:`sys.modules`, entonces el módulo se eliminará para evitar que un módulo parcialmente inicializado quede en :data:`sys.modules`. Si el módulo ya estaba en :data:`sys.modules` entonces se deja solo.

source: :attr:`__loader__` and :attr:`__package__` are automatically set (when possible).
es: :attr:`__loader__` y :attr:`__package__` se configuran automáticamente (cuando es posible).

source: Set :attr:`__name__`, :attr:`__loader__` :attr:`__package__` unconditionally to support reloading.
es: Establece :attr:`__name__`, :attr:`__loader__` :attr:`__package__` incondicionalmente para apoyar la recarga.

source: The import machinery now directly performs all the functionality provided by this function.
es: La maquinaria de importación ahora realiza directamente toda la funcionalidad proporcionada por esta función.

source: A :term:`decorator` for :meth:`importlib.abc.Loader.load_module` to set the :attr:`__loader__` attribute on the returned module. If the attribute is already set the decorator does nothing. It is assumed that the first positional argument to the wrapped method (i.e. ``self``) is what :attr:`__loader__` should be set to.
es: Un :term:`decorator` para :meth:`importlib.abc.Loader.load_module` para establecer el atributo :attr:`__loader__` en el módulo retornado. Si el atributo ya está configurado, el decorador no hace nada. Se asume que el primer argumento posicional del método envuelto (es decir, ``self``) es lo que se debe establecer en :attr:`__loader__`.
