Repository: python/python-docs-es
Catalog: library/inspect.po
Languages: es

source: :mod:`inspect` --- Inspect live objects
es: :mod:`inspect` --- Inspeccionar objetos vivos

source: **Source code:** :source:`Lib/inspect.py`
es: **Código fuente:** :source:`Lib/inspect.py`

source: The :mod:`inspect` module provides several useful functions to help get information about live objects such as modules, classes, methods, functions, tracebacks, frame objects, and code objects. For example, it can help you examine the contents of a class, retrieve the source code of a method, extract and format the argument list for a function, or get all the information you need to display a detailed traceback.
es: El módulo :mod:`inspect` proporciona varias funciones útiles para ayudar a obtener información sobre objetos vivos como módulos, clases, métodos, funciones, tracebacks, objetos de marco y objetos de código. Por ejemplo, puede ayudarte a examinar el contenido de una clase, recuperar el código fuente de un método, extraer y dar formato a la lista de argumentos de una función, u obtener toda la información que necesitas para mostrar un traceback detallado.

source: There are four main kinds of services provided by this module: type checking, getting source code, inspecting classes and functions, and examining the interpreter stack.
es: Hay cuatro tipos principales de servicios que ofrece este módulo: comprobación de tipos, obtención del código fuente, inspección de clases y funciones, y examinar la pila del intérprete.

source: Types and members
es: Tipos y miembros

source: The :func:`getmembers` function retrieves the members of an object such as a class or module. The functions whose names begin with "is" are mainly provided as convenient choices for the second argument to :func:`getmembers`. They also help you determine when you can expect to find the following special attributes:
es: La función :func:`getmembers` recupera los miembros de un objeto como una clase o un módulo. Las funciones cuyos nombres comienzan con "is" se proveen principalmente como opciones convenientes para el segundo argumento de :func:`getmembers`. También ayudan a determinar cuándo se puede esperar encontrar los siguientes atributos especiales:

source: Type
es: Tipo

source: Attribute
es: Atributo

source: Description
es: Descripción

source: module
es: módulo

source: documentation string
es: cadena de caracteres de documentación

source: filename (missing for built-in modules)
es: nombre de archivo (falta para los módulos incorporados)

source: class
es: clase

source: name with which this class was defined
es: nombre con el que se definió esta clase

source: qualified name
es: nombre calificado

source: name of module in which this class was defined
es: nombre del módulo en el que se definió esta clase

source: method
es: método

source: name with which this method was defined
es: nombre con el que se definió este método

source: function object containing implementation of method
es: objeto función que contiene la implementación del método

source: instance to which this method is bound, or ``None``
es: instancia a la que este método está ligado, o ``None``

source: name of module in which this method was defined
es: nombre del módulo en el cual este método fue definido

source: function
es: función

source: name with which this function was defined
es: nombre con el que se definió esta función

source: code object containing compiled function :term:`bytecode`
es: objeto de código que contiene la función compilada :term:`bytecode`

source: tuple of any default values for positional or keyword parameters
es: tupla de cualquier valor por defecto para los parámetros de posición o de palabras clave

source: mapping of any default values for keyword-only parameters
es: mapeo de cualquier valor predeterminado para parámetros de sólo palabras clave

source: global namespace in which this function was defined
es: namespace global en el que se definió esta función

source: builtins namespace
es: Espacio de nombres builtins

source: mapping of parameters names to annotations; ``"return"`` key is reserved for return annotations.
es: mapeo de los nombres de parámetros a las anotaciones; la tecla ``"return"`` está reservada para las anotaciones de retorno.

source: name of module in which this function was defined
es: nombre del módulo en el cual esta función fue definida

source: frame object at this level
es: enmarcar el objeto a este nivel

source: index of last attempted instruction in bytecode
es: índice del último intento de instrucción en código de bytes

source: current line number in Python source code
es: número de línea actual en el código fuente de Python

source: next inner traceback object (called by this level)
es: el siguiente objeto de traceback interno (llamado por este nivel)

source: frame
es: marco

source: next outer frame object (this frame's caller)
es: el siguiente objeto exterior del marco (el que llama a este marco)

source: builtins namespace seen by this frame
es: construye el namespace visto por este marco

source: code object being executed in this frame
es: objeto de código que se ejecuta en este marco

source: global namespace seen by this frame
es: el namespace global visto por este marco

source: local namespace seen by this frame
es: el namespace local visto por este marco

source: tracing function for this frame, or ``None``
es: función de rastreo para este marco, o ``None``

source: number of arguments (not including keyword only arguments, \* or \*\* args)
es: número de argumentos (sin incluir los argumentos de palabras clave, \* o \*\* args)

source: string of raw compiled bytecode
es: cadena de bytecode compilados en bruto

source: tuple of names of cell variables (referenced by containing scopes)
es: tupla de nombres de variables de celda (referenciados por contener alcances)

source: tuple of constants used in the bytecode
es: tupla de constantes utilizadas en el bytecode

source: name of file in which this code object was created
es: nombre del archivo en el que este objeto código fue creado

source: number of first line in Python source code
es: número de la primera línea del código fuente de Python

source: bitmap of ``CO_*`` flags, read more :ref:`here <inspect-module-co-flags>`
es: mapa de bits de los flags ``CO_*``, leer más :ref:`aquí <inspect-module-co-flags>`

source: encoded mapping of line numbers to bytecode indices
es: mapeo codificado de los números de línea a los índices de bytecode

source: tuple of names of free variables (referenced via a function's closure)
es: tupla de nombres de variables libres (referenciados a través del cierre de una función)

source: number of positional only arguments
es: número de argumentos solo posicionales

source: number of keyword only arguments (not including \*\* arg)
es: número de argumentos de sólo palabras clave (sin incluir el \*\* arg)

source: name with which this code object was defined
es: nombre con el que se definió este objeto de código

source: fully qualified name with which this code object was defined
es: nombre completo con el que se definió este objeto de código

source: tuple of names other than arguments and function locals
es: tupla de nombres que no sean argumentos y funciones locales

source: number of local variables
es: número de variables locales

source: virtual machine stack space required
es: se requiere espacio en la pila de máquina virtual

source: tuple of names of arguments and local variables
es: tupla de nombres de argumentos y variables locales

source: generator
es: generador

source: name
es: nombre

source: is the generator running?
es: ¿Está el generador en ejecución?

source: object being iterated by ``yield from``, or ``None``
es: el objeto siendo iterado por ``yield from``, o ``None``

source: coroutine
es: corutina

source: object being awaited on, or ``None``
es: objeto al que se espera, o ``None``

source: is the coroutine running?
es: ¿Está la corutina en ejecución?

source: where coroutine was created, or ``None``. See |coroutine-origin-link|
es: donde se creó la corutina, o ``None``. Ver |coroutine-origin-link|

source: builtin
es: incorporado

source: original name of this function or method
es: nombre original de esta función o método

source: instance to which a method is bound, or ``None``
es: instancia a la que está ligada un método, o ``None``

source: Add ``__qualname__`` and ``gi_yieldfrom`` attributes to generators.
es: Agrega atributos ``__qualname__`` y ``gi_yieldfrom`` a los generadores.

source: The ``__name__`` attribute of generators is now set from the function name, instead of the code name, and it can now be modified.
es: El atributo ``__name__`` de los generadores se establece ahora a partir del nombre de la función, en lugar del nombre del código, y ahora puede ser modificado.

source: Add ``cr_origin`` attribute to coroutines.
es: Agrega el atributo ``cr_origin`` a las corutinas.

source: Add ``__builtins__`` attribute to functions.
es: Agrega el atributo ``__builtins__`` a funciones.

source: Return all the members of an object in a list of ``(name, value)`` pairs sorted by name. If the optional *predicate* argument—which will be called with the ``value`` object of each member—is supplied, only members for which the predicate returns a true value are included.
es: Retorna todos los miembros de un objeto en una lista de pares ``(name, value)`` ordenados por nombre. Si se proporciona el argumento *predicate* opcional, que se llamará con el objeto ``value`` de cada miembro, solo se incluyen los miembros para los que el predicado retorna un valor verdadero.

source: :func:`getmembers` will only return class attributes defined in the metaclass when the argument is a class and those attributes have been listed in the metaclass' custom :meth:`__dir__`.
es: :func:`getmembers` sólo retornará los atributos de clase definidos en la metaclase cuando el argumento sea una clase y esos atributos hayan sido listados en la costumbre de la metaclase :meth:`__dir__`.

source: Return all the members of an object in a list of ``(name, value)`` pairs sorted by name without triggering dynamic lookup via the descriptor protocol, __getattr__ or __getattribute__. Optionally, only return members that satisfy a given predicate.
es: Retorna todos los miembros de un objeto en una lista de pares ``(name, value)`` ordenados por nombre sin activar la búsqueda dinámica a través del protocolo descriptor, __getattr__ o __getattribute__. Opcionalmente, solo retorna miembros que satisfagan un predicado determinado.

source: :func:`getmembers_static` may not be able to retrieve all members that getmembers can fetch (like dynamically created attributes) and may find members that getmembers can't (like descriptors that raise AttributeError). It can also return descriptor objects instead of instance members in some cases.
es: Es posible que :func:`getmembers_static` no pueda recuperar todos los miembros que getmembers puede obtener (como atributos creados dinámicamente) y puede encontrar miembros que getmembers no puede (como descriptores que generan AttributeError). También puede retornar objetos descriptores en lugar de miembros de instancia en algunos casos.

source: Return the name of the module named by the file *path*, without including the names of enclosing packages. The file extension is checked against all of the entries in :func:`importlib.machinery.all_suffixes`. If it matches, the final path component is returned with the extension removed. Otherwise, ``None`` is returned.
es: Retorna el nombre del módulo nombrado por el *ruta* de archivo, sin incluir los nombres de los paquetes adjuntos. La extensión del archivo se comprueba con todas las entradas en :func:`importlib.machinery.all_suffixes`. Si coincide, el componente final de la ruta se retorna con la extensión eliminada. En caso contrario, se retorna ``None``.

source: Note that this function *only* returns a meaningful name for actual Python modules - paths that potentially refer to Python packages will still return ``None``.
es: Ten en cuenta que esta función *sólo* retorna un nombre significativo para los módulos reales de Python - las rutas que potencialmente se refieren a los paquetes de Python seguirán retornando ``None``.

source: The function is based directly on :mod:`importlib`.
es: La función se basa directamente en :mod:`importlib`.

source: Return ``True`` if the object is a module.
es: Retorna ``True`` si el objeto es un módulo.

source: Return ``True`` if the object is a class, whether built-in or created in Python code.
es: Retorna ``True`` si el objeto es una clase, ya sea incorporada o creada en código Python.

source: Return ``True`` if the object is a bound method written in Python.
es: Retorna ``True`` si el objeto es un método ligado escrito en Python.

source: Return ``True`` if the object is a Python function, which includes functions created by a :term:`lambda` expression.
es: Retorna ``True`` si el objeto es una función de Python, que incluye funciones creadas por una expresión :term:`lambda`.

source: Return ``True`` if the object is a Python generator function.
es: Retorna ``True`` si el objeto es una función generadora de Python.

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a Python generator function.
es: Funciones envueltas en :func:`functools.partial` ahora retornan ``True`` si la función envuelta es una función Python generadora.

source: Return ``True`` if the object is a generator.
es: Retorna ``True`` si el objeto es un generador.

source: Return ``True`` if the object is a :term:`coroutine function` (a function defined with an :keyword:`async def` syntax).
es: Retorna ``True`` si el objeto es una :term:`coroutine function` (una función definida con una sintaxis :keyword:`async def`).

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a :term:`coroutine function`.
es: Funciones envueltas en :func:`functools.partial` ahora retornan ``True`` si la función envuelta es un :term:`coroutine function`.

source: Return ``True`` if the object is a :term:`coroutine` created by an :keyword:`async def` function.
es: Retorna verdadero si el objeto es un :term:`coroutine` creado por una función :keyword:`async def`.

source: Return ``True`` if the object can be used in :keyword:`await` expression.
es: Retorna ``True`` si el objeto puede ser usado en la expresión :keyword:`await`.

source: Can also be used to distinguish generator-based coroutines from regular generators::
es: También se puede utilizar para distinguir las corutinas basadas en generadores de los generadores normales::

source: Return ``True`` if the object is an :term:`asynchronous generator` function, for example::
es: Retorna ``True`` si el objeto es una función :term:`asynchronous generator`, por ejemplo::

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a :term:`asynchronous generator` function.
es: Funciones envueltas en :func:`functools.partial` ahora retornan ``True`` si la función envuelta es una función :term:`asynchronous generator`.

source: Return ``True`` if the object is an :term:`asynchronous generator iterator` created by an :term:`asynchronous generator` function.
es: Retorna verdadero si el objeto es un :term:`asynchronous generator iterator` creado por una función :term:`asynchronous generator`.

source: Return ``True`` if the object is a traceback.
es: Retorna ``True`` si el objeto es un traceback.

source: Return ``True`` if the object is a frame.
es: Retorna ``True`` si el objeto es un marco.

source: Return ``True`` if the object is a code.
es: Retorna ``True`` si el objeto es un código.

source: Return ``True`` if the object is a built-in function or a bound built-in method.
es: Retorna ``True`` si el objeto es una función incorporada o un método ligado incorporado.

source: Return ``True`` if the type of object is a :class:`~types.MethodWrapperType`.
es: Retorna ``True`` si el tipo de objeto es :class:`~types.MethodWrapperType`.

source: These are instances of :class:`~types.MethodWrapperType`, such as :meth:`~object.__str__`, :meth:`~object.__eq__` and :meth:`~object.__repr__`.
es: Estas son instancias de :class:`~types.MethodWrapperType`, como :meth:`~object.__str__`, :meth:`~object.__eq__` y :meth:`~object.__repr__`.

source: Return ``True`` if the object is a user-defined or built-in function or method.
es: Retorna ``True`` si el objeto es una función o método definido por el usuario o incorporado.

source: Return ``True`` if the object is an abstract base class.
es: Retorna ``True`` si el objeto es una clase base abstracta.

source: Return ``True`` if the object is a method descriptor, but not if :func:`ismethod`, :func:`isclass`, :func:`isfunction` or :func:`isbuiltin` are true.
es: Retorna ``True`` si el objeto es un descriptor de método, pero no si :func:`ismethod`, :func:`isclass`, :func:`isfunction` o :func:`isbuiltin` son verdaderos.

source: This, for example, is true of ``int.__add__``. An object passing this test has a :meth:`~object.__get__` method but not a :meth:`~object.__set__` method, but beyond that the set of attributes varies. A :attr:`~definition.__name__` attribute is usually sensible, and :attr:`__doc__` often is.
es: Esto, por ejemplo, es cierto para ``int.__add__``. Un objeto que pasa esta prueba tiene un método :meth:`~object.__get__` pero no un método :meth:`~object.__set__`, pero más allá de eso el conjunto de atributos varía. Un atributo :attr:`~definition.__name__` suele ser sensato, y :attr:`__doc__` a menudo lo es.

source: Methods implemented via descriptors that also pass one of the other tests return ``False`` from the :func:`ismethoddescriptor` test, simply because the other tests promise more -- you can, e.g., count on having the :attr:`__func__` attribute (etc) when an object passes :func:`ismethod`.
es: Los métodos implementados a través de descriptores que también pasan una de las otras pruebas retornan ``False`` a la prueba :func:`ismethoddescriptor`, simplemente porque las otras pruebas prometen más -- puede, por ejemplo, contar con tener el atributo :attr:`__func__` (etc) cuando un objeto pasa :func:`ismethod`.

source: Return ``True`` if the object is a data descriptor.
es: Retorna ``True`` si el objeto es un descriptor de datos.

source: Data descriptors have a :attr:`~object.__set__` or a :attr:`~object.__delete__` method. Examples are properties (defined in Python), getsets, and members. The latter two are defined in C and there are more specific tests available for those types, which is robust across Python implementations. Typically, data descriptors will also have :attr:`~definition.__name__` and :attr:`__doc__` attributes (properties, getsets, and members have both of these attributes), but this is not guaranteed.
es: Los descriptores de datos tienen un método :attr:`~object.__set__` o un método :attr:`~object.__delete__`. Los ejemplos son propiedades (definidas en Python), conjuntos y miembros. Los dos últimos están definidos en C y hay pruebas más específicas disponibles para esos tipos, lo cual es robusto en todas las implementaciones de Python. Típicamente, los descriptores de datos también tendrán los atributos :attr:`~definition.__name__` y :attr:`__doc__` (las propiedades, conjuntos y miembros tienen ambos atributos), pero esto no está garantizado.

source: Return ``True`` if the object is a getset descriptor.
es: Retorna ``True`` si el objeto es un descriptor de conjunto.

source: getsets are attributes defined in extension modules via :c:type:`PyGetSetDef` structures. For Python implementations without such types, this method will always return ``False``.
es: conjuntos son atributos definidos en módulos de extensión a través de estructuras :c:type:`PyGetSetDef`. Para implementaciones de Python sin tales tipos, este método siempre retornará ``False``.

source: Return ``True`` if the object is a member descriptor.
es: Retorna ``True`` si el objeto es un descriptor de miembro.

source: Member descriptors are attributes defined in extension modules via :c:type:`PyMemberDef` structures. For Python implementations without such types, this method will always return ``False``.
es: Los descriptores de miembros son atributos definidos en los módulos de extensión a través de las estructuras :c:type:`PyMemberDef`. Para implementaciones de Python sin tales tipos, este método siempre retornará ``False``.

source: Retrieving source code
es: Recuperar el código fuente

source: Get the documentation string for an object, cleaned up with :func:`cleandoc`. If the documentation string for an object is not provided and the object is a class, a method, a property or a descriptor, retrieve the documentation string from the inheritance hierarchy. Return ``None`` if the documentation string is invalid or missing.
es: Obtiene la cadena de documentación de un objeto, limpiada con :func:`cleandoc`. Si no se proporciona la cadena de documentación para un objeto y el objeto es una clase, un método, una propiedad o un descriptor, recupera la cadena de documentación de la jerarquía de herencia. Retorna ``None`` si la cadena de documentación no es válida o falta.

source: Documentation strings are now inherited if not overridden.
es: Las cadenas de documentación son ahora heredadas, si no anuladas.

source: Return in a single string any lines of comments immediately preceding the object's source code (for a class, function, or method), or at the top of the Python source file (if the object is a module). If the object's source code is unavailable, return ``None``. This could happen if the object has been defined in C or the interactive shell.
es: Retorna en una sola cadena las líneas de comentarios que preceden inmediatamente al código fuente del objeto (para una clase, función o método), o en la parte superior del archivo fuente de Python (si el objeto es un módulo). Si el código fuente del objeto no está disponible, retorna ``None``. Esto podría suceder si el objeto ha sido definido en C o en el shell interactivo.

source: Return the name of the (text or binary) file in which an object was defined. This will fail with a :exc:`TypeError` if the object is a built-in module, class, or function.
es: Retorna el nombre del archivo (de texto o binario) en el que se definió un objeto. Esto fallará con un :exc:`TypeError` si el objeto es un módulo, clase o función incorporada.

source: Try to guess which module an object was defined in. Return ``None`` if the module cannot be determined.
es: Intenta adivinar en qué módulo se definió un objeto. Retorna ``None`` si no se puede determinar el módulo.

source: Return the name of the Python source file in which an object was defined or ``None`` if no way can be identified to get the source. This will fail with a :exc:`TypeError` if the object is a built-in module, class, or function.
es: Retorna el nombre del archivo fuente de Python en el que se definió un objeto o ``None`` si no se puede identificar ninguna forma de obtener la fuente. Esto fallará con un :exc:`TypeError` si el objeto es un módulo, una clase o una función incorporados.
