Repository: python/python-docs-es
Catalog: library/inspect.po
Languages: es

source: Note that :func:`signature` and :ref:`Signature Object <inspect-signature-object>` provide the recommended API for callable introspection, and support additional behaviours (like positional-only arguments) that are sometimes encountered in extension module APIs. This function is retained primarily for use in code that needs to maintain compatibility with the Python 2 ``inspect`` module API.
es: Observe que :func:`signature` y :ref:`Objeto Signature <inspect-signature-object>` proporcionan la API recomendada para la introspección invocable, y soportan comportamientos adicionales (como los argumentos de sólo posición) que a veces se encuentran en las API de los módulos de extensión. Esta función se conserva principalmente para su uso en el código que necesita mantener la compatibilidad con la API de módulos de ``inspect`` de Python 2.

source: This function is now based on :func:`signature`, but still ignores ``__wrapped__`` attributes and includes the already bound first parameter in the signature output for bound methods.
es: Esta función se basa ahora en :func:`signature`, pero sigue ignorando los atributos ``__wrapped__`` e incluye el primer parámetro ya ligado en la salida del signature para los métodos ligados.

source: This method was previously documented as deprecated in favour of :func:`signature` in Python 3.5, but that decision has been reversed in order to restore a clearly supported standard interface for single-source Python 2/3 code migrating away from the legacy :func:`getargspec` API.
es: Este método fue documentado anteriormente como obsoleto en favor de :func:`signature` en Python 3.5, pero esa decisión ha sido revocada para restaurar una interfaz estándar claramente soportada para el código de una sola fuente en Python 2/3 que se aleja de la API heredada :func:`getargspec`.

source: Get information about arguments passed into a particular frame. A :term:`named tuple` ``ArgInfo(args, varargs, keywords, locals)`` is returned. *args* is a list of the argument names. *varargs* and *keywords* are the names of the ``*`` and ``**`` arguments or ``None``. *locals* is the locals dictionary of the given frame.
es: Obtener información sobre los argumentos pasados en un marco particular. Un :term:`named tuple` ``ArgInfo(args, varargs, keywords, locals)`` es retornado. *args* es una lista de los nombres de los argumentos. *varargs* y *keywords* son los nombres de los argumentos ``*`` y ``**`` o ``None``. *locals* es el diccionario local del marco dado.

source: This function was inadvertently marked as deprecated in Python 3.5.
es: Esta función fue inadvertidamente marcada como obsoleta en Python 3.5.

source: Format a pretty argument spec from the four values returned by :func:`getargvalues`. The format\* arguments are the corresponding optional formatting functions that are called to turn names and values into strings.
es: Formatea una bonita especificación de argumentos de los cuatro valores retornados por :func:`getargvalues`. Los argumentos de formato\* son las correspondientes funciones de formato opcionales que se llaman para convertir nombres y valores en cadenas.

source: Return a tuple of class cls's base classes, including cls, in method resolution order. No class appears more than once in this tuple. Note that the method resolution order depends on cls's type. Unless a very peculiar user-defined metatype is in use, cls will be the first element of the tuple.
es: Retorna una tupla de clases base de cls, incluyendo cls, en orden de resolución de métodos. Ninguna clase aparece más de una vez en esta tupla. Obsérvese que el orden de resolución de los métodos depende del tipo de cls. A menos que se utilice un meta tipo muy peculiar definido por el usuario, cls será el primer elemento de la tupla.

source: Bind the *args* and *kwds* to the argument names of the Python function or method *func*, as if it was called with them. For bound methods, bind also the first argument (typically named ``self``) to the associated instance. A dict is returned, mapping the argument names (including the names of the ``*`` and ``**`` arguments, if any) to their values from *args* and *kwds*. In case of invoking *func* incorrectly, i.e. whenever ``func(*args, **kwds)`` would raise an exception because of incompatible signature, an exception of the same type and the same or similar message is raised. For example::
es: Ata los *args* y *kwds* a los nombres de los argumentos de la función o método *func* de Python, como si se llamara con ellos. Para los métodos ligados, liga también el primer argumento (típicamente llamado ``self``) a la instancia asociada. Se retorna un diccionario, mapeando los nombres de los argumentos (incluyendo los nombres de los argumentos ``*`` y ``**``, si los hay) a sus valores de *args* y *kwds*. En caso de invocar *func* incorrectamente, es decir, siempre que ``func(*args, **kwds)`` plantee una excepción por firma incompatible, se plantea una excepción del mismo tipo y del mismo o similar mensaje. Por ejemplo::

source: Use :meth:`Signature.bind` and :meth:`Signature.bind_partial` instead.
es: Usa :meth:`Signature.bind` y :meth:`Signature.bind_partial` en su lugar.

source: Get the mapping of external name references in a Python function or method *func* to their current values. A :term:`named tuple` ``ClosureVars(nonlocals, globals, builtins, unbound)`` is returned. *nonlocals* maps referenced names to lexical closure variables, *globals* to the function's module globals and *builtins* to the builtins visible from the function body. *unbound* is the set of names referenced in the function that could not be resolved at all given the current module globals and builtins.
es: Obtener el mapeo de referencias de nombres externos en una función o método *func* de Python a sus valores actuales. Un :term:`named tuple` ``ClosureVars(nonlocals, globals, builtins, unbound)`` es retornado. *nonlocals* asigna los nombres referidos a las variables de cierre léxicas, *globals* a los globals de los módulos de la función y *builtins* a los builtins visibles desde el cuerpo de la función. *unbound* es el conjunto de nombres referenciados en la función que no pudieron ser resueltos en absoluto dados los actuales globals y builtins del módulo.

source: :exc:`TypeError` is raised if *func* is not a Python function or method.
es: :exc:`TypeError` es lanzado si *func* no es una función o método de Python.

source: Get the object wrapped by *func*. It follows the chain of :attr:`__wrapped__` attributes returning the last object in the chain.
es: Obtiene el objeto envuelto por *func*. Sigue la cadena de atributos :attr:`__wrapped__` retornando el último objeto de la cadena.

source: *stop* is an optional callback accepting an object in the wrapper chain as its sole argument that allows the unwrapping to be terminated early if the callback returns a true value. If the callback never returns a true value, the last object in the chain is returned as usual. For example, :func:`signature` uses this to stop unwrapping if any object in the chain has a ``__signature__`` attribute defined.
es: *stop* es una retrollamada opcional que acepta un objeto de la cadena envuelta como único argumento que permite terminar el desenvolvimiento antes de tiempo si la retrollamada retorna un valor real. Si la retrollamada nunca retorna un valor verdadero, el último objeto de la cadena se retorna como de costumbre. Por ejemplo, :func:`signature` utiliza esto para detener el desenvolvimiento si algún objeto de la cadena tiene definido el atributo ``__signature__``.

source: :exc:`ValueError` is raised if a cycle is encountered.
es: :exc:`ValueError` es lanzado si se encuentra un ciclo.

source: Compute the annotations dict for an object.
es: Calcular el diccionario de anotaciones de un objeto.

source: ``obj`` may be a callable, class, or module. Passing in an object of any other type raises :exc:`TypeError`.
es: ``obj`` puede ser un invocable, clase o módulo. Al pasar un objeto de cualquier otro tipo, se genera :exc:`TypeError`.

source: Returns a dict. ``get_annotations()`` returns a new dict every time it's called; calling it twice on the same object will return two different but equivalent dicts.
es: Retorna un diccionario. ``get_annotations()`` retorna un nuevo diccionario cada vez que se invoca; llamarlo dos veces en el mismo objeto retornara dos diccionarios diferentes pero equivalentes.

source: This function handles several details for you:
es: Esta función maneja varios detalles por usted:

source: If ``eval_str`` is true, values of type ``str`` will be un-stringized using :func:`eval()`. This is intended for use with stringized annotations (``from __future__ import annotations``).
es: Si ``eval_str`` es verdadero, los valores del tipo ``str`` dejarán de ser cadenas usando :func:`eval()`. La intención de este diseño es su uso con anotaciones convertidas a cadenas (``from __future__ import annotations``).

source: If ``obj`` doesn't have an annotations dict, returns an empty dict. (Functions and methods always have an annotations dict; classes, modules, and other types of callables may not.)
es: Si ``obj`` no tiene un diccionario de anotaciones, retorna un diccionario vacío. (Las funciones y los métodos siempre tienen un diccionario de anotaciones; las clases, los módulos y otros tipos de intocables pueden no tenerlo).

source: Ignores inherited annotations on classes. If a class doesn't have its own annotations dict, returns an empty dict.
es: Ignora las anotaciones heredadas en las clases. Si una clase no tiene su propio diccionario de anotaciones, retorna un diccionario vacío.

source: All accesses to object members and dict values are done using ``getattr()`` and ``dict.get()`` for safety.
es: Todos los accesos a los miembros del objeto y a los valores del diccionario se realizan mediante ``getattr()`` y ``dict.get()`` para mayor seguridad.

source: Always, always, always returns a freshly created dict.
es: Siempre, siempre, siempre retorna un dict recién creado.

source: ``eval_str`` controls whether or not values of type ``str`` are replaced with the result of calling :func:`eval()` on those values:
es: ``eval_str`` controla si los valores del tipo ``str`` se sustituyen o no por el resultado de llamar a :func:`eval()` sobre esos valores:

source: If eval_str is true, :func:`eval()` is called on values of type ``str``. (Note that ``get_annotations`` doesn't catch exceptions; if :func:`eval()` raises an exception, it will unwind the stack past the ``get_annotations`` call.)
es: Si eval_str es verdadero, :func:`eval()` se llama a valores de tipo ``str``. (Tenga en cuenta que ``get_annotations`` no detecta excepciones; si :func:`eval()` genera una excepción, desenrollará la pila más allá de la llamada ``get_annotations``).

source: If eval_str is false (the default), values of type ``str`` are unchanged.
es: Si eval_str es false (el valor predeterminado), los valores del tipo ``str`` no cambian.

source: ``globals`` and ``locals`` are passed in to :func:`eval()`; see the documentation for :func:`eval()` for more information. If ``globals`` or ``locals`` is ``None``, this function may replace that value with a context-specific default, contingent on ``type(obj)``:
es: ``globals`` and ``locals`` se pasan a :func:`eval()`; consulte la documentación de :func:`eval()` para obtener más información. Si ``globals`` o ``locals`` es ``None``, esta función puede reemplazar ese valor con un valor predeterminado específico del contexto, supeditado a ``type(obj)``:

source: If ``obj`` is a module, ``globals`` defaults to ``obj.__dict__``.
es: Si ``obj`` es un módulo, ``globals`` por defecto es ``obj.__dict__``.

source: If ``obj`` is a class, ``globals`` defaults to ``sys.modules[obj.__module__].__dict__`` and ``locals`` defaults to the ``obj`` class namespace.
es: Si ``obj`` es una clase, ``globals`` tiene como valor predeterminado ``sys.modules[obj.__module__].__dict__`` y ``locals`` es de forma predeterminada el espacio de nombres de clase ``obj`` .

source: If ``obj`` is a callable, ``globals`` defaults to ``obj.__globals__``, although if ``obj`` is a wrapped function (using ``functools.update_wrapper()``) it is first unwrapped.
es: Si ``obj`` es un callable, ``globals`` por defecto es ``obj.__globals__``, aunque si ``obj`` es una función envuelta (usando ``functools.update_wrapper()``) primero se desenvuelve.

source: Calling ``get_annotations`` is best practice for accessing the annotations dict of any object. See :ref:`annotations-howto` for more information on annotations best practices.
es: Llamar a ``get_annotations`` es una práctica recomendada para acceder al diccionario de anotaciones de cualquier objeto. Consulte :ref:`annotations-howto` para obtener más información sobre las prácticas recomendadas de anotaciones.

source: The interpreter stack
es: La pila del interprete

source: Some of the following functions return :class:`FrameInfo` objects. For backwards compatibility these objects allow tuple-like operations on all attributes except ``positions``. This behavior is considered deprecated and may be removed in the future.
es: Algunas de las siguientes funciones retornan objetos :class:`FrameInfo`. Por compatibilidad con versiones anteriores, estos objetos permiten operaciones similares a tuplas en todos los atributos excepto ``positions``. Este comportamiento se considera obsoleto y puede eliminarse en el futuro.

source: The :ref:`frame object <frame-objects>` that the record corresponds to.
es: El :ref:`frame object <frame-objects>` al que corresponde el registro.

source: The file name associated with the code being executed by the frame this record corresponds to.
es: El nombre del archivo asociado con el código que está ejecutando el marco al que corresponde este registro.

source: The line number of the current line associated with the code being executed by the frame this record corresponds to.
es: El número de línea de la línea actual asociada con el código que está ejecutando el marco al que corresponde este registro.

source: The function name that is being executed by the frame this record corresponds to.
es: El nombre de la función que está ejecutando el marco al que corresponde este registro.

source: A list of lines of context from the source code that's being executed by the frame this record corresponds to.
es: Una lista de líneas de contexto del código fuente que ejecuta el marco al que corresponde este registro.

source: The index of the current line being executed in the :attr:`code_context` list.
es: El índice de la línea actual que se está ejecutando en la lista :attr:`code_context`.

source: A :class:`dis.Positions` object containing the start line number, end line number, start column offset, and end column offset associated with the instruction being executed by the frame this record corresponds to.
es: Un objeto :class:`dis.Positions` que contiene el número de línea inicial, el número de línea final, el desplazamiento de columna inicial y el desplazamiento de columna final asociado con la instrucción que ejecuta el marco al que corresponde este registro.

source: Return a :term:`named tuple` instead of a :class:`tuple`.
es: Retorna un :term:`named tuple` en lugar de un :class:`tuple`.

source: :class:`!FrameInfo` is now a class instance (that is backwards compatible with the previous :term:`named tuple`).
es: :class:`!FrameInfo` ahora es una instancia de clase (que es retrocompatible con el anterior :term:`named tuple`).

source: The file name associated with the code being executed by the frame this traceback corresponds to.
es: El nombre de archivo asociado con el código que ejecuta el marco al que corresponde este rastreo.

source: The line number of the current line associated with the code being executed by the frame this traceback corresponds to.
es: El número de línea de la línea actual asociada con el código que está ejecutando el marco al que corresponde este rastreo.

source: The function name that is being executed by the frame this traceback corresponds to.
es: El nombre de la función que está ejecutando el marco al que corresponde este rastreo.

source: A list of lines of context from the source code that's being executed by the frame this traceback corresponds to.
es: Una lista de líneas de contexto del código fuente que ejecuta el marco al que corresponde este rastreo.

source: A :class:`dis.Positions` object containing the start line number, end line number, start column offset, and end column offset associated with the instruction being executed by the frame this traceback corresponds to.
es: Un objeto :class:`dis.Positions` que contiene el número de línea inicial, el número de línea final, el desplazamiento de columna inicial y el desplazamiento de columna final asociado con la instrucción que ejecuta el marco al que corresponde este rastreo.

source: :class:`!Traceback` is now a class instance (that is backwards compatible with the previous :term:`named tuple`).
es: :class:`!Traceback` ahora es una instancia de clase (que es retrocompatible con el anterior :term:`named tuple`).

source: Keeping references to frame objects, as found in the first element of the frame records these functions return, can cause your program to create reference cycles. Once a reference cycle has been created, the lifespan of all objects which can be accessed from the objects which form the cycle can become much longer even if Python's optional cycle detector is enabled. If such cycles must be created, it is important to ensure they are explicitly broken to avoid the delayed destruction of objects and increased memory consumption which occurs.
es: Mantener referencias a los objetos marco, como se encuentra en el primer elemento de los registros marco que estas funciones retornan, puede hacer que su programa cree ciclos de referencia. Una vez creado un ciclo de referencia, la vida útil de todos los objetos a los que se puede acceder desde los objetos que forman el ciclo puede ser mucho mayor, incluso si el detector de ciclos opcional de Python está activado. Si es necesario crear tales ciclos, es importante asegurarse de que se rompen explícitamente para evitar la destrucción retardada de los objetos y el aumento del consumo de memoria que se produce.

source: Though the cycle detector will catch these, destruction of the frames (and local variables) can be made deterministic by removing the cycle in a :keyword:`finally` clause. This is also important if the cycle detector was disabled when Python was compiled or using :func:`gc.disable`. For example::
es: Aunque el detector de ciclos los captará, la destrucción de los marcos (y las variables locales) puede hacerse determinísticamente eliminando el ciclo en una cláusula de :keyword:`finally`. Esto también es importante si el detector de ciclos fue desactivado cuando se compiló Python o usando :func:`gc.disable`. Por ejemplo::

source: If you want to keep the frame around (for example to print a traceback later), you can also break reference cycles by using the :meth:`frame.clear` method.
es: Si quieres mantener el marco alrededor (por ejemplo para imprimir una traceback más tarde), también puedes romper los ciclos de referencia utilizando el método :meth:`frame.clear`.

source: The optional *context* argument supported by most of these functions specifies the number of lines of context to return, which are centered around the current line.
es: El argumento opcional de *context*, apoyado por la mayoría de estas funciones, especifica el número de líneas de contexto a retornar, que se centran en la línea actual.

source: Get information about a frame or traceback object. A :class:`Traceback` object is returned.
es: Obtiene información sobre un marco o un objeto de rastreo. Se retorna un objeto :class:`Traceback`.

source: A :class:`Traceback` object is returned instead of a named tuple.
es: Se retorna un objeto :class:`Traceback` en lugar de una tupla con nombre.

source: Get a list of :class:`FrameInfo` objects for a frame and all outer frames. These frames represent the calls that lead to the creation of *frame*. The first entry in the returned list represents *frame*; the last entry represents the outermost call on *frame*'s stack.
es: Obtiene una lista de objetos :class:`FrameInfo` para un marco y todos los marcos externos. Estos marcos representan las llamadas que conducen a la creación de *frame*. La primera entrada en la lista retornada representa *frame*; la última entrada representa la llamada más externa en la pila de *frame*.

source: A list of :term:`named tuples <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` is returned.
es: Una lista de :term:`named tuples <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` es retornada.

source: A list of :class:`FrameInfo` objects is returned.
es: Se retorna una lista de objetos :class:`FrameInfo`.

source: Get a list of :class:`FrameInfo` objects for a traceback's frame and all inner frames. These frames represent calls made as a consequence of *frame*. The first entry in the list represents *traceback*; the last entry represents where the exception was raised.
es: Obtiene una lista de objetos :class:`FrameInfo` para el marco de un rastreo y todos los marcos internos. Estos marcos representan llamadas realizadas como consecuencia de *frame*. La primera entrada de la lista representa *traceback*; la última entrada representa dónde se generó la excepción.

source: Return the frame object for the caller's stack frame.
es: Retorna el objeto marco para el marco de la pila del que llama.

source: This function relies on Python stack frame support in the interpreter, which isn't guaranteed to exist in all implementations of Python. If running in an implementation without Python stack frame support this function returns ``None``.
es: Esta función se basa en el soporte del marco de la pila de Python en el intérprete, que no está garantizado que exista en todas las implementaciones de Python. Si se ejecuta en una implementación sin soporte de marcos de pila de Python, esta función retorna ``None``.

source: Return a list of :class:`FrameInfo` objects for the caller's stack. The first entry in the returned list represents the caller; the last entry represents the outermost call on the stack.
es: Retorna una lista de objetos :class:`FrameInfo` para la pila del que llama. La primera entrada en la lista retornada representa al que llama; la última entrada representa la llamada más externa de la pila.

source: Return a list of :class:`FrameInfo` objects for the stack between the current frame and the frame in which an exception currently being handled was raised in. The first entry in the list represents the caller; the last entry represents where the exception was raised.
es: Retorna una lista de objetos :class:`FrameInfo` para la pila entre el marco actual y el marco en el que se generó una excepción que se está manejando actualmente. La primera entrada en la lista representa al que llama; la última entrada representa dónde se generó la excepción.

source: Fetching attributes statically
es: Obteniendo atributos estáticamente

source: Both :func:`getattr` and :func:`hasattr` can trigger code execution when fetching or checking for the existence of attributes. Descriptors, like properties, will be invoked and :meth:`__getattr__` and :meth:`__getattribute__` may be called.
es: Tanto :func:`getattr` como :func:`hasattr` pueden desencadenar la ejecución del código al buscar o comprobar la existencia de atributos. Los descriptores, como las propiedades, serán invocados y se podrá llamar a :meth:`__getattr__` y :meth:`__getattribute__`.
