Repository: python/python-docs-es
Catalog: library/inspect.po
Languages: es

source: Return a list of source lines and starting line number for an object. The argument may be a module, class, method, function, traceback, frame, or code object. The source code is returned as a list of the lines corresponding to the object and the line number indicates where in the original source file the first line of code was found. An :exc:`OSError` is raised if the source code cannot be retrieved.
es: Retorna una lista de líneas de origen y el número de línea de inicio de un objeto. El argumento puede ser un objeto módulo, clase, método, función, traceback, marco o código. El código fuente es retornado como una lista de las líneas correspondientes al objeto y el número de línea que indica dónde se encontró la primera línea de código en el archivo fuente original. Un :exc:`OSError` es lanzado si el código fuente no puede ser recuperado.

source: :exc:`OSError` is raised instead of :exc:`IOError`, now an alias of the former.
es: :exc:`OSError` se lanza en lugar de :exc:`IOError`, ahora un alias del primero.

source: Return the text of the source code for an object. The argument may be a module, class, method, function, traceback, frame, or code object. The source code is returned as a single string. An :exc:`OSError` is raised if the source code cannot be retrieved.
es: Retorna el texto del código fuente de un objeto. El argumento puede ser un objeto de módulo, clase, método, función, rastreo, marco o código. El código fuente se retorna como una sola cadena. Un :exc:`OSError` es lanzado si el código fuente no puede ser recuperado.

source: Clean up indentation from docstrings that are indented to line up with blocks of code.
es: Limpiar la indentación de los docstrings que están indentados para alinearse con los bloques de código.

source: All leading whitespace is removed from the first line. Any leading whitespace that can be uniformly removed from the second line onwards is removed. Empty lines at the beginning and end are subsequently removed. Also, all tabs are expanded to spaces.
es: Todos los espacios blancos principales se eliminan de la primera línea. Cualquier espacio blanco principal que pueda ser uniformemente removido de la segunda línea en adelante es removido. Las líneas vacías al principio y al final se eliminan posteriormente. Además, todas las pestañas se expanden a los espacios.

source: Introspecting callables with the Signature object
es: Introspección de los invocables con el objeto Signature

source: The Signature object represents the call signature of a callable object and its return annotation. To retrieve a Signature object, use the :func:`signature` function.
es: El objeto Signature representa la firma de llamada de un objeto invocable y su anotación de retorno. Para recuperar un objeto Signature, utilice la función :func:`signature`.

source: Return a :class:`Signature` object for the given ``callable``::
es: Retorna un objeto :class:`Signature` para el ``callable`` dado::

source: Accepts a wide range of Python callables, from plain functions and classes to :func:`functools.partial` objects.
es: Acepta un amplio rango de invocables de Python, desde funciones y clases simples hasta objetos :func:`functools.partial`.

source: For objects defined in modules using stringized annotations (``from __future__ import annotations``), :func:`signature` will attempt to automatically un-stringize the annotations using :func:`inspect.get_annotations()`. The ``global``, ``locals``, and ``eval_str`` parameters are passed into :func:`inspect.get_annotations()` when resolving the annotations; see the documentation for :func:`inspect.get_annotations()` for instructions on how to use these parameters.
es: Para los objetos definidos en módulos que utilizan anotaciones convertidas a cadenas (``from __future__ import annotations``), :func:`signature` intentará invertir la conversión a cadenas de las anotaciones automáticamente usando :func:`inspect.get_annotations()`. Los parámetros ``global``, ``locals``, y ``eval_str`` se pasan a :func:`inspect.get_annotations()` al resolver las anotaciones; consulte la documentación de :func:`inspect.get_annotations()` para obtener instrucciones sobre cómo utilizar estos parámetros.

source: Raises :exc:`ValueError` if no signature can be provided, and :exc:`TypeError` if that type of object is not supported. Also, if the annotations are stringized, and ``eval_str`` is not false, the ``eval()`` call(s) to un-stringize the annotations could potentially raise any kind of exception.
es: Lanza :exc:`ValueError` si no se puede proporcionar ninguna signatura, y :exc:`TypeError` si ese tipo de objeto no es compatible. Además, si las anotaciones están convertidas a cadenas y ``eval_str`` no es falso, las llamadas ``eval()`` para invertir la conversión a cadenas de las anotaciones podrían generar cualquier tipo de excepción.

source: A slash(/) in the signature of a function denotes that the parameters prior to it are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
es: Una barra (/) en la signature de una función denota que los parámetros anteriores a ella son sólo posicionales. Para más información, ver :ref:`la pregunta frecuente en parámetros solo posicionales <faq-positional-only-arguments>`.

source: ``follow_wrapped`` parameter. Pass ``False`` to get a signature of ``callable`` specifically (``callable.__wrapped__`` will not be used to unwrap decorated callables.)
es: parámetro ``follow_wrapped``. Pasa ``False`` para obtener un signature de ``callable`` específicamente (``callable.__wrapped__`` no se usará para desenvolver los invocables decorados.)

source: ``globals``, ``locals``, and ``eval_str`` parameters.
es: Parámetros ``globals``, ``locals``, y ``eval_str``

source: Some callables may not be introspectable in certain implementations of Python. For example, in CPython, some built-in functions defined in C provide no metadata about their arguments.
es: Algunos invocables pueden no ser introspeccionables en ciertas implementaciones de Python. Por ejemplo, en CPython, algunas funciones incorporadas definidas en C no proporcionan metadatos sobre sus argumentos.

source: A Signature object represents the call signature of a function and its return annotation. For each parameter accepted by the function it stores a :class:`Parameter` object in its :attr:`parameters` collection.
es: Un objeto Signature representa la firma de llamada de una función y su anotación de retorno. Por cada parámetro aceptado por la función, almacena un objeto :class:`Parameter` en su colección :attr:`parameters`.

source: The optional *parameters* argument is a sequence of :class:`Parameter` objects, which is validated to check that there are no parameters with duplicate names, and that the parameters are in the right order, i.e. positional-only first, then positional-or-keyword, and that parameters with defaults follow parameters without defaults.
es: El argumento opcional *parámetros* es una secuencia de objetos :class:`Parameter`, que se valida para comprobar que no hay parámetros con nombres duplicados, y que los parámetros están en el orden correcto, es decir, primero sólo de posición, luego de posición o palabra clave, y que los parámetros con valores por defecto siguen a los parámetros sin valores por defecto.

source: The optional *return_annotation* argument, can be an arbitrary Python object, is the "return" annotation of the callable.
es: El argumento opcional *return_annotation*, puede ser un objeto Python arbitrario, es la anotación "return" del invocable.

source: Signature objects are *immutable*. Use :meth:`Signature.replace` to make a modified copy.
es: Los objetos signature son *inmutables*. Usar :meth:`Signature.replace` para hacer una copia modificada.

source: Signature objects are picklable and hashable.
es: Los objetos Signature se pueden seleccionar y se pueden manipular.

source: A special class-level marker to specify absence of a return annotation.
es: Un marcador especial de clase para especificar la ausencia de una anotación de retorno.

source: An ordered mapping of parameters' names to the corresponding :class:`Parameter` objects. Parameters appear in strict definition order, including keyword-only parameters.
es: Un mapeo ordenado de los nombres de los parámetros a los correspondientes objetos :class:`Parameter`. Los parámetros aparecen en estricto orden de definición, incluyendo parámetros de sólo palabras clave.

source: Python only explicitly guaranteed that it preserved the declaration order of keyword-only parameters as of version 3.7, although in practice this order had always been preserved in Python 3.
es: Python sólo garantizó explícitamente que conservaba el orden de declaración de los parámetros de sólo palabras clave a partir de la versión 3.7, aunque en la práctica este orden siempre se había conservado en Python 3.

source: The "return" annotation for the callable. If the callable has no "return" annotation, this attribute is set to :attr:`Signature.empty`.
es: La anotación de "retorno" para el invocable. Si el invocable no tiene ninguna anotación de "return", este atributo se establece en :attr:`Signature.empty`.

source: Create a mapping from positional and keyword arguments to parameters. Returns :class:`BoundArguments` if ``*args`` and ``**kwargs`` match the signature, or raises a :exc:`TypeError`.
es: Crear un mapeo de argumentos posicionales y de palabras clave a los parámetros. Retorna :class:`BoundArguments` si ``*args`` y ``**kwargs`` coinciden con el signature, o lanza un :exc:`TypeError`.

source: Works the same way as :meth:`Signature.bind`, but allows the omission of some required arguments (mimics :func:`functools.partial` behavior.) Returns :class:`BoundArguments`, or raises a :exc:`TypeError` if the passed arguments do not match the signature.
es: Funciona de la misma manera que :meth:`Signature.bind`, pero permite la omisión de algunos argumentos requeridos (imita el comportamiento de :func:`functools.partial`.) Retorna :class:`BoundArguments`, o lanza un :exc:`TypeError` si los argumentos pasados no coinciden con la firma.

source: Create a new Signature instance based on the instance replace was invoked on. It is possible to pass different ``parameters`` and/or ``return_annotation`` to override the corresponding properties of the base signature. To remove return_annotation from the copied Signature, pass in :attr:`Signature.empty`.
es: Crear una nueva instancia Signature basada en la instancia sobre la que se invocó el reemplazo. Es posible pasar diferentes ``parámetros`` y/o ``return_annotation`` para sobreescribir las propiedades correspondientes de la firma base. Para eliminar return_annotation del Signature copiado, pasar en :attr:`Signature.empty`.

source: Return a :class:`Signature` (or its subclass) object for a given callable ``obj``. Pass ``follow_wrapped=False`` to get a signature of ``obj`` without unwrapping its ``__wrapped__`` chain. ``globalns`` and ``localns`` will be used as the namespaces when resolving annotations.
es: Retorna un objeto :class:`Signature` (o su subclase) para un determinado ``obj`` invocable. Pasa ``follow_wrapped=False`` para obtener una signatura de ``obj`` sin desenvolver su cadena ``__wrapped__``. ``globalns`` y ``localns`` serán usados como los espacios de nombre cuando se resuelvan las anotaciones.

source: This method simplifies subclassing of :class:`Signature`::
es: Este método simplifica la subclasificación de :class:`Signature`::

source: ``globalns`` and ``localns`` parameters.
es: Parámetros ``globalns`` y ``localns``.

source: Parameter objects are *immutable*. Instead of modifying a Parameter object, you can use :meth:`Parameter.replace` to create a modified copy.
es: Los objetos parámetros son *inmutables*. En lugar de modificar un objeto Parámetro, puedes usar :meth:`Parameter.replace` para crear una copia modificada.

source: Parameter objects are picklable and hashable.
es: Los objetos Parámetro se pueden seleccionar y manipular.

source: A special class-level marker to specify absence of default values and annotations.
es: Un marcador especial de clase para especificar la ausencia de valores predeterminados y anotaciones.

source: The name of the parameter as a string. The name must be a valid Python identifier.
es: El nombre del parámetro como una cadena. El nombre debe ser un identificador Python válido.

source: CPython generates implicit parameter names of the form ``.0`` on the code objects used to implement comprehensions and generator expressions.
es: CPython genera nombres de parámetros implícitos de la forma ``.0`` en los objetos de código utilizados para implementar expresiones de comprensiones y generadores.

source: These parameter names are exposed by this module as names like ``implicit0``.
es: Los nombres de estos parámetros son expuestos por este módulo como nombres como ``implicit0``.

source: The default value for the parameter. If the parameter has no default value, this attribute is set to :attr:`Parameter.empty`.
es: El valor por defecto del parámetro. Si el parámetro no tiene un valor por defecto, este atributo se establece en :attr:`Parameter.empty`.

source: The annotation for the parameter. If the parameter has no annotation, this attribute is set to :attr:`Parameter.empty`.
es: La anotación para el parámetro. Si el parámetro no tiene ninguna anotación, este atributo se establece como :attr:`Parameter.empty`.

source: Describes how argument values are bound to the parameter. Possible values (accessible via :class:`Parameter`, like ``Parameter.KEYWORD_ONLY``):
es: Describe cómo los valores de los argumentos están vinculados al parámetro. Valores posibles (accesibles a través de :class:`Parameter`, como ``Parameter.KEYWORD_ONLY``):

source: Name
es: Nombre

source: Meaning
es: Significado

source: Value must be supplied as a positional argument. Positional only parameters are those which appear before a ``/`` entry (if present) in a Python function definition.
es: El valor debe proporcionarse como un argumento posicional. Los parámetros solo posicionales son aquellos que aparecen antes de una entrada ``/`` (si está presente) en una definición de función de Python. aceptan sólo uno o dos parámetros) los aceptan.

source: Value may be supplied as either a keyword or positional argument (this is the standard binding behaviour for functions implemented in Python.)
es: El valor puede ser suministrado como una palabra clave o como un argumento posicional (este es el comportamiento estándar de unión para las funciones implementadas en Python)

source: A tuple of positional arguments that aren't bound to any other parameter. This corresponds to a ``*args`` parameter in a Python function definition.
es: Una tupla de argumentos posicionales que no están ligados a ningún otro parámetro. Esto corresponde a un parámetro ``*args`` en una definición de función Python.

source: Value must be supplied as a keyword argument. Keyword only parameters are those which appear after a ``*`` or ``*args`` entry in a Python function definition.
es: El valor debe ser suministrado como argumento de la palabra clave. Los parámetros de sólo palabras clave son los que aparecen después de una entrada ``*`` o ``*args`` en una definición de función Python.

source: A dict of keyword arguments that aren't bound to any other parameter. This corresponds to a ``**kwargs`` parameter in a Python function definition.
es: Un dictado de argumentos de palabras clave que no están ligadas a ningún otro parámetro. Esto corresponde a un parámetro ``**kwargs`` en una definición de función Python.

source: Example: print all keyword-only arguments without default values::
es: Ejemplo: imprimir todos los argumentos de sólo palabras clave sin valores por defecto::

source: Describes a enum value of Parameter.kind.
es: Describe un valor enum como *Parameter.kind*.

source: Example: print all descriptions of arguments::
es: Ejemplo: imprimir todas las descripciones de los argumentos:

source: Create a new Parameter instance based on the instance replaced was invoked on. To override a :class:`Parameter` attribute, pass the corresponding argument. To remove a default value or/and an annotation from a Parameter, pass :attr:`Parameter.empty`.
es: Crear una nueva instancia de parámetros basada en la instancia en la que se invocó la sustitución. Para anular un atributo :class:`Parameter`, pasa el argumento correspondiente. Para eliminar un valor por defecto y/o una anotación de un parámetro, pasa :attr:`Parameter.empty`.

source: In Python 3.3 Parameter objects were allowed to have ``name`` set to ``None`` if their ``kind`` was set to ``POSITIONAL_ONLY``. This is no longer permitted.
es: En Python 3.3 se permitía que los objetos Parámetro tuvieran el ``name`` puesto en ``None`` si su ``kind`` estaba puesto en ``POSITIONAL_ONLY``. Esto ya no está permitido.

source: Result of a :meth:`Signature.bind` or :meth:`Signature.bind_partial` call. Holds the mapping of arguments to the function's parameters.
es: Resultado de una llamada :meth:`Signature.bind` o :meth:`Signature.bind_partial`. Mantiene el mapeo de los argumentos a los parámetros de la función.

source: A mutable mapping of parameters' names to arguments' values. Contains only explicitly bound arguments. Changes in :attr:`arguments` will reflect in :attr:`args` and :attr:`kwargs`.
es: Un mapeo mutable de los nombres de los parámetros a los valores de los argumentos. Contiene solo argumentos vinculados explícitamente. Los cambios en :attr:`arguments` se reflejarán en :attr:`args` y :attr:`kwargs`.

source: Should be used in conjunction with :attr:`Signature.parameters` for any argument processing purposes.
es: Debe ser usado en conjunto con :attr:`Signature.parameters` para cualquier propósito de procesamiento de argumentos.

source: Arguments for which :meth:`Signature.bind` or :meth:`Signature.bind_partial` relied on a default value are skipped. However, if needed, use :meth:`BoundArguments.apply_defaults` to add them.
es: Los argumentos para los cuales :meth:`Signature.bind` o :meth:`Signature.bind_partial` se basaban en un valor por defecto se saltan. Sin embargo, si es necesario, use :meth:`BoundArguments.apply_defaults` para añadirlos.

source: :attr:`arguments` is now of type :class:`dict`. Formerly, it was of type :class:`collections.OrderedDict`.
es: :attr:`arguments` ahora es de tipo :class:`dict`. Anteriormente, era de tipo :class:`collections.OrderedDict`.

source: A tuple of positional arguments values. Dynamically computed from the :attr:`arguments` attribute.
es: Una tupla de valores de argumentos posicionales. Calculados dinámicamente a partir del atributo :attr:`arguments`.

source: A dict of keyword arguments values. Dynamically computed from the :attr:`arguments` attribute.
es: Un diccionario de valores de argumentos de palabras clave. Calculados dinámicamente a partir del atributo :attr:`arguments`.

source: A reference to the parent :class:`Signature` object.
es: Una referencia al objeto padre :class:`Signature`.

source: Set default values for missing arguments.
es: Establece valores por defecto para los argumentos que faltan.

source: For variable-positional arguments (``*args``) the default is an empty tuple.
es: Para los argumentos de posición variable (``*args``) el valor por defecto es una tupla vacía.

source: For variable-keyword arguments (``**kwargs``) the default is an empty dict.
es: Para los argumentos de palabras clave variables (``**kwargs``) el valor por defecto es un diccionario vacío.

source: The :attr:`args` and :attr:`kwargs` properties can be used to invoke functions::
es: Las propiedades :attr:`args` y :attr:`kwargs` pueden ser usadas para invocar funciones::

source: :pep:`362` - Function Signature Object.
es: :pep:`362` - Función Objeto Signature.

source: The detailed specification, implementation details and examples.
es: La especificación detallada, los detalles de implementación y los ejemplos.

source: Classes and functions
es: Clases y funciones

source: Arrange the given list of classes into a hierarchy of nested lists. Where a nested list appears, it contains classes derived from the class whose entry immediately precedes the list. Each entry is a 2-tuple containing a class and a tuple of its base classes. If the *unique* argument is true, exactly one entry appears in the returned structure for each class in the given list. Otherwise, classes using multiple inheritance and their descendants will appear multiple times.
es: Organizar la lista de clases dada en una jerarquía de listas anidadas. Cuando aparece una lista anidada, contiene clases derivadas de la clase cuya entrada precede inmediatamente a la lista. Cada entrada es una tupla de 2 valores que contienen una clase y una tupla de sus clases base. Si el argumento *unique* es cierto, aparece exactamente una entrada en la estructura retornada para cada clase de la lista dada. De lo contrario, las clases que utilizan la herencia múltiple y sus descendientes aparecerán varias veces.

source: Get the names and default values of a Python function's parameters. A :term:`named tuple` is returned:
es: Obtener los nombres y valores por defecto de los parámetros de una función de Python. Se retorna un :term:`named tuple`:

source: *args* is a list of the positional parameter names. *varargs* is the name of the ``*`` parameter or ``None`` if arbitrary positional arguments are not accepted. *varkw* is the name of the ``**`` parameter or ``None`` if arbitrary keyword arguments are not accepted. *defaults* is an *n*-tuple of default argument values corresponding to the last *n* positional parameters, or ``None`` if there are no such defaults defined. *kwonlyargs* is a list of keyword-only parameter names in declaration order. *kwonlydefaults* is a dictionary mapping parameter names from *kwonlyargs* to the default values used if no argument is supplied. *annotations* is a dictionary mapping parameter names to annotations. The special key ``"return"`` is used to report the function return value annotation (if any).
es: *args* es una lista de los nombres de los parámetros posicionales. *varargs* es el nombre del parámetro ``*`` o ``None`` si no se aceptan argumentos posicionales arbitrarios. *varkw* es el nombre del parámetro ``**`` o ``None`` si no se aceptan argumentos de palabras clave arbitrarias. *defaults* es una *n*-tupla de valores de argumentos por defecto que corresponden a los últimos parámetros de posición *n*, o ``None`` si no hay tales valores por defecto definidos. *kwonlyargs* es una lista de nombres de parámetros de sólo palabras clave en orden de declaración. *kwonlydefaults* es un diccionario que asigna los nombres de los parámetros de *kwonlyargs* a los valores por defecto utilizados si no se suministra ningún argumento. *annotations* es un diccionario que asigna los nombres de los parámetros a las anotaciones. La tecla especial ``"return"`` se utiliza para informar de la anotación del valor de retorno de la función (si existe).
