Repository: python/python-docs-es
Catalog: library/inspect.po
Languages: es

source: For cases where you want passive introspection, like documentation tools, this can be inconvenient. :func:`getattr_static` has the same signature as :func:`getattr` but avoids executing code when it fetches attributes.
es: Para los casos en los que se quiera una introspección pasiva, como las herramientas de documentación, esto puede ser un inconveniente. :func:`getattr_static` tiene la misma firma que :func:`getattr` pero evita la ejecución de código cuando obtiene atributos.

source: Retrieve attributes without triggering dynamic lookup via the descriptor protocol, :meth:`__getattr__` or :meth:`__getattribute__`.
es: Recuperar los atributos sin activar la búsqueda dinámica a través del protocolo descriptor, :meth:`__getattr__` o :meth:`__getattribute__`.

source: Note: this function may not be able to retrieve all attributes that getattr can fetch (like dynamically created attributes) and may find attributes that getattr can't (like descriptors that raise AttributeError). It can also return descriptors objects instead of instance members.
es: Nota: es posible que esta función no pueda recuperar todos los atributos que getattr puede recuperar (como los atributos creados dinámicamente) y puede encontrar atributos que getattr no puede (como los descriptores que lanzan AttributeError). También puede retornar objetos descriptores en lugar de miembros de la instancia.

source: If the instance :attr:`~object.__dict__` is shadowed by another member (for example a property) then this function will be unable to find instance members.
es: Si la instancia :attr:`~object.__dict__` es ensombrecida por otro miembro (por ejemplo una propiedad) entonces esta función no podrá encontrar miembros de la instancia.

source: :func:`getattr_static` does not resolve descriptors, for example slot descriptors or getset descriptors on objects implemented in C. The descriptor object is returned instead of the underlying attribute.
es: :func:`getattr_static` no resuelve los descriptores, por ejemplo los descriptores de ranura o los descriptores de getset en los objetos implementados en C. El objeto descriptor se retorna en lugar del atributo subyacente.

source: You can handle these with code like the following. Note that for arbitrary getset descriptors invoking these may trigger code execution::
es: Puedes manejar esto con un código como el siguiente. Tenga en cuenta que la invocación de los descriptores de getset arbitrarios pueden desencadenar la ejecución del código::

source: Current State of Generators and Coroutines
es: Estado actual de los Generadores y las Corutinas

source: When implementing coroutine schedulers and for other advanced uses of generators, it is useful to determine whether a generator is currently executing, is waiting to start or resume or execution, or has already terminated. :func:`getgeneratorstate` allows the current state of a generator to be determined easily.
es: Al implementar los programadores de corutinas y para otros usos avanzados de los generadores, es útil determinar si un generador se está ejecutando actualmente, si está esperando para iniciarse o reanudarse o si ya ha terminado. :func:`getgeneratorstate` permite determinar fácilmente el estado actual de un generador.

source: Get current state of a generator-iterator.
es: Obtener el estado actual de un generador-iterador.

source: Possible states are:
es: Los posibles estados son:

source: GEN_CREATED: Waiting to start execution.
es: GEN_CREATED: Esperando para iniciar la ejecución.

source: GEN_RUNNING: Currently being executed by the interpreter.
es: GEN_RUNNING: Actualmente está siendo ejecutado por el intérprete.

source: GEN_SUSPENDED: Currently suspended at a yield expression.
es: GEN_SUSPENDED: Actualmente suspendido en una expresión yield.

source: GEN_CLOSED: Execution has completed.
es: GEN_CLOSED: La ejecución se ha completado.

source: Get current state of a coroutine object. The function is intended to be used with coroutine objects created by :keyword:`async def` functions, but will accept any coroutine-like object that has ``cr_running`` and ``cr_frame`` attributes.
es: Obtener el estado actual de un objeto de corutina. La función está pensada para ser usada con objetos de corutina creados por las funciones :keyword:`async def`, pero aceptará cualquier objeto de corutina que tenga los atributos ``cr_running`` y ``cr_frame``.

source: CORO_CREATED: Waiting to start execution.
es: CORO_CREATED: Esperando para iniciar la ejecución.

source: CORO_RUNNING: Currently being executed by the interpreter.
es: CORO_RUNNING: Actualmente está siendo ejecutado por el intérprete.

source: CORO_SUSPENDED: Currently suspended at an await expression.
es: CORO_SUSPENDED: Actualmente suspendido en una expresión de espera.

source: CORO_CLOSED: Execution has completed.
es: CORO_CLOSED: La ejecución se ha completado.

source: The current internal state of the generator can also be queried. This is mostly useful for testing purposes, to ensure that internal state is being updated as expected:
es: También se puede consultar el estado interno actual del generador. Esto es mayormente útil para fines de prueba, para asegurar que el estado interno se actualiza como se espera:

source: Get the mapping of live local variables in *generator* to their current values. A dictionary is returned that maps from variable names to values. This is the equivalent of calling :func:`locals` in the body of the generator, and all the same caveats apply.
es: Consigue el mapeo de las variables vivas locales en *generator* a sus valores actuales. Se retorna un diccionario que mapea de los nombres de las variables a los valores. Esto es el equivalente a llamar :func:`locals` en el cuerpo del generador, y se aplican todas las mismas advertencias.

source: If *generator* is a :term:`generator` with no currently associated frame, then an empty dictionary is returned. :exc:`TypeError` is raised if *generator* is not a Python generator object.
es: Si *generator* es un :term:`generator` sin marco asociado actualmente, entonces se retorna un diccionario vacío. :exc:`TypeError` es lanzado si *generator* no es un objeto generador de Python.

source: This function relies on the generator exposing a Python stack frame for introspection, which isn't guaranteed to be the case in all implementations of Python. In such cases, this function will always return an empty dictionary.
es: Esta función se basa en que el generador exponga un marco de pila de Python para la introspección, lo cual no está garantizado en todas las implementaciones de Python. En tales casos, esta función siempre retornará un diccionario vacío.

source: This function is analogous to :func:`~inspect.getgeneratorlocals`, but works for coroutine objects created by :keyword:`async def` functions.
es: Esta función es análoga a :func:`~inspect.getgeneratorlocals`, pero funciona para los objetos de corutina creados por funciones :keyword:`async def`.

source: Code Objects Bit Flags
es: Objetos de código Bit Flags

source: Python code objects have a ``co_flags`` attribute, which is a bitmap of the following flags:
es: Los objetos de código Python tienen un atributo ``co_flags``, que es un mapa de bits de los siguientes flags:

source: The code object is optimized, using fast locals.
es: El objeto del código está optimizado, usando locales rápidas (*fast locals*).

source: If set, a new dict will be created for the frame's ``f_locals`` when the code object is executed.
es: Si se establece, se creará un nuevo diccionario para el marco ``f_locals`` cuando se ejecute el objeto código.

source: The code object has a variable positional parameter (``*args``-like).
es: El objeto del código tiene un parámetro posicional variable (similar a ``*args``).

source: The code object has a variable keyword parameter (``**kwargs``-like).
es: El objeto del código tiene un parámetro de palabra clave variable (similar a ``**kwargs``).

source: The flag is set when the code object is a nested function.
es: El flag se fija cuando el objeto del código es una función anidada.

source: The flag is set when the code object is a generator function, i.e. a generator object is returned when the code object is executed.
es: El flag se fija cuando el objeto del código es una función generadora, es decir, un objeto generador es retornado cuando el objeto del código se ejecuta.

source: The flag is set when the code object is a coroutine function. When the code object is executed it returns a coroutine object. See :pep:`492` for more details.
es: El flag se configura cuando el objeto del código es una función de corutina. Cuando el objeto código se ejecuta, retorna un objeto de corutina. Ver :pep:`492` para más detalles.

source: The flag is used to transform generators into generator-based coroutines. Generator objects with this flag can be used in ``await`` expression, and can ``yield from`` coroutine objects. See :pep:`492` for more details.
es: El flag se utiliza para transformar generadores en corutinas basadas en generadores. Los objetos generadores con este flag pueden ser usados en la expresión ``await``, y objetos de corutina ``yield from``. Ver :pep:`492` para más detalles.

source: The flag is set when the code object is an asynchronous generator function. When the code object is executed it returns an asynchronous generator object. See :pep:`525` for more details.
es: El flag se configura cuando el objeto del código es una función generadora asíncrona. Cuando el objeto código se ejecuta, retorna un objeto generador asíncrono. Ver :pep:`525` para más detalles.

source: The flags are specific to CPython, and may not be defined in other Python implementations. Furthermore, the flags are an implementation detail, and can be removed or deprecated in future Python releases. It's recommended to use public APIs from the :mod:`inspect` module for any introspection needs.
es: Los flags son específicos de CPython, y no pueden ser definidas en otras implementaciones de Python. Además, los flags son un detalle de la implementación, y pueden ser eliminados o desaprobados en futuras versiones de Python. Se recomienda utilizar las APIs públicas del módulo :mod:`inspect` para cualquier necesidad de introspección.

source: Command Line Interface
es: Interfaz de la línea de comando

source: The :mod:`inspect` module also provides a basic introspection capability from the command line.
es: El módulo :mod:`inspect` también proporciona una capacidad básica de introspección desde la línea de comandos.

source: By default, accepts the name of a module and prints the source of that module. A class or function within the module can be printed instead by appended a colon and the qualified name of the target object.
es: Por defecto, acepta el nombre de un módulo e imprime la fuente de ese módulo. Una clase o función dentro del módulo puede imprimirse en su lugar añadiendo dos puntos y el nombre calificado del objeto objetivo.

source: Print information about the specified object rather than the source code
es: Imprimir información sobre el objeto especificado en lugar del código fuente
