Repository: python/python-docs-es
Catalog: library/io.po
Languages: io

source: Read and return all the bytes from the stream until EOF, using multiple calls to the stream if necessary.
io: Lee y retorna todos los *bytes* del *stream* hasta llegar al fin del archivo, usando, si es necesario, varias llamadas al *stream*.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b*, and return the number of bytes read. For example, *b* might be a :class:`bytearray`. If the object is in non-blocking mode and no bytes are available, ``None`` is returned.
io: Lee *bytes* en objeto pre-asignado y grabable :term:`bytes-like object` *b*, y retorna el número de *bytes* leído. Por ejemplo, *b* puede ser una clase de tipo :class:`bytearray`. Si el objeto está en modo sin bloquear y no hay *bytes* disponibles, se retorna ``None``.

source: Write the given :term:`bytes-like object`, *b*, to the underlying raw stream, and return the number of bytes written. This can be less than the length of *b* in bytes, depending on specifics of the underlying raw stream, and especially if it is in non-blocking mode. ``None`` is returned if the raw stream is set not to block and no single byte could be readily written to it. The caller may release or mutate *b* after this method returns, so the implementation should only access *b* during the method call.
io: Escribe :term:`bytes-like object` dado, *b*, al *stream* subyacente y retorna la cantidad de *bytes* grabadas. Esto puede ser menos que la longitud de *b* en *bytes*, dependiendo de la especificaciones del *stream* subyacente, especialmente si no está en modo no-bloqueo. ``None`` se retorna si el *stream* sin formato está configurado para no bloquear y ningún *byte* puede ser rápidamente grabada. El llamador puede deshacer o mutar *b* después que retorne este método, así que la implementación solo debería acceder *b* durante la ejecución al método.

source: The main difference with :class:`RawIOBase` is that methods :meth:`read`, :meth:`readinto` and :meth:`write` will try (respectively) to read as much input as requested or to consume all given output, at the expense of making perhaps more than one system call.
io: La diferencia principal de :class:`RawIOBase` es que los métodos :meth:`read`, :meth:`readinto` y :meth:`write` intentarán (respectivamente) leer la cantidad de información solicitada o consumir toda la salida dada, a expensas de hacer más de una llamada al sistema.

source: In addition, those methods can raise :exc:`BlockingIOError` if the underlying raw stream is in non-blocking mode and cannot take or give enough data; unlike their :class:`RawIOBase` counterparts, they will never return ``None``.
io: Adicionalmente, esos métodos pueden lanzar un :exc:`BlockingIOError` si el *stream* sin formato subyacente está en modo no bloqueo y no puede obtener or dar más datos; a diferencia de sus contrapartes :class:`RawIOBase`, estos nunca retornarán ``None``.

source: Besides, the :meth:`read` method does not have a default implementation that defers to :meth:`readinto`.
io: Además, el método :meth:`read` no tiene una implementación dada que difiere al método :meth:`readinto`.

source: A typical :class:`BufferedIOBase` implementation should not inherit from a :class:`RawIOBase` implementation, but wrap one, like :class:`BufferedWriter` and :class:`BufferedReader` do.
io: Una implementación típica de :class:`BufferedIOBase` no debería heredar una implementación de :class:`RawIOBase`, es más, debería envolver como uno, así como hacen las clases :class:`BufferedWriter` y :class:`BufferedReader`.

source: :class:`BufferedIOBase` provides or overrides these data attributes and methods in addition to those from :class:`IOBase`:
io: :class:`BufferedIOBase` proporciona o anula estos atributos y métodos de datos además de los de :class:`IOBase`:

source: The underlying raw stream (a :class:`RawIOBase` instance) that :class:`BufferedIOBase` deals with. This is not part of the :class:`BufferedIOBase` API and may not exist on some implementations.
io: El *stream* sin formato subyacente ( una instancia :class:`RawIOBase`) que :class:`BufferedIOBase` maneja. Esto no es parte de la API :class:`BufferedIOBase` y posiblemente no exista en algunas implementaciones.

source: Separate the underlying raw stream from the buffer and return it.
io: Separa el *stream* subyacente del búfer y lo retorna.

source: After the raw stream has been detached, the buffer is in an unusable state.
io: Luego que el *stream* sin formato ha sido separado, el búfer está en un estado inutilizable.

source: Some buffers, like :class:`BytesIO`, do not have the concept of a single raw stream to return from this method. They raise :exc:`UnsupportedOperation`.
io: Algunos búfer, como :class:`BytesIO`, no tienen el concepto de un *stream* sin formato singular para retornar de este método. Lanza un :exc:`UnsupportedOperation`.

source: Read and return up to *size* bytes. If the argument is omitted, ``None``, or negative, data is read and returned until EOF is reached. An empty :class:`bytes` object is returned if the stream is already at EOF.
io: Lee y retorna hasta *size* en *bytes*. Si el argumento está omitido, ``None``, o es negativo, los datos son leídos y retornados hasta que se alcance el fin del archivo. Un objeto :class:`bytes` vacío se retorna si el *stream* está al final del archivo.

source: If the argument is positive, and the underlying raw stream is not interactive, multiple raw reads may be issued to satisfy the byte count (unless EOF is reached first). But for interactive raw streams, at most one raw read will be issued, and a short result does not imply that EOF is imminent.
io: Si el argumento es positivo, y el *stream* subyacente no es interactiva, varias lecturas sin formato pueden ser otorgadas para satisfacer la cantidad de *byte* (al menos que primero se llegue al fin del archivo). Pero para los *streams* sin formato interactivas, a lo sumo una lectura sin formato será emitida y un resultado corto no implica que se haya llegado al fin del archivo.

source: A :exc:`BlockingIOError` is raised if the underlying raw stream is in non blocking-mode, and has no data available at the moment.
io: Un :exc:`BlockingIOError` se lanza si el *stream* subyacente está en modo no bloqueo y no tiene datos al momento.

source: Read and return up to *size* bytes, with at most one call to the underlying raw stream's :meth:`~RawIOBase.read` (or :meth:`~RawIOBase.readinto`) method. This can be useful if you are implementing your own buffering on top of a :class:`BufferedIOBase` object.
io: Lee y retorna hasta *size* en *bytes* con al menos una llamada al método :meth:`~RawIOBase.read` (o :meth:`~RawIOBase.readinto`) del *stream* subyacente. Esto puede ser útil si estás implementando tu propio búfer por encima de un objeto :class:`BufferedIOBase`.

source: If *size* is ``-1`` (the default), an arbitrary number of bytes are returned (more than zero unless EOF is reached).
io: Si *size* es ``-1`` (el valor dado) se retorna un monto arbitrario de *bytes* (más que cero al menos que se haya llegado al fin del archivo).

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b* and return the number of bytes read. For example, *b* might be a :class:`bytearray`.
io: Lee *bytes* a un objeto predeterminado y grabable :term:`bytes-like object` *b* y retorna el número de *bytes* leídos. Por ejemplo, *b* puede ser un :class:`bytearray`.

source: Like :meth:`read`, multiple reads may be issued to the underlying raw stream, unless the latter is interactive.
io: Como :meth:`read`, varias lecturas pueden ser otorgadas al *stream* sin formato subyacente al menos que esto último sea interactivo.

source: Read bytes into a pre-allocated, writable :term:`bytes-like object` *b*, using at most one call to the underlying raw stream's :meth:`~RawIOBase.read` (or :meth:`~RawIOBase.readinto`) method. Return the number of bytes read.
io: Leer *bytes* a un objeto predeterminado y grabable :term:`bytes-like object` *b* usando por lo menos una llamada al método :meth:`~RawIOBase.read` (o :meth:`~RawIOBase.readinto`) del *stream* subyacente. Retorna la cantidad de *bytes* leídas.

source: Write the given :term:`bytes-like object`, *b*, and return the number of bytes written (always equal to the length of *b* in bytes, since if the write fails an :exc:`OSError` will be raised). Depending on the actual implementation, these bytes may be readily written to the underlying stream, or held in a buffer for performance and latency reasons.
io: Escribe el :term:`bytes-like object` dado, *b*, y retorna el número de bytes grabados (siempre el equivalente en longitud de *b* en bytes, ya que si falla la grabación se lanza un :exc:`OSError`). Dependiendo en la implementación actual estos bytes pueden ser grabados rápidamente al *stream* subyacente o mantenido en un búfer por razones de rendimiento y latencia.

source: When in non-blocking mode, a :exc:`BlockingIOError` is raised if the data needed to be written to the raw stream but it couldn't accept all the data without blocking.
io: Cuando estás en modo no bloqueo, se lanza un :exc:`BlockingIOError` si los datos tenían que ser grabadas al *stream* sin formato pero no pudo aceptar todos los datos sin bloquear.

source: The caller may release or mutate *b* after this method returns, so the implementation should only access *b* during the method call.
io: El llamador puede otorgar o mutar *b* después que este método retorne algo, entonces la implementación debería acceder solamente a *b* durante la llamada al método.

source: Raw File I/O
io: Archivo sin formato E/S

source: A raw binary stream representing an OS-level file containing bytes data. It inherits :class:`RawIOBase`.
io: Una secuencia binaria sin procesar que representa un archivo de nivel de sistema operativo que contiene datos en bytes. Hereda :class:`RawIOBase`.

source: The *name* can be one of two things:
io: El *name* puede ser una de dos cosas:

source: a character string or :class:`bytes` object representing the path to the file which will be opened. In this case closefd must be ``True`` (the default) otherwise an error will be raised.
io: una cadena de caracteres u objeto de tipo :class:`bytes` representando la ruta del archivo en la que fue abierto. En este caso *closefd* es ``True`` (el valor dado) de otra manera un error será dada.

source: an integer representing the number of an existing OS-level file descriptor to which the resulting :class:`FileIO` object will give access. When the FileIO object is closed this fd will be closed as well, unless *closefd* is set to ``False``.
io: un *integer* representando el número de descriptores de archivos de nivel OS que resultan dando acceso a través del objeto :class:`FileIO`. Cuando el objeto *FileIO* está cerrado este fd cerrará también a no ser que *closefd* esté configurado a ``False``.

source: The *mode* can be ``'r'``, ``'w'``, ``'x'`` or ``'a'`` for reading (default), writing, exclusive creation or appending. The file will be created if it doesn't exist when opened for writing or appending; it will be truncated when opened for writing. :exc:`FileExistsError` will be raised if it already exists when opened for creating. Opening a file for creating implies writing, so this mode behaves in a similar way to ``'w'``. Add a ``'+'`` to the mode to allow simultaneous reading and writing.
io: El *mode* puede ser ``'r'``, ``'w'``, ``'x'`` o ``'a'`` para lectura (el valor dado), grabación, creación exclusiva o anexando. Si no existe el archivo se creará cuando se abra para grabar o anexar; se truncará cuando se abra para grabar. Se lanzará un error :exc:`FileExistsError` si ya existe cuando se abra para crear. Abriendo un archivo para crear implica grabar entonces este modo se comporta similarmente a ``'w'``. Agrega un ``'+'`` al modo para permitir lectura y grabación simultáneas.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*name*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
io: Un abridor personalizado puede ser usado pasando un llamador como *opener*. El descriptor de archivo subyacente es obtenido llamando *opener* con (*name*, *flags*). *opener* debe retornar un descriptor de archivo abierto (pasando :mod:`os.open` como *opener* resulta con funcionamiento similar a pasando ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
io: El archivo recién creado es :ref:`non-inheritable <fd_inheritance>`.

source: See the :func:`open` built-in function for examples on using the *opener* parameter.
io: Ver la función incorporada :func:`open` para ejemplos usando el parámetro *opener*.

source: The *opener* parameter was added. The ``'x'`` mode was added.
io: El parámetro *opener* fue agregado. El modo ``'x'`` fue agregado.

source: The file is now non-inheritable.
io: El archivo ahora no es heredable.

source: :class:`FileIO` provides these data attributes in addition to those from :class:`RawIOBase` and :class:`IOBase`:
io: :class:`FileIO` proporciona estos atributos de datos además de los de :class:`RawIOBase` y :class:`IOBase`:

source: The mode as given in the constructor.
io: El modo dado en el constructor.

source: The file name. This is the file descriptor of the file when no name is given in the constructor.
io: El nombre del archivo. Este es el descriptor del archivo cuando no se proporciona ningún nombre en el constructor.

source: Buffered Streams
io: *Streams* almacenados (búfer)

source: Buffered I/O streams provide a higher-level interface to an I/O device than raw I/O does.
io: *Streams* E/S almacenadas (búfer) proveen una interfaz de más alto nivel a un dispositivo E/S que a un E/S sin formato.

source: A binary stream using an in-memory bytes buffer. It inherits :class:`BufferedIOBase`. The buffer is discarded when the :meth:`~IOBase.close` method is called.
io: Una secuencia binaria que utiliza un búfer de bytes en memoria. Hereda :class:`BufferedIOBase`. El búfer se descarta cuando se llama al método :meth:`~IOBase.close`.

source: The optional argument *initial_bytes* is a :term:`bytes-like object` that contains initial data.
io: El argumento opcional *initial_bytes* es un :term:`bytes-like object` que contiene datos iniciales.

source: :class:`BytesIO` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
io: :class:`BytesIO` provee o anula estos métodos además de los de :class:`BufferedIOBase` y :class:`IOBase`:

source: Return a readable and writable view over the contents of the buffer without copying them. Also, mutating the view will transparently update the contents of the buffer::
io: Retorna una vista legible y grabable acerca de los contenidos del búfer sin copiarlos. Además mutando la vista actualizará de forma transparente los contenidos del búfer::

source: As long as the view exists, the :class:`BytesIO` object cannot be resized or closed.
io: Mientras exista la vista el objeto :class:`BytesIO` no se le puede cambiar el tamaño o cerrado.

source: Return :class:`bytes` containing the entire contents of the buffer.
io: Retorna :class:`bytes` que contiene los contenidos enteros del búfer.

source: In :class:`BytesIO`, this is the same as :meth:`~BufferedIOBase.read`.
io: En la clase :class:`BytesIO` esto es lo mismo que :meth:`~BufferedIOBase.read`.

source: The *size* argument is now optional.
io: Ahora es opcional el argumento *size*.

source: In :class:`BytesIO`, this is the same as :meth:`~BufferedIOBase.readinto`.
io: En la clase :class:`BytesIO` esto es lo mismo que :meth:`~BufferedIOBase.readinto`.

source: A buffered binary stream providing higher-level access to a readable, non seekable :class:`RawIOBase` raw binary stream. It inherits :class:`BufferedIOBase`.
io: Una secuencia binaria almacenada en búfer que proporciona acceso de nivel superior a una secuencia binaria sin procesar :class:`RawIOBase` legible y no buscable. Hereda :class:`BufferedIOBase`.

source: When reading data from this object, a larger amount of data may be requested from the underlying raw stream, and kept in an internal buffer. The buffered data can then be returned directly on subsequent reads.
io: Al leer datos de este objeto, es posible que se solicite una mayor cantidad de datos del flujo sin procesar subyacente y se mantenga en un búfer interno. Los datos almacenados en búfer se pueden retornar directamente en lecturas posteriores.

source: The constructor creates a :class:`BufferedReader` for the given readable *raw* stream and *buffer_size*. If *buffer_size* is omitted, :data:`DEFAULT_BUFFER_SIZE` is used.
io: El constructor crea un :class:`BufferedReader` para el *stream* legible sin formato *raw* y *buffer_size*. Si se omite *buffer_size* se usa :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedReader` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
io: :class:`BufferedReader` provee o anula los métodos en adición a los de :class:`BufferedIOBase` y :class:`IOBase`:

source: Return bytes from the stream without advancing the position. At most one single read on the raw stream is done to satisfy the call. The number of bytes returned may be less or more than requested.
io: Retorna *bytes* del *stream* sin avanzar la posición. Al menos una lectura se hace al *stream* sin formato para satisfacer el llamado. El número de bytes retornados puede ser menor o mayor al solicitado.

source: Read and return *size* bytes, or if *size* is not given or negative, until EOF or if the read call would block in non-blocking mode.
io: Lee y retorna *size* *bytes* o si no se da *size*, o es negativo, hasta el fin del archivo o si la llamada leída podría bloquear in modo no bloquear.

source: Read and return up to *size* bytes with only one call on the raw stream. If at least one byte is buffered, only buffered bytes are returned. Otherwise, one raw stream read call is made.
io: Lee y retorna hasta el tamaño *size* en *bytes* con solo un llamado al *stream*. Si al menos un *byte* pasa por el proceso de búfer, solo se retornan *buffered bytes*. De lo contrario se realiza un llamado de lectura de un *stream* sin formato.

source: A buffered binary stream providing higher-level access to a writeable, non seekable :class:`RawIOBase` raw binary stream. It inherits :class:`BufferedIOBase`.
io: Un flujo binario almacenado en búfer que proporciona acceso de nivel superior a un flujo binario sin formato :class:`RawIOBase` que se puede escribir y no se puede buscar. Hereda :class:`BufferedIOBase`.

source: When writing to this object, data is normally placed into an internal buffer. The buffer will be written out to the underlying :class:`RawIOBase` object under various conditions, including:
io: Al escribir en este objeto, los datos normalmente se colocan en un búfer interno. El búfer se escribirá en el objeto :class:`RawIOBase` subyacente en varias condiciones, que incluyen:

source: when the buffer gets too small for all pending data;
io: cuando el búfer se vuelve demasiado pequeño para todos los datos pendientes;

source: when the :class:`BufferedWriter` object is closed or destroyed.
io: cuando el objeto :class:`BufferedWriter` is cerrado o anulado.

source: The constructor creates a :class:`BufferedWriter` for the given writeable *raw* stream. If the *buffer_size* is not given, it defaults to :data:`DEFAULT_BUFFER_SIZE`.
io: El constructor crea un :class:`BufferedWriter` para el *stream* grabable *raw*. Si no es dado el *buffer_size*, recurre el valor :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedWriter` provides or overrides these methods in addition to those from :class:`BufferedIOBase` and :class:`IOBase`:
io: :class:`BufferedWriter` provee o anula estos métodos además de los de :class:`BufferedIOBase` y :class:`IOBase`:

source: Force bytes held in the buffer into the raw stream. A :exc:`BlockingIOError` should be raised if the raw stream blocks.
io: Forzar bytes retenidos en el búfer al *stream* sin formato. Un :exc:`BlockingIOError` debería ser lanzado si el *stream* sin formato bloquea.

source: Write the :term:`bytes-like object`, *b*, and return the number of bytes written. When in non-blocking mode, a :exc:`BlockingIOError` is raised if the buffer needs to be written out but the raw stream blocks.
io: Escribe el :term:`bytes-like object`, *b*, y retorna el número de bytes grabados. Cuando estás en modo no-bloqueo, se lanza un :exc:`BlockingIOError` si el búfer tiene que ser escrito pero el *stream* sin formato bloquea.

source: A buffered binary stream providing higher-level access to a seekable :class:`RawIOBase` raw binary stream. It inherits :class:`BufferedReader` and :class:`BufferedWriter`.
io: Un flujo binario almacenado en búfer que proporciona acceso de nivel superior a un flujo binario sin formato :class:`RawIOBase` que se puede buscar. Hereda :class:`BufferedReader` y :class:`BufferedWriter`.

source: The constructor creates a reader and writer for a seekable raw stream, given in the first argument. If the *buffer_size* is omitted it defaults to :data:`DEFAULT_BUFFER_SIZE`.
io: El constructor crea un lector y una grabación para un *stream* sin formato buscable, dado en el primer argumento. Si se omite el *buffer_size* este recae sobre el valor predeterminado :data:`DEFAULT_BUFFER_SIZE`.

source: A buffered binary stream providing higher-level access to two non seekable :class:`RawIOBase` raw binary streams---one readable, the other writeable. It inherits :class:`BufferedIOBase`.
io: Un flujo binario almacenado en búfer que proporciona acceso de nivel superior a dos flujos binarios sin procesar :class:`RawIOBase` no buscables, uno legible y el otro escribible. Hereda :class:`BufferedIOBase`.

source: *reader* and *writer* are :class:`RawIOBase` objects that are readable and writeable respectively. If the *buffer_size* is omitted it defaults to :data:`DEFAULT_BUFFER_SIZE`.
io: *reader* y *writer* son objetos :class:`RawIOBase` que son respectivamente legibles y escribibles. Si se omite *buffer_size* este se recae sobre el valor predeterminado :data:`DEFAULT_BUFFER_SIZE`.

source: :class:`BufferedRWPair` implements all of :class:`BufferedIOBase`\'s methods except for :meth:`~BufferedIOBase.detach`, which raises :exc:`UnsupportedOperation`.
io: :class:`BufferedRWPair` implementa todos los métodos de :class:`BufferedIOBase` excepto por :meth:`~BufferedIOBase.detach`, que lanza un :exc:`UnsupportedOperation`.

source: :class:`BufferedRWPair` does not attempt to synchronize accesses to its underlying raw streams. You should not pass it the same object as reader and writer; use :class:`BufferedRandom` instead.
io: :class:`BufferedRWPair` no intenta sincronizar accesos al *stream* sin formato subyacente. No debes pasar el mismo objeto como legible y escribible; usa :class:`BufferedRandom` en su lugar.

source: :class:`TextIOBase` provides or overrides these data attributes and methods in addition to those from :class:`IOBase`:
io: :class:`TextIOBase` provee o anula estos atributos y métodos de datos además de los de :class:`IOBase`:

source: The name of the encoding used to decode the stream's bytes into strings, and to encode strings into bytes.
io: El nombre de la codificación utilizada para decodificar los *bytes* del *stream* a cadenas de caracteres y para codificar cadenas de caracteres en bytes.

source: The error setting of the decoder or encoder.
io: La configuración de error del decodificador o codificador.
