Repository: python/python-docs-es
Catalog: library/io.po
Languages: io

source: A string, a tuple of strings, or ``None``, indicating the newlines translated so far. Depending on the implementation and the initial constructor flags, this may not be available.
io: Una cadena de caracteres, una tupla de cadena de caracteres, o ``None``, indicando las nuevas líneas traducidas hasta ese momento. Dependiendo de la implementación y los indicadores iniciales del constructor, esto puede no estar disponible.

source: The underlying binary buffer (a :class:`BufferedIOBase` instance) that :class:`TextIOBase` deals with. This is not part of the :class:`TextIOBase` API and may not exist in some implementations.
io: El búfer binario subyacente (una instancia :class:`BufferedIOBase`) que maneja :class:`TextIOBase`. Esto no es parte del API de :class:`TextIOBase` y puede no existir en algunas implementaciones.

source: Separate the underlying binary buffer from the :class:`TextIOBase` and return it.
io: Separa el búfer binario subyacente de :class:`TextIOBase` y lo retorna.

source: After the underlying buffer has been detached, the :class:`TextIOBase` is in an unusable state.
io: Una vez que se ha separado el búfer subyacente, la :class:`TextIOBase` está en un estado inutilizable.

source: Some :class:`TextIOBase` implementations, like :class:`StringIO`, may not have the concept of an underlying buffer and calling this method will raise :exc:`UnsupportedOperation`.
io: Algunas implementaciones de :class:`TextIOBase`, como :class:`StringIO`, puede no tener el concepto de un búfer subyacente y llamar a este método se lanzará :exc:`UnsupportedOperation`.

source: Read and return at most *size* characters from the stream as a single :class:`str`. If *size* is negative or ``None``, reads until EOF.
io: Lee y retorna como máximo *size* caracteres del *stream* como un :class:`str` singular. Si *size* es negativo o ``None``, lee hasta llegar al fin del archivo.

source: If *size* is specified, at most *size* characters will be read.
io: Si se especifica *size* como máximo *size* de caracteres será leído.

source: Return the new absolute position as an opaque number.
io: Retorna la nueva posición absoluta como un número opaco.

source: Return the current stream position as an opaque number. The number does not usually represent a number of bytes in the underlying binary storage.
io: Retorna la posición actual de la secuencia como un número opaco. El número no suele representar una cantidad de bytes en el almacenamiento binario subyacente.

source: Write the string *s* to the stream and return the number of characters written.
io: Escribe la cadena de caracteres *s* al *stream* y retorna el número de caracteres grabadas.

source: A buffered text stream providing higher-level access to a :class:`BufferedIOBase` buffered binary stream. It inherits :class:`TextIOBase`.
io: Un flujo de texto almacenado en búfer que proporciona acceso de nivel superior a un flujo binario almacenado en búfer :class:`BufferedIOBase`. Hereda :class:`TextIOBase`.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled. Pass ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error (the default of ``None`` has the same effect), or pass ``'ignore'`` to ignore errors. (Note that ignoring encoding errors can lead to data loss.) ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data. ``'backslashreplace'`` causes malformed data to be replaced by a backslashed escape sequence. When writing, ``'xmlcharrefreplace'`` (replace with the appropriate XML character reference) or ``'namereplace'`` (replace with ``\N{...}`` escape sequences) can be used. Any other error handling name that has been registered with :func:`codecs.register_error` is also valid.
io: *errors* es una cadena de caracteres opcional que especifica cómo se manejan los errores codificados y descodificados. Pasa ``'strict'`` para lanzar una excepción :exc:`ValueError` si hay un error codificado (el valor predeterminado ``None`` tiene el mismo efecto), o pasa ``'ignore'`` para ignorar errores. (Tenga en cuenta que ignorar errores puede llevar a perder datos). ``'replace'`` causa un marcador de reemplazo (como ``'?'``) para ser insertado donde haya datos mal formados. ``'backslashreplace'`` reemplaza datos mal formados con una secuencia de escape de tipo barra invertida. Cuando se escribe, ``'xmlcharrefreplace'`` (reemplazar con la referencia apropiada de XML) o ``'namereplace'`` (reemplazar con secuencias de caracteres ``\N{…}``) pueden ser usadas. Cualquier otro nombre de manejador de errores que hayan sido registrados con :func:`codecs.register_error` también son validas.

source: *newline* controls how line endings are handled. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
io: *newline* controla cómo finalizar las terminaciones de líneas. Pueden ser ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. Funciona de la siguiente manera:

source: When reading input from the stream, if *newline* is ``None``, :term:`universal newlines` mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If *newline* is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If *newline* has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
io: Al leer la entrada de la secuencia, si *newline* es ``None``, el modo :term:`universal newlines` está habilitado. Las líneas de la entrada pueden terminar en ``'\n'``, ``'\r'`` o ``'\r\n'``, y se traducen a ``'\n'`` antes de retornarse al llamador. Si *newline* es ``''``, el modo de salto de línea universal está habilitado, pero los finales de línea se retornan a la persona que llama sin traducir. Si *newline* tiene alguno de los otros valores legales, las líneas de entrada solo terminan con la cadena dada y la línea final se retorna al llamador sin traducir.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
io: Al escribir la salida al *stream*, si *newline* es ``None``, cualquier carácter ``'\n'`` escrito son traducidos a la línea separador *default* del sistema, :data:`os.linesep`. Si *newline* es ``''`` o ``'\n'``, la traducción no ocurre. Si *newline* es de cualquier de los otros valores legales, cualquier carácter ``'\n'`` escrito es traducido a la cadena de caracteres dada.

source: The *write_through* argument has been added.
io: Se ha agregado el argumento *write_through*.

source: The default *encoding* is now ``locale.getpreferredencoding(False)`` instead of ``locale.getpreferredencoding()``. Don't change temporary the locale encoding using :func:`locale.setlocale`, use the current locale encoding instead of the user preferred encoding.
io: La codificación (*encoding*) por defecto es ahora ``locale.getpreferredencoding(False)`` en vez de ``locale.getpreferredencoding()``. No cambie temporalmente la codificación local usando :func:`locale.setlocale`, use la codificación local actual en vez del preferido del usuario.

source: The *encoding* argument now supports the ``"locale"`` dummy encoding name.
io: El argumento *encoding* ahora admite el nombre de codificación ficticia ``"locale"``.

source: :class:`TextIOWrapper` provides these data attributes and methods in addition to those from :class:`TextIOBase` and :class:`IOBase`:
io: :class:`TextIOWrapper` proporciona estos atributos y métodos de datos además de los de :class:`TextIOBase` y :class:`IOBase`:

source: Whether line buffering is enabled.
io: Si el almacenamiento en línea está habilitado.

source: Whether writes are passed immediately to the underlying binary buffer.
io: Si grabaciones son pasadas inmediatamente al búfer binario subyacente.

source: Reconfigure this text stream using new settings for *encoding*, *errors*, *newline*, *line_buffering* and *write_through*.
io: Reconfigura este *stream* textual usando las nuevas configuraciones de *encoding*, *errors*, *newline*, *line_buffering* y *write_through*.

source: Parameters not specified keep current settings, except ``errors='strict'`` is used when *encoding* is specified but *errors* is not specified.
io: Los parámetros que no son especificados mantienen las configuraciones actuales, excepto por ``errors='strict'`` cuando *encoding* se especifica pero *errors* no está especificado.

source: It is not possible to change the encoding or newline if some data has already been read from the stream. On the other hand, changing encoding after write is possible.
io: No es posible cambiar la codificación o nueva línea si algunos datos han sido captados por el *stream*. Sin embargo, cambiando la codificación después de grabar es posible.

source: This method does an implicit stream flush before setting the new parameters.
io: Este método hace una nivelación implícita del *stream* antes de configurar los nuevos parámetros.

source: The method supports ``encoding="locale"`` option.
io: El método admite la opción ``encoding="locale"``.

source: A text stream using an in-memory text buffer. It inherits :class:`TextIOBase`.
io: Una secuencia de texto que utiliza un búfer de texto en memoria. Hereda :class:`TextIOBase`.

source: The text buffer is discarded when the :meth:`~IOBase.close` method is called.
io: El búfer de texto se descarta cuando se llama al método :meth:`~IOBase.close`.

source: The initial value of the buffer can be set by providing *initial_value*. If newline translation is enabled, newlines will be encoded as if by :meth:`~TextIOBase.write`. The stream is positioned at the start of the buffer which emulates opening an existing file in a ``w+`` mode, making it ready for an immediate write from the beginning or for a write that would overwrite the initial value. To emulate opening a file in an ``a+`` mode ready for appending, use ``f.seek(0, io.SEEK_END)`` to reposition the stream at the end of the buffer.
io: El valor inicial del búfer se puede establecer proporcionando *initial_value*. Si la traducción de nuevas líneas está habilitada, las nuevas líneas se codificarán como si fueran :meth:`~TextIOBase.write`. La secuencia se coloca al comienzo del búfer que emula la apertura de un archivo existente en un modo ``w+`` , preparándolo para una escritura inmediata desde el principio o para una escritura que sobrescribiría el valor inicial. Para emular la apertura de un archivo en un modo ``a+`` listo para anexar, use ``f.seek(0, io.SEEK_END)`` para reponer la secuencia al final del búfer.

source: The *newline* argument works like that of :class:`TextIOWrapper`, except that when writing output to the stream, if *newline* is ``None``, newlines are written as ``\n`` on all platforms.
io: El argumento *newline* funciona como el de la clase :class:`TextIOWrapper`, excepto que cuando escribe al flujo de salida, si *newline* es ``None``, se escriben líneas nuevas como ``\n`` en todas las plataformas

source: :class:`StringIO` provides this method in addition to those from :class:`TextIOBase` and :class:`IOBase`:
io: :class:`StringIO` proporciona este método además de los de :class:`TextIOBase` y :class:`IOBase`:

source: Example usage::
io: Ejemplos de uso::

source: A helper codec that decodes newlines for :term:`universal newlines` mode. It inherits :class:`codecs.IncrementalDecoder`.
io: Un códec auxiliar que descodifica nuevas líneas para el modo :term:`universal newlines`. Hereda :class:`codecs.IncrementalDecoder`.

source: Performance
io: Rendimiento

source: This section discusses the performance of the provided concrete I/O implementations.
io: Esta sección discute el rendimiento de las implementaciones concretas de E/S proporcionadas.

source: By reading and writing only large chunks of data even when the user asks for a single byte, buffered I/O hides any inefficiency in calling and executing the operating system's unbuffered I/O routines. The gain depends on the OS and the kind of I/O which is performed. For example, on some modern OSes such as Linux, unbuffered disk I/O can be as fast as buffered I/O. The bottom line, however, is that buffered I/O offers predictable performance regardless of the platform and the backing device. Therefore, it is almost always preferable to use buffered I/O rather than unbuffered I/O for binary data.
io: Leyendo y grabando solamente grandes porciones de datos incluso cuando el usuario pide para solo un byte, E/S de tipo búfer esconde toda ineficiencia llamando y ejecutando las rutinas E/S del sistema operativo que no ha pasado por el proceso de búfer. La ganancia depende en el OS y el tipo de E/S que se ejecuta. Por ejemplo, en algunos sistemas operativos modernos como Linux, un disco E/S sin búfer puede ser rápido como un E/S búfer. Al final, sin embargo, es que el E/S búfer ofrece rendimiento predecible independientemente de la plataforma y el dispositivo de respaldo. Entonces es siempre preferible user E/S búfer que E/S sin búfer para datos binarios.

source: :class:`StringIO`, however, is a native in-memory unicode container and will exhibit similar speed to :class:`BytesIO`.
io: :class:`StringIO`, sin embargo, es un contenedor unicode nativo en memoria y exhibirá una velocidad similar a :class:`BytesIO`.

source: Multi-threading
io: Multihilo

source: Binary buffered objects (instances of :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` and :class:`BufferedRWPair`) protect their internal structures using a lock; it is therefore safe to call them from multiple threads at once.
io: Objetos binarios búfer (instancias de :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` y :class:`BufferedRWPair`) protegen sus estructuras internas usando un bloqueo; es seguro, entonces, llamarlos de varios hilos a la vez.

source: :class:`TextIOWrapper` objects are not thread-safe.
io: objetos :class:`TextIOWrapper` no son seguros para subprocesos.

source: Reentrancy
io: Reentrada

source: Binary buffered objects (instances of :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` and :class:`BufferedRWPair`) are not reentrant. While reentrant calls will not happen in normal situations, they can arise from doing I/O in a :mod:`signal` handler. If a thread tries to re-enter a buffered object which it is already accessing, a :exc:`RuntimeError` is raised. Note this doesn't prohibit a different thread from entering the buffered object.
io: Objetos binarios búfer (instancias de :class:`BufferedReader`, :class:`BufferedWriter`, :class:`BufferedRandom` y :class:`BufferedRWPair`) no son reentrante. Mientras llamadas reentrantes no ocurren en situaciones normales pueden surgir haciendo E/S en un manejador :mod:`signal`. Si un hilo trata de entrar de nuevo a un objeto búfer que se está accediendo actualmente, se lanza un :exc:`RuntimeError`. Tenga en cuenta que esto no prohíbe un hilo diferente entrando un objeto búfer.

source: The above implicitly extends to text files, since the :func:`open()` function will wrap a buffered object inside a :class:`TextIOWrapper`. This includes standard streams and therefore affects the built-in :func:`print()` function as well.
io: Lo anterior se extiende implícitamente a los archivos de texto, ya que la función :func:`open()` envolverá un objeto almacenado en búfer dentro de un :class:`TextIOWrapper`. Esto incluye transmisiones estándar y, por lo tanto, también afecta a la función :func:`print()` incorporada.
