Repository: python/python-docs-es
Catalog: library/io.po
Languages: io

source: :mod:`io` --- Core tools for working with streams
io: :mod:`io` --- Herramientas principales para trabajar con *streams*

source: **Source code:** :source:`Lib/io.py`
io: **Código fuente:** :source:`Lib/io.py`

source: Overview
io: Resumen

source: The :mod:`io` module provides Python's main facilities for dealing with various types of I/O. There are three main types of I/O: *text I/O*, *binary I/O* and *raw I/O*. These are generic categories, and various backing stores can be used for each of them. A concrete object belonging to any of these categories is called a :term:`file object`. Other common terms are *stream* and *file-like object*.
io: El módulo :mod:`io` provee las facilidades principales de Python para manejar diferentes tipos de E/S. Hay tres diferentes tipos de E/S: *texto E/S*, *binario E/S* e *E/S sin formato*. Estas son categorías generales y varios respaldos de almacenamiento se pueden usar para cada una de ellas. Un objeto concreto perteneciendo a cualquiera de estas categorías se llama un :term:`file object`. Otros términos comunes son *stream* y *file-like object*.

source: Independent of its category, each concrete stream object will also have various capabilities: it can be read-only, write-only, or read-write. It can also allow arbitrary random access (seeking forwards or backwards to any location), or only sequential access (for example in the case of a socket or pipe).
io: Independiente de su categoría, cada objeto *stream* también tendrá varias capacidades: puede ser solamente para lectura, solo escritura, or lectura y escritura. También permite arbitrariamente acceso aleatorio (buscando adelante o hacia atrás en cualquier lugar) o solamente acceso secuencial (por ejemplo en el caso de un *socket* o *pipe*).

source: Operations that used to raise :exc:`IOError` now raise :exc:`OSError`, since :exc:`IOError` is now an alias of :exc:`OSError`.
io: Operaciones que lanzarán un :exc:`IOError` ahora lanzan :exc:`OSError`, ya que :exc:`IOError` es un alias de :exc:`OSError`.

source: Text I/O
io: E/S Texto

source: Text I/O expects and produces :class:`str` objects. This means that whenever the backing store is natively made of bytes (such as in the case of a file), encoding and decoding of data is made transparently as well as optional translation of platform-specific newline characters.
io: E/S de tipo texto espera y produce objetos de clase :class:`str`. Esto significa que cuando el respaldo de almacenamiento está compuesto de forma nativa de *bytes* (como en el caso de un archivo), la codificación y descodificación de datos está hecho de forma transparente tanto como traducción opcional de caracteres de nueva línea específicos de la plataforma.

source: The easiest way to create a text stream is with :meth:`open()`, optionally specifying an encoding::
io: La manera más fácil de crear un *stream* de tipo texto es con el método :meth:`open()`, con la opción de especificar una codificación::

source: In-memory text streams are also available as :class:`StringIO` objects::
io: *Streams* de texto en memoria también están disponibles como objetos de tipo :class:`StringIO`::

source: The text stream API is described in detail in the documentation of :class:`TextIOBase`.
io: El *API* (interfaz de programación de aplicaciones) de *streams* tipo texto está descrito con detalle en la documentación de :class:`TextIOBase`.

source: Binary I/O
io: E/S Binaria

source: Binary I/O (also called *buffered I/O*) expects :term:`bytes-like objects <bytes-like object>` and produces :class:`bytes` objects. No encoding, decoding, or newline translation is performed. This category of streams can be used for all kinds of non-text data, and also when manual control over the handling of text data is desired.
io: E/S binaria (también conocido como *buffered E/S*) espera :term:`objetos tipo bytes<bytes-like object>` y produce objetos tipo :class:`bytes`. No se hace codificación, descodificación, o traducciones de nueva línea. Esta categoría de *streams* puede ser usada para todos tipos de datos sin texto, y también cuando se desea control manual sobre el manejo de dato textual.

source: The easiest way to create a binary stream is with :meth:`open()` with ``'b'`` in the mode string::
io: La manera más fácil para crear un *stream* binario es con el método :meth:`open()` con ``'b'`` en el modo de la cadena de caracteres::

source: In-memory binary streams are also available as :class:`BytesIO` objects::
io: Los *streams* binarios en memoria también están disponibles como objetos tipo :class:`BytesIO`::

source: The binary stream API is described in detail in the docs of :class:`BufferedIOBase`.
io: El *API* de *stream* binario está descrito con detalle en la documentación de :class:`BufferedIOBase`.

source: Other library modules may provide additional ways to create text or binary streams. See :meth:`socket.socket.makefile` for example.
io: Otros módulos bibliotecarios pueden proveer maneras alternativas para crear *streams* de tipo texto o binario. Ver :meth:`socket.socket.makefile` como ejemplo.

source: Raw I/O
io: E/S sin formato

source: Raw I/O (also called *unbuffered I/O*) is generally used as a low-level building-block for binary and text streams; it is rarely useful to directly manipulate a raw stream from user code. Nevertheless, you can create a raw stream by opening a file in binary mode with buffering disabled::
io: E/S sin formato (también conocido como *unbuffered E/S*) es generalmente usado como un fundamento de nivel bajo para *streams* binario y tipo texto; es raramente útil para manipular directamente *streams* sin formatos del código de usuario. Sin embargo puedes crear un *stream* sin formato abriendo un archivo en modo binario con el búfer apagado::

source: The raw stream API is described in detail in the docs of :class:`RawIOBase`.
io: El *API* de *streams* sin formato está descrito con detalle en la documentación de :class:`RawIOBase`.

source: Text Encoding
io: Codificación de texto

source: However, many developers forget to specify the encoding when opening text files encoded in UTF-8 (e.g. JSON, TOML, Markdown, etc...) since most Unix platforms use UTF-8 locale by default. This causes bugs because the locale encoding is not UTF-8 for most Windows users. For example::
io: Sin embargo, muchos desarrolladores olvidan especificar la codificación al abrir archivos de texto codificados en UTF-8 (por ejemplo, JSON, TOML, Markdown, etc.) ya que la mayoría de las plataformas Unix usan la configuración regional UTF-8 de forma predeterminada. Esto causa errores porque la codificación local no es UTF-8 para la mayoría de los usuarios de Windows. Por ejemplo::

source: Python UTF-8 Mode can be used to change the default encoding to UTF-8 from locale-specific encoding.
io: El modo UTF-8 de Python se puede utilizar para cambiar la codificación predeterminada a UTF-8 desde la codificación específica de la configuración regional.

source: Python 3.15 will make :ref:`utf8-mode` default.
io: Python 3.15 hará que :ref:`utf8-mode` sea el valor predeterminado.

source: Opt-in EncodingWarning
io: EncodingWarning opcional

source: See :pep:`597` for more details.
io: Consulte :pep:`597` para más detalles.

source: If you are providing an API that uses :func:`open` or :class:`TextIOWrapper` and passes ``encoding=None`` as a parameter, you can use :func:`text_encoding` so that callers of the API will emit an :exc:`EncodingWarning` if they don't pass an ``encoding``. However, please consider using UTF-8 by default (i.e. ``encoding="utf-8"``) for new APIs.
io: Si está proporcionando una API que usa :func:`open` o :class:`TextIOWrapper` y pasa ``encoding=None`` como parámetro, puede usar :func:`text_encoding` para que las personas que llaman a la API emitan un :exc:`EncodingWarning` si no pasan un ``encoding``. Sin embargo, considere usar UTF-8 de forma predeterminada (es decir, ``encoding="utf-8"``) para las nuevas API.

source: High-level Module Interface
io: Interfaz de módulo de alto nivel

source: An int containing the default buffer size used by the module's buffered I/O classes. :func:`open` uses the file's blksize (as obtained by :func:`os.stat`) if possible.
io: Un *int* que contiene el búfer de tamaño predeterminado usado por las clases de tipo E/S. :func:`open` utiliza el *blksize* del archivo (obtenido por :func:`os.stat`) si es posible.

source: This is an alias for the builtin :func:`open` function.
io: Esto es un alias para la función incorporada :func:`open`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
io: Lanza un :ref:`auditing event <auditing>` ``open`` con los argumentos ``path``, ``mode``, ``flags``.

source: Opens the provided file with mode ``'rb'``. This function should be used when the intent is to treat the contents as executable code.
io: Abre el archivo dado con el modo ``'rb'``. Esta función debe ser usado cuando la intención es tratar el contenido como código ejecutable.

source: This is a helper function for callables that use :func:`open` or :class:`TextIOWrapper` and have an ``encoding=None`` parameter.
io: Esta es una función auxiliar para personas que llaman que usan :func:`open` o :class:`TextIOWrapper` y tienen un parámetro ``encoding=None``.

source: In this example, an :class:`EncodingWarning` is emitted for the caller of ``read_text()``.
io: En este ejemplo, se emite un :class:`EncodingWarning` para el llamador de ``read_text()``.

source: See :ref:`io-text-encoding` for more information.
io: Consulte :ref:`io-text-encoding` para obtener más información.

source: :func:`text_encoding` returns "utf-8" when UTF-8 mode is enabled and *encoding* is ``None``.
io: :func:`text_encoding` retornará "utf-8" cuando esté habilitado el modo UTF-8 y el *encoding* es ``None``.

source: This is a compatibility alias for the builtin :exc:`BlockingIOError` exception.
io: Esto es un alias de compatibilidad para la incorporada excepción :exc:`BlockingIOError`.

source: An exception inheriting :exc:`OSError` and :exc:`ValueError` that is raised when an unsupported operation is called on a stream.
io: Una excepción heredando :exc:`OSError` y :exc:`ValueError` que es generado cuando se llama a una operación no admitida en un *stream*.

source: contains the standard IO streams: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr`.
io: contiene los *streams* estándar de IO :data:`sys.stdin`, :data:`sys.stdout`, y :data:`sys.stderr`.

source: Class hierarchy
io: Jerarquía de clases

source: The implementation of I/O streams is organized as a hierarchy of classes. First :term:`abstract base classes <abstract base class>` (ABCs), which are used to specify the various categories of streams, then concrete classes providing the standard stream implementations.
io: La implementación de *streams* E/S está organizada como una jerarquía de clases. Primero :term:`abstract base classes <abstract base class>` (ABC), que son usados para especificar las varias categorías de *streams*, luego las clases concretas proveen un *stream* estándar de implementaciones.

source: At the top of the I/O hierarchy is the abstract base class :class:`IOBase`. It defines the basic interface to a stream. Note, however, that there is no separation between reading and writing to streams; implementations are allowed to raise :exc:`UnsupportedOperation` if they do not support a given operation.
io: En la parte superior de la jerarquía E/S está la clase abstracta base :class:`IOBase`. Define la interfaz básica del *stream*. Tenga en cuenta que no hay separación entre *streams* de lectura y escritura; implementaciones están permitidos lanzar :exc:`UnsupportedOperation` si no apoyan la operación.

source: The :class:`RawIOBase` ABC extends :class:`IOBase`. It deals with the reading and writing of bytes to a stream. :class:`FileIO` subclasses :class:`RawIOBase` to provide an interface to files in the machine's file system.
io: La clase :class:`RawIOBase` extiende :class:`IOBase`. Maneja la lectura y escritura de bytes a un *stream*. :class:`FileIO` subclasifica :class:`RawIOBase` para proveer una interfaz a los archivos en el sistema de archivos de la máquina.

source: The :class:`TextIOBase` ABC extends :class:`IOBase`. It deals with streams whose bytes represent text, and handles encoding and decoding to and from strings. :class:`TextIOWrapper`, which extends :class:`TextIOBase`, is a buffered text interface to a buffered raw stream (:class:`BufferedIOBase`). Finally, :class:`StringIO` is an in-memory stream for text.
io: El :class:`TextIOBase` ABC, otra subclasificación de :class:`IOBase`, trata con los streams cuyos bytes representan texto, y maneja la codificación y decodificación para cadenas de caracteres y de estos mismos. :class:`TextIOWrapper`, que extiende :class:`TextIOBase`, es un interfaz textual almacenado un *stream* sin formato amortiguado (:class:`BufferedIOBase`). Finalmente, :class:`StringIO` es una stream en memoria para texto.

source: Argument names are not part of the specification, and only the arguments of :func:`open` are intended to be used as keyword arguments.
io: Los nombres de los argumentos no son parte de la especificación, y solo los argumentos de :func:`open` están destinados a ser utilizados como argumentos de palabras clave.

source: The following table summarizes the ABCs provided by the :mod:`io` module:
io: La siguiente tabla resume los ABC proporcionado por el módulo :mod:`io` module:

source: Inherits
io: Hereda

source: Stub Methods
io: Métodos de trozos (*Stub*)

source: Mixin Methods and Properties
io: Métodos mixin y propiedades

source: Inherited :class:`IOBase` methods, ``read``, and ``readall``
io: Métodos :class:`IOBase` heredados, ``read``, and ``readall``

source: Inherited :class:`IOBase` methods, ``readinto``, and ``readinto1``
io: Métodos :class:`IOBase` heredados, ``readinto``, and ``readinto1``

source: Inherited :class:`IOBase` methods, ``encoding``, ``errors``, and ``newlines``
io: Métodos :class:`IOBase` heredados, ``encoding``, ``errors``, and ``newlines``

source: I/O Base Classes
io: Clases base E/S

source: The abstract base class for all I/O classes.
io: La clase base abstracta para todas las clases de E/S.

source: This class provides empty abstract implementations for many methods that derived classes can override selectively; the default implementations represent a file that cannot be read, written or seeked.
io: Esta clase provee implementaciones abstractas vacías para muchos métodos que clases que derivadas pueden anular selectivamente; la implementación predeterminada representa un archivo que no se puede leer, grabar o ser buscado.

source: The basic type used for binary data read from or written to a file is :class:`bytes`. Other :term:`bytes-like objects <bytes-like object>` are accepted as method arguments too. Text I/O classes work with :class:`str` data.
io: El tipo básico usado para leer datos binarios o grabar un archivo es :class:`bytes`. Otros :term:`bytes-like objects <bytes-like object>` son aceptados como argumentos para métodos también. Clases de tipo E/S funcionan usando datos de tipo :class:`str`.

source: Note that calling any method (even inquiries) on a closed stream is undefined. Implementations may raise :exc:`ValueError` in this case.
io: Tenga en cuenta que llamando cualquier método (incluso indagaciones) en un *stream* cerrada es indefinido. En este caso implementaciones podrían lanzar un error :exc:`ValueError`.

source: :class:`IOBase` (and its subclasses) supports the iterator protocol, meaning that an :class:`IOBase` object can be iterated over yielding the lines in a stream. Lines are defined slightly differently depending on whether the stream is a binary stream (yielding bytes), or a text stream (yielding character strings). See :meth:`~IOBase.readline` below.
io: :class:`IOBase` (y sus subclasificaciones) apoyan el protocolo iterador, significando que un objeto de clase :class:`IOBase` puede ser iterado sobre el rendimiento de las líneas en un *stream* de datos. Líneas son definidas un poco diferente dependiendo si el *stream* es de tipo binario (produciendo *bytes*), o un *stream* de texto (produciendo cadenas de caracteres). Ver :meth:`~IOBase.readline` abajo.

source: :class:`IOBase` is also a context manager and therefore supports the :keyword:`with` statement. In this example, *file* is closed after the :keyword:`!with` statement's suite is finished---even if an exception occurs::
io: :class:`IOBase` es también un gestor de contexto y por ende apoya la declaración :keyword:`with`. En este ejemplo, *file* es cerrado después de que la declaración :keyword:`!with` termina--incluso si alguna excepción ocurre::

source: :class:`IOBase` provides these data attributes and methods:
io: :class:`IOBase` provee los siguientes atributos y métodos:

source: Flush and close this stream. This method has no effect if the file is already closed. Once the file is closed, any operation on the file (e.g. reading or writing) will raise a :exc:`ValueError`.
io: Cierra el *stream*. Este método no tiene efecto si el archivo ya está cerrado. Cuándo está cerrado, cualquier operación que se le haga al archivo (ej. leer or grabar) lanzará el error :exc:`ValueError`.

source: As a convenience, it is allowed to call this method more than once; only the first call, however, will have an effect.
io: Como conveniencia, se permite llamar este método más que una vez. Sin embargo, solamente el primer llamado tenderá efecto.

source: ``True`` if the stream is closed.
io: ``True`` si está cerrada el *stream*.

source: Return the underlying file descriptor (an integer) of the stream if it exists. An :exc:`OSError` is raised if the IO object does not use a file descriptor.
io: Retorna el descriptor de archivo subyacente (un número de tipo entero) de el *stream* si existe. Un :exc:`OSError` se lanza si el objeto IO no tiene un archivo descriptor.

source: Flush the write buffers of the stream if applicable. This does nothing for read-only and non-blocking streams.
io: Vacía los buffers de grabación del *stream* si corresponde. Esto no hace nada para *streams* que son solamente de lectura o *streams* sin bloqueo.

source: Return ``True`` if the stream is interactive (i.e., connected to a terminal/tty device).
io: Retorna ``True`` si el *stream* es interactiva (ej., si está conectado a un terminal o dispositivo tty).

source: Read and return one line from the stream. If *size* is specified, at most *size* bytes will be read.
io: Lee y retorna una línea del *stream*. Si *size* (tamaño) es especificado, se capturará un máximo de ése mismo tamaño especificado en *bytes*.

source: The line terminator is always ``b'\n'`` for binary files; for text files, the *newline* argument to :func:`open` can be used to select the line terminator(s) recognized.
io: El terminador de la línea siempre es ``b'\n'`` para archivos de tipo binario; para archivos de tipo texto el argumento *newline* para la función :func:`open` pueden ser usados para seleccionar las líneas terminadoras reconocidas.

source: Read and return a list of lines from the stream. *hint* can be specified to control the number of lines read: no more lines will be read if the total size (in bytes/characters) of all lines so far exceeds *hint*.
io: Lee y retorna una lista de líneas del *stream*. *hint* puede ser especificado para controlar el número de líneas que se lee: no se leerán más líneas si el tamaño total (en *bytes* / caracteres) de todas las líneas excede *hint*.

source: *hint* values of ``0`` or less, as well as ``None``, are treated as no hint.
io: Los valores *hint* de ``0`` o menos, así como ``None``, se tratan como sin pista.

source: Return ``True`` if the stream supports random access. If ``False``, :meth:`seek`, :meth:`tell` and :meth:`truncate` will raise :exc:`OSError`.
io: Retorna ``True`` si el *stream* apoya acceso aleatorio. Si retorna ``False``, :meth:`seek`, :meth:`tell` y :meth:`truncate` lanzarán :exc:`OSError`.

source: Return the current stream position.
io: Retorna la posición actual del *stream*.

source: Resize the stream to the given *size* in bytes (or the current position if *size* is not specified). The current stream position isn't changed. This resizing can extend or reduce the current file size. In case of extension, the contents of the new file area depend on the platform (on most systems, additional bytes are zero-filled). The new file size is returned.
io: Cambia el tamaño del *stream* al *size* dado en *bytes* (o la posición actual si no se especifica *size*). La posición actual del *stream* no se cambia. Este cambio de tamaño puede incrementar o reducir el tamaño actual del archivo. En caso de extensión, los contenidos del área del nuevo archivo depende de la plataforma (en la mayoría de los sistemas *bytes* adicionales son llenos de cero). Se retorna el nuevo tamaño del archivo.

source: Windows will now zero-fill files when extending.
io: *Windows* llenará los archivos con cero cuando extienda.

source: Write a list of lines to the stream. Line separators are not added, so it is usual for each of the lines provided to have a line separator at the end.
io: Escribir una lista de líneas al *stream*. No se agrega separadores de líneas, así que es usual que las líneas tengan separador al final.

source: Prepare for object destruction. :class:`IOBase` provides a default implementation of this method that calls the instance's :meth:`~IOBase.close` method.
io: Prepara para la destrucción de un objeto. :class:`IOBase` proporciona una implementación dada de este método que ejecuta las instancias del método :meth:`~IOBase.close`.

source: Raw binary streams typically provide low-level access to an underlying OS device or API, and do not try to encapsulate it in high-level primitives (this functionality is done at a higher-level in buffered binary streams and text streams, described later in this page).
io: Los flujos binarios sin procesar generalmente brindan acceso de bajo nivel a un dispositivo OS subyacente o API, y no intentan encapsularlos en primitivas de alto nivel (esta funcionalidad se realiza en un nivel superior en flujos binarios almacenados en búfer y flujos de texto, que se describen más adelante en esta página).

source: :class:`RawIOBase` provides these methods in addition to those from :class:`IOBase`:
io: :class:`RawIOBase` proporciona estos métodos además de los de :class:`IOBase`:

source: Read up to *size* bytes from the object and return them. As a convenience, if *size* is unspecified or -1, all bytes until EOF are returned. Otherwise, only one system call is ever made. Fewer than *size* bytes may be returned if the operating system call returns fewer than *size* bytes.
io: Lee hasta el *size* de los *bytes* del objeto y los retorna. Como conveniencia si no se especifica *size* o es -1, se retornan todos los *bytes* hasta que se retorne el fin del archivo. Sino, se hace solo un llamado al sistema. Se pueden retornar menos de *size* *bytes* si la llamada del sistema operativo retorna menos de *size* *bytes*.

source: If 0 bytes are returned, and *size* was not 0, this indicates end of file. If the object is in non-blocking mode and no bytes are available, ``None`` is returned.
io: Si se retorna 0 *bytes* y el *size* no era 0, esto indica que es el fin del archivo. Si el objeto está en modo sin bloqueo y no hay *bytes* disponibles, se retorna ``None``.

source: The default implementation defers to :meth:`readall` and :meth:`readinto`.
io: La implementación dada difiera al método :meth:`readall` y :meth:`readinto`.
