Repository: python/python-docs-es
Catalog: library/ipaddress.po
Languages: es_co

source: All attributes implemented by address objects are implemented by network objects as well. In addition, network objects implement additional attributes. All of these are common between :class:`IPv4Network` and :class:`IPv6Network`, so to avoid duplication they are only documented for :class:`IPv4Network`. Network objects are :term:`hashable`, so they can be used as keys in dictionaries.
es_co: Todos los atributos implementados por objetos de dirección también son implementados por objetos de red. Además, los objetos de red implementan atributos adicionales. Todos estos son comunes entre :class:`IPv4Network` y :class:`IPv6Network`, por lo que para evitar la duplicación solo se documentan para :class:`IPv4Network`. Los objetos de red son :term:`hashable`, por lo que se pueden usar como claves en diccionarios.

source: Construct an IPv4 network definition. *address* can be one of the following:
es_co: Construya una definición de red IPv4. *address* puede ser una de las siguientes:

source: A string consisting of an IP address and an optional mask, separated by a slash (``/``). The IP address is the network address, and the mask can be either a single number, which means it's a *prefix*, or a string representation of an IPv4 address. If it's the latter, the mask is interpreted as a *net mask* if it starts with a non-zero field, or as a *host mask* if it starts with a zero field, with the single exception of an all-zero mask which is treated as a *net mask*. If no mask is provided, it's considered to be ``/32``.
es_co: Una cadena que consta de una dirección IP y una máscara opcional, separadas por una barra (``/``). La dirección IP es la dirección de red y la máscara puede ser un solo número, lo que significa que es un *prefix*, o una representación de cadena de caracteres de una dirección IPv4. Si es la última, la máscara es interpretada como una *net mask* si comienza con un campo no nulo, o como una *host mask* si comienza con un campo cero, con la excepción de una máscara de solo ceros la cual es tratada como una *net mask*. Si no se proporciona una máscara, se considera ``/32``.

source: For example, the following *address* specifications are equivalent: ``192.168.1.0/24``, ``192.168.1.0/255.255.255.0`` and ``192.168.1.0/0.0.0.255``.
es_co: Por ejemplo, las siguientes especificaciones de *address* son equivalentes: ``192.168.1.0/24``, ``192.168.1.0/255.255.255.0`` y ``192.168.1.0/0.0.0.255``.

source: An integer that fits into 32 bits. This is equivalent to a single-address network, with the network address being *address* and the mask being ``/32``.
es_co: Un número entero que cabe en 32 bits. Esto es equivalente a una red de una sola dirección, con la dirección de red *address* y la máscara ``/32``.

source: An integer packed into a :class:`bytes` object of length 4, big-endian. The interpretation is similar to an integer *address*.
es_co: Un entero empaquetado en un objeto :class:`bytes` de longitud 4, big-endian. La interpretación es similar a una *address* entera.

source: A two-tuple of an address description and a netmask, where the address description is either a string, a 32-bits integer, a 4-bytes packed integer, or an existing IPv4Address object; and the netmask is either an integer representing the prefix length (e.g. ``24``) or a string representing the prefix mask (e.g. ``255.255.255.0``).
es_co: Dos tuplas de una descripción de dirección y una máscara de red, donde la descripción de la dirección es una cadena, un entero de 32 bits, un entero empaquetado de 4 bytes o un objeto IPv4Address existente; y la máscara de red es un número entero que representa la longitud del prefijo (por ejemplo, ``24``) o una cadena que representa la máscara de prefijo (por ejemplo, ``255.255.255.0``).

source: An :exc:`AddressValueError` is raised if *address* is not a valid IPv4 address. A :exc:`NetmaskValueError` is raised if the mask is not valid for an IPv4 address.
es_co: Se genera un :exc:`AddressValueError` si *address* no es una dirección IPv4 válida. A :exc:`NetmaskValueError` se genera si la máscara no es válida para una dirección IPv4.

source: If *strict* is ``True`` and host bits are set in the supplied address, then :exc:`ValueError` is raised. Otherwise, the host bits are masked out to determine the appropriate network address.
es_co: Si *strict* es ``True`` y los bits de host están configurados en la dirección proporcionada, entonces :exc:`ValueError` se genera. De lo contrario, los bits del host se enmascaran para determinar la dirección de red adecuada.

source: Unless stated otherwise, all network methods accepting other network/address objects will raise :exc:`TypeError` if the argument's IP version is incompatible to ``self``.
es_co: A menos que se indique lo contrario, todos los métodos de red que acepten otros objetos de red / dirección generarán :exc:`TypeError` si la versión de IP del argumento es incompatible con ``self``.

source: Added the two-tuple form for the *address* constructor parameter.
es_co: Se agregó la forma de dos tuplas para el parámetro de constructor *address*.

source: Refer to the corresponding attribute documentation in :class:`IPv4Address`.
es_co: Consulte la documentación del atributo correspondiente en :class:`IPv4Address`.

source: These attributes are true for the network as a whole if they are true for both the network address and the broadcast address.
es_co: Estos atributos son verdaderos para la red en su conjunto si lo son tanto para la dirección de red como para la dirección de transmisión.

source: The network address for the network. The network address and the prefix length together uniquely define a network.
es_co: La dirección de red de la red. La dirección de red y la longitud del prefijo juntos definen de forma única una red.

source: The broadcast address for the network. Packets sent to the broadcast address should be received by every host on the network.
es_co: La dirección de transmisión de la red. Todos los hosts de la red deben recibir los paquetes enviados a la dirección de transmisión.

source: The host mask, as an :class:`IPv4Address` object.
es_co: La máscara de host, como un objeto :class:`IPv4Address`.

source: The net mask, as an :class:`IPv4Address` object.
es_co: La máscara de red, como un objeto :class:`IPv4Address`.

source: A string representation of the network, with the mask in prefix notation.
es_co: Una representación de cadena de la red, con la máscara en notación de prefijo.

source: ``with_prefixlen`` and ``compressed`` are always the same as ``str(network)``. ``exploded`` uses the exploded form the network address.
es_co: ``with_prefixlen`` y ``compressed`` son siempre lo mismo que ``str(red)``. ``exploded`` utiliza la forma explosionada de la dirección de red.

source: A string representation of the network, with the mask in net mask notation.
es_co: Una representación de cadena de la red, con la máscara en notación de máscara de red.

source: A string representation of the network, with the mask in host mask notation.
es_co: Una representación de cadena de la red, con la máscara en notación de máscara de host.

source: The total number of addresses in the network.
es_co: El número total de direcciones en la red.

source: Length of the network prefix, in bits.
es_co: Longitud del prefijo de red, en bits.

source: Returns an iterator over the usable hosts in the network. The usable hosts are all the IP addresses that belong to the network, except the network address itself and the network broadcast address. For networks with a mask length of 31, the network address and network broadcast address are also included in the result. Networks with a mask of 32 will return a list containing the single host address.
es_co: Longitud de Devuelve un iterador sobre los hosts utilizables en la red. Los hosts utilizables son todas las direcciones IP que pertenecen a la red, excepto la dirección de red en sí y la dirección de transmisión de la red. Para redes con una longitud de máscara de 31, la dirección de red y la dirección de transmisión de red también se incluyen en el resultado. Las redes con una máscara de 32 devolverán una lista que contiene la dirección de host única, el prefijo de red, en bits.

source: ``True`` if this network is partly or wholly contained in *other* or *other* is wholly contained in this network.
es_co: ``True`` si esta red está total o parcialmente contenida en *other* o *other* está completamente contenido en esta red.

source: Computes the network definitions resulting from removing the given *network* from this one. Returns an iterator of network objects. Raises :exc:`ValueError` if *network* is not completely contained in this network.
es_co: Calcula las definiciones de red resultantes de eliminar la *network* dada de esta. Devuelve un iterador de objetos de red. Genera :exc:`ValueError` si *network* no está completamente contenido en esta red.

source: The subnets that join to make the current network definition, depending on the argument values. *prefixlen_diff* is the amount our prefix length should be increased by. *new_prefix* is the desired new prefix of the subnets; it must be larger than our prefix. One and only one of *prefixlen_diff* and *new_prefix* must be set. Returns an iterator of network objects.
es_co: Las subredes que se unen para crear la definición de red actual, según los valores de los argumentos. *prefixlen_diff* es la cantidad en la que se debe aumentar la longitud de nuestro prefijo. *new_prefix* es el nuevo prefijo deseado de las subredes; debe ser más grande que nuestro prefijo. Se debe establecer uno y solo uno de *prefixlen_diff* y *new_prefix*. Devuelve un iterador de objetos de red.

source: The supernet containing this network definition, depending on the argument values. *prefixlen_diff* is the amount our prefix length should be decreased by. *new_prefix* is the desired new prefix of the supernet; it must be smaller than our prefix. One and only one of *prefixlen_diff* and *new_prefix* must be set. Returns a single network object.
es_co: La superred que contiene esta definición de red, según los valores de los argumentos. *prefixlen_diff* es la cantidad en la que se debe reducir la longitud de nuestro prefijo. *new_prefix* es el nuevo prefijo deseado de la superred; debe ser más pequeño que nuestro prefijo. Se debe establecer uno y solo uno de *prefixlen_diff* y *new_prefix*. Devuelve un solo objeto de red.

source: Return ``True`` if this network is a subnet of *other*.
es_co: Devuelve ``True`` si esta red es una subred de *other*.

source: Return ``True`` if this network is a supernet of *other*.
es_co: Devuelve ``True`` si esta red es una superred de *other*.

source: Compare this network to *other*. In this comparison only the network addresses are considered; host bits aren't. Returns either ``-1``, ``0`` or ``1``.
es_co: Compare esta red con *other*. En esta comparación solo se consideran las direcciones de red; los bits de host no lo son. Devuelve ``-1``, ``0`` o ``1``.

source: It uses the same ordering and comparison algorithm as "<", "==", and ">"
es_co: Utiliza el mismo algoritmo de ordenación y comparación que "<", "==" y ">"

source: Construct an IPv6 network definition. *address* can be one of the following:
es_co: Construya una definición de red IPv6. *address* puede ser una de las siguientes:

source: A string consisting of an IP address and an optional prefix length, separated by a slash (``/``). The IP address is the network address, and the prefix length must be a single number, the *prefix*. If no prefix length is provided, it's considered to be ``/128``.
es_co: Una cadena que consta de una dirección IP y una longitud de prefijo opcional, separados por una barra (``/``). La dirección IP es la dirección de red y la longitud del prefijo debe ser un solo número, el *prefix*. Si no se proporciona una longitud de prefijo, se considera que es ``/128``.

source: Note that currently expanded netmasks are not supported. That means ``2001:db00::0/24`` is a valid argument while ``2001:db00::0/ffff:ff00::`` is not.
es_co: Tenga en cuenta que las máscaras de red expandidas actualmente no son compatibles. Eso significa que ``2001:db00::0/24`` es un argumento válido mientras que ``2001:db00::0/ffff:ff00::`` no lo es.

source: An integer that fits into 128 bits. This is equivalent to a single-address network, with the network address being *address* and the mask being ``/128``.
es_co: Un número entero que cabe en 128 bits. Esto es equivalente a una red de una sola dirección, con la dirección de red *address* y la máscara ``/128``.

source: An integer packed into a :class:`bytes` object of length 16, big-endian. The interpretation is similar to an integer *address*.
es_co: Un entero empaquetado en un objeto :class:`bytes` de longitud 16, big-endian. La interpretación es similar a una *address* entera.

source: A two-tuple of an address description and a netmask, where the address description is either a string, a 128-bits integer, a 16-bytes packed integer, or an existing IPv6Address object; and the netmask is an integer representing the prefix length.
es_co: Dos tuplas de una descripción de dirección y una máscara de red, donde la descripción de la dirección es una cadena, un entero de 128 bits, un entero empaquetado de 16 bytes o un objeto IPv6Address existente; y la máscara de red es un número entero que representa la longitud del prefijo.

source: An :exc:`AddressValueError` is raised if *address* is not a valid IPv6 address. A :exc:`NetmaskValueError` is raised if the mask is not valid for an IPv6 address.
es_co: Se genera un :exc:`AddressValueError` si *address* no es una dirección IPv6 válida. A :exc:`NetmaskValueError` se genera si la máscara no es válida para una dirección IPv6.

source: Returns an iterator over the usable hosts in the network. The usable hosts are all the IP addresses that belong to the network, except the Subnet-Router anycast address. For networks with a mask length of 127, the Subnet-Router anycast address is also included in the result. Networks with a mask of 128 will return a list containing the single host address.
es_co: Devuelve un iterador sobre los hosts utilizables en la red. Los hosts utilizables son todas las direcciones IP que pertenecen a la red, excepto la dirección Anycast del Subnet-Router. Para redes con una longitud de máscara de 127, la dirección anycast del Subnet-Router también se incluye en el resultado. Las redes con una máscara de 128 devolverán una lista que contiene la única dirección de host.

source: Refer to the corresponding attribute documentation in :class:`IPv4Network`.
es_co: Consulte la documentación del atributo correspondiente en :class:`IPv4Network`.

source: These attribute is true for the network as a whole if it is true for both the network address and the broadcast address.
es_co: Este atributo es verdadero para la red en su conjunto si es cierto tanto para la dirección de red como para la dirección de transmisión.

source: Network objects support some operators. Unless stated otherwise, operators can only be applied between compatible objects (i.e. IPv4 with IPv4, IPv6 with IPv6).
es_co: Este atributo es verdadero para la red en su conjunto si es cierto para ambos objetos de red que admiten algunos operadores. A menos que se indique lo contrario, los operadores solo se pueden aplicar entre objetos compatibles (es decir, IPv4 con IPv4, IPv6 con IPv6).

source: Logical operators
es_co: Operadores lógicos

source: Network objects can be compared with the usual set of logical operators. Network objects are ordered first by network address, then by net mask.
es_co: Los objetos de red se pueden comparar con el conjunto habitual de operadores lógicos. Los objetos de red se ordenan primero por dirección de red y luego por máscara de red.

source: Iteration
es_co: Iteración

source: Network objects can be iterated to list all the addresses belonging to the network. For iteration, *all* hosts are returned, including unusable hosts (for usable hosts, use the :meth:`~IPv4Network.hosts` method). An example::
es_co: Los objetos de red se pueden iterar para enumerar todas las direcciones que pertenecen a la red. Para la iteración, se devuelven *todos* los hosts, incluidos los hosts inutilizables (para hosts utilizables, use el método :meth:`~IPv4Network.hosts`). Un ejemplo::

source: Networks as containers of addresses
es_co: Redes como contenedores de direcciones

source: Network objects can act as containers of addresses. Some examples::
es_co: Los objetos de red pueden actuar como contenedores de direcciones. Algunos ejemplos::

source: Interface objects
es_co: Objetos de interfaz

source: Interface objects are :term:`hashable`, so they can be used as keys in dictionaries.
es_co: Los objetos de interfaz son :term:`hashable`, por lo que se pueden usar como claves en diccionarios.

source: Construct an IPv4 interface. The meaning of *address* is as in the constructor of :class:`IPv4Network`, except that arbitrary host addresses are always accepted.
es_co: Construya una interfaz IPv4. El significado de *address* es como en el constructor de :class:`IPv4Network`, excepto que siempre se aceptan direcciones de host arbitrarias.

source: :class:`IPv4Interface` is a subclass of :class:`IPv4Address`, so it inherits all the attributes from that class. In addition, the following attributes are available:
es_co: :class:`IPv4Interface` es una subclase de :class:`IPv4Address`, por lo que hereda todos los atributos de esa clase. Además, están disponibles los siguientes atributos:

source: The network (:class:`IPv4Network`) this interface belongs to.
es_co: La red (:class:`IPv4Network`) a la que pertenece esta interfaz.

source: A string representation of the interface with the mask in prefix notation.
es_co: Una representación de cadena de la interfaz con la máscara en notación de prefijo.

source: A string representation of the interface with the network as a net mask.
es_co: Una representación de cadena de la interfaz con la red como máscara de red.

source: A string representation of the interface with the network as a host mask.
es_co: Una representación de cadena de la interfaz con la red como máscara de host.

source: Construct an IPv6 interface. The meaning of *address* is as in the constructor of :class:`IPv6Network`, except that arbitrary host addresses are always accepted.
es_co: Construya una interfaz IPv6. El significado de *address* es como en el constructor de :class:`IPv6Network`, excepto que siempre se aceptan direcciones de host arbitrarias.

source: :class:`IPv6Interface` is a subclass of :class:`IPv6Address`, so it inherits all the attributes from that class. In addition, the following attributes are available:
es_co: :class:`IPv6Interface` es una subclase de :class:`IPv6Address`, por lo que hereda todos los atributos de esa clase. Además, están disponibles los siguientes atributos:

source: Refer to the corresponding attribute documentation in :class:`IPv4Interface`.
es_co: Consulte la documentación del atributo correspondiente en :class:`IPv4Interface`.

source: Interface objects support some operators. Unless stated otherwise, operators can only be applied between compatible objects (i.e. IPv4 with IPv4, IPv6 with IPv6).
es_co: Los objetos de interfaz admiten algunos operadores. A menos que se indique lo contrario, los operadores solo se pueden aplicar entre objetos compatibles (es decir, IPv4 con IPv4, IPv6 con IPv6).

source: Interface objects can be compared with the usual set of logical operators.
es_co: Los objetos de interfaz se pueden comparar con el conjunto habitual de operadores lógicos.

source: For equality comparison (``==`` and ``!=``), both the IP address and network must be the same for the objects to be equal. An interface will not compare equal to any address or network object.
es_co: Para la comparación de igualdad (``==`` y ``!=``), Tanto la dirección IP como la red deben ser iguales para que los objetos sean iguales. Una interfaz no se comparará con ninguna dirección u objeto de red.

source: For ordering (``<``, ``>``, etc) the rules are different. Interface and address objects with the same IP version can be compared, and the address objects will always sort before the interface objects. Two interface objects are first compared by their networks and, if those are the same, then by their IP addresses.
es_co: Para ordenar (``<``, ``>``, etc) las reglas son diferentes. Los objetos de interfaz y dirección con la misma versión de IP se pueden comparar, y los objetos de dirección siempre se clasificarán antes que los objetos de interfaz. Primero se comparan dos objetos de interfaz por sus redes y, si son iguales, luego por sus direcciones IP.

source: Other Module Level Functions
es_co: Otras funciones de nivel de módulo

source: The module also provides the following module level functions:
es_co: El módulo también proporciona las siguientes funciones de nivel de módulo:

source: Represent an address as 4 packed bytes in network (big-endian) order. *address* is an integer representation of an IPv4 IP address. A :exc:`ValueError` is raised if the integer is negative or too large to be an IPv4 IP address.
es_co: Represente una dirección como 4 bytes empaquetados en orden de red (big-endian). *address* es una representación entera de una dirección IP IPv4. A :exc:`ValueError` se genera si el número entero es negativo o demasiado grande para ser una dirección IP IPv4.

source: Represent an address as 16 packed bytes in network (big-endian) order. *address* is an integer representation of an IPv6 IP address. A :exc:`ValueError` is raised if the integer is negative or too large to be an IPv6 IP address.
es_co: Representa una dirección como 16 bytes empaquetados en orden de red (big-endian). *address* es una representación entera de una dirección IP IPv6. A :exc:`ValueError` se genera si el número entero es negativo o demasiado grande para ser una dirección IP IPv6.

source: Return an iterator of the summarized network range given the first and last IP addresses. *first* is the first :class:`IPv4Address` or :class:`IPv6Address` in the range and *last* is the last :class:`IPv4Address` or :class:`IPv6Address` in the range. A :exc:`TypeError` is raised if *first* or *last* are not IP addresses or are not of the same version. A :exc:`ValueError` is raised if *last* is not greater than *first* or if *first* address version is not 4 or 6.
es_co: Devuelve un iterador del rango de red resumido dadas la primera y la última dirección IP. *first* es el primero :class:`IPv4Address` o :class:`IPv6Address` en el rango y *last* es el último :class:`IPv4Address` o :class:`IPv6Address` en el rango. A :exc:`TypeError` se genera si *first* o *last* no son direcciones IP o no son de la misma versión. A :exc:`ValueError` se genera si *last* no es mayor que *first* o si la *first* versión de la dirección no es 4 o 6.

source: Return an iterator of the collapsed :class:`IPv4Network` or :class:`IPv6Network` objects. *addresses* is an iterator of :class:`IPv4Network` or :class:`IPv6Network` objects. A :exc:`TypeError` is raised if *addresses* contains mixed version objects.
es_co: Devuelve un iterador de los objetos contraídos :class:`IPv4Network` o :class:`IPv6Network`. *addresses* es un iterador de :class:`IPv4Network` objetos :class:`IPv6Network`. A :exc:`TypeError` se genera si *addresses* contiene objetos de versión mixta.

source: Return a key suitable for sorting between networks and addresses. Address and Network objects are not sortable by default; they're fundamentally different, so the expression::
es_co: Devuelve una clave adecuada para clasificar entre redes y direcciones. Los objetos de dirección y red no se pueden ordenar de forma predeterminada; son fundamentalmente diferentes, por lo que la expresión ::
