Repository: python/python-docs-es
Catalog: library/ipaddress.po
Languages: es_co

source: doesn't make sense. There are some times however, where you may wish to have :mod:`ipaddress` sort these anyway. If you need to do this, you can use this function as the *key* argument to :func:`sorted()`.
es_co: no tiene sentido. Sin embargo, hay ocasiones en las que es posible que desee que :mod:`ipaddress` ordene estos de todos modos. Si necesita hacer esto, puede usar esta función como el argumento *key* para :func:`sorted()`.

source: *obj* is either a network or address object.
es_co: *obj* es un objeto de red o de dirección.

source: Custom Exceptions
es_co: Excepciones personalizadas

source: To support more specific error reporting from class constructors, the module defines the following exceptions:
es_co: Para admitir informes de errores más específicos de los constructores de clases, el módulo define las siguientes excepciones:

source: Any value error related to the address.
es_co: Cualquier error de valor relacionado con la dirección.

source: Any value error related to the net mask.
es_co: Cualquier error de valor relacionado con la máscara de red.
