Repository: python/python-docs-es
Catalog: library/ipaddress.po
Languages: es_co

source: :mod:`ipaddress` --- IPv4/IPv6 manipulation library
es_co: :mod:`ipaddress` --- Biblioteca de manipulación IPv4 / IPv6

source: :mod:`ipaddress` provides the capabilities to create, manipulate and operate on IPv4 and IPv6 addresses and networks.
es_co: :mod:`ipaddress` proporciona las capacidades para crear, manipular y operar en redes y direcciones IPv4 e IPv6.

source: The functions and classes in this module make it straightforward to handle various tasks related to IP addresses, including checking whether or not two hosts are on the same subnet, iterating over all hosts in a particular subnet, checking whether or not a string represents a valid IP address or network definition, and so on.
es_co: Las funciones y clases de este módulo facilitan el manejo de varias tareas relacionadas con las direcciones IP, incluida la verificación de si dos hosts están en la misma subred, la iteración sobre todos los hosts de una subred en particular, la verificación de si una cadena representa un valor válido o no. Dirección IP o definición de red, etc.

source: This is the full module API reference—for an overview and introduction, see :ref:`ipaddress-howto`.
es_co: Esta es la referencia completa de la API del módulo; para obtener una descripción general y una introducción, consulte :ref:`ipaddress-howto`.

source: Convenience factory functions
es_co: Funciones de fábrica de conveniencia

source: The :mod:`ipaddress` module provides factory functions to conveniently create IP addresses, networks and interfaces:
es_co: El módulo :mod:`ipaddress` proporciona funciones de fábrica para crear cómodamente direcciones IP, redes e interfaces:

source: Return an :class:`IPv4Address` or :class:`IPv6Address` object depending on the IP address passed as argument. Either IPv4 or IPv6 addresses may be supplied; integers less than ``2**32`` will be considered to be IPv4 by default. A :exc:`ValueError` is raised if *address* does not represent a valid IPv4 or IPv6 address.
es_co: Retorna un objeto :class:`IPv4Address` o :class:`IPv6Address` según la dirección IP pasada como argumento. Se pueden proporcionar direcciones IPv4 o IPv6; los enteros menores que ``2**32`` se considerarán IPv4 de forma predeterminada. Se lanza un :exc:`ValueError` si *address* no representa una dirección IPv4 o IPv6 válida.

source: Return an :class:`IPv4Network` or :class:`IPv6Network` object depending on the IP address passed as argument. *address* is a string or integer representing the IP network. Either IPv4 or IPv6 networks may be supplied; integers less than ``2**32`` will be considered to be IPv4 by default. *strict* is passed to :class:`IPv4Network` or :class:`IPv6Network` constructor. A :exc:`ValueError` is raised if *address* does not represent a valid IPv4 or IPv6 address, or if the network has host bits set.
es_co: Retorna un objeto :class:`IPv4Network` o :class:`IPv6Network` dependiendo de la dirección IP pasada como argumento. *address* es una cadena o entero que representa la red IP. Se pueden suministrar redes IPv4 o IPv6; los enteros menores que ``2**32`` se considerarán IPv4 de forma predeterminada. *strict* se pasa a :class:`IPv4Network` o :class:`IPv6Network` constructor. Se genera un :exc:`ValueError` si *address* no representa una dirección IPv4 o IPv6 válida, o si la red tiene bits de host establecidos.

source: Return an :class:`IPv4Interface` or :class:`IPv6Interface` object depending on the IP address passed as argument. *address* is a string or integer representing the IP address. Either IPv4 or IPv6 addresses may be supplied; integers less than ``2**32`` will be considered to be IPv4 by default. A :exc:`ValueError` is raised if *address* does not represent a valid IPv4 or IPv6 address.
es_co: Retorna un objeto :class:`IPv4Interface` o :class:`IPv6Interface` dependiendo de la dirección IP pasada como argumento. *address* es una cadena o entero que representa la dirección IP. Se pueden proporcionar direcciones IPv4 o IPv6; los enteros menores que ``2**32`` se considerarán IPv4 de forma predeterminada. Se genera un :exc:`ValueError` si *address* no representa una dirección IPv4 o IPv6 válida.

source: One downside of these convenience functions is that the need to handle both IPv4 and IPv6 formats means that error messages provide minimal information on the precise error, as the functions don't know whether the IPv4 or IPv6 format was intended. More detailed error reporting can be obtained by calling the appropriate version specific class constructors directly.
es_co: Una desventaja de estas funciones de conveniencia es que la necesidad de manejar los formatos IPv4 e IPv6 significa que los mensajes de error brindan información mínima sobre el error exacto, ya que las funciones no saben si se pretendía usar el formato IPv4 o IPv6. Se pueden obtener informes de errores más detallados llamando directamente a los constructores de clases específicos de la versión adecuada.

source: IP Addresses
es_co: Direcciones IP

source: Address objects
es_co: Objetos de dirección

source: The :class:`IPv4Address` and :class:`IPv6Address` objects share a lot of common attributes. Some attributes that are only meaningful for IPv6 addresses are also implemented by :class:`IPv4Address` objects, in order to make it easier to write code that handles both IP versions correctly. Address objects are :term:`hashable`, so they can be used as keys in dictionaries.
es_co: Los objetos :class:`IPv4Address` y :class:`IPv6Address` comparten muchos atributos comunes. Algunos atributos que solo son significativos para direcciones IPv6 también son implementados por objetos :class:`IPv4Address`, a fin de facilitar la escritura de código que maneje ambas versiones de IP correctamente. Los objetos de dirección son :term:`hashable`, por lo que se pueden usar como claves en diccionarios.

source: Construct an IPv4 address. An :exc:`AddressValueError` is raised if *address* is not a valid IPv4 address.
es_co: Construya una dirección IPv4. Se genera un :exc:`AddressValueError` si *address* no es una dirección IPv4 válida.

source: The following constitutes a valid IPv4 address:
es_co: Lo siguiente constituye una dirección IPv4 válida:

source: A string in decimal-dot notation, consisting of four decimal integers in the inclusive range 0--255, separated by dots (e.g. ``192.168.0.1``). Each integer represents an octet (byte) in the address. Leading zeroes are not tolerated to prevent confusion with octal notation.
es_co: Una cadena en notación de punto decimal, que consta de cuatro enteros decimales en el rango inclusivo 0-255, separados por puntos (por ejemplo, ``192.168.0.1``). Cada entero representa un octeto (byte) en la dirección. No se toleran ceros iniciales para evitar confusiones con la notación octal.

source: An integer that fits into 32 bits.
es_co: Un número entero que cabe en 32 bits.

source: An integer packed into a :class:`bytes` object of length 4 (most significant octet first).
es_co: Un entero empaquetado en un objeto :class:`bytes` de longitud 4 (primero el octeto más significativo).

source: Leading zeros are tolerated, even in ambiguous cases that look like octal notation.
es_co: Se toleran los ceros iniciales, incluso en casos ambiguos que parecen notación octal.

source: Leading zeros are no longer tolerated and are treated as an error. IPv4 address strings are now parsed as strict as glibc :func:`~socket.inet_pton`.
es_co: Los ceros iniciales ya no se toleran y se tratan como un error. Las cadenas de direcciones IPv4 ahora se analizan tan estrictamente como glibc :func:`~socket.inet_pton`.

source: The above change was also included in Python 3.9 starting with version 3.9.5.
es_co: El cambio anterior también se incluyó en Python 3.9 a partir de la versión 3.9.5.

source: The above change was also included in Python 3.8 starting with version 3.8.12.
es_co: El cambio anterior también se incluyó en Python 3.8 a partir de la versión 3.8.12.

source: The appropriate version number: ``4`` for IPv4, ``6`` for IPv6.
es_co: El número de versión apropiado: ``4`` para IPv4, ``6`` para IPv6.

source: The total number of bits in the address representation for this version: ``32`` for IPv4, ``128`` for IPv6.
es_co: El número total de bits en la representación de direcciones para esta versión: ``32`` para IPv4, ``128`` para IPv6.

source: The prefix defines the number of leading bits in an address that are compared to determine whether or not an address is part of a network.
es_co: El prefijo define el número de bits iniciales en una dirección que se comparan para determinar si una dirección es parte de una red o no.

source: The string representation in dotted decimal notation. Leading zeroes are never included in the representation.
es_co: Representación de cadena en notación decimal con puntos. Los ceros iniciales nunca se incluyen en la representación.

source: As IPv4 does not define a shorthand notation for addresses with octets set to zero, these two attributes are always the same as ``str(addr)`` for IPv4 addresses. Exposing these attributes makes it easier to write display code that can handle both IPv4 and IPv6 addresses.
es_co: Como IPv4 no define una notación abreviada para direcciones con octetos establecidos en cero, estos dos atributos son siempre los mismos que ``str(addr)`` para direcciones IPv4. La exposición de estos atributos facilita la escritura de código de visualización que pueda manejar direcciones IPv4 e IPv6.

source: The binary representation of this address - a :class:`bytes` object of the appropriate length (most significant octet first). This is 4 bytes for IPv4 and 16 bytes for IPv6.
es_co: La representación binaria de esta dirección: un objeto :class:`bytes` de la longitud adecuada (primero el octeto más significativo). Son 4 bytes para IPv4 y 16 bytes para IPv6.

source: The name of the reverse DNS PTR record for the IP address, e.g.::
es_co: El nombre del registro PTR de DNS inverso para la dirección IP, por ejemplo::

source: This is the name that could be used for performing a PTR lookup, not the resolved hostname itself.
es_co: Este es el nombre que podría usarse para realizar una búsqueda PTR, no el nombre de host resuelto en sí.

source: ``True`` if the address is reserved for multicast use. See :RFC:`3171` (for IPv4) or :RFC:`2373` (for IPv6).
es_co: ``True`` si la dirección está reservada para uso de multidifusión. Consulte :RFC:`3171` (para IPv4) o :RFC:`2373` (para IPv6).

source: ``True`` if the address is allocated for private networks. See iana-ipv4-special-registry_ (for IPv4) or iana-ipv6-special-registry_ (for IPv6).
es_co: ``True`` si la dirección está asignada para redes privadas. Consulte iana-ipv4-special-registry_ (para IPv4) o iana-ipv6-special-registry_ (para IPv6).

source: ``True`` if the address is allocated for public networks. See iana-ipv4-special-registry_ (for IPv4) or iana-ipv6-special-registry_ (for IPv6).
es_co: ``True`` si la dirección está asignada para redes públicas. Consulte iana-ipv4-special-registry_ (para IPv4) o iana-ipv6-special-registry_ (para IPv6).

source: ``True`` if the address is unspecified. See :RFC:`5735` (for IPv4) or :RFC:`2373` (for IPv6).
es_co: ``True`` si la dirección no está especificada. Consulte :RFC:`5735` (para IPv4) o :RFC:`2373` (para IPv6).

source: ``True`` if the address is otherwise IETF reserved.
es_co: ``True`` si la dirección está reservada IETF.

source: ``True`` if this is a loopback address. See :RFC:`3330` (for IPv4) or :RFC:`2373` (for IPv6).
es_co: ``True`` si se trata de una dirección de bucle invertido. Consulte :RFC:`3330` (para IPv4) o :RFC:`2373` (para IPv6).

source: ``True`` if the address is reserved for link-local usage. See :RFC:`3927`.
es_co: ``True`` si se trata de una dirección de bucle invertido. Consulte :RFC:`3330` (para IPv4) o :RFC:`2373` (para IPv6). ``True`` si la dirección está reservada para uso local de enlace. Ver :RFC:`3927`.

source: Returns a string representation of the IP address, controlled by an explicit format string. *fmt* can be one of the following: ``'s'``, the default option, equivalent to :func:`str`, ``'b'`` for a zero-padded binary string, ``'X'`` or ``'x'`` for an uppercase or lowercase hexadecimal representation, or ``'n'``, which is equivalent to ``'b'`` for IPv4 addresses and ``'x'`` for IPv6. For binary and hexadecimal representations, the form specifier ``'#'`` and the grouping option ``'_'`` are available. ``__format__`` is used by ``format``, ``str.format`` and f-strings.
es_co: Devuelve una representación de cadena de la dirección IP, controlada por una cadena de formato explícito. *fmt* puede ser uno de los siguientes: ``'s'``, la opción predeterminada, equivalente a :func:`str`, ``'b'`` para una cadena binaria con relleno de ceros, ``'X'`` o ``'x'`` para una representación hexadecimal en mayúsculas o minúsculas, o ``'n'``, que es equivalente a ``'b'`` para direcciones IPv4 y ``'x'`` para IPv6. Para representaciones binarias y hexadecimales, el especificador de formulario ``'#'`` y la opción de agrupación ``'_'`` están disponibles. ``__format__`` es utilizado por ``format``, ``str.format`` y f-strings.

source: Construct an IPv6 address. An :exc:`AddressValueError` is raised if *address* is not a valid IPv6 address.
es_co: Construya una dirección IPv6. Se genera un :exc:`AddressValueError` si *address* no es una dirección IPv6 válida.

source: The following constitutes a valid IPv6 address:
es_co: Lo siguiente constituye una dirección IPv6 válida:

source: A string consisting of eight groups of four hexadecimal digits, each group representing 16 bits. The groups are separated by colons. This describes an *exploded* (longhand) notation. The string can also be *compressed* (shorthand notation) by various means. See :RFC:`4291` for details. For example, ``"0000:0000:0000:0000:0000:0abc:0007:0def"`` can be compressed to ``"::abc:7:def"``.
es_co: Una cadena que consta de ocho grupos de cuatro dígitos hexadecimales, cada grupo representa 16 bits. Los grupos están separados por dos puntos. Esto describe una notación *explotada* (a mano). La cadena también se puede *comprimir* (notación abreviada) por varios medios. Consulte :RFC:`4291` para obtener más detalles. Por ejemplo, ``"0000:0000:0000:0000:0000:0abc:0007:0def"`` se puede comprimir en ``"::abc:7:def"``.

source: Optionally, the string may also have a scope zone ID, expressed with a suffix ``%scope_id``. If present, the scope ID must be non-empty, and may not contain ``%``. See :RFC:`4007` for details. For example, ``fe80::1234%1`` might identify address ``fe80::1234`` on the first link of the node.
es_co: Opcionalmente, la cadena también puede tener un ID de zona de alcance, expresado con un sufijo ``%scope_id``. Si está presente, el ID de alcance no debe estar vacío y no puede contener ``%``. Consulte :RFC:`4007` para obtener más detalles. Por ejemplo, ``fe80::1234%1`` podría identificar la dirección ``fe80::1234`` en el primer enlace del nodo.

source: An integer that fits into 128 bits.
es_co: Un número entero que cabe en 128 bits.

source: An integer packed into a :class:`bytes` object of length 16, big-endian.
es_co: Un entero empaquetado en un objeto :class:`bytes` de longitud 16, big-endian.

source: The short form of the address representation, with leading zeroes in groups omitted and the longest sequence of groups consisting entirely of zeroes collapsed to a single empty group.
es_co: La forma corta de la representación de la dirección, con ceros a la izquierda en los grupos omitidos y la secuencia más larga de grupos que consta completamente de ceros colapsó en un solo grupo vacío.

source: This is also the value returned by ``str(addr)`` for IPv6 addresses.
es_co: Este también es el valor devuelto por ``str(addr)`` para las direcciones IPv6.

source: The long form of the address representation, with all leading zeroes and groups consisting entirely of zeroes included.
es_co: La forma larga de la representación de la dirección, con todos los ceros a la izquierda y los grupos que constan completamente de ceros incluidos.

source: For the following attributes and methods, see the corresponding documentation of the :class:`IPv4Address` class:
es_co: Para los siguientes atributos y métodos, consulte la documentación correspondiente de la clase :class:`IPv4Address`:

source: ``True`` if the address is reserved for site-local usage. Note that the site-local address space has been deprecated by :RFC:`3879`. Use :attr:`~IPv4Address.is_private` to test if this address is in the space of unique local addresses as defined by :RFC:`4193`.
es_co: ``True`` si la dirección está reservada para uso local del sitio. Tenga en cuenta que el espacio de direcciones local del sitio ha quedado obsoleto por :RFC:`3879`. Utilice :attr:`~IPv4Address.is_private` para probar si esta dirección está en el espacio de direcciones locales únicas como se define en :RFC:`4193`.

source: For addresses that appear to be IPv4 mapped addresses (starting with ``::FFFF/96``), this property will report the embedded IPv4 address. For any other address, this property will be ``None``.
es_co: Para las direcciones que parecen ser direcciones IPv4 asignadas (que comienzan con ``::FFFF/96``), esta propiedad informará la dirección IPv4 incrustada. Para cualquier otra dirección, esta propiedad será ``None``.

source: For scoped addresses as defined by :RFC:`4007`, this property identifies the particular zone of the address's scope that the address belongs to, as a string. When no scope zone is specified, this property will be ``None``.
es_co: Para las direcciones de ámbito definido por :RFC:`4007`, esta propiedad identifica la zona particular del ámbito de la dirección a la que pertenece la dirección, como una cadena. Cuando no se especifica ninguna zona de alcance, esta propiedad será ``None``.

source: For addresses that appear to be 6to4 addresses (starting with ``2002::/16``) as defined by :RFC:`3056`, this property will report the embedded IPv4 address. For any other address, this property will be ``None``.
es_co: Para direcciones que parecen ser direcciones 6to4 (comenzando con ``2002::/16``) según lo definido por :RFC:`3056`, esta propiedad informará la dirección IPv4 incrustada. Para cualquier otra dirección, esta propiedad será ``None``.

source: For addresses that appear to be Teredo addresses (starting with ``2001::/32``) as defined by :RFC:`4380`, this property will report the embedded ``(server, client)`` IP address pair. For any other address, this property will be ``None``.
es_co: Para las direcciones que parecen ser direcciones Teredo (que comienzan con ``2001::/32``) según lo definido por :RFC:`4380`, esta propiedad informará el par de direcciones IP ``(servidor, cliente)`` incrustado. Para cualquier otra dirección, esta propiedad será ``None``.

source: Refer to the corresponding method documentation in :class:`IPv4Address`.
es_co: Consulte la documentación del método correspondiente en :class:`IPv4Address`.

source: Conversion to Strings and Integers
es_co: Conversión a cadenas y enteros

source: To interoperate with networking interfaces such as the socket module, addresses must be converted to strings or integers. This is handled using the :func:`str` and :func:`int` builtin functions::
es_co: Para interoperar con interfaces de red como el módulo de socket, las direcciones deben convertirse en cadenas o números enteros. Esto se maneja usando las funciones integradas :func:`str` y :func:`int` ::

source: Note that IPv6 scoped addresses are converted to integers without scope zone ID.
es_co: Tenga en cuenta que las direcciones de ámbito IPv6 se convierten en números enteros sin ID de zona de ámbito.

source: Operators
es_co: Operadores

source: Address objects support some operators. Unless stated otherwise, operators can only be applied between compatible objects (i.e. IPv4 with IPv4, IPv6 with IPv6).
es_co: Los objetos de dirección admiten algunos operadores. A menos que se indique lo contrario, los operadores solo se pueden aplicar entre objetos compatibles (es decir, IPv4 con IPv4, IPv6 con IPv6).

source: Comparison operators
es_co: Operadores de comparación

source: Address objects can be compared with the usual set of comparison operators. Same IPv6 addresses with different scope zone IDs are not equal. Some examples::
es_co: Los objetos de dirección se pueden comparar con el conjunto habitual de operadores de comparación. Las mismas direcciones IPv6 con diferentes ID de zona de alcance no son iguales. Algunos ejemplos::

source: Arithmetic operators
es_co: Operadores aritméticos

source: Integers can be added to or subtracted from address objects. Some examples::
es_co: Los números enteros se pueden sumar o restar de los objetos de dirección. Algunos ejemplos::

source: IP Network definitions
es_co: Definiciones de red IP

source: The :class:`IPv4Network` and :class:`IPv6Network` objects provide a mechanism for defining and inspecting IP network definitions. A network definition consists of a *mask* and a *network address*, and as such defines a range of IP addresses that equal the network address when masked (binary AND) with the mask. For example, a network definition with the mask ``255.255.255.0`` and the network address ``192.168.1.0`` consists of IP addresses in the inclusive range ``192.168.1.0`` to ``192.168.1.255``.
es_co: Los objetos :class:`IPv4Network` y :class:`IPv6Network` proporcionan un mecanismo para definir e inspeccionar las definiciones de red IP. Una definición de red consta de una * máscara * y una * dirección de red * y, como tal, define un rango de direcciones IP que son iguales a la dirección de red cuando están enmascaradas (Y binario) con la máscara. Por ejemplo, una definición de red con la máscara ``255.255.255.0`` y la dirección de red ``192.168.1.0`` consta de direcciones IP en el rango inclusivo de ``192.168.1.0`` a ``192.168.1.255``.

source: Prefix, net mask and host mask
es_co: Prefijo, máscara de red y máscara de host

source: There are several equivalent ways to specify IP network masks. A *prefix* ``/<nbits>`` is a notation that denotes how many high-order bits are set in the network mask. A *net mask* is an IP address with some number of high-order bits set. Thus the prefix ``/24`` is equivalent to the net mask ``255.255.255.0`` in IPv4, or ``ffff:ff00::`` in IPv6. In addition, a *host mask* is the logical inverse of a *net mask*, and is sometimes used (for example in Cisco access control lists) to denote a network mask. The host mask equivalent to ``/24`` in IPv4 is ``0.0.0.255``.
es_co: Hay varias formas equivalentes de especificar máscaras de red IP. Un *prefix* ``/<nbits>`` es una notación que indica cuántos bits de orden superior se establecen en la máscara de red. Una máscara de red (*mask*) es una dirección IP con una cierta cantidad de bits de orden superior establecidos. Por lo tanto, el prefijo ``/24`` es equivalente a la máscara de red ``255.255.255.0`` en IPv4, o ``ffff:ff00::`` en IPv6. Además, una * máscara de host * es el inverso lógico de una * máscara de red * y, a veces, se utiliza (por ejemplo, en las listas de control de acceso de Cisco) para indicar una máscara de red. La máscara de host equivalente a ``/24`` en IPv4 es ``0.0.0.255``.

source: Network objects
es_co: Objetos de red
