Repository: python/python-docs-es
Catalog: library/json.po
Languages: es_es

source: :mod:`json` --- JSON encoder and decoder
es_es: :mod:`json` --- Codificador y decodificador JSON

source: **Source code:** :source:`Lib/json/__init__.py`
es_es: **Código fuente:** :source:`Lib/json/__init__.py`

source: `JSON (JavaScript Object Notation) <https://json.org>`_, specified by :rfc:`7159` (which obsoletes :rfc:`4627`) and by `ECMA-404 <https://www.ecma-international.org/publications-and-standards/standards/ecma-404/>`_, is a lightweight data interchange format inspired by `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ object literal syntax (although it is not a strict subset of JavaScript [#rfc-errata]_ ).
es_es: `JSON (JavaScript Object Notation) <https://json.org>`_, especificado por :rfc:`7159` (que hace obsoleto a :rfc:`4627`) y por `ECMA-404 <https://www.ecma-international.org/publications-and-standards/standards/ecma-404/>`_, es un formato de intercambio de datos ligero inspirado en la sintaxis literal del objeto `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ (aunque no es un subconjunto estricto de JavaScript [#rfc-errata]_ ).

source: Be cautious when parsing JSON data from untrusted sources. A malicious JSON string may cause the decoder to consume considerable CPU and memory resources. Limiting the size of data to be parsed is recommended.
es_es: Se debe tener cuidado al analizar datos JSON de fuentes que no son de confianza. Una cadena JSON maliciosa puede hacer que el decodificador consuma considerables recursos del CPU y la memoria. Se recomienda limitar el tamaño de los datos que se van a analizar.

source: :mod:`json` exposes an API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
es_es: :mod:`json` expone una API familiar a los usuarios de los módulos de la biblioteca estándar :mod:`marshal` y :mod:`pickle`.

source: Encoding basic Python object hierarchies::
es_es: Codificación de jerarquías básicas de objetos de Python::

source: Compact encoding::
es_es: Codificación compacta::

source: Pretty printing::
es_es: Impresión linda::

source: Decoding JSON::
es_es: Decodificación JSON::

source: Specializing JSON object decoding::
es_es: Decodificación personalizada de objetos JSON::

source: Extending :class:`JSONEncoder`::
es_es: Extendiendo :class:`JSONEncoder`::

source: Using :mod:`json.tool` from the shell to validate and pretty-print:
es_es: Usando :mod:`json.tool` desde el shell para validación e impresión con sangría:

source: See :ref:`json-commandline` for detailed documentation.
es_es: Consulte :ref:`json-commandline` para obtener documentación detallada.

source: JSON is a subset of `YAML <https://yaml.org/>`_ 1.2. The JSON produced by this module's default settings (in particular, the default *separators* value) is also a subset of YAML 1.0 and 1.1. This module can thus also be used as a YAML serializer.
es_es: JSON es un subconjunto de `YAML <http://yaml.org/>`_ 1.2. El JSON producido por la configuración predeterminada de este módulo (en particular, el valor predeterminado *separators*) también es un subconjunto de YAML 1.0 y 1.1. Por lo tanto, este módulo también se puede utilizar como un serializador YAML.

source: This module's encoders and decoders preserve input and output order by default. Order is only lost if the underlying containers are unordered.
es_es: Los codificadores y decodificadores de este módulo conservan el orden de entrada y salida de forma predeterminada. El orden solo se pierde si los contenedores subyacentes no están ordenados.

source: Basic Usage
es_es: Uso básico

source: Serialize *obj* as a JSON formatted stream to *fp* (a ``.write()``-supporting :term:`file-like object`) using this :ref:`conversion table <py-to-json-table>`.
es_es: Serializa *obj* como una secuencia con formato JSON a *fp* (una invocación ``.write()``- que soporta :term:`file-like object`) usando esto :ref:`conversion table <py-to-json-table>`.

source: If *skipkeys* is true (default: ``False``), then dict keys that are not of a basic type (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) will be skipped instead of raising a :exc:`TypeError`.
es_es: Si *skipkeys* es verdadero (predeterminado: ``False``), entonces las llaves del dict que no son de un tipo básico (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) se omitirán en lugar de generar un :exc:`TypeError`.

source: The :mod:`json` module always produces :class:`str` objects, not :class:`bytes` objects. Therefore, ``fp.write()`` must support :class:`str` input.
es_es: El módulo :mod:`json` siempre produce objetos :class:`str`, no objetos :class:`bytes`. Por lo tanto, ``fp.write()`` debe admitir :class:`str` como entrada.

source: If *ensure_ascii* is true (the default), the output is guaranteed to have all incoming non-ASCII characters escaped. If *ensure_ascii* is false, these characters will be output as-is.
es_es: Si *ensure_ascii* es verdadero (el valor predeterminado), se garantiza que la salida tendrá todos los caracteres entrantes no ASCII escapados. Si *ensure_ascii* es falso, estos caracteres se mostrarán tal cual.

source: If *check_circular* is false (default: ``True``), then the circular reference check for container types will be skipped and a circular reference will result in a :exc:`RecursionError` (or worse).
es_es: Si *check_circular* es falso (predeterminado: ``True``), se omitirá la verificación de referencia circular para los tipos de contenedor y una referencia circular dará como resultado :exc:`RecursionError` (o algo peor).

source: If *allow_nan* is false (default: ``True``), then it will be a :exc:`ValueError` to serialize out of range :class:`float` values (``nan``, ``inf``, ``-inf``) in strict compliance of the JSON specification. If *allow_nan* is true, their JavaScript equivalents (``NaN``, ``Infinity``, ``-Infinity``) will be used.
es_es: Si *allow_nan* es falso (predeterminado: ``True``), entonces serializar los valores fuera de rango :class:`float` (``nan``, ``inf``, ``-inf``) provocará un :exc:`ValueError` en estricto cumplimiento de la especificación JSON. Si *allow_nan* es verdadero, se utilizarán sus equivalentes de JavaScript (``NaN``, ``Infinity``, ``-Infinity``).

source: If *indent* is a non-negative integer or string, then JSON array elements and object members will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the most compact representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
es_es: Si *indent* es un entero no negativo o una cadena, los elementos del arreglo JSON y los miembros del objeto se imprimirán con ese nivel de sangría. Un nivel de sangría de 0, negativo o ``""`` solo insertará nuevas líneas. ``None`` (el valor predeterminado) selecciona la representación más compacta. El uso de una sangría de entero positivo agrega sangrías de muchos espacios por nivel. Si *indent* es una cadena (como ``"\t"``), esa cadena se usa para agregarle sangría a cada nivel.

source: Allow strings for *indent* in addition to integers.
es_es: Permite cadenas de caracteres para *indent* además de enteros.

source: If specified, *separators* should be an ``(item_separator, key_separator)`` tuple. The default is ``(', ', ': ')`` if *indent* is ``None`` and ``(',', ': ')`` otherwise. To get the most compact JSON representation, you should specify ``(',', ':')`` to eliminate whitespace.
es_es: Si se especifica, *separators* debe ser una tupla ``(separador_elemento, separador_llave)``. El valor predeterminado es ``(', ', ': ')`` si *indent* es ``None`` y ``(', ', ': ')`` de lo contrario. Para obtener la representación JSON más compacta, debe especificar ``(', ', ': ')`` para eliminar espacios en blanco.

source: Use ``(',', ': ')`` as default if *indent* is not ``None``.
es_es: Usa ``(',', ': ')`` como predeterminado si *indent* no es ``None``.

source: If specified, *default* should be a function that gets called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If not specified, :exc:`TypeError` is raised.
es_es: Si se especifica, *default* debería ser una función que se llama para objetos que de otro modo no se pueden serializar. Debería retornar una versión codificable JSON del objeto o generar un :exc:`TypeError`. Si no se especifica, produce :exc:`TypeError`.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key.
es_es: Si *sort_keys* es verdadero (predeterminado: ``False``), la salida de los diccionarios se ordenará por llave.

source: To use a custom :class:`JSONEncoder` subclass (e.g. one that overrides the :meth:`~JSONEncoder.default` method to serialize additional types), specify it with the *cls* kwarg; otherwise :class:`JSONEncoder` is used.
es_es: Para usar una subclase personalizada de :class:`JSONEncoder` (por ejemplo, una que sobreescriba el método :meth:`~JSONEncoder.default` para serializar tipos adicionales), se especifica mediante el argumento por palabra clave *cls*; de lo contrario se usa :class:`JSONEncoder`.

source: All optional parameters are now :ref:`keyword-only <keyword-only_parameter>`.
es_es: Todos los parámetros opcionales son ahora :ref:`palabra-clave-solamente <keyword-only_parameter>`.

source: Unlike :mod:`pickle` and :mod:`marshal`, JSON is not a framed protocol, so trying to serialize multiple objects with repeated calls to :func:`dump` using the same *fp* will result in an invalid JSON file.
es_es: A diferencia de :mod:`pickle` y :mod:`marshal`, JSON no es un protocolo enmarcado, por lo que intentar serializar varios objetos con llamadas repetidas a :func:`dump` utilizando el mismo *fp* dará como resultado un archivo JSON no válido.

source: Serialize *obj* to a JSON formatted :class:`str` using this :ref:`conversion table <py-to-json-table>`. The arguments have the same meaning as in :func:`dump`.
es_es: Serializa *obj* en un :class:`str` con formato JSON usando esta :ref:`conversion table <py-to-json-table>`. Los argumentos tienen el mismo significado que en :func:`dump`.

source: Keys in key/value pairs of JSON are always of the type :class:`str`. When a dictionary is converted into JSON, all the keys of the dictionary are coerced to strings. As a result of this, if a dictionary is converted into JSON and then back into a dictionary, the dictionary may not equal the original one. That is, ``loads(dumps(x)) != x`` if x has non-string keys.
es_es: Las llaves de los pares llave/valor de JSON siempre son del tipo :class:`str`. Cuando un diccionario se convierte en JSON, todas las llaves del diccionario se convierten en cadenas. Como resultado de esto, si un diccionario se convierte en JSON y, a continuación, se convierte nuevamente en un diccionario, el diccionario puede que no sea igual al original. Es decir, ``loads(dumps(x)) != x`` si x tiene llaves que no son de tipo cadena de caracteres.

source: Deserialize *fp* (a ``.read()``-supporting :term:`text file` or :term:`binary file` containing a JSON document) to a Python object using this :ref:`conversion table <json-to-py-table>`.
es_es: Deserializa *fp* (un :term:`text file` o :term:`binary file` que soporte ``.read()`` y que contiene un documento JSON) a un objeto Python usando esta :ref:`conversion table <json-to-py-table>`.

source: *object_hook* is an optional function that will be called with the result of any object literal decoded (a :class:`dict`). The return value of *object_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders (e.g. `JSON-RPC <https://www.jsonrpc.org>`_ class hinting).
es_es: *object_hook* es una función opcional a la que se llamará con el resultado de cualquier literal de objeto decodificado (un :class:`dict`). El valor de retorno de *object_hook* se utilizará en lugar de :class:`dict`. Esta característica se puede utilizar para implementar decodificadores personalizados (por ejemplo, la sugerencia de clase `JSON-RPC <http://www.jsonrpc.org>`_).

source: *object_pairs_hook* is an optional function that will be called with the result of any object literal decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
es_es: *object_pairs_hook* es una función opcional a la que se llamará con el resultado de cualquier literal de objeto decodificado con una lista ordenada de pares. El valor de retorno de *object_pairs_hook* se utilizará en lugar de :class:`dict`. Esta característica se puede utilizar para implementar decodificadores personalizados. Si también se define *object_hook*, el *object_pairs_hook* tiene prioridad.

source: Added support for *object_pairs_hook*.
es_es: Soporte agregado para *object_pairs_hook*.

source: *parse_float*, if specified, will be called with the string of every JSON float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for JSON floats (e.g. :class:`decimal.Decimal`).
es_es: *parse_float*, si se especifica, se llamará con la cadena de cada flotante JSON que se va a decodificar. De forma predeterminada, esto es equivalente a ``float(num_str)``. Esto se puede utilizar para hacer uso de otro tipo de datos o analizador para flotantes JSON (por ejemplo :class:`decimal. Decimal`).

source: *parse_int*, if specified, will be called with the string of every JSON int to be decoded. By default, this is equivalent to ``int(num_str)``. This can be used to use another datatype or parser for JSON integers (e.g. :class:`float`).
es_es: *parse_int*, si se especifica, se llamará con la cadena de cada entero JSON que se va a decodificar. De forma predeterminada, esto es equivalente a ``int(num_str)``. Esto se puede utilizar para hace uso de otro tipo de datos o analizador para enteros JSON (por ejemplo :class:`float`).

source: The default *parse_int* of :func:`int` now limits the maximum length of the integer string via the interpreter's :ref:`integer string conversion length limitation <int_max_str_digits>` to help avoid denial of service attacks.
es_es: El *parse_int* predeterminado de :func:`int` ahora limita la longitud máxima de la cadena de enteros a través de la :ref:`integer string conversion length limitation <int_max_str_digits>` del intérprete para ayudar a evitar ataques de denegación de servicio.

source: *parse_constant*, if specified, will be called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered.
es_es: *parse_constant*, si se especifica, se llamará con una de las siguientes cadenas: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. Esto se puede utilizar para generar una excepción si se encuentran números JSON inválidos.

source: *parse_constant* doesn't get called on 'null', 'true', 'false' anymore.
es_es: *parse_constant* ya no es llamado en 'null', 'true', 'false'.

source: To use a custom :class:`JSONDecoder` subclass, specify it with the ``cls`` kwarg; otherwise :class:`JSONDecoder` is used. Additional keyword arguments will be passed to the constructor of the class.
es_es: Para utilizar una subclase personalizada de :class:`JSONDecoder`, especificarlo con el argumento por llave ``cls``; de lo contrario, se utilizará :class:`JSONDecoder`. Se pasarán argumentos adicionales de palabra llave al constructor de la clase.

source: If the data being deserialized is not a valid JSON document, a :exc:`JSONDecodeError` will be raised.
es_es: Si los datos que se deserializan no constituyen un documento JSON válido, se lanzará un :exc:`JSONDecodeError`.

source: *fp* can now be a :term:`binary file`. The input encoding should be UTF-8, UTF-16 or UTF-32.
es_es: *fp* ahora puede ser un :term:`binary file`. La codificación de entrada debe ser UTF-8, UTF-16 o UTF-32.

source: Deserialize *s* (a :class:`str`, :class:`bytes` or :class:`bytearray` instance containing a JSON document) to a Python object using this :ref:`conversion table <json-to-py-table>`.
es_es: Deserializa *s* (una instancia :class:`str`, :class:`bytes` o :class:`bytearray` que contiene un documento JSON) en un objeto Python mediante esta :ref:`conversion table <json-to-py-table>`.

source: The other arguments have the same meaning as in :func:`load`.
es_es: Los otros argumentos tienen el mismo significado que en :func:`load`.

source: *s* can now be of type :class:`bytes` or :class:`bytearray`. The input encoding should be UTF-8, UTF-16 or UTF-32.
es_es: *s* ahora puede ser de tipo :class:`bytes` o :class:`bytearray`. La codificación de entrada debe ser UTF-8, UTF-16 o UTF-32.

source: The keyword argument *encoding* has been removed.
es_es: El argumento de palabra llave *encoding* ha sido removido.

source: Encoders and Decoders
es_es: Codificadores y Decodificadores

source: Simple JSON decoder.
es_es: Decodificador JSON simple.

source: Performs the following translations in decoding by default:
es_es: Realiza las siguientes traducciones en la decodificación de forma predeterminada:

source: number (int)
es_es: número (int)

source: number (real)
es_es: número (real)

source: It also understands ``NaN``, ``Infinity``, and ``-Infinity`` as their corresponding ``float`` values, which is outside the JSON spec.
es_es: También entiende ``NaN``, ``Infinity`` y ``-Infinity`` como sus correspondientes valores ``float``, que está fuera de la especificación JSON.

source: *object_hook*, if specified, will be called with the result of every JSON object decoded and its return value will be used in place of the given :class:`dict`. This can be used to provide custom deserializations (e.g. to support `JSON-RPC <https://www.jsonrpc.org>`_ class hinting).
es_es: *object_hook*, si se especifica, se llamará con el resultado de cada objeto JSON decodificado y su valor de retorno se utilizará en lugar de la :class:`dict` dada. Esto se puede usar para proporcionar deserializaciones personalizadas (por ejemplo, para admitir sugerencias de clases `JSON-RPC <http://www.jsonrpc.org>`_).

source: *object_pairs_hook*, if specified will be called with the result of every JSON object decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
es_es: *object_pairs_hook*, si se especifica se llamará con el resultado de cada objeto JSON decodificado con una lista ordenada de pares. El valor de retorno de *object_pairs_hook* se utilizará en lugar de :class:`dict`. Esta característica se puede utilizar para implementar decodificadores personalizados. Si también se define *object_hook*, el *object_pairs_hook* tiene prioridad.

source: If *strict* is false (``True`` is the default), then control characters will be allowed inside strings. Control characters in this context are those with character codes in the 0--31 range, including ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.
es_es: Si *strict* es falso (''True'' es el valor predeterminado), se permitirán caracteres de control dentro de cadenas. Los caracteres de control en este contexto son aquellos con códigos de caracteres en el rango 0--31, incluyendo ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.

source: All parameters are now :ref:`keyword-only <keyword-only_parameter>`.
es_es: Todos los parámetros son ahora :ref:`palabra-clave-solamente <keyword-only_parameter>`.

source: Return the Python representation of *s* (a :class:`str` instance containing a JSON document).
es_es: Retorna la representación Python de *s* (una instancia :class:`str` que contiene un documento JSON).

source: :exc:`JSONDecodeError` will be raised if the given JSON document is not valid.
es_es: :exc:`JSONDecodeError` se producirá si el documento JSON entregado es invalido.

source: Decode a JSON document from *s* (a :class:`str` beginning with a JSON document) and return a 2-tuple of the Python representation and the index in *s* where the document ended.
es_es: Decodifica un documento JSON de *s* (un :class:`str` comenzando con un documento JSON) y retorna una tupla de 2 de la representación Python y el índice en *s* donde terminó el documento.

source: This can be used to decode a JSON document from a string that may have extraneous data at the end.
es_es: Esto se puede usar para decodificar un documento JSON de una cadena de caracteres que puede tener datos extraños al final.

source: Extensible JSON encoder for Python data structures.
es_es: Codificador JSON extensible para estructuras de datos de Python.

source: Supports the following objects and types by default:
es_es: Admite los siguientes objetos y tipos de forma predeterminada:

source: int, float, int- & float-derived Enums
es_es: int, float, Enums derivadas de int o float

source: Added support for int- and float-derived Enum classes.
es_es: Compatibilidad añadida con las clases Enum derivadas de int y float.

source: To extend this to recognize other objects, subclass and implement a :meth:`~JSONEncoder.default` method with another method that returns a serializable object for ``o`` if possible, otherwise it should call the superclass implementation (to raise :exc:`TypeError`).
es_es: A fin de extender esto para reconocer otros objetos, implementar una subclase con un método :meth:`~JSONEncoder.default` con otro método que retorna un objeto serializable para ''o'' si es posible, de lo contrario debe llamar a la implementación de superclase (para lanzar :exc:`TypeError`).

source: If *skipkeys* is false (the default), a :exc:`TypeError` will be raised when trying to encode keys that are not :class:`str`, :class:`int`, :class:`float` or ``None``. If *skipkeys* is true, such items are simply skipped.
es_es: Si *skipkeys* es falso (lo es por defecto), un :exc:`TypeError` será lanzado cuando se trate de codificar llaves que no sean :class:`str`, :class:`int`, :class:`float` o ``None``. Si *skipkeys* es verdadero, tales elementos son simplemente pasados por alto.

source: If *check_circular* is true (the default), then lists, dicts, and custom encoded objects will be checked for circular references during encoding to prevent an infinite recursion (which would cause a :exc:`RecursionError`). Otherwise, no such check takes place.
es_es: Si *check_circular* es cierto (valor predeterminado), se comprobarán las listas, los diccionarios y los objetos codificados personalizados en busca de referencias circulares durante la codificación para evitar una recursividad infinita (lo que provocaría un :exc:`RecursionError`). De lo contrario, no se realiza ninguna comprobación de este tipo.

source: If *allow_nan* is true (the default), then ``NaN``, ``Infinity``, and ``-Infinity`` will be encoded as such. This behavior is not JSON specification compliant, but is consistent with most JavaScript based encoders and decoders. Otherwise, it will be a :exc:`ValueError` to encode such floats.
es_es: Si *allow_nan* es cierto (valor predeterminado), ``NaN``, ``Infinity`` y ``-Infinity`` se codificarán como tales. Este comportamiento no es compatible con las especificaciones JSON, pero es coherente con la mayoría de los codificadores y decodificadores basados en JavaScript. De lo contrario, codificar dichos puntos flotantes provocará un :exc:`ValueError`.
