Repository: python/python-docs-es
Catalog: library/json.po
Languages: es_es

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key; this is useful for regression tests to ensure that JSON serializations can be compared on a day-to-day basis.
es_es: Si *sort_keys* es cierto (predeterminado: ``False``), la salida de los diccionarios se ordenará por clave; esto es útil para las pruebas de regresión para garantizar que las serializaciones JSON se pueden comparar en el día a día.

source: Implement this method in a subclass such that it returns a serializable object for *o*, or calls the base implementation (to raise a :exc:`TypeError`).
es_es: Implemente este método en una subclase de modo que retorne un objeto serializable para *o*, o llame a la implementación base (para generar un :exc:`TypeError`).

source: For example, to support arbitrary iterators, you could implement :meth:`~JSONEncoder.default` like this::
es_es: Por ejemplo, para admitir iteradores arbitrarios, podría implementar :meth:`~JSONEncoder.default` de esta manera::

source: Return a JSON string representation of a Python data structure, *o*. For example::
es_es: Retorna una representación de cadena de caracteres JSON de una estructura de datos de Python, *o*. Por ejemplo::

source: Encode the given object, *o*, and yield each string representation as available. For example::
es_es: Codifica el objeto dado, *o*, y produce cada representación de cadena como disponible. Por ejemplo::

source: Exceptions
es_es: Excepciones

source: Subclass of :exc:`ValueError` with the following additional attributes:
es_es: Subclase de :exc:`ValueError` con los siguientes atributos adicionales:

source: The unformatted error message.
es_es: El mensaje de error sin formato.

source: The JSON document being parsed.
es_es: El documento JSON que se está analizando.

source: The start index of *doc* where parsing failed.
es_es: El índice de inicio de *doc* donde se produjo un error en el análisis.

source: The line corresponding to *pos*.
es_es: La línea correspondiente a *pos*.

source: The column corresponding to *pos*.
es_es: La columna correspondiente a *pos*.

source: Standard Compliance and Interoperability
es_es: Cumplimiento e interoperabilidad estándar

source: The JSON format is specified by :rfc:`7159` and by `ECMA-404 <https://www.ecma-international.org/publications-and-standards/standards/ecma-404/>`_. This section details this module's level of compliance with the RFC. For simplicity, :class:`JSONEncoder` and :class:`JSONDecoder` subclasses, and parameters other than those explicitly mentioned, are not considered.
es_es: El formato JSON se especifica por :rfc:`7159` y por `ECMA-404 <https://www.ecma-international.org/publications-and-standards/standards/ecma-404/>`_. Esta sección detalla el nivel de cumplimiento de la RFC de este módulo. Para simplificar, :class:`JSONEncoder` y :class:`JSONDecoder` subclases, y los parámetros distintos de los mencionados explícitamente, no se consideran.

source: This module does not comply with the RFC in a strict fashion, implementing some extensions that are valid JavaScript but not valid JSON. In particular:
es_es: Este módulo no cumple con la RFC de forma estricta, implementando algunas extensiones que son válidas en JavaScript pero no son válidas en JSON. En particular:

source: Infinite and NaN number values are accepted and output;
es_es: Se aceptan y se envían valores de números Infinitos y NaN;

source: Repeated names within an object are accepted, and only the value of the last name-value pair is used.
es_es: Se aceptan nombres repetidos dentro de un objeto y solo se utiliza el valor del último par nombre-valor.

source: Since the RFC permits RFC-compliant parsers to accept input texts that are not RFC-compliant, this module's deserializer is technically RFC-compliant under default settings.
es_es: Puesto que el RFC permite a los analizadores compatibles con RFC aceptar textos de entrada que no son compatibles con RFC, el deserializador de este módulo es técnicamente compatible con RFC bajo la configuración predeterminada.

source: Character Encodings
es_es: Codificaciones de caracteres

source: The RFC requires that JSON be represented using either UTF-8, UTF-16, or UTF-32, with UTF-8 being the recommended default for maximum interoperability.
es_es: La RFC requiere que JSON se represente mediante UTF-8, UTF-16 o UTF-32, siendo UTF-8 el valor predeterminado recomendado para la máxima interoperabilidad.

source: As permitted, though not required, by the RFC, this module's serializer sets *ensure_ascii=True* by default, thus escaping the output so that the resulting strings only contain ASCII characters.
es_es: Según lo permitido, aunque no es necesario, por la RFC, el serializador de este módulo establece *ensure_ascii=True* de forma predeterminada, escapando así el dato de salida para que las cadenas resultantes solo contengan caracteres ASCII.

source: Other than the *ensure_ascii* parameter, this module is defined strictly in terms of conversion between Python objects and :class:`Unicode strings <str>`, and thus does not otherwise directly address the issue of character encodings.
es_es: Aparte del parámetro *ensure_ascii*, este módulo se define estrictamente en términos de conversión entre objetos Python y :class:`Unicode strings <str>`, y por lo tanto no aborda directamente el problema de las codificaciones de caracteres.

source: The RFC prohibits adding a byte order mark (BOM) to the start of a JSON text, and this module's serializer does not add a BOM to its output. The RFC permits, but does not require, JSON deserializers to ignore an initial BOM in their input. This module's deserializer raises a :exc:`ValueError` when an initial BOM is present.
es_es: La RFC prohíbe agregar una marca de orden byte (BOM, por sus siglas en inglés) al inicio de un texto JSON y el serializador de este módulo no agrega una BOM a su salida. La RFC permite, pero no requiere, deserializadores JSON para omitir una BOM inicial en su entrada. El deserializador de este módulo genera un :exc:`ValueError` cuando hay una lista de materiales inicial.

source: The RFC does not explicitly forbid JSON strings which contain byte sequences that don't correspond to valid Unicode characters (e.g. unpaired UTF-16 surrogates), but it does note that they may cause interoperability problems. By default, this module accepts and outputs (when present in the original :class:`str`) code points for such sequences.
es_es: La RFC no prohíbe explícitamente las cadenas JSON que contienen secuencias de bytes que no corresponden a caracteres Unicode válidos (por ejemplo, sustitutos UTF-16 no espaciados), pero sí tiene en cuenta que pueden causar problemas de interoperabilidad. De forma predeterminada, este módulo acepta y genera puntos de código (cuando está presente en el original :class:`str`) para dichas secuencias.

source: Infinite and NaN Number Values
es_es: Valores de número infinito y NaN

source: The RFC does not permit the representation of infinite or NaN number values. Despite that, by default, this module accepts and outputs ``Infinity``, ``-Infinity``, and ``NaN`` as if they were valid JSON number literal values::
es_es: El RFC no permite la representación de los valores de número infinito o NaN. A pesar de eso, de forma predeterminada, este módulo acepta y genera ``Infinity``, ``-Infinity`` y ``NaN`` como si fueran valores literales de número JSON válidos::

source: In the serializer, the *allow_nan* parameter can be used to alter this behavior. In the deserializer, the *parse_constant* parameter can be used to alter this behavior.
es_es: En el serializador, el parámetro *allow_nan* se puede utilizar para modificar este comportamiento. En el deserializador, se puede utilizar el parámetro *parse_constant* para modificar este comportamiento.

source: Repeated Names Within an Object
es_es: Nombres repetidos dentro de un objeto

source: The RFC specifies that the names within a JSON object should be unique, but does not mandate how repeated names in JSON objects should be handled. By default, this module does not raise an exception; instead, it ignores all but the last name-value pair for a given name::
es_es: La RFC especifica que los nombres dentro de un objeto JSON deben ser únicos, pero no exige cómo se deben controlar los nombres repetidos en los objetos JSON. De forma predeterminada, este módulo no genera una excepción; en su lugar, ignora todo excepto el último par nombre-valor para un nombre dado::

source: The *object_pairs_hook* parameter can be used to alter this behavior.
es_es: El parámetro *object_pairs_hook* se puede utilizar para alterar este comportamiento.

source: Top-level Non-Object, Non-Array Values
es_es: Valores de nivel superior No-Objeto , No-Arreglo

source: The old version of JSON specified by the obsolete :rfc:`4627` required that the top-level value of a JSON text must be either a JSON object or array (Python :class:`dict` or :class:`list`), and could not be a JSON null, boolean, number, or string value. :rfc:`7159` removed that restriction, and this module does not and has never implemented that restriction in either its serializer or its deserializer.
es_es: La versión anterior de JSON especificada por el obsoleto :rfc:`4627` requería que el valor de nivel superior de un texto JSON fuera un objeto JSON o un arreglo (Python :class:`dict` o :class:`list`), y no podía ser un valor JSON nulo, booleano, numérico o de cadena. :rfc:`7159` eliminó esa restricción, y este módulo no ha implementado ni ha implementado nunca esa restricción en su serializador o en su deserializador.

source: Regardless, for maximum interoperability, you may wish to voluntarily adhere to the restriction yourself.
es_es: Independientemente, para lograr la máxima interoperabilidad, es posible que usted desee adherirse voluntariamente a la restricción.

source: Implementation Limitations
es_es: Limitaciones de la implementación

source: Some JSON deserializer implementations may set limits on:
es_es: Algunas implementaciones del deserializador JSON pueden establecer límites en:

source: the size of accepted JSON texts
es_es: el tamaño de los textos JSON aceptados

source: the maximum level of nesting of JSON objects and arrays
es_es: el nivel máximo de anidamiento de objetos y arreglos JSON

source: the range and precision of JSON numbers
es_es: el rango y precisión de los números JSON

source: the content and maximum length of JSON strings
es_es: el contenido y la longitud máxima de las cadenas de caracteres JSON

source: This module does not impose any such limits beyond those of the relevant Python datatypes themselves or the Python interpreter itself.
es_es: Este módulo no impone tales límites más allá de los propios tipos de datos de Python relevantes o del propio intérprete de Python.

source: When serializing to JSON, beware any such limitations in applications that may consume your JSON. In particular, it is common for JSON numbers to be deserialized into IEEE 754 double precision numbers and thus subject to that representation's range and precision limitations. This is especially relevant when serializing Python :class:`int` values of extremely large magnitude, or when serializing instances of "exotic" numerical types such as :class:`decimal.Decimal`.
es_es: Al serializar en JSON, tenga en cuenta las limitaciones en las aplicaciones que pueden consumir su JSON. En particular, es común que los números JSON se deserialicen en números de doble precisión IEEE 754 y, por lo tanto, estén sujetos al rango y las limitaciones de precisión de esa representación. Esto es especialmente relevante cuando se serializan valores de Python :class:`int` de magnitud extremadamente grande, o cuando se serializan instancias de tipos numéricos "exóticos" como :class:`decimal. Decimal`.

source: Command Line Interface
es_es: Interfaz de línea de comandos

source: **Source code:** :source:`Lib/json/tool.py`
es_es: **Código fuente:** :source:`Lib/json/tool.py`

source: The :mod:`json.tool` module provides a simple command line interface to validate and pretty-print JSON objects.
es_es: El módulo :mod:`json.tool` proporciona una interfaz de línea de comandos simple para validar e imprimir objetos JSON.

source: If the optional ``infile`` and ``outfile`` arguments are not specified, :data:`sys.stdin` and :data:`sys.stdout` will be used respectively:
es_es: Si no se especifican los argumentos opcionales ``infile`` y ``outfile``, se utilizarán :data:`sys.stdin` y :data:`sys.stdout` respectivamente:

source: The output is now in the same order as the input. Use the :option:`--sort-keys` option to sort the output of dictionaries alphabetically by key.
es_es: La salida está ahora en el mismo orden que la entrada. Utilice la opción :option:`--sort-keys` para ordenar la salida de los diccionarios alfabéticamente por llave.

source: Command line options
es_es: Opciones de línea de comandos

source: The JSON file to be validated or pretty-printed:
es_es: El archivo JSON que se va a validar o imprimir con impresión linda:

source: If *infile* is not specified, read from :data:`sys.stdin`.
es_es: Si no se especifica *infile*, lee :data:`sys.stdin`.

source: Write the output of the *infile* to the given *outfile*. Otherwise, write it to :data:`sys.stdout`.
es_es: Escribe la salida de *infile* en el *outfile* dado. De lo contrario, lo escribe en :data:`sys.stdout`.

source: Sort the output of dictionaries alphabetically by key.
es_es: Ordena la salida de los diccionarios alfabéticamente por llave.

source: Disable escaping of non-ascii characters, see :func:`json.dumps` for more information.
es_es: Deshabilita el escape de caracteres que no sean ascii, véase :func:`json.dumps` para más información.

source: Parse every input line as separate JSON object.
es_es: Analiza cada línea de entrada como objeto JSON independiente.

source: Mutually exclusive options for whitespace control.
es_es: Opciones mutuamente exclusivas para control de espacios en blanco.

source: Show the help message.
es_es: Muestra el mensaje de ayuda.

source: Footnotes
es_es: Notas de pie de página

source: As noted in `the errata for RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permits literal U+2028 (LINE SEPARATOR) and U+2029 (PARAGRAPH SEPARATOR) characters in strings, whereas JavaScript (as of ECMAScript Edition 5.1) does not.
es_es: Como se indica en `la errata para RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc-7159>`_, JSON permite caracteres literales U+2028 (SEPARADOR DE LINEA) y U+2029 (SEPARADOR DE PÁRRAFO) en cadenas, mientras que JavaScript (a partir de ECMAScript Edición 5.1) no lo hace.
