Repository: python/python-docs-es
Catalog: library/logging.config.po
Languages: es

source: The specified loggers will be configured according to the level, propagation, filters and handlers specified.
es: Los registradores especificados se configurarán de acuerdo con el nivel, la propagación, los filtros y los gestores especificados.

source: *root* - this will be the configuration for the root logger. Processing of the configuration will be as for any logger, except that the ``propagate`` setting will not be applicable.
es: *root* - Esta será la configuración para el registrador raíz. El procesamiento de la configuración será como para cualquier registrador, excepto que la configuración de ``propagate`` no será aplicable.

source: *incremental* - whether the configuration is to be interpreted as incremental to the existing configuration. This value defaults to ``False``, which means that the specified configuration replaces the existing configuration with the same semantics as used by the existing :func:`fileConfig` API.
es: *incremental* - si la configuración debe interpretarse como incremental a la configuración existente. Este valor predeterminado es ``False``, lo que significa que la configuración especificada reemplaza la configuración existente con la misma semántica que la utilizada por la API existente :func:`fileConfig`.

source: If the specified value is ``True``, the configuration is processed as described in the section on :ref:`logging-config-dict-incremental`.
es: Si el valor especificado es ``True``, la configuración se procesa como se describe en la sección sobre :ref:`logging-config-dict-incremental`.

source: *disable_existing_loggers* - whether any existing non-root loggers are to be disabled. This setting mirrors the parameter of the same name in :func:`fileConfig`. If absent, this parameter defaults to ``True``. This value is ignored if *incremental* is ``True``.
es: *disable_existing_loggers* - si se debe deshabilitar cualquier registrador que no sea raíz existente. Esta configuración refleja el parámetro del mismo nombre en :func:`fileConfig`. Si está ausente, este parámetro tiene el valor predeterminado ``True``. Este valor se ignora si *incremental* es ``True``.

source: Incremental Configuration
es: Configuración incremental

source: It is difficult to provide complete flexibility for incremental configuration. For example, because objects such as filters and formatters are anonymous, once a configuration is set up, it is not possible to refer to such anonymous objects when augmenting a configuration.
es: Es difícil proporcionar flexibilidad completa para la configuración incremental. Por ejemplo, debido a que los objetos como los filtros y formateadores son anónimos, una vez que se configura una configuración, no es posible hacer referencia a dichos objetos anónimos al aumentar una configuración.

source: Furthermore, there is not a compelling case for arbitrarily altering the object graph of loggers, handlers, filters, formatters at run-time, once a configuration is set up; the verbosity of loggers and handlers can be controlled just by setting levels (and, in the case of loggers, propagation flags). Changing the object graph arbitrarily in a safe way is problematic in a multi-threaded environment; while not impossible, the benefits are not worth the complexity it adds to the implementation.
es: Además, no hay un caso convincente para alterar arbitrariamente el gráfico de objetos de registradores, gestores, filtros, formateadores en tiempo de ejecución, una vez que se configura una configuración; la verbosidad de los registradores y gestores se puede controlar simplemente estableciendo niveles (y, en el caso de los registradores, flags de propagación). Cambiar el gráfico de objetos de manera arbitraria y segura es problemático en un entorno de subprocesos múltiples; Si bien no es imposible, los beneficios no valen la complejidad que agrega a la implementación.

source: Thus, when the ``incremental`` key of a configuration dict is present and is ``True``, the system will completely ignore any ``formatters`` and ``filters`` entries, and process only the ``level`` settings in the ``handlers`` entries, and the ``level`` and ``propagate`` settings in the ``loggers`` and ``root`` entries.
es: Por lo tanto, cuando la tecla ``incremental`` de un diccionario de configuración está presente y es ``True``, el sistema ignorará por completo cualquier entrada de ``formatters`` y ``filters``, y procesará solo el ``level`` configuraciones en las entradas de ``handlers``, y las configuraciones de ``level`` y ``propagate`` en las entradas de ``loggers`` y ``root``.

source: Using a value in the configuration dict lets configurations to be sent over the wire as pickled dicts to a socket listener. Thus, the logging verbosity of a long-running application can be altered over time with no need to stop and restart the application.
es: El uso de un valor en la configuración diccionario permite que las configuraciones se envíen a través del cable como dictados en vinagre a un escucha de socket. Por lo tanto, la verbosidad de registro de una aplicación de larga ejecución puede modificarse con el tiempo sin necesidad de detener y reiniciar la aplicación.

source: Object connections
es: Conexiones de objeto

source: The schema describes a set of logging objects - loggers, handlers, formatters, filters - which are connected to each other in an object graph. Thus, the schema needs to represent connections between the objects. For example, say that, once configured, a particular logger has attached to it a particular handler. For the purposes of this discussion, we can say that the logger represents the source, and the handler the destination, of a connection between the two. Of course in the configured objects this is represented by the logger holding a reference to the handler. In the configuration dict, this is done by giving each destination object an id which identifies it unambiguously, and then using the id in the source object's configuration to indicate that a connection exists between the source and the destination object with that id.
es: El esquema describe un conjunto de objetos de registro (registradores, gestores, formateadores, filtros) que están conectados entre sí en un gráfico de objetos. Por lo tanto, el esquema necesita representar conexiones entre los objetos. Por ejemplo, supongamos que, una vez configurado, un registrador particular le ha adjuntado un gestor particular. A los fines de esta discusión, podemos decir que el registrador representa la fuente y el gestor el destino de una conexión entre los dos. Por supuesto, en los objetos configurados esto está representado por el registrador que tiene una referencia al gestor. En la configuración dict, esto se hace dando a cada objeto de destino una identificación que lo identifica inequívocamente, y luego utilizando la identificación en la configuración del objeto de origen para indicar que existe una conexión entre el origen y el objeto de destino con esa identificación.

source: So, for example, consider the following YAML snippet:
es: Entonces, por ejemplo, considere el siguiente fragmento de YAML:

source: (Note: YAML used here because it's a little more readable than the equivalent Python source form for the dictionary.)
es: (Nota: YAML se usa aquí porque es un poco más legible que el formulario fuente Python equivalente para el diccionario.)

source: The ids for loggers are the logger names which would be used programmatically to obtain a reference to those loggers, e.g. ``foo.bar.baz``. The ids for Formatters and Filters can be any string value (such as ``brief``, ``precise`` above) and they are transient, in that they are only meaningful for processing the configuration dictionary and used to determine connections between objects, and are not persisted anywhere when the configuration call is complete.
es: Los identificadores para los registradores son los nombres de los registradores que se utilizarían mediante programación para obtener una referencia a esos registradores, por ejemplo ``foo.bar.baz``. Los identificadores para Formateadores y Filtros pueden ser cualquier valor de cadena (como ``breve``, ``preciso`` arriba) y son transitorios, ya que solo son significativos para procesar el diccionario de configuración y se utilizan para determinar conexiones entre objetos , y no persisten en ninguna parte cuando se completa la llamada de configuración.

source: The above snippet indicates that logger named ``foo.bar.baz`` should have two handlers attached to it, which are described by the handler ids ``h1`` and ``h2``. The formatter for ``h1`` is that described by id ``brief``, and the formatter for ``h2`` is that described by id ``precise``.
es: El fragmento anterior indica que el registrador llamado ``foo.bar.baz`` debe tener dos gestores adjuntos, que se describen mediante los identificadores de gestor ``h1`` y ``h2``. El formateador para ``h1`` es el descrito por identificador ``brief``, y el formateador para ``h2`` es el descrito por identificador ``precise``.

source: User-defined objects
es: Objetos definidos por el usuario

source: The schema supports user-defined objects for handlers, filters and formatters. (Loggers do not need to have different types for different instances, so there is no support in this configuration schema for user-defined logger classes.)
es: El esquema admite objetos definidos por el usuario para gestores, filtros y formateadores. (Los registradores no necesitan tener diferentes tipos para diferentes instancias, por lo que no hay soporte en este esquema de configuración para las clases de registrador definidas por el usuario).

source: Objects to be configured are described by dictionaries which detail their configuration. In some places, the logging system will be able to infer from the context how an object is to be instantiated, but when a user-defined object is to be instantiated, the system will not know how to do this. In order to provide complete flexibility for user-defined object instantiation, the user needs to provide a 'factory' - a callable which is called with a configuration dictionary and which returns the instantiated object. This is signalled by an absolute import path to the factory being made available under the special key ``'()'``. Here's a concrete example:
es: Los objetos a configurar son descritos por diccionarios que detallan su configuración. En algunos lugares, el sistema de registro podrá inferir del contexto cómo se va a instanciar un objeto, pero cuando se va a instanciar un objeto definido por el usuario, el sistema no sabrá cómo hacerlo. Con el fin de proporcionar una flexibilidad completa para la creación de instancias de objetos definidos por el usuario, el usuario debe proporcionar una 'fábrica', una llamada que se llama con un diccionario de configuración y que retorna el objeto instanciado. Esto se indica mediante una ruta de importación absoluta a la fábrica disponible bajo la tecla especial ``'()'``. Aquí hay un ejemplo concreto:

source: The above YAML snippet defines three formatters. The first, with id ``brief``, is a standard :class:`logging.Formatter` instance with the specified format string. The second, with id ``default``, has a longer format and also defines the time format explicitly, and will result in a :class:`logging.Formatter` initialized with those two format strings. Shown in Python source form, the ``brief`` and ``default`` formatters have configuration sub-dictionaries::
es: El fragmento de YAML anterior define tres formateadores. El primero, con identificador ``breve``, es una instancia estándar :class:`logging.Formatter` con la cadena de formato especificada. El segundo, con identificador ``predeterminado``, tiene un formato más largo y también define el formato de hora explícitamente, y dará como resultado :class:`logging.Formatter` inicializado con esas dos cadenas de formato. En forma de fuente Python, los formateadores ``breve`` y ``predeterminado`` tienen sub-diccionarios de configuración::

source: and::
es: y::

source: respectively, and as these dictionaries do not contain the special key ``'()'``, the instantiation is inferred from the context: as a result, standard :class:`logging.Formatter` instances are created. The configuration sub-dictionary for the third formatter, with id ``custom``, is::
es: respectivamente, y como estos diccionarios no contienen la clave especial ``'()'``, la instanciación se infiere del contexto: como resultado, se crean las instancias estándar :class:`logging.Formatter`. El sub-diccionario de configuración para el tercer formateador, con identificador ``custom``, es::

source: and this contains the special key ``'()'``, which means that user-defined instantiation is wanted. In this case, the specified factory callable will be used. If it is an actual callable it will be used directly - otherwise, if you specify a string (as in the example) the actual callable will be located using normal import mechanisms. The callable will be called with the **remaining** items in the configuration sub-dictionary as keyword arguments. In the above example, the formatter with id ``custom`` will be assumed to be returned by the call::
es: y esto contiene la clave especial ``'()'``, lo que significa que se desea la creación de instancias definida por el usuario. En este caso, se utilizará la llamada especificada de fábrica especificada. Si es una llamada real, se usará directamente; de lo contrario, si especifica una cadena (como en el ejemplo), la llamada real se ubicará utilizando mecanismos de importación normales. Se llamará al invocable con los elementos **restantes** en el sub-diccionario de configuración como argumentos de palabras clave. En el ejemplo anterior, se supondrá que el formateador con identificador ``custom`` será retornado por la llamada::

source: The key ``'()'`` has been used as the special key because it is not a valid keyword parameter name, and so will not clash with the names of the keyword arguments used in the call. The ``'()'`` also serves as a mnemonic that the corresponding value is a callable.
es: La clave ``'()'`` se ha utilizado como clave especial porque no es un nombre de parámetro de palabra clave válido, por lo que no entrará en conflicto con los nombres de los argumentos de palabras clave utilizados en la llamada. El ``'()'`` también sirve como mnemónico de que el valor correspondiente es invocable.

source: The ``filters`` member of ``handlers`` and ``loggers`` can take filter instances in addition to ids.
es: Los miembros ``filter`` de ``handlers`` y ``loggers`` pueden tomar instancias de filtro en adición a identificadores.

source: You can also specify a special key ``'.'`` whose value is a dictionary is a mapping of attribute names to values. If found, the specified attributes will be set on the user-defined object before it is returned. Thus, with the following configuration::
es: Puedes especificar también una clave especial ``'.'`` cuyo valor es un diccionario, con un mapeo de los nombres de atributo y sus valores. Si se encuentran, los atributos especificados serán configurados en el objeto definido por el usuario antes de ser retornado. En consecuencia, con la configuración siguiente::

source: the returned formatter will have attribute ``foo`` set to ``'bar'`` and attribute ``baz`` set to ``'bozz'``.
es: el formateador retornado tendrá el atributo ``foo`` establecido en ``'bar'`` y el atributo ``baz`` establecido en ``'bozz'``.

source: Access to external objects
es: Acceso a objetos externos

source: There are times where a configuration needs to refer to objects external to the configuration, for example ``sys.stderr``. If the configuration dict is constructed using Python code, this is straightforward, but a problem arises when the configuration is provided via a text file (e.g. JSON, YAML). In a text file, there is no standard way to distinguish ``sys.stderr`` from the literal string ``'sys.stderr'``. To facilitate this distinction, the configuration system looks for certain special prefixes in string values and treat them specially. For example, if the literal string ``'ext://sys.stderr'`` is provided as a value in the configuration, then the ``ext://`` will be stripped off and the remainder of the value processed using normal import mechanisms.
es: Hay momentos en que una configuración debe referirse a objetos externos a la configuración, por ejemplo, ``sys.stderr``. Si el diccionario de configuración se construye utilizando el código Python, esto es sencillo, pero surge un problema cuando la configuración se proporciona a través de un archivo de texto (por ejemplo, JSON, YAML). En un archivo de texto, no hay una forma estándar de distinguir ``sys.stderr`` de la cadena literal ``'sys.stderr'``. Para facilitar esta distinción, el sistema de configuración busca ciertos prefijos especiales en valores de cadena y los trata especialmente. Por ejemplo, si la cadena literal ``'ext://sys.stderr'`` se proporciona como un valor en la configuración, entonces la ``ext://`` se eliminará y se procesará el resto del valor utilizando mecanismos normales de importación.

source: The handling of such prefixes is done in a way analogous to protocol handling: there is a generic mechanism to look for prefixes which match the regular expression ``^(?P<prefix>[a-z]+)://(?P<suffix>.*)$`` whereby, if the ``prefix`` is recognised, the ``suffix`` is processed in a prefix-dependent manner and the result of the processing replaces the string value. If the prefix is not recognised, then the string value will be left as-is.
es: El manejo de dichos prefijos se realiza de manera análoga al manejo del protocolo: existe un mecanismo genérico para buscar prefijos que coincidan con la expresión regular ``^(?P<prefix>[a-z]+)://(?P<suffix>.*)$`` por el cual, si se reconoce el ``prefix``, el ``suffix`` se procesa de manera dependiente del prefijo y el resultado del procesamiento reemplaza el valor de la cadena. Si no se reconoce el prefijo, el valor de la cadena se dejará tal cual.

source: Access to internal objects
es: Acceso a objetos internos

source: As well as external objects, there is sometimes also a need to refer to objects in the configuration. This will be done implicitly by the configuration system for things that it knows about. For example, the string value ``'DEBUG'`` for a ``level`` in a logger or handler will automatically be converted to the value ``logging.DEBUG``, and the ``handlers``, ``filters`` and ``formatter`` entries will take an object id and resolve to the appropriate destination object.
es: Además de los objetos externos, a veces también es necesario hacer referencia a los objetos en la configuración. El sistema de configuración hará esto implícitamente para las cosas que conoce. Por ejemplo, el valor de cadena ``'DEBUG'`` para un ``level`` en un registrador o gestor se convertirá automáticamente al valor ``logging.DEBUG``, y las entradas ``handlers``, ``filters`` y ``formatter`` tomarán una identificación de objeto y se resuelven en el objeto de destino apropiado.

source: However, a more generic mechanism is needed for user-defined objects which are not known to the :mod:`logging` module. For example, consider :class:`logging.handlers.MemoryHandler`, which takes a ``target`` argument which is another handler to delegate to. Since the system already knows about this class, then in the configuration, the given ``target`` just needs to be the object id of the relevant target handler, and the system will resolve to the handler from the id. If, however, a user defines a ``my.package.MyHandler`` which has an ``alternate`` handler, the configuration system would not know that the ``alternate`` referred to a handler. To cater for this, a generic resolution system allows the user to specify:
es: Sin embargo, se necesita un mecanismo más genérico para los objetos definidos por el usuario que no conoce el módulo :mod:`logging`. Por ejemplo, considere :class:`logging.handlers.MemoryHandler`, que toma un argumento ``target`` que es otro gestor para delegar. Dado que el sistema ya conoce esta clase, entonces en la configuración, el ``target`` dado solo necesita ser la identificación del objeto del gestor de destino relevante, y el sistema resolverá el gestor desde la identificación. Sin embargo, si un usuario define un ``my.package.MyHandler`` que tiene un gestor ``alternate``, el sistema de configuración no sabría que el ``alternate`` se refería a un gestor. Para atender esto, un sistema de resolución genérico permite al usuario especificar:

source: The literal string ``'cfg://handlers.file'`` will be resolved in an analogous way to strings with the ``ext://`` prefix, but looking in the configuration itself rather than the import namespace. The mechanism allows access by dot or by index, in a similar way to that provided by ``str.format``. Thus, given the following snippet:
es: La cadena literal ``'cfg://handlers.file'`` se resolverá de manera análoga a las cadenas con el prefijo ``ext://``, pero buscando en la configuración misma en lugar del espacio de nombres de importación. El mecanismo permite el acceso por punto o por índice, de manera similar a la proporcionada por ``str.format``. Por lo tanto, dado el siguiente fragmento:

source: in the configuration, the string ``'cfg://handlers'`` would resolve to the dict with key ``handlers``, the string ``'cfg://handlers.email`` would resolve to the dict with key ``email`` in the ``handlers`` dict, and so on. The string ``'cfg://handlers.email.toaddrs[1]`` would resolve to ``'dev_team@domain.tld'`` and the string ``'cfg://handlers.email.toaddrs[0]'`` would resolve to the value ``'support_team@domain.tld'``. The ``subject`` value could be accessed using either ``'cfg://handlers.email.subject'`` or, equivalently, ``'cfg://handlers.email[subject]'``. The latter form only needs to be used if the key contains spaces or non-alphanumeric characters. If an index value consists only of decimal digits, access will be attempted using the corresponding integer value, falling back to the string value if needed.
es: en la configuración, la cadena ``'cfg://handlers'`` resolvería al diccionario con clave ``handlers``, la cadena ``'cfg://handlers.email`` resolvería al diccionario con clave ``email`` en el diccionario ``handlers``, y así sucesivamente. La cadena ``'cfg: //handlers.email.toaddrs [1]`` resolvería a ``'dev_team.domain.tld'`` y la cadena ``'cfg://handlers.email.toaddrs[0]`` resolvería el valor ``'support_team@domain.tld'``. Se puede acceder al valor de ``subject`` usando ``'cfg://handlers.email.subject'`` o, de manera equivalente, ``'cfg://handlers.email[subject]'``. La última forma solo debe usarse si la clave contiene espacios o caracteres no alfanuméricos. Si un valor de índice consta solo de dígitos decimales, se intentará acceder utilizando el valor entero correspondiente, volviendo al valor de cadena si es necesario.

source: Given a string ``cfg://handlers.myhandler.mykey.123``, this will resolve to ``config_dict['handlers']['myhandler']['mykey']['123']``. If the string is specified as ``cfg://handlers.myhandler.mykey[123]``, the system will attempt to retrieve the value from ``config_dict['handlers']['myhandler']['mykey'][123]``, and fall back to ``config_dict['handlers']['myhandler']['mykey']['123']`` if that fails.
es: Dada una cadena ``cfg://handlers.myhandler.mykey.123``, esto se resolverá en ``config_dict['handlers']['myhandler']['mykey']['123']``. Si la cadena se especifica como ``cfg: //handlers.myhandler.mykey[123]``, el sistema intentará recuperar el valor de ``config_dict['handlers']['myhandler']['mykey'][123]``, y vuelva a ``config_dict['handlers']['myhandler']['mykey']['123']`` si eso falla.

source: Import resolution and custom importers
es: Resolución de importación e importadores personalizados
