Repository: python/python-docs-es
Catalog: library/logging.config.po
Languages: es

source: :mod:`logging.config` --- Logging configuration
es: :mod:`logging.config` --- Configuración de registro

source: **Source code:** :source:`Lib/logging/config.py`
es: **Código fuente:** :source:`Lib/logging/config.py`

source: This page contains only reference information. For tutorials, please see
es: Esta página solo contiene información de referencia. Para tutoriales, por favor consulte

source: :ref:`Basic Tutorial <logging-basic-tutorial>`
es: :ref:`Tutorial Básico <logging-basic-tutorial>`

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
es: :ref:`Tutorial Avanzado <logging-advanced-tutorial>`

source: :ref:`Logging Cookbook <logging-cookbook>`
es: :ref:`Guía de registro *Logging* <logging-cookbook>`

source: This section describes the API for configuring the logging module.
es: Esta sección describe la API para configurar el módulo de registro.

source: Configuration functions
es: Funciones de configuración

source: The following functions configure the logging module. They are located in the :mod:`logging.config` module. Their use is optional --- you can configure the logging module using these functions or by making calls to the main API (defined in :mod:`logging` itself) and defining handlers which are declared either in :mod:`logging` or :mod:`logging.handlers`.
es: Las siguientes funciones configuran el módulo de registro. Se encuentran en el módulo :mod:`logging.config`. Su uso es opcional --- puede configurar el módulo de registro utilizando estas funciones o realizando llamadas a la API principal (definida en :mod:`logging`) y definiendo los gestores que se declaran en :mod:`logging` o :mod:`logging.handlers`.

source: Takes the logging configuration from a dictionary. The contents of this dictionary are described in :ref:`logging-config-dictschema` below.
es: Toma la configuración de registro de un diccionario. Los contenidos de este diccionario se describen en :ref:`logging-config-dictschema` a continuación.

source: If an error is encountered during configuration, this function will raise a :exc:`ValueError`, :exc:`TypeError`, :exc:`AttributeError` or :exc:`ImportError` with a suitably descriptive message. The following is a (possibly incomplete) list of conditions which will raise an error:
es: Si se encuentra un error durante la configuración, esta función lanzará un :exc:`ValueError`, :exc:`TypeError`, :exc:`AttributeError` o :exc:`ImportError` con un mensaje descriptivo adecuado. La siguiente es una lista (posiblemente incompleta) de condiciones que lanzarán un error:

source: A ``level`` which is not a string or which is a string not corresponding to an actual logging level.
es: Un ``level`` que no es una cadena o que es una cadena que no corresponde a un nivel de registro real.

source: A ``propagate`` value which is not a boolean.
es: Un valor de ``propagate`` que no es booleano.

source: An id which does not have a corresponding destination.
es: Una identificación que no tiene un destino correspondiente.

source: A non-existent handler id found during an incremental call.
es: Una identificación de gestor inexistente encontrada durante una llamada incremental.

source: An invalid logger name.
es: Un nombre de registrador no válido.

source: Inability to resolve to an internal or external object.
es: Incapacidad para resolver un objeto interno o externo.

source: Parsing is performed by the :class:`DictConfigurator` class, whose constructor is passed the dictionary used for configuration, and has a :meth:`configure` method. The :mod:`logging.config` module has a callable attribute :attr:`dictConfigClass` which is initially set to :class:`DictConfigurator`. You can replace the value of :attr:`dictConfigClass` with a suitable implementation of your own.
es: El análisis se realiza mediante la clase :class:`DictConfigurator`, a cuyo constructor se le pasa el diccionario utilizado para la configuración, y tiene un método :meth:`configure`. El módulo :mod:`logging.config` tiene un atributo invocable :attr:`dictConfigClass` que se establece inicialmente en :class:`DictConfigurator`. Puede reemplazar el valor de :attr:`dictConfigClass` con una implementación adecuada propia.

source: :func:`dictConfig` calls :attr:`dictConfigClass` passing the specified dictionary, and then calls the :meth:`configure` method on the returned object to put the configuration into effect::
es: :func:`dictConfig` llama :attr:`dictConfigClass` pasando el diccionario especificado, y luego llama al método :meth:`configure` en el objeto retornado para que la configuración surta efecto::

source: For example, a subclass of :class:`DictConfigurator` could call ``DictConfigurator.__init__()`` in its own :meth:`__init__()`, then set up custom prefixes which would be usable in the subsequent :meth:`configure` call. :attr:`dictConfigClass` would be bound to this new subclass, and then :func:`dictConfig` could be called exactly as in the default, uncustomized state.
es: Por ejemplo, una subclase de :class:`DictConfigurator` podría llamar a ``DictConfigurator.__ init__()`` en su mismo :meth:`__init__()`, luego configurar prefijos personalizados que serían utilizables en la siguiente llamada :meth:`configure`. :attr:`dictConfigClass` estaría vinculado a esta nueva subclase, y luego :func:`dictConfig` podría llamarse exactamente como en el estado predeterminado, no personalizado.

source: Reads the logging configuration from a :mod:`configparser`\-format file. The format of the file should be as described in :ref:`logging-config-fileformat`. This function can be called several times from an application, allowing an end user to select from various pre-canned configurations (if the developer provides a mechanism to present the choices and load the chosen configuration).
es: Lee la configuración de registro desde un archivo de formato de :mod:`configparser`. El formato del archivo debe ser como se describe en :ref:`logging-config-fileformat`. Esta función se puede invocar varias veces desde una aplicación, lo que permite al usuario final seleccionar entre varias configuraciones predeterminadas (si el desarrollador proporciona un mecanismo para presentar las opciones y cargar la configuración elegida).

source: Parameters
es: Parámetros

source: A filename, or a file-like object, or an instance derived from :class:`~configparser.RawConfigParser`. If a ``RawConfigParser``-derived instance is passed, it is used as is. Otherwise, a :class:`~configparser.Configparser` is instantiated, and the configuration read by it from the object passed in ``fname``. If that has a :meth:`readline` method, it is assumed to be a file-like object and read using :meth:`~configparser.ConfigParser.read_file`; otherwise, it is assumed to be a filename and passed to :meth:`~configparser.ConfigParser.read`.
es: Un nombre de archivo, o un objeto similar a un archivo, o una instancia derivada de :class:`~configparser.RawConfigParser`. Si se pasa una instancia derivada de ``RawConfigParser``, se usa tal cual. De lo contrario, se instancia :class:`~configparser.Configparser`, y la configuración leída desde el objeto pasado en ``fname``. Si eso tiene un método :meth:`readline`, se supone que es un objeto similar a un archivo y se lee usando :meth:`~configparser.ConfigParser.read_file`; de lo contrario, se supone que es un nombre de archivo y se pasa a :meth:`~configparser.ConfigParser.read`.

source: Defaults to be passed to the ConfigParser can be specified in this argument.
es: Los valores predeterminados para pasar al ConfigParser se pueden especificar en este argumento.

source: The encoding used to open file when *fname* is filename.
es: La codificación que se usa para abrir archivos cuando *fname* es nombre del archivo.

source: An instance of a subclass of :class:`~configparser.RawConfigParser` is now accepted as a value for ``fname``. This facilitates:
es: Una instancia de una subclase de :class:`~configparser.RawConfigParser` ahora se acepta como un valor para ``fname``. Esto facilita:

source: Use of a configuration file where logging configuration is just part of the overall application configuration.
es: Uso de un archivo de configuración donde la configuración de registro es solo parte de la configuración general de la aplicación.

source: Use of a configuration read from a file, and then modified by the using application (e.g. based on command-line parameters or other aspects of the runtime environment) before being passed to ``fileConfig``.
es: Uso de una configuración leída de un archivo, y luego modificada por la aplicación que lo usa (por ejemplo, basada en parámetros de línea de comandos u otros aspectos del entorno de ejecución) antes de pasar a ``fileConfig``.

source: The *encoding* parameter is added.
es: El parámetro *codificación* se añade.

source: Starts up a socket server on the specified port, and listens for new configurations. If no port is specified, the module's default :const:`DEFAULT_LOGGING_CONFIG_PORT` is used. Logging configurations will be sent as a file suitable for processing by :func:`dictConfig` or :func:`fileConfig`. Returns a :class:`~threading.Thread` instance on which you can call :meth:`~threading.Thread.start` to start the server, and which you can :meth:`~threading.Thread.join` when appropriate. To stop the server, call :func:`stopListening`.
es: Inicia un servidor de socket en el puerto especificado y escucha nuevas configuraciones. Si no se especifica ningún puerto, se usa el valor predeterminado del módulo :const:`DEFAULT_LOGGING_CONFIG_PORT`. Las configuraciones de registro se enviarán como un archivo adecuado para su procesamiento por :func:`dictConfig` o :func:`fileConfig`. Retorna una instancia de :class:`~threading.Thread` en la que puede llamar :meth:`~threading.Thread.start` para iniciar el servidor, y que puede :meth:`~threading.Thread.join` cuando corresponda . Para detener el servidor, llame a :func:`stopListening`.

source: The ``verify`` argument, if specified, should be a callable which should verify whether bytes received across the socket are valid and should be processed. This could be done by encrypting and/or signing what is sent across the socket, such that the ``verify`` callable can perform signature verification and/or decryption. The ``verify`` callable is called with a single argument - the bytes received across the socket - and should return the bytes to be processed, or ``None`` to indicate that the bytes should be discarded. The returned bytes could be the same as the passed in bytes (e.g. when only verification is done), or they could be completely different (perhaps if decryption were performed).
es: El argumento ``verify``, si se especifica, debe ser invocable, lo que debería verificar si los bytes recibidos en el socket son válidos y deben procesarse. Esto podría hacerse encriptando y / o firmando lo que se envía a través del socket, de modo que el ``verify`` invocable pueda realizar la verificación o descifrado de la firma. El llamado invocable ``verify`` se llama con un solo argumento (los bytes recibidos a través del socket) y debe retornar los bytes a procesar, o ``None`` para indicar que los bytes deben descartarse. Los bytes retornados podrían ser los mismos que los pasados en bytes (por ejemplo, cuando solo se realiza la verificación), o podrían ser completamente diferentes (tal vez si se realizó el descifrado).

source: To send a configuration to the socket, read in the configuration file and send it to the socket as a sequence of bytes preceded by a four-byte length string packed in binary using ``struct.pack('>L', n)``.
es: Para enviar una configuración al socket, lea el archivo de configuración y envíelo al socket como una secuencia de bytes precedida por una cadena de longitud de cuatro bytes empaquetada en binario usando ``struct.pack('>L', n)``.

source: Because portions of the configuration are passed through :func:`eval`, use of this function may open its users to a security risk. While the function only binds to a socket on ``localhost``, and so does not accept connections from remote machines, there are scenarios where untrusted code could be run under the account of the process which calls :func:`listen`. Specifically, if the process calling :func:`listen` runs on a multi-user machine where users cannot trust each other, then a malicious user could arrange to run essentially arbitrary code in a victim user's process, simply by connecting to the victim's :func:`listen` socket and sending a configuration which runs whatever code the attacker wants to have executed in the victim's process. This is especially easy to do if the default port is used, but not hard even if a different port is used. To avoid the risk of this happening, use the ``verify`` argument to :func:`listen` to prevent unrecognised configurations from being applied.
es: Debido a que partes de la configuración se pasan a través de :func:`eval`, el uso de esta función puede abrir a sus usuarios a un riesgo de seguridad. Si bien la función solo se une a un socket en ``localhost`` y, por lo tanto, no acepta conexiones de máquinas remotas, hay escenarios en los que se puede ejecutar código no confiable bajo la cuenta del proceso que llama :func:`listen`. Específicamente, si el proceso que llama :func:`listen` se ejecuta en una máquina multiusuario donde los usuarios no pueden confiar el uno en el otro, entonces un usuario malintencionado podría hacer arreglos para ejecutar código esencialmente arbitrario en el proceso del usuario víctima, simplemente conectándose al socket :func:`listen` de la víctima y enviando una configuración que ejecuta cualquier código que el atacante quiera ejecutar en el proceso de la víctima. Esto es especialmente fácil de hacer si se usa el puerto predeterminado, pero no es difícil incluso si se usa un puerto diferente. Para evitar el riesgo de que esto suceda, use el argumento ``verify`` para :func:`listen` para escuchar y evitar que se apliquen configuraciones no reconocidas.

source: The ``verify`` argument was added.
es: Se agregó el argumento ``verify``.

source: If you want to send configurations to the listener which don't disable existing loggers, you will need to use a JSON format for the configuration, which will use :func:`dictConfig` for configuration. This method allows you to specify ``disable_existing_loggers`` as ``False`` in the configuration you send.
es: Si desea enviar configuraciones al oyente que no deshabiliten los registradores existentes, deberá usar un formato JSON para la configuración, que utilizará :func:`dictConfig` para la configuración. Este método le permite especificar ``disable_existing_loggers`` como ``False`` en la configuración que envía.

source: Stops the listening server which was created with a call to :func:`listen`. This is typically called before calling :meth:`join` on the return value from :func:`listen`.
es: Detiene el servidor de escucha que se creó con una llamada a :func:`listen`. Esto normalmente se llama antes de llamar :meth:`join` en el valor de retorno de :func:`listen`.

source: Security considerations
es: Consideraciones de seguridad

source: Configuration dictionary schema
es: Esquema del diccionario de configuración

source: Describing a logging configuration requires listing the various objects to create and the connections between them; for example, you may create a handler named 'console' and then say that the logger named 'startup' will send its messages to the 'console' handler. These objects aren't limited to those provided by the :mod:`logging` module because you might write your own formatter or handler class. The parameters to these classes may also need to include external objects such as ``sys.stderr``. The syntax for describing these objects and connections is defined in :ref:`logging-config-dict-connections` below.
es: La descripción de una configuración de registro requiere una lista de los diversos objetos para crear y las conexiones entre ellos; por ejemplo, puede crear un gestor llamado 'consola' y luego decir que el registrador llamado 'inicio' enviará sus mensajes al gestor 'consola'. Estos objetos no se limitan a los proporcionados por el módulo :mod:`logging` porque podría escribir su propia clase de formateador o gestor. Los parámetros de estas clases también pueden necesitar incluir objetos externos como ``sys.stderr``. La sintaxis para describir estos objetos y conexiones se define en :ref:`logging-config-dict-connections` a continuación.

source: Dictionary Schema Details
es: Detalles del esquema del diccionario

source: The dictionary passed to :func:`dictConfig` must contain the following keys:
es: El diccionario pasado a :func:`dictConfig` debe contener las siguientes claves:

source: *version* - to be set to an integer value representing the schema version. The only valid value at present is 1, but having this key allows the schema to evolve while still preserving backwards compatibility.
es: *version* - se establece en un valor entero que representa la versión del esquema. El único valor válido en este momento es 1, pero tener esta clave permite que el esquema evolucione sin perder la compatibilidad con versiones anteriores.

source: All other keys are optional, but if present they will be interpreted as described below. In all cases below where a 'configuring dict' is mentioned, it will be checked for the special ``'()'`` key to see if a custom instantiation is required. If so, the mechanism described in :ref:`logging-config-dict-userdef` below is used to create an instance; otherwise, the context is used to determine what to instantiate.
es: Todas las demás claves son opcionales, pero si están presentes se interpretarán como se describe a continuación. En todos los casos a continuación, donde se menciona un 'dict de configuración', se verificará la clave especial ``'()'`` para ver si se requiere una instanciación personalizada. Si es así, el mecanismo descrito en :ref:`logging-config-dict-userdef` a continuación se usa para crear una instancia; de lo contrario, el contexto se usa para determinar qué instanciar.

source: *formatters* - the corresponding value will be a dict in which each key is a formatter id and each value is a dict describing how to configure the corresponding :class:`~logging.Formatter` instance.
es: *formatters* - el valor correspondiente será un diccionario en el que cada clave es una identificación de formateador y cada valor es un diccionario que describe cómo configurar la instancia correspondiente :class:`~logging.Formatter`.

source: The configuring dict is searched for the following optional keys which correspond to the arguments passed to create a :class:`~logging.Formatter` object:
es: Se busca el diccionario de configuración por las siguientes claves opcionales que corresponden a los argumentos pasados para crear un objeto :class:`~logging.Formatter`:

source: ``validate`` (since version >=3.8)
es: ``validate`` (desde la versión >=3.8)

source: An optional ``class`` key indicates the name of the formatter's class (as a dotted module and class name). The instantiation arguments are as for :class:`~logging.Formatter`, thus this key is most useful for instantiating a customised subclass of :class:`~logging.Formatter`. For example, the alternative class might present exception tracebacks in an expanded or condensed format. If your formatter requires different or extra configuration keys, you should use :ref:`logging-config-dict-userdef`.
es: Una clave opcional ``class`` indica el nombre de la de clase del formateador (como un módulo punteado y nombre de clase). Por su parte los argumentos de instanciación son :class:`~logging.Formatter`, de este modo esta clave es más útil para instanciar una subclase personalizada de :class:`~logging.Formatter`. Por ejemplo, la clase alternativa presentaría excepciones rastreadas en un formato amplio o resumido. Si tu formateador necesita claves de configuración diferentes o extra debes usar :ref:`logging-config-dict-userdef`.

source: *filters* - the corresponding value will be a dict in which each key is a filter id and each value is a dict describing how to configure the corresponding Filter instance.
es: *filters* - el valor correspondiente será un diccionario en el que cada clave es una identificación de filtro y cada valor es un diccionario que describe cómo configurar la instancia de filtro correspondiente.

source: The configuring dict is searched for the key ``name`` (defaulting to the empty string) and this is used to construct a :class:`logging.Filter` instance.
es: El diccionario de configuración busca la clave ``name`` (por defecto en la cadena vacía) y esto se utiliza para construir una instancia de :class:`logging.Filter`.

source: *handlers* - the corresponding value will be a dict in which each key is a handler id and each value is a dict describing how to configure the corresponding Handler instance.
es: *handlers* - el valor correspondiente será un diccionario en el que cada clave es una identificación de gestor y cada valor es un diccionario que describe cómo configurar la instancia del gestor correspondiente.

source: The configuring dict is searched for the following keys:
es: El diccionario de configuración busca las siguientes claves:

source: ``class`` (mandatory). This is the fully qualified name of the handler class.
es: ``clase`` (obligatorio). Este es el nombre completo de la clase de gestor.

source: ``level`` (optional). The level of the handler.
es: ``level`` (opcional). El nivel del gestor.

source: ``formatter`` (optional). The id of the formatter for this handler.
es: ``formatter`` (opcional). La identificación del formateador para este gestor.

source: ``filters`` (optional). A list of ids of the filters for this handler.
es: ``filters`` (opcional). Una lista de identificadores de los filtros para este gestor.

source: All *other* keys are passed through as keyword arguments to the handler's constructor. For example, given the snippet:
es: Todas las claves *other* se pasan como argumentos de palabras clave al constructor del gestor. Por ejemplo, dado el fragmento:

source: the handler with id ``console`` is instantiated as a :class:`logging.StreamHandler`, using ``sys.stdout`` as the underlying stream. The handler with id ``file`` is instantiated as a :class:`logging.handlers.RotatingFileHandler` with the keyword arguments ``filename='logconfig.log', maxBytes=1024, backupCount=3``.
es: el gestor con id ``console`` se instancia como :class:`logging.StreamHandler`, usando ``sys.stdout`` como la secuencia subyacente. El gestor con la identificación ``file`` se instancia como :class:`logging.handlers.RotatingFileHandler` con los argumentos de la palabra clave ``filename='logconfig.log', maxBytes=1024, backupCount=3``.

source: *loggers* - the corresponding value will be a dict in which each key is a logger name and each value is a dict describing how to configure the corresponding Logger instance.
es: *loggers* - el valor correspondiente será un diccionario en el que cada clave es un nombre de *logger* y cada valor es un diccionario que describe cómo configurar la instancia de *Logger* correspondiente.

source: ``level`` (optional). The level of the logger.
es: ``level`` (opcional). El nivel del registrador.

source: ``propagate`` (optional). The propagation setting of the logger.
es: ``propagate`` (opcional). La configuración de propagación del registrador.

source: ``filters`` (optional). A list of ids of the filters for this logger.
es: ``filters`` (opcional). Una lista de identificadores de los filtros para este registrador.

source: ``handlers`` (optional). A list of ids of the handlers for this logger.
es: ``handlers`` (opcional). Una lista de identificadores de los gestores para este registrador.
