Repository: python/python-docs-es
Catalog: library/logging.config.po
Languages: es

source: Import resolution, by default, uses the builtin :func:`__import__` function to do its importing. You may want to replace this with your own importing mechanism: if so, you can replace the :attr:`importer` attribute of the :class:`DictConfigurator` or its superclass, the :class:`BaseConfigurator` class. However, you need to be careful because of the way functions are accessed from classes via descriptors. If you are using a Python callable to do your imports, and you want to define it at class level rather than instance level, you need to wrap it with :func:`staticmethod`. For example::
es: La resolución de importación, por defecto, utiliza la función incorporada :func:`__import__` para importar. Es posible que desee reemplazar esto con su propio mecanismo de importación: si es así, puede reemplazar el atributo :attr:`importer` de :class:`DictConfigurator` o su superclase, la clase :class:`BaseConfigurator`. Sin embargo, debe tener cuidado debido a la forma en que se accede a las funciones desde las clases a través de descriptores. Si está utilizando un Python invocable para realizar sus importaciones, y lo desea definir a nivel de clase en lugar de a nivel de instancia, debe envolverlo con :func:`staticmethod`. Por ejemplo::

source: You don't need to wrap with :func:`staticmethod` if you're setting the import callable on a configurator *instance*.
es: No necesita envolver con :func:`staticmethod` si está configurando la importación invocable en un configurador *instance*.

source: Configuration file format
es: Formato de archivo de configuración

source: The configuration file format understood by :func:`fileConfig` is based on :mod:`configparser` functionality. The file must contain sections called ``[loggers]``, ``[handlers]`` and ``[formatters]`` which identify by name the entities of each type which are defined in the file. For each such entity, there is a separate section which identifies how that entity is configured. Thus, for a logger named ``log01`` in the ``[loggers]`` section, the relevant configuration details are held in a section ``[logger_log01]``. Similarly, a handler called ``hand01`` in the ``[handlers]`` section will have its configuration held in a section called ``[handler_hand01]``, while a formatter called ``form01`` in the ``[formatters]`` section will have its configuration specified in a section called ``[formatter_form01]``. The root logger configuration must be specified in a section called ``[logger_root]``.
es: El formato del archivo de configuración que entiende :func:`fileConfig` se basa en la funcionalidad :mod:`configparser`. El archivo debe contener secciones llamadas ``[loggers]``, ``[handlers]`` y ``[formatters]`` que identifican por nombre las entidades de cada tipo que se definen en el archivo. Para cada una de esas entidades, hay una sección separada que identifica cómo se configura esa entidad. Por lo tanto, para un registrador llamado ``log01`` en la sección ``[loggers]``, los detalles de configuración relevantes se encuentran en una sección ``[logger_log01]``. Del mismo modo, un gestor llamado ``hand01`` en la sección ``[handlers]`` tendrá su configuración en una sección llamada ``[handler_hand01]``, mientras que un formateador llamado ``form01`` en el ``[formatters]`` sección tendrá su configuración especificada en una sección llamada ``[formatter_form01]``. La configuración del registrador raíz debe especificarse en una sección llamada ``[logger_root]``.

source: The :func:`fileConfig` API is older than the :func:`dictConfig` API and does not provide functionality to cover certain aspects of logging. For example, you cannot configure :class:`~logging.Filter` objects, which provide for filtering of messages beyond simple integer levels, using :func:`fileConfig`. If you need to have instances of :class:`~logging.Filter` in your logging configuration, you will need to use :func:`dictConfig`. Note that future enhancements to configuration functionality will be added to :func:`dictConfig`, so it's worth considering transitioning to this newer API when it's convenient to do so.
es: La API :func:`fileConfig` es más antigua que la API :func:`dictConfig` y no proporciona funcionalidad para cubrir ciertos aspectos del registro. Por ejemplo, no puede configurar objetos :class:`~logging.Filter`, que permiten el filtrado de mensajes más allá de niveles enteros simples, usando :func:`fileConfig`. Si necesita tener instancias de :class:`~logging.Filter` en su configuración de registro, deberá usar :func:`dictConfig`. Tenga en cuenta que las mejoras futuras a la funcionalidad de configuración se agregarán a :func:`dictConfig`, por lo que vale la pena considerar la transición a esta API más nueva cuando sea conveniente hacerlo.

source: Examples of these sections in the file are given below.
es: A continuación se dan ejemplos de estas secciones en el archivo.

source: The root logger must specify a level and a list of handlers. An example of a root logger section is given below.
es: El registrador raíz debe especificar un nivel y una lista de gestores. A continuación se muestra un ejemplo de una sección de registrador raíz.

source: The ``level`` entry can be one of ``DEBUG, INFO, WARNING, ERROR, CRITICAL`` or ``NOTSET``. For the root logger only, ``NOTSET`` means that all messages will be logged. Level values are :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace.
es: La entrada ``level`` puede ser una de ``DEBUG, INFO, WARNING, ERROR, CRITICAL`` o ``NOTSET``. Solo para el registrador raíz, ``NOTSET`` significa que todos los mensajes se registrarán. Los valores de nivel son :func:`evaluados <func-eval>` en el contexto del espacio de nombres del paquete ``logging``.

source: The ``handlers`` entry is a comma-separated list of handler names, which must appear in the ``[handlers]`` section. These names must appear in the ``[handlers]`` section and have corresponding sections in the configuration file.
es: La entrada ``handlers`` es una lista separada por comas de nombres de gestores, que debe aparecer en la sección ``[handlers]``. Estos nombres deben aparecer en la sección ``[handlers]`` y tener las secciones correspondientes en el archivo de configuración.

source: For loggers other than the root logger, some additional information is required. This is illustrated by the following example.
es: Para los registradores que no sean el registrador raíz, se requiere información adicional. Esto se ilustra en el siguiente ejemplo.

source: The ``level`` and ``handlers`` entries are interpreted as for the root logger, except that if a non-root logger's level is specified as ``NOTSET``, the system consults loggers higher up the hierarchy to determine the effective level of the logger. The ``propagate`` entry is set to 1 to indicate that messages must propagate to handlers higher up the logger hierarchy from this logger, or 0 to indicate that messages are **not** propagated to handlers up the hierarchy. The ``qualname`` entry is the hierarchical channel name of the logger, that is to say the name used by the application to get the logger.
es: Las entradas ``level`` y ``handlers`` se interpretan como para el registrador raíz, excepto que si el nivel de un registrador que no sea raíz se especifica como ``NOTSET``, el sistema consulta a los registradores más arriba en la jerarquía para determinar el nivel efectivo del registrador. La entrada ``propagate`` se establece en 1 para indicar que los mensajes deben propagarse a los gestores que están más arriba en la jerarquía del registrador, o 0 para indicar que los mensajes **no** se propagan a los gestores en la jerarquía superior. La entrada ``qualname`` es el nombre jerárquico del canal del registrador, es decir, el nombre utilizado por la aplicación para obtener el registrador.

source: Sections which specify handler configuration are exemplified by the following.
es: Las secciones que especifican la configuración del gestor se ejemplifican a continuación.

source: The ``class`` entry indicates the handler's class (as determined by :func:`eval` in the ``logging`` package's namespace). The ``level`` is interpreted as for loggers, and ``NOTSET`` is taken to mean 'log everything'.
es: La entrada ``class`` indica la clase del gestor (según lo determinado por :func:`eval` en el espacio de nombres del paquete ``logging``). El ``level`` se interpreta como para los registradores, y ``NOTSET`` se entiende como 'registrar todo'.

source: The ``formatter`` entry indicates the key name of the formatter for this handler. If blank, a default formatter (``logging._defaultFormatter``) is used. If a name is specified, it must appear in the ``[formatters]`` section and have a corresponding section in the configuration file.
es: La entrada ``formatter`` indica el nombre clave del formateador para este gestor. Si está en blanco, se utiliza un formateador predeterminado (``logging._defaultFormatter``). Si se especifica un nombre, debe aparecer en la sección ``[formatters]`` y tener una sección correspondiente en el archivo de configuración.

source: The ``args`` entry, when :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace, is the list of arguments to the constructor for the handler class. Refer to the constructors for the relevant handlers, or to the examples below, to see how typical entries are constructed. If not provided, it defaults to ``()``.
es: La entrada ``args``, cuando es :func:`evaluada <func-eval>` en el contexto del espacio de nombres del paquete ``logging``, es la lista de argumentos para el constructor de la clase gestor. Consulte los constructores de los gestores relevantes, o los ejemplos a continuación, para ver cómo se construyen las entradas típicas. Si no se proporciona, el valor predeterminado es ``()``.

source: The optional ``kwargs`` entry, when :ref:`evaluated <func-eval>` in the context of the ``logging`` package's namespace, is the keyword argument dict to the constructor for the handler class. If not provided, it defaults to ``{}``.
es: La entrada opcional ``kwargs``, cuando es :func:`evaluada <func-eval>` en el contexto del espacio de nombres del paquete ``logging``, es el diccionario generado a partir de los argumentos de palabra clave para el constructor de la clase gestor. Si no se proporciona, el valor predeterminado es ``{}``.

source: Sections which specify formatter configuration are typified by the following.
es: Las secciones que especifican la configuración del formateador se caracterizan por lo siguiente.

source: The arguments for the formatter configuration are the same as the keys in the dictionary schema :ref:`formatters section <logging-config-dictschema-formatters>`.
es: Los argumentos para la configuración del formateador son los mismos que las claves en el esquema del diccionario :ref:`formatters section <logging-config-dictschema-formatters>`.

source: Due to the use of :func:`eval` as described above, there are potential security risks which result from using the :func:`listen` to send and receive configurations via sockets. The risks are limited to where multiple users with no mutual trust run code on the same machine; see the :func:`listen` documentation for more information.
es: Debido al uso de :func:`eval` como se describió anteriormente, existen riesgos potenciales de seguridad que resultan del uso de :func:`listen` para enviar y recibir configuraciones a través de sockets. Los riesgos se limitan a donde múltiples usuarios sin confianza mutua ejecutan código en la misma máquina; consulte la documentación de :func:`listen` para obtener más información.

source: Module :mod:`logging`
es: Módulo :mod:`logging`

source: API reference for the logging module.
es: Referencia de API para el módulo de registro.

source: Module :mod:`logging.handlers`
es: Módulo :mod:`logging.handlers`

source: Useful handlers included with the logging module.
es: Gestores útiles incluidos con el módulo de registro.
