Repository: python/python-docs-es
Catalog: library/mailbox.po
Languages: es

source: Return a list of the names of sequences that include this message.
es: Retorna una lista de los nombres de las secuencias que incluyen este mensaje.

source: Set the list of sequences that include this message.
es: Establece la lista de secuencias que incluyen este mensaje.

source: Add *sequence* to the list of sequences that include this message.
es: Añade *sequence* a la lista de secuencias que incluyen este mensaje.

source: Remove *sequence* from the list of sequences that include this message.
es: Elimina *sequence* de la lista de secuencias que incluyen este mensaje.

source: When an :class:`MHMessage` instance is created based upon a :class:`MaildirMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`MHMessage` basada en una instancia :class:`MaildirMessage`, se producen las siguientes conversiones:

source: no S flag
es: no hay indicador S

source: When an :class:`MHMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
es: Cuando se crea una instancia :class:`MHMessage` basada en una instancia :class:`mboxMessage` o :class:`MMDFMessage`, se omiten las cabeceras :mailheader:`Status` y :mailheader:`X-Status` y se producen las siguientes conversiones:

source: no R flag
es: sin indicador R

source: When an :class:`MHMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`MHMessage` basada en una instancia :class:`BabylMessage`, se producen las siguientes conversiones:

source: A message with Babyl-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
es: Un mensaje con comportamientos específicos de Babyl. El parámetro *message* tiene el mismo significado que con el constructor :class:`Message`.

source: Certain message labels, called :dfn:`attributes`, are defined by convention to have special meanings. The attributes are as follows:
es: Ciertas etiquetas de mensajes, llamadas :dfn:`attributes`, están definidas por convención para tener significados especiales. Los atributos son los siguientes:

source: Label
es: Etiqueta

source: deleted
es: *deleted* (borrado)

source: filed
es: *filed* (archivado)

source: Copied to another file or mailbox
es: Copiado a otro archivo o buzón de correo

source: answered
es: *answered* (contestado)

source: forwarded
es: *forwarded* (reenviado)

source: Forwarded
es: Reenviado

source: edited
es: *edited* (editado)

source: Modified by the user
es: Modificado por el usuario

source: resent
es: *resent* (reenviado)

source: Resent
es: Reenviado

source: By default, Rmail displays only visible headers. The :class:`BabylMessage` class, though, uses the original headers because they are more complete. Visible headers may be accessed explicitly if desired.
es: De forma predeterminada, Rmail sólo muestra las cabeceras visibles. La clase :class:`BabylMessage`, sin embargo, usa los encabezados originales porque son más completos. Se puede acceder a las cabeceras visibles explícitamente si se desea.

source: :class:`BabylMessage` instances offer the following methods:
es: Instancias de :class:`BabylMessage` ofrecen los siguientes métodos:

source: Return a list of labels on the message.
es: Retorna una lista de etiquetas en el mensaje.

source: Set the list of labels on the message to *labels*.
es: Establece la lista de etiquetas del mensaje en *labels*.

source: Add *label* to the list of labels on the message.
es: Añade *label* a la lista de etiquetas del mensaje.

source: Remove *label* from the list of labels on the message.
es: Eliminar *label* de la lista de etiquetas del mensaje.

source: Return an :class:`Message` instance whose headers are the message's visible headers and whose body is empty.
es: Retorna una instancia de :class:`Message` cuyos encabezados son los encabezados visibles del mensaje y cuyo cuerpo está vacío.

source: Set the message's visible headers to be the same as the headers in *message*. Parameter *visible* should be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, or a file-like object (which should be open in text mode).
es: Establece los encabezados visibles del mensaje para que sean los mismos que los del *message*. El parámetro *visible* debe ser una instancia :class:`Message`, una instancia :class:`email.message.Message`, una cadena, o un objeto tipo archivo (que debe estar abierto en modo texto).

source: When a :class:`BabylMessage` instance's original headers are modified, the visible headers are not automatically modified to correspond. This method updates the visible headers as follows: each visible header with a corresponding original header is set to the value of the original header, each visible header without a corresponding original header is removed, and any of :mailheader:`Date`, :mailheader:`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC`, and :mailheader:`Subject` that are present in the original headers but not the visible headers are added to the visible headers.
es: Cuando se modifican los encabezados originales de una instancia :class:`BabylMessage`, los encabezados visibles no se modifican automáticamente para que se correspondan. Este método actualiza los encabezados visibles de la siguiente manera: cada encabezado visible con un encabezado original correspondiente se establece como el valor del encabezado original, cada encabezado visible sin un encabezado original correspondiente se elimina, y cualquiera de : mailheader:`Date`, :mailheader:`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC`, y :mailheader:`Subject` que están presentes en las cabeceras originales pero no las cabeceras visibles se añaden a las cabeceras visibles.

source: When a :class:`BabylMessage` instance is created based upon a :class:`MaildirMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`BabylMessage` basada en una instancia :class:`MaildirMessage`, se producen las siguientes conversiones:

source: "forwarded" label
es: etiqueta "*forwarded*" (reenviado)

source: When a :class:`BabylMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
es: Cuando se crea una instancia :class:`BabylMessage` basada en una instancia :class:`mboxMessage` o :class:`MMDFMessage`, se omiten los encabezados :mailheader:`Status` y :mailheader:`X-Status` y se producen las siguientes conversiones:

source: When a :class:`BabylMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`BabylMessage` basada en una instancia :class:`MHMessage`, se producen las siguientes conversiones:

source: A message with MMDF-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
es: Un mensaje con comportamientos específicos de MMDF. El parámetro *message* tiene el mismo significado que con el constructor :class:`Message`.

source: As with message in an mbox mailbox, MMDF messages are stored with the sender's address and the delivery date in an initial line beginning with "From ". Likewise, flags that indicate the state of the message are typically stored in :mailheader:`Status` and :mailheader:`X-Status` headers.
es: Al igual que los mensajes en un buzón de correo de mbox, los mensajes MMDF se almacenan con la dirección del remitente y la fecha de entrega en una línea inicial que comienza con "From". De la misma manera, los flags que indican el estado del mensaje se almacenan típicamente en las cabeceras :mailheader:`Status` y :mailheader:`X-Status`.

source: Conventional flags for MMDF messages are identical to those of mbox message and are as follows:
es: Los flags convencionales para los mensajes MMDF son idénticos a las de los mensajes de mbox y son los siguientes:

source: :class:`MMDFMessage` instances offer the following methods, which are identical to those offered by :class:`mboxMessage`:
es: Las instancias de :class:`MMDFMessage` ofrecen los siguientes métodos, que son idénticos a los ofrecidos por :class:`mboxMessage`:

source: When an :class:`MMDFMessage` instance is created based upon a :class:`MaildirMessage` instance, a "From " line is generated based upon the :class:`MaildirMessage` instance's delivery date, and the following conversions take place:
es: Cuando se crea una instancia :class:`MMDFMessage` basada en una instancia :class:`MaildirMessage`, se genera una línea "From " basada en la fecha de entrega de la instancia :class:`MaildirMessage`, y se realizan las siguientes conversiones:

source: When an :class:`MMDFMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`MMDFMessage` basada en una instancia :class:`MHMessage`, se producen las siguientes conversiones:

source: When an :class:`MMDFMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`MMDFMessage` basada en una instancia :class:`BabylMessage`, se producen las siguientes conversiones:

source: When an :class:`MMDFMessage` instance is created based upon an :class:`mboxMessage` instance, the "From " line is copied and all flags directly correspond:
es: Cuando se crea una instancia :class:`MMDFMessage` basada en una instancia :class:`mboxMessage`, la línea "From " se copia y todos los flags se corresponden directamente:

source: :class:`mboxMessage` state
es: Estado de :class:`mboxMessage`

source: Exceptions
es: Excepciones

source: The following exception classes are defined in the :mod:`mailbox` module:
es: Las siguientes clases de excepción están definidas en el módulo :mod:`mailbox`:

source: The based class for all other module-specific exceptions.
es: La clase base para todas las demás excepciones específicas del módulo.

source: Raised when a mailbox is expected but is not found, such as when instantiating a :class:`Mailbox` subclass with a path that does not exist (and with the *create* parameter set to ``False``), or when opening a folder that does not exist.
es: Se lanza cuando se espera un buzón de correo pero no se encuentra, como cuando se instancia una subclase :class:`Mailbox` con una ruta que no existe (y con el parámetro *create* establecido en ``False``), o cuando se abre una carpeta que no existe.

source: Raised when a mailbox is not empty but is expected to be, such as when deleting a folder that contains messages.
es: Se lanza cuando un buzón de correo no está vacío, pero se espera que lo esté, como cuando se elimina una carpeta que contiene mensajes.

source: Raised when some mailbox-related condition beyond the control of the program causes it to be unable to proceed, such as when failing to acquire a lock that another program already holds a lock, or when a uniquely-generated file name already exists.
es: Se lanza cuando alguna condición relacionada con el buzón de correo, fuera del control del programa, hace que éste no pueda proceder, como por ejemplo cuando se falla en la adquisición de un bloqueo que es mantenido por otro programa, o cuando ya existe un nombre de archivo generado de forma única.

source: Raised when the data in a file cannot be parsed, such as when an :class:`MH` instance attempts to read a corrupted :file:`.mh_sequences` file.
es: Se lanza cuando los datos de un archivo no pueden ser analizados, como cuando una instancia :class:`MH` intenta leer un archivo :file:`.mh_sequences` corrupto.

source: Examples
es: Ejemplos

source: A simple example of printing the subjects of all messages in a mailbox that seem interesting::
es: Un simple ejemplo de impresión de los temas de todos los mensajes en un buzón de correo que parecen interesantes::

source: To copy all mail from a Babyl mailbox to an MH mailbox, converting all of the format-specific information that can be converted::
es: Para copiar todo el correo de un buzón de Babyl a un buzón de MH, convirtiendo toda la información de formato específico que puede ser convertida::

source: This example sorts mail from several mailing lists into different mailboxes, being careful to avoid mail corruption due to concurrent modification by other programs, mail loss due to interruption of the program, or premature termination due to malformed messages in the mailbox::
es: Este ejemplo clasifica el correo de varias listas de correo en diferentes buzones, teniendo cuidado de evitar la corrupción del correo debido a la modificación simultánea por otros programas, la pérdida de correo debido a la interrupción del programa, o la terminación prematura debido a mensajes malformados en el buzón::
