Repository: python/python-docs-es
Catalog: library/mailbox.po
Languages: es

source: Folders of the style introduced by the Courier mail transfer agent are also supported. Any subdirectory of the main mailbox is considered a folder if ``'.'`` is the first character in its name. Folder names are represented by :class:`Maildir` without the leading ``'.'``. Each folder is itself a Maildir mailbox but should not contain other folders. Instead, a logical nesting is indicated using ``'.'`` to delimit levels, e.g., "Archived.2005.07".
es: Se admiten también carpetas del estilo introducido por el agente de transferencia de correo Courier. Cualquier subdirectorio del buzón de correo principal se considera una carpeta si ``'.'`` es el primer carácter de su nombre. Los nombres de las carpetas están representados por :class:`Maildir` sin la palabra ``'.'``. Cada carpeta es en sí misma un buzón de correo de Maildir pero no debe contener otras carpetas. En su lugar, se indica un anidamiento lógico usando ``'.'`` para delimitar los niveles, por ejemplo, "Archived.2005.07".

source: The Maildir specification requires the use of a colon (``':'``) in certain message file names. However, some operating systems do not permit this character in file names, If you wish to use a Maildir-like format on such an operating system, you should specify another character to use instead. The exclamation point (``'!'``) is a popular choice. For example::
es: La especificación Maildir requiere el uso de dos puntos (``':'``) en ciertos nombres de archivos de mensajes. Sin embargo, algunos sistemas operativos no permiten este carácter en los nombres de archivo, si desea utilizar un formato similar a Maildir en dicho sistema operativo, debe especificar otro carácter para utilizarlo en su lugar. El signo de exclamación (``'!'``) es una elección popular. Por ejemplo::

source: The :attr:`colon` attribute may also be set on a per-instance basis.
es: El atributo :attr:`colon` también puede ser establecido para cada instancia.

source: :class:`Maildir` instances have all of the methods of :class:`Mailbox` in addition to the following:
es: Las instancias de :class:`Maildir` tienen todos los métodos de :class:`Mailbox` además de los siguientes:

source: Return a list of the names of all folders.
es: Retorna una lista con los nombres de todas las carpetas.

source: Return a :class:`Maildir` instance representing the folder whose name is *folder*. A :exc:`NoSuchMailboxError` exception is raised if the folder does not exist.
es: Retorna una instancia :class:`Maildir` que representa la carpeta cuyo nombre es *folder*. Una excepción :exc:`NoSuchMailboxError` se lanza si la carpeta no existe.

source: Create a folder whose name is *folder* and return a :class:`Maildir` instance representing it.
es: Crea una carpeta cuyo nombre sea *folder* y retorna una instancia :class:`Maildir` que la represente.

source: Delete the folder whose name is *folder*. If the folder contains any messages, a :exc:`NotEmptyError` exception will be raised and the folder will not be deleted.
es: Elimina la carpeta cuyo nombre es *folder*. Si la carpeta contiene algún mensaje, se lanzará una excepción :exc:`NotEmptyError` y la carpeta no se borrará.

source: Delete temporary files from the mailbox that have not been accessed in the last 36 hours. The Maildir specification says that mail-reading programs should do this occasionally.
es: Borra los archivos temporales del buzón de correo que no han sido accedidos en las últimas 36 horas. La especificación Maildir dice que los programas de lectura de correo deben hacer esto ocasionalmente.

source: Some :class:`Mailbox` methods implemented by :class:`Maildir` deserve special remarks:
es: Algunos métodos de :class:`Mailbox` implementados por :class:`Maildir` merecen comentarios especiales:

source: These methods generate unique file names based upon the current process ID. When using multiple threads, undetected name clashes may occur and cause corruption of the mailbox unless threads are coordinated to avoid using these methods to manipulate the same mailbox simultaneously.
es: Estos métodos generan nombres de archivo únicos basados en el ID del proceso actual. Cuando se utilizan varios hilos, pueden producirse conflictos de nombres no detectados y causar la corrupción del buzón de correo a menos que se coordinen los hilos para evitar que se utilicen estos métodos para manipular el mismo buzón de correo simultáneamente.

source: All changes to Maildir mailboxes are immediately applied, so this method does nothing.
es: Todos los cambios en los buzones de Maildir se aplican inmediatamente, así que este método no hace nada.

source: Maildir mailboxes do not support (or require) locking, so these methods do nothing.
es: Los buzones de Maildir no admiten (o requieren) bloqueo, por lo que estos métodos no hacen nada.

source: :class:`Maildir` instances do not keep any open files and the underlying mailboxes do not support locking, so this method does nothing.
es: Las instancias de :class:`Maildir` no mantienen ningún archivo abierto y los buzones subyacentes no soportan el bloqueo, por lo que este método no hace nada.

source: Depending upon the host platform, it may not be possible to modify or remove the underlying message while the returned file remains open.
es: Dependiendo de la plataforma del host, puede que no sea posible modificar o eliminar el mensaje subyacente mientras el archivo retornado permanezca abierto.

source: `maildir man page from qmail <http://www.qmail.org/man/man5/maildir.html>`_
es: `pagina web maildir de qmail <http://www.qmail.org/man/man5/maildir.html>`__

source: The original specification of the format.
es: La especificación original del formato.

source: `Using maildir format <https://cr.yp.to/proto/maildir.html>`_
es: `Utilizando el formato maildir <https://cr.yp.to/proto/maildir.html>`_

source: Notes on Maildir by its inventor. Includes an updated name-creation scheme and details on "info" semantics.
es: Notas sobre Maildir por su inventor. Incluye un esquema actualizado de creación de nombres y detalles sobre la "info" de la semántica".

source: `maildir man page from Courier <http://www.courier-mta.org/maildir.html>`_
es: `pagina web maildir de Courier <http://www.courier-mta.org/maildir.html>`_

source: Another specification of the format. Describes a common extension for supporting folders.
es: Otra especificación del formato. Describe una extensión común para soportar carpetas.

source: A subclass of :class:`Mailbox` for mailboxes in mbox format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`mboxMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
es: Una subclase de :class:`Mailbox` para los buzones de correo en formato mbox. El parámetro *factory* es un objeto invocable que acepta una representación de mensaje tipo archivo (que se comporta como si se abriera en modo binario) y retorna una representación personalizada. Si *factory* es ``None``, :class:`mboxMessage` se utiliza como representación de mensaje por defecto. Si *create* es ``True``, el buzón de correo se crea si no existe.

source: The mbox format is the classic format for storing mail on Unix systems. All messages in an mbox mailbox are stored in a single file with the beginning of each message indicated by a line whose first five characters are "From ".
es: El formato mbox es el formato clásico para almacenar correo en sistemas Unix. Todos los mensajes de un buzón de correo mbox se almacenan en un único archivo con el comienzo de cada mensaje indicado por una línea cuyos cinco primeros caracteres son "From".

source: Several variations of the mbox format exist to address perceived shortcomings in the original. In the interest of compatibility, :class:`mbox` implements the original format, which is sometimes referred to as :dfn:`mboxo`. This means that the :mailheader:`Content-Length` header, if present, is ignored and that any occurrences of "From " at the beginning of a line in a message body are transformed to ">From " when storing the message, although occurrences of ">From " are not transformed to "From " when reading the message.
es: Existen varias variaciones del formato mbox para abordar las deficiencias percibidas en el original. En aras de la compatibilidad, :class:`mbox` implementa el formato original, que a veces se denomina :dfn:`mboxo`. Esto significa que el encabezado :mailheader:`Content-Length`, si está presente, se ignora y que cualquier ocurrencia de "From " al principio de una línea en el cuerpo de un mensaje se transforma en ">From " al almacenar el mensaje, aunque las ocurrencias de ">From " no se transforman en "From " al leer el mensaje.

source: Some :class:`Mailbox` methods implemented by :class:`mbox` deserve special remarks:
es: Algunos métodos de :class:`Mailbox` implementados por :class:`Maildir` merecen comentarios especiales:

source: Using the file after calling :meth:`flush` or :meth:`close` on the :class:`mbox` instance may yield unpredictable results or raise an exception.
es: Usar el archivo después de llamar a :meth:`flush` o :meth:`close` en la instancia :class:`mbox` puede producir resultados impredecibles o lanzar una excepción.

source: Three locking mechanisms are used---dot locking and, if available, the :c:func:`flock` and :c:func:`lockf` system calls.
es: Se utilizan tres mecanismos de bloqueo... el bloqueo por puntos y, si está disponible, las llamadas del sistema :c:func:`flock` y :c:func:`lockf`.

source: `mbox man page from qmail <http://www.qmail.org/man/man5/mbox.html>`_
es: `pagina web mbox de qmail <http://www.qmail.org/man/man5/mbox.html>`_

source: A specification of the format and its variations.
es: Una especificación del formato y sus variaciones.

source: `mbox man page from tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_
es: `pagina web mbox de tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_

source: Another specification of the format, with details on locking.
es: Otra especificación del formato, con detalles sobre el bloqueo.

source: `Configuring Netscape Mail on Unix: Why The Content-Length Format is Bad <https://www.jwz.org/doc/content-length.html>`_
es: `Configurando el correo de Netscape en Unix: Por qué el formato de longitud de contenido es malo <https://www.jwz.org/doc/content-length.html>`_

source: An argument for using the original mbox format rather than a variation.
es: Un argumento para usar el formato original mbox en lugar de una variación.

source: `"mbox" is a family of several mutually incompatible mailbox formats <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`_
es: "mbox" es una familia de varios formatos de buzón de correo mutuamente incompatibles <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`__

source: A history of mbox variations.
es: Una historia de variaciones de mbox.

source: A subclass of :class:`Mailbox` for mailboxes in MH format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MHMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
es: Una subclase de :class:`Mailbox` para los buzones de correo en formato MH. El parámetro *factory* es un objeto invocable que acepta una representación de mensaje tipo archivo (que se comporta como si se abriera en modo binario) y retorna una representación personalizada. Si *factory* es ``None``, :class:`MHMessage` se utiliza como representación de mensaje por defecto. Si *create* es ``True``, el buzón de correo se crea si no existe.

source: MH is a directory-based mailbox format invented for the MH Message Handling System, a mail user agent. Each message in an MH mailbox resides in its own file. An MH mailbox may contain other MH mailboxes (called :dfn:`folders`) in addition to messages. Folders may be nested indefinitely. MH mailboxes also support :dfn:`sequences`, which are named lists used to logically group messages without moving them to sub-folders. Sequences are defined in a file called :file:`.mh_sequences` in each folder.
es: MH es un formato de buzón de correo basado en un directorio inventado para el Sistema de Manejo de Mensajes MH, un agente de usuario de correo. Cada mensaje de un buzón de correo MH reside en su propio archivo. Un buzón de correo MH puede contener otros buzones de correos MH (llamados :dfn:`folders`) además de los mensajes. Las carpetas pueden anidarse indefinidamente. Los buzones de correo MH también soportan :dfn:`sequences`, que son listas con nombre usadas para agrupar lógicamente los mensajes sin moverlos a subcarpetas. Las secuencias se definen en un archivo llamado :file:`.mh_sequences` en cada carpeta.

source: The :class:`MH` class manipulates MH mailboxes, but it does not attempt to emulate all of :program:`mh`'s behaviors. In particular, it does not modify and is not affected by the :file:`context` or :file:`.mh_profile` files that are used by :program:`mh` to store its state and configuration.
es: La clase :class:`MH` manipula los buzones de correos de MH, pero no intenta emular todos los comportamientos de :program:`mh`. En particular, no modifica ni se ve afectado por los archivos de :file:`context` o :file:`.mh_profile` que utiliza :program:`mh` para almacenar su estado y configuración.

source: :class:`MH` instances have all of the methods of :class:`Mailbox` in addition to the following:
es: Las instancias de :class:`Maildir` tienen todos los métodos de :class:`Mailbox` además de los siguientes:

source: Return an :class:`MH` instance representing the folder whose name is *folder*. A :exc:`NoSuchMailboxError` exception is raised if the folder does not exist.
es: Retorna una instancia :class:`Maildir` que representa la carpeta cuyo nombre es *folder*. Una excepción :exc:`NoSuchMailboxError` se lanza si la carpeta no existe.

source: Create a folder whose name is *folder* and return an :class:`MH` instance representing it.
es: Crea una carpeta cuyo nombre sea *folder* y retorna una instancia :class:`MH` que la represente.

source: Return a dictionary of sequence names mapped to key lists. If there are no sequences, the empty dictionary is returned.
es: Retorna un diccionario de nombres de secuencias mapeadas a listas clave. Si no hay secuencias, se retorna el diccionario vacío.

source: Re-define the sequences that exist in the mailbox based upon *sequences*, a dictionary of names mapped to key lists, like returned by :meth:`get_sequences`.
es: Re-define las secuencias que existen en el buzón de correo basado en *sequences*, un diccionario de nombres mapeados a listas de claves, como las retornadas por :meth:`get_sequences`.

source: Rename messages in the mailbox as necessary to eliminate gaps in numbering. Entries in the sequences list are updated correspondingly.
es: Renombra los mensajes en el buzón de correo según sea necesario para eliminar los huecos en la numeración. Las entradas en la lista de secuencias se actualizan correspondientemente.

source: Already-issued keys are invalidated by this operation and should not be subsequently used.
es: Las llaves ya emitidas quedan invalidadas por esta operación y no deben utilizarse posteriormente.

source: Some :class:`Mailbox` methods implemented by :class:`MH` deserve special remarks:
es: Algunos métodos de :class:`Mailbox` implementados por :class:`Maildir` merecen comentarios especiales:

source: These methods immediately delete the message. The MH convention of marking a message for deletion by prepending a comma to its name is not used.
es: Estos métodos borran inmediatamente el mensaje. No se utiliza la convención del MH de marcar un mensaje para borrarlo poniendo una coma en su nombre.

source: Three locking mechanisms are used---dot locking and, if available, the :c:func:`flock` and :c:func:`lockf` system calls. For MH mailboxes, locking the mailbox means locking the :file:`.mh_sequences` file and, only for the duration of any operations that affect them, locking individual message files.
es: Se utilizan tres mecanismos de bloqueo... el bloqueo por puntos y, si está disponible, las llamadas del sistema :c:func:`flock` y :c:func:`lockf`. Para los buzones de correos MH, bloquear el buzón de correo significa bloquear el archivo :file:`.mh_sequences` y, sólo durante la duración de cualquier operación que les afecte, bloquear los archivos de mensajes individuales.

source: Depending upon the host platform, it may not be possible to remove the underlying message while the returned file remains open.
es: Dependiendo de la plataforma anfitriona, puede que no sea posible eliminar el mensaje subyacente mientras el archivo retornado permanezca abierto.

source: All changes to MH mailboxes are immediately applied, so this method does nothing.
es: Todos los cambios en los buzones de correos de Maildir se aplican inmediatamente, así que este método no hace nada.

source: :class:`MH` instances do not keep any open files, so this method is equivalent to :meth:`unlock`.
es: Las instancias de :class:`MH` no mantienen ningún archivo abierto, así que este método es equivalente a :meth:`unlock`.

source: `nmh - Message Handling System <http://www.nongnu.org/nmh/>`_
es: `nmh - Sistema de Manejo de Mensajes <http://www.nongnu.org/nmh/>`__

source: Home page of :program:`nmh`, an updated version of the original :program:`mh`.
es: Página principal de :program:`nmh`, una versión actualizada del original :program:`mh`.

source: `MH & nmh: Email for Users & Programmers <https://rand-mh.sourceforge.io/book/>`_
es: `MH & nmh: Correo electrónico para usuarios y programadores <https://rand-mh.sourceforge.io/book/>`_

source: A GPL-licensed book on :program:`mh` and :program:`nmh`, with some information on the mailbox format.
es: Un libro con licencia GPL sobre :program:`mh` y :program:`nmh`, con alguna información sobre el formato del buzón.

source: A subclass of :class:`Mailbox` for mailboxes in Babyl format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`BabylMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
es: Una subclase de :class:`Mailbox` para los buzones en formato Babyl. El parámetro *factory* es un objeto invocable que acepta una representación de mensaje tipo archivo (que se comporta como si se abriera en modo binario) y retorna una representación personalizada. Si *factory* es ``None``, :class:`BabylMessage` se utiliza como representación de mensaje por defecto. Si *create* es ``True``, el buzón se crea si no existe.

source: Babyl is a single-file mailbox format used by the Rmail mail user agent included with Emacs. The beginning of a message is indicated by a line containing the two characters Control-Underscore (``'\037'``) and Control-L (``'\014'``). The end of a message is indicated by the start of the next message or, in the case of the last message, a line containing a Control-Underscore (``'\037'``) character.
es: Babyl es un formato de buzón de un solo archivo usado por el agente de usuario de correo de Rmail incluido en Emacs. El comienzo de un mensaje se indica con una línea que contiene los dos caracteres Control-Underscore (``'\037'``) y Control-L (``'\014'``). El final de un mensaje se indica con el comienzo del siguiente mensaje o, en el caso del último mensaje, una línea que contiene un carácter Control-Underscore (``'\037'``).

source: Messages in a Babyl mailbox have two sets of headers, original headers and so-called visible headers. Visible headers are typically a subset of the original headers that have been reformatted or abridged to be more attractive. Each message in a Babyl mailbox also has an accompanying list of :dfn:`labels`, or short strings that record extra information about the message, and a list of all user-defined labels found in the mailbox is kept in the Babyl options section.
es: Los mensajes en un buzón de correo de Babyl tienen dos juegos de encabezados, los encabezados originales y los llamados encabezados visibles. Los encabezados visibles son típicamente un subconjunto de los encabezados originales que han sido reformateados o abreviados para ser más atractivos. Cada mensaje de un buzón de correo de Babyl también tiene una lista de :dfn:`labels`, o cadenas cortas que registran información adicional sobre el mensaje, y una lista de todas las etiquetas definidas por el usuario que se encuentran en el buzón de correo se mantiene en la sección de opciones de Babyl.

source: :class:`Babyl` instances have all of the methods of :class:`Mailbox` in addition to the following:
es: Las instancias de :class:`Maildir` tienen todos los métodos de :class:`Mailbox` además de los siguientes:

source: Return a list of the names of all user-defined labels used in the mailbox.
es: Retorna una lista de los nombres de todas las etiquetas definidas por el usuario utilizadas en el buzón de correo.

source: The actual messages are inspected to determine which labels exist in the mailbox rather than consulting the list of labels in the Babyl options section, but the Babyl section is updated whenever the mailbox is modified.
es: Los mensajes actuales se inspeccionan para determinar qué etiquetas existen en el buzón de correo en lugar de consultar la lista de etiquetas en la sección de opciones de Babyl, pero la sección de Babyl se actualiza cada vez que se modifica el buzón de correo.

source: Some :class:`Mailbox` methods implemented by :class:`Babyl` deserve special remarks:
es: Algunos métodos de :class:`Mailbox` implementados por :class:`Maildir` merecen comentarios especiales:

source: In Babyl mailboxes, the headers of a message are not stored contiguously with the body of the message. To generate a file-like representation, the headers and body are copied together into an :class:`io.BytesIO` instance, which has an API identical to that of a file. As a result, the file-like object is truly independent of the underlying mailbox but does not save memory compared to a string representation.
es: En los buzones de correos de Babyl, los encabezados de un mensaje no se almacenan contiguamente al cuerpo del mensaje. Para generar una representación tipo archivo, las cabeceras y el cuerpo se copian juntos en una instancia :class:`io.BytesIO`, que tiene una API idéntica a la de un archivo. Como resultado, el objeto similar a un archivo es verdaderamente independiente del buzón de correo subyacente, pero no ahorra memoria en comparación con una representación en cadena.

source: `Format of Version 5 Babyl Files <https://quimby.gnus.org/notes/BABYL>`_
es: "Formato de la versión 5 de los archivos de Babyl" <https://quimby.gnus.org/notes/BABYL>`_

source: A specification of the Babyl format.
es: Una especificación del formato Babyl.

source: `Reading Mail with Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_
es: `Leyendo el correo con Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_

source: The Rmail manual, with some information on Babyl semantics.
es: El manual de Rmail, con cierta información sobre la semántica Babyl.
