Repository: python/python-docs-es
Catalog: library/mailbox.po
Languages: es

source: :mod:`mailbox` --- Manipulate mailboxes in various formats
es: :mod:`mailbox` --- Manipular buzones de correo en varios formatos

source: **Source code:** :source:`Lib/mailbox.py`
es: **Código fuente:** :source:`Lib/mailbox.py`

source: This module defines two classes, :class:`Mailbox` and :class:`Message`, for accessing and manipulating on-disk mailboxes and the messages they contain. :class:`Mailbox` offers a dictionary-like mapping from keys to messages. :class:`Message` extends the :mod:`email.message` module's :class:`~email.message.Message` class with format-specific state and behavior. Supported mailbox formats are Maildir, mbox, MH, Babyl, and MMDF.
es: Este módulo define dos clases, :class:`Mailbox` y :class:`Message`, para acceder y manipular en disco los buzones de correo y los mensajes que contienen. :class:`Mailbox` ofrece una asignación similar a un diccionario de claves a mensajes. :class:`Message` extiende la clase :mod:`email.message` del módulo :class:`~email.message.Message` con el estado y el comportamiento específicos del formato. Los formatos de buzón de correo compatibles son Maildir, mbox, MH, Babyl y MMDF.

source: Module :mod:`email`
es: Módulo :mod:`email`

source: Represent and manipulate messages.
es: Representar y manipular mensajes.

source: :class:`Mailbox` objects
es: Objetos :class:'Mailbox'

source: A mailbox, which may be inspected and modified.
es: Un buzón de correo, que se puede inspeccionar y modificar.

source: The :class:`Mailbox` class defines an interface and is not intended to be instantiated. Instead, format-specific subclasses should inherit from :class:`Mailbox` and your code should instantiate a particular subclass.
es: La clase :class:`Mailbox` define una interfaz y no está diseñada para crear instancias. En su lugar, las subclases específicas del formato deben heredar de :class:`Mailbox` y el código debe crear una instancia de una subclase determinada.

source: The :class:`Mailbox` interface is dictionary-like, with small keys corresponding to messages. Keys are issued by the :class:`Mailbox` instance with which they will be used and are only meaningful to that :class:`Mailbox` instance. A key continues to identify a message even if the corresponding message is modified, such as by replacing it with another message.
es: La interfaz :class:`Mailbox` es similar a un diccionario, con pequeñas claves correspondientes a los mensajes. Las claves son emitidas por la instancia :class:`Mailbox` con la que se utilizarán y solo son significativas para esa instancia :class:`Mailbox`. Una clave continúa identificando un mensaje incluso si se modifica el mensaje correspondiente, por ejemplo, sustituyéndolo por otro mensaje.

source: Messages may be added to a :class:`Mailbox` instance using the set-like method :meth:`add` and removed using a ``del`` statement or the set-like methods :meth:`remove` and :meth:`discard`.
es: Los mensajes se pueden agregar a una instancia :class:`Mailbox` utilizando el método como :meth:`add` y quitarse mediante una instrucción ``del`` o los métodos como :meth:`remove` y :meth:`discard`.

source: :class:`Mailbox` interface semantics differ from dictionary semantics in some noteworthy ways. Each time a message is requested, a new representation (typically a :class:`Message` instance) is generated based upon the current state of the mailbox. Similarly, when a message is added to a :class:`Mailbox` instance, the provided message representation's contents are copied. In neither case is a reference to the message representation kept by the :class:`Mailbox` instance.
es: La semántica de la interfaz :class:`Mailbox` difiere de la semántica del diccionario en algunos aspectos notables. Cada vez que se solicita un mensaje, se genera una nueva representación (típicamente una instancia :class:`Message`) basada en el estado actual del buzón de correo. De forma similar, cuando se añade un mensaje a una instancia :class:`Mailbox`, se copia el contenido de la representación del mensaje proporcionado. En ninguno de los dos casos se mantiene una referencia a la representación del mensaje por parte de la instancia :class:`Mailbox`.

source: The default :class:`Mailbox` iterator iterates over message representations, not keys as the default dictionary iterator does. Moreover, modification of a mailbox during iteration is safe and well-defined. Messages added to the mailbox after an iterator is created will not be seen by the iterator. Messages removed from the mailbox before the iterator yields them will be silently skipped, though using a key from an iterator may result in a :exc:`KeyError` exception if the corresponding message is subsequently removed.
es: El iterador por defecto de :class:`Mailbox` itera sobre las representaciones de los mensajes, no sobre las claves como lo hace el iterador del diccionario por defecto. Además, la modificación de un buzón de correo durante la iteración es segura y bien definida. Los mensajes añadidos al buzón de correo después de que se cree un iterador no serán vistos por el iterador. Los mensajes eliminados del buzón de correo antes de que el iterador los ceda serán omitidos silenciosamente, aunque el uso de una clave de un iterador puede dar lugar a una excepción :exc:`KeyError` si el mensaje correspondiente es eliminado posteriormente.

source: Be very cautious when modifying mailboxes that might be simultaneously changed by some other process. The safest mailbox format to use for such tasks is Maildir; try to avoid using single-file formats such as mbox for concurrent writing. If you're modifying a mailbox, you *must* lock it by calling the :meth:`lock` and :meth:`unlock` methods *before* reading any messages in the file or making any changes by adding or deleting a message. Failing to lock the mailbox runs the risk of losing messages or corrupting the entire mailbox.
es: Sea muy cauteloso al modificar los buzones de correo que pueden ser cambiados simultáneamente por algún otro proceso. El formato más seguro de buzón de correo que se puede utilizar para esas tareas es Maildir; trate de evitar el uso de formatos de un solo archivo, como mbox, para la escritura simultánea. Si estás modificando un buzón de correo, *debes* bloquearlo llamando a los métodos :meth:`lock` y :meth:`unlock` *antes* de leer cualquier mensaje en el fichero o hacer cualquier cambio añadiendo o borrando un mensaje. Si no se bloquea el buzón se corre el riesgo de perder mensajes o de corromper todo el buzón.

source: :class:`Mailbox` instances have the following methods:
es: Las instancias de :class:`Mailbox` tienen los siguientes métodos:

source: Add *message* to the mailbox and return the key that has been assigned to it.
es: Añade *message* al buzón de correo y retorna la clave que se le ha asignado.

source: Parameter *message* may be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, a byte string, or a file-like object (which should be open in binary mode). If *message* is an instance of the appropriate format-specific :class:`Message` subclass (e.g., if it's an :class:`mboxMessage` instance and this is an :class:`mbox` instance), its format-specific information is used. Otherwise, reasonable defaults for format-specific information are used.
es: El parámetro *message* puede ser una instancia :class:`Message`, una instancia :class:`email.message.Message`, una cadena, una cadena de bytes o un objeto tipo archivo (que debe estar abierto en modo binario). Si *message* es una instancia de la subclase :class:`Message` con el formato apropiado (por ejemplo, si es una instancia :class:`mboxMessage` y ésta es una instancia :class:`mbox`), se utiliza su información de formato específico. En caso contrario, se utilizan valores por defecto razonables para la información específica del formato.

source: Support for binary input was added.
es: Se añadió el soporte para la entrada binaria.

source: Delete the message corresponding to *key* from the mailbox.
es: Borre el mensaje correspondiente a la *key* del buzón de correo.

source: If no such message exists, a :exc:`KeyError` exception is raised if the method was called as :meth:`remove` or :meth:`__delitem__` but no exception is raised if the method was called as :meth:`discard`. The behavior of :meth:`discard` may be preferred if the underlying mailbox format supports concurrent modification by other processes.
es: Si no existe tal mensaje, se levanta una excepción :exc:`KeyError` si el método se llamó :meth:`remove` o :meth:`__delitem__` pero no se levanta una excepción si el método se llamó :meth:`discard`. El comportamiento de :meth:`discard` puede ser preferido si el formato de buzón subyacente soporta la modificación concurrente por otros procesos.

source: Replace the message corresponding to *key* with *message*. Raise a :exc:`KeyError` exception if no message already corresponds to *key*.
es: Reemplaza el mensaje correspondiente a *key* por *message*. Levante una excepción :exc:`KeyError` si ningún mensaje ya corresponde a *key*.

source: As with :meth:`add`, parameter *message* may be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, a byte string, or a file-like object (which should be open in binary mode). If *message* is an instance of the appropriate format-specific :class:`Message` subclass (e.g., if it's an :class:`mboxMessage` instance and this is an :class:`mbox` instance), its format-specific information is used. Otherwise, the format-specific information of the message that currently corresponds to *key* is left unchanged.
es: Al igual que :meth:`add`, el parámetro *message* puede ser una instancia :class:`Message`, una instancia :class:`email.message.Message`, una cadena, una cadena de bytes, o un objeto tipo archivo (que debe estar abierto en modo binario). Si *message* es una instancia de la subclase :class:`Message` con el formato apropiado (por ejemplo, si es una instancia :class:`mboxMessage` y ésta es una instancia :class:`mbox`), se utiliza su información de formato específico. En caso contrario, la información específica del formato del mensaje que actualmente corresponde a *key* se deja sin cambios.

source: Return an iterator over all keys if called as :meth:`iterkeys` or return a list of keys if called as :meth:`keys`.
es: Retorna un iterador sobre todas las claves si se llama :meth:`iterkeys` o retorna una lista de claves si se llama :meth:`keys`.

source: Return an iterator over representations of all messages if called as :meth:`itervalues` or :meth:`__iter__` or return a list of such representations if called as :meth:`values`. The messages are represented as instances of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
es: Retorna un iterador sobre las representaciones de todos los mensajes si se llama :meth:`itervalores` o :meth:`__iter__` o retorna una lista de tales representaciones si se llama :meth:`values`. Los mensajes se representan como instancias de la subclase :class:`Message` específica del formato, a menos que se haya especificado una fábrica de mensajes personalizados cuando se haya inicializado la instancia :class:`Mailbox`.

source: The behavior of :meth:`__iter__` is unlike that of dictionaries, which iterate over keys.
es: El comportamiento de :meth:`__iter__` es diferente al de los diccionarios, que iteran sobre las claves.

source: Return an iterator over (*key*, *message*) pairs, where *key* is a key and *message* is a message representation, if called as :meth:`iteritems` or return a list of such pairs if called as :meth:`items`. The messages are represented as instances of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
es: Retorna un iterador sobre los pares (*key*, *message*), donde *key* es una clave y *message* es una representación de un mensaje, si se llama como :meth:`iteritems` o retorna una lista de tales pares si se llama como :meth:`items`. Los mensajes se representan como instancias de la subclase :class:`Message` específica del formato, a menos que se haya especificado una fábrica de mensajes personalizados cuando se haya inicializado la instancia :class:`Maiblox`.

source: Return a representation of the message corresponding to *key*. If no such message exists, *default* is returned if the method was called as :meth:`get` and a :exc:`KeyError` exception is raised if the method was called as :meth:`__getitem__`. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
es: Retorna una representación del mensaje correspondiente a *key*. Si no existe tal mensaje, se retorna *default* si el método fue llamado como :meth:`get` y se produce una excepción :exc:`KeyError` si el método fue llamado como :meth:`__getitem__`. El mensaje se representa como una instancia de la subclase :class:`Message` específica del formato, a menos que se especificara una fábrica de mensajes personalizados cuando se inicializa la instancia :class:`Mailbox`.

source: Return a representation of the message corresponding to *key* as an instance of the appropriate format-specific :class:`Message` subclass, or raise a :exc:`KeyError` exception if no such message exists.
es: Retorna una representación del mensaje correspondiente a *key* como una instancia de la subclase :class:`Message` específica del formato, o lanza una excepción :exc:`KeyError` si no existe tal mensaje.

source: Return a byte representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists.
es: Retorna una representación en bytes del mensaje correspondiente a *key*, o levanta una excepción :exc:`KeyError` si no existe tal mensaje.

source: Return a string representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists. The message is processed through :class:`email.message.Message` to convert it to a 7bit clean representation.
es: Retorna una representación en cadena del mensaje correspondiente a *key*, o lanza una excepción :exc:`KeyError` si no existe tal mensaje. El mensaje se procesa a través de :class:`email.message.Message` para convertirlo en una representación limpia de 7 bits.

source: Return a file-like representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists. The file-like object behaves as if open in binary mode. This file should be closed once it is no longer needed.
es: Retorna una representación en forma de archivo del mensaje correspondiente a *key*, o lanza una excepción :exc:`KeyError` si no existe tal mensaje. El objeto tipo archivo se comporta como si estuviera abierto en modo binario. Este archivo debería cerrarse una vez que ya no se necesite.

source: The file object really is a binary file; previously it was incorrectly returned in text mode. Also, the file-like object now supports the context management protocol: you can use a :keyword:`with` statement to automatically close it.
es: El objeto del archivo es realmente un archivo binario; anteriormente fue retornado incorrectamente en modo de texto. Además, el objeto tipo archivo ahora soporta el protocolo de gestión de contexto: puedes usar una sentencia :keyword:`with` para cerrarlo automáticamente.

source: Unlike other representations of messages, file-like representations are not necessarily independent of the :class:`Mailbox` instance that created them or of the underlying mailbox. More specific documentation is provided by each subclass.
es: A diferencia de otras representaciones de mensajes, las representaciones en forma de archivo no son necesariamente independientes de la instancia :class:`Mailbox` que las creó o del buzón de correo subyacente. Cada subclase proporciona una documentación más específica.

source: Return ``True`` if *key* corresponds to a message, ``False`` otherwise.
es: Retorna ``True`` si "key" corresponde a un mensaje, si no ``False``.

source: Return a count of messages in the mailbox.
es: Retorna un recuento de los mensajes en el buzón de correo.

source: Delete all messages from the mailbox.
es: Borrar todos los mensajes del buzón.

source: Return a representation of the message corresponding to *key* and delete the message. If no such message exists, return *default*. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
es: Retorna una representación del mensaje correspondiente a *key* y borra el mensaje. Si no existe tal mensaje, retorna *default*. El mensaje se representa como una instancia de la subclase :class:`Message` con el formato apropiado, a menos que se haya especificado una fábrica de mensajes personalizados al inicializar la instancia :class:`Mailbox`.

source: Return an arbitrary (*key*, *message*) pair, where *key* is a key and *message* is a message representation, and delete the corresponding message. If the mailbox is empty, raise a :exc:`KeyError` exception. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`Mailbox` instance was initialized.
es: Retorna un par arbitrario (*key*, *message*), donde *key* es una clave y *message* es una representación de un mensaje, y borra el mensaje correspondiente. Si el buzón de correo está vacío, lanza una excepción :exc:`KeyError`. El mensaje se representa como una instancia de la subclase :class:`Message` específica del formato, a menos que se haya especificado una fábrica de mensajes personalizados al inicializar la instancia :class:`Mailbox`.

source: Parameter *arg* should be a *key*-to-*message* mapping or an iterable of (*key*, *message*) pairs. Updates the mailbox so that, for each given *key* and *message*, the message corresponding to *key* is set to *message* as if by using :meth:`__setitem__`. As with :meth:`__setitem__`, each *key* must already correspond to a message in the mailbox or else a :exc:`KeyError` exception will be raised, so in general it is incorrect for *arg* to be a :class:`Mailbox` instance.
es: El parámetro *arg* debe ser un mapa de *key* a *message* o un iterable de pares (*key*, *message*). Actualiza el buzón de correo para que, por cada *key* y *message* dados, el mensaje correspondiente a *key* será establecido a*message* como si se usara :meth:`__setitem__`. Como con :meth:`__setitem__`, cada *key* debe corresponder ya a un mensaje en el buzón de correo o de lo contrario se lanzará una excepción :exc:`KeyError`, por lo que en general es incorrecto que *arg* sea una instancia de :class:`Mailbox`.

source: Unlike with dictionaries, keyword arguments are not supported.
es: A diferencia de los diccionarios, los argumentos de las palabras clave no están soportados.

source: Write any pending changes to the filesystem. For some :class:`Mailbox` subclasses, changes are always written immediately and :meth:`flush` does nothing, but you should still make a habit of calling this method.
es: Escribe cualquier cambio pendiente en el sistema de archivos. Para algunas subclases de :class:`Mailbox`, los cambios siempre se escriben inmediatamente y :meth:`flush` no hace nada, pero aún así deberías tener el hábito de llamar a este método.

source: Acquire an exclusive advisory lock on the mailbox so that other processes know not to modify it. An :exc:`ExternalClashError` is raised if the lock is not available. The particular locking mechanisms used depend upon the mailbox format. You should *always* lock the mailbox before making any modifications to its contents.
es: Adquiera un aviso exclusivo de bloqueo en el buzón de correo para que otros procesos sepan que no deben modificarlo. Un :exc:`ExternalClashError` se lanza si el bloqueo no está disponible. Los mecanismos de bloqueo particulares utilizados dependen del formato del buzón de correo. Deberías *siempre* bloquear el buzón antes de hacer cualquier modificación a su contenido.

source: Release the lock on the mailbox, if any.
es: Libera el bloqueo del buzón de correo, si lo hay.

source: Flush the mailbox, unlock it if necessary, and close any open files. For some :class:`Mailbox` subclasses, this method does nothing.
es: Limpia el buzón de correo, y lo desbloquea si es necesario, y cierra cualquier archivo abierto. Para algunas subclases de :class:`Mailbox`, este método no hace nada.

source: A subclass of :class:`Mailbox` for mailboxes in Maildir format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MaildirMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
es: Una subclase de :class:`Mailbox` para los buzones de correo en formato Maildir. El parámetro *factory* es un objeto invocable que acepta una representación de mensaje tipo archivo (que se comporta como si se abriera en modo binario) y retorna una representación personalizada. Si *factory* es ``None``, :class:`MaildirMessage` se utiliza como representación de mensaje por defecto. Si *create* es ``True``, el buzón se crea si no existe.

source: If *create* is ``True`` and the *dirname* path exists, it will be treated as an existing maildir without attempting to verify its directory layout.
es: Si *create* es ``True`` y la ruta de *dirname* existe, será tratado como un *maildir* existente sin intentar verificar su diseño de directorio.

source: It is for historical reasons that *dirname* is named as such rather than *path*.
es: Es por razones históricas que *dirname* es nombrado como tal en lugar de *path*.

source: Maildir is a directory-based mailbox format invented for the qmail mail transfer agent and now widely supported by other programs. Messages in a Maildir mailbox are stored in separate files within a common directory structure. This design allows Maildir mailboxes to be accessed and modified by multiple unrelated programs without data corruption, so file locking is unnecessary.
es: Maildir es un formato de buzón de correo basado en un directorio inventado para el agente de transferencia de correo qmail y ahora ampliamente soportado por otros programas. Los mensajes en un buzón de correo de Maildir se almacenan en archivos separados dentro de una estructura de directorio común. Este diseño permite que los buzones de Maildir sean accedidos y modificados por múltiples programas no relacionados sin corrupción de datos, por lo que el bloqueo de archivos es innecesario.

source: Maildir mailboxes contain three subdirectories, namely: :file:`tmp`, :file:`new`, and :file:`cur`. Messages are created momentarily in the :file:`tmp` subdirectory and then moved to the :file:`new` subdirectory to finalize delivery. A mail user agent may subsequently move the message to the :file:`cur` subdirectory and store information about the state of the message in a special "info" section appended to its file name.
es: Los buzones de correo de Maildir contienen tres subdirectorios, a saber: :file:`tmp`, :file:`new`, y :file:`cur`. Los mensajes se crean momentáneamente en el subdirectorio :file:`tmp` y luego se mueven al subdirectorio :file:`new` para finalizar la entrega. Un agente de usuario de correo puede posteriormente mover el mensaje al subdirectorio :file:`cur` y almacenar la información sobre el estado del mensaje en una sección especial "info" adjunta a su nombre de archivo.
