Repository: python/python-docs-es
Catalog: library/mailbox.po
Languages: es

source: A subclass of :class:`Mailbox` for mailboxes in MMDF format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MMDFMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
es: Una subclase de :class:`Mailbox` para buzones de correos en formato MMDF. El parámetro *factory* es un objeto al que se puede llamar que acepta una representación de mensaje similar a un archivo (que se comporta como si se abriera en modo binario) y retorna una representación personalizada. Si *factory* es ``None``, :class:`MMDFMessage` se utiliza como representación de mensaje predeterminada. Si *create* es ``True``, el buzón de correo se crea si no existe.

source: MMDF is a single-file mailbox format invented for the Multichannel Memorandum Distribution Facility, a mail transfer agent. Each message is in the same form as an mbox message but is bracketed before and after by lines containing four Control-A (``'\001'``) characters. As with the mbox format, the beginning of each message is indicated by a line whose first five characters are "From ", but additional occurrences of "From " are not transformed to ">From " when storing messages because the extra message separator lines prevent mistaking such occurrences for the starts of subsequent messages.
es: MMDF es un formato de buzón de correo de un solo archivo inventado para el centro de distribución de memorandos multicanal, un agente de transferencia de correo. Cada mensaje está en la misma forma que un mensaje de mbox, pero está entre corchetes antes y después por líneas que contienen cuatro caracteres Control-A (``'\001'``). Al igual que con el formato mbox, el principio de cada mensaje se indica mediante una línea cuyos primeros cinco caracteres son "From ", pero las apariciones adicionales de "From" no se transforman en ">From" al almacenar mensajes porque las líneas de separador de mensajes adicionales impiden confundir tales ocurrencias para los inicios de los mensajes posteriores.

source: Some :class:`Mailbox` methods implemented by :class:`MMDF` deserve special remarks:
es: Algunos métodos :class:`Mailbox` implementados por :class:`MMDF` merecen comentarios especiales:

source: Using the file after calling :meth:`flush` or :meth:`close` on the :class:`MMDF` instance may yield unpredictable results or raise an exception.
es: Usar el archivo después de llamar a :meth:`flush` o :meth:`close` en la instancia :class:`MMDF` puede producir resultados impredecibles o generar una excepción.

source: `mmdf man page from tin <http://www.tin.org/bin/man.cgi?section=5&topic=mmdf>`_
es: `Página web de mmdf por Tin <http://www.tin.org/bin/man.cgi?section-5&topic-mmdf>`_

source: A specification of MMDF format from the documentation of tin, a newsreader.
es: Una especificación del formato MMDF de la documentación de tin, un lector de noticias.

source: A Wikipedia article describing the Multichannel Memorandum Distribution Facility.
es: Un artículo de Wikipedia que describe el Centro de Distribución de Memorandos Multicanal.

source: :class:`Message` objects
es: Objetos :class:`Message`

source: A subclass of the :mod:`email.message` module's :class:`~email.message.Message`. Subclasses of :class:`mailbox.Message` add mailbox-format-specific state and behavior.
es: Una subclase del módulo :mod:`email.message` de :class:`~email.message.Message`. Las subclases de :class:`mailbox.Message` añaden el estado y el comportamiento específicos del formato del buzón de correo.

source: If *message* is omitted, the new instance is created in a default, empty state. If *message* is an :class:`email.message.Message` instance, its contents are copied; furthermore, any format-specific information is converted insofar as possible if *message* is a :class:`Message` instance. If *message* is a string, a byte string, or a file, it should contain an :rfc:`2822`\ -compliant message, which is read and parsed. Files should be open in binary mode, but text mode files are accepted for backward compatibility.
es: Si se omite *message*, la nueva instancia se crea en un estado predeterminado, vacío. Si *message* es una instancia :class:`email.message.Message`, se copian sus contenidos; además, cualquier información específica del formato se convierte en la medida de lo posible si *message* es una instancia :class:`Message`. Si *message* es una cadena, una cadena de bytes, o un archivo, debe contener un mensaje conforme :rfc:`2822`, que se lee y analiza. Los archivos deben estar abiertos en modo binario, pero los archivos en modo texto son aceptados para compatibilidad con versiones anteriores.

source: The format-specific state and behaviors offered by subclasses vary, but in general it is only the properties that are not specific to a particular mailbox that are supported (although presumably the properties are specific to a particular mailbox format). For example, file offsets for single-file mailbox formats and file names for directory-based mailbox formats are not retained, because they are only applicable to the original mailbox. But state such as whether a message has been read by the user or marked as important is retained, because it applies to the message itself.
es: El estado y los comportamientos específicos del formato que ofrecen las subclases varían, pero en general sólo se admiten las propiedades que no son específicas de un buzón de correo concreto (aunque presumiblemente las propiedades son específicas de un formato de buzón de correo concreto). Por ejemplo, no se conservan las compensaciones de archivos para los formatos de buzón de correo de un solo archivo ni los nombres de archivo para los formatos de buzón de correo basados en directorios, porque sólo son aplicables al buzón de correo original. Pero sí se conservan las declaraciones tales como si un mensaje ha sido leído por el usuario o marcado como importante, porque se aplican al propio mensaje.

source: There is no requirement that :class:`Message` instances be used to represent messages retrieved using :class:`Mailbox` instances. In some situations, the time and memory required to generate :class:`Message` representations might not be acceptable. For such situations, :class:`Mailbox` instances also offer string and file-like representations, and a custom message factory may be specified when a :class:`Mailbox` instance is initialized.
es: No hay ningún requisito de que las instancias de :class:`Message` se usen para representar los mensajes recuperados usando las instancias de :class:`Mailbox`. En algunas situaciones, el tiempo y la memoria necesarios para generar representaciones de :class:`Message` podrían no ser aceptables. Para estas situaciones, las instancias de :class:`Mailbox` también ofrecen representaciones en forma de cadenas y archivos, y se puede especificar una fábrica de mensajes personalizados cuando se inicializa una instancia de :class:`Mailbox`.

source: A message with Maildir-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
es: Un mensaje con comportamientos específicos de Maildir. El parámetro *message* tiene el mismo significado que con el constructor :class:`Message`.

source: Typically, a mail user agent application moves all of the messages in the :file:`new` subdirectory to the :file:`cur` subdirectory after the first time the user opens and closes the mailbox, recording that the messages are old whether or not they've actually been read. Each message in :file:`cur` has an "info" section added to its file name to store information about its state. (Some mail readers may also add an "info" section to messages in :file:`new`.) The "info" section may take one of two forms: it may contain "2," followed by a list of standardized flags (e.g., "2,FR") or it may contain "1," followed by so-called experimental information. Standard flags for Maildir messages are as follows:
es: Típicamente, una aplicación de agente de usuario de correo mueve todos los mensajes del subdirectorio :file:`new` al subdirectorio :file:`cur` después de la primera vez que el usuario abre y cierra el buzón de coreo, registrando que los mensajes son antiguos, tanto si han sido leídos como si no. Cada mensaje en :file:`cur` tiene una sección "info" añadida a su nombre de archivo para almacenar información sobre su estado. (Algunos lectores de correo también pueden añadir una sección "info" a los mensajes en :file:`new`.) La sección "info" puede tomar una de dos formas: puede contener "2", seguido de una lista de flags estandarizados (por ejemplo, "2,FR") o puede contener "1", seguido de la llamada información experimental. Los flags normalizados para los mensajes de Maildir son los siguientes:

source: Meaning
es: Significado

source: Explanation
es: Explicación

source: Draft
es: Borrador

source: Under composition
es: Bajo composición

source: Flagged
es: Marcada

source: Marked as important
es: Marcado como importante

source: Passed
es: Aprobado

source: Forwarded, resent, or bounced
es: Enviado, reenviado o rebotado

source: Replied
es: Contestado

source: Replied to
es: Contestado a

source: Seen
es: Visto

source: Read
es: Leído

source: Trashed
es: Destruido

source: Marked for subsequent deletion
es: Marcado para su posterior eliminación

source: :class:`MaildirMessage` instances offer the following methods:
es: Instancias de :class:`MaildirMessage` ofrecen los siguientes métodos:

source: Return either "new" (if the message should be stored in the :file:`new` subdirectory) or "cur" (if the message should be stored in the :file:`cur` subdirectory).
es: Retorna "new" (si el mensaje debe ser almacenado en el subdirectorio :file:`new`) o "cur" (si el mensaje debe ser almacenado en el subdirectorio :file:`cur`).

source: A message is typically moved from :file:`new` to :file:`cur` after its mailbox has been accessed, whether or not the message is has been read. A message ``msg`` has been read if ``"S" in msg.get_flags()`` is ``True``.
es: Un mensaje es típicamente movido de :file:`nuevo` a :file:`cur` después de que su buzón de correo ha sido accedido, ya sea que el mensaje haya sido leído o no. Un mensaje ``msg`` ha sido leído si ``"S" in msg.get_flags()`` es ``True``.

source: Set the subdirectory the message should be stored in. Parameter *subdir* must be either "new" or "cur".
es: Establece el subdirectorio en el que debe almacenarse el mensaje. El parámetro *subdir* debe ser "new" o "cur".

source: Return a string specifying the flags that are currently set. If the message complies with the standard Maildir format, the result is the concatenation in alphabetical order of zero or one occurrence of each of ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'``, and ``'T'``. The empty string is returned if no flags are set or if "info" contains experimental semantics.
es: Retorna una cadena que especifica los flags que están actualmente establecidos. Si el mensaje cumple con el formato estándar de Maildir, el resultado es la concatenación en orden alfabético de cero o una ocurrencia de cada una de los flags ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'``, y ``'T'``. La cadena vacía se retorna si no hay flags o si "info" contiene semántica experimental.

source: Set the flags specified by *flags* and unset all others.
es: Establece los flags especificados por *flags* y desactiva todas las demás.

source: Set the flag(s) specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character. The current "info" is overwritten whether or not it contains experimental information rather than flags.
es: Establece lo(s) flag(s) especificado(s) por *flags* sin cambiar otros flags. Para añadir más de un indicador a la vez, *flag* puede ser una cadena de más de un carácter. La "info" actual se sobrescribe si contiene o no información experimental en lugar de flags.

source: Unset the flag(s) specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* maybe a string of more than one character. If "info" contains experimental information rather than flags, the current "info" is not modified.
es: Deshabilita lo(s) flag(s) especificado(s) por *flag* sin cambiar otros flags. Para quitar más de un indicador a la vez, *flag* puede ser una cadena de más de un carácter. Si "info" contiene información experimental en lugar de flags, la "info" actual no se modifica.

source: Return the delivery date of the message as a floating-point number representing seconds since the epoch.
es: Retorna la fecha de entrega del mensaje como un número de punto flotante que representa los segundos desde la época.

source: Set the delivery date of the message to *date*, a floating-point number representing seconds since the epoch.
es: Establece la fecha de entrega del mensaje en *date*, un número de punto flotante que representa los segundos desde la época.

source: Return a string containing the "info" for a message. This is useful for accessing and modifying "info" that is experimental (i.e., not a list of flags).
es: Retorna una cadena que contiene la "info" de un mensaje. Esto es útil para acceder y modificar la "info" que es experimental (es decir, no una lista de flags).

source: Set "info" to *info*, which should be a string.
es: Establece "info" en *info*, que debería ser una cadena.

source: When a :class:`MaildirMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
es: Cuando se crea una instancia :class:`MaildirMessage` basada en una instancia :class:`mboxMessage` o :class:`MMDFMessage`, se omiten las cabeceras :mailheader:`Status` y :mailheader:`X-Status` y se producen las siguientes conversiones:

source: Resulting state
es: Estado resultante

source: :class:`mboxMessage` or :class:`MMDFMessage` state
es: Estado :class:`mboxMessage` o :class:`MMDFMessage`

source: "cur" subdirectory
es: subdirectorio "cur"

source: O flag
es: indicador O

source: F flag
es: indicador F

source: R flag
es: indicador R

source: A flag
es: indicador A

source: S flag
es: indicador S

source: T flag
es: indicador T

source: D flag
es: indicador D

source: When a :class:`MaildirMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`MaildirMessage` basada en una instancia :class:`MHMessage`, se producen las siguientes conversiones:

source: :class:`MHMessage` state
es: Estado :class:`MHMessage`

source: "unseen" sequence
es: Secuencia "*unseen*" (no vista)

source: "cur" subdirectory and S flag
es: subdirectorio "cur" e indicador S

source: no "unseen" sequence
es: no hay una secuencia "*unseen*" (invisible)

source: "flagged" sequence
es: secuencia "*flagged*" (marcada)

source: "replied" sequence
es: Secuencia "*replied*" (respondida)

source: When a :class:`MaildirMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`MaildirMessage` basada en una instancia :class:`BabylMessage`, se producen las siguientes conversiones:

source: :class:`BabylMessage` state
es: Estado :class:`BabylMessage`

source: "unseen" label
es: etiqueta "*unseen*" (invisible)

source: no "unseen" label
es: no hay una etiqueta "*unseen*" (invisible)

source: P flag
es: indicador P

source: "forwarded" or "resent" label
es: etiqueta "*forwarded*" o "*resent*" (reenviado)

source: "answered" label
es: etiqueta de "*answered*" (contestado)

source: "deleted" label
es: etiqueta "deleted" (borrado)

source: A message with mbox-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
es: Un mensaje con comportamientos específicos de mbox. El parámetro *message* tiene el mismo significado que con el constructor :class:`Message`.

source: Messages in an mbox mailbox are stored together in a single file. The sender's envelope address and the time of delivery are typically stored in a line beginning with "From " that is used to indicate the start of a message, though there is considerable variation in the exact format of this data among mbox implementations. Flags that indicate the state of the message, such as whether it has been read or marked as important, are typically stored in :mailheader:`Status` and :mailheader:`X-Status` headers.
es: Los mensajes en un buzón de correo de mbox se almacenan juntos en un solo archivo. La dirección del sobre del remitente y la hora de entrega se almacenan normalmente en una línea que comienza con "From" que se utiliza para indicar el comienzo de un mensaje, aunque hay una variación considerable en el formato exacto de estos datos entre las implementaciones de mbox. Los flags del estado del mensaje, como por ejemplo si ha sido leído o marcado como importante, se almacenan típicamente en las cabeceras :mailheader:`Status` y :mailheader:`X-Status`.

source: Conventional flags for mbox messages are as follows:
es: Los flags convencionales para los mensajes de mbox son los siguientes:

source: Old
es: Antiguo

source: Previously detected by MUA
es: Anteriormente detectado por MUA

source: Deleted
es: Borrado

source: Answered
es: Respondido

source: The "R" and "O" flags are stored in the :mailheader:`Status` header, and the "D", "F", and "A" flags are stored in the :mailheader:`X-Status` header. The flags and headers typically appear in the order mentioned.
es: Los flags "R" y "O" se almacenan en el encabezado :mailheader:`Status` y los flags "D", "F" y "A" se almacenan en el encabezado :mailheader:`X-Status`. Los flags y los encabezados aparecen típicamente en el orden mencionado.

source: :class:`mboxMessage` instances offer the following methods:
es: Instancias de :class:`mboxMessage` ofrecen los siguientes métodos:

source: Return a string representing the "From " line that marks the start of the message in an mbox mailbox. The leading "From " and the trailing newline are excluded.
es: Retorna una cadena que representa la línea "From" que marca el inicio del mensaje en un buzón de correo de mbox. El "From" inicial y la nueva línea final están excluidas.

source: Set the "From " line to *from_*, which should be specified without a leading "From " or trailing newline. For convenience, *time_* may be specified and will be formatted appropriately and appended to *from_*. If *time_* is specified, it should be a :class:`time.struct_time` instance, a tuple suitable for passing to :meth:`time.strftime`, or ``True`` (to use :meth:`time.gmtime`).
es: Ponga la línea "From" en *from_*, que debe ser especificada sin una línea "From" o una nueva línea posterior. Para mayor comodidad, se puede especificar *time_*, que se formateará adecuadamente y se añadirá a *from_*. Si se especifica *time_*, debe ser una instancia :class:`time.struct_time`, una tupla adecuada para pasar a :meth:`time.strftime`, o ``True`` (para usar :meth:`time.gmtime`).

source: Return a string specifying the flags that are currently set. If the message complies with the conventional format, the result is the concatenation in the following order of zero or one occurrence of each of ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.
es: Retorna una cadena que especifica los flags que están actualmente establecidos. Si el mensaje cumple con el formato convencional, el resultado es la concatenación en el siguiente orden de cero o una ocurrencia de cada uno de los flags `'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.

source: Set the flags specified by *flags* and unset all others. Parameter *flags* should be the concatenation in any order of zero or more occurrences of each of ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.
es: Establece los flags especificadas por *flags* y desactiva todos las demás. El parámetro *flags* debe ser la concatenación en cualquier orden de cero o más ocurrencias de cada uno de los flags ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.

source: Set the flag(s) specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character.
es: Establece lo(s) flag(s) especificado(s) por *flag* sin cambiar otros flags. Para añadir más de un indicador a la vez, *flag* puede ser una cadena de más de un carácter.

source: Unset the flag(s) specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* maybe a string of more than one character.
es: Deshabilita lo(s) flag(s) especificado(s) por *flag* sin cambiar otros flags. Para quitar más de un indicador a la vez, *flag* puede ser una cadena de más de un carácter.

source: When an :class:`mboxMessage` instance is created based upon a :class:`MaildirMessage` instance, a "From " line is generated based upon the :class:`MaildirMessage` instance's delivery date, and the following conversions take place:
es: Cuando se crea una instancia :class:`mboxMessage` basada en una instancia :class:`MaildirMessage`, se genera una línea "From " basada en la fecha de entrega de la instancia :class:`MaildirMessage`, y se realizan las siguientes conversiones:

source: :class:`MaildirMessage` state
es: Estado de :class:`MaildirMessage`

source: When an :class:`mboxMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`mboxMessage` basada en una instancia :class:`MHMessage`, se producen las siguientes conversiones:

source: R flag and O flag
es: indicador R e indicador O

source: When an :class:`mboxMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
es: Cuando se crea una instancia :class:`mboxMessage` basada en una instancia :class:`BabylMessage`, se producen las siguientes conversiones:

source: When a :class:`Message` instance is created based upon an :class:`MMDFMessage` instance, the "From " line is copied and all flags directly correspond:
es: Cuando se crea una instancia :class:`Message` basada en una instancia :class:`MMDFMessage`, la línea "From" se copia y todas los flags se corresponden directamente:

source: :class:`MMDFMessage` state
es: Estado de :class:`MMDFMessage`

source: A message with MH-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
es: Un mensaje con comportamientos específicos de la HM. El parámetro *message* tiene el mismo significado que con el constructor :class:`Message`.

source: MH messages do not support marks or flags in the traditional sense, but they do support sequences, which are logical groupings of arbitrary messages. Some mail reading programs (although not the standard :program:`mh` and :program:`nmh`) use sequences in much the same way flags are used with other formats, as follows:
es: Los mensajes de MH no soportan marcas o flags en el sentido tradicional, pero sí secuencias, que son agrupaciones lógicas de mensajes arbitrarios. Algunos programas de lectura de correo (aunque no los estándares :program:`mh` y :program:`nmh`) usan secuencias de manera muy similar a los flags que se usan con otros formatos, como sigue:

source: Sequence
es: Secuencia

source: unseen
es: *unseen* (no visto)

source: Not read, but previously detected by MUA
es: No leído, pero previamente detectado por la MUA

source: replied
es: *replied* (contestado)

source: flagged
es: *flagged* (marcado)

source: :class:`MHMessage` instances offer the following methods:
es: Instancias de :class:`MHMessage` ofrecen los siguientes métodos:
