Repository: python/python-docs-es
Catalog: library/marshal.po
Languages: es_ar

source: :mod:`marshal` --- Internal Python object serialization
es_ar: :mod:`marshal` --- Serialización interna de objetos Python

source: This module contains functions that can read and write Python values in a binary format. The format is specific to Python, but independent of machine architecture issues (e.g., you can write a Python value to a file on a PC, transport the file to a Sun, and read it back there). Details of the format are undocumented on purpose; it may change between Python versions (although it rarely does). [#]_
es_ar: Este módulo contiene funciones que pueden leer y escribir valores de Python en un formato binario. El formato es específico de Python, pero independiente de los problemas de arquitectura de la máquina (por ejemplo, puede escribir un valor de Python en un archivo en un PC, transportar el archivo a un Sun y leerlo allí). Los detalles del formato están indocumentados a propósito; pueden cambiar entre las versiones de Python (aunque rara vez lo hacen). [#]_

source: This is not a general "persistence" module. For general persistence and transfer of Python objects through RPC calls, see the modules :mod:`pickle` and :mod:`shelve`. The :mod:`marshal` module exists mainly to support reading and writing the "pseudo-compiled" code for Python modules of :file:`.pyc` files. Therefore, the Python maintainers reserve the right to modify the marshal format in backward incompatible ways should the need arise. If you're serializing and de-serializing Python objects, use the :mod:`pickle` module instead -- the performance is comparable, version independence is guaranteed, and pickle supports a substantially wider range of objects than marshal.
es_ar: Este no es un módulo general de "persistencia". Para la persistencia general y la transferencia de objetos Python a través de llamadas RPC, consulte los módulos :mod:`pickle` y :mod:`shelve`. El módulo :mod:`marshal` existe principalmente para admitir la lectura y escritura del código "pseudocompilado" para los módulos Python de archivos :file:`.pyc`. Por lo tanto, los mantenedores de Python se reservan el derecho de modificar el formato de cálculo de referencias de manera incompatible hacia atrás en caso de necesidad. Si va a serializar y deserializar objetos Python, utilice el módulo :mod:`pickle` en su lugar: el rendimiento es comparable, la independencia de la versión está garantizada y pickle admite una gama sustancialmente más amplia de objetos que marshal.

source: The :mod:`marshal` module is not intended to be secure against erroneous or maliciously constructed data. Never unmarshal data received from an untrusted or unauthenticated source.
es_ar: El módulo :mod:`marshal` no está destinado a ser seguro contra datos erróneos o construidos maliciosamente. Nunca deserializar con marshal los datos recibidos de una fuente no confiable o no autenticada.

source: Not all Python object types are supported; in general, only objects whose value is independent from a particular invocation of Python can be written and read by this module. The following types are supported: booleans, integers, floating point numbers, complex numbers, strings, bytes, bytearrays, tuples, lists, sets, frozensets, dictionaries, and code objects, where it should be understood that tuples, lists, sets, frozensets and dictionaries are only supported as long as the values contained therein are themselves supported. The singletons :const:`None`, :const:`Ellipsis` and :exc:`StopIteration` can also be marshalled and unmarshalled. For format *version* lower than 3, recursive lists, sets and dictionaries cannot be written (see below).
es_ar: No se admiten todos los tipos de objetos de Python; en general, este módulo solo puede escribir y leer objetos cuyo valor es independiente de una invocación concreta de Python. Se admiten los siguientes tipos: booleanos, enteros, números de punto flotante, números complejos, cadenas de caracteres, bytes, arrays de bytes (bytearray), tuplas, listas, conjuntos (set y frozenset), diccionarios y objetos de código, donde se debe entender que las tuplas, listas, conjuntos y diccionarios solo se admiten siempre que se admitan los valores contenidos en ellos mismos. Los singletons :const:`None`, :const:`Ellipsis` y :exc:`StopIteration` también pueden ser marshalled y unmarshalled. Para el formato *versión* inferior a 3, no se pueden escribir listas, conjuntos ni diccionarios recursivos (véase más adelante).

source: There are functions that read/write files as well as functions operating on bytes-like objects.
es_ar: Hay funciones que leen/escriben archivos, así como funciones que operan en objetos similares a bytes.

source: The module defines these functions:
es_ar: El módulo define estas funciones:

source: Write the value on the open file. The value must be a supported type. The file must be a writeable :term:`binary file`.
es_ar: Escribe el valor en el archivo abierto. El valor debe ser un tipo admitido. El archivo debe ser un archivo :term:`binary file` en el que se pueda escribir.

source: If the value has (or contains an object that has) an unsupported type, a :exc:`ValueError` exception is raised --- but garbage data will also be written to the file. The object will not be properly read back by :func:`load`.
es_ar: Si el valor tiene (o contiene un objeto que tiene) un tipo no admitido, se produce una excepción :exc:`ValueError` --- pero los datos no utilizados también se escribirán en el archivo. El objeto no será leído correctamente por :func:`load`.

source: The *version* argument indicates the data format that ``dump`` should use (see below).
es_ar: El argumento *version* indica el formato de datos que ``dump`` debe usar (véase más adelante).

source: Raises an :ref:`auditing event <auditing>` ``marshal.dumps`` with arguments ``value``, ``version``.
es_ar: Lanza un :ref:`evento de auditoría <auditing>` ``marshal.dumps`` con argumentos ``value``, ``version``.

source: Read one value from the open file and return it. If no valid value is read (e.g. because the data has a different Python version's incompatible marshal format), raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. The file must be a readable :term:`binary file`.
es_ar: Lee un valor del archivo abierto y lo retorna. Si no se lee ningún valor válido (por ejemplo, porque los datos tienen un formato de cálculo de referencias incompatible de una versión de Python diferente), lanza una excepción :exc:`EOFError`, :exc:`ValueError` o :exc:`TypeError`. El archivo debe ser un :term:`binary file` habilitado para lectura.

source: Raises an :ref:`auditing event <auditing>` ``marshal.load`` with no arguments.
es_ar: Lanza un :ref:`evento de auditoría <auditing>` ``marshal.load`` sin argumentos.

source: If an object containing an unsupported type was marshalled with :func:`dump`, :func:`load` will substitute ``None`` for the unmarshallable type.
es_ar: Si un objeto que contiene un tipo no admitido se calcula con :func:`dump`, :func:`load` sustituirá ``None`` por el tipo "unmarshallable".

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.load`` event for the entire load operation.
es_ar: Esta llamada solía lanzar un evento de auditoría ``code.__new__`` para cada objeto código. Ahora lanza un único evento ``marshal.load`` para toda la operación de carga.

source: Return the bytes object that would be written to a file by ``dump(value, file)``. The value must be a supported type. Raise a :exc:`ValueError` exception if value has (or contains an object that has) an unsupported type.
es_ar: Retorna el objeto bytes que se escribiría en un archivo mediante ``dump(value, file)``. El valor debe ser un tipo admitido. Lanza una excepción :exc:`ValueError` si ``value`` tiene (o contiene un objeto que tiene) un tipo no admitido.

source: The *version* argument indicates the data format that ``dumps`` should use (see below).
es_ar: El argumento *version* indica el formato de datos que ``dumps`` debe usar (véase más adelante).

source: Convert the :term:`bytes-like object` to a value. If no valid value is found, raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. Extra bytes in the input are ignored.
es_ar: Convierte el objeto :term:`bytes-like object` en un valor. Si no se encuentra ningún valor válido, lanza una excepción :exc:`EOFError`, :exc:`ValueError` o :exc:`TypeError`. Se omiten los bytes adicionales de la entrada.

source: Raises an :ref:`auditing event <auditing>` ``marshal.loads`` with argument ``bytes``.
es_ar: Lanza un :ref:`evento de auditoría <auditing>` ``marshal.loads`` con argumento ``bytes``.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.loads`` event for the entire load operation.
es_ar: Esta llamada solía lanzar un evento de auditoría ``code.__new__`` para cada objeto código. Ahora lanza un único evento ``marshal.loads`` para toda la operación de carga.

source: In addition, the following constants are defined:
es_ar: Además, se definen las siguientes constantes:

source: Indicates the format that the module uses. Version 0 is the historical format, version 1 shares interned strings and version 2 uses a binary format for floating point numbers. Version 3 adds support for object instancing and recursion. The current version is 4.
es_ar: Indica el formato que utiliza el módulo. La versión 0 es el formato histórico, la versión 1 comparte cadenas internadas y la versión 2 utiliza un formato binario para los números de punto flotante. La versión 3 agrega compatibilidad con la creación de instancias de objetos y la recursividad. La versión actual es 4.

source: Footnotes
es_ar: Notas al pie

source: The name of this module stems from a bit of terminology used by the designers of Modula-3 (amongst others), who use the term "marshalling" for shipping of data around in a self-contained form. Strictly speaking, "to marshal" means to convert some data from internal to external form (in an RPC buffer for instance) and "unmarshalling" for the reverse process.
es_ar: El nombre de este módulo proviene de algunos términos utilizados por los diseñadores de Modula-3 (entre otros), que utilizan el término "marshalling" para el envío de datos de forma auto-contenida. Estrictamente hablando "marshalling", significa convertir algunos datos internos en un formato externo (por ejemplo, en un búfer RPC) y "unmarshalling" es el proceso inverso.
