Repository: python/python-docs-es
Catalog: library/math.po
Languages: es_es

source: :mod:`math` --- Mathematical functions
es_es: :mod:`math` --- Funciones matemáticas

source: This module provides access to the mathematical functions defined by the C standard.
es_es: Este módulo proporciona acceso a las funciones matemáticas definidas en el estándar de C.

source: These functions cannot be used with complex numbers; use the functions of the same name from the :mod:`cmath` module if you require support for complex numbers. The distinction between functions which support complex numbers and those which don't is made since most users do not want to learn quite as much mathematics as required to understand complex numbers. Receiving an exception instead of a complex result allows earlier detection of the unexpected complex number used as a parameter, so that the programmer can determine how and why it was generated in the first place.
es_es: Estas funciones no pueden ser usadas con números complejos; usa las funciones con el mismo nombre del módulo :mod:`cmath` si requieres soporte para números complejos. La distinción entre las funciones que admiten números complejos y las que no se hace debido a que la mayoría de los usuarios no quieren aprender tantas matemáticas como se requiere para comprender los números complejos. Recibir una excepción en lugar de un resultado complejo permite la detección temprana del número complejo inesperado utilizado como parámetro, de modo que el programador pueda determinar cómo y porqué se generó en primer lugar.

source: The following functions are provided by this module. Except when explicitly noted otherwise, all return values are floats.
es_es: Este módulo proporciona las funciones descritas a continuación. Excepto cuando se indique lo contrario explícitamente, todos los valores retornados son flotantes.

source: Number-theoretic and representation functions
es_es: Teoría de números y funciones de representación

source: Return the ceiling of *x*, the smallest integer greater than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__ceil__ <object.__ceil__>`, which should return an :class:`~numbers.Integral` value.
es_es: Retorna el "techo" de *x*, el número entero más pequeño que es mayor o igual que *x*. Si *x* no es un flotante, delega en :meth:`x.__ceil__ <object.__ceil__>`, que debería retornar un valor :class:`~numbers.Integral`.

source: Return the number of ways to choose *k* items from *n* items without repetition and without order.
es_es: Retorna el número de formas posibles de elegir *k* elementos de *n*, de forma ordenada y sin repetición.

source: Evaluates to ``n! / (k! * (n - k)!)`` when ``k <= n`` and evaluates to zero when ``k > n``.
es_es: Se evalúa como ``n! / (k! * (n - k)!)`` cuando ``k <= n`` y como cero cuando ``k > n``.

source: Also called the binomial coefficient because it is equivalent to the coefficient of k-th term in polynomial expansion of ``(1 + x)ⁿ``.
es_es: También llamado coeficiente binomial porque es equivalente al coeficiente del k-ésimo término en la expansión polinomial de ``(1 + x)ⁿ``.

source: Raises :exc:`TypeError` if either of the arguments are not integers. Raises :exc:`ValueError` if either of the arguments are negative.
es_es: Lanza una excepción :exc:`TypeError` si alguno de los argumentos no es un entero. Lanza una excepción :exc:`ValueError` si alguno de los argumentos es negativo.

source: Return a float with the magnitude (absolute value) of *x* but the sign of *y*. On platforms that support signed zeros, ``copysign(1.0, -0.0)`` returns *-1.0*.
es_es: Retorna un flotante con la magnitud (valor absoluto) de *x* pero el signo de *y*. En plataformas que admiten ceros con signo, ``copysign(1.0, -0.0)`` retorna *-1.0*.

source: Return the absolute value of *x*.
es_es: Retorna el valor absoluto de *x*.

source: Return *n* factorial as an integer. Raises :exc:`ValueError` if *n* is not integral or is negative.
es_es: Retorna el factorial de *n* como un número entero. Lanza una excepción :exc:`ValueError` si *n* no es un entero o negativo.

source: Accepting floats with integral values (like ``5.0``) is deprecated.
es_es: Aceptar flotantes con valores integrales (como ``5.0``) está obsoleto.

source: Return the floor of *x*, the largest integer less than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__floor__ <object.__floor__>`, which should return an :class:`~numbers.Integral` value.
es_es: Retorna el "suelo" de *x*, el primer número entero menor o igual que *x*. Si *x* no es un flotante, delega en :meth:`x.__floor__ <object.__floor__>`, que debería retornar un valor :class:`~numbers.Integral`.

source: Return ``fmod(x, y)``, as defined by the platform C library. Note that the Python expression ``x % y`` may not return the same result. The intent of the C standard is that ``fmod(x, y)`` be exactly (mathematically; to infinite precision) equal to ``x - n*y`` for some integer *n* such that the result has the same sign as *x* and magnitude less than ``abs(y)``. Python's ``x % y`` returns a result with the sign of *y* instead, and may not be exactly computable for float arguments. For example, ``fmod(-1e-100, 1e100)`` is ``-1e-100``, but the result of Python's ``-1e-100 % 1e100`` is ``1e100-1e-100``, which cannot be represented exactly as a float, and rounds to the surprising ``1e100``. For this reason, function :func:`fmod` is generally preferred when working with floats, while Python's ``x % y`` is preferred when working with integers.
es_es: Retorna ``fmod(x, y)``, tal como se define en la biblioteca de C de la plataforma. Ten en cuenta que la expresión ``x % y`` de Python puede no retornar el mismo resultado. La intención del estándar de C es que ``fmod(x, y)`` sea exactamente (matemáticamente; con precisión infinita) igual a ``x - n*y`` para algún número entero *n* tal que el resultado tenga el mismo signo que *x* y magnitud menor que ``abs(y)``. La expresión ``x % y`` de Python retorna un resultado con el signo de *y* en su lugar, y es posible que no pueda calcularse con exactitud para argumentos flotantes. Por ejemplo, ``fmod(-1e-100, 1e100)`` es ``-1e-100``, pero el resultado de ``-1e-100 % 1e100`` en Python es ``1e100-1e-100``, que no se puede representar exactamente como un flotante, y se redondea sorprendentemente a ``1e100``. Por esta razón, generalmente se prefiere la función :func:`fmod` cuando se trabaja con flotantes, mientras que se prefiere el uso de ``x % y`` de Python cuando se trabaja con enteros.

source: Return the mantissa and exponent of *x* as the pair ``(m, e)``. *m* is a float and *e* is an integer such that ``x == m * 2**e`` exactly. If *x* is zero, returns ``(0.0, 0)``, otherwise ``0.5 <= abs(m) < 1``. This is used to "pick apart" the internal representation of a float in a portable way.
es_es: Retorna la mantisa y el exponente de *x* como el par ``(m, e)``. *m* es un flotante y *e* es un número entero tal que ``x == m * 2**e`` exactamente. Si *x* es cero, retorna ``(0.0, 0)``, y retorna ``0.5 <= abs(m) < 1`` en caso contrario. Se utiliza como una forma portable de "extraer" la representación interna de un flotante.

source: Return an accurate floating point sum of values in the iterable. Avoids loss of precision by tracking multiple intermediate partial sums.
es_es: Retorna una suma precisa en coma flotante de los valores de un iterable. Evita la pérdida de precisión mediante el seguimiento de múltiples sumas parciales intermedias.

source: The algorithm's accuracy depends on IEEE-754 arithmetic guarantees and the typical case where the rounding mode is half-even. On some non-Windows builds, the underlying C library uses extended precision addition and may occasionally double-round an intermediate sum causing it to be off in its least significant bit.
es_es: La precisión del algoritmo depende de las garantías aritméticas de IEEE-754 y del caso típico en el que se usa el "medio redondo a par" (half-even) como método de redondeo. En algunas compilaciones que no son de Windows, la biblioteca de C subyacente utiliza la adición de precisión extendida y, ocasionalmente, puede realizar un doble redondeo en una suma intermedia, haciendo que el bit menos significativo tome el valor incorrecto.

source: For further discussion and two alternative approaches, see the `ASPN cookbook recipes for accurate floating point summation <https://code.activestate.com/recipes/393090/>`_\.
es_es: Para una discusión más amplia y dos enfoques alternativos, consultar `ASPN cookbook recipes for accurate floating point summation <https://code.activestate.com/recipes/393090/>`_\.

source: Return the greatest common divisor of the specified integer arguments. If any of the arguments is nonzero, then the returned value is the largest positive integer that is a divisor of all arguments. If all arguments are zero, then the returned value is ``0``. ``gcd()`` without arguments returns ``0``.
es_es: Retorna el máximo común divisor de los argumentos enteros. Si cualquiera de los argumentos no es cero, entonces el valor retornado es el entero positivo más grande que divide a todos los argumentos. Si todos los argumentos son cero, entonces el valor retornado es ``0``. ``gcd()`` sin argumentos retorna ``0``.

source: Added support for an arbitrary number of arguments. Formerly, only two arguments were supported.
es_es: Agregado soporte para un número arbitrario de argumentos. Anteriormente sólo se soportaba dos argumentos.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
es_es: Retorna ``True`` si los valores *a* y *b* están cerca el uno del otro y ``False`` en caso contrario.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
es_es: Que dos valores se consideren cercanos o no, se determina de acuerdo con las tolerancias absolutas y relativas dadas.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
es_es: *rel_tol* es la tolerancia relativa: esta es la diferencia máxima permitida entre *a* y *b*, en relación con el valor absoluto mayor de *a* o *b*. Por ejemplo, para establecer una tolerancia del 5%, pasa ``rel_tol=0.05``. La tolerancia predeterminada es ``1e-09``, lo que garantiza que los dos valores sean iguales considerando 9 dígitos decimales aproximadamente. *rel_tol* debe ser mayor que cero.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
es_es: *abs_tol* es la tolerancia absoluta mínima, útil para las comparaciones cercanas a cero. *abs_tol* debe valer al menos cero.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
es_es: Si no se encuentran errores, el resultado será: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
es_es: Los valores especiales de IEEE 754 ``NaN``, ``inf`` e ``-inf`` se manejarán de acuerdo con las reglas del IEEE. Concretamente, ``NaN`` no se considera cercano a ningún otro valor, incluido ``NaN``. Por su parte, ``inf`` e ``-inf`` solo se consideran cercanos a sí mismos.

source: :pep:`485` -- A function for testing approximate equality
es_es: :pep:`485` -- Una función para comprobar la igualdad aproximada

source: Return ``True`` if *x* is neither an infinity nor a NaN, and ``False`` otherwise. (Note that ``0.0`` *is* considered finite.)
es_es: Retorna ``True`` si *x* no es infinito ni NaN, o ``False`` en caso contrario. (Ten en cuenta que ``0.0`` *es* considerado finito.)

source: Return ``True`` if *x* is a positive or negative infinity, and ``False`` otherwise.
es_es: Retorna ``True`` si *x* es infinito positivo o negativo, o ``False`` en caso contrario.

source: Return ``True`` if *x* is a NaN (not a number), and ``False`` otherwise.
es_es: Retorna ``True`` si *x* es NaN (not a number, en español: no es un número), o ``False`` en caso contrario.

source: Return the integer square root of the nonnegative integer *n*. This is the floor of the exact square root of *n*, or equivalently the greatest integer *a* such that *a*\ ² |nbsp| ≤ |nbsp| *n*.
es_es: Retorna la raíz cuadrada del número entero no negativo *n*. Es el resultado de aplicar la función suelo al valor exacto de la raíz cuadrada de *n*, o de forma equivalente, el mayor entero *a* tal que *a*\ ² |nbsp| ≤ |nbsp| *n*.

source: For some applications, it may be more convenient to have the least integer *a* such that *n* |nbsp| ≤ |nbsp| *a*\ ², or in other words the ceiling of the exact square root of *n*. For positive *n*, this can be computed using ``a = 1 + isqrt(n - 1)``.
es_es: Para algunas aplicaciones, puede ser más conveniente tener el menor número entero *a* tal que *n* |nbsp| ≤ |nbsp| *a*\ ², en otras palabras, el resultado de aplicar la función techo a la raíz cuadrada exacta de *n*. Para *n* positivo, esto se puede calcular usando ``a = 1 + isqrt(n - 1)``.

source: Return the least common multiple of the specified integer arguments. If all arguments are nonzero, then the returned value is the smallest positive integer that is a multiple of all arguments. If any of the arguments is zero, then the returned value is ``0``. ``lcm()`` without arguments returns ``1``.
es_es: Retorna el mínimo común múltiplo de los argumentos enteros. Si todos los argumentos no son cero, entonces el valor retornado es el entero positivo más pequeño que es un múltiplo de todos los argumentos. Si cualquiera de los argumentos es cero, entonces el valor retornado es ``0``. ``lcm()`` sin argumentos retorna ``1``.

source: Return ``x * (2**i)``. This is essentially the inverse of function :func:`frexp`.
es_es: Retorna ``x * (2**i)``. Esta es esencialmente la función inversa de :func:`frexp`.

source: Return the fractional and integer parts of *x*. Both results carry the sign of *x* and are floats.
es_es: Retorna la parte fraccionaria y entera de *x*. Ambos resultados son flotantes y tienen el mismo signo que *x* .

source: Return the floating-point value *steps* steps after *x* towards *y*.
es_es: Retorna el valor en coma flotante *steps* pasos después *x* hacia *y*.

source: If *x* is equal to *y*, return *y*, unless *steps* is zero.
es_es: Si *x* es igual a *y*, retorna *y*, a menos que *steps* sea cero.

source: Examples:
es_es: Ejemplos:

source: ``math.nextafter(x, math.inf)`` goes up: towards positive infinity.
es_es: ``math.nextafter(x, math.inf)`` va hacia el infinito positivo.

source: ``math.nextafter(x, -math.inf)`` goes down: towards minus infinity.
es_es: ``math.nextafter(x, -math.inf)`` va hacia el infinito negativo.

source: ``math.nextafter(x, 0.0)`` goes towards zero.
es_es: ``math.nextafter(x, 0.0)`` va hacia cero.

source: ``math.nextafter(x, math.copysign(math.inf, x))`` goes away from zero.
es_es: ``math.nextafter(x, math.copysign(math.inf, x))`` se aleja de cero.

source: See also :func:`math.ulp`.
es_es: Ver también :func:`math.ulp`.

source: Added the *steps* argument.
es_es: Añadido el argumento *steps*.

source: Return the number of ways to choose *k* items from *n* items without repetition and with order.
es_es: Retorna el número de formas posibles de elegir *k* elementos de *n* elementos, sin repetición y en orden.

source: Evaluates to ``n! / (n - k)!`` when ``k <= n`` and evaluates to zero when ``k > n``.
es_es: Se evalúa como ``n! / (n - k)!`` cuando ``k <= n`` y como cero cuando ``k > n``.

source: If *k* is not specified or is None, then *k* defaults to *n* and the function returns ``n!``.
es_es: Si *k* no se especifica o es None, *k* será igual a *n* por defecto y la función retornará ``n!``.

source: Calculate the product of all the elements in the input *iterable*. The default *start* value for the product is ``1``.
es_es: Calcula el producto de todos los elementos en la entrada *iterable*. El valor *start* predeterminado para el producto es ``1``.

source: When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
es_es: Cuando el iterable está vacío, retorna el valor inicial. Esta función está diseñada específicamente para su uso con valores numéricos y puede rechazar tipos no numéricos.

source: Return the IEEE 754-style remainder of *x* with respect to *y*. For finite *x* and finite nonzero *y*, this is the difference ``x - n*y``, where ``n`` is the closest integer to the exact value of the quotient ``x / y``. If ``x / y`` is exactly halfway between two consecutive integers, the nearest *even* integer is used for ``n``. The remainder ``r = remainder(x, y)`` thus always satisfies ``abs(r) <= 0.5 * abs(y)``.
es_es: Retorna el resto o residuo según la norma IEEE 754 de *x* con respecto a *y*. Para un valor *x* finito y un valor *y* finito distinto de cero, es la diferencia ``x - n * y``, donde ``n`` es el número entero más cercano al valor exacto del cociente ``x / y``. Si ``x / y`` está exactamente en mitad de dos enteros consecutivos, el entero *par* más cercano se utiliza para ``n``. Por lo tanto, el residuo ``r = remainder(x, y)`` siempre satisface ``abs(r) <= 0.5 * abs(y)``.

source: Special cases follow IEEE 754: in particular, ``remainder(x, math.inf)`` is *x* for any finite *x*, and ``remainder(x, 0)`` and ``remainder(math.inf, x)`` raise :exc:`ValueError` for any non-NaN *x*. If the result of the remainder operation is zero, that zero will have the same sign as *x*.
es_es: Los casos especiales siguen el estándar IEEE 754: en particular, ``remainder(x, math.inf)`` es *x* para todo *x* finito, y ``remainder(x, 0)`` junto a ``remainder(math.inf, x)`` lanzan una excepción :exc:`ValueError` para todo *x* que no sea NaN. Si el resultado de la operación residuo es cero, este cero tendrá el mismo signo que *x*.

source: On platforms using IEEE 754 binary floating-point, the result of this operation is always exactly representable: no rounding error is introduced.
es_es: En plataformas que utilizan la norma IEEE 754 para números en coma flotante binarios, el resultado de esta operación siempre es exactamente representable: no se introduce ningún error de redondeo.

source: Return the sum of products of values from two iterables *p* and *q*.
es_es: Retorna la suma de productos de valores de dos iterables *p* y *q*.

source: Raises :exc:`ValueError` if the inputs do not have the same length.
es_es: Lanza :exc:`ValueError` si las entradas no tienen la misma longitud.

source: Roughly equivalent to::
es_es: Aproximadamente equivalente a::

source: For float and mixed int/float inputs, the intermediate products and sums are computed with extended precision.
es_es: Para entradas flotantes y mixtas int/float, los productos intermedios y las sumas se calculan con precisión ampliada.

source: Return *x* with the fractional part removed, leaving the integer part. This rounds toward 0: ``trunc()`` is equivalent to :func:`floor` for positive *x*, and equivalent to :func:`ceil` for negative *x*. If *x* is not a float, delegates to :meth:`x.__trunc__ <object.__trunc__>`, which should return an :class:`~numbers.Integral` value.
es_es: Retorna *x* con la parte fraccionaria eliminada, dejando la parte entera.Esto redondea hacia 0: ``trunc()`` es equivalente a :func:`floor` para *x* positivo y equivalente a :func:`ceil` para *x* negativo. Si *x* no es un flotante, delega a :meth:`x.__trunc__ <object.__trunc__>`, que debería retornar un valor :class:`~numbers.Integral`.

source: Return the value of the least significant bit of the float *x*:
es_es: Retorna el valor del bit menos significativo del flotante *x*:

source: If *x* is a NaN (not a number), return *x*.
es_es: Si *x* es un NaN (*not a number*), retorna *x*.

source: If *x* is negative, return ``ulp(-x)``.
es_es: Si *x* es negativo, retorna ``ulp(-x)``.

source: If *x* is a positive infinity, return *x*.
es_es: Si *x* es un infinito positivo, retorna *x*.

source: If *x* is equal to zero, return the smallest positive *denormalized* representable float (smaller than the minimum positive *normalized* float, :data:`sys.float_info.min <sys.float_info>`).
es_es: Si *x* es igual a cero, retorna el flotante representable *desnormalizado* positivo más pequeño (menor que el flotante *normalizado* positivo mínimo, :data:`sys.float_info.min <sys.float_info>`).

source: If *x* is equal to the largest positive representable float, return the value of the least significant bit of *x*, such that the first float smaller than *x* is ``x - ulp(x)``.
es_es: Si *x* es igual al flotante representable positivo más pequeño, retorna el bit menos significativo de *x*, de tal manera que el primer flotante menor que *x* es ``x - ulp(x)``.

source: Otherwise (*x* is a positive finite number), return the value of the least significant bit of *x*, such that the first float bigger than *x* is ``x + ulp(x)``.
es_es: De lo contrario (*x* es un número finito positivo), retorna el valor del bit menos significativo de *x* , de tal forma que el primer flotante mayor a *x* es ``x + ulp(x)``.

source: ULP stands for "Unit in the Last Place".
es_es: ULP significa *Unit in the Last Place* (unidad en el último lugar).

source: See also :func:`math.nextafter` and :data:`sys.float_info.epsilon <sys.float_info>`.
es_es: Ver también :func:`math.nextafter` y :data:`sys.float_info.epsilon <sys.float_info>`.

source: Note that :func:`frexp` and :func:`modf` have a different call/return pattern than their C equivalents: they take a single argument and return a pair of values, rather than returning their second return value through an 'output parameter' (there is no such thing in Python).
es_es: Ten en cuenta que :func:`frexp` y :func:`modf` tienen un patrón de llamada/retorno diferente al de sus equivalentes en C: toman un solo argumento y retornan un par de valores, en lugar de retornar su segundo valor de retorno a través de un `parámetro de salida` (no existe tal cosa en Python).

source: For the :func:`ceil`, :func:`floor`, and :func:`modf` functions, note that *all* floating-point numbers of sufficiently large magnitude are exact integers. Python floats typically carry no more than 53 bits of precision (the same as the platform C double type), in which case any float *x* with ``abs(x) >= 2**52`` necessarily has no fractional bits.
es_es: Para las funciones :func:`ceil`, :func:`floor` y :func:`modf`, ten en cuenta que *todos* los números de coma flotante de magnitud suficientemente grande son enteros exactos. Los flotantes de Python normalmente no tienen más de 53 bits de precisión (lo mismo que el tipo double de C en la plataforma), en cuyo caso cualquier flotante *x* con ``abs(x) >= 2**52`` no necesariamente tiene bits fraccionarios.

source: Power and logarithmic functions
es_es: Funciones logarítmicas y exponenciales

source: Return the cube root of *x*.
es_es: Retorna la raíz cúbica de *x*.

source: Return *e* raised to the power *x*, where *e* = 2.718281... is the base of natural logarithms. This is usually more accurate than ``math.e ** x`` or ``pow(math.e, x)``.
es_es: Retorna *e* elevado a la *x* potencia, dónde *e* = 2.718281... es la base de los logaritmos naturales. Esto generalmente es más preciso que ``math.e ** x`` o ``pow(math.e, x)``.

source: Return *2* raised to the power *x*.
es_es: Retorna *2* elevado a la potencia *x*.
