Repository: python/python-docs-es
Catalog: library/math.po
Languages: es_es

source: Return *e* raised to the power *x*, minus 1. Here *e* is the base of natural logarithms. For small floats *x*, the subtraction in ``exp(x) - 1`` can result in a `significant loss of precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; the :func:`expm1` function provides a way to compute this quantity to full precision:
es_es: Retorna *e* elevado a la *x* potencia, menos 1. Aquí *e* es la base de los logaritmos naturales. Para flotantes *x* pequeños, la resta en ``exp(x) - 1`` puede resultar en una `pérdida significativa de precisión <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; la función :func:`expm1` proporciona una forma de calcular este valor con una precisión total:

source: With one argument, return the natural logarithm of *x* (to base *e*).
es_es: Con un argumento, retorna el logaritmo natural de *x* (en base *e*).

source: With two arguments, return the logarithm of *x* to the given *base*, calculated as ``log(x)/log(base)``.
es_es: Con dos argumentos, retorna el logaritmo de *x* en la *base* dada, calculado como ``log(x)/log(base)``.

source: Return the natural logarithm of *1+x* (base *e*). The result is calculated in a way which is accurate for *x* near zero.
es_es: Retorna el logaritmo natural de *1+x* (base *e*). El resultado se calcula de forma precisa para *x* cercano a cero.

source: Return the base-2 logarithm of *x*. This is usually more accurate than ``log(x, 2)``.
es_es: Retorna el logaritmo en base 2 de *x*. Esto suele ser más preciso que ``log(x, 2)``.

source: :meth:`int.bit_length` returns the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros.
es_es: :meth:`int.bit_length` retorna el número de bits necesarios para representar un entero en binario, excluyendo el signo y los ceros iniciales.

source: Return the base-10 logarithm of *x*. This is usually more accurate than ``log(x, 10)``.
es_es: Retorna el logaritmo en base 10 de *x*. Esto suele ser más preciso que ``log(x, 10)``.

source: Return ``x`` raised to the power ``y``. Exceptional cases follow the IEEE 754 standard as far as possible. In particular, ``pow(1.0, x)`` and ``pow(x, 0.0)`` always return ``1.0``, even when ``x`` is a zero or a NaN. If both ``x`` and ``y`` are finite, ``x`` is negative, and ``y`` is not an integer then ``pow(x, y)`` is undefined, and raises :exc:`ValueError`.
es_es: Retorna ``x`` elevado a la potencia ``y``. Los casos excepcionales siguen el estándar IEEE 754 en la medida de lo posible. En particular, ``pow(1.0, x)`` y ``pow(x, 0.0)`` siempre retornan ``1.0``, incluso cuando ``x`` es cero o NaN. Si tanto ``x`` como ``y`` son finitos, ``x`` es negativo e ``y`` no es un número entero, entonces ``pow(x, y)`` no está definido y se lanza una excepción :exc:`ValueError`.

source: Unlike the built-in ``**`` operator, :func:`math.pow` converts both its arguments to type :class:`float`. Use ``**`` or the built-in :func:`pow` function for computing exact integer powers.
es_es: A diferencia del operador incorporado ``**``, :func:`math.pow` convierte ambos argumentos al tipo :class:`float`. Utiliza ``**`` o la función incorporada :func:`pow` para calcular potencias enteras exactas.

source: The special cases ``pow(0.0, -inf)`` and ``pow(-0.0, -inf)`` were changed to return ``inf`` instead of raising :exc:`ValueError`, for consistency with IEEE 754.
es_es: Los casos especiales ``pow(0.0, -inf)`` y ``pow(-0.0, -inf)`` se cambiaron para devolver ``inf`` en lugar de generar :exc:`ValueError`, por consistencia con IEEE 754.

source: Return the square root of *x*.
es_es: Retorna la raíz cuadrada de *x*.

source: Trigonometric functions
es_es: Funciones trigonométricas

source: Return the arc cosine of *x*, in radians. The result is between ``0`` and ``pi``.
es_es: Retorna el arcocoseno de *x*, en radianes. El resultado está entre ``0`` y ``pi``.

source: Return the arc sine of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
es_es: Retorna el arcoseno de *x*, en radianes. El resultado está entre ``-pi/2`` y ``pi/2``.

source: Return the arc tangent of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
es_es: Retorna la arcotangente de *x*, en radianes. El resultado está entre ``-pi/2`` y ``pi/2``.

source: Return ``atan(y / x)``, in radians. The result is between ``-pi`` and ``pi``. The vector in the plane from the origin to point ``(x, y)`` makes this angle with the positive X axis. The point of :func:`atan2` is that the signs of both inputs are known to it, so it can compute the correct quadrant for the angle. For example, ``atan(1)`` and ``atan2(1, 1)`` are both ``pi/4``, but ``atan2(-1, -1)`` is ``-3*pi/4``.
es_es: Retorna ``atan(y / x)``, en radianes. El resultado está entre ``-pi`` y ``pi``. El vector del plano que va del origen al punto ``(x, y)``, forma este ángulo con el eje X positivo. La ventaja de :func:`atan2` es que el signo de ambas entradas es conocido, por lo que se puede calcular el cuadrante correcto para el ángulo. Por ejemplo, ``atan(1)`` y ``atan2(1, 1)`` son ambas ``pi/4``, pero ``atan2(-1, -1)`` es ``-3*pi/4``.

source: Return the cosine of *x* radians.
es_es: Retorna el coseno de *x* radianes.

source: Return the Euclidean distance between two points *p* and *q*, each given as a sequence (or iterable) of coordinates. The two points must have the same dimension.
es_es: Retorna la distancia euclidiana entre dos puntos *p* y *q*, cada uno de ellos dado como una secuencia (o iterable) de coordenadas. Los dos puntos deben tener la misma dimensión.

source: Return the Euclidean norm, ``sqrt(sum(x**2 for x in coordinates))``. This is the length of the vector from the origin to the point given by the coordinates.
es_es: Retorna la norma euclidiana, ``sqrt(sum(x**2 for x in coordinates))``. Esta es la longitud del vector que va desde el origen hasta el punto dado por las coordenadas.

source: For a two dimensional point ``(x, y)``, this is equivalent to computing the hypotenuse of a right triangle using the Pythagorean theorem, ``sqrt(x*x + y*y)``.
es_es: Para un punto bidimensional ``(x, y)``, esto equivale a calcular la hipotenusa de un triángulo rectángulo usando el teorema de Pitágoras, ``sqrt(x*x + y*y)``.

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
es_es: Agregado soporte para puntos n-dimensionales. Anteriormente, solo se admitía el caso bidimensional.

source: Improved the algorithm's accuracy so that the maximum error is under 1 ulp (unit in the last place). More typically, the result is almost always correctly rounded to within 1/2 ulp.
es_es: Se mejoró la precisión del algoritmo para que el error máximo sea inferior a 1 ulp (unidad en último lugar). Más típicamente, el resultado casi siempre se redondea correctamente dentro de 1/2 ulp.

source: Return the sine of *x* radians.
es_es: Retorna el seno de *x* radianes.

source: Return the tangent of *x* radians.
es_es: Retorna la tangente de *x* radianes.

source: Angular conversion
es_es: Conversión angular

source: Convert angle *x* from radians to degrees.
es_es: Convierte el ángulo *x* de radianes a grados.

source: Convert angle *x* from degrees to radians.
es_es: Convierte el ángulo *x* de grados a radianes.

source: Hyperbolic functions
es_es: Funciones hiperbólicas

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
es_es: `Las funciones hiperbólicas <https://es.wikipedia.org/wiki/Funci%C3%B3n_hiperb%C3%B3lica>`_ son análogas a las funciones trigonométricas que están basadas en hipérbolas en lugar de círculos.

source: Return the inverse hyperbolic cosine of *x*.
es_es: Retorna el coseno hiperbólico inverso de *x*.

source: Return the inverse hyperbolic sine of *x*.
es_es: Retorna el seno hiperbólico inverso de *x*.

source: Return the inverse hyperbolic tangent of *x*.
es_es: Retorna la tangente hiperbólica inversa de *x*.

source: Return the hyperbolic cosine of *x*.
es_es: Retorna el coseno hiperbólico de *x*.

source: Return the hyperbolic sine of *x*.
es_es: Retorna el seno hiperbólico de *x*.

source: Return the hyperbolic tangent of *x*.
es_es: Retorna la tangente hiperbólica de *x*.

source: Special functions
es_es: Funciones especiales

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
es_es: Retorna la `función error <https://es.wikipedia.org/wiki/Funci%C3%B3n_error>`_ en *x*.

source: The :func:`erf` function can be used to compute traditional statistical functions such as the `cumulative standard normal distribution <https://en.wikipedia.org/wiki/Normal_distribution#Cumulative_distribution_functions>`_::
es_es: La función :func:`erf` se puede utilizar para calcular funciones estadísticas tradicionales como la `distribución normal estándar acumulativa <https://es.wikipedia.org/wiki/Distribuci%C3%B3n_normal#Definici%C3%B3n_formal>`_::

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
es_es: Retorna la función error complementaria en *x*. La `función error complementaria <https://es.wikipedia.org/wiki/Funci%C3%B3n_error>`_ se define como ``1.0 - erf(x)``. Se usa para valores grandes de *x* donde una resta de 1 causaría una `pérdida de presición <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
es_es: Retorna la `función gamma <https://es.wikipedia.org/wiki/Funci%C3%B3n_gamma>`_ en *x*.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
es_es: Retorna el logaritmo natural del valor absoluto de la función gamma en *x*.

source: Constants
es_es: Constantes

source: The mathematical constant *π* = 3.141592..., to available precision.
es_es: La constante matemática *π* = 3.141592..., hasta la precisión disponible.

source: The mathematical constant *e* = 2.718281..., to available precision.
es_es: La constante matemática *e* = 2.718281..., hasta la precisión disponible.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
es_es: La constante matemática *τ* = 6.283185..., hasta la precisión disponible. Tau es una constante del círculo igual a 2\ *π*, la razón entre la circunferencia de un círculo y su radio. Para obtener más información sobre Tau, consulta el video de Vi Hart, `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, y comienza a celebrar el `el día de Tau <https://tauday.com/>`_ ¡comiendo el doble de tarta!

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
es_es: Un valor infinito positivo en punto flotante. (Para un valor infinito negativo, usa ``-math.inf``.) Equivalente a la salida de ``float('inf')``.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``. Due to the requirements of the `IEEE-754 standard <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` and ``float('nan')`` are not considered to equal to any other numeric value, including themselves. To check whether a number is a NaN, use the :func:`isnan` function to test for NaNs instead of ``is`` or ``==``. Example:
es_es: Un valor de coma flotante "no es un número" (NaN). Equivalente a la salida de ``float('nan')``. Debido a los requisitos del `estándar IEEE-754 <https://es.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` y ``float('nan')`` no se consideran iguales a ningún otro valor numérico, incluidos ellos mismos. Para verificar si un número es NaN, use la función :func:`isnan` para probar NaN en lugar de ``is`` o ``==``. Ejemplo:

source: It is now always available.
es_es: Ahora está siempre disponible.

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
es_es: El módulo :mod:`math` consiste principalmente en delgados envoltorios alrededor de las funciones matemáticas de la biblioteca de C de la plataforma. El comportamiento en casos excepcionales sigue el Anexo F del estándar C99 cuando corresponda. La implementación actual lanzará un :exc:`ValueError` para operaciones no válidas como ``sqrt(-1.0)`` o ``log(0.0)`` (donde el estándar C99 recomienda señalar que la operación no es válida o que hay división entre cero), y un :exc:`OverflowError` para aquellos resultados de desbordamiento (por ejemplo, ``exp(1000.0)``). No se retornará NaN para ninguna de las funciones anteriores, a no ser que al menos uno de los argumentos de la función sea NaN. En este caso, la mayoría de las funciones retornan NaN, pero de nuevo (de acuerdo con el apéndice F del estándar C99) hay algunas excepciones a esta regla, por ejemplo ``pow(float('nan'), 0.0)`` o ``hypot(float('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
es_es: Ten en cuenta que Python no hace ningún esfuerzo por distinguir los NaN de señalización de los NaN silenciosos, y el comportamiento de señalización de los NaN permanece sin especificar. El comportamiento estándar es tratar a todos los NaN como silenciosos.

source: Module :mod:`cmath`
es_es: Módulo :mod:`cmath`

source: Complex number versions of many of these functions.
es_es: Versiones de muchas de estas funciones para números complejos.
