Repository: python/python-docs-es
Catalog: library/netrc.po
Languages: es_es

source: :mod:`netrc` --- netrc file processing
es_es: :mod:`netrc` --- procesado del fichero netrc

source: **Source code:** :source:`Lib/netrc.py`
es_es: **Código fuente:** :source:`Lib/netrc.py`

source: The :class:`~netrc.netrc` class parses and encapsulates the netrc file format used by the Unix :program:`ftp` program and other FTP clients.
es_es: La clase :class:`~netrc.netrc` analiza y encapsula el formato del fichero netrc, usado por el programa Unix :program:`ftp` y otros clientes FTP.

source: A :class:`~netrc.netrc` instance or subclass instance encapsulates data from a netrc file. The initialization argument, if present, specifies the file to parse. If no argument is given, the file :file:`.netrc` in the user's home directory -- as determined by :func:`os.path.expanduser` -- will be read. Otherwise, a :exc:`FileNotFoundError` exception will be raised. Parse errors will raise :exc:`NetrcParseError` with diagnostic information including the file name, line number, and terminating token. If no argument is specified on a POSIX system, the presence of passwords in the :file:`.netrc` file will raise a :exc:`NetrcParseError` if the file ownership or permissions are insecure (owned by a user other than the user running the process, or accessible for read or write by any other user). This implements security behavior equivalent to that of ftp and other programs that use :file:`.netrc`.
es_es: Una instancia de :class:`~netrc.netrc` o una instancia de una subclase encapsula la información del fichero netrc. El argumento de inicialización, si está presente, especifica el fichero a analizar. Si no se pasan argumentos, se leerá el fichero :file:`.netrc` del directorio home del usuario -- determinado por :func:`os.path.expanduser`. De lo contrario, se lanzará una excepción :exc:`FileNotFoundError`. Los errores de análisis lanzarán una excepción :exc:`NetrcParseError` con información de diagnóstico que incluye nombre del fichero, número de línea y token de finalización. Si no se especifica ningún argumento en un sistema POSIX, la presencia de contraseñas en el fichero :file:`.netrc` lanzará una excepción :exc:`NetrcParseError` si la propiedad del fichero o los permisos son inseguros (el propietario del fichero es distinto del usuario que ejecuta el proceso, o puede ser leído o escrito por cualquier otro usuario). Esto implementa un nivel de seguridad equivalente al de ftp y otros programas que usan :file:`.netrc`.

source: Added the POSIX permission check.
es_es: Añadida la comprobación de permisos POSIX.

source: :func:`os.path.expanduser` is used to find the location of the :file:`.netrc` file when *file* is not passed as argument.
es_es: :func:`os.path.expanduser` se usa para encontrar la localización del fichero :file:`.netrc` cuando *file* no se pasa como argumento.

source: :class:`netrc` try UTF-8 encoding before using locale specific encoding. The entry in the netrc file no longer needs to contain all tokens. The missing tokens' value default to an empty string. All the tokens and their values now can contain arbitrary characters, like whitespace and non-ASCII characters. If the login name is anonymous, it won't trigger the security check.
es_es: :class:`netrc` prueba la codificación UTF-8 antes de usar la codificación específica en la configuración regional. Ya no es necesario que la entrada en el archivo netrc contenga todos los tokens. El valor predeterminado para los tokens faltantes es una cadena de caracteres vacía. Todos los tokens y sus valores ahora pueden contener caracteres arbitrarios, como espacios en blanco y caracteres no ASCII. Si el nombre de login es anónimo, no se disparará el chequeo de seguridad.

source: Exception raised by the :class:`~netrc.netrc` class when syntactical errors are encountered in source text. Instances of this exception provide three interesting attributes:
es_es: Excepción lanzada por la clase :class:`~netrc.netrc` cuando se encuentran errores sintácticos en el texto origen. Las instancias de esta excepción ofrecen tres atributos interesantes:

source: Textual explanation of the error.
es_es: Explicación textual del error.

source: The name of the source file.
es_es: El nombre del archivo fuente.

source: The line number on which the error was found.
es_es: El número de línea donde se encontró el error.

source: netrc Objects
es_es: Objetos netrc

source: A :class:`~netrc.netrc` instance has the following methods:
es_es: Una instancia :class:`~netrc.netrc` tiene los siguientes métodos:

source: Return a 3-tuple ``(login, account, password)`` of authenticators for *host*. If the netrc file did not contain an entry for the given host, return the tuple associated with the 'default' entry. If neither matching host nor default entry is available, return ``None``.
es_es: Retorna una 3-tupla ``(login, account, password)`` para autenticarse contra *host*. Si el fichero netrc no contiene una entrada para el host dado, retorna una tupla asociada con la entrada por defecto. Si no están disponibles ni el host correspondiente ni la entrada por defecto, retorna ``None``.

source: Dump the class data as a string in the format of a netrc file. (This discards comments and may reorder the entries.)
es_es: Vuelca los datos de la clase como una cadena de caracteres en el formato de un fichero netrc. (Esto descarta comentarios y puede reordenar las entradas.)

source: Instances of :class:`~netrc.netrc` have public instance variables:
es_es: Las instancias de :class:`~netrc.netrc` tienen variables de instancia públicas:

source: Dictionary mapping host names to ``(login, account, password)`` tuples. The 'default' entry, if any, is represented as a pseudo-host by that name.
es_es: Diccionario que asocia nombres de hosts a tuplas ``(login, account, password)``. La entrada por defecto, si existe, está representada como un pseudo-host por ese nombre.

source: Dictionary mapping macro names to string lists.
es_es: Diccionario que asocia nombres de macros a listas de cadenas de caracteres.
