Repository: python/python-docs-es
Catalog: library/nntplib.po
Languages: es

source: Send a ``HELP`` command. Return a pair ``(response, list)`` where *list* is a list of help strings.
es: Envía un comando ``HELP``. Retorna un par ``(response, list)`` donde *list* es una lista de cadenas de caracteres de ayuda.

source: Send a ``STAT`` command, where *message_spec* is either a message id (enclosed in ``'<'`` and ``'>'``) or an article number in the current group. If *message_spec* is omitted or :const:`None`, the current article in the current group is considered. Return a triple ``(response, number, id)`` where *number* is the article number and *id* is the message id.
es: Envía un comando ``STAT``, donde *message_spec* es un identificador de mensaje (incluido en ``'<'`` y ``'>'``) o un número de artículo en el grupo actual. Si se omite *message_spec* o es :const:`None` se considera el artículo actual del grupo actual. Retorna un triple ``(response, number, id)`` donde *number* es el número de artículo e *id* es el identificador del mensaje.

source: Send a ``NEXT`` command. Return as for :meth:`.stat`.
es: Envía un comando ``NEXT``. Retorna como para :meth:`.stat`.

source: Send a ``LAST`` command. Return as for :meth:`.stat`.
es: Envía un comando ``LAST``. Retorna como para :meth:`.stat`.

source: Send an ``ARTICLE`` command, where *message_spec* has the same meaning as for :meth:`.stat`. Return a tuple ``(response, info)`` where *info* is a :class:`~collections.namedtuple` with three attributes *number*, *message_id* and *lines* (in that order). *number* is the article number in the group (or 0 if the information is not available), *message_id* the message id as a string, and *lines* a list of lines (without terminating newlines) comprising the raw message including headers and body.
es: Envía un comando ``ARTICLE``, donde *message_spec* tiene el mismo significado que para :meth:`.stat`. Retorna una tupla ``(response, info)`` donde *info* es un :class:`~collections.namedtuple` con tres atributos *number*, *message_id* y *lines* (en ese orden). *number* es el número de artículo del grupo (o 0 si la información no está disponible), *message_id* el identificador del mensaje como una cadena y *lines* una lista de líneas (sin terminar líneas nuevas) que comprende el mensaje sin procesar, incluidos los encabezados y el cuerpo.

source: Same as :meth:`article()`, but sends a ``HEAD`` command. The *lines* returned (or written to *file*) will only contain the message headers, not the body.
es: Igual que :meth:`article()`, pero envía un comando ``HEAD``. Las *lines* retornadas (o escritas a *file*) solo contendrán los encabezados del mensaje, no el cuerpo.

source: Same as :meth:`article()`, but sends a ``BODY`` command. The *lines* returned (or written to *file*) will only contain the message body, not the headers.
es: Igual que :meth:`article()`, pero envía un comando ``BODY``. Las *lines* retornadas (o escritas a *file*) solo contendrán los encabezados del mensaje, no el cuerpo.

source: Post an article using the ``POST`` command. The *data* argument is either a :term:`file object` opened for binary reading, or any iterable of bytes objects (representing raw lines of the article to be posted). It should represent a well-formed news article, including the required headers. The :meth:`post` method automatically escapes lines beginning with ``.`` and appends the termination line.
es: Publica un artículo utilizando el comando ``POST``. El argumento *data* es un :term:`file object` abierto para la lectura binaria o cualquier iterable de objetos bytes (que representa las líneas sin procesar del artículo que se va a publicar). Debe representar un artículo de noticias bien formado, incluidos los encabezados requeridos. El método :meth:`post` escapa automáticamente las líneas que comienzan con ``.`` y añade la línea de terminación.

source: If the method succeeds, the server's response is returned. If the server refuses posting, a :class:`NNTPReplyError` is raised.
es: Si el método tiene éxito, se retorna la respuesta del servidor. Si el servidor se niega a publicarlo, se genera un :class:`NNTPReplyError`.

source: Send an ``IHAVE`` command. *message_id* is the id of the message to send to the server (enclosed in ``'<'`` and ``'>'``). The *data* parameter and the return value are the same as for :meth:`post()`.
es: Envía un comando ``IHAVE``. *message_id* es el identificador del mensaje que se enviará al servidor (incluido entre ``'<'`` y ``'>'``). El parámetro *data* y el valor de retorno son los mismos que para :meth:`post()`.

source: Return a pair ``(response, date)``. *date* is a :class:`~datetime.datetime` object containing the current date and time of the server.
es: Retorna un par ``(response, date)``. *date* es un objeto :class:`~datetime.datetime` que contiene la fecha y hora actuales del servidor.

source: Send a ``SLAVE`` command. Return the server's *response*.
es: Envía un comando ``SLAVE``. Retorna la *response* del servidor.

source: Set the instance's debugging level. This controls the amount of debugging output printed. The default, ``0``, produces no debugging output. A value of ``1`` produces a moderate amount of debugging output, generally a single line per request or response. A value of ``2`` or higher produces the maximum amount of debugging output, logging each line sent and received on the connection (including message text).
es: Establece el nivel de depuración de la instancia. Esto controla la cantidad de salida de depuración impresa. El valor por defecto, ``0``, no produce salida de depuración. Un valor de ``1`` produce una cantidad moderada de salida de depuración, generalmente una sola línea por solicitud o por respuesta. Un valor de ``2`` o superior produce la cantidad máxima de salida de depuración, registrando cada línea enviada y recibida en la conexión (incluyendo el texto del mensaje).

source: The following are optional NNTP extensions defined in :rfc:`2980`. Some of them have been superseded by newer commands in :rfc:`3977`.
es: Las siguientes son extensiones NNTP opcionales definidas en :rfc:`2980`. Algunas de ellas han sido reemplazados por comandos más nuevos en :rfc:`3977`.

source: Send an ``XHDR`` command. The *hdr* argument is a header keyword, e.g. ``'subject'``. The *str* argument should have the form ``'first-last'`` where *first* and *last* are the first and last article numbers to search. Return a pair ``(response, list)``, where *list* is a list of pairs ``(id, text)``, where *id* is an article number (as a string) and *text* is the text of the requested header for that article. If the *file* parameter is supplied, then the output of the ``XHDR`` command is stored in a file. If *file* is a string, then the method will open a file with that name, write to it then close it. If *file* is a :term:`file object`, then it will start calling :meth:`write` on it to store the lines of the command output. If *file* is supplied, then the returned *list* is an empty list.
es: Envía un comando ``XHDR``. El argumento *hdr* es una palabra clave de encabezado, por ejemplo ``'subject'``. El argumento *str* debe tener la forma ``'first-last'`` donde *first* y *last* son el primer y último número de artículo para buscar. Retorna un par ``(response, list)``, donde *list* es una lista de pares ``(id, text)``, donde *id* es un número de artículo (como una cadena) y *text* es el texto del encabezado solicitado para ese artículo. Si se proporciona el parámetro *file*, entonces la salida del comando ``XHDR`` se almacena en un archivo. Si *file* es una cadena, entonces el método abrirá un archivo con ese nombre, que escribirá en él y luego lo cerrará. Si *file* es un :term:`file object`, entonces comenzará invocando :meth:`write` en él para almacenar las líneas de la salida del comando. Si se proporciona *file*, entonces retorna *list* o una lista vacía.

source: Send an ``XOVER`` command. *start* and *end* are article numbers delimiting the range of articles to select. The return value is the same of for :meth:`over()`. It is recommended to use :meth:`over()` instead, since it will automatically use the newer ``OVER`` command if available.
es: Envía un comando ``XOVER``. *start* and *end* son números de artículo que delimitan el rango de artículos a seleccionar. El valor de retorno es el mismo que para :meth:`over()`. Se recomienda usar :meth:`over()` en su lugar, ya que se usará automáticamente el comando más nuevo ``OVER`` si está disponible.

source: Utility functions
es: Funciones de utilidad

source: The module also defines the following utility function:
es: El módulo también define la siguiente función de utilidad:

source: Decode a header value, un-escaping any escaped non-ASCII characters. *header_str* must be a :class:`str` object. The unescaped value is returned. Using this function is recommended to display some headers in a human readable form::
es: Decodifica un valor de encabezado, eliminando los caracteres de escape que no sean ASCII. *header_str* debe ser un objeto :class:`str`. Se retorna el valor sin escape. Se recomienda utilizar esta función para mostrar algunos encabezados en una forma legible por humanos::
