Repository: python/python-docs-es
Catalog: library/nntplib.po
Languages: es

source: :mod:`nntplib` --- NNTP protocol client
es: :mod:`nntplib` — Protocolo de cliente NNTP

source: **Source code:** :source:`Lib/nntplib.py`
es: **Código fuente:** :source:`Lib/nntplib.py`

source: The :mod:`nntplib` module is deprecated (see :pep:`594` for details).
es: El módulo :mod:`nntplib` está en desuso (ver :pep:`594` para más detalles).

source: This module defines the class :class:`NNTP` which implements the client side of the Network News Transfer Protocol. It can be used to implement a news reader or poster, or automated news processors. It is compatible with :rfc:`3977` as well as the older :rfc:`977` and :rfc:`2980`.
es: Este módulo define la clase :class:`NNTP` que implementa el lado del cliente del Protocolo de transferencia de noticias por red. Se puede utilizar para implementar un lector o póster de noticias, o procesadores de noticias automatizados. Es compatible con :rfc:`3977` así como con los antiguos :rfc:`977` y :rfc:`2980`.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para obtener más información.

source: Here are two small examples of how it can be used. To list some statistics about a newsgroup and print the subjects of the last 10 articles::
es: Aquí hay dos pequeños ejemplos de cómo se puede utilizar. Para enumerar algunas estadísticas sobre un grupo de noticias e imprimir los temas de los últimos 10 artículos::

source: To post an article from a binary file (this assumes that the article has valid headers, and that you have right to post on the particular newsgroup)::
es: Para publicar un artículo desde un archivo binario (esto supone que el artículo tiene encabezados válidos y que tienes permitido publicar en el grupo de noticias en particular)::

source: The module itself defines the following classes:
es: El módulo en sí define las siguientes clases:

source: Return a new :class:`NNTP` object, representing a connection to the NNTP server running on host *host*, listening at port *port*. An optional *timeout* can be specified for the socket connection. If the optional *user* and *password* are provided, or if suitable credentials are present in :file:`/.netrc` and the optional flag *usenetrc* is true, the ``AUTHINFO USER`` and ``AUTHINFO PASS`` commands are used to identify and authenticate the user to the server. If the optional flag *readermode* is true, then a ``mode reader`` command is sent before authentication is performed. Reader mode is sometimes necessary if you are connecting to an NNTP server on the local machine and intend to call reader-specific commands, such as ``group``. If you get unexpected :exc:`NNTPPermanentError`\ s, you might need to set *readermode*. The :class:`NNTP` class supports the :keyword:`with` statement to unconditionally consume :exc:`OSError` exceptions and to close the NNTP connection when done, e.g.:
es: Retorna un nuevo objeto :class:`NNTP` que representa una conexión con el servidor NNTP ejecutándose en el host *host*, escuchando en el puerto *port*. Se puede especificar un *timeout* opcional para la conexión de socket. Si se proporcionan las credenciales opcionales *user* y *password*, o si hay credenciales adecuadas en :file:`/.netrc` y el indicador opcional *usenetrc* es verdadero, los comandos ``AUTHINFO USER`` y ``AUTHINFO PASS`` se utilizan para identificar y autenticar al usuario en el servidor. Si el indicador opcional *readermode* es verdadero, se envía un comando ``mode reader`` antes de que se realice la autenticación. El modo de lector a veces es necesario si se conecta a un servidor NNTP en el equipo local y tiene la intención de llamar a comandos específicos del lector, como ``group``. Si obtienes un valor inesperado :exc:`NNTPPermanentError`, es posible que debas establecer *readermode*. La clase :class:`NNTP` admite la instrucción :keyword:`with` para consumir incondicionalmente las excepciones :exc:`OSError` y para cerrar la conexión NNTP cuando haya terminado, e.g.:

source: Raises an :ref:`auditing event <auditing>` ``nntplib.connect`` with arguments ``self``, ``host``, ``port``.
es: Genera un :ref:`evento de auditoría <auditing>` ``nntplib.connect`` con los argumentos ``self``, ``host``, ``port``.

source: Raises an :ref:`auditing event <auditing>` ``nntplib.putline`` with arguments ``self``, ``line``.
es: Genera un :ref:`evento de auditoría <auditing>` ``nntplib.putline`` con los argumentos ``self``, ``line``.

source: All commands will raise an :ref:`auditing event <auditing>` ``nntplib.putline`` with arguments ``self`` and ``line``, where ``line`` is the bytes about to be sent to the remote host.
es: Todos los comandos generarán un :ref:`evento de auditoría <auditing>` ``nntplib.putline`` con los argumentos ``self`` y ``line``, donde ``line`` es los bytes a punto de ser enviados al host remoto.

source: *usenetrc* is now ``False`` by default.
es: *usenetrc* es ahora ``False`` por defecto.

source: Support for the :keyword:`with` statement was added.
es: El soporte para la declaración :keyword:`with` fue añadido.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket.
es: Si el parámetro *timeout* se establece en cero, lanzará un :class:`ValueError` para evitar la creación de un socket sin bloqueo.

source: Return a new :class:`NNTP_SSL` object, representing an encrypted connection to the NNTP server running on host *host*, listening at port *port*. :class:`NNTP_SSL` objects have the same methods as :class:`NNTP` objects. If *port* is omitted, port 563 (NNTPS) is used. *ssl_context* is also optional, and is a :class:`~ssl.SSLContext` object. Please read :ref:`ssl-security` for best practices. All other parameters behave the same as for :class:`NNTP`.
es: Retorna un nuevo objeto :class:`NNTP_SSL`, que representa una conexión cifrada con el servidor NNTP ejecutándose en el host *host*, escuchando en el puerto *port*. Los objetos :class:`NNTP_SSL` tienen los mismos métodos que los objetos :class:`NNTP`. Si se omite el *port* se utiliza el puerto 563 (NNTPS). *ssl_context* también es opcional, y también el objeto :class:`~ssl.SSLContext`. Por favor, lea :ref:`ssl-security` para conocer las buenas prácticas. Todos los demás parámetros se comportan igual que para :class:`NNTP`.

source: Note that SSL-on-563 is discouraged per :rfc:`4642`, in favor of STARTTLS as described below. However, some servers only support the former.
es: Tenga en cuenta que SSL-on-563 no es recomendado por :rfc:`4642`, en favor de STARTTLS como se describe abajo. Sin embargo, algunos servidores solo admiten el primero.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
es: La clase ahora admite la verificación del nombre de host con :attr:`ssl.SSLContext.check_hostname` e *Indicador del nombre del servidor* (SNI por sus siglas en inglés, consulte :data:`ssl.HAS_SNI`).

source: Derived from the standard exception :exc:`Exception`, this is the base class for all exceptions raised by the :mod:`nntplib` module. Instances of this class have the following attribute:
es: Derivado de la excepción estándar :exc:`Exception`, esta es la clase base para todas las excepciones generadas por el módulo :mod:`nntplib`. Las instancias de esta clase tienen el siguiente atributo:

source: The response of the server if available, as a :class:`str` object.
es: La respuesta del servidor, si está disponible, como un objeto :class:`str`.

source: Exception raised when an unexpected reply is received from the server.
es: Excepción generada cuando se recibe una respuesta inesperada del servidor.

source: Exception raised when a response code in the range 400--499 is received.
es: Excepción generada cuando se recibe un código de respuesta dentro del rango del 400--499.

source: Exception raised when a response code in the range 500--599 is received.
es: Excepción generada cuando se recibe un código de respuesta dentro del rango del 500--599.

source: Exception raised when a reply is received from the server that does not begin with a digit in the range 1--5.
es: Excepción generada cuando se recibe una respuesta del servidor que no comienza con un dígito dentro del rango 1--5.

source: Exception raised when there is some error in the response data.
es: Excepción generada cuando hay algún error en los datos de la respuesta.

source: NNTP Objects
es: Objetos NNTP

source: When connected, :class:`NNTP` and :class:`NNTP_SSL` objects support the following methods and attributes.
es: Cuando están conectados, los objetos :class:`NNTP` y :class:`NNTP_SSL` admiten los siguientes métodos y atributos.

source: Attributes
es: Atributos

source: An integer representing the version of the NNTP protocol supported by the server. In practice, this should be ``2`` for servers advertising :rfc:`3977` compliance and ``1`` for others.
es: Un entero que representa la versión del protocolo NNTP compatible con el servidor. En la práctica, esto debería ser ``2`` para los servidores que anuncian el cumplimiento :rfc:`3977` y ``1`` para otros.

source: A string describing the software name and version of the NNTP server, or :const:`None` if not advertised by the server.
es: Cadena que describe el nombre de software y la versión del servidor NNTP, o :const:`None` si el servidor no lo anuncia.

source: Methods
es: Métodos

source: The *response* that is returned as the first item in the return tuple of almost all methods is the server's response: a string beginning with a three-digit code. If the server's response indicates an error, the method raises one of the above exceptions.
es: La *response* que es retornada como el primer elemento de la tupla de retorno de casi todos los métodos es la respuesta del servidor: una cadena que comienza con un código de tres dígitos. Si la respuesta del servidor indica un error, el método genera una de las excepciones anteriores.

source: Many of the following methods take an optional keyword-only argument *file*. When the *file* argument is supplied, it must be either a :term:`file object` opened for binary writing, or the name of an on-disk file to be written to. The method will then write any data returned by the server (except for the response line and the terminating dot) to the file; any list of lines, tuples or objects that the method normally returns will be empty.
es: Muchos de los métodos siguientes toman un argumento opcional de solamente palabra clave *file*. Cuando se proporciona el argumento *file*, debe ser un :term:`file object` abierto para la escritura binaria o el nombre de un archivo en disco a ser escrito. El método escribirá los datos retornados por el servidor (excepto la línea de respuesta y el punto de terminación) en el archivo; cualquier lista de líneas, tuplas u objetos que el método retorna normalmente estará vacía.

source: Many of the following methods have been reworked and fixed, which makes them incompatible with their 3.1 counterparts.
es: Muchos de los siguientes métodos se han rediseñado y corregido, lo que los hace incompatibles con sus contrapartes 3.1.

source: Send a ``QUIT`` command and close the connection. Once this method has been called, no other methods of the NNTP object should be called.
es: Envía un comando ``QUIT`` y cierra la conexión. Una vez que se ha invocado este método, no se debe invocar ningún otro método del objeto NNTP.

source: Return the welcome message sent by the server in reply to the initial connection. (This message sometimes contains disclaimers or help information that may be relevant to the user.)
es: Retorna el mensaje de bienvenida enviado por el servidor en respuesta a la conexión inicial. (Este mensaje a veces contiene aclaraciones o información de ayuda que puede ser relevante para el usuario.)

source: Return the :rfc:`3977` capabilities advertised by the server, as a :class:`dict` instance mapping capability names to (possibly empty) lists of values. On legacy servers which don't understand the ``CAPABILITIES`` command, an empty dictionary is returned instead.
es: Retorna las capacidades :rfc:`3977` anunciadas por el servidor, como una instancia :class:`dict` mapeando nombres de capacidades a listas de valores (posiblemente vacías). En los servidores heredados que no entienden el comando ``CAPABILITIES``, se retorna un diccionario vacío en su lugar.

source: Send ``AUTHINFO`` commands with the user name and password. If *user* and *password* are ``None`` and *usenetrc* is true, credentials from ``~/.netrc`` will be used if possible.
es: Envía comandos ``AUTHINFO`` con el nombre de usuario y la contraseña. Si *user* y *password* son ``None`` y *usenetrc* es verdadero, se utilizarán las credenciales de ``~/.netrc`` si su uso es posible.

source: Unless intentionally delayed, login is normally performed during the :class:`NNTP` object initialization and separately calling this function is unnecessary. To force authentication to be delayed, you must not set *user* or *password* when creating the object, and must set *usenetrc* to False.
es: A menos que se retrase intencionalmente, el inicio de sesión se realiza normalmente durante la inicialización del objeto :class:`NNTP` y no es necesario invocar esta función por separado. Para forzar el retraso de la autenticación, no debes establecer *user* o *password* al crear el objeto y debes establecer *usenetrc* en *False*.

source: Send a ``STARTTLS`` command. This will enable encryption on the NNTP connection. The *context* argument is optional and should be a :class:`ssl.SSLContext` object. Please read :ref:`ssl-security` for best practices.
es: Envía un comando ``STARTTLS``. Esto habilitará el cifrado en la conexión NNTP. El argumento *context* es opcional y debe ser el objeto :class:`ssl. SSLContext`. Por favor lea :ref:`ssl-security` para conocer las buenas prácticas.

source: Note that this may not be done after authentication information has been transmitted, and authentication occurs by default if possible during a :class:`NNTP` object initialization. See :meth:`NNTP.login` for information on suppressing this behavior.
es: Tenga en cuenta que esto no se puede hacer después de que se haya transmitido la información de autenticación y la autenticación se produce de forma predeterminada, si es posible, durante la inicialización de un objeto :class:`NNTP`. Consulte :meth:`NNTP.login` para obtener información sobre cómo suprimir este comportamiento.

source: The method now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
es: El método ahora admite la comprobación del nombre de host con :attr:`ssl. SSLContext.check_hostname` y *Indicador del nombre del servidor* (SNI por sus siglas en inglés, consulte :data:`ssl.HAS_SNI`).

source: Send a ``NEWGROUPS`` command. The *date* argument should be a :class:`datetime.date` or :class:`datetime.datetime` object. Return a pair ``(response, groups)`` where *groups* is a list representing the groups that are new since the given *date*. If *file* is supplied, though, then *groups* will be empty.
es: Envía un comando ``NEWGROUPS``. El argumento *date* debe ser un objeto :class:`datetime.date` o :class:`datetime.datetime`. Retorna un par ``(response, groups)`` donde *groups* es una lista que representa los grupos que son nuevos desde la fecha determinada. Sin embargo, si se proporciona *file*, entonces *groups* estará vacío.

source: Send a ``NEWNEWS`` command. Here, *group* is a group name or ``'*'``, and *date* has the same meaning as for :meth:`newgroups`. Return a pair ``(response, articles)`` where *articles* is a list of message ids.
es: Envía un comando ``NEWNEWS``. Aquí, *group* es un nombre de grupo o ``'*'``, y *date* tiene el mismo significado que para :meth:`newgroups`. Retorna un par ``(response, articles)`` donde *articles* es una lista de identificadores de mensaje.

source: This command is frequently disabled by NNTP server administrators.
es: Este comando es inhabilitado frecuentemente por los administradores del servidor NNTP.

source: Send a ``LIST`` or ``LIST ACTIVE`` command. Return a pair ``(response, list)`` where *list* is a list of tuples representing all the groups available from this NNTP server, optionally matching the pattern string *group_pattern*. Each tuple has the form ``(group, last, first, flag)``, where *group* is a group name, *last* and *first* are the last and first article numbers, and *flag* usually takes one of these values:
es: Envía un comando ``LIST`` o ``LIST ACTIVE``. Retorna un par ``(response, list)`` donde *list* es una lista de tuplas que representan todos los grupos disponibles desde este servidor NNTP, opcionalmente coincidiendo con el patrón de cadena *group_pattern*. Cada tupla tiene el formato ``(group, last, first, flag)``, donde *group* es un nombre de grupo, *last* y *first* son los últimos y primeros números de artículo, y *flag* suele tomar uno de estos valores:

source: ``y``: Local postings and articles from peers are allowed.
es: ``y``: Se permiten publicaciones locales y artículos de pares.

source: ``m``: The group is moderated and all postings must be approved.
es: ``m``: El grupo está moderado y todas las publicaciones deben ser aprobadas.

source: ``n``: No local postings are allowed, only articles from peers.
es: ``n``: No se permiten publicaciones locales, solo artículos de pares.

source: ``j``: Articles from peers are filed in the junk group instead.
es: ``j``: Los artículos de pares se archivan en el grupo de basura en su lugar.

source: ``x``: No local postings, and articles from peers are ignored.
es: ``x``: No hay publicaciones locales y los artículos de pares son ignorados.

source: ``=foo.bar``: Articles are filed in the ``foo.bar`` group instead.
es: ``=foo.bar``: Los artículos se archivan en el grupo ``foo.bar`` en su lugar.

source: If *flag* has another value, then the status of the newsgroup should be considered unknown.
es: Si *flag* tiene otro valor, el estado del grupo de noticias debe considerarse como desconocido.

source: This command can return very large results, especially if *group_pattern* is not specified. It is best to cache the results offline unless you really need to refresh them.
es: Este comando puede retornar resultados muy grandes, especialmente si no se especifica *group_pattern*. Es mejor almacenar en caché los resultados sin conexión a menos que realmente necesite actualizarlos.

source: *group_pattern* was added.
es: *group_pattern* fue añadido.

source: Send a ``LIST NEWSGROUPS`` command, where *grouppattern* is a wildmat string as specified in :rfc:`3977` (it's essentially the same as DOS or UNIX shell wildcard strings). Return a pair ``(response, descriptions)``, where *descriptions* is a dictionary mapping group names to textual descriptions.
es: Envía un comando ``LIST NEWSGROUPS``, donde *grouppattern* es una cadena comodín como se especifica en :rfc:`3977` (es esencialmente lo mismo que las cadenas comodín de shell DOS o UNIX). Retorna un par ``(response, descriptions)``, donde *descriptions* es un diccionario que asigna nombres de grupos a descripciones textuales.

source: Get a description for a single group *group*. If more than one group matches (if 'group' is a real wildmat string), return the first match. If no group matches, return an empty string.
es: Obtiene una descripción para un único grupo *group*. Si más de un grupo coincide (si *'group'* es una cadena comodín real), retorna la primera coincidencia. Si ningún grupo coincide, retorna una cadena vacía.

source: This elides the response code from the server. If the response code is needed, use :meth:`descriptions`.
es: Esto elude el código de respuesta del servidor. Si necesita el código de respuesta, use :meth:`descriptions`.

source: Send a ``GROUP`` command, where *name* is the group name. The group is selected as the current group, if it exists. Return a tuple ``(response, count, first, last, name)`` where *count* is the (estimated) number of articles in the group, *first* is the first article number in the group, *last* is the last article number in the group, and *name* is the group name.
es: Envía un comando ``GROUP``, donde *name* es el nombre del grupo. El grupo se selecciona como el grupo actual, si este existe. Retorna una tupla ``(response, count, first, last, name)`` donde *count* es el número (estimado) de artículos en el grupo, *first* es el primer número de artículo del grupo, *last* es el último número de artículo en el grupo y *name* es el nombre del grupo.

source: Send an ``OVER`` command, or an ``XOVER`` command on legacy servers. *message_spec* can be either a string representing a message id, or a ``(first, last)`` tuple of numbers indicating a range of articles in the current group, or a ``(first, None)`` tuple indicating a range of articles starting from *first* to the last article in the current group, or :const:`None` to select the current article in the current group.
es: Envía un comando ``OVER`` o un comando ``XOVER`` en servidores heredados. *message_spec* puede ser una cadena que represente un identificador de mensaje o una tupla de números ``(first, None)`` que indique un rango de artículos en el grupo actual, o una tupla ``(first, None)`` que indique un rango de artículos comenzando desde *first* hasta el último artículo del grupo actual, o :const:`None` para seleccionar el artículo actual en el grupo actual.

source: Return a pair ``(response, overviews)``. *overviews* is a list of ``(article_number, overview)`` tuples, one for each article selected by *message_spec*. Each *overview* is a dictionary with the same number of items, but this number depends on the server. These items are either message headers (the key is then the lower-cased header name) or metadata items (the key is then the metadata name prepended with ``":"``). The following items are guaranteed to be present by the NNTP specification:
es: Retorna un par ``(response, overviews)``. *overviews* es una lista de tuplas del tipo ``(article_number, overview)``, una para cada artículo seleccionado por *message_spec*. Cada *overview* es un diccionario con el mismo número de elementos, pero este número depende del servidor. Estos elementos son encabezados de mensajes (la clave es entonces el nombre del encabezado en minúsculas) o elementos de metadatos (la clave es entonces el nombre de los metadatos precedido de ``":"``). Se garantiza la presencia de los siguientes elementos por la especificación NNTP:

source: the ``subject``, ``from``, ``date``, ``message-id`` and ``references`` headers
es: los encabezados ``subject``, ``from``, ``date``, ``message-id`` y ``references``

source: the ``:bytes`` metadata: the number of bytes in the entire raw article (including headers and body)
es: los metadatos ``:bytes``: el número de bytes en todo el artículo sin procesar (incluidos los encabezados y el cuerpo)

source: the ``:lines`` metadata: the number of lines in the article body
es: los metadatos ``:lines``: el número de líneas en el cuerpo del artículo

source: The value of each item is either a string, or :const:`None` if not present.
es: El valor de cada elemento es una cadena o :const:`None` si no está presente.

source: It is advisable to use the :func:`decode_header` function on header values when they may contain non-ASCII characters::
es: Es aconsejable utilizar la función :func:`decode_header` en los valores del encabezado cuando pueden contener caracteres no-ASCII::
