Repository: python/python-docs-es
Catalog: library/optparse.po
Languages: es

source: Set default values for several option destinations at once. Using :meth:`set_defaults` is the preferred way to set default values for options, since multiple options can share the same destination. For example, if several "mode" options all set the same destination, any one of them can set the default, and the last one wins::
es: Establece valores por defecto para varios destinos de opción a la vez. Usar el método :meth:`set_defaults` es la forma preferida de establecer valores por defecto para las opciones, ya que varias opciones pueden compartir el mismo destino. Por ejemplo, si varias opciones de ``mode`` tienen el mismo destino, cualquiera de ellas puede establecer el valor por defecto, pero el último establecido es el que finalmente queda establecido::

source: To avoid this confusion, use :meth:`set_defaults`::
es: Para evitar esta confusión, usa el método :meth:`set_defaults`::

source: Option Callbacks
es: Retrollamadas de opción

source: When :mod:`optparse`'s built-in actions and types aren't quite enough for your needs, you have two choices: extend :mod:`optparse` or define a callback option. Extending :mod:`optparse` is more general, but overkill for a lot of simple cases. Quite often a simple callback is all you need.
es: Cuando las acciones y tipos incorporados de :mod:`optparse` no son suficientes para tus necesidades, tienes dos opciones: extender :mod:`optparse` o definir una opción con una retrollamada asociada. Extender :mod:`optparse` es más general, pero algo exagerado para muchos casos simples. Es frecuente que una simple retrollamada sea todo lo que necesitas.

source: There are two steps to defining a callback option:
es: Hay dos pasos a seguir para definir una opción con retrollamada:

source: define the option itself using the ``"callback"`` action
es: definir la opción en sí usando la acción ``"callback"``

source: write the callback; this is a function (or method) that takes at least four arguments, as described below
es: escribir la retrollamada. Esta es una función (o método) que toma al menos cuatro argumentos, los cuales son descritos a continuación

source: Defining a callback option
es: Definición de una opción con retrollamada

source: As always, the easiest way to define a callback option is by using the :meth:`OptionParser.add_option` method. Apart from :attr:`~Option.action`, the only option attribute you must specify is ``callback``, the function to call::
es: Generalmente, la forma más sencilla de definir una opción con retrollamada es mediante el método :meth:`OptionParser.add_option`. Aparte de :attr:`~Option.action`, el único atributo de opción que debes especificar es ``callback``, que es la función a llamar::

source: ``callback`` is a function (or other callable object), so you must have already defined ``my_callback()`` when you create this callback option. In this simple case, :mod:`optparse` doesn't even know if ``-c`` takes any arguments, which usually means that the option takes no arguments---the mere presence of ``-c`` on the command-line is all it needs to know. In some circumstances, though, you might want your callback to consume an arbitrary number of command-line arguments. This is where writing callbacks gets tricky; it's covered later in this section.
es: ``callback`` es una función (u otro objeto invocable), lo que implica que ``my_callback()`` debe haber sido definida antes de la la creación de esta opción con retrollamada. En este caso simple, :mod:`optparse` ni siquiera sabe si ``-c`` toma algún argumento, lo que generalmente significa que la opción no toma argumentos\ ---la mera presencia de ``-c`` en la línea de comandos es todo lo que necesita saber. Sin embargo, en algunas circunstancias, es posible que se desee que la retrollamada consuma una cantidad arbitraria de argumentos de la propia línea de comandos. Es aquí donde escribir retrollamadas se vuelve complicado; se tratará más adelante en esta sección.

source: :mod:`optparse` always passes four particular arguments to your callback, and it will only pass additional arguments if you specify them via :attr:`~Option.callback_args` and :attr:`~Option.callback_kwargs`. Thus, the minimal callback function signature is::
es: :mod:`optparse` siempre pasa cuatro argumentos concretos a la retrollamada. El método solo pasará argumentos adicionales si se especifica explícitamente a través de :attr:`~Option.callback_args` y :attr:`~Option.callback_kwargs`. Por lo tanto, la firma mínima de la retrollamada es:

source: The four arguments to a callback are described below.
es: Los cuatro argumentos para la retrollamada se describen a continuación.

source: There are several other option attributes that you can supply when you define a callback option:
es: Hay varios atributos de opción adicionales que se pueden proporcionar cuando se define una opción con retrollamada:

source: has its usual meaning: as with the ``"store"`` or ``"append"`` actions, it instructs :mod:`optparse` to consume one argument and convert it to :attr:`~Option.type`. Rather than storing the converted value(s) anywhere, though, :mod:`optparse` passes it to your callback function.
es: tiene su significado habitual: al igual que en las acciones ``"store"`` o ``"append"``, indica a :mod:`optparse` que debe consumir un argumento y convertirlo a :attr:`~Option.type` . Sin embargo, en lugar de almacenar el valor (o valores) convertido en algún lugar, :mod:`optparse` lo pasa a la retrollamada.

source: also has its usual meaning: if it is supplied and > 1, :mod:`optparse` will consume :attr:`~Option.nargs` arguments, each of which must be convertible to :attr:`~Option.type`. It then passes a tuple of converted values to your callback.
es: también tiene su significado habitual: si se proporciona y es mayor que 1, :mod:`optparse` consumirá :attr:`~Option.nargs` argumentos de la línea de comandos, cada uno de los cuales debe ser convertible a :attr:`~Option.type`. Hecho esto, se pasa una tupla con los valores convertidos a la retrollamada.

source: a tuple of extra positional arguments to pass to the callback
es: una tupla con los argumentos posicionales adicionales para pasar a la retrollamada

source: a dictionary of extra keyword arguments to pass to the callback
es: un diccionario con los argumentos por palabra clave para pasar a la retrollamada

source: How callbacks are called
es: Cómo son invocadas las retrollamadas

source: All callbacks are called as follows::
es: Todas las retrollamadas son invocadas de la siguiente forma::

source: is the Option instance that's calling the callback
es: es la instancia de Option que invoca a la retrollamada

source: is the option string seen on the command-line that's triggering the callback. (If an abbreviated long option was used, ``opt_str`` will be the full, canonical option string---e.g. if the user puts ``--foo`` on the command-line as an abbreviation for ``--foobar``, then ``opt_str`` will be ``"--foobar"``.)
es: es la cadena de opción encontrada en la línea de comandos que activa la retrollamada. (Si se utilizó una opción larga abreviada, ``opt_str`` será la cadena de opción canónica completa\ --- por ejemplo, si el usuario ingresa ``--foo`` en la línea de comandos como una abreviatura de ``--foobar``, entonces ``opt_str`` será ``"--foobar"``.)

source: is the argument to this option seen on the command-line. :mod:`optparse` will only expect an argument if :attr:`~Option.type` is set; the type of ``value`` will be the type implied by the option's type. If :attr:`~Option.type` for this option is ``None`` (no argument expected), then ``value`` will be ``None``. If :attr:`~Option.nargs` > 1, ``value`` will be a tuple of values of the appropriate type.
es: es el argumento de esta opción encontrado en la línea de comandos. :mod:`optparse` solo esperará un argumento si :attr:`~Option.type` está establecido. El tipo de ``value`` será el tipo implícito en el tipo de la propia opción. Si :attr:`~Option.type` es ``None`` para esta opción (no se espera ningún argumento), entonces ``value`` será también ``None``. Si :attr:`~Option.nargs` es mayor que 1, ``value`` será una tupla con los valores del tipo apropiado.

source: is the OptionParser instance driving the whole thing, mainly useful because you can access some other interesting data through its instance attributes:
es: es la instancia de OptionParser que controla todo. Su utilidad principal radica en que permite acceder a otros datos de interés a través de sus atributos de instancia:

source: the current list of leftover arguments, ie. arguments that have been consumed but are neither options nor option arguments. Feel free to modify ``parser.largs``, e.g. by adding more arguments to it. (This list will become ``args``, the second return value of :meth:`~OptionParser.parse_args`.)
es: la lista actual de argumentos que sobran, es decir, argumentos que se han consumido pero que no son opciones ni argumentos de opción. Siéntete libre de modificar ``parser.largs``, por ejemplo, agregando más argumentos. (Esta lista se convertirá en ``args``, el segundo valor de retorno del método :meth:`~OptionParser.parse_args`.)

source: the current list of remaining arguments, ie. with ``opt_str`` and ``value`` (if applicable) removed, and only the arguments following them still there. Feel free to modify ``parser.rargs``, e.g. by consuming more arguments.
es: la lista actual de argumentos restantes, es decir, los argumentos que quedan a continuación de ``opt_str`` y ``value`` (si corresponde), una vez eliminados ambos. Siéntete libre de modificar ``parser.rargs``, por ejemplo, consumiendo más argumentos.

source: the object where option values are by default stored (an instance of optparse.OptionValues). This lets callbacks use the same mechanism as the rest of :mod:`optparse` for storing option values; you don't need to mess around with globals or closures. You can also access or modify the value(s) of any options already encountered on the command-line.
es: el objeto donde los valores de las opciones son almacenados por defecto (una instancia de *optparse.OptionValues*). Esto permite que las retrollamadas utilicen el mismo mecanismo que el resto de :mod:`optparse` para almacenar valores de las opciones; no es necesario perder el tiempo con globales o clausuras. También se puede acceder a los valores de las opciones o modificarlos si ya se encuentran en la línea de comandos.

source: is a tuple of arbitrary positional arguments supplied via the :attr:`~Option.callback_args` option attribute.
es: es una tupla de argumentos posicionales arbitrarios suministrados a través del atributo de opción :attr:`~Option.callback_args`.

source: is a dictionary of arbitrary keyword arguments supplied via :attr:`~Option.callback_kwargs`.
es: es un diccionario con argumentos por palabra clave arbitrarios proporcionados por :attr:`~Option.callback_kwargs`.

source: Raising errors in a callback
es: Lanzando errores en una retrollamada

source: The callback function should raise :exc:`OptionValueError` if there are any problems with the option or its argument(s). :mod:`optparse` catches this and terminates the program, printing the error message you supply to stderr. Your message should be clear, concise, accurate, and mention the option at fault. Otherwise, the user will have a hard time figuring out what they did wrong.
es: La retrollamada debería lanzar una excepción :exc:`OptionValueError` si hay algún problema con la opción o su(s) argumento(s). Esto permite a :mod:`optparse` detectar el problema y finalizar el programa, imprimiendo el mensaje de error que hayas proporciones en la salida de error estándar. El mensaje debe ser claro, conciso, preciso y mencionar la opción que causa la excepción. De lo contrario, el usuario tendrá dificultades para descubrir qué hizo mal.

source: Callback example 1: trivial callback
es: Ejemplo de retrollamada 1: una retrollamada trivial

source: Here's an example of a callback option that takes no arguments, and simply records that the option was seen::
es: Aquí hay un ejemplo de una opción con retrollamada que no tiene argumentos y simplemente registra que se encontró la opción en la línea de comandos:

source: Of course, you could do that with the ``"store_true"`` action.
es: Ciertamente, se puede hacer lo mismo simplemente con la acción ``"store_true"``.

source: Callback example 2: check option order
es: Ejemplo de retrollamada 2: comprobar el orden de las opciones

source: Here's a slightly more interesting example: record the fact that ``-a`` is seen, but blow up if it comes after ``-b`` in the command-line. ::
es: Aquí tenemos un ejemplo un poco más interesante: registra el hecho de que se ha encontrado ``-a``, pero lanza un error si viene después de ``-b`` en la línea de comandos ::

source: Callback example 3: check option order (generalized)
es: Ejemplo de retrollamada 3: comprobar el orden de las opciones (generalizado)

source: If you want to re-use this callback for several similar options (set a flag, but blow up if ``-b`` has already been seen), it needs a bit of work: the error message and the flag that it sets must be generalized. ::
es: Si deseas reutilizar esta misma retrollamada para varias opciones similares (establecer un flag, pero lanzar un error si ya se ha encontrado ``-b``), necesitas un poco más de trabajo: tanto el mensaje de error como el flag que estableces deben generalizarse::

source: Callback example 4: check arbitrary condition
es: Ejemplo de retrollamada 4: comprobar una condición arbitraria

source: Of course, you could put any condition in there---you're not limited to checking the values of already-defined options. For example, if you have options that should not be called when the moon is full, all you have to do is this::
es: Por supuesto, puedes poner cualquier condición aquí, no estás limitado a verificar los valores de las opciones previamente definidas. Por ejemplo, si tienes opciones que no deberían llamarse cuando hay luna llena, todo lo que tienes que hacer es lo siguiente::

source: (The definition of ``is_moon_full()`` is left as an exercise for the reader.)
es: (La definición de ``is_moon_full()`` se deja como ejercicio para el lector).

source: Callback example 5: fixed arguments
es: Ejemplo de retrollamada 5: argumentos fijos

source: Things get slightly more interesting when you define callback options that take a fixed number of arguments. Specifying that a callback option takes arguments is similar to defining a ``"store"`` or ``"append"`` option: if you define :attr:`~Option.type`, then the option takes one argument that must be convertible to that type; if you further define :attr:`~Option.nargs`, then the option takes :attr:`~Option.nargs` arguments.
es: Las cosas se ponen un poco más interesantes cuando se definen opciones con retrollamada que toman un número fijo de argumentos. Especificar que una opción con retrollamada toma argumentos es similar a definir una opción ``"store"`` o ``"append"``: si se define :attr:`~Option.type`, entonces la opción toma un argumento que debe poder convertirse a ese tipo; si además se define :attr:`~Option.nargs`, entonces la opción toma :attr:`~Option.nargs` argumentos.

source: Here's an example that just emulates the standard ``"store"`` action::
es: Aquí hay un ejemplo que simplemente emula la acción ``"store"`` estándar::

source: Note that :mod:`optparse` takes care of consuming 3 arguments and converting them to integers for you; all you have to do is store them. (Or whatever; obviously you don't need a callback for this example.)
es: Ten en cuenta que :mod:`optparse` se encarga de consumir 3 argumentos y convertirlos a números enteros por ti; todo lo que tienes que hacer es almacenarlos. (En cualquier caso, obviamente no necesitas hacer uso de una retrollamada para este ejemplo).

source: Callback example 6: variable arguments
es: Ejemplo de retrollamada 6: argumentos variables

source: Things get hairy when you want an option to take a variable number of arguments. For this case, you must write a callback, as :mod:`optparse` doesn't provide any built-in capabilities for it. And you have to deal with certain intricacies of conventional Unix command-line parsing that :mod:`optparse` normally handles for you. In particular, callbacks should implement the conventional rules for bare ``--`` and ``-`` arguments:
es: Las cosas se complican si quieres que una opción pueda tomar un número variable de argumentos. En este caso, si que deberás escribir una retrollamada, ya que el módulo :mod:`optparse` no proporciona ninguna capacidad incorporada para ello. Además, tienes que lidiar con ciertos entresijos del análisis convencional de la línea de comandos de Unix, que :mod:`optparse` normalmente maneja por ti. En concreto, las retrollamadas deben implementar las reglas convencionales para los argumentos ``--`` y ``-`` desnudos:

source: either ``--`` or ``-`` can be option arguments
es: tanto ``--`` como ``-`` pueden ser argumentos de opción

source: bare ``--`` (if not the argument to some option): halt command-line processing and discard the ``--``
es: ``--`` desnudo (si no es el argumento de alguna opción): detener el procesamiento de la línea de comandos y descartar el ``--``

source: bare ``-`` (if not the argument to some option): halt command-line processing but keep the ``-`` (append it to ``parser.largs``)
es: ``-`` desnudo (si no es el argumento de alguna opción): detener el procesamiento de la línea de comandos pero mantener el ``-`` (añadiéndolo a ``parser.largs``)

source: If you want an option that takes a variable number of arguments, there are several subtle, tricky issues to worry about. The exact implementation you choose will be based on which trade-offs you're willing to make for your application (which is why :mod:`optparse` doesn't support this sort of thing directly).
es: Si deseas que una opción tenga un número variable de argumentos, hay varios problemas sutiles y complicados de los que deberás preocuparte. La implementación exacta que elijas dependerá de los sacrificios que estés dispuesto a hacer en tu aplicación (razón por la cual, el módulo :mod:`optparse` no admite directamente este tipo de cosas).

source: Nevertheless, here's a stab at a callback for an option with variable arguments::
es: En cualquier caso, aquí hay un intento de una retrollamada para una opción con un número de argumentos variable::

source: Extending :mod:`optparse`
es: Extendiendo el módulo :mod:`optparse`

source: Since the two major controlling factors in how :mod:`optparse` interprets command-line options are the action and type of each option, the most likely direction of extension is to add new actions and new types.
es: Dado que los dos factores principales que controlan como el módulo :mod:`optparse` interpreta las opciones de la línea de comandos son la acción y el tipo de cada opción, los objetivos más probables de extensión son agregar nuevas acciones y nuevos tipos.

source: Adding new types
es: Agregando nuevos tipos

source: To add new types, you need to define your own subclass of :mod:`optparse`'s :class:`Option` class. This class has a couple of attributes that define :mod:`optparse`'s types: :attr:`~Option.TYPES` and :attr:`~Option.TYPE_CHECKER`.
es: Para añadir nuevos tipos, necesitas definir tu propia subclase de la clase :class:`Option` de :mod:`optparse`. Esta clase tiene un par de atributos que definen los tipos de :mod:`optparse`: :attr:`~Option.TYPES` y :attr:`~Option.TYPE_CHECKER`.

source: A tuple of type names; in your subclass, simply define a new tuple :attr:`TYPES` that builds on the standard one.
es: Una tupla con nombres de tipos. En tu subclase, simplemente define una nueva tupla :attr:`TYPES` que se base en la estándar.

source: A dictionary mapping type names to type-checking functions. A type-checking function has the following signature::
es: Un diccionario que asigna nombres de tipos a funciones de verificación de tipo. Una función de verificación de tipo tiene la siguiente firma:

source: where ``option`` is an :class:`Option` instance, ``opt`` is an option string (e.g., ``-f``), and ``value`` is the string from the command line that must be checked and converted to your desired type. ``check_mytype()`` should return an object of the hypothetical type ``mytype``. The value returned by a type-checking function will wind up in the OptionValues instance returned by :meth:`OptionParser.parse_args`, or be passed to a callback as the ``value`` parameter.
es: donde ``option`` es una instancia de :class:`Option`, ``opt`` es una cadena de opción (por ejemplo, ``-f``) y ``value`` es la cadena de caracteres de la línea de comandos que debe comprobarse y convertirse al tipo deseado. ``check_mytype()`` debería retornar un objeto del tipo hipotético ``mytype``. El valor retornado por una función de verificación de tipo terminará formando parte de la instancia de OptionValues retornada por el método :meth:`OptionParser.parse_args` o será pasada a una retrollamada como parámetro ``value``.

source: Your type-checking function should raise :exc:`OptionValueError` if it encounters any problems. :exc:`OptionValueError` takes a single string argument, which is passed as-is to :class:`OptionParser`'s :meth:`error` method, which in turn prepends the program name and the string ``"error:"`` and prints everything to stderr before terminating the process.
es: Tu función de verificación de tipo debería lanzar una excepción :exc:`OptionValueError` si encuentra algún problema. :exc:`OptionValueError` toma una cadena de caracteres como único argumento, que es pasada tal cual al método :meth:`error` de la clase :class:`OptionParser`, que a su vez antepone a la misma el nombre del programa y la cadena ``"error:"`` e imprime todo en la salida de error estándar antes de finalizar el proceso.

source: Here's a silly example that demonstrates adding a ``"complex"`` option type to parse Python-style complex numbers on the command line. (This is even sillier than it used to be, because :mod:`optparse` 1.3 added built-in support for complex numbers, but never mind.)
es: Aquí hay un ejemplo absurdo que demuestra cómo agregar un tipo de opción ``"complex"`` para analizar números complejos al estilo Python en la línea de comandos. (Esto es aún más absurdo de lo que en principio parece, porque en al versión 1.3 de :mod:`optparse` se agregó soporte incorporado para números complejos, pero no importa).

source: First, the necessary imports::
es: Primero, las importaciones necesarias::

source: You need to define your type-checker first, since it's referred to later (in the :attr:`~Option.TYPE_CHECKER` class attribute of your Option subclass)::
es: En primer lugar, debes definir tu verificador de tipo, ya que se hace referencia a él más adelante (en el atributo de clase :attr:`~Option.TYPE_CHECKER` de tu subclase de Option)::

source: Finally, the Option subclass::
es: Finalmente, la subclase de Option::

source: (If we didn't make a :func:`copy` of :attr:`Option.TYPE_CHECKER`, we would end up modifying the :attr:`~Option.TYPE_CHECKER` attribute of :mod:`optparse`'s Option class. This being Python, nothing stops you from doing that except good manners and common sense.)
es: (Si no hacemos una copia (mediante :func:`copy`), de :attr:`Option.TYPE_CHECKER`, terminaríamos modificando el atributo :attr:`~Option.TYPE_CHECKER` de la clase Option de :mod:`optparse`. Tratándose de Python, nada te impide hacer eso, excepto los buenos modales y el sentido común.)
