Repository: python/python-docs-es
Catalog: library/optparse.po
Languages: es

source: That's it! Now you can write a script that uses the new option type just like any other :mod:`optparse`\ -based script, except you have to instruct your OptionParser to use MyOption instead of Option::
es: ¡Y eso es todo! Ahora puedes escribir un script que use tu nuevo tipo de opción como cualquier otro script basado en :mod:`optparse`, excepto que debes indicarle a tu OptionParser que use MyOption en lugar de Option::

source: Alternately, you can build your own option list and pass it to OptionParser; if you don't use :meth:`add_option` in the above way, you don't need to tell OptionParser which option class to use::
es: Alternativamente, puedes crear tu propia lista de opciones y pasarla a OptionParser; si no usas :meth:`add_option` de la manera anterior, no necesitas decirle a OptionParser qué clase de opción usar::

source: Adding new actions
es: Agregando nuevas acciones

source: Adding new actions is a bit trickier, because you have to understand that :mod:`optparse` has a couple of classifications for actions:
es: Agregar nuevas acciones es un poco más complicado, dado que hay que comprender que :mod:`optparse` establece un par de categorías para las acciones:

source: "store" actions
es: Acciones "store"

source: actions that result in :mod:`optparse` storing a value to an attribute of the current OptionValues instance; these options require a :attr:`~Option.dest` attribute to be supplied to the Option constructor.
es: acciones que dan como resultado que :mod:`optparse` almacene un valor en un atributo de la instancia actual de OptionValues. Estas opciones requieren un atributo :attr:`~Option.dest` para que pueda ser proporcionado al constructor de Option.

source: "typed" actions
es: Acciones "typed"

source: actions that take a value from the command line and expect it to be of a certain type; or rather, a string that can be converted to a certain type. These options require a :attr:`~Option.type` attribute to the Option constructor.
es: acciones que toman un valor de la línea de comandos, esperando que sea de cierto tipo; o mejor dicho, una cadena de caracteres que se pueda convertir a un determinado tipo. Estas opciones requieren un atributo :attr:`~Option.type` para el constructor de Option.

source: These are overlapping sets: some default "store" actions are ``"store"``, ``"store_const"``, ``"append"``, and ``"count"``, while the default "typed" actions are ``"store"``, ``"append"``, and ``"callback"``.
es: Ambas categorías se solapan entre si: algunas acciones ``store`` predeterminadas son ``"store"``, ``"store_const"``, ``"append"`` y ``"count"``, mientras que las acciones "typed" predeterminadas son ``"store"``, ``"append"`` y ``"callback"``.

source: When you add an action, you need to categorize it by listing it in at least one of the following class attributes of Option (all are lists of strings):
es: Cuando agregas una acción, debes categorizarla enumerándola en al menos uno de los siguientes atributos de clase de la clase Option (todos ellos son listas de cadenas de caracteres):

source: All actions must be listed in ACTIONS.
es: Todas las acciones deben aparecer en ACTIONS.

source: "store" actions are additionally listed here.
es: Las acciones "store" también se enumeran aquí.

source: "typed" actions are additionally listed here.
es: Las acciones "typed" también se enumeran aquí.

source: Actions that always take a type (i.e. whose options always take a value) are additionally listed here. The only effect of this is that :mod:`optparse` assigns the default type, ``"string"``, to options with no explicit type whose action is listed in :attr:`ALWAYS_TYPED_ACTIONS`.
es: Las acciones que siempre toman un tipo (es decir, aquellas cuyas opciones siempre toman un valor) también deben enumerarse aquí. La única consecuencia de esto es que :mod:`optparse` asigna el tipo predeterminado, ``string``, a las opciones cuya acción se enumera en :attr:`ALWAYS_TYPED_ACTIONS` pero que no tienen asignado un tipo explícito.

source: In order to actually implement your new action, you must override Option's :meth:`take_action` method and add a case that recognizes your action.
es: Para implementar realmente tu nueva acción, debes redefinir el método :meth:`take_action` de Option, implementando un nuevo método que reconozca tu acción.

source: For example, let's add an ``"extend"`` action. This is similar to the standard ``"append"`` action, but instead of taking a single value from the command-line and appending it to an existing list, ``"extend"`` will take multiple values in a single comma-delimited string, and extend an existing list with them. That is, if ``--names`` is an ``"extend"`` option of type ``"string"``, the command line ::
es: Por ejemplo, agreguemos una nueva acción ``"extend"``. Esta es similar a la acción estándar ``"append"``, pero en lugar de tomar un solo valor de la línea de comandos y agregarlo a una lista existente, ``"extend"`` tomará múltiples valores en una sola cadena de caracteres delimitada por comas y amplía una lista previamente existente con ellos. Es decir, si ``--names`` es una opción ``"extend"`` de tipo ``"string"``, la línea de comandos ::

source: would result in a list ::
es: daría como resultado una lista como la siguiente::

source: Again we define a subclass of Option::
es: De nuevo, definimos una subclase de Option::

source: Features of note:
es: Detalles a tener en cuenta:

source: ``"extend"`` both expects a value on the command-line and stores that value somewhere, so it goes in both :attr:`~Option.STORE_ACTIONS` and :attr:`~Option.TYPED_ACTIONS`.
es: ``"extend"`` espera un valor en la línea de comandos y también almacena ese valor en algún lugar, por lo que lo agregamos tanto a :attr:`~Option.STORE_ACTIONS` como a :attr:`~Option.TYPED_ACTIONS`.

source: to ensure that :mod:`optparse` assigns the default type of ``"string"`` to ``"extend"`` actions, we put the ``"extend"`` action in :attr:`~Option.ALWAYS_TYPED_ACTIONS` as well.
es: para asegurarnos de que :mod:`optparse` asigna el tipo predeterminado ``"string"`` a las acciones ``"extend"``, agregamos también la acción ``"extend"`` a :attr:`~Opción.ALWAYS_TYPED_ACTIONS`.

source: :meth:`MyOption.take_action` implements just this one new action, and passes control back to :meth:`Option.take_action` for the standard :mod:`optparse` actions.
es: el método :meth:`MyOption.take_action` solo se encarga de implementar esta nueva acción y posteriormente le pasa el control al método :meth:`Option.take_action` para las acciones estándar de :mod:`optparse`.

source: ``values`` is an instance of the optparse_parser.Values class, which provides the very useful :meth:`ensure_value` method. :meth:`ensure_value` is essentially :func:`getattr` with a safety valve; it is called as ::
es: ``values`` es una instancia de la clase *optparse_parser.Values*, que proporciona el útil método :meth:`ensure_value`. El método :meth:`ensure_value` es en esencia lo mismo que :func:`getattr` pero con un mecanismo de seguridad agregado. Es llamado como::

source: If the ``attr`` attribute of ``values`` doesn't exist or is ``None``, then ensure_value() first sets it to ``value``, and then returns ``value``. This is very handy for actions like ``"extend"``, ``"append"``, and ``"count"``, all of which accumulate data in a variable and expect that variable to be of a certain type (a list for the first two, an integer for the latter). Using :meth:`ensure_value` means that scripts using your action don't have to worry about setting a default value for the option destinations in question; they can just leave the default as ``None`` and :meth:`ensure_value` will take care of getting it right when it's needed.
es: Si el atributo ``attr`` de ``values`` no existe o es ``None``, entonces *ensure_value()* primero lo establece en ``value`` y luego retorna el atributo actualizado (``value``). Esto es muy útil para acciones como ``"extend"``, ``"append"`` y ``"count"``, dado que todas ellas acumulan datos en una variable y esperan que esa variable sea de cierto tipo (una lista para las dos primeras, un número entero para la última). Usar el método :meth:`ensure_value` significa que los scripts que usan tu acción no tienen que preocuparse por establecer un valor predeterminado para los destinos de opción en cuestión; simplemente pueden dejar el valor predeterminado como ``None`` y :meth:`secure_value` se encargará de que todo esté correcto cuando sea necesario.

source: Exceptions
es: Excepciones

source: Raised if an :class:`Option` instance is created with invalid or inconsistent arguments.
es: Lanzada si se crea con argumentos inválidos o inconsistentes una instancia de :class:`Option`.

source: Raised if conflicting options are added to an :class:`OptionParser`.
es: Lanzada si se añaden opciones que entren en conflicto en una :class:`OptionParser`.

source: Raised if an invalid option value is encountered on the command line.
es: Lanzada si se encuentra una opción inválida en la línea de comandos.

source: Raised if an invalid option is passed on the command line.
es: Lanzada si se pasa una opción inválida en la línea de comandos.

source: Raised if an ambiguous option is passed on the command line.
es: Lanzada si se pasa una opción ambigua en la línea de comandos.
