Repository: python/python-docs-es
Catalog: library/optparse.po
Languages: es

source: :mod:`optparse` --- Parser for command line options
es: :mod:`optparse` --- Analizador sintáctico (parser) para opciones de línea de comandos

source: The :mod:`optparse` module is deprecated and will not be developed further; development will continue with the :mod:`argparse` module.
es: El módulo :mod:`optparse` está obsoleto y no será desarrollado de aquí en adelante. El desarrollo continuará en el módulo :mod:`argparse`.

source: :mod:`optparse` is a more convenient, flexible, and powerful library for parsing command-line options than the old :mod:`getopt` module. :mod:`optparse` uses a more declarative style of command-line parsing: you create an instance of :class:`OptionParser`, populate it with options, and parse the command line. :mod:`optparse` allows users to specify options in the conventional GNU/POSIX syntax, and additionally generates usage and help messages for you.
es: :mod:`optparse` es una biblioteca más conveniente, flexible y poderosa para analizar opciones de línea de comandos que el antiguo módulo :mod:`getopt`. :mod:`optparse` usa un estilo más declarativo: creas una instancia de :class:`OptionParser`, le añades las opciones deseadas y realizas el análisis sintáctico de la línea de comandos. :mod:`optparse` permite a los usuarios especificar opciones siguiendo la sintaxis convencional de GNU/POSIX, además de generar mensajes de uso y de ayuda automáticamente.

source: Here's an example of using :mod:`optparse` in a simple script::
es: A continuación puedes ver un ejemplo de uso de :mod:`optparse` mediante un script simple::

source: With these few lines of code, users of your script can now do the "usual thing" on the command-line, for example::
es: Con estas pocas líneas de código, los usuarios de tu script ahora pueden hacer un uso "normal" del mismo mediante la línea de comandos, por ejemplo::

source: As it parses the command line, :mod:`optparse` sets attributes of the ``options`` object returned by :meth:`~OptionParser.parse_args` based on user-supplied command-line values. When :meth:`~OptionParser.parse_args` returns from parsing this command line, ``options.filename`` will be ``"outfile"`` and ``options.verbose`` will be ``False``. :mod:`optparse` supports both long and short options, allows short options to be merged together, and allows options to be associated with their arguments in a variety of ways. Thus, the following command lines are all equivalent to the above example::
es: A medida que analiza la línea de comandos, :mod:`optparse` establece los atributos del objeto ``options`` retornado por :meth:`~OptionParser.parse_args` basándose en los valores de la línea de comandos proporcionada por el usuario. Cuando :meth:`~OptionParser.parse_args` termina de analizar esta línea de comandos, ``options.filename`` será ``"outfile"`` y ``options.verbose`` será ``False``. :mod:`optparse` admite opciones largas y cortas, fusionar opciones cortas y asociar opciones con sus argumentos de diversas formas. Por lo tanto, las siguientes líneas de comandos son todas equivalentes al ejemplo previo::

source: Additionally, users can run one of the following ::
es: Además, los usuarios pueden ejecutar uno de los siguientes::

source: and :mod:`optparse` will print out a brief summary of your script's options:
es: y :mod:`optparse` imprimirá un breve resumen de las opciones de tu script:

source: where the value of *yourscript* is determined at runtime (normally from ``sys.argv[0]``).
es: donde el valor de *yourscript* se determina en tiempo de ejecución (normalmente a partir de ``sys.argv [0]``).

source: Background
es: Contexto

source: :mod:`optparse` was explicitly designed to encourage the creation of programs with straightforward, conventional command-line interfaces. To that end, it supports only the most common command-line syntax and semantics conventionally used under Unix. If you are unfamiliar with these conventions, read this section to acquaint yourself with them.
es: :mod:`optparse` ha sido diseñado explícitamente para fomentar la creación de programas con interfaces de línea de comandos convencionales y sencillas. Con ese fin en mente, solo admite la sintaxis y semántica de línea de comandos más común y convencionalmente usada en Unix. Si no estás familiarizado con estas convenciones, lee esta sección para familiarizarte con ellas.

source: Terminology
es: Terminología

source: argument
es: argumento

source: a string entered on the command-line, and passed by the shell to ``execl()`` or ``execv()``. In Python, arguments are elements of ``sys.argv[1:]`` (``sys.argv[0]`` is the name of the program being executed). Unix shells also use the term "word".
es: una cadena de caracteres ingresada en la línea de comandos y pasada mediante la shell a ``execl()`` o ``execv()``. En Python, los argumentos son elementos de ``sys.argv[1:]`` (dado que ``sys.argv[0]`` es el propio nombre del programa que se está ejecutando). Las shells de Unix también usan el término "*word*" ('palabra') para referirse a ellos.

source: It is occasionally desirable to substitute an argument list other than ``sys.argv[1:]``, so you should read "argument" as "an element of ``sys.argv[1:]``, or of some other list provided as a substitute for ``sys.argv[1:]``".
es: En ocasiones es deseable proporcionar una lista de argumentos que no sea ``sys.argv[1:]``, por lo que deberías considerar un 'argumento' como 'un elemento de ``sys.argv[1:]`` o de alguna otra lista proporcionada como sustituto de ``sys.argv[1:]``'.

source: option
es: opción

source: an argument used to supply extra information to guide or customize the execution of a program. There are many different syntaxes for options; the traditional Unix syntax is a hyphen ("-") followed by a single letter, e.g. ``-x`` or ``-F``. Also, traditional Unix syntax allows multiple options to be merged into a single argument, e.g. ``-x -F`` is equivalent to ``-xF``. The GNU project introduced ``--`` followed by a series of hyphen-separated words, e.g. ``--file`` or ``--dry-run``. These are the only two option syntaxes provided by :mod:`optparse`.
es: un argumento utilizado para proporcionar información adicional con la finalidad de guiar o personalizar la ejecución de un programa. Existen muchas sintaxis diferentes para especificar opciones. La sintaxis tradicional de Unix es un guion ('-') seguido de una sola letra, por ejemplo ``-x`` o ``-F``. La sintaxis tradicional de Unix permite además fusionar múltiples opciones en un solo argumento, por ejemplo ``-x -F`` es equivalente a ``-xF``. Por otro lado, el proyecto GNU introdujo ``--`` seguido de una serie de palabras separadas por guiones, por ejemplo ``--file`` o ``--dry-run``. Estas son las dos únicas sintaxis para opciones que el módulo :mod:`optparse` proporciona.

source: Some other option syntaxes that the world has seen include:
es: Algunas de las otras sintaxis para opciones que el mundo ha visto son:

source: a hyphen followed by a few letters, e.g. ``-pf`` (this is *not* the same as multiple options merged into a single argument)
es: un guion seguido de algunas letras, por ejemplo ``-pf`` (esto *no* es lo mismo que múltiples opciones fusionadas en un solo argumento)

source: a hyphen followed by a whole word, e.g. ``-file`` (this is technically equivalent to the previous syntax, but they aren't usually seen in the same program)
es: un guion seguido de una palabra completa, por ejemplo ``-file`` (esto es técnicamente equivalente a la sintaxis anterior, pero generalmente no se ven ambas en un mismo programa)

source: a plus sign followed by a single letter, or a few letters, or a word, e.g. ``+f``, ``+rgb``
es: un signo más seguido de una sola letra, unas pocas letras o una palabra, por ejemplo ``+f`` o ``+rgb``

source: a slash followed by a letter, or a few letters, or a word, e.g. ``/f``, ``/file``
es: una barra seguida de una letra, de unas pocas letras o de una palabra, por ejemplo ``/f`` o ``/file``

source: These option syntaxes are not supported by :mod:`optparse`, and they never will be. This is deliberate: the first three are non-standard on any environment, and the last only makes sense if you're exclusively targeting Windows or certain legacy platforms (e.g. VMS, MS-DOS).
es: Estas sintaxis para opciones no son compatibles con :mod:`optparse` y nunca lo serán. Esto es deliberado: los tres primeros no son estándar en ningún entorno y el último solo tiene sentido si se dirige exclusivamente a Windows o alguna plataforma heredada (*legacy*) (por ejemplo: VMS, MS-DOS).

source: option argument
es: argumento de opción

source: an argument that follows an option, is closely associated with that option, and is consumed from the argument list when that option is. With :mod:`optparse`, option arguments may either be in a separate argument from their option:
es: un argumento que sigue a una opción, está estrechamente asociado con ella y se consume de la lista de argumentos cuando esa opción es consumida. Con :mod:`optparse`, los argumentos de las opciones pueden estar en un argumento separado de su opción:

source: or included in the same argument:
es: o incluidos en el mismo argumento:

source: Typically, a given option either takes an argument or it doesn't. Lots of people want an "optional option arguments" feature, meaning that some options will take an argument if they see it, and won't if they don't. This is somewhat controversial, because it makes parsing ambiguous: if ``-a`` takes an optional argument and ``-b`` is another option entirely, how do we interpret ``-ab``? Because of this ambiguity, :mod:`optparse` does not support this feature.
es: Normalmente, una opción dada puede aceptar o no un argumento. Mucha gente desea una característica de "argumentos de opción opcionales", lo que implica que algunas opciones aceptarán un argumento si está presente y no lo aceptarán si no lo está. Esto es algo controvertido, porque hace que el análisis sea ambiguo: si ``-a`` toma un argumento opcional y ``-b`` es otra opción completamente distinta, ¿cómo interpretamos ``-ab``? Debido a esta ambigüedad, :mod:`optparse` no es compatible con esta funcionalidad.

source: positional argument
es: argumento posicional

source: something leftover in the argument list after options have been parsed, i.e. after options and their arguments have been parsed and removed from the argument list.
es: es algo que queda en la lista de argumentos después de que las opciones hayan sido analizadas sintácticamente, es decir, después de que las opciones y sus argumentos hayan sido analizados y eliminados de la lista de argumentos.

source: required option
es: opción requerida

source: an option that must be supplied on the command-line; note that the phrase "required option" is self-contradictory in English. :mod:`optparse` doesn't prevent you from implementing required options, but doesn't give you much help at it either.
es: es una opción que debe proporcionarse forzosamente en la línea de comandos. Ten en cuenta que la frase "opción requerida" se contradice a si misma. :mod:`optparse` no te impide implementar opciones requeridas, pero tampoco brinda mucha ayuda para ello.

source: For example, consider this hypothetical command-line::
es: Por ejemplo, considera esta hipotética linea de comandos:

source: ``-v`` and ``--report`` are both options. Assuming that ``--report`` takes one argument, ``report.txt`` is an option argument. ``foo`` and ``bar`` are positional arguments.
es: ``-v`` y ``--report`` son ambas opciones. ``report.txt`` es un argumento de opción, suponiendo que ``--report`` toma un argumento. En cambio, ``foo`` y ``bar`` son ambos argumentos posicionales.

source: What are options for?
es: ¿Qué finalidad tienen las opciones?

source: Options are used to provide extra information to tune or customize the execution of a program. In case it wasn't clear, options are usually *optional*. A program should be able to run just fine with no options whatsoever. (Pick a random program from the Unix or GNU toolsets. Can it run without any options at all and still make sense? The main exceptions are ``find``, ``tar``, and ``dd``\ ---all of which are mutant oddballs that have been rightly criticized for their non-standard syntax and confusing interfaces.)
es: Las opciones se utilizan para poder proporcionar información adicional con el fin de ajustar o personalizar la ejecución de un programa. Por si aún no ha quedado claro, las opciones suelen ser *opcionales*. Un programa debería poder ejecutarse sin problemas sin ninguna opción. (Elija un programa aleatorio del conjunto de herramientas de Unix o GNU. ¿Puede ejecutarse sin ninguna opción y aún así tener sentido? Las principales excepciones son ``find``, ``tar`` y ``dd``\ ---los cuales son todos bichos raros mutantes que han sido apropiadamente criticados por su sintaxis no estándar y por tener interfaces confusas).

source: Lots of people want their programs to have "required options". Think about it. If it's required, then it's *not optional*! If there is a piece of information that your program absolutely requires in order to run successfully, that's what positional arguments are for.
es: Como se ha comentado, mucha gente quiere que sus programas tengan "opciones requeridas". Pero pensemos en ello detenidamente. ¡Si es necesario, entonces *no es opcional*! Si hay una pieza de información absolutamente requerida para que tu programa pueda ejecutarse correctamente no uses opciones, para eso están los argumentos posicionales.

source: As an example of good command-line interface design, consider the humble ``cp`` utility, for copying files. It doesn't make much sense to try to copy files without supplying a destination and at least one source. Hence, ``cp`` fails if you run it with no arguments. However, it has a flexible, useful syntax that does not require any options at all::
es: Como ejemplo de un buen diseño de una interfaz de línea de comandos, considera la humilde herramienta ``cp`` para copiar archivos. No tiene mucho sentido intentar copiar archivos sin proporcionar un destino y al menos una fuente de origen. Por lo tanto, ``cp`` falla si lo ejecutas sin argumentos. Sin embargo, tiene una sintaxis flexible y útil que no requiere ninguna opción::

source: You can get pretty far with just that. Most ``cp`` implementations provide a bunch of options to tweak exactly how the files are copied: you can preserve mode and modification time, avoid following symlinks, ask before clobbering existing files, etc. But none of this distracts from the core mission of ``cp``, which is to copy either one file to another, or several files to another directory.
es: Puedes hacer mucho simplemente con eso. La mayoría de las implementaciones de ``cp`` proporcionan un montón de opciones para modificar exactamente cómo se copian los archivos: se puede preservar el modo y la fecha de modificación, evitar que se sigan enlaces simbólicos, preguntar antes de sobrescribir el contenido de archivos existentes, etc. Pero nada de esto distrae de la misión principal de ``cp``, que consiste en copiar uno o varios archivos en otro directorio.

source: What are positional arguments for?
es: ¿Qué finalidad tienen los argumentos posicionales?

source: Positional arguments are for those pieces of information that your program absolutely, positively requires to run.
es: Los argumentos posicionales son adecuados para aquellas piezas de información que tu programa, absolutamente y sin duda alguna, requiere para funcionar.

source: A good user interface should have as few absolute requirements as possible. If your program requires 17 distinct pieces of information in order to run successfully, it doesn't much matter *how* you get that information from the user---most people will give up and walk away before they successfully run the program. This applies whether the user interface is a command-line, a configuration file, or a GUI: if you make that many demands on your users, most of them will simply give up.
es: Una buena interfaz de usuario debería tener la menor cantidad de requisitos absolutos posibles. Si tu programa requiere 17 piezas distintas de información para ejecutarse correctamente, no importa mucho *cómo* obtengas esa información del usuario; la mayoría de ellos se rendirán y se irán antes de ejecutar con éxito el programa. Esto se aplica tanto si la interfaz de usuario es una línea de comandos, un archivo de configuración o una GUI: si hace demasiadas demandas a sus usuarios, la mayoría simplemente se rendirá.

source: In short, try to minimize the amount of information that users are absolutely required to supply---use sensible defaults whenever possible. Of course, you also want to make your programs reasonably flexible. That's what options are for. Again, it doesn't matter if they are entries in a config file, widgets in the "Preferences" dialog of a GUI, or command-line options---the more options you implement, the more flexible your program is, and the more complicated its implementation becomes. Too much flexibility has drawbacks as well, of course; too many options can overwhelm users and make your code much harder to maintain.
es: En resumen, trata de minimizar la cantidad de información que los usuarios están absolutamente obligados a proporcionar, utiliza valores predeterminados sensatos siempre que sea posible. Como es natural, también deseas que tus programas sean razonablemente flexibles, para eso están las opciones. De nuevo, no importa si son entradas en un archivo de configuración, widgets en un cuadro de diálogo de "Preferencias" de una GUI u opciones en la línea de comandos; cuantas más opciones implementes, más flexible será tu programa y más complicada se vuelve su implementación. Una excesiva flexibilidad evidentemente también tiene inconvenientes, demasiadas opciones pueden abrumar a los usuarios y hacer que tu código sea mucho más difícil de mantener.

source: While :mod:`optparse` is quite flexible and powerful, it's also straightforward to use in most cases. This section covers the code patterns that are common to any :mod:`optparse`\ -based program.
es: Si bien :mod:`optparse` es bastante flexible y potente, también es sencillo de usar en la mayoría de los casos. Esta sección cubre los patrones de código comunes a cualquier programa basado en :mod:`optparse`.

source: First, you need to import the OptionParser class; then, early in the main program, create an OptionParser instance::
es: En primer lugar, necesitas importar la clase OptionParser y luego, al comienzo del programa principal, crear una instancia de ella::

source: Then you can start defining options. The basic syntax is::
es: Ahora ya puedes comenzar a definir opciones. La sintaxis básica es:

source: Each option has one or more option strings, such as ``-f`` or ``--file``, and several option attributes that tell :mod:`optparse` what to expect and what to do when it encounters that option on the command line.
es: Cada opción tiene una o más cadenas de caracteres de opción, como ``-f`` o ``--file`` y varios atributos de opción que le dicen a :mod:`optparse` qué esperar y qué hacer cuando encuentra esa opción en la línea de comandos.

source: Typically, each option will have one short option string and one long option string, e.g.::
es: Normalmente, cada opción tendrá una cadena de opción corta y una cadena de opción larga, por ejemplo:

source: You're free to define as many short option strings and as many long option strings as you like (including zero), as long as there is at least one option string overall.
es: Puedes definir tantas cadenas de opción cortas y tantas largas como desees (incluso ninguna), siempre que haya al menos una cadena de opción en total.

source: The option strings passed to :meth:`OptionParser.add_option` are effectively labels for the option defined by that call. For brevity, we will frequently refer to *encountering an option* on the command line; in reality, :mod:`optparse` encounters *option strings* and looks up options from them.
es: Las cadenas de opción pasadas a :meth:`OptionParser.add_option` son en definitiva etiquetas para la opción definida por esa llamada. Simplemente por brevedad, con frecuencia nos referiremos a *encontrar una opción* en la línea de comandos. En realidad, :mod:`optparse` encuentra *cadenas de caracteres de opción* y busca opciones en ellas.

source: Once all of your options are defined, instruct :mod:`optparse` to parse your program's command line::
es: Una vez que todas tus opciones estén definidas, indica a :mod:`optparse` que analice sintácticamente la línea de comandos de tu programa::

source: (If you like, you can pass a custom argument list to :meth:`~OptionParser.parse_args`, but that's rarely necessary: by default it uses ``sys.argv[1:]``.)
es: (Si lo deseas, puedes pasar una lista de argumentos personalizada a :meth:`~OptionParser.parse_args`, pero eso rara vez es necesario: por defecto se usa ``sys.argv [1:]``.)

source: :meth:`~OptionParser.parse_args` returns two values:
es: :meth:`~OptionParser.parse_args` retorna dos valores:

source: ``options``, an object containing values for all of your options---e.g. if ``--file`` takes a single string argument, then ``options.file`` will be the filename supplied by the user, or ``None`` if the user did not supply that option
es: ``options``, un objeto que contiene valores para todas tus opciones. Por ejemplo, si ``--file`` toma un argumento de una sola cadena de caracteres, entonces ``options.file`` será el nombre del archivo proporcionado por el usuario o ``None`` si el usuario no proporcionó esa opción en la linea de comandos

source: ``args``, the list of positional arguments leftover after parsing options
es: ``args``, la lista de argumentos posicionales que quedan después de analizar las opciones

source: This tutorial section only covers the four most important option attributes: :attr:`~Option.action`, :attr:`~Option.type`, :attr:`~Option.dest` (destination), and :attr:`~Option.help`. Of these, :attr:`~Option.action` is the most fundamental.
es: Este tutorial solo cubre los cuatro atributos de opción más importantes: :attr:`~Option.action`, :attr:`~Option.type`, :attr:`~Option.dest` (destino) y :attr:`~Option.help`. De todos ellos, :attr:`~Option.action` es el fundamental.

source: Understanding option actions
es: Comprendiendo las acciones de opción

source: Actions tell :mod:`optparse` what to do when it encounters an option on the command line. There is a fixed set of actions hard-coded into :mod:`optparse`; adding new actions is an advanced topic covered in section :ref:`optparse-extending-optparse`. Most actions tell :mod:`optparse` to store a value in some variable---for example, take a string from the command line and store it in an attribute of ``options``.
es: Las acciones le dicen a :mod:`optparse` qué hacer cuando encuentra una determinada opción en la línea de comandos. Hay un conjunto fijo de acciones codificadas en :mod:`optparse`. Agregar nuevas acciones es un tema avanzado cubierto en la sección :ref:`optparse-extending-optparse`. La mayoría de las acciones indican a :mod:`optparse` que almacene un valor en alguna variable, por ejemplo, tomar una cadena de caracteres de la línea de comandos y almacenarla en un atributo del objeto ``options``.

source: If you don't specify an option action, :mod:`optparse` defaults to ``store``.
es: Si no se especifica una acción para la opción, :mod:`optparse` usa por defecto ``store``.

source: The store action
es: La acción store
