Repository: python/python-docs-es
Catalog: library/optparse.po
Languages: es

source: The most common option action is ``store``, which tells :mod:`optparse` to take the next argument (or the remainder of the current argument), ensure that it is of the correct type, and store it to your chosen destination.
es: La acción para opciones más común es ``store``, que le dice a :mod:`optparse` que tome el siguiente argumento (o el resto del argumento actual), se asegure de que sea del tipo correcto y lo guarde en el destino elegido.

source: For example::
es: Por ejemplo::

source: Now let's make up a fake command line and ask :mod:`optparse` to parse it::
es: Ahora creamos una línea de comandos simulada y le pedimos a :mod:`optparse` que la analice::

source: When :mod:`optparse` sees the option string ``-f``, it consumes the next argument, ``foo.txt``, and stores it in ``options.filename``. So, after this call to :meth:`~OptionParser.parse_args`, ``options.filename`` is ``"foo.txt"``.
es: Cuando :mod:`optparse` se encuentra con la cadena de opción ``-f``, consume el siguiente argumento, ``foo.txt`` y lo almacena en ``options.filename``. Por lo tanto, después de la llamada a :meth:`~OptionParser.parse_args`, ``options.filename`` será ``"foo.txt"``.

source: Some other option types supported by :mod:`optparse` are ``int`` and ``float``. Here's an option that expects an integer argument::
es: Algunos de los otros tipos de opción admitidos por :mod:`optparse` son ``int`` y ``float``. Aquí hay una opción que espera un argumento entero::

source: Note that this option has no long option string, which is perfectly acceptable. Also, there's no explicit action, since the default is ``store``.
es: Ten en cuenta que esta opción no tiene una cadena de opción larga, lo cual es perfectamente aceptable. Además, no hay ninguna acción explícita, ya que el valor predeterminado es ``store``.

source: Let's parse another fake command-line. This time, we'll jam the option argument right up against the option: since ``-n42`` (one argument) is equivalent to ``-n 42`` (two arguments), the code ::
es: Analicemos otra línea de comandos simulada. En esta ocasión, vamos a proporcionar el argumento de la opción pegado junto a la misma, sin separación entre ambos: dado que ``-n42`` (un argumento) es equivalente a ``-n 42`` (dos argumentos), el código::

source: will print ``42``.
es: imprimirá ``42``.

source: If you don't specify a type, :mod:`optparse` assumes ``string``. Combined with the fact that the default action is ``store``, that means our first example can be a lot shorter::
es: Si no se especifica un tipo, :mod:`optparse` asume ``string``. Esto, combinado con el hecho de que la acción predeterminada es ``store``, implica que nuestro primer ejemplo puede implementarse de forma mucho más concisa::

source: If you don't supply a destination, :mod:`optparse` figures out a sensible default from the option strings: if the first long option string is ``--foo-bar``, then the default destination is ``foo_bar``. If there are no long option strings, :mod:`optparse` looks at the first short option string: the default destination for ``-f`` is ``f``.
es: Si no se proporciona un destino, :mod:`optparse` infiere un destino por defecto adecuado a partir de las cadenas de opción proporcionadas: si la primera cadena de opción larga es ``--foo-bar``, entonces el destino predeterminado es ``foo_bar``. Si no hay cadenas de opción largas, :mod:`optparse` mira la primera cadena de opción corta: por ejemplo, el destino predeterminado para ``-f`` es ``f``.

source: :mod:`optparse` also includes the built-in ``complex`` type. Adding types is covered in section :ref:`optparse-extending-optparse`.
es: :mod:`optparse` también incluye el tipo incorporado ``complex``. La adición de nuevos tipos se cubre en la sección :ref:`optparse-extending-optparse`.

source: Handling boolean (flag) options
es: Manejo de opciones booleanas (flags)

source: Flag options---set a variable to true or false when a particular option is seen---are quite common. :mod:`optparse` supports them with two separate actions, ``store_true`` and ``store_false``. For example, you might have a ``verbose`` flag that is turned on with ``-v`` and off with ``-q``::
es: Las opciones flags\ ---establecen una variable en verdadero o falso cuando se encuentra una opción en particular--- son bastante comunes. :mod:`optparse` las admite con dos acciones diferenciadas, ``store_true`` y ``store_false``. Por ejemplo, puedes tener un flag ``verbose`` que se activa con ``-v`` y se desactiva con ``-q``::

source: Here we have two different options with the same destination, which is perfectly OK. (It just means you have to be a bit careful when setting default values---see below.)
es: Aquí tenemos dos opciones diferentes con el mismo destino, lo cual es totalmente correcto. Solo significa que debes tener un poco de cuidado al establecer los valores predeterminados, lo veremos a continuación.

source: When :mod:`optparse` encounters ``-v`` on the command line, it sets ``options.verbose`` to ``True``; when it encounters ``-q``, ``options.verbose`` is set to ``False``.
es: Cuando :mod:`optparse` encuentra ``-v`` en la línea de comandos, establece ``options.verbose`` en ``True``; cuando encuentra ``-q``, ``options.verbose`` se establece en ``False``.

source: Other actions
es: Otras acciones

source: Some other actions supported by :mod:`optparse` are:
es: Algunas de las otras acciones soportadas por :mod:`optparse` son:

source: store a constant value, pre-set via :attr:`Option.const`
es: almacena un valor de constante, preestablecida vía :attr:`Option.const`

source: append this option's argument to a list
es: agrega el argumento de esta opción a una lista

source: increment a counter by one
es: incrementa un contador en uno

source: call a specified function
es: llama a una función específica

source: These are covered in section :ref:`optparse-reference-guide`, and section :ref:`optparse-option-callbacks`.
es: Estas acciones se tratan en la sección :ref:`optparse-reference-guide` y en la sección :ref:`optparse-option-callbacks`.

source: Default values
es: Valores por defecto

source: All of the above examples involve setting some variable (the "destination") when certain command-line options are seen. What happens if those options are never seen? Since we didn't supply any defaults, they are all set to ``None``. This is usually fine, but sometimes you want more control. :mod:`optparse` lets you supply a default value for each destination, which is assigned before the command line is parsed.
es: Todos los ejemplos anteriores implican establecer alguna variable (el "destino") cuando aparecen ciertas opciones en la línea de comandos. ¿Qué pasa si esas opciones nunca se encuentran? Dado que no proporcionamos ningún valor predeterminado, todas las variables están establecidas en ``None``. Por lo general, esto está bien, pero a veces se desea tener más control. :mod:`optparse` permite proporcionar un valor predeterminado para cada destino, que es asignado antes de analizar la línea de comandos.

source: First, consider the verbose/quiet example. If we want :mod:`optparse` to set ``verbose`` to ``True`` unless ``-q`` is seen, then we can do this::
es: Primero, considera el ejemplo verbose/quiet anterior. Si queremos que :mod:`optparse` establezca ``verbose`` en ``True`` a menos que encuentre ``-q``, entonces podemos hacer lo siguiente::

source: Since default values apply to the *destination* rather than to any particular option, and these two options happen to have the same destination, this is exactly equivalent::
es: Dado que los valores predeterminados se aplican a *destination* en lugar de a cualquier opción en particular y que estas dos opciones tienen el mismo destino, lo anterior es exactamente equivalente a:

source: Consider this::
es: Considera lo siguiente::

source: Again, the default value for ``verbose`` will be ``True``: the last default value supplied for any particular destination is the one that counts.
es: Nuevamente, el valor predeterminado para ``verbose`` será ``True``: el último valor predeterminado proporcionado para cualquier destino en particular es el único que se tendrá en cuenta.

source: A clearer way to specify default values is the :meth:`set_defaults` method of OptionParser, which you can call at any time before calling :meth:`~OptionParser.parse_args`::
es: Una forma más clara de especificar valores predeterminados es el método :meth:`set_defaults` de OptionParser, al que puedes llamar en cualquier momento antes de llamar a :meth:`~OptionParser.parse_args`::

source: As before, the last value specified for a given option destination is the one that counts. For clarity, try to use one method or the other of setting default values, not both.
es: Como vimos antes, el último valor especificado para un destino de opción dado es el que cuenta. Para mayor claridad, intenta utilizar un método u otro para establecer valores predeterminados, no ambos.

source: Generating help
es: Generando ayuda

source: :mod:`optparse`'s ability to generate help and usage text automatically is useful for creating user-friendly command-line interfaces. All you have to do is supply a :attr:`~Option.help` value for each option, and optionally a short usage message for your whole program. Here's an OptionParser populated with user-friendly (documented) options::
es: La capacidad de :mod:`optparse` para generar ayuda y texto de uso automáticamente es útil para crear interfaces de línea de comandos fáciles de usar. Todo lo que tienes que hacer es proporcionar un valor :attr:`~ Option.help` para cada opción y, opcionalmente, un breve mensaje de uso para el programa en general. A continuación hay un OptionParser al que se le han añadido múltiples opciones fáciles de usar (documentadas)::

source: If :mod:`optparse` encounters either ``-h`` or ``--help`` on the command-line, or if you just call :meth:`parser.print_help`, it prints the following to standard output:
es: Si :mod:`optparse` encuentra ``-h`` o ``--help`` en la línea de comandos, o si simplemente se llama al método :meth:`parser.print_help`, se imprime lo siguiente en la salida estándar:

source: (If the help output is triggered by a help option, :mod:`optparse` exits after printing the help text.)
es: (Si la salida de ayuda se activa mediante una opción de ayuda, :mod:`optparse` termina la ejecución después de imprimir el texto de ayuda.)

source: There's a lot going on here to help :mod:`optparse` generate the best possible help message:
es: Estamos haciendo muchas cosas aquí con el fin de ayudar a que :mod:`optparse` genere el mejor mensaje de ayuda posible:

source: the script defines its own usage message::
es: el script define su propio mensaje de uso::

source: :mod:`optparse` expands ``%prog`` in the usage string to the name of the current program, i.e. ``os.path.basename(sys.argv[0])``. The expanded string is then printed before the detailed option help.
es: :mod:`optparse` expande ``% prog`` en la cadena de uso reemplazándolo por el nombre del programa actual, es decir, ``os.path.basename (sys.argv [0])``. A continuación, la cadena expandida se imprime antes de la ayuda detallada de la opción.

source: If you don't supply a usage string, :mod:`optparse` uses a bland but sensible default: ``"Usage: %prog [options]"``, which is fine if your script doesn't take any positional arguments.
es: Si no proporcionas una cadena de uso, :mod:`optparse` usa un valor predeterminado anodino pero apropiado: ``"Usage: %prog [options]"``, lo cual está bien si tu script no toma ningún argumento posicional.

source: every option defines a help string, and doesn't worry about line-wrapping---\ :mod:`optparse` takes care of wrapping lines and making the help output look good.
es: cada opción simplemente define una cadena de ayuda y no se preocupa por el ajuste de línea. :mod:`optparse` se encarga de ajustar las líneas y hacer que la salida de ayuda se vea bien.

source: options that take a value indicate this fact in their automatically generated help message, e.g. for the "mode" option::
es: las opciones que toman un valor indican este hecho en su mensaje de ayuda generado automáticamente, por ejemplo, para la opción "mode"::

source: Here, "MODE" is called the meta-variable: it stands for the argument that the user is expected to supply to ``-m``/``--mode``. By default, :mod:`optparse` converts the destination variable name to uppercase and uses that for the meta-variable. Sometimes, that's not what you want---for example, the ``--filename`` option explicitly sets ``metavar="FILE"``, resulting in this automatically generated option description::
es: Aquí, a "MODE" se le denomina una metavariable: representa el argumento que se espera que el usuario proporcione a ``-m``/``--mode``. De forma predeterminada, :mod:`optparse` convierte el nombre de la variable de destino a mayúsculas y lo usa para la metavariable. En ocasiones, eso no es lo que se desea, por ejemplo, la opción ``--filename`` establece explícitamente ``metavar="FILE"``, lo que da como resultado la siguiente descripción de opción generada automáticamente::

source: This is important for more than just saving space, though: the manually written help text uses the meta-variable ``FILE`` to clue the user in that there's a connection between the semi-formal syntax ``-f FILE`` and the informal semantic description "write output to FILE". This is a simple but effective way to make your help text a lot clearer and more useful for end users.
es: Sin embargo, esto es importante para algo más que para ahorrar espacio: el texto de ayuda escrito manualmente utiliza la metavariable ``FILE`` para indicarle al usuario que hay una conexión entre la sintaxis semiformal ``-f FILE`` y la descripción semántica informal "escribir la salida en FILE". Esta es una manera simple pero efectiva de hacer que tu texto de ayuda sea mucho más claro y útil para los usuarios finales.

source: options that have a default value can include ``%default`` in the help string---\ :mod:`optparse` will replace it with :func:`str` of the option's default value. If an option has no default value (or the default value is ``None``), ``%default`` expands to ``none``.
es: las opciones que tienen un valor predeterminado pueden incluir ``%default`` en la cadena de ayuda, en cuyo caso, :mod:`optparse` lo reemplazará por el resultado de aplicar :func:`str` al valor por defecto de esa opción. Si una opción no tiene un valor por defecto (o el valor por defecto es ``None``), ``%default`` se reemplazará por ``none``.

source: Grouping Options
es: Agrupando opciones

source: When dealing with many options, it is convenient to group these options for better help output. An :class:`OptionParser` can contain several option groups, each of which can contain several options.
es: Cuando se trabaja con muchas opciones, suele ser conveniente agruparlas para obtener una mejor salida de ayuda. La clase :class:`OptionParser` puede contener varios grupos de opciones, cada uno de los cuales puede contener múltiples opciones.

source: An option group is obtained using the class :class:`OptionGroup`:
es: Podemos obtener un grupo de opciones usando la clase :class:`OptionGroup`:

source: where
es: donde

source: parser is the :class:`OptionParser` instance the group will be inserted in to
es: *parser* es la instancia de :class:`OptionParser` en la que se insertará el grupo

source: title is the group title
es: *title* es el título dado al grupo

source: description, optional, is a long description of the group
es: *description*, opcional, es la descripción larga del grupo

source: :class:`OptionGroup` inherits from :class:`OptionContainer` (like :class:`OptionParser`) and so the :meth:`add_option` method can be used to add an option to the group.
es: la clase :class:`OptionGroup` hereda de :class:`OptionContainer` (al igual que :class:`OptionParser`), por lo que el método :meth:`add_option` se puede usar para agregar una opción al grupo.

source: Once all the options are declared, using the :class:`OptionParser` method :meth:`add_option_group` the group is added to the previously defined parser.
es: Una vez que se han declarado todas las opciones, usando el método :meth:`add_option_group` de la clase :class:`OptionParser` el grupo se agrega al analizador sintáctico previamente definido.

source: Continuing with the parser defined in the previous section, adding an :class:`OptionGroup` to a parser is easy::
es: Agregar un :class:`OptionGroup` a un analizador es fácil, continuando con el analizador definido en la sección anterior::

source: This would result in the following help output:
es: Esto daría como resultado la siguiente salida de ayuda:

source: A bit more complete example might involve using more than one group: still extending the previous example::
es: Un ejemplo un poco más completo podría implicar el uso de más de un grupo, ampliando el ejemplo anterior::

source: that results in the following output:
es: lo que da como resultado la siguiente salida:

source: Another interesting method, in particular when working programmatically with option groups is:
es: Otro método interesante, particularmente cuando se trabaja programáticamente con grupos de opciones, es:

source: Return the :class:`OptionGroup` to which the short or long option string *opt_str* (e.g. ``'-o'`` or ``'--option'``) belongs. If there's no such :class:`OptionGroup`, return ``None``.
es: Retorna el :class:`OptionGroup` al que pertenece la cadena de opción corta o larga *opt_str* (por ejemplo, ``'-o'`` o ``' --option'``). Si no existe dicho :class:`OptionGroup`, el método retorna ``None``.

source: Printing a version string
es: Imprimir una cadena de caracteres con la versión del programa

source: Similar to the brief usage string, :mod:`optparse` can also print a version string for your program. You have to supply the string as the ``version`` argument to OptionParser::
es: De forma similar a lo que ocurre con la cadena de uso abreviada, :mod:`optparse` también puede imprimir una cadena de versión para tu programa. Debes proporcionar la cadena mediante el argumento ``version`` de OptionParser::

source: ``%prog`` is expanded just like it is in ``usage``. Apart from that, ``version`` can contain anything you like. When you supply it, :mod:`optparse` automatically adds a ``--version`` option to your parser. If it encounters this option on the command line, it expands your ``version`` string (by replacing ``%prog``), prints it to stdout, and exits.
es: ``%prog`` se expande al igual que en ``usage``. Aparte de eso, ``version`` puede contener cualquier cosa que desees. Cuando se proporciona, :mod:`optparse` agrega automáticamente una opción ``--version`` al analizador. Si encuentra esta opción en la línea de comandos, expande la cadena ``version`` (reemplazando ``%prog``), la imprime en la salida estándar y termina la ejecución.

source: For example, if your script is called ``/usr/bin/foo``:
es: Por ejemplo, si tu script se llama ``/usr/bin/foo``:

source: The following two methods can be used to print and get the ``version`` string:
es: Para imprimir y obtener la cadena de caracteres ``version``, se pueden utilizar cualquiera de los siguientes métodos:

source: Print the version message for the current program (``self.version``) to *file* (default stdout). As with :meth:`print_usage`, any occurrence of ``%prog`` in ``self.version`` is replaced with the name of the current program. Does nothing if ``self.version`` is empty or undefined.
es: Imprime el mensaje con la versión del programa actual (``self.version``) en *file* (por defecto, la salida estándar). Al igual que con :meth:`print_usage`, cualquier aparición de ``%prog`` en ``self.version`` se reemplaza con el nombre del programa actual. El método no hace nada si ``self.version`` está vacío o no está definido.

source: Same as :meth:`print_version` but returns the version string instead of printing it.
es: Igual que :meth:`print_version`, pero retorna la cadena de versión en lugar de imprimirla.

source: How :mod:`optparse` handles errors
es: Cómo maneja los errores el módulo :mod:`optparse`

source: There are two broad classes of errors that :mod:`optparse` has to worry about: programmer errors and user errors. Programmer errors are usually erroneous calls to :func:`OptionParser.add_option`, e.g. invalid option strings, unknown option attributes, missing option attributes, etc. These are dealt with in the usual way: raise an exception (either :exc:`optparse.OptionError` or :exc:`TypeError`) and let the program crash.
es: A grandes rasgos, hay dos clases de errores de los que :mod:`optparse` tiene que preocuparse: errores del programador y errores del usuario. Los errores del programador suelen ser el resultado de llamadas erróneas a :func:`OptionParser.add_option`, como cadenas de opción no válidas, atributos de opción desconocidos, atributos de opción que faltan, etc. Se tratan de la forma habitual: generan una excepción (ya sea :exc:`optparse.OptionError` o :exc:`TypeError`) y hacen que el programa se bloquee.

source: Handling user errors is much more important, since they are guaranteed to happen no matter how stable your code is. :mod:`optparse` can automatically detect some user errors, such as bad option arguments (passing ``-n 4x`` where ``-n`` takes an integer argument), missing arguments (``-n`` at the end of the command line, where ``-n`` takes an argument of any type). Also, you can call :func:`OptionParser.error` to signal an application-defined error condition::
es: Manejar los errores del usuario es mucho más importante, ya que está garantizado que sucederán sin importar cuán estable sea el código. :mod:`optparse` puede detectar automáticamente algunos errores del usuario, como argumentos de opción incorrectos (pasar ``-n 4x`` donde ``-n`` toma un argumento entero) o la falta de argumentos (``-n`` al final de la línea de comandos, donde ``-n`` toma un argumento de cualquier tipo). Además de esto, puedes llamar a :func:`OptionParser.error` para establecer una condición de error definida por la propia aplicación::

source: In either case, :mod:`optparse` handles the error the same way: it prints the program's usage message and an error message to standard error and exits with error status 2.
es: En cualquier caso, :mod:`optparse` maneja el error de la misma manera: imprime el mensaje de uso del programa junto a un mensaje de error en la salida de errores estándar y termina la ejecución con el estado de error 2.

source: Consider the first example above, where the user passes ``4x`` to an option that takes an integer:
es: Considera el primero de los dos ejemplos anteriores, donde el usuario pasa ``4x`` a una opción que toma un número entero:

source: Or, where the user fails to pass a value at all:
es: O, en el caso en el que el usuario definitivamente no pase ningún valor:

source: :mod:`optparse`\ -generated error messages take care always to mention the option involved in the error; be sure to do the same when calling :func:`OptionParser.error` from your application code.
es: Los mensajes de error generados por :mod:`optparse` tienen siempre cuidado de mencionar la opción involucrada en el error. Asegúrate de hacer lo mismo cuando llames a :func:`OptionParser.error` desde el código de tu aplicación.

source: If :mod:`optparse`'s default error-handling behaviour does not suit your needs, you'll need to subclass OptionParser and override its :meth:`~OptionParser.exit` and/or :meth:`~OptionParser.error` methods.
es: Si el comportamiento del manejo de errores predeterminado de :mod:`optparse` no se adapta a tus necesidades, deberás subclasificar OptionParser y redefinir su método :meth:`~OptionParser.exit` y/o :meth:`~OptionParser.error`.

source: Putting it all together
es: Reuniendo todas las piezas
