Repository: python/python-docs-es
Catalog: library/optparse.po
Languages: es

source: ``"append"`` [relevant: :attr:`~Option.type`, :attr:`~Option.dest`, :attr:`~Option.nargs`, :attr:`~Option.choices`]
es: ``"append"`` [atributos relacionados: :attr:`~Option.type`, :attr:`~Option.dest`, :attr:`~Option.nargs`, :attr:`~Option.choices`]

source: The option must be followed by an argument, which is appended to the list in :attr:`~Option.dest`. If no default value for :attr:`~Option.dest` is supplied, an empty list is automatically created when :mod:`optparse` first encounters this option on the command-line. If :attr:`~Option.nargs` > 1, multiple arguments are consumed, and a tuple of length :attr:`~Option.nargs` is appended to :attr:`~Option.dest`.
es: La opción debe ir seguida de un argumento, que se añade a la lista de :attr:`~Option.dest`. Si no se proporciona un valor predeterminado para :attr:`~Option.dest`, se crea automáticamente una lista vacía cuando :mod:`optparse` encuentra por primera vez esta opción en la línea de comandos. Si :attr:`~Option.nargs` es mayor que 1, se consumen varios argumentos y se agrega una tupla de longitud :attr:`~Option.nargs` a :attr:`~Option.dest`.

source: The defaults for :attr:`~Option.type` and :attr:`~Option.dest` are the same as for the ``"store"`` action.
es: Los valores por defecto para los atributos :attr:`~Option.type` y :attr:`~Option.dest` son los mismos que para la acción ``"store"``.

source: If ``-t3`` is seen on the command-line, :mod:`optparse` does the equivalent of::
es: Si se encuentra ``-t3`` en la línea de comandos, :mod:`optparse` procede de forma equivalente a::

source: If, a little later on, ``--tracks=4`` is seen, it does::
es: Si, un poco más adelante, se encuentra ``--tracks=4``, procede así::

source: The ``append`` action calls the ``append`` method on the current value of the option. This means that any default value specified must have an ``append`` method. It also means that if the default value is non-empty, the default elements will be present in the parsed value for the option, with any values from the command line appended after those default values::
es: La acción ``append`` llama al método ``append`` con el valor actual de la opción. Esto significa que cualquier valor por defecto especificado debe tener un método ``append``. También significa que si existe un valor por defecto, los elementos por defecto estarán presentes en el valor analizado para la opción, con todos los valores de la línea de comandos agregados a la lista a continuación de ellos::

source: ``"append_const"`` [required: :attr:`~Option.const`; relevant: :attr:`~Option.dest`]
es: ``"append_const"`` [atributo requerido: :attr:`~Option.const`; atributo relacionado: :attr:`~Option.dest`]

source: Like ``"store_const"``, but the value :attr:`~Option.const` is appended to :attr:`~Option.dest`; as with ``"append"``, :attr:`~Option.dest` defaults to ``None``, and an empty list is automatically created the first time the option is encountered.
es: Igual que ``"store_const"``, pero el valor :attr:`~Option.const` se agrega a :attr:`~Option.dest`. Como ocurre con ``"append"``, :attr:`~Option.dest` por defecto es ``None`` y se crea automáticamente una lista vacía la primera vez que se encuentra la opción en la linea de comandos.

source: ``"count"`` [relevant: :attr:`~Option.dest`]
es: ``"count"`` [atributo relacionado: :attr:`~Option.dest`]

source: Increment the integer stored at :attr:`~Option.dest`. If no default value is supplied, :attr:`~Option.dest` is set to zero before being incremented the first time.
es: Incrementa el entero almacenado en :attr:`~Option.dest`. Si no se proporciona un valor por defecto, :attr:`~Option.dest` se establece en cero antes de incrementarse por primera vez.

source: The first time ``-v`` is seen on the command line, :mod:`optparse` does the equivalent of::
es: La primera vez que se encuentra ``-v`` en la línea de comandos, :mod:`optparse` procede de forma equivalente a::

source: Every subsequent occurrence of ``-v`` results in ::
es: Cada aparición posterior de ``-v`` da como resultado::

source: ``"callback"`` [required: :attr:`~Option.callback`; relevant: :attr:`~Option.type`, :attr:`~Option.nargs`, :attr:`~Option.callback_args`, :attr:`~Option.callback_kwargs`]
es: ``"callback"`` [atributo requerido: :attr:`~Option.callback`; atributos relacionados: :attr:`~Option.type`, :attr:`~Option.nargs`, :attr:`~Option.callback_args`, :attr:`~Option.callback_kwargs`]

source: Call the function specified by :attr:`~Option.callback`, which is called as ::
es: Llama a la función especificada por :attr:`~Option.callback`, que es llamada como::

source: See section :ref:`optparse-option-callbacks` for more detail.
es: Ver sección :ref:`optparse-option-callbacks` para más detalles.

source: Prints a complete help message for all the options in the current option parser. The help message is constructed from the ``usage`` string passed to OptionParser's constructor and the :attr:`~Option.help` string passed to every option.
es: Imprime un mensaje de ayuda completo para todas las opciones presentes en el analizador de opciones actual. El mensaje de ayuda se construye a partir de la cadena ``usage``, pasada al constructor de OptionParser, y la cadena :attr:`~Option.help`, pasada a cada opción.

source: If no :attr:`~Option.help` string is supplied for an option, it will still be listed in the help message. To omit an option entirely, use the special value :const:`optparse.SUPPRESS_HELP`.
es: Si no se proporciona una cadena :attr:`~Option.help` para una opción, dicha opción seguirá apareciendo en el mensaje de ayuda. Para omitir una opción por completo, debe usarse el valor especial :const:`optparse.SUPPRESS_HELP`.

source: :mod:`optparse` automatically adds a :attr:`~Option.help` option to all OptionParsers, so you do not normally need to create one.
es: El módulo :mod:`optparse` agrega automáticamente una opción :attr:`~Option.help` a todos los OptionParsers, por lo que normalmente no es necesario crear una.

source: If :mod:`optparse` sees either ``-h`` or ``--help`` on the command line, it will print something like the following help message to stdout (assuming ``sys.argv[0]`` is ``"foo.py"``):
es: Si :mod:`optparse` encuentra ``-h`` o ``--help`` en la línea de comandos, imprimirá un mensaje de ayuda en la salida estándar como el siguiente (asumiendo que ``sys.argv [0]`` es ``"foo.py"``):

source: After printing the help message, :mod:`optparse` terminates your process with ``sys.exit(0)``.
es: Después de imprimir el mensaje de ayuda, :mod:`optparse` termina su proceso con ``sys.exit(0)``.

source: Prints the version number supplied to the OptionParser to stdout and exits. The version number is actually formatted and printed by the ``print_version()`` method of OptionParser. Generally only relevant if the ``version`` argument is supplied to the OptionParser constructor. As with :attr:`~Option.help` options, you will rarely create ``version`` options, since :mod:`optparse` automatically adds them when needed.
es: Imprime el número de versión proporcionado a OptionParser en la salida estándar y termina la ejecución. El número de versión en realidad es formateado e impreso por el método ``print_version()`` de OptionParser. Generalmente solo es relevante si el argumento ``version`` se proporciona al constructor de OptionParser. Al igual que en el caso de las opciones :attr:`~Option.help`, rara vez será necesario crear opciones de ``version``, ya que :mod:`optparse` las agrega automáticamente cuando es necesario.

source: Standard option types
es: Tipos de opción estándares

source: :mod:`optparse` has five built-in option types: ``"string"``, ``"int"``, ``"choice"``, ``"float"`` and ``"complex"``. If you need to add new option types, see section :ref:`optparse-extending-optparse`.
es: El módulo :mod:`optparse` proporciona cinco tipos de opción incorporados: ``"string"``, ``"int"``, ``"choice"``, ``"float"`` y ``"complex"``. Consultar la sección :ref:`optparse-extending-optparse` si se necesitan agregar nuevos tipos de opción.

source: Arguments to string options are not checked or converted in any way: the text on the command line is stored in the destination (or passed to the callback) as-is.
es: Los argumentos de las opciones en la cadena ingresada no se verifican ni se convierten de ninguna manera: el texto de la línea de comandos se almacena en el destino (o se pasa a la retrollamada) tal cual.

source: Integer arguments (type ``"int"``) are parsed as follows:
es: Los argumentos enteros (tipo ``"int"``) se analizan de la siguiente manera:

source: if the number starts with ``0x``, it is parsed as a hexadecimal number
es: si el número comienza con ``0x``, se analiza como un número hexadecimal

source: if the number starts with ``0``, it is parsed as an octal number
es: si el número comienza con ``0``, se analiza como un número octal

source: if the number starts with ``0b``, it is parsed as a binary number
es: si el número comienza con ``0b``, se analiza como un número binario

source: otherwise, the number is parsed as a decimal number
es: en cualquier otro caso, el número se analiza como un número decimal

source: The conversion is done by calling :func:`int` with the appropriate base (2, 8, 10, or 16). If this fails, so will :mod:`optparse`, although with a more useful error message.
es: La conversión se realiza llamando a :func:`int` con la base apropiada (2, 8, 10 o 16). Si esto falla, también lo hará :mod:`optparse`, aunque mostrando un mensaje de error más útil para el usuario.

source: ``"float"`` and ``"complex"`` option arguments are converted directly with :func:`float` and :func:`complex`, with similar error-handling.
es: Los argumentos de las opciones de tipo ``"float"`` y ``"complex"`` se convierten directamente usando :func:`float` y :func:`complex` respectivamente, con un manejo de errores similar.

source: ``"choice"`` options are a subtype of ``"string"`` options. The :attr:`~Option.choices` option attribute (a sequence of strings) defines the set of allowed option arguments. :func:`optparse.check_choice` compares user-supplied option arguments against this master list and raises :exc:`OptionValueError` if an invalid string is given.
es: Las opciones de tipo ``"choice"`` son un subtipo de las opciones ``"string"``. El atributo de opción :attr:`~Option.choices` (que es una secuencia de cadenas) define el conjunto de argumentos de opción permitidos. Posteriormente, :func:`optparse.check_choice` comparará los argumentos de las opciones proporcionadas por el usuario con esta lista maestra y lanzará una excepción :exc:`OptionValueError` si se proporciona una cadena no válida.

source: Parsing arguments
es: Analizando los argumentos

source: The whole point of creating and populating an OptionParser is to call its :meth:`~OptionParser.parse_args` method.
es: El objetivo primario de crear y agregar opciones a un OptionParser es llamar a su método :meth:`~OptionParser.parse_args`.

source: Parse the command-line options found in *args*.
es: Analiza las opciones de la línea de comando encontradas en *args*.

source: The input parameters are
es: Los parámetros de entrada son

source: the list of arguments to process (default: ``sys.argv[1:]``)
es: la lista de argumentos a procesar (por defecto: ``sys.argv [1:]``)

source: an :class:`Values` object to store option arguments in (default: a new instance of :class:`Values`) -- if you give an existing object, the option defaults will not be initialized on it
es: un objeto de la clase :class:`Values` para almacenar en él los argumentos de las opciones (por defecto: es una nueva instancia de la clase :class:`Values`) -- si se proporciona un objeto previamente creado, los valores predeterminados de la opción no se inicializarán en el mismo

source: and the return value is a pair ``(options, args)`` where
es: y los valores de retorno es un par ``(options, args)`` donde

source: the same object that was passed in as *values*, or the ``optparse.Values`` instance created by :mod:`optparse`
es: el mismo objeto que se pasó como *values*, o la instancia ``optparse.Values`` creada por :mod:`optparse`

source: the leftover positional arguments after all options have been processed
es: los argumentos posicionales que quedan en la linea de comandos después de que se hayan procesado todas las opciones

source: The most common usage is to supply neither keyword argument. If you supply ``values``, it will be modified with repeated :func:`setattr` calls (roughly one for every option argument stored to an option destination) and returned by :meth:`~OptionParser.parse_args`.
es: El uso más habitual es no proporcionar ningún argumento por palabra clave. Si se proporciona ``values``, dicho argumento será modificado mediante llamadas repetidas a :func:`setattr` (aproximadamente una por cada argumento de opción a almacenar en un destino de opción) y finalmente será retornado por el método :meth:`~OptionParser.parse_args`.

source: If :meth:`~OptionParser.parse_args` encounters any errors in the argument list, it calls the OptionParser's :meth:`error` method with an appropriate end-user error message. This ultimately terminates your process with an exit status of 2 (the traditional Unix exit status for command-line errors).
es: Si el método :meth:`~OptionParser.parse_args` encuentra algún error en la lista de argumentos, llama al método :meth:`error` de OptionParser con un mensaje de error apropiado para el usuario final. Esto causa que el proceso termine con un estado de salida de 2 (el estado de salida tradicional en Unix para errores en la línea de comandos).

source: Querying and manipulating your option parser
es: Consultar y manipular el analizador de opciones

source: The default behavior of the option parser can be customized slightly, and you can also poke around your option parser and see what's there. OptionParser provides several methods to help you out:
es: El comportamiento predeterminado del analizador de opciones se puede personalizar ligeramente. También se puede indagar en el analizador de opciones y ver qué hay en él. OptionParser proporciona varios métodos para ayudar con éstos propósitos:

source: Set parsing to stop on the first non-option. For example, if ``-a`` and ``-b`` are both simple options that take no arguments, :mod:`optparse` normally accepts this syntax::
es: Configura el análisis para que se detenga en lo primero que encuentre que no sea una opción. Por ejemplo, si ``-a`` y ``-b`` son opciones simples que no toman argumentos, :mod:`optparse` normalmente acepta esta sintaxis::

source: and treats it as equivalent to ::
es: y la trata de forma equivalente a::

source: To disable this feature, call :meth:`disable_interspersed_args`. This restores traditional Unix syntax, where option parsing stops with the first non-option argument.
es: Para deshabilitar esta funcionalidad, se debe llamar al método :meth:`disable_interspersed_args`. Esto restaura la sintaxis tradicional usada en Unix, donde el análisis de opción se detiene con el primer argumento que no es una opción.

source: Use this if you have a command processor which runs another command which has options of its own and you want to make sure these options don't get confused. For example, each command might have a different set of options.
es: Se debe usar este método si se dispone de un procesador de comandos que ejecuta otro comando con sus propias opciones y se desea asegurarse de que estas opciones no se confunden entre si. Lo que puede ocurrir si, por ejemplo, cada comando tiene un conjunto diferente de opciones.

source: Set parsing to not stop on the first non-option, allowing interspersing switches with command arguments. This is the default behavior.
es: Configura el análisis para que no se detenga si encuentra un argumento que no sea una opción, lo que permite intercalar modificadores con argumentos de linea de comandos. Este es el comportamiento por defecto.

source: Returns the Option instance with the option string *opt_str*, or ``None`` if no options have that option string.
es: Retorna la instancia de Option con la cadena de opción *opt_str*, o ``None`` si ninguna opción tiene esa cadena de opción.

source: Return ``True`` if the OptionParser has an option with option string *opt_str* (e.g., ``-q`` or ``--verbose``).
es: Retorna ``True`` si OptionParser tiene una opción con la cadena de opción *opt_str* (por ejemplo, ``-q`` o ``--verbose``).

source: If the :class:`OptionParser` has an option corresponding to *opt_str*, that option is removed. If that option provided any other option strings, all of those option strings become invalid. If *opt_str* does not occur in any option belonging to this :class:`OptionParser`, raises :exc:`ValueError`.
es: Si :class:`OptionParser` tiene una opción correspondiente a *opt_str*, esa opción es eliminada. Si esa opción proporcionó cualquier otra cadena de opción, todas esas cadenas de opción quedan invalidadas. Si *opt_str* no aparece en ninguna opción que pertenezca a este :class:`OptionParser`, se lanza una excepción :exc:`ValueError`.

source: Conflicts between options
es: Conflictos entre opciones

source: If you're not careful, it's easy to define options with conflicting option strings::
es: Si no se tiene cuidado, es fácil definir opciones con cadenas de opción en conflicto entre si::

source: (This is particularly true if you've defined your own OptionParser subclass with some standard options.)
es: (Esto es particularmente cierto si se ha definido una subclase propia de OptionParser con algunas opciones estándar.)

source: Every time you add an option, :mod:`optparse` checks for conflicts with existing options. If it finds any, it invokes the current conflict-handling mechanism. You can set the conflict-handling mechanism either in the constructor::
es: Cada vez que se agrega una opción, :mod:`optparse` comprueba si existen conflictos con las opciones ya existentes. Si encuentra alguno, invoca el mecanismo de manejo de conflictos actualmente establecido. Se puede establecer el mecanismo de manejo de conflictos desde el propio constructor::

source: or with a separate call::
es: o mediante una llamada separada::

source: The available conflict handlers are:
es: Los administradores de conflictos disponibles son:

source: ``"error"`` (default)
es: ``"error"`` (por defecto)

source: assume option conflicts are a programming error and raise :exc:`OptionConflictError`
es: se asume que los conflictos entre opciones son un error de programación y, por tanto, generarán una excepción :exc:`OptionConflictError`

source: resolve option conflicts intelligently (see below)
es: resuelve conflictos de opciones de forma inteligente (ver más abajo)

source: As an example, let's define an :class:`OptionParser` that resolves conflicts intelligently and add conflicting options to it::
es: Como ejemplo, vamos a definir un :class:`OptionParser` que resuelva conflictos de manera inteligente y agregaremos algunas opciones conflictivas::

source: At this point, :mod:`optparse` detects that a previously added option is already using the ``-n`` option string. Since ``conflict_handler`` is ``"resolve"``, it resolves the situation by removing ``-n`` from the earlier option's list of option strings. Now ``--dry-run`` is the only way for the user to activate that option. If the user asks for help, the help message will reflect that::
es: En este punto, :mod:`optparse` detecta que una opción agregada anteriormente ya está usando la cadena de opción ``-n``. Dado que ``conflict_handler`` es ``"resolve"``, resuelve la situación eliminando ``-n`` de la lista de cadenas de opción de la opción previa. Ahora ``--dry-run`` es la única forma que el usuario tiene para poder activar esa opción. Si el usuario solicita ayuda, el mensaje de ayuda reflejará la nueva situación::

source: It's possible to whittle away the option strings for a previously added option until there are none left, and the user has no way of invoking that option from the command-line. In that case, :mod:`optparse` removes that option completely, so it doesn't show up in help text or anywhere else. Carrying on with our existing OptionParser::
es: Es posible reducir las cadenas de opción para una opción agregada previamente hasta que no quede ninguna, de forma que el usuario no tenga forma de invocar esa opción desde la línea de comandos. En ese caso, :mod:`optparse` eliminará esa opción por completo, por lo que no aparecerá en el texto de ayuda ni en ningún otro lugar. Continuando con nuestro analizador de opciones existente OptionParser::

source: At this point, the original ``-n``/``--dry-run`` option is no longer accessible, so :mod:`optparse` removes it, leaving this help text::
es: En este punto, la opción original ``-n``/``--dry-run`` ya no es accesible, por lo que :mod:`optparse` la elimina, dejando el siguiente texto de ayuda::

source: Cleanup
es: Limpieza

source: OptionParser instances have several cyclic references. This should not be a problem for Python's garbage collector, but you may wish to break the cyclic references explicitly by calling :meth:`~OptionParser.destroy` on your OptionParser once you are done with it. This is particularly useful in long-running applications where large object graphs are reachable from your OptionParser.
es: Las instancias de OptionParser tienen varias referencias cíclicas. Esto no debería ser un problema para el recolector de basura de Python, pero es posible que se desee romper las referencias cíclicas explícitamente llamando al método :meth:`~OptionParser.destroy` de la instancia OptionParser una vez que se haya terminado. Esto es particularmente útil en aplicaciones de larga ejecución en las que OptionParser puede terminar accediendo a grafos de objetos considerablemente grandes.

source: Other methods
es: Otros métodos

source: OptionParser supports several other public methods:
es: OptionParser admite varios métodos públicos más:

source: Set the usage string according to the rules described above for the ``usage`` constructor keyword argument. Passing ``None`` sets the default usage string; use :const:`optparse.SUPPRESS_USAGE` to suppress a usage message.
es: Establece la cadena de caracteres de uso de acuerdo a las reglas descritas anteriormente para el argumento por palabra clave ``usage`` del constructor. Pasando ``None`` se establece la cadena de uso por defecto; use el valor especial :data:`optparse.SUPPRESS_USAGE` para suprimir el mensaje de uso.

source: Print the usage message for the current program (``self.usage``) to *file* (default stdout). Any occurrence of the string ``%prog`` in ``self.usage`` is replaced with the name of the current program. Does nothing if ``self.usage`` is empty or not defined.
es: Imprime el mensaje de uso del programa actual (``self.usage``) en *file* (que por defecto es la salida estándar). Cualquier aparición de la cadena de caracteres ``%prog`` en ``self.usage`` es reemplazada con el nombre del programa actual. No hace nada si ``self.usage`` está vacío o no ha sido definido.

source: Same as :meth:`print_usage` but returns the usage string instead of printing it.
es: Igual que :meth:`print_usage` pero retorna la cadena de uso en vez de imprimirla.
