Repository: python/python-docs-es
Catalog: library/optparse.po
Languages: es

source: Here's what :mod:`optparse`\ -based scripts usually look like::
es: Así es como los scripts basados en :mod:`optparse` usualmente se ven:

source: Reference Guide
es: Guía de referencia

source: Creating the parser
es: Creando el analizador sintáctico (parser)

source: The first step in using :mod:`optparse` is to create an OptionParser instance.
es: El primer paso para poder usar :mod:`optparse` es crear una instancia de OptionParser.

source: The OptionParser constructor has no required arguments, but a number of optional keyword arguments. You should always pass them as keyword arguments, i.e. do not rely on the order in which the arguments are declared.
es: El constructor de la clase OptionParser no tiene argumentos obligatorios, pero sí varios argumentos opcionales por palabra clave. Siempre deben pasarse como argumentos por palabras clave, es decir, no se debe confiar nunca en el orden en que se declaran los argumentos.

source: ``usage`` (default: ``"%prog [options]"``)
es: ``usage`` (por defecto: ``"%prog [options]"``)

source: The usage summary to print when your program is run incorrectly or with a help option. When :mod:`optparse` prints the usage string, it expands ``%prog`` to ``os.path.basename(sys.argv[0])`` (or to ``prog`` if you passed that keyword argument). To suppress a usage message, pass the special value :const:`optparse.SUPPRESS_USAGE`.
es: El resumen de uso a imprimir cuando el programa se ejecuta incorrectamente o con una opción de ayuda. Cuando :mod:`optparse` imprime la cadena de uso, reemplaza ``%prog`` con ``os.path.basename(sys.argv[0])`` (o con ``prog`` si se proporcionó eso argumento por palabra clave). Para suprimir un mensaje de uso, se debe pasar el valor especial :const:`optparse.SUPPRESS_USAGE`.

source: ``option_list`` (default: ``[]``)
es: ``option_list`` (por defecto: ``[]``)

source: A list of Option objects to populate the parser with. The options in ``option_list`` are added after any options in ``standard_option_list`` (a class attribute that may be set by OptionParser subclasses), but before any version or help options. Deprecated; use :meth:`add_option` after creating the parser instead.
es: Una lista de objetos Option con los que poblar el analizador. Las opciones en ``option_list`` se agregan después de cualquier opción en ``standard_option_list`` (un atributo de clase que puede ser establecido por las subclases de OptionParser), pero antes de cualquier versión u opción de ayuda. Obsoleto: usar en su lugar el método :meth:`add_option`, una vez creado el analizador.

source: ``option_class`` (default: optparse.Option)
es: ``option_class`` (por defecto: *optparse.Option*)

source: Class to use when adding options to the parser in :meth:`add_option`.
es: Clase usada por el método :meth:`add_option` para añadir opciones al analizador.

source: ``version`` (default: ``None``)
es: ``version`` (por defecto: ``None``)

source: A version string to print when the user supplies a version option. If you supply a true value for ``version``, :mod:`optparse` automatically adds a version option with the single option string ``--version``. The substring ``%prog`` is expanded the same as for ``usage``.
es: Una cadena de caracteres con la versión del programa a imprimir cuando el usuario proporciona una opción de versión. Si se proporciona un valor verdadero para ``version``, :mod:`optparse` agrega automáticamente una opción de versión con ``--version`` como única cadena de opción. La subcadena ``%prog`` se expande de la misma manera que en ``usage``.

source: ``conflict_handler`` (default: ``"error"``)
es: ``conflict_handler`` (por defecto: ``"error"``)

source: Specifies what to do when options with conflicting option strings are added to the parser; see section :ref:`optparse-conflicts-between-options`.
es: Especifica qué hacer cuando se agregan al analizador opciones con cadenas de opción en conflicto entre si. Ver sección :ref:`optparse-conflicts-between-options`.

source: ``description`` (default: ``None``)
es: ``description`` (por defecto: ``None``)

source: A paragraph of text giving a brief overview of your program. :mod:`optparse` reformats this paragraph to fit the current terminal width and prints it when the user requests help (after ``usage``, but before the list of options).
es: Un párrafo de texto que ofrece una breve descripción del programa. :mod:`optparse` reformatea este párrafo para que se ajuste al ancho actual de la terminal y lo imprime cuando el usuario solicita ayuda (después de ``usage``, pero antes de la lista de opciones).

source: ``formatter`` (default: a new :class:`IndentedHelpFormatter`)
es: ``formatter`` (por defecto: una nueva instancia de la clase :class:`IndentedHelpFormatter`)

source: An instance of optparse.HelpFormatter that will be used for printing help text. :mod:`optparse` provides two concrete classes for this purpose: IndentedHelpFormatter and TitledHelpFormatter.
es: Una instancia de la clase optparse.HelpFormatter que será usada para imprimir el texto de ayuda. El módulo :mod:`optparse` proporciona dos clases concretas para este propósito: IndentedHelpFormatter y TitledHelpFormatter.

source: ``add_help_option`` (default: ``True``)
es: ``add_help_option`` (por defecto: ``True``)

source: If true, :mod:`optparse` will add a help option (with option strings ``-h`` and ``--help``) to the parser.
es: Si es verdadero, :mod:`optparse` agregará al analizador una opción de ayuda (con las cadenas de opción ``-h`` y ``--help``).

source: The string to use when expanding ``%prog`` in ``usage`` and ``version`` instead of ``os.path.basename(sys.argv[0])``.
es: La cadena de caracteres a usar como substituta de ``os.path.basename(sys.argv[0])`` cuando se expanda ``%prog`` en ``usage`` y en ``version``.

source: ``epilog`` (default: ``None``)
es: ``epilog`` (por defecto: ``None``)

source: A paragraph of help text to print after the option help.
es: Un párrafo con texto de ayuda que se imprimirá después de la opción de ayuda.

source: Populating the parser
es: Completando el analizador con opciones

source: There are several ways to populate the parser with options. The preferred way is by using :meth:`OptionParser.add_option`, as shown in section :ref:`optparse-tutorial`. :meth:`add_option` can be called in one of two ways:
es: Hay varias formas de agregar las opciones al analizador. La forma preferida es mediante el método :meth:`OptionParser.add_option`, tal como se muestra en la sección del :ref:`optparse-tutorial`. El método :meth:`add_option` se puede llamar de dos formas diferentes:

source: pass it an Option instance (as returned by :func:`make_option`)
es: pasándole una instancia de Option (como la que retorna :func:`make_option`)

source: pass it any combination of positional and keyword arguments that are acceptable to :func:`make_option` (i.e., to the Option constructor), and it will create the Option instance for you
es: pasándole cualquier combinación de argumentos posicionales y por palabra clave que sean aceptables para :func:`make_option` (es decir, para el constructor de la clase Option), lo que creará la instancia Option automáticamente

source: The other alternative is to pass a list of pre-constructed Option instances to the OptionParser constructor, as in::
es: La otra alternativa es pasar una lista de instancias de Option previamente construidas al constructor OptionParser, como en el siguiente ejemplo::

source: (:func:`make_option` is a factory function for creating Option instances; currently it is an alias for the Option constructor. A future version of :mod:`optparse` may split Option into several classes, and :func:`make_option` will pick the right class to instantiate. Do not instantiate Option directly.)
es: (:func:`make_option` es una función fábrica para crear instancias Option. Actualmente es simplemente un alias para el constructor Option, pero es posible que una futura versión de :mod:`optparse` pueda dividir Option en varias clases, en cuyo caso, :func:`make_option` elegirá la clase correcta a instanciar. Esta es la razón por la que no se debe instanciar Option directamente.)

source: Defining options
es: Definiendo las opciones

source: Each Option instance represents a set of synonymous command-line option strings, e.g. ``-f`` and ``--file``. You can specify any number of short or long option strings, but you must specify at least one overall option string.
es: Cada instancia de Option representa un conjunto de cadenas de opción sinónimas para la línea de comandos, por ejemplo ``-f`` y ``--file``. Se puede especificar cualquier número de cadenas de opción cortas o largas, pero se debe proporcionar al menos una cadena de opción en total.

source: The canonical way to create an :class:`Option` instance is with the :meth:`add_option` method of :class:`OptionParser`.
es: La forma canónica de crear una instancia de :class:`Option` es mediante el método :meth:`add_option` de la clase :class:`OptionParser`.

source: To define an option with only a short option string::
es: Para definir una opción con solo una cadena de opción corta::

source: And to define an option with only a long option string::
es: Y para definir una opción con solo una cadena de opción larga::

source: The keyword arguments define attributes of the new Option object. The most important option attribute is :attr:`~Option.action`, and it largely determines which other attributes are relevant or required. If you pass irrelevant option attributes, or fail to pass required ones, :mod:`optparse` raises an :exc:`OptionError` exception explaining your mistake.
es: Los argumentos por palabra clave definen atributos para el nuevo objeto Option. El atributo de opción más importante es :attr:`~Option.action`, que determina en gran medida qué otros atributos son apropiados u obligatorios. Si se pasan atributos de opción no apropiados, o no se pasan los requeridos, :mod:`optparse` lanza una excepción :exc:`OptionError` explicando el error.

source: An option's *action* determines what :mod:`optparse` does when it encounters this option on the command-line. The standard option actions hard-coded into :mod:`optparse` are:
es: La acción (*action*) de una opción determina que hace el módulo :mod:`optparse` cuando encuentra dicha opción en la línea de comandos. Las acciones de opción estándares codificadas en :mod:`optparse` son:

source: store this option's argument (default)
es: almacena el argumento de esta opción (por defecto)

source: store ``True``
es: almacena ``True``

source: store ``False``
es: almacena ``False``

source: append a constant value to a list, pre-set via :attr:`Option.const`
es: agrega un valor constante a una lista, preestablecido vía :attr:`Option.const`

source: print a usage message including all options and the documentation for them
es: imprime un mensaje de uso que incluye todas las opciones y la documentación correspondiente

source: (If you don't supply an action, the default is ``"store"``. For this action, you may also supply :attr:`~Option.type` and :attr:`~Option.dest` option attributes; see :ref:`optparse-standard-option-actions`.)
es: (Si no se proporciona una acción, el valor predeterminado es ``"store"``. Para esta acción en concreto, también se pueden proporcionar los atributos de opción :attr:`~Option.type` y :attr:`~Option.dest`. Consultar :ref:`optparse-standard-option-actions` para más información.)

source: As you can see, most actions involve storing or updating a value somewhere. :mod:`optparse` always creates a special object for this, conventionally called ``options``, which is an instance of :class:`optparse.Values`.
es: Como se puede observar, la mayoría de las acciones implican almacenar o actualizar un valor en algún lugar. :mod:`optparse` siempre crea un objeto especial para esto, convencionalmente llamado ``options``, que resulta ser una instancia de :class:`optparse.Values`.

source: An object holding parsed argument names and values as attributes. Normally created by calling when calling :meth:`OptionParser.parse_args`, and can be overridden by a custom subclass passed to the *values* argument of :meth:`OptionParser.parse_args` (as described in :ref:`optparse-parsing-arguments`).
es: Un objeto que mantiene como atributos a los nombres de los argumentos y los valores analizados. Normalmente se crean por invocación cuando llamamos :meth:`OptionParser.parse_args`, y pueden ser sobreescritos por una subclase personalizada pasada al argumento *values* de :meth:`OptionParser.parse_args` (como se describe en :ref:`optparse-parsing-arguments`).

source: Option arguments (and various other values) are stored as attributes of this object, according to the :attr:`~Option.dest` (destination) option attribute.
es: Los argumentos de opción (y algunos otros valores) se almacenan como atributos de este objeto, de acuerdo con el atributo de opción :attr:`~ Option.dest` (destino) establecido.

source: For example, when you call ::
es: Por ejemplo, cuando se llama a::

source: one of the first things :mod:`optparse` does is create the ``options`` object::
es: una de las primeras cosas que hace el módulo :mod:`optparse` es crear el objeto ``options``::

source: If one of the options in this parser is defined with ::
es: Si una de las opciones de este analizador es definida con::

source: and the command-line being parsed includes any of the following::
es: y la línea de comandos que se analiza incluye cualquiera de las siguientes variantes::

source: then :mod:`optparse`, on seeing this option, will do the equivalent of ::
es: entonces el módulo :mod:`optparse`, al encontrar esta opción, hará algo equivalente a::

source: The :attr:`~Option.type` and :attr:`~Option.dest` option attributes are almost as important as :attr:`~Option.action`, but :attr:`~Option.action` is the only one that makes sense for *all* options.
es: Los atributos de opción :attr:`~Option.type` y :attr:`~Option.dest` son casi tan importantes como :attr:`~Option.action`, pero :attr:`~Option.action` es el único de ellos que es apropiado para *todas* las opciones.

source: Option attributes
es: Atributos de opción

source: A single command line argument, with various attributes passed by keyword to the constructor. Normally created with :meth:`OptionParser.add_option` rather than directly, and can be overridden by a custom class via the *option_class* argument to :class:`OptionParser`.
es: Un único argumento de línea de comando, con varios atributos pasados como palabras clave al constructor. Normalmente se crea con :meth:`OptionParser.add_option` en lugar de directamente, y puede ser sobrescrito por una clase personalizada mediante el argumento *option_class* de :class:`OptionParser`.

source: The following option attributes may be passed as keyword arguments to :meth:`OptionParser.add_option`. If you pass an option attribute that is not relevant to a particular option, or fail to pass a required option attribute, :mod:`optparse` raises :exc:`OptionError`.
es: Los siguientes atributos de opción pueden pasarse como argumentos por palabra clave al método :meth:`OptionParser.add_option`. Si se pasa un atributo de opción que no es apropiado para una opción en particular, o no se pasa un atributo de opción obligatorio, :mod:`optparse` lanza una excepción :exc:`OptionError`.

source: (default: ``"store"``)
es: (por defecto: ``"store"``)

source: Determines :mod:`optparse`'s behaviour when this option is seen on the command line; the available options are documented :ref:`here <optparse-standard-option-actions>`.
es: Determina el comportamiento del módulo :mod:`optparse` cuando esta opción se encuentra en la línea de comandos. Las opciones disponibles están documentadas :ref:`aquí <optparse-standard-option-actions>`.

source: (default: ``"string"``)
es: (por defecto: ``"string"``)

source: The argument type expected by this option (e.g., ``"string"`` or ``"int"``); the available option types are documented :ref:`here <optparse-standard-option-types>`.
es: El tipo de argumento esperado para esta opción (por ejemplo, ``"string"`` o ``"int"``). Los tipos de opción disponibles están documentados :ref:`aquí <optparse-standard-option-types>`.

source: (default: derived from option strings)
es: (por defecto: derivado de las cadenas de opción)

source: If the option's action implies writing or modifying a value somewhere, this tells :mod:`optparse` where to write it: :attr:`~Option.dest` names an attribute of the ``options`` object that :mod:`optparse` builds as it parses the command line.
es: Si la acción asociada a la opción implica escribir o modificar un valor en algún lugar, este atributo le dice a :mod:`optparse` dónde escribirlo: :attr:`~Option.dest` es el nombre de un atributo del objeto ``options`` que :mod:`optparse` construye a medida que analiza la línea de comandos.

source: The value to use for this option's destination if the option is not seen on the command line. See also :meth:`OptionParser.set_defaults`.
es: El valor que se utilizará como destino de esta opción si la opción no aparece en la línea de comandos. Ver también :meth:`OptionParser.set_defaults`.

source: (default: 1)
es: (por defecto: 1)

source: How many arguments of type :attr:`~Option.type` should be consumed when this option is seen. If > 1, :mod:`optparse` will store a tuple of values to :attr:`~Option.dest`.
es: Cuántos argumentos de tipo :attr:`~Option.type` deben consumirse cuando se encuentre esta opción. Si es mayor a 1, :mod:`optparse` almacenará una tupla con los valores de los argumentos en :attr:`~Option.dest`.

source: For actions that store a constant value, the constant value to store.
es: Para acciones que almacenan un valor constante, el valor constante a almacenar.

source: For options of type ``"choice"``, the list of strings the user may choose from.
es: Para opciones de tipo ``"choice"``, la lista con las cadenas que el usuario puede elegir.

source: For options with action ``"callback"``, the callable to call when this option is seen. See section :ref:`optparse-option-callbacks` for detail on the arguments passed to the callable.
es: Para las opciones con la acción ``"callback"`` asignada, el objeto invocable a llamar cuando se encuentra esta opción. Consultar la sección :ref:`optparse-option-callbacks` para obtener más detalles sobre los argumentos que son pasados al objeto invocable.

source: Additional positional and keyword arguments to pass to ``callback`` after the four standard callback arguments.
es: Argumentos posicionales y por palabra clave adicionales para ser pasados a ``callback`` después de los cuatro argumentos pasados a la retrollamada estándar.

source: Help text to print for this option when listing all available options after the user supplies a :attr:`~Option.help` option (such as ``--help``). If no help text is supplied, the option will be listed without help text. To hide this option, use the special value :const:`optparse.SUPPRESS_HELP`.
es: Texto de ayuda a imprimir para esta opción cuando se enumeran todas las opciones disponibles, después de que el usuario proporcione una opción :attr:`~Option.help` (como ``--help``). Si no se proporciona ningún texto de ayuda, la opción seguirá apareciendo, solo que sin texto de ayuda. Para ocultar esta opción completamente, se debe asignar al atributo el valor especial :const:`optparse.SUPPRESS_HELP`.

source: Stand-in for the option argument(s) to use when printing help text. See section :ref:`optparse-tutorial` for an example.
es: Reemplazo para los argumentos de opción que se utilizará al imprimir el texto de ayuda. Consultar la sección :ref:`optparse-tutorial` para ver un ejemplo.

source: Standard option actions
es: Acciones de opción estándares

source: The various option actions all have slightly different requirements and effects. Most actions have several relevant option attributes which you may specify to guide :mod:`optparse`'s behaviour; a few have required attributes, which you must specify for any option using that action.
es: Las diversas acciones de opción tienen requisitos y efectos ligeramente diferentes. La mayoría de las acciones tienen varios atributos de opción relacionados que puedes especificar para dirigir el comportamiento del módulo :mod:`optparse`. Además, algunas de ellas tienen atributos requeridos, que se deben especificar para cualquier opción que utilice esa acción.

source: ``"store"`` [relevant: :attr:`~Option.type`, :attr:`~Option.dest`, :attr:`~Option.nargs`, :attr:`~Option.choices`]
es: ``"store"`` [atributos relacionados: :attr:`~Option.type`, :attr:`~Option.dest`, :attr:`~Option.nargs`, :attr:`~Option.choices`]

source: The option must be followed by an argument, which is converted to a value according to :attr:`~Option.type` and stored in :attr:`~Option.dest`. If :attr:`~Option.nargs` > 1, multiple arguments will be consumed from the command line; all will be converted according to :attr:`~Option.type` and stored to :attr:`~Option.dest` as a tuple. See the :ref:`optparse-standard-option-types` section.
es: La opción debe ir seguida de un argumento, que se convierte en un valor de acuerdo a :attr:`~Option.type` y se almacena en :attr:`~Option.dest`. Si :attr:`~Option.nargs` es mayor que 1, se consumirán varios argumentos de la línea de comandos. Todos ellos se convertirán de acuerdo a :attr:`~Option.type` y se almacenarán en :attr:`~Option.dest` como una tupla. Consultar la sección :ref:`optparse-standard-option-types` para más información.

source: If :attr:`~Option.choices` is supplied (a list or tuple of strings), the type defaults to ``"choice"``.
es: Si se proporciona :attr:`~Option.choices` (una lista o tupla de cadenas de caracteres), el tipo por defecto es ``"choice"``.

source: If :attr:`~Option.type` is not supplied, it defaults to ``"string"``.
es: Si no se proporciona :attr:`~Option.type`, el tipo por defecto es ``"string"``.

source: If :attr:`~Option.dest` is not supplied, :mod:`optparse` derives a destination from the first long option string (e.g., ``--foo-bar`` implies ``foo_bar``). If there are no long option strings, :mod:`optparse` derives a destination from the first short option string (e.g., ``-f`` implies ``f``).
es: Si :attr:`~Option.dest` no se proporciona, :mod:`optparse` infiere un destino de la primera cadena de opción larga (por ejemplo, ``--foo-bar`` implica que se usará ``foo_bar`` como destino). Si no hay cadenas de opción largas, :mod:`optparse` obtiene el destino a partir de la primera cadena de opción corta (por ejemplo, ``-f`` conlleva que se usará ``f``).

source: Example::
es: Ejemplo::

source: As it parses the command line ::
es: Mientras analiza la línea de comandos::

source: :mod:`optparse` will set ::
es: :mod:`optparse` establecerá::

source: ``"store_const"`` [required: :attr:`~Option.const`; relevant: :attr:`~Option.dest`]
es: ``"store_const"`` [atributo requerido: :attr:`~Option.const`; atributo relacionado: :attr:`~Option.dest`]

source: The value :attr:`~Option.const` is stored in :attr:`~Option.dest`.
es: El valor :attr:`~Option.const` es almacenado en :attr:`~Option.dest`.

source: If ``--noisy`` is seen, :mod:`optparse` will set ::
es: Si se encuentra ``--noisy``, :mod:`optparse` establecerá::

source: ``"store_true"`` [relevant: :attr:`~Option.dest`]
es: ``"store_true"`` [atributo relacionado: :attr:`~Option.dest`]

source: A special case of ``"store_const"`` that stores ``True`` to :attr:`~Option.dest`.
es: Un caso especial de ``"store_const"`` que almacena ``True`` en :attr:`~Option.dest`.

source: ``"store_false"`` [relevant: :attr:`~Option.dest`]
es: ``"store_false"`` [atributo relacionado: :attr:`~Option.dest`]

source: Like ``"store_true"``, but stores ``False``.
es: Como ``"store_true"``, pero almacena ``False``.
