Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: Return the name of the user logged in on the controlling terminal of the process. For most purposes, it is more useful to use :func:`getpass.getuser` since the latter checks the environment variables :envvar:`LOGNAME` or :envvar:`USERNAME` to find out who the user is, and falls back to ``pwd.getpwuid(os.getuid())[0]`` to get the login name of the current real user id.
es: Retorna el nombre del usuario que inició sesión en el terminal que controla el proceso. Para la mayoría de los casos, es más útil usar :func:`getpass.getuser` ya que este último verifica las variables de entorno :envvar:`LOGNAME` o :envvar:`USERNAME` para averiguar quién es el usuario y recurre a ``pwd.getpwuid(os.getuid())[0]`` para obtener el nombre de inicio de sesión del ID de usuario real actual.

source: Return the process group id of the process with process id *pid*. If *pid* is 0, the process group id of the current process is returned.
es: Retorna el id del grupo de procesos del proceso con la identificación del proceso *pid*. Si *pid* es 0, se retorna la identificación del grupo de proceso del proceso actual.

source: Return the id of the current process group.
es: Retorna el *id* del grupo de proceso actual.

source: Return the current process id.
es: Retorna el *id* del proceso actual.

source: Return the parent's process id. When the parent process has exited, on Unix the id returned is the one of the init process (1), on Windows it is still the same id, which may be already reused by another process.
es: Retorna el *id* del proceso del padre. Cuando el proceso padre ha terminado, en Unix la identificación que retorna es la del proceso *init* (1), en Windows sigue siendo la misma identificación, que ya puede ser reutilizada por otro proceso.

source: Added support for Windows.
es: Se agregó soporte para Windows.

source: Get program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process.
es: Obtenga la prioridad del programa. El valor *which* es uno de :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, o :const:`PRIO_USER`, y *who* se interpreta en relación a *which* (un identificador de proceso para :const:`PRIO_PROCESS`, un identificador de grupo de proceso para :const:`PRIO_PGRP`, y un ID de usuario para :const:`PRIO_USER`). Un valor cero para *who* denota (respectivamente) el proceso llamado, el grupo de proceso del proceso llamado o el ID de usuario real del proceso llamado.

source: Parameters for the :func:`getpriority` and :func:`setpriority` functions.
es: Parámetros para las funciones :func:`getpriority` y :func:`setpriority`.

source: Return a tuple (ruid, euid, suid) denoting the current process's real, effective, and saved user ids.
es: Retorna una tupla (ruid, euid, suid) que denota los ID de usuario reales, efectivos y guardados del proceso actual.

source: Return a tuple (rgid, egid, sgid) denoting the current process's real, effective, and saved group ids.
es: Retorna una tupla (rgid, egid, sgid) que denota los ID de grupo reales, efectivos y guardados del proceso actual.

source: Return the current process's real user id.
es: Retorna el *id* del usuario real del proceso actual.

source: Call the system initgroups() to initialize the group access list with all of the groups of which the specified username is a member, plus the specified group id.
es: Llamada al sistema initgroups() para inicializar la lista de acceso de grupo con todos los grupos de los que es miembro el nombre de usuario especificado, más el ID del grupo especificado.

source: Set the environment variable named *key* to the string *value*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
es: Establece la variable de entorno llamada *key* con el valor de la cadena *value*. Dichos cambios en el entorno impactan a los subprocesos iniciados con :func:`os.system`, :func:`popen` o :func:`fork` y :func:`execv`.

source: Assignments to items in :data:`os.environ` are automatically translated into corresponding calls to :func:`putenv`; however, calls to :func:`putenv` don't update :data:`os.environ`, so it is actually preferable to assign to items of :data:`os.environ`. This also applies to :func:`getenv` and :func:`getenvb`, which respectively use :data:`os.environ` and :data:`os.environb` in their implementations.
es: Las asignaciones a elementos en :data:`os.environ` se traducen automáticamente en llamadas correspondientes a :func:`putenv`; sin embargo, las llamadas a :func:`putenv` no actualizan :data:`os.environ`, por lo que en realidad es preferible asignar elementos de :data:`os.environ`. Esto también se aplica a :func:`getenv` y :func:`getenvb`, que utilizan respectivamente :data:`os.environ` y :data:`os.environb` en sus implementaciones.

source: Raises an :ref:`auditing event <auditing>` ``os.putenv`` with arguments ``key``, ``value``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.putenv`` con argumentos ``key``, ``value``.

source: The function is now always available.
es: Esta función actualmente siempre esta disponible.

source: Set the current process's effective group id.
es: Establece el *id* de grupo efectivo del proceso actual.

source: Set the current process's effective user id.
es: Establece el *id* de usuario efectivo del proceso actual.

source: Set the current process' group id.
es: Establece el *id* de grupo del proceso actual.

source: Set the list of supplemental group ids associated with the current process to *groups*. *groups* must be a sequence, and each element must be an integer identifying a group. This operation is typically available only to the superuser.
es: Establece la lista de *ids* de grupos secundarios asociados con el proceso actual en *groups*. *groups* debe ser una secuencia y cada elemento debe ser un número entero que identifique un grupo. Esta operación generalmente está disponible sólo para el superusuario.

source: On macOS, the length of *groups* may not exceed the system-defined maximum number of effective group ids, typically 16. See the documentation for :func:`getgroups` for cases where it may not return the same group list set by calling setgroups().
es: En macOS, la longitud de *groups* no puede exceder el número máximo definido por el sistema de ID de grupo efectivos, por lo general 16. Consulte la documentación de :func:`getgroups` para ver los casos en los que puede no retornar la misma lista de grupos establecida llamando a setgroups().

source: Set program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process. *priority* is a value in the range -20 to 19. The default priority is 0; lower priorities cause more favorable scheduling.
es: Establecer la prioridad del programa. El valor *which* es uno de :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, o :const:`PRIO_USER`, y *who* se interpreta en relación con *which* (un identificador de proceso para :const:`PRIO_PROCESS`, un identificador de grupo de proceso para :const:`PRIO_PGRP`, y un ID de usuario para :const:`PRIO_USER`). Un valor cero para *who* denota (respectivamente) el proceso llamado, el grupo de procesos del proceso llamado o el ID del usuario real del proceso llamado. *priority* es un valor en el rango de -20 a 19. La prioridad predeterminada es 0; las prioridades más bajas causan una programación más favorable.

source: Set the current process's real and effective group ids.
es: Establece los *ids* de grupos reales y efectivos del proceso actual.

source: Set the current process's real, effective, and saved group ids.
es: Establece los *ids* de grupo reales, efectivos y guardados del proceso actual.

source: Set the current process's real, effective, and saved user ids.
es: Establece los *ids* de usuario reales, efectivos y guardados del proceso actual.

source: Set the current process's real and effective user ids.
es: Establece los *ids* de usuario reales y efectivos del proceso actual.

source: Set the current process's user id.
es: Establece *id* del usuario del proceso actual.

source: ``True`` if the native OS type of the environment is bytes (eg. ``False`` on Windows).
es: ``True`` si el tipo de entorno nativo del sistema operativo es bytes (por ejemplo, ``False`` en Windows).

source: Set the current numeric umask and return the previous umask.
es: Establece la *umask* numérica actual y retorna la *umask* anterior.

source: Returns information identifying the current operating system. The return value is an object with five attributes:
es: Retorna información que identifica el sistema operativo actual. El valor retornado es un objeto con cinco atributos:

source: :attr:`sysname` - operating system name
es: :attr:`sysname` - nombre del sistema operativo

source: :attr:`nodename` - name of machine on network (implementation-defined)
es: :attr:`nodename` - nombre de la máquina en la red (definida por la implementación)

source: :attr:`release` - operating system release
es: :attr:`release` - *release* del sistema operativo

source: :attr:`version` - operating system version
es: :attr:`version` - versión del sistema operativo

source: :attr:`machine` - hardware identifier
es: :attr:`machine` - identificador de hardware

source: For backwards compatibility, this object is also iterable, behaving like a five-tuple containing :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, and :attr:`machine` in that order.
es: Por compatibilidad con versiones anteriores, este objeto también es iterable, se comporta como una tupla que contiene :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, y :attr:`machine` en ese orden.

source: Some systems truncate :attr:`nodename` to 8 characters or to the leading component; a better way to get the hostname is :func:`socket.gethostname` or even ``socket.gethostbyaddr(socket.gethostname())``.
es: Algunos sistemas se truncan :attr:`nodename` a 8 caracteres o al componente principal; una mejor manera de obtener el nombre de host es usar :func:`socket.gethostname` o incluso ``socket.gethostbyaddr(socket.gethostname())``.

source: Return type changed from a tuple to a tuple-like object with named attributes.
es: El tipo de objeto retornado cambió de una tupla a un objeto tipo tupla con atributos con nombre.

source: Unset (delete) the environment variable named *key*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
es: Desestablece (elimine) la variable de entorno llamada *key*. Dichos cambios en el entorno afectan a los subprocesos iniciados con :func:`os.system`, :func:`popen` o :func:`fork` y :func:`execv`.

source: Deletion of items in :data:`os.environ` is automatically translated into a corresponding call to :func:`unsetenv`; however, calls to :func:`unsetenv` don't update :data:`os.environ`, so it is actually preferable to delete items of :data:`os.environ`.
es: La eliminación de elementos en :data:`os.environ` se traduce automáticamente en una llamada correspondiente a :func:`unsetenv`; sin embargo, las llamadas a :func:`unsetenv` no actualizan :data:`os.environ`, por lo que en realidad es preferible eliminar elementos de :data:`os.environ`.

source: Raises an :ref:`auditing event <auditing>` ``os.unsetenv`` with argument ``key``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.unsetenv`` con argumento ``key``.

source: The function is now always available and is also available on Windows.
es: Estas funciones se encuentra ahora siempre disponible y también esta disponible en Windows

source: File Object Creation
es: Creación de objetos de tipo archivo

source: These functions create new :term:`file objects <file object>`. (See also :func:`~os.open` for opening file descriptors.)
es: Estas funciones crean nuevos :term:`objetos de archivo <file object>`. (Consulte también :func:`~os.open` para abrir los descriptores de archivos).

source: Return an open file object connected to the file descriptor *fd*. This is an alias of the :func:`open` built-in function and accepts the same arguments. The only difference is that the first argument of :func:`fdopen` must always be an integer.
es: Retorna un objeto de archivo abierto conectado al descriptor de archivo *fd*. Este es un alias de la función incorporada :func:`open` y acepta los mismos argumentos. La única diferencia es que el primer argumento de :func:`fdopen` siempre debe ser un número entero.

source: File Descriptor Operations
es: Operaciones de descriptores de archivos

source: These functions operate on I/O streams referenced using file descriptors.
es: Estas funciones operan en flujos de E/S a los que se hace referencia mediante descriptores de archivo.

source: File descriptors are small integers corresponding to a file that has been opened by the current process. For example, standard input is usually file descriptor 0, standard output is 1, and standard error is 2. Further files opened by a process will then be assigned 3, 4, 5, and so forth. The name "file descriptor" is slightly deceptive; on Unix platforms, sockets and pipes are also referenced by file descriptors.
es: Los descriptores de archivo son enteros pequeños que corresponden a un archivo que ha sido abierto por el proceso actual. Por ejemplo, la entrada estándar suele ser el descriptor de archivo 0, la salida estándar es el 1 y el error estándar es el 2. A los archivos abiertos por un proceso se les asignará 3, 4, 5, y así sucesivamente. El nombre "descriptor de archivo" es ligeramente engañoso; en las plataformas Unix, los descriptores de archivo también hacen referencia a *sockets* y tuberías.

source: The :meth:`~io.IOBase.fileno` method can be used to obtain the file descriptor associated with a :term:`file object` when required. Note that using the file descriptor directly will bypass the file object methods, ignoring aspects such as internal buffering of data.
es: El método :meth:`~io.IOBase.fileno` se puede utilizar para obtener el descriptor de archivo asociado con un :term:`file object` cuando sea necesario. Tenga en cuenta que el uso del descriptor de archivo directamente omitirá los métodos de objeto de archivo, ignorando aspectos como el almacenamiento interno interno de datos.

source: Close file descriptor *fd*.
es: Cierra el descriptor de archivo *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To close a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, use its :meth:`~io.IOBase.close` method.
es: Esta función está diseñada para E/S de bajo nivel y debe aplicarse a un descriptor de archivo tal como lo retorna :func:`os.open` o :func:`pipe`. Para cerrar un "objeto de archivo" retornado por la función incorporada :func:`open` o por :func:`popen` o :func:`fdopen`, use el método :meth:`~io.IOBase.close`.

source: Close all file descriptors from *fd_low* (inclusive) to *fd_high* (exclusive), ignoring errors. Equivalent to (but much faster than)::
es: Cierra todos los descriptores de archivo desde *fd_low* (inclusive) hasta *fd_high* (exclusivo), ignorando los errores. Equivalente a (pero mucho más rápido que)::

source: The return value is the amount of bytes copied. This could be less than the amount requested.
es: El valor de retorno es la cantidad de bytes copiados. Esto podría ser menor que la cantidad solicitada.

source: Return a string describing the encoding of the device associated with *fd* if it is connected to a terminal; else return :const:`None`.
es: Retorna una cadena que describe la codificación del dispositivo asociado con *fd* si está conectado a una terminal; sino retorna :const:`None`.

source: On Unix, if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, return ``'UTF-8'`` rather than the device encoding.
es: En Unix, si el :ref:`Modo Python UTF-8 <utf8-mode>` está habilitado, retorna ``'UTF-8'`` en lugar de la codificación del dispositivo.

source: On Unix, the function now implements the Python UTF-8 Mode.
es: En Unix, la función ahora implementa el modo Python UTF-8.

source: Return a duplicate of file descriptor *fd*. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
es: Retorna un duplicado del descriptor de archivo *fd*. El nuevo descriptor de archivo es :ref:`no heredable <fd_inheritance>`.

source: On Windows, when duplicating a standard stream (0: stdin, 1: stdout, 2: stderr), the new file descriptor is :ref:`inheritable <fd_inheritance>`.
es: En Windows, al duplicar un flujo estándar (0: stdin, 1: stdout, 2: stderr), el nuevo descriptor de archivo es :ref:`heredable <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
es: El nuevo descriptor de archivo ahora es no heredable.

source: Duplicate file descriptor *fd* to *fd2*, closing the latter first if necessary. Return *fd2*. The new file descriptor is :ref:`inheritable <fd_inheritance>` by default or non-inheritable if *inheritable* is ``False``.
es: Duplicar el descriptor de archivo *fd* a *fd2*, cerrando el anterior si es necesario. Retorna *fd2*. El nuevo descriptor de archivo es :ref:`heredable <fd_inheritance>` por defecto o no heredable si *inheritable* es ``False``.

source: Add the optional *inheritable* parameter.
es: Agrega el parámetro opcional *inheritable*.

source: Return *fd2* on success. Previously, ``None`` was always returned.
es: Retorna *fd2* en caso de éxito. Anteriormente se retornaba siempre ``None``.

source: Change the mode of the file given by *fd* to the numeric *mode*. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(fd, mode)``.
es: Cambia el modo del archivo dado por *fd* al modo numérico *mode*. Consulte los documentos para :func:`chmod` para conocer los posibles valores de *mode*. A partir de Python 3.3, esto es equivalente a ``os.chmod(fd, mode)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chmod`` with arguments ``path``, ``mode``, ``dir_fd``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.chmod`` con argumentos ``path``, ``mode``, ``dir_fd``.

source: The function is limited on Emscripten and WASI, see :ref:`wasm-availability` for more information.
es: La función está limitada en Emscripten y WASI, consulte :ref:`wasm-availability` para obtener más información.

source: Change the owner and group id of the file given by *fd* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1. See :func:`chown`. As of Python 3.3, this is equivalent to ``os.chown(fd, uid, gid)``.
es: Cambia el propietario y el *id* del grupo del archivo proporcionado por *fd* a los numéricos dados por *uid* y *gid*. Para dejar uno de los identificadores sin cambios, configúrelo en -1. Ver :func:`chown`. A partir de Python 3.3, esto es equivalente a ``os.chown(fd, uid, gid)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chown`` with arguments ``path``, ``uid``, ``gid``, ``dir_fd``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.chown`` con argumentos ``path``, ``uid``, ``gid``, ``dir_fd``.

source: Force write of file with filedescriptor *fd* to disk. Does not force update of metadata.
es: Fuerza la escritura del archivo con el descriptor de archivo *fd* en el disco. No fuerza la actualización de metadatos.

source: This function is not available on MacOS.
es: Esta función no está disponible en MacOS.

source: Return system configuration information relevant to an open file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
es: Retorna la información de configuración del sistema relevante para un archivo abierto. *name* especifica el valor de configuración para recuperar; puede ser una cadena que es el nombre de un valor de sistema definido; estos nombres se especifican en varios estándares (POSIX.1, Unix 95, Unix 98 y otros). Algunas plataformas también definen nombres adicionales. Los nombres conocidos por el sistema operativo anfitrión se dan en el diccionario ``pathconf_names``. Para las variables de configuración no incluidas en esa asignación, también se acepta pasar un número entero para *name*.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``pathconf_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
es: Si *name* es una cadena y no se conoce, se lanza un :exc:`ValueError`. Si el sistema anfitrión no admite un valor específico para *name*, incluso si está incluido en ``pathconf_names``, se genera un :exc:`OSError` con :const:`errno.EINVAL` para el número de error.

source: As of Python 3.3, this is equivalent to ``os.pathconf(fd, name)``.
es: A partir de Python 3.3, esto es equivalente a ``os.pathconf(fd, name)``.

source: Get the status of the file descriptor *fd*. Return a :class:`stat_result` object.
es: Obtiene el estado del descriptor de archivo *fd*. Retorna un objeto :class:`stat_result`.

source: As of Python 3.3, this is equivalent to ``os.stat(fd)``.
es: A partir de Python 3.3, esto es equivalente a ``os.stat(fd)``.

source: The :func:`.stat` function.
es: La función :func:`.stat`.

source: Return information about the filesystem containing the file associated with file descriptor *fd*, like :func:`statvfs`. As of Python 3.3, this is equivalent to ``os.statvfs(fd)``.
es: Retorna información sobre el sistema de archivos que contiene el archivo asociado con el descriptor de archivo *fd*, como :func:`statvfs`. A partir de Python 3.3, esto es equivalente a ``os.statvfs(fd)``.

source: If you're starting with a buffered Python :term:`file object` *f*, first do ``f.flush()``, and then do ``os.fsync(f.fileno())``, to ensure that all internal buffers associated with *f* are written to disk.
es: Si está comenzando con un Python almacenado en búfer :term:`file object` *f*, primero haga ``f.flush()``, y luego haga ``os.fsync(f.fileno())``, para garantizar que todas las memorias intermedias internas asociadas con *f* se escriban en disco.

source: Truncate the file corresponding to file descriptor *fd*, so that it is at most *length* bytes in size. As of Python 3.3, this is equivalent to ``os.truncate(fd, length)``.
es: Trunca el archivo correspondiente al descriptor de archivo *fd*, para que tenga como máximo *length* bytes de tamaño. A partir de Python 3.3, esto es equivalente a ``os.truncate(fd, length)``.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``fd``, ``length``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.truncate`` con argumentos ``fd``, ``length``.
