Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: Additional module-level constants are defined for GNU/glibc based systems. These are :const:`ST_NODEV` (disallow access to device special files), :const:`ST_NOEXEC` (disallow program execution), :const:`ST_SYNCHRONOUS` (writes are synced at once), :const:`ST_MANDLOCK` (allow mandatory locks on an FS), :const:`ST_WRITE` (write on file/directory/symlink), :const:`ST_APPEND` (append-only file), :const:`ST_IMMUTABLE` (immutable file), :const:`ST_NOATIME` (do not update access times), :const:`ST_NODIRATIME` (do not update directory access times), :const:`ST_RELATIME` (update atime relative to mtime/ctime).
es: Se definen constantes de nivel de módulo adicionales para sistemas basados en GNU / glibc. Estos son :const:`ST_NODEV` (no permitir el acceso a archivos especiales del dispositivo), :const:`ST_NOEXEC` (no permitir la ejecución del programa), :const:`ST_SYNCHRONOUS` (las escrituras se sincronizan a la vez), :const:`ST_MANDLOCK` ( permitir bloqueos obligatorios en un FS), :const:`ST_WRITE` (escribir en el archivo/directorio/enlace simbólico), :const:`ST_APPEND` (archivo de solo agregado), :const:`ST_IMMUTABLE` (archivo inmutable), :const:`ST_NOATIME` (no actualiza los tiempos de acceso), :const:`ST_NODIRATIME` (no actualiza los tiempos de acceso al directorio), :const:`ST_RELATIME` (tiempo de actualización relativo a mtime/ctime).

source: The :const:`ST_RDONLY` and :const:`ST_NOSUID` constants were added.
es: Se agregaron las constantes :const:`ST_RDONLY` y :const:`ST_NOSUID`.

source: The :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, and :const:`ST_RELATIME` constants were added.
es: El :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, y :const:`ST_RELATIME` se agregaron constantes.

source: Added :attr:`f_fsid`.
es: Agregado :attr:`f_fsid`.

source: A :class:`set` object indicating which functions in the :mod:`os` module accept an open file descriptor for their *dir_fd* parameter. Different platforms provide different features, and the underlying functionality Python uses to implement the *dir_fd* parameter is not available on all platforms Python supports. For consistency's sake, functions that may support *dir_fd* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``None`` for *dir_fd* is always supported on all platforms.)
es: A objeto :class:`set` que indica qué funciones en el módulo :mod:`os` aceptan un descriptor de archivo abierto para su parámetro *dir_fd*. Las diferentes plataformas proporcionan características diferentes, y la funcionalidad subyacente que Python usa para implementar el parámetro *dir_fd* no está disponible en todas las plataformas que admite Python. En aras de la coherencia, las funciones que pueden admitir *dir_fd* siempre permiten especificar el parámetro, pero lanzarán una excepción si la funcionalidad se utiliza cuando no está disponible localmente. (Especificar ``None`` para *dir_fd* siempre es compatible con todas las plataformas).

source: To check whether a particular function accepts an open file descriptor for its *dir_fd* parameter, use the ``in`` operator on ``supports_dir_fd``. As an example, this expression evaluates to ``True`` if :func:`os.stat` accepts open file descriptors for *dir_fd* on the local platform::
es: Para verificar si una función particular acepta un descriptor de archivo abierto para su parámetro *dir_fd*, use el operador ``in`` en ``supports_dir_fd``. Como ejemplo, esta expresión se evalúa como ``True`` si :func:`os.stat` acepta descriptores de archivos abiertos para *dir_fd* en la plataforma local::

source: Currently *dir_fd* parameters only work on Unix platforms; none of them work on Windows.
es: Actualmente, los parámetros *dir_fd* solo funcionan en plataformas Unix; ninguno de ellos funciona en Windows.

source: A :class:`set` object indicating whether :func:`os.access` permits specifying ``True`` for its *effective_ids* parameter on the local platform. (Specifying ``False`` for *effective_ids* is always supported on all platforms.) If the local platform supports it, the collection will contain :func:`os.access`; otherwise it will be empty.
es: Un objeto :class:`set` que indica si :func:`os.access` permite especificar ``True`` para su parámetro *fective_ids* en la plataforma local. (Especificar ``False`` para *effective_id* siempre es compatible con todas las plataformas). Si la plataforma local lo admite, la colección contendrá :func:`os.access`; de lo contrario estará vacío.

source: This expression evaluates to ``True`` if :func:`os.access` supports ``effective_ids=True`` on the local platform::
es: Esta expresión se evalúa como ``True`` si :func:`os.access` admite ``effective_id=True`` en la plataforma local::

source: Currently *effective_ids* is only supported on Unix platforms; it does not work on Windows.
es: Actualmente, *effective_ids* solo es compatible con plataformas Unix; No funciona en Windows.

source: A :class:`set` object indicating which functions in the :mod:`os` module permit specifying their *path* parameter as an open file descriptor on the local platform. Different platforms provide different features, and the underlying functionality Python uses to accept open file descriptors as *path* arguments is not available on all platforms Python supports.
es: A objeto :class:`set` que indica qué funciones en el módulo :mod:`os` permiten especificar su parámetro *path* como un descriptor de archivo abierto en la plataforma local. Las diferentes plataformas proporcionan características diferentes, y la funcionalidad subyacente que Python utiliza para aceptar descriptores de archivos abiertos como argumentos *path* no está disponible en todas las plataformas que admite Python.

source: To determine whether a particular function permits specifying an open file descriptor for its *path* parameter, use the ``in`` operator on ``supports_fd``. As an example, this expression evaluates to ``True`` if :func:`os.chdir` accepts open file descriptors for *path* on your local platform::
es: Para determinar si una función en particular permite especificar un descriptor de archivo abierto para su parámetro *path*, use el operador ``in`` en ``supports_fd``. Como ejemplo, esta expresión se evalúa como ``True`` si :func:`os.chdir` acepta descriptores de archivo abiertos para *path* en su plataforma local::

source: A :class:`set` object indicating which functions in the :mod:`os` module accept ``False`` for their *follow_symlinks* parameter on the local platform. Different platforms provide different features, and the underlying functionality Python uses to implement *follow_symlinks* is not available on all platforms Python supports. For consistency's sake, functions that may support *follow_symlinks* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``True`` for *follow_symlinks* is always supported on all platforms.)
es: Un objeto :class:`set` que indica qué funciones en el módulo :mod:`os` aceptan ``False`` para su parámetro *follow_symlinks* en la plataforma local. Las diferentes plataformas proporcionan características diferentes, y la funcionalidad subyacente que Python usa para implementar *follow_symlinks* no está disponible en todas las plataformas que admite Python. En aras de la coherencia, las funciones que pueden admitir *follow_symlinks* siempre permiten especificar el parámetro, pero arrojarán una excepción si la funcionalidad se utiliza cuando no está disponible localmente. (Especificar ``True`` para *follow_symlinks* siempre se admite en todas las plataformas).

source: To check whether a particular function accepts ``False`` for its *follow_symlinks* parameter, use the ``in`` operator on ``supports_follow_symlinks``. As an example, this expression evaluates to ``True`` if you may specify ``follow_symlinks=False`` when calling :func:`os.stat` on the local platform::
es: Para verificar si una función particular acepta ``False`` para su parámetro *follow_symlinks*, use el operador ``in`` en ``supports_follow_symlinks``. Como ejemplo, esta expresión se evalúa como ``True`` si puede especificar ``follow_symlinks=False`` al llamar a :func:`os.stat` en la plataforma local::

source: Create a symbolic link pointing to *src* named *dst*.
es: Cree un enlace simbólico que apunte a *src* llamado *dst*.

source: On Windows, a symlink represents either a file or a directory, and does not morph to the target dynamically. If the target is present, the type of the symlink will be created to match. Otherwise, the symlink will be created as a directory if *target_is_directory* is ``True`` or a file symlink (the default) otherwise. On non-Windows platforms, *target_is_directory* is ignored.
es: En Windows, un enlace simbólico representa un archivo o un directorio, y no se transforma dinámicamente en el destino. Si el objetivo está presente, el tipo de enlace simbólico se creará para que coincida. De lo contrario, el enlace simbólico se creará como un directorio si *target_is_directory* es ``True`` o un enlace simbólico de archivo (el valor predeterminado) de lo contrario. En plataformas que no son de Windows, *target_is_directory* se ignora.

source: On newer versions of Windows 10, unprivileged accounts can create symlinks if Developer Mode is enabled. When Developer Mode is not available/enabled, the *SeCreateSymbolicLinkPrivilege* privilege is required, or the process must be run as an administrator.
es: En las versiones más recientes de Windows 10, las cuentas sin privilegios pueden crear enlaces simbólicos si el Modo desarrollador está habilitado. Cuando el Modo desarrollador no está disponible / habilitado, se requiere el privilegio *SeCreateSymbolicLinkPrivilege*, o el proceso debe ejecutarse como administrador.

source: :exc:`OSError` is raised when the function is called by an unprivileged user.
es: :exc:`OSError` se lanza cuando un usuario sin privilegios llama a la función.

source: Raises an :ref:`auditing event <auditing>` ``os.symlink`` with arguments ``src``, ``dst``, ``dir_fd``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.symlink`` con argumentos ``src``, ``dst``, ``dir_fd``.

source: Added the *dir_fd* argument, and now allow *target_is_directory* on non-Windows platforms.
es: Se agregó el argumento *dir_fd* y ahora permite *target_is_directory* en plataformas que no son de Windows.

source: Added support for unelevated symlinks on Windows with Developer Mode.
es: Se agregó soporte para enlaces simbólicos sin elevar en Windows con el modo de desarrollador.

source: Force write of everything to disk.
es: Forzar la escritura de todo en el disco.

source: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
es: Trunca el archivo correspondiente a *path*, para que tenga como máximo *length* bytes de tamaño.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``path``, ``length``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.truncate`` con argumentos ``path``, ``length``.

source: Remove (delete) the file *path*. This function is semantically identical to :func:`remove`; the ``unlink`` name is its traditional Unix name. Please see the documentation for :func:`remove` for further information.
es: Elimina (elimine) el archivo *path*. Esta función es semánticamente idéntica a :func:`remove`; El nombre ``unlink`` es su nombre tradicional de Unix. Consulte la documentación de :func:`remove` para obtener más información.

source: Set the access and modified times of the file specified by *path*.
es: Establece el acceso y los tiempos modificados del archivo especificado por *path*.

source: :func:`utime` takes two optional parameters, *times* and *ns*. These specify the times set on *path* and are used as follows:
es: :func:`utime` toma dos parámetros opcionales, *times* y *ns*. Estos especifican los tiempos establecidos en *path* y se utilizan de la siguiente manera:

source: If *ns* is specified, it must be a 2-tuple of the form ``(atime_ns, mtime_ns)`` where each member is an int expressing nanoseconds.
es: Si se especifica *ns*, debe ser una tupla de 2 de la forma ``(atime_ns, mtime_ns)`` donde cada miembro es un int que expresa nanosegundos.

source: If *times* is not ``None``, it must be a 2-tuple of the form ``(atime, mtime)`` where each member is an int or float expressing seconds.
es: Si *times* no es ``None``, debe ser una 2-tupla de la forma ``(atime, mtime)`` donde cada miembro es un int o flotante que expresa segundos.

source: If *times* is ``None`` and *ns* is unspecified, this is equivalent to specifying ``ns=(atime_ns, mtime_ns)`` where both times are the current time.
es: Si *times* es ``None`` y *ns* no está especificado, esto es equivalente a especificar ``ns=(atime_ns, mtime_ns)`` donde ambas horas son la hora actual.

source: It is an error to specify tuples for both *times* and *ns*.
es: Es un error especificar tuplas para *times* y *ns*.

source: Note that the exact times you set here may not be returned by a subsequent :func:`~os.stat` call, depending on the resolution with which your operating system records access and modification times; see :func:`~os.stat`. The best way to preserve exact times is to use the *st_atime_ns* and *st_mtime_ns* fields from the :func:`os.stat` result object with the *ns* parameter to :func:`utime`.
es: Tenga en cuenta que es posible que las horas exactas que establezca aquí no se devuelvan en una llamada :func:`~os.stat` posterior, dependiendo de la resolución con la que su sistema operativo registre las horas de acceso y modificación; ver :func:`~os.stat`. La mejor manera de conservar las horas exactas es usar los campos *st_atime_ns* y *st_mtime_ns* del objeto de resultado :func:`os.stat` con el parámetro *ns* a :func:`utime`.

source: Raises an :ref:`auditing event <auditing>` ``os.utime`` with arguments ``path``, ``times``, ``ns``, ``dir_fd``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.utime`` con argumentos ``path``, ``times``, ``ns``, ``dir_fd``.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd*, *follow_symlinks*, and *ns* parameters.
es: Se agregó soporte para especificar *path* como un descriptor de archivo abierto, y los parámetros *dir_fd*, *follow_symlinks* y *ns*.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up. For each directory in the tree rooted at directory *top* (including *top* itself), it yields a 3-tuple ``(dirpath, dirnames, filenames)``.
es: Genere los nombres de archivo en un árbol de directorios recorriendo el árbol de arriba hacia abajo o de abajo hacia arriba. Para cada directorio en el árbol enraizado en el directorio *top* (incluido *top*), produce una tupla de 3 tuplas ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a string, the path to the directory. *dirnames* is a list of the names of the subdirectories in *dirpath* (including symlinks to directories, and excluding ``'.'`` and ``'..'``). *filenames* is a list of the names of the non-directory files in *dirpath*. Note that the names in the lists contain no path components. To get a full path (which begins with *top*) to a file or directory in *dirpath*, do ``os.path.join(dirpath, name)``. Whether or not the lists are sorted depends on the file system. If a file is removed from or added to the *dirpath* directory during generating the lists, whether a name for that file be included is unspecified.
es: *dirpath* es una cadena, la ruta al directorio. *dirnames* es una lista de los nombres de los subdirectorios en *dirpath* (incluidos los enlaces simbólicos a los directorios y excluyendo ``'.'`` y ``'..'``). *filenames* es una lista de los nombres de los archivos que no son de directorio en *dirpath*. Tenga en cuenta que los nombres de las listas no contienen componentes de ruta. Para obtener una ruta completa (que comienza con *top*) a un archivo o directorio en *dirpath*, ejecute ``os.path.join(dirpath, name)``. Que las listas estén ordenadas o no depende del sistema de archivos. Si un archivo se elimina o se agrega al directorio *dirpath* durante la generación de las listas, no se especifica si se incluirá un nombre para ese archivo.

source: If optional argument *topdown* is ``True`` or not specified, the triple for a directory is generated before the triples for any of its subdirectories (directories are generated top-down). If *topdown* is ``False``, the triple for a directory is generated after the triples for all of its subdirectories (directories are generated bottom-up). No matter the value of *topdown*, the list of subdirectories is retrieved before the tuples for the directory and its subdirectories are generated.
es: Si el argumento opcional *topdown* es ``True`` o no se especifica, el triple para un directorio se genera antes de triplicarse para cualquiera de sus subdirectorios (los directorios se generan de arriba hacia abajo). Si *topdown* es ``False``, el triple para un directorio se genera después de los triples para todos sus subdirectorios (los directorios se generan de abajo hacia arriba). No importa el valor de *topdown*, la lista de subdirectorios se recupera antes de que se generen las tuplas para el directorio y sus subdirectorios.

source: When *topdown* is ``True``, the caller can modify the *dirnames* list in-place (perhaps using :keyword:`del` or slice assignment), and :func:`walk` will only recurse into the subdirectories whose names remain in *dirnames*; this can be used to prune the search, impose a specific order of visiting, or even to inform :func:`walk` about directories the caller creates or renames before it resumes :func:`walk` again. Modifying *dirnames* when *topdown* is ``False`` has no effect on the behavior of the walk, because in bottom-up mode the directories in *dirnames* are generated before *dirpath* itself is generated.
es: Cuando *topdown* es ``True``, la persona que llama puede modificar la lista *dirnames* en su lugar (quizás usando :keyword:`del` o asignación de corte) y :func:`walk` solo se repetirá en los subdirectorios cuyos nombres permanecen en *dirnames*; Esto se puede utilizar para podar la búsqueda, imponer un orden específico de visitas o incluso para informar :func:`walk` sobre los directorios que la persona que llama crea o renombra antes de que se reanude :func:`walk` nuevamente. La modificación de *dirnames* cuando *topdown* es ``False`` no tiene ningún efecto en el comportamiento de la caminata, porque en el modo ascendente los directorios en *dirnames* se generan antes de que se genere *dirpath*.

source: By default, errors from the :func:`scandir` call are ignored. If optional argument *onerror* is specified, it should be a function; it will be called with one argument, an :exc:`OSError` instance. It can report the error to continue with the walk, or raise the exception to abort the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
es: Por defecto, los errores de la llamada :func:`scandir` se ignoran. Si se especifica el argumento opcional *onerror*, debería ser una función; se llamará con un argumento, una instancia :exc:`OSError`. Puede informar el error para continuar con la caminata, o generar la excepción para abortar la caminata. Tenga en cuenta que el nombre de archivo está disponible como el atributo ``filename`` del objeto de excepción.

source: By default, :func:`walk` will not walk down into symbolic links that resolve to directories. Set *followlinks* to ``True`` to visit directories pointed to by symlinks, on systems that support them.
es: Por defecto, :func:`walk` no entrará en enlaces simbólicos que se resuelven en directorios. Establece *followlinks* en ``True`` para visitar los directorios señalados por los enlaces simbólicos, en los sistemas que los admiten.

source: Be aware that setting *followlinks* to ``True`` can lead to infinite recursion if a link points to a parent directory of itself. :func:`walk` does not keep track of the directories it visited already.
es: Tenga en cuenta que establecer *followlinks* en ``True`` puede conducir a una recursión infinita si un enlace apunta a un directorio padre de sí mismo. :func:`walk` no realiza un seguimiento de los directorios que ya visitó.

source: If you pass a relative pathname, don't change the current working directory between resumptions of :func:`walk`. :func:`walk` never changes the current directory, and assumes that its caller doesn't either.
es: Si pasa un nombre de ruta relativo, no cambie el directorio de trabajo actual entre las reanudaciones de :func:`walk`. :func:`walk` nunca cambia el directorio actual, y supone que la persona que llama tampoco.

source: This example displays the number of bytes taken by non-directory files in each directory under the starting directory, except that it doesn't look under any CVS subdirectory::
es: Este ejemplo muestra el número de bytes que toman los archivos que no son de directorio en cada directorio bajo el directorio inicial, excepto que no se ve en ningún subdirectorio CVS::

source: In the next example (simple implementation of :func:`shutil.rmtree`), walking the tree bottom-up is essential, :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
es: En el siguiente ejemplo (implementación simple de :func:`shutil.rmtree`), recorrer el árbol de abajo hacia arriba es esencial, :func:`rmdir` no permite eliminar un directorio antes de que el directorio esté vacío::

source: Raises an :ref:`auditing event <auditing>` ``os.walk`` with arguments ``top``, ``topdown``, ``onerror``, ``followlinks``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.spawn`` con argumentos ``top``, ``topdown``, ``onerror``, ``followlinks``.

source: This function now calls :func:`os.scandir` instead of :func:`os.listdir`, making it faster by reducing the number of calls to :func:`os.stat`.
es: Esta función ahora llama :func:`os.scandir` en lugar de :func:`os.listdir`, lo que lo hace más rápido al reducir el número de llamadas a :func:`os.stat`.

source: This behaves exactly like :func:`walk`, except that it yields a 4-tuple ``(dirpath, dirnames, filenames, dirfd)``, and it supports ``dir_fd``.
es: Esto se comporta exactamente como :func:`walk`, excepto que produce 4 tuplas ``(dirpath, dirnames, filenames, dirfd)``, y admite ``dir_fd``.

source: *dirpath*, *dirnames* and *filenames* are identical to :func:`walk` output, and *dirfd* is a file descriptor referring to the directory *dirpath*.
es: *dirpath*, *dirnames* y *filenames* son idénticos a :func:`walk` output, y *dirfd* es un descriptor de archivo que se refiere al directorio *dirpath*.

source: This function always supports :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`. Note however that, unlike other functions, the :func:`fwalk` default value for *follow_symlinks* is ``False``.
es: Esta función siempre admite :ref:`rutas relativas a descriptores de directorio <dir_fd>` y :ref:`no siguen enlaces simbólicos <follow_symlinks>`. Sin embargo, tenga en cuenta que, a diferencia de otras funciones, el valor predeterminado :func:`fwalk` para *follow_symlinks* es ``False``.
