Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To write a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdout` or :data:`sys.stderr`, use its :meth:`~file.write` method.
es: Esta función está diseñada para E/S de bajo nivel y debe aplicarse a un descriptor de archivo tal como lo retorna :func:`os.open` o :func:`pipe`. Para escribir un "objeto archivo" retornado por la función incorporada :func:`open` o por :func:`popen` o :func:`fdopen`, o :data:`sys.stdout` o :data:`sys.stderr`, use el método :meth:`~file.write`.

source: Write the contents of *buffers* to file descriptor *fd*. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
es: Escribe el contenido de *buffers* en el descriptor de archivo *fd*. *buffers* debe ser una secuencia de :term:`objetos tipo bytes <bytes-like object>`. Los búferes se procesan en orden secuencial. Se escribe todo el contenido del primer búfer antes de pasar al segundo, y así sucesivamente.

source: Returns the total number of bytes actually written.
es: Retorna el número total de bytes realmente escritos.

source: Querying the size of a terminal
es: Consultando las dimensiones de una terminal

source: Return the size of the terminal window as ``(columns, lines)``, tuple of type :class:`terminal_size`.
es: Retorna el tamaño de la ventana de la terminal como ``(columns, lines)``, una tupla del tipo :class:`terminal_size`.

source: The optional argument ``fd`` (default ``STDOUT_FILENO``, or standard output) specifies which file descriptor should be queried.
es: El argumento opcional ``fd`` (por defecto es ``STDOUT_FILENO``, o la salida estándar) especifica qué descriptor de archivo debe consultarse.

source: If the file descriptor is not connected to a terminal, an :exc:`OSError` is raised.
es: Si el descriptor de archivo no está conectado a una terminal, se genera un :exc:`OSError`.

source: :func:`shutil.get_terminal_size` is the high-level function which should normally be used, ``os.get_terminal_size`` is the low-level implementation.
es: :func:`shutil.get_terminal_size` es la función de alto nivel que normalmente debería usarse, ``os.get_terminal_size`` es la implementación de bajo nivel.

source: A subclass of tuple, holding ``(columns, lines)`` of the terminal window size.
es: Una subclase de tupla, que contiene ``(columns, lines)`` representando el tamaño de la ventana de la terminal.

source: Width of the terminal window in characters.
es: Ancho de la ventana de la terminal en caracteres.

source: Height of the terminal window in characters.
es: Alto de la ventana de la terminal en caracteres.

source: Inheritance of File Descriptors
es: Herencia de los descriptores de archivos

source: A file descriptor has an "inheritable" flag which indicates if the file descriptor can be inherited by child processes. Since Python 3.4, file descriptors created by Python are non-inheritable by default.
es: Un descriptor de archivo tiene un indicador heredable (*inheritable*) que indica si el descriptor de archivo puede ser heredado por procesos secundarios. Desde Python 3.4, los descriptores de archivo creados por Python son no heredables por defecto.

source: On UNIX, non-inheritable file descriptors are closed in child processes at the execution of a new program, other file descriptors are inherited.
es: En UNIX, los descriptores de archivo no heredables se cierran en procesos hijos en la ejecución de un nuevo programa, otros descriptores de archivos sí se heredan.

source: On Windows, non-inheritable handles and file descriptors are closed in child processes, except for standard streams (file descriptors 0, 1 and 2: stdin, stdout and stderr), which are always inherited. Using :func:`spawn\* <spawnl>` functions, all inheritable handles and all inheritable file descriptors are inherited. Using the :mod:`subprocess` module, all file descriptors except standard streams are closed, and inheritable handles are only inherited if the *close_fds* parameter is ``False``.
es: En Windows, los descriptores de archivo y los identificadores no heredables se cierran en los procesos hijos, a excepción de los flujos estándar (descriptores de archivo 0, 1 y 2: stdin, stdout y stderr), que siempre se heredan. Usando las funciones :func:`spawn\* <spawnl>`, todos los identificadores heredables y todos los descriptores de archivos heredables se heredan. Usando el módulo :mod:`subprocess`, todos los descriptores de archivo, excepto los flujos estándar, están cerrados, y los identificadores heredables sólo se heredan si el parámetro *close_fds* es ``False``.

source: On WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``, the file descriptor cannot be modified.
es: En las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``, el descriptor de archivo no se puede modificar.

source: Get the "inheritable" flag of the specified file descriptor (a boolean).
es: Obtiene el indicador heredable (*inheritable*) del descriptor de archivo especificado (un valor booleano).

source: Set the "inheritable" flag of the specified file descriptor.
es: Establece el indicador heredable (*inheritable*) del descriptor de archivo especificado.

source: Get the "inheritable" flag of the specified handle (a boolean).
es: Obtiene el indicador heredable (*inheritable*) del identificador especificado (un valor booleano).

source: :ref:`Availability <availability>`: Windows.
es: :ref:`Disponibilidad <availability>`: Windows.

source: Set the "inheritable" flag of the specified handle.
es: Establece el indicador heredable (*inheritable*) del identificador especificado.

source: Files and Directories
es: Archivos y directorios

source: On some Unix platforms, many of these functions support one or more of these features:
es: En algunas plataformas Unix, muchas de estas funciones admiten una o más de estas características:

source: **specifying a file descriptor:** Normally the *path* argument provided to functions in the :mod:`os` module must be a string specifying a file path. However, some functions now alternatively accept an open file descriptor for their *path* argument. The function will then operate on the file referred to by the descriptor. (For POSIX systems, Python will call the variant of the function prefixed with ``f`` (e.g. call ``fchdir`` instead of ``chdir``).)
es: **especificando un descriptor de archivo:** Normalmente el argumento *path* proporcionado a las funciones en el módulo :mod:`os` debe ser una cadena que especifique una ruta de archivo. Sin embargo, algunas funciones ahora aceptan alternativamente un descriptor de archivo abierto para su argumento *path*. La función actuará en el archivo al que hace referencia el descriptor. (Para los sistemas POSIX, Python llamará a la variante de la función con el prefijo ``f`` (por ejemplo, llamará a ``fchdir`` en lugar de ``chdir``)).

source: You can check whether or not *path* can be specified as a file descriptor for a particular function on your platform using :data:`os.supports_fd`. If this functionality is unavailable, using it will raise a :exc:`NotImplementedError`.
es: Puede verificar si *path* se puede especificar o no como un descriptor de archivo para una función particular en su plataforma usando :data:`os.supports_fd`. Si esta funcionalidad no está disponible, su uso lanzará un :exc:`NotImplementedError`.

source: If the function also supports *dir_fd* or *follow_symlinks* arguments, it's an error to specify one of those when supplying *path* as a file descriptor.
es: Si la función también admite argumentos *dir_fd* o *follow_symlinks*, es un error especificar uno de esos al suministrar *path* como descriptor de archivo.

source: **paths relative to directory descriptors:** If *dir_fd* is not ``None``, it should be a file descriptor referring to a directory, and the path to operate on should be relative; path will then be relative to that directory. If the path is absolute, *dir_fd* is ignored. (For POSIX systems, Python will call the variant of the function with an ``at`` suffix and possibly prefixed with ``f`` (e.g. call ``faccessat`` instead of ``access``).
es: **rutas relativas a los descriptores de directorio:** Si *dir_fd* no es ``None``, debería ser un descriptor de archivo que se refiera a un directorio, y la ruta a operar debería ser relativa; entonces la ruta será relativa a ese directorio. Si la ruta es absoluta, *dir_fd* se ignora. (Para los sistemas POSIX, Python llamará a la variante de la función con un sufijo ``at`` y posiblemente con el prefijo ``f`` (por ejemplo, llamará a ``faccessat`` en lugar de ``access``).

source: You can check whether or not *dir_fd* is supported for a particular function on your platform using :data:`os.supports_dir_fd`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
es: Puede verificar si *dir_fd* es compatible o no para una función particular en su plataforma usando :data:`os.supports_dir_fd`. Si no está disponible, usarlo lanzará un :exc:`NotImplementedError`.

source: **not following symlinks:** If *follow_symlinks* is ``False``, and the last element of the path to operate on is a symbolic link, the function will operate on the symbolic link itself rather than the file pointed to by the link. (For POSIX systems, Python will call the ``l...`` variant of the function.)
es: **no seguir los enlaces simbólicos:** Si *follow_symlinks* es ``False``, y el último elemento de la ruta para operar es un enlace simbólico, la función operará en el enlace simbólico en lugar del archivo señalado por el enlace. (Para los sistemas POSIX, Python llamará a la variante ``l...`` de la función).

source: You can check whether or not *follow_symlinks* is supported for a particular function on your platform using :data:`os.supports_follow_symlinks`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
es: Puede verificar si *follow_symlinks* es compatible o no para una función particular en su plataforma usando :data:`os.supports_follow_symlinks`. Si no está disponible, usarlo lanzará un :exc:`NotImplementedError`.

source: Use the real uid/gid to test for access to *path*. Note that most operations will use the effective uid/gid, therefore this routine can be used in a suid/sgid environment to test if the invoking user has the specified access to *path*. *mode* should be :const:`F_OK` to test the existence of *path*, or it can be the inclusive OR of one or more of :const:`R_OK`, :const:`W_OK`, and :const:`X_OK` to test permissions. Return :const:`True` if access is allowed, :const:`False` if not. See the Unix man page :manpage:`access(2)` for more information.
es: Use el uid/gid real para probar el acceso a *path*. Tenga en cuenta que la mayoría de las operaciones utilizarán el uid/gid efectivo, por lo tanto, esta rutina se puede usar en un entorno suid/sgid para probar si el usuario que invoca tiene el acceso especificado a *path*. *mode* debería ser :const:`F_OK` para probar la existencia de *path*, o puede ser el OR inclusivo de uno o más de :const:`R_OK`, :const:`W_OK`, y :const:`X_OK` para probar los permisos. Retorna :const:`True` si el acceso está permitido, :const:`False` si no. Consulte la página de manual de Unix :manpage:`access (2)` para obtener más información.

source: This function can support specifying :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
es: Esta función puede admitir la especificación :ref:`rutas relativas a descriptores de directorio <dir_fd>` y :ref:`no seguir los enlaces simbólicos <follow_symlinks>`.

source: If *effective_ids* is ``True``, :func:`access` will perform its access checks using the effective uid/gid instead of the real uid/gid. *effective_ids* may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_effective_ids`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
es: Si *effective_ids* es ``True``, :func:`access` realizará sus comprobaciones de acceso utilizando el uid/gid efectivo en lugar del uid/gid real. *effective_ids* puede no ser compatible con su plataforma; puede verificar si está disponible o no usando :data:`os.supports_effective_ids`. Si no está disponible, usarlo lanzará un :exc:`NotImplementedError`.

source: Using :func:`access` to check if a user is authorized to e.g. open a file before actually doing so using :func:`open` creates a security hole, because the user might exploit the short time interval between checking and opening the file to manipulate it. It's preferable to use :term:`EAFP` techniques. For example::
es: Usando :func:`access` para verificar si un usuario está autorizado para, por ejemplo, abrir un archivo antes de hacerlo usando :func:`open` crea un agujero de seguridad, porque el usuario podría explotar el breve intervalo de tiempo entre verificar y abrir el archivo para manipularlo es preferible utilizar técnicas :term:`EAFP`. Por ejemplo::

source: is better written as::
es: está mejor escrito como::

source: I/O operations may fail even when :func:`access` indicates that they would succeed, particularly for operations on network filesystems which may have permissions semantics beyond the usual POSIX permission-bit model.
es: Las operaciones de E/S pueden fallar incluso cuando :func:`access` indica que tendrán éxito, particularmente para operaciones en sistemas de archivos de red que pueden tener una semántica de permisos más allá del modelo habitual de bits de permiso POSIX.

source: Added the *dir_fd*, *effective_ids*, and *follow_symlinks* parameters.
es: Se agregaron los parámetros *dir_fd*, *effective_ids* y *follow_symlinks*.

source: Values to pass as the *mode* parameter of :func:`access` to test the existence, readability, writability and executability of *path*, respectively.
es: Valores para pasar como parámetro *mode* de :func:`access` para probar la existencia, legibilidad, escritura y ejecutabilidad de *path*, respectivamente.

source: Change the current working directory to *path*.
es: Cambia el directorio de trabajo actual a *path*.

source: This function can support :ref:`specifying a file descriptor <path_fd>`. The descriptor must refer to an opened directory, not an open file.
es: Esta función puede soportar :ref:`especificando un descriptor de archivo <path_fd>`. El descriptor debe hacer referencia a un directorio abierto, no a un archivo abierto.

source: This function can raise :exc:`OSError` and subclasses such as :exc:`FileNotFoundError`, :exc:`PermissionError`, and :exc:`NotADirectoryError`.
es: Esta función puede generar :exc:`OSError` y subclases como :exc:`FileNotFoundError`, :exc:`PermissionError`, y :exc:`NotADirectoryError`.

source: Raises an :ref:`auditing event <auditing>` ``os.chdir`` with argument ``path``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.chdir`` con argumento ``path``.

source: Added support for specifying *path* as a file descriptor on some platforms.
es: Se agregó soporte para especificar *path* como descriptor de archivo en algunas plataformas.

source: Set the flags of *path* to the numeric *flags*. *flags* may take a combination (bitwise OR) of the following values (as defined in the :mod:`stat` module):
es: Establece las flags del *path* a las *flags* numéricas. *flags* puede tomar una combinación (OR bit a bit) de los siguientes valores (como se define en el módulo :mod:`stat`):

source: This function can support :ref:`not following symlinks <follow_symlinks>`.
es: Esta función puede soportar :ref:`no seguir enlaces simbólicos <follow_symlinks>`.

source: Raises an :ref:`auditing event <auditing>` ``os.chflags`` with arguments ``path``, ``flags``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.chflags`` con argumentos ``path``, ``flags``.

source: The *follow_symlinks* argument.
es: El argumento *follow_symlinks*.

source: Change the mode of *path* to the numeric *mode*. *mode* may take one of the following values (as defined in the :mod:`stat` module) or bitwise ORed combinations of them:
es: Cambia el modo de *path* al modo numérico *mode*. *mode* puede tomar uno de los siguientes valores (como se define en el módulo :mod:`stat`) o combinaciones OR de bit a bit de ellos:

source: This function can support :ref:`specifying a file descriptor <path_fd>`, :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
es: Esta función puede soportar :ref:`especificando un descriptor de archivo <path_fd>`, :ref:`rutas relativas a los descriptores de directorio <dir_fd>` y :ref:`no seguir enlaces simbólicos <follow_symlinks>`.

source: Although Windows supports :func:`chmod`, you can only set the file's read-only flag with it (via the ``stat.S_IWRITE`` and ``stat.S_IREAD`` constants or a corresponding integer value). All other bits are ignored.
es: Aunque Windows admite :func:`chmod`, sólo puede establecer el indicador de sólo lectura del archivo (a través de las constantes ``stat.S_IWRITE`` y ``stat.S_IREAD`` o un valor entero correspondiente). Todos los demás bits son ignorados.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd* and *follow_symlinks* arguments.
es: Se agregó soporte para especificar *path* como un descriptor de archivo abierto, y los argumentos *dir_fd* y *follow_symlinks*.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1.
es: Cambia el propietario y el *id* del grupo de *path* a los numéricos *uid* y *gid*. Para dejar uno de los identificadores sin cambios, configúrelo en -1.

source: See :func:`shutil.chown` for a higher-level function that accepts names in addition to numeric ids.
es: Ver :func:`shutil.chown` para una función de nivel superior que acepta nombres además de identificadores numéricos.

source: Supports a :term:`path-like object`.
es: Admite un :term:`objeto tipo ruta`.

source: Change the root directory of the current process to *path*.
es: Cambia el directorio raíz del proceso actual a *path*.

source: Change the current working directory to the directory represented by the file descriptor *fd*. The descriptor must refer to an opened directory, not an open file. As of Python 3.3, this is equivalent to ``os.chdir(fd)``.
es: Cambia el directorio de trabajo actual al directorio representado por el descriptor de archivo *fd*. El descriptor debe hacer referencia a un directorio abierto, no a un archivo abierto. A partir de Python 3.3, esto es equivalente a ``os.chdir(fd)``.

source: Return a string representing the current working directory.
es: Retorna una cadena que representa el directorio de trabajo actual.

source: Return a bytestring representing the current working directory.
es: Retorna una cadena de bytes que representa el directorio de trabajo actual.

source: The function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows.
es: La función ahora usa la codificación UTF-8 en Windows, en lugar de los códigos ANSI: consulte :pep:`529` para ver la justificación. La función ya no está en desuso en Windows.

source: Set the flags of *path* to the numeric *flags*, like :func:`chflags`, but do not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chflags(path, flags, follow_symlinks=False)``.
es: Establece las flags de *path* a las *flags* numéricas, como :func:`chflags`, pero no siga los enlaces simbólicos. A partir de Python 3.3, esto es equivalente a ``os.chflags(path, flags, follow_symlinks=False)``.

source: Change the mode of *path* to the numeric *mode*. If path is a symlink, this affects the symlink rather than the target. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(path, mode, follow_symlinks=False)``.
es: Cambia el modo de *path* al *mode* numérico. Si la ruta es un enlace simbólico, esto afecta al enlace simbólico en lugar del objetivo. Consulte los documentos para :func:`chmod` para conocer los posibles valores de *mode*. A partir de Python 3.3, esto es equivalente a ``os.chmod(path, mode, follow_symlinks=False)``.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. This function will not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chown(path, uid, gid, follow_symlinks=False)``.
es: Cambia el propietario y la identificación del grupo de *path* a los numéricos *uid* y *gid*. Esta función no seguirá enlaces simbólicos. A partir de Python 3.3, esto es equivalente a ``os.chown(path, uid, gid, follow_symlinks=False)``.

source: Create a hard link pointing to *src* named *dst*.
es: Cree un enlace rígido que apunte a *src* llamado *dst*.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`, and :ref:`not following symlinks <follow_symlinks>`.
es: Esta función puede admitir la especificación de *src_dir_fd* o *dst_dir_fd* para proporcionar :ref:`rutas relativas a los descriptores de directorio <dir_fd>`, y :ref:`no sigue enlaces simbólicos <follow_symlinks>`.

source: Raises an :ref:`auditing event <auditing>` ``os.link`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.link`` con argumentos ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.

source: Added Windows support.
es: Se agregó soporte para Windows.

source: Added the *src_dir_fd*, *dst_dir_fd*, and *follow_symlinks* arguments.
es: Se agregaron los argumentos *src_dir_fd*, *dst_dir_fd* y *follow_symlinks*.

source: Accepts a :term:`path-like object` for *src* and *dst*.
es: Acepta un :term:`path-like object` para *src* y *dst*.

source: Return a list containing the names of the entries in the directory given by *path*. The list is in arbitrary order, and does not include the special entries ``'.'`` and ``'..'`` even if they are present in the directory. If a file is removed from or added to the directory during the call of this function, whether a name for that file be included is unspecified.
es: Retorna una lista que contiene los nombres de las entradas en el directorio dado por *path*. La lista está en un orden arbitrario y no incluye las entradas especiales ``'.'`` Y ``'..'`` incluso si están presentes en el directorio. Si un archivo es removido de o añadido al directorio mientras se llama a esta función, no se especifica si el nombre para el archivo será incluido.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the filenames returned will also be of type ``bytes``; in all other circumstances, they will be of type ``str``.
es: *path* puede ser un :term:`path-like object`. Si *path* es de tipo ``bytes`` (directa o indirectamente a través de la interfaz :class:`PathLike`), los nombres de archivo retornados también serán de tipo ``bytes``; en todas las demás circunstancias, serán del tipo ``str``.

source: This function can also support :ref:`specifying a file descriptor <path_fd>`; the file descriptor must refer to a directory.
es: Esta función también puede admitir :ref:`especificando un descriptor de archivo <path_fd>`; el descriptor de archivo debe hacer referencia a un directorio.

source: Raises an :ref:`auditing event <auditing>` ``os.listdir`` with argument ``path``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.listdir`` con el argumento ``ruta``.
