Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: Exit code that means a temporary failure occurred. This indicates something that may not really be an error, such as a network connection that couldn't be made during a retryable operation.
es: Código de salida que significa que ocurrió una falla temporal. Esto indica algo que puede no ser realmente un error, como una conexión de red que no se pudo realizar durante una operación recuperable.

source: Exit code that means that a protocol exchange was illegal, invalid, or not understood.
es: Código de salida que significa que un intercambio de protocolo fue ilegal, inválido o no se entendió.

source: Exit code that means that there were insufficient permissions to perform the operation (but not intended for file system problems).
es: Código de salida que significa que no había permisos suficientes para realizar la operación (pero no para problemas del sistema de archivos).

source: Exit code that means that some kind of configuration error occurred.
es: Código de salida que significa que se produjo algún tipo de error de configuración.

source: Exit code that means something like "an entry was not found".
es: Código de salida que significa algo así como "no se encontró una entrada".

source: Fork a child process. Return ``0`` in the child and the child's process id in the parent. If an error occurs :exc:`OSError` is raised.
es: Bifurcar un proceso hijo. Retorna ``0`` en el niño y la identificación del proceso del niño en el padre. Si se produce un error se genera :exc:`OSError`.

source: Note that some platforms including FreeBSD <= 6.3 and Cygwin have known issues when using ``fork()`` from a thread.
es: Tenga en cuenta que algunas plataformas que incluyen FreeBSD &lt;= 6.3 y Cygwin tienen problemas conocidos al usar ``fork()`` desde un hilo.

source: Raises an :ref:`auditing event <auditing>` ``os.fork`` with no arguments.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.fork`` sin argumentos.

source: Calling ``fork()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
es: Llamar a ``fork()`` en un subinterpretador ya no es compatible (:exc:`RuntimeError` está activado).

source: Fork a child process, using a new pseudo-terminal as the child's controlling terminal. Return a pair of ``(pid, fd)``, where *pid* is ``0`` in the child, the new child's process id in the parent, and *fd* is the file descriptor of the master end of the pseudo-terminal. For a more portable approach, use the :mod:`pty` module. If an error occurs :exc:`OSError` is raised.
es: Bifurca un proceso hijo, usando un nuevo pseudo-terminal como terminal de control del niño. Retorna un par de ``(pid, fd)``, donde *pid* es ``0`` en el elemento secundario, la identificación del proceso del elemento secundario nuevo en el elemento primario y *fd* es el descriptor de archivo del final maestro de El pseudo-terminal. Para un enfoque más portátil, use el módulo :mod:`pty`. Si se produce un error se genera :exc:`OSError`.

source: Raises an :ref:`auditing event <auditing>` ``os.forkpty`` with no arguments.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.forkpty`` sin argumentos.

source: Calling ``forkpty()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
es: Llamar a ``forkpty()`` en un subinterpretador ya no es compatible (:exc:`RuntimeError` está activado).

source: Send signal *sig* to the process *pid*. Constants for the specific signals available on the host platform are defined in the :mod:`signal` module.
es: Enviar señal *sig* al proceso *pid*. Las constantes para las señales específicas disponibles en la plataforma host se definen en el módulo :mod:`signal`.

source: See also :func:`signal.pthread_kill`.
es: Ver también :func:`signal.pthread_kill`.

source: Raises an :ref:`auditing event <auditing>` ``os.kill`` with arguments ``pid``, ``sig``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.kill`` con argumentos ``pid``, ``sig``.

source: Windows support.
es: Soporte de Windows.

source: Send the signal *sig* to the process group *pgid*.
es: Envíe la señal *sig* al grupo de procesos *pgid*.

source: Raises an :ref:`auditing event <auditing>` ``os.killpg`` with arguments ``pgid``, ``sig``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.killpg`` con argumentos ``pgid``, ``sig``.

source: Add *increment* to the process's "niceness". Return the new niceness.
es: Agregue *increment* a la "simpatía" del proceso. Retorna la nueva amabilidad.

source: See the :manpage:`pidfd_open(2)` man page for more details.
es: Ver la página manual de :manpage:`pidfd_open(2)` para mas detalles.

source: Lock program segments into memory. The value of *op* (defined in ``<sys/lock.h>``) determines which segments are locked.
es: Bloquee segmentos del programa en la memoria. El valor de *op* (definido en ``<sys/lock.h>``) determina qué segmentos están bloqueados.

source: Open a pipe to or from command *cmd*. The return value is an open file object connected to the pipe, which can be read or written depending on whether *mode* is ``'r'`` (default) or ``'w'``. The *buffering* argument have the same meaning as the corresponding argument to the built-in :func:`open` function. The returned file object reads or writes text strings rather than bytes.
es: Abre una tubería hacia o desde el comando *cmd*. El valor retornado es un objeto de archivo abierto conectado a la canalización, que se puede leer o escribir dependiendo de si *mode* es ``'r'`` (predeterminado) o ``'w'``. El argumento *buffering* tiene el mismo significado que el argumento correspondiente a la función integrada :func:`open`. El objeto de archivo retornado lee o escribe cadenas de texto en lugar de bytes.

source: The ``close`` method returns :const:`None` if the subprocess exited successfully, or the subprocess's return code if there was an error. On POSIX systems, if the return code is positive it represents the return value of the process left-shifted by one byte. If the return code is negative, the process was terminated by the signal given by the negated value of the return code. (For example, the return value might be ``- signal.SIGKILL`` if the subprocess was killed.) On Windows systems, the return value contains the signed integer return code from the child process.
es: El método ``close`` retorna :const:`None` si el subproceso salió correctamente, o el código de retorno del subproceso si hubo un error. En los sistemas POSIX, si el código de retorno es positivo, representa el valor de retorno del proceso desplazado a la izquierda en un byte. Si el código de retorno es negativo, el proceso fue terminado por la señal dada por el valor negado del código de retorno. (Por ejemplo, el valor de retorno podría ser ``- signal.SIGKILL`` si se eliminó el subproceso). En los sistemas Windows, el valor de retorno contiene el código de retorno entero firmado del proceso secundario.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the ``close`` method result (exit status) into an exit code if it is not ``None``. On Windows, the ``close`` method result is directly the exit code (or ``None``).
es: En Unix, :func:`waitstatus_to_exitcode` puede ser usado para convertir el resultado del método ``close`` (estado de salida) en un código de salida si es que no es ``None``. En Windows, el resultado del método ``close`` es directamente el código de salida (o ``None``).

source: This is implemented using :class:`subprocess.Popen`; see that class's documentation for more powerful ways to manage and communicate with subprocesses.
es: Esto se implementa usando :class:`subprocess.Popen`; consulte la documentación de esa clase para obtener formas más potentes de administrar y comunicarse con subprocesos.

source: The :ref:`Python UTF-8 Mode <utf8-mode>` affects encodings used for *cmd* and pipe contents.
es: El :ref:`Python UTF-8 Mode <utf8-mode>` afecta las codificaciones utilizadas para *cmd* y el contenido de la canalización.

source: :func:`popen` is a simple wrapper around :class:`subprocess.Popen`. Use :class:`subprocess.Popen` or :func:`subprocess.run` to control options like encodings.
es: :func:`popen` es un contenedor simple alrededor de :class:`subprocess.Popen`. Use :class:`subprocess.Popen` o :func:`subprocess.run` para controlar opciones como codificaciones.

source: Most users should use :func:`subprocess.run` instead of :func:`posix_spawn`.
es: La mayoría de los usuarios deberían usar :func:`subprocess.run` en lugar de :func:`posix_spawn`.

source: The positional-only arguments *path*, *args*, and *env* are similar to :func:`execve`.
es: Los argumentos de solo posición *path*, *args* y *env* son similares a :func:`execve`.

source: The *path* parameter is the path to the executable file. The *path* should contain a directory. Use :func:`posix_spawnp` to pass an executable file without directory.
es: El parámetro *path* es la ruta al archivo ejecutable. La *path* debe contener un directorio. Utilice :func:`posix_spawnp` para pasar un archivo ejecutable sin directorio.

source: The *file_actions* argument may be a sequence of tuples describing actions to take on specific file descriptors in the child process between the C library implementation's :c:func:`fork` and :c:func:`exec` steps. The first item in each tuple must be one of the three type indicator listed below describing the remaining tuple elements:
es: El argumento *file_actions* puede ser una secuencia de tuplas que describen acciones para tomar descriptores de archivo específicos en el proceso secundario entre los pasos de implementación de la biblioteca C :c:func:`fork` y :c:func:`exec`. El primer elemento de cada tupla debe ser uno de los tres indicadores de tipo que se enumeran a continuación y que describen los elementos de tupla restantes:

source: Performs ``os.dup2(os.open(path, flags, mode), fd)``.
es: Realiza ``os.dup2(os.open(path, flags, mode), fd)``.

source: Performs ``os.close(fd)``.
es: Realiza ``os.close(fd)``.

source: Performs ``os.dup2(fd, new_fd)``.
es: Realiza ``os.dup2(fd, new_fd)``.

source: Raises an :ref:`auditing event <auditing>` ``os.posix_spawn`` with arguments ``path``, ``argv``, ``env``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.posix_spawn`` con argumentos ``ruta``, ``argv``, ``env``.

source: Similar to :func:`posix_spawn` except that the system searches for the *executable* file in the list of directories specified by the :envvar:`PATH` environment variable (in the same way as for ``execvp(3)``).
es: Similar a :func:`posix_spawn` excepto que el sistema busca el archivo *executable* en la lista de directorios especificada por la variable de entorno :envvar:`PATH` (de la misma manera que para ``execvp(3)`` )

source: See :func:`posix_spawn` documentation.
es: Consulte la documentación de :func:`posix_spawn`.

source: Register callables to be executed when a new child process is forked using :func:`os.fork` or similar process cloning APIs. The parameters are optional and keyword-only. Each specifies a different call point.
es: Registra los invocables que se ejecutarán cuando se bifurca un nuevo proceso secundario utilizando :func:`os.fork` o API de clonación de procesos similares. Los parámetros son opcionales y solo de palabras clave. Cada uno especifica un punto de llamada diferente.

source: *before* is a function called before forking a child process.
es: *before* es una función llamada antes de bifurcar un proceso hijo.

source: *after_in_parent* is a function called from the parent process after forking a child process.
es: *after_in_parent* es una función llamada desde el proceso padre después de bifurcar un proceso hijo.

source: *after_in_child* is a function called from the child process.
es: *after_in_child* es una función llamada desde el proceso hijo.

source: These calls are only made if control is expected to return to the Python interpreter. A typical :mod:`subprocess` launch will not trigger them as the child is not going to re-enter the interpreter.
es: Estas llamadas solo se realizan si se espera que el control regrese al intérprete de Python. Un lanzamiento típico :mod:`subprocess` no los activará ya que el niño no va a volver a ingresar al intérprete.

source: Functions registered for execution before forking are called in reverse registration order. Functions registered for execution after forking (either in the parent or in the child) are called in registration order.
es: Las funciones registradas para su ejecución antes de la bifurcación se invocan en orden de registro inverso. Las funciones registradas para la ejecución después de la bifurcación (ya sea en el padre o en el hijo) se invocan en orden de registro.

source: Note that :c:func:`fork` calls made by third-party C code may not call those functions, unless it explicitly calls :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
es: Tenga en cuenta que las llamadas :c:func:`fork` realizadas por código C de terceros no pueden llamar a esas funciones, a menos que explícitamente llame a :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` y :c:func:`PyOS_AfterFork_Child`.

source: There is no way to unregister a function.
es: No hay forma de cancelar el registro de una función.

source: Execute the program *path* in a new process.
es: Ejecute el programa *path* en un nuevo proceso.

source: (Note that the :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using these functions. Check especially the :ref:`subprocess-replacements` section.)
es: (Tenga en cuenta que el módulo :mod:`subprocess` proporciona funciones más potentes para generar nuevos procesos y recuperar sus resultados; es preferible usar ese módulo que usar estas funciones. Compruebe especialmente la sección :ref:`subprocess-replacements`.)

source: If *mode* is :const:`P_NOWAIT`, this function returns the process id of the new process; if *mode* is :const:`P_WAIT`, returns the process's exit code if it exits normally, or ``-signal``, where *signal* is the signal that killed the process. On Windows, the process id will actually be the process handle, so can be used with the :func:`waitpid` function.
es: Si *mode* es :const:`P_NOWAIT`, esta función retorna la identificación del proceso del nuevo proceso; if *mode* is :const:`P_WAIT`, retorna el código de salida del proceso si sale normalmente, o ``-signal``, donde *signal* es la señal que mató el proceso. En Windows, la identificación del proceso en realidad será el identificador del proceso, por lo que se puede usar con la función :func:`waitpid`.

source: Note on VxWorks, this function doesn't return ``-signal`` when the new process is killed. Instead it raises OSError exception.
es: Nota sobre VxWorks, esta función no retorna ``-signal`` cuando se cierra el nuevo proceso. En su lugar, genera una excepción OSError.

source: The "l" and "v" variants of the :func:`spawn\* <spawnl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`spawnl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process must start with the name of the command being run.
es: Las variantes "l" y "v" de las funciones :func:`spawn\* <spawnl>` difieren en cómo se pasan los argumentos de la línea de comandos. Las variantes "l" son quizás las más fáciles de trabajar si el número de parámetros se fija cuando se escribe el código; los parámetros individuales simplemente se convierten en parámetros adicionales a las funciones :func:`spawnl\*`. Las variantes "v" son buenas cuando el número de parámetros es variable, y los argumentos se pasan en una lista o tupla como parámetro *args*. En cualquier caso, los argumentos del proceso secundario deben comenzar con el nombre del comando que se está ejecutando.

source: The variants which include a second "p" near the end (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, and :func:`spawnvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`spawn\*e <spawnl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, and :func:`spawnve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
es: Las variantes que incluyen una segunda "p" cerca del final (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, y :func:`spawnvpe`) usarán :envvar:`PATH` variable de entorno para ubicar el programa *file*. Cuando se reemplaza el entorno (usando uno de los siguientes :func:`spawn\*e <spawnl>` variantes, discutidas en el siguiente párrafo), el nuevo entorno se utiliza como fuente de la variable :envvar:`PATH`. Las otras variantes, :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, y :func:`spawnve`, no utilizarán la variable :envvar:`PATH` para localizar el ejecutable; *path* debe contener una ruta absoluta o relativa apropiada.

source: For :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, and :func:`spawnvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (they are used instead of the current process' environment); the functions :func:`spawnl`, :func:`spawnlp`, :func:`spawnv`, and :func:`spawnvp` all cause the new process to inherit the environment of the current process. Note that keys and values in the *env* dictionary must be strings; invalid keys or values will cause the function to fail, with a return value of ``127``.
es: Para :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, y :func:`spawnvpe` (tenga en cuenta que todo esto termina en "e"), el parámetro *env* debe ser un mapeo que se utiliza para definir las variables de entorno para el nuevo proceso (se utilizan en lugar del entorno del proceso actual); las funciones :func:`spawnl`, :func:`spawnlp`, :func:`spawnv` y :func:`spawnvp` hacen que el nuevo proceso herede el entorno del proceso actual. Tenga en cuenta que las claves y los valores en el diccionario *env* deben ser cadenas; Las teclas o valores no válidos harán que la función falle, con un valor de retorno de ``127``.

source: As an example, the following calls to :func:`spawnlp` and :func:`spawnvpe` are equivalent::
es: Como ejemplo, las siguientes llamadas a :func:`spawnlp` y :func:`spawnvpe` son equivalentes::

source: Raises an :ref:`auditing event <auditing>` ``os.spawn`` with arguments ``mode``, ``path``, ``args``, ``env``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.spawn`` con argumentos ``mode``, ``path``, ``args``, ``env``.

source: :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` and :func:`spawnvpe` are not available on Windows. :func:`spawnle` and :func:`spawnve` are not thread-safe on Windows; we advise you to use the :mod:`subprocess` module instead.
es: :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` y :func:`spawnvpe` no están disponibles en Windows. :func:`spawnle` y :func:`spawnve` no son seguros para subprocesos en Windows; le recomendamos que utilice el módulo :mod:`subprocess` en su lugar.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If either of these values is given, the :func:`spawn\*` functions will return as soon as the new process has been created, with the process id as the return value.
es: Valores posibles para el parámetro *mode* para :func:`spawn\* <spawnl>` familia de funciones. Si se da alguno de estos valores, las funciones :func:`spawn\*` volverán tan pronto como se haya creado el nuevo proceso, con la identificación del proceso como valor de retorno.

source: Possible value for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If this is given as *mode*, the :func:`spawn\*` functions will not return until the new process has run to completion and will return the exit code of the process the run is successful, or ``-signal`` if a signal kills the process.
es: Posible valor para el parámetro *mode* para :func:`spawn\* <spawnl>` familia de funciones. Si esto se da como *mode*, las funciones :func:`spawn\*` no volverán hasta que el nuevo proceso se haya completado y retornará el código de salida del proceso, la ejecución es exitosa, o ``-signal`` si una señal mata el proceso.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. These are less portable than those listed above. :const:`P_DETACH` is similar to :const:`P_NOWAIT`, but the new process is detached from the console of the calling process. If :const:`P_OVERLAY` is used, the current process will be replaced; the :func:`spawn\* <spawnl>` function will not return.
es: Valores posibles para el parámetro *mode* para :func:`spawn\* <spawnl>` familia de funciones. Estos son menos portátiles que los enumerados anteriormente. :const:`P_DETACH` es similar a :const:`P_NOWAIT`, pero el nuevo proceso se desconecta de la consola del proceso de llamada. Si se usa :const:`P_OVERLAY`, el proceso actual será reemplazado; la función :func:`spawn\* <spawnl>` no volverá.

source: Start a file with its associated application.
es: Inicie un archivo con su aplicación asociada.

source: When launching an application, specify *arguments* to be passed as a single string. This argument may have no effect when using this function to launch a document.
es: Al iniciar una aplicación, especifique *arguments* para que se pase como una sola cadena. Es posible que este argumento no tenga ningún efecto cuando se utiliza esta función para iniciar un documento.

source: The default working directory is inherited, but may be overridden by the *cwd* argument. This should be an absolute path. A relative *path* will be resolved against this argument.
es: El directorio de trabajo predeterminado se hereda, pero el argumento *cwd* puede anularlo. Este debería ser un camino absoluto. Un *path* relativo se resolverá contra este argumento.

source: :func:`startfile` returns as soon as the associated application is launched. There is no option to wait for the application to close, and no way to retrieve the application's exit status. The *path* parameter is relative to the current directory or *cwd*. If you want to use an absolute path, make sure the first character is not a slash (``'/'``) Use :mod:`pathlib` or the :func:`os.path.normpath` function to ensure that paths are properly encoded for Win32.
es: :func:`startfile` retorna tan pronto como se inicia la aplicación asociada. No hay opción para esperar a que se cierre la aplicación y no hay forma de recuperar el estado de salida de la aplicación. El parámetro *path* es relativo al directorio actual o *cwd*. Si desea utilizar una ruta absoluta, asegúrese de que el primer carácter no sea una barra (``'/'``) Utilice :mod:`pathlib` o la función :func:`os.path.normpath` para asegurarse de que las rutas estén codificadas correctamente para Win32.

source: Raises an :ref:`auditing event <auditing>` ``os.startfile`` with arguments ``path``, ``operation``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.startfile`` con argumentos ``path``, ``operation``.
