Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: Added support for Windows
es: Se agregó soporte para Windows

source: Get the blocking mode of the file descriptor: ``False`` if the :data:`O_NONBLOCK` flag is set, ``True`` if the flag is cleared.
es: Obtiene el modo de bloqueo del descriptor de archivo: ``False`` si se establece el indicador :data:`O_NONBLOCK`, ``True`` si el indicador se borra.

source: See also :func:`set_blocking` and :meth:`socket.socket.setblocking`.
es: Consulte también :func:`set_blocking` y :meth:`socket.socket.setblocking`.

source: Return ``True`` if the file descriptor *fd* is open and connected to a tty(-like) device, else ``False``.
es: Retorna ``True`` si el descriptor de archivo *fd* está abierto y conectado a un dispositivo tipo tty, de lo contrario, ``False``.

source: Apply, test or remove a POSIX lock on an open file descriptor. *fd* is an open file descriptor. *cmd* specifies the command to use - one of :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` or :data:`F_TEST`. *len* specifies the section of the file to lock.
es: Aplique, pruebe o elimine un bloqueo POSIX en un descriptor de archivo abierto. *fd* es un descriptor de archivo abierto. *cmd* especifica el comando a usar - uno de :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` o :data:`F_TEST`. *len* especifica la sección del archivo a bloquear.

source: Raises an :ref:`auditing event <auditing>` ``os.lockf`` with arguments ``fd``, ``cmd``, ``len``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.lockf`` con argumentos ``fd``, ``cmd``, ``len``.

source: Flags that specify what action :func:`lockf` will take.
es: Indicadores que especifican qué acción tomará :func:`lockf`.

source: Prepare the tty of which fd is a file descriptor for a new login session. Make the calling process a session leader; make the tty the controlling tty, the stdin, the stdout, and the stderr of the calling process; close fd.
es: Prepare el tty del cual fd es un descriptor de archivo para una nueva sesión de inicio de sesión. Convierta el proceso de convocatoria en un líder de sesión; hacer que el tty sea el tty controlador, el stdin, el stdout y el stderr del proceso de llamada; cerrar fd.

source: Open the file *path* and set various flags according to *flags* and possibly its mode according to *mode*. When computing *mode*, the current umask value is first masked out. Return the file descriptor for the newly opened file. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
es: Abre el archivo *path* y configura varios indicadores según *flags* y su modo según *mode*. Al calcular el modo el valor actual de *umask* se enmascara primero. Retorna el descriptor de archivo para el archivo recién abierto. El nuevo descriptor de archivo es :ref:`no heredable <fd_inheritance>`.

source: For a description of the flag and mode values, see the C run-time documentation; flag constants (like :const:`O_RDONLY` and :const:`O_WRONLY`) are defined in the :mod:`os` module. In particular, on Windows adding :const:`O_BINARY` is needed to open files in binary mode.
es: Para una descripción de los valores de indicadores (*flags*) y modo (*mode*), consulte la documentación de tiempo de ejecución de C; los indicadores constantes de flag (como :const:`O_RDONLY` y :const:`O_WRONLY`) se definen en el módulo :mod:`os`. En particular, en Windows agregar :const:`O_BINARY` es necesario para abrir archivos en modo binario.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
es: Esta función puede admitir :ref:`rutas relativas a descriptores de directorio <dir_fd>` con el parámetro *dir_fd*.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``open`` con argumentos ``path``, ``mode``, ``flags``.

source: This function is intended for low-level I/O. For normal usage, use the built-in function :func:`open`, which returns a :term:`file object` with :meth:`~file.read` and :meth:`~file.write` methods (and many more). To wrap a file descriptor in a file object, use :func:`fdopen`.
es: Esta función está diseñada para E/S de bajo nivel. Para un uso normal, use la función integrada :func:`open`, que retorna un :term:`file object` con métodos :meth:`~file.read` y :meth:`~file.write` (y mucho mas). Para envolver un descriptor de archivo en un objeto de archivo, use :func:`fdopen`.

source: The *dir_fd* argument.
es: El argumento *dir_fd*.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
es: Si la llamada al sistema se interrumpe y el controlador de señal no genera una excepción, la función vuelve a intentar la llamada del sistema en lugar de generar una excepción :exc:`InterruptedError` (ver :pep:`475` para la justificación).

source: Accepts a :term:`path-like object`.
es: Acepta un :term:`objeto tipo ruta`.

source: The following constants are options for the *flags* parameter to the :func:`~os.open` function. They can be combined using the bitwise OR operator ``|``. Some of them are not available on all platforms. For descriptions of their availability and use, consult the :manpage:`open(2)` manual page on Unix or `the MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ on Windows.
es: Las siguientes constantes son opciones para el parámetro *flags* de la función :func:`~os.open`. Se pueden combinar con el operador OR a nivel de bit ``|``. Algunos de ellas no están disponibles en todas las plataformas. Para obtener descripciones de su disponibilidad y uso, consulte la página de manual :manpage:`open(2)` en Unix o `la MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ en Windows.

source: The above constants are available on Unix and Windows.
es: Las constantes anteriores están disponibles en Unix y Windows.

source: The above constants are only available on Unix.
es: Las constantes anteriores sólo están disponibles en Unix.

source: Add :data:`O_CLOEXEC` constant.
es: Se agregó la constante :data:`O_CLOEXEC`.

source: The above constants are only available on Windows.
es: Las constantes anteriores sólo están disponibles en Windows.

source: The above constants are only available on macOS.
es: Las constantes anteriores solo están disponibles en macOS.

source: Add :data:`O_EVTONLY`, :data:`O_FSYNC`, :data:`O_SYMLINK` and :data:`O_NOFOLLOW_ANY` constants.
es: Agregue las constantes :data:`O_EVTONLY`, :data:`O_FSYNC`, :data:`O_SYMLINK` y :data:`O_NOFOLLOW_ANY`.

source: The above constants are extensions and not present if they are not defined by the C library.
es: Las constantes anteriores son extensiones y no están presentes si no están definidas por la biblioteca de C.

source: Add :data:`O_PATH` on systems that support it. Add :data:`O_TMPFILE`, only available on Linux Kernel 3.11 or newer.
es: Se agrega la constante :data:`O_PATH` en los sistemas que lo admiten. Se agrega :data:`O_TMPFILE`, sólo disponible en Linux para el Kernel 3.11 o posterior.

source: Open a new pseudo-terminal pair. Return a pair of file descriptors ``(master, slave)`` for the pty and the tty, respectively. The new file descriptors are :ref:`non-inheritable <fd_inheritance>`. For a (slightly) more portable approach, use the :mod:`pty` module.
es: Abre un nuevo par de pseudo-terminal. Retorna un par de descriptores de archivo ``(master, slave)``; para pty y tty, respectivamente. Los nuevos descriptores de archivo son :ref:`no heredable <fd_inheritance>`. Para un enfoque (ligeramente) más portátil, use el módulo :mod:`pty`.

source: The new file descriptors are now non-inheritable.
es: Los nuevos descriptores de archivo ahora son no heredables.

source: Create a pipe. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
es: Crea una tubería. Retorna un par de descriptores de archivo ``(r, w)`` que se pueden usar para leer y escribir, respectivamente. El nuevo descriptor de archivo es :ref:`no heredable <fd_inheritance>`.

source: Create a pipe with *flags* set atomically. *flags* can be constructed by ORing together one or more of these values: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively.
es: Crea una tubería con *flags* establecidas atómicamente. *flags* pueden construirse juntando uno o más de estos valores: :data:`O_NONBLOCK`, :data:`O_CLOEXEC` con el operador OR. Retorna un par de descriptores de archivo ``(r, w)`` que se pueden usar para leer y escribir, respectivamente.

source: Ensures that enough disk space is allocated for the file specified by *fd* starting from *offset* and continuing for *len* bytes.
es: Asegura que se asigne suficiente espacio en disco para el archivo especificado por *fd* a partir de *offset* y se extiende por *len* bytes.

source: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations. The advice applies to the region of the file specified by *fd* starting at *offset* and continuing for *len* bytes. *advice* is one of :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` or :data:`POSIX_FADV_DONTNEED`.
es: Avisa una intención de acceder a los datos en un patrón específico, permitiendo así que el núcleo haga optimizaciones. El consejo se aplica a la región del archivo especificada por *fd* que comienza en *offset* y se extiende para *len* bytes. *advice* es uno de :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` o :data:`POSIX_FADV_DONTNEED`.

source: Flags that can be used in *advice* in :func:`posix_fadvise` that specify the access pattern that is likely to be used.
es: Indicadores que se pueden usar en *advice* en :func:`posix_fadvise` que especifican el patrón de acceso que es probable que se use.

source: Read at most *n* bytes from file descriptor *fd* at a position of *offset*, leaving the file offset unchanged.
es: Lee como máximo *n* bytes del descriptor de archivo *fd* en una posición de *offset*, sin modificar el desplazamiento (*offset*) del archivo.

source: Return a bytestring containing the bytes read. If the end of the file referred to by *fd* has been reached, an empty bytes object is returned.
es: Retorna una cadena de bytes que contiene los bytes leídos. Si se alcanza el final del archivo al que hace referencia *fd*, se retorna un objeto de bytes vacío.

source: Read from a file descriptor *fd* at a position of *offset* into mutable :term:`bytes-like objects <bytes-like object>` *buffers*, leaving the file offset unchanged. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
es: Lee de un descriptor de archivo *fd* en una posición de *offset* en mutable :term:`objetos de tipo bytes <bytes-like object>` *buffers*, dejando el desplazamiento del archivo sin cambios. Transfiere datos a cada búfer hasta que esté lleno y luego pase al siguiente búfer en la secuencia para contener el resto de los datos.

source: The flags argument contains a bitwise OR of zero or more of the following flags:
es: El argumento flags contiene un operador de bit a bit OR de cero o más de las siguientes flags:

source: Return the total number of bytes actually read which can be less than the total capacity of all the objects.
es: Retorna el número total de bytes realmente leídos que puede ser menor que la capacidad total de todos los objetos.

source: The operating system may set a limit (:func:`sysconf` value ``'SC_IOV_MAX'``) on the number of buffers that can be used.
es: El sistema operativo puede establecer un límite (:func:`sysconf` valor ``'SC_IOV_MAX'``) en el número de búferes que se pueden usar.

source: Combine the functionality of :func:`os.readv` and :func:`os.pread`.
es: Combina la funcionalidad de :func:`os.readv` y :func:`os.pread`.

source: Using flags requires Linux >= 4.6.
es: El uso de banderas requiere Linux >= 4.6.

source: Do not wait for data which is not immediately available. If this flag is specified, the system call will return instantly if it would have to read data from the backing storage or wait for a lock.
es: No espere datos que no estén disponibles de inmediato. Si se especifica este indicador, la llamada al sistema regresará instantáneamente si tuviera que leer datos del almacenamiento de respaldo o esperar por un bloqueo.

source: High priority read/write. Allows block-based filesystems to use polling of the device, which provides lower latency, but may use additional resources.
es: Alta prioridad de lectura/escritura. Permite que los sistemas de archivos basados en bloques utilicen el sondeo del dispositivo, lo que proporciona una latencia más baja, pero puede usar recursos adicionales.

source: Currently, on Linux, this feature is usable only on a file descriptor opened using the :data:`O_DIRECT` flag.
es: Actualmente, en Linux, esta función sólo se puede usar en un descriptor de archivo abierto con el indicador :data:`O_DIRECT`.

source: Write the bytestring in *str* to file descriptor *fd* at position of *offset*, leaving the file offset unchanged.
es: Escribe la cadena de bytes en *str* en el descriptor de archivo *fd* en la posición *offset*, sin modificar el desplazamiento del archivo.

source: Return the number of bytes actually written.
es: Retorna el número de bytes realmente escritos.

source: Write the *buffers* contents to file descriptor *fd* at a offset *offset*, leaving the file offset unchanged. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
es: Escribe los contenidos de los *buffers* en el descriptor de archivo *fd* en un desplazamiento *offset*, dejando el desplazamiento del archivo sin cambios. *buffers* deben ser una secuencia de :term:`objetos tipo bytes <bytes-like object>`. Los búferes se procesan en orden secuencial. Se escribe todo el contenido del primer búfer antes de pasar al segundo, y así sucesivamente.

source: Return the total number of bytes actually written.
es: Retorna el número total de bytes realmente escritos.

source: Combine the functionality of :func:`os.writev` and :func:`os.pwrite`.
es: Combina la funcionalidad de :func:`os.writev` y :func:`os.pwrite`.

source: Provide a per-write equivalent of the :data:`O_DSYNC` :func:`os.open` flag. This flag effect applies only to the data range written by the system call.
es: Proporcione un equivalente por escritura del indicador :data:`O_DSYNC` :func:`os.open`. Este efecto de bandera se aplica solo al rango de datos escrito por la llamada al sistema.

source: Provide a per-write equivalent of the :data:`O_SYNC` :func:`os.open` flag. This flag effect applies only to the data range written by the system call.
es: Proporcione un equivalente por escritura del indicador :data:`O_SYNC` :func:`os.open`. Este efecto de bandera se aplica solo al rango de datos escrito por la llamada al sistema.

source: Provide a per-write equivalent of the :data:`O_APPEND` :func:`os.open` flag. This flag is meaningful only for :func:`os.pwritev`, and its effect applies only to the data range written by the system call. The *offset* argument does not affect the write operation; the data is always appended to the end of the file. However, if the *offset* argument is ``-1``, the current file *offset* is updated.
es: Proporcione un equivalente por escritura del indicador :data:`O_APPEND` :func:`os.open`. Esta bandera es significativa solo para :func:`os.pwritev` y su efecto se aplica solo al rango de datos escrito por la llamada al sistema. El argumento *offset* no afecta la operación de escritura; los datos siempre se añaden al final del archivo. Sin embargo, si el argumento *offset* es ``-1``, se actualiza el *offset* actual del archivo.

source: Read at most *n* bytes from file descriptor *fd*.
es: Lee como máximo *n* bytes del descriptor de archivo *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To read a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdin`, use its :meth:`~file.read` or :meth:`~file.readline` methods.
es: Esta función está diseñada para E/S de bajo nivel y debe aplicarse a un descriptor de archivo tal como lo retorna :func:`os.open` o :func:`pipe`. Para leer un "objeto archivo" retornado por la función incorporada :func:`open` o por :func:`popen` o :func:`fdopen`, o :data:`sys.stdin`, use los métodos :meth:`~file.read` o :meth:`~file.readline`.

source: Copy *count* bytes from file descriptor *in_fd* to file descriptor *out_fd* starting at *offset*. Return the number of bytes sent. When EOF is reached return ``0``.
es: Copia *count* bytes del descriptor de archivo *in_fd* al descriptor de archivo *out_fd* comenzando en *offset*. Retorna el número de bytes enviados. Cuando se alcanza EOF, retorna ``0``.

source: The first function notation is supported by all platforms that define :func:`sendfile`.
es: La primera notación de la función es compatible con todas las plataformas que definen :func:`sendfile`.

source: On Linux, if *offset* is given as ``None``, the bytes are read from the current position of *in_fd* and the position of *in_fd* is updated.
es: En Linux, si *offset* se entrega como ``None``, los bytes se leen desde la posición actual de *in_fd* y la posición de *in_fd* se actualiza.

source: The second case may be used on macOS and FreeBSD where *headers* and *trailers* are arbitrary sequences of buffers that are written before and after the data from *in_fd* is written. It returns the same as the first case.
es: El segundo caso se puede usar en macOS y FreeBSD donde *headers* y *trailers* son secuencias arbitrarias de búferes que se escriben antes y después de que se escriban los datos de *in_fd*. Retorna lo mismo que el primer caso.

source: On macOS and FreeBSD, a value of ``0`` for *count* specifies to send until the end of *in_fd* is reached.
es: En macOS y FreeBSD, un valor de ``0`` para *count* especifica enviar hasta que se alcanza el final de *in_fd*.

source: All platforms support sockets as *out_fd* file descriptor, and some platforms allow other types (e.g. regular file, pipe) as well.
es: Todas las plataformas admiten sockets como descriptor de archivo *out_fd*, y algunas plataformas también permiten otros tipos (por ejemplo, archivo regular, tuberías).

source: Cross-platform applications should not use *headers*, *trailers* and *flags* arguments.
es: Las aplicaciones multiplataforma no deben usar los argumentos *headers*, *trailers* y *flags*.

source: For a higher-level wrapper of :func:`sendfile`, see :meth:`socket.socket.sendfile`.
es: Para un contenedor de alto nivel de :func:`sendfile`, vea :meth:`socket.socket.sendfile`.

source: Parameters *out* and *in* was renamed to *out_fd* and *in_fd*.
es: Parámetros *out* e *in* han sido renombrados a *out_fd* e *in_fd*.

source: Parameters to the :func:`sendfile` function, if the implementation supports them.
es: Parámetros para la función :func:`sendfile`, si la implementación los admite.

source: Parameter to the :func:`sendfile` function, if the implementation supports it. The data won't be cached in the virtual memory and will be freed afterwards.
es: Parámetro a la función :func:`sendfile`, si la implementación lo admite. Los datos no se almacenarán en caché en la memoria virtual y se liberarán después.

source: Set the blocking mode of the specified file descriptor. Set the :data:`O_NONBLOCK` flag if blocking is ``False``, clear the flag otherwise.
es: Establece el modo de bloqueo del descriptor de archivo especificado. Establece la flag :data:`O_NONBLOCK` si se quiere que el bloqueo sea ``False``, borre la flag de lo contrario.

source: See also :func:`get_blocking` and :meth:`socket.socket.setblocking`.
es: Consulte también :func:`get_blocking` y :meth:`socket.socket.setblocking`.

source: This copy is done without the additional cost of transferring data from the kernel to user space and then back into the kernel. Additionally, some filesystems could implement extra optimizations. The copy is done as if both files are opened as binary.
es: Esta copia se realiza sin el costo adicional de transferir datos desde el kernel al espacio del usuario y luego nuevamente al kernel. También, algunos sistemas de archivos podrían implementar optimizaciones adicionales. La copia se realiza como si ambos archivos se abrieran como binarios.

source: Upon successful completion, returns the number of bytes spliced to or from the pipe. A return value of 0 means end of input. If *src* refers to a pipe, then this means that there was no data to transfer, and it would not make sense to block because there are no writers connected to the write end of the pipe.
es: Una vez completado con éxito, retorna el número de bytes empalmados hacia o desde la tubería. Un valor de retorno de 0 significa el final de la entrada. Si *src* se refiere a una tubería, esto significa que no hay datos para transferir y no tendría sentido bloquear porque no hay escritores conectados al extremo de escritura de la tubería.

source: Read from a file descriptor *fd* into a number of mutable :term:`bytes-like objects <bytes-like object>` *buffers*. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
es: Leer desde un descriptor de archivo *fd* en una cantidad de mutable :term:`objetos tipo bytes <bytes-like object>` *buffers*. Transfiere datos a cada búfer hasta que esté lleno y luego pase al siguiente búfer en la secuencia para contener el resto de los datos.

source: Return the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`).
es: Retorna el grupo del proceso asociado con la terminal proporcionada por *fd* (un descriptor de archivo abierto como lo retorna :func:`os.open`).

source: Set the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`) to *pg*.
es: Establece el grupo del proceso asociado con la terminal dada por *fd* (un descriptor de archivo abierto como lo retorna :func:`os.open`) a *pg*.

source: Return a string which specifies the terminal device associated with file descriptor *fd*. If *fd* is not associated with a terminal device, an exception is raised.
es: Retorna una cadena que especifica el dispositivo de terminal asociado con el descriptor de archivo *fd*. Si *fd* no está asociado con un dispositivo de terminal, se genera una excepción.

source: Write the bytestring in *str* to file descriptor *fd*.
es: Escribe la cadena de bytes en *str* en el descriptor de archivo *fd*.
