Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: Raises an :ref:`auditing event <auditing>` ``os.startfile/2`` with arguments ``path``, ``operation``, ``arguments``, ``cwd``, ``show_cmd``.
es: Lanza un :ref:`evento de auditoria <auditing>` ``os.startfile/2`` con argumentos ``path``, ``operation``, ``arguments``, ``cwd``, ``show_cmd``.

source: Added the *arguments*, *cwd* and *show_cmd* arguments, and the ``os.startfile/2`` audit event.
es: Se agregaron los argumentos *arguments*, *cwd* y *show_cmd*, y el evento de auditoría ``os.startfile/2``.

source: Execute the command (a string) in a subshell. This is implemented by calling the Standard C function :c:func:`system`, and has the same limitations. Changes to :data:`sys.stdin`, etc. are not reflected in the environment of the executed command. If *command* generates any output, it will be sent to the interpreter standard output stream. The C standard does not specify the meaning of the return value of the C function, so the return value of the Python function is system-dependent.
es: Ejecute el comando (una cadena) en una subcapa. Esto se implementa llamando a la función C estándar :c:func:`system` y tiene las mismas limitaciones. Los cambios en :data:`sys.stdin`, etc. no se reflejan en el entorno del comando ejecutado. Si *command* genera alguna salida, se enviará al flujo de salida estándar del intérprete. El estándar C no especifica el significado del valor de retorno de la función C, por lo que el valor de retorno de la función de Python depende del sistema.

source: On Unix, the return value is the exit status of the process encoded in the format specified for :func:`wait`.
es: En Unix, el valor de retorno es el estado de salida del proceso codificado en el formato especificado para :func:`wait`.

source: On Windows, the return value is that returned by the system shell after running *command*. The shell is given by the Windows environment variable :envvar:`COMSPEC`: it is usually :program:`cmd.exe`, which returns the exit status of the command run; on systems using a non-native shell, consult your shell documentation.
es: En Windows, el valor de retorno es el que retorna el shell del sistema después de ejecutar *command*. El shell viene dado por la variable de entorno de Windows :envvar:`COMSPEC`: generalmente es :program:`cmd.exe`, que retorna el estado de salida de la ejecución del comando; En sistemas que utilizan un shell no nativo, consulte la documentación del shell.

source: The :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using this function. See the :ref:`subprocess-replacements` section in the :mod:`subprocess` documentation for some helpful recipes.
es: El módulo :mod:`subprocess` proporciona instalaciones más potentes para generar nuevos procesos y recuperar sus resultados; usar ese módulo es preferible a usar esta función. Consulte la sección :ref:`subprocess-replacements` en la documentación de :mod:`subprocess` para obtener algunas recetas útiles.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the result (exit status) into an exit code. On Windows, the result is directly the exit code.
es: En Unix, :func:`waitstatus_to_exitcode` puede ser usado para convertir el resultado (estado de salida) en un código de salida. En Windows, el resultado es directamente el código de salida.

source: Raises an :ref:`auditing event <auditing>` ``os.system`` with argument ``command``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.system`` con argumento ``command``.

source: Returns the current global process times. The return value is an object with five attributes:
es: Retorna los tiempos de proceso globales actuales. El valor de retorno es un objeto con cinco atributos:

source: :attr:`!user` - user time
es: :attr:`!user` - tiempo de usuario

source: :attr:`!system` - system time
es: :attr:`!system` - tiempo de sistema

source: :attr:`!children_user` - user time of all child processes
es: :attr:`!children_user` - tiempo de usuario de todos los procesos secundarios

source: :attr:`!children_system` - system time of all child processes
es: :attr:`!children_system` - hora del sistema de todos los procesos secundarios

source: :attr:`!elapsed` - elapsed real time since a fixed point in the past
es: :attr:`!elapsed`: tiempo real transcurrido desde un punto fijo en el pasado

source: For backwards compatibility, this object also behaves like a five-tuple containing :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system`, and :attr:`!elapsed` in that order.
es: Por compatibilidad con versiones anteriores, este objeto también se comporta como una tupla de cinco que contiene :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system` y :attr:`!elapsed` en ese orden.

source: Wait for completion of a child process, and return a tuple containing its pid and exit status indication: a 16-bit number, whose low byte is the signal number that killed the process, and whose high byte is the exit status (if the signal number is zero); the high bit of the low byte is set if a core file was produced.
es: Espere a que se complete un proceso secundario y retorna una tupla que contenga su indicación de estado pid y de salida: un número de 16 bits, cuyo byte bajo es el número de señal que mató el proceso y cuyo byte alto es el estado de salida (si la señal el número es cero); el bit alto del byte bajo se establece si se produjo un archivo central.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
es: :func:`waitstatus_to_exitcode` puede ser usado para convertir el estado de salida en el código de salida.

source: The details of this function differ on Unix and Windows.
es: Los detalles de esta función difieren en Unix y Windows.

source: On Unix: Wait for completion of a child process given by process id *pid*, and return a tuple containing its process id and exit status indication (encoded as for :func:`wait`). The semantics of the call are affected by the value of the integer *options*, which should be ``0`` for normal operation.
es: En Unix: espere a que se complete un proceso secundario dado por la identificación del proceso *pid*, y retorna una tupla que contenga su identificación del proceso y la indicación del estado de salida (codificado como para :func:`wait`). La semántica de la llamada se ve afectada por el valor del número entero *options*, que debe ser ``0`` para el funcionamiento normal.

source: If *pid* is greater than ``0``, :func:`waitpid` requests status information for that specific process. If *pid* is ``0``, the request is for the status of any child in the process group of the current process. If *pid* is ``-1``, the request pertains to any child of the current process. If *pid* is less than ``-1``, status is requested for any process in the process group ``-pid`` (the absolute value of *pid*).
es: Si *pid* es mayor que ``0``, :func:`waitpid` solicita información de estado para ese proceso específico. Si *pid* es ``0``, la solicitud es para el estado de cualquier hijo en el grupo de procesos del proceso actual. Si *pid* es ``-1``, la solicitud corresponde a cualquier elemento secundario del proceso actual. Si *pid* es menor que ``-1``, se solicita el estado de cualquier proceso en el grupo de procesos ``-pid`` (el valor absoluto de *pid*).

source: On Windows: Wait for completion of a process given by process handle *pid*, and return a tuple containing *pid*, and its exit status shifted left by 8 bits (shifting makes cross-platform use of the function easier). A *pid* less than or equal to ``0`` has no special meaning on Windows, and raises an exception. The value of integer *options* has no effect. *pid* can refer to any process whose id is known, not necessarily a child process. The :func:`spawn\* <spawnl>` functions called with :const:`P_NOWAIT` return suitable process handles.
es: En Windows: espere a que se complete un proceso dado por el identificador de proceso *pid*, y retorna una tupla que contiene *pid*, y su estado de salida se desplazó a la izquierda en 8 bits (el desplazamiento facilita el uso de la función en la plataforma). A *pid* menor o igual que ``0`` no tiene un significado especial en Windows y genera una excepción. El valor de entero *options* no tiene ningún efecto. *pid* puede referirse a cualquier proceso cuya identificación sea conocida, no necesariamente un proceso hijo. Las funciones :func:`spawn\* <spawnl>` llamadas con :const:`P_NOWAIT` retornan manejadores de proceso adecuados.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exitcode.
es: :func:`waitstatus_to_exitcode` puede ser usado para convertir el estado de salida al código de salida.

source: Added :data:`CLD_KILLED` and :data:`CLD_STOPPED` values.
es: Agregado los valores :data:`CLD_KILLED` y :data:`CLD_STOPPED`.

source: Convert a wait status to an exit code.
es: Convertir un estado de espera a un código de salida.

source: On Unix:
es: En Unix:

source: If the process exited normally (if ``WIFEXITED(status)`` is true), return the process exit status (return ``WEXITSTATUS(status)``): result greater than or equal to 0.
es: Si el proceso termino con normalidad (if ``WIFEXITED(status)`` is true, se retornan el estado de salida del proceso (return ``WEXITSTATUS(status)``): resultado mayor o igual a 0.

source: If the process was terminated by a signal (if ``WIFSIGNALED(status)`` is true), return ``-signum`` where *signum* is the number of the signal that caused the process to terminate (return ``-WTERMSIG(status)``): result less than 0.
es: Si el proceso fue terminado por una señal (if ``WIFSIGNALED(status)`` is true), retorna ``-signum`` donde *signum* es el numero de la señal que cause que el proceso termine (return ``-WTERMSIG(status)``): resultado menor que 0.

source: Otherwise, raise a :exc:`ValueError`.
es: En el caso contrario, se lanza un :exc:`ValueError`.

source: On Windows, return *status* shifted right by 8 bits.
es: En Windows, retorna *status* desplazado a la derecha en 8 bits.

source: On Unix, if the process is being traced or if :func:`waitpid` was called with :data:`WUNTRACED` option, the caller must first check if ``WIFSTOPPED(status)`` is true. This function must not be called if ``WIFSTOPPED(status)`` is true.
es: En Unix, si el proceso esta siendo rastreado o si :func:`waitpid` fue llamado con la opción :data:`WUNTRACED`, el que llama debe revisar primero si ``WIFSTOPPED(status)`` es verdadero. La función no debe de ser llamada si ``WIFSTOPPED(status)`` es verdadero.

source: :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG` functions.
es: Funciones :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG`.

source: The following functions take a process status code as returned by :func:`system`, :func:`wait`, or :func:`waitpid` as a parameter. They may be used to determine the disposition of a process.
es: Las siguientes funciones toman un código de estado del proceso retornado por :func:`system`, :func:`wait`, o :func:`waitpid` como parámetro. Pueden usarse para determinar la disposición de un proceso.

source: Return ``True`` if a core dump was generated for the process, otherwise return ``False``.
es: Retorna ``True`` si se generó un volcado de núcleo para el proceso; de lo contrario, retorna ``False``.

source: This function should be employed only if :func:`WIFSIGNALED` is true.
es: Esta función debe emplearse solo si :func:`WIFSIGNALED` es verdadero.

source: See :data:`WCONTINUED` option.
es: Ver opción :data:`WCONTINUED`.

source: Return ``True`` if the process was stopped by delivery of a signal, otherwise return ``False``.
es: Retorna ``True`` si el proceso se detuvo mediante la entrega de una señal; de lo contrario, retorna ``False``.

source: :func:`WIFSTOPPED` only returns ``True`` if the :func:`waitpid` call was done using :data:`WUNTRACED` option or when the process is being traced (see :manpage:`ptrace(2)`).
es: :func:`WIFSTOPPED` solo retorna ``True`` si la llamada :func:`waitpid` se realizó utilizando la opción :data:`WUNTRACED` o cuando se rastrea el proceso (consulte :manpage:`ptrace(2)`)

source: Return ``True`` if the process was terminated by a signal, otherwise return ``False``.
es: Retorna ``True`` si el proceso finalizó con una señal; de lo contrario, retorna ``False``.

source: Return ``True`` if the process exited terminated normally, that is, by calling ``exit()`` or ``_exit()``, or by returning from ``main()``; otherwise return ``False``.
es: Retorna ``True`` si el proceso finalizó normalmente, es decir, llamando a ``exit()`` o ``_exit()``, o volviendo de ``main()``; de lo contrario, retorna ``False``.

source: Return the process exit status.
es: Retorna el estado de salida del proceso.

source: This function should be employed only if :func:`WIFEXITED` is true.
es: Esta función debe emplearse solo si :func:`WIFEXITED` es verdadero.

source: Return the signal which caused the process to stop.
es: Retorna la señal que hizo que el proceso se detuviera.

source: This function should be employed only if :func:`WIFSTOPPED` is true.
es: Esta función debe emplearse solo si :func:`WIFSTOPPED` es verdadero.

source: Return the number of the signal that caused the process to terminate.
es: Retorna el número de la señal que provocó la finalización del proceso.

source: Interface to the scheduler
es: Interfaz al planificador

source: These functions control how a process is allocated CPU time by the operating system. They are only available on some Unix platforms. For more detailed information, consult your Unix manpages.
es: Estas funciones controlan cómo el sistema operativo asigna el tiempo de CPU a un proceso. Solo están disponibles en algunas plataformas Unix. Para obtener información más detallada, consulte las páginas de manual de Unix.

source: The following scheduling policies are exposed if they are supported by the operating system.
es: Las siguientes políticas de programación están expuestas si son compatibles con el sistema operativo.

source: The default scheduling policy.
es: La política de programación predeterminada.

source: Scheduling policy for CPU-intensive processes that tries to preserve interactivity on the rest of the computer.
es: Política de programación para procesos intensivos en CPU que intenta preservar la interactividad en el resto de la computadora.

source: Scheduling policy for extremely low priority background tasks.
es: Política de programación para tareas en segundo plano de prioridad extremadamente baja.

source: Scheduling policy for sporadic server programs.
es: Política de programación para programas de servidor esporádicos.

source: A First In First Out scheduling policy.
es: Una política de programación *First In First Out*.

source: A round-robin scheduling policy.
es: Una política de programación round-robin.

source: This flag can be OR'ed with any other scheduling policy. When a process with this flag set forks, its child's scheduling policy and priority are reset to the default.
es: Esta flag se puede OR con cualquier otra política de programación. Cuando un proceso con este indicador establece bifurcaciones, la política de programación y la prioridad de su hijo se restablecen a los valores predeterminados.

source: This class represents tunable scheduling parameters used in :func:`sched_setparam`, :func:`sched_setscheduler`, and :func:`sched_getparam`. It is immutable.
es: Esta clase representa los parámetros de programación ajustables utilizados en :func:`sched_setparam`, :func:`sched_setscheduler` y :func:`sched_getparam`. Es inmutable.

source: At the moment, there is only one possible parameter:
es: Por el momento, solo hay un parámetro posible:

source: The scheduling priority for a scheduling policy.
es: La prioridad de programación para una política de programación.

source: Get the minimum priority value for *policy*. *policy* is one of the scheduling policy constants above.
es: Obtiene el valor de prioridad mínimo para *policy*. *policy* es una de las constantes de política de programación anteriores.

source: Get the maximum priority value for *policy*. *policy* is one of the scheduling policy constants above.
es: Obtiene el valor de prioridad máxima para *policy*. *policy* es una de las constantes de política de programación anteriores.

source: Set the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. *policy* is one of the scheduling policy constants above. *param* is a :class:`sched_param` instance.
es: Establece la política de programación para el proceso con PID *pid*. Un *pid* de 0 significa el proceso de llamada. *policy* es una de las constantes de política de programación anteriores. *param* es una instancia de :class:`sched_param`.

source: Return the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. The result is one of the scheduling policy constants above.
es: Retorna la política de programación para el proceso con PID *pid*. Un *pid* de 0 significa el proceso de llamada. El resultado es una de las constantes de política de programación anteriores.

source: Set the scheduling parameters for the process with PID *pid*. A *pid* of 0 means the calling process. *param* is a :class:`sched_param` instance.
es: Establece los parámetros de programación para el proceso con PID *pid*. Un *pid* de 0 significa el proceso de llamada. *param* es una instancia de :class:`sched_param`.

source: Return the scheduling parameters as a :class:`sched_param` instance for the process with PID *pid*. A *pid* of 0 means the calling process.
es: Retorna los parámetros de programación como una instancia de :class:`sched_param` para el proceso con PID *pid*. Un *pid* de 0 significa el proceso de llamada.

source: Return the round-robin quantum in seconds for the process with PID *pid*. A *pid* of 0 means the calling process.
es: Retorna el round-robin quantum en segundos para el proceso con PID *pid*. Un *pid* de 0 significa el proceso de llamada.

source: Voluntarily relinquish the CPU.
es: Renunciar voluntariamente a la CPU.

source: Restrict the process with PID *pid* (or the current process if zero) to a set of CPUs. *mask* is an iterable of integers representing the set of CPUs to which the process should be restricted.
es: Restringe el proceso con PID *pid* (o el proceso actual si es cero) a un conjunto de CPU. *mask* es un entero iterable que representa el conjunto de CPU a las que se debe restringir el proceso.

source: Return the set of CPUs the process with PID *pid* (or the current process if zero) is restricted to.
es: Retorna el conjunto de CPU al proceso con PID *pid* (o el proceso actual si es cero) está restringido.

source: Miscellaneous System Information
es: Información miscelánea del sistema

source: Return string-valued system configuration values. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given as the keys of the ``confstr_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
es: Retorna valores de configuración del sistema con valores de cadena. *name* especifica el valor de configuración para recuperar; puede ser una cadena que es el nombre de un valor de sistema definido; estos nombres se especifican en varios estándares (POSIX, Unix 95, Unix 98 y otros). Algunas plataformas también definen nombres adicionales. Los nombres conocidos por el sistema operativo host se dan como las claves del diccionario ``confstr_names``. Para las variables de configuración no incluidas en esa asignación, también se acepta pasar un número entero para *name*.

source: If the configuration value specified by *name* isn't defined, ``None`` is returned.
es: Si el valor de configuración especificado por *name* no está definido, se retorna ``None``.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``confstr_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
es: Si *name* es una cadena y no se conoce, se excita :exc:`ValueError`. Si el sistema host no admite un valor específico para *name*, incluso si está incluido en ``confstr_names``, se lanza un :exc:`OSError` con :const:`errno.EINVAL` para el número de error .

source: Dictionary mapping names accepted by :func:`confstr` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
es: Nombres de mapeo de diccionario aceptados por :func:`confstr` a los valores enteros definidos para esos nombres por el sistema operativo host. Esto se puede usar para determinar el conjunto de nombres conocidos por el sistema.

source: Return the number of CPUs in the system. Returns ``None`` if undetermined.
es: Retorna el número de CPU en el sistema. Retorna ``None`` si no está determinado.

source: This number is not equivalent to the number of CPUs the current process can use. The number of usable CPUs can be obtained with ``len(os.sched_getaffinity(0))``
es: Este número no es equivalente al número de CPU que puede utilizar el proceso actual. El número de CPU utilizables se puede obtener con ``len(os.sched_getaffinity(0))``

source: Return the number of processes in the system run queue averaged over the last 1, 5, and 15 minutes or raises :exc:`OSError` if the load average was unobtainable.
es: Retorna el número de procesos en la cola de ejecución del sistema promediada durante los últimos 1, 5 y 15 minutos o aumentos :exc:`OSError` si el promedio de carga no se pudo obtener.

source: Return integer-valued system configuration values. If the configuration value specified by *name* isn't defined, ``-1`` is returned. The comments regarding the *name* parameter for :func:`confstr` apply here as well; the dictionary that provides information on the known names is given by ``sysconf_names``.
es: Retorna valores de configuración del sistema con valores enteros. Si el valor de configuración especificado por *name* no está definido, se retorna ``-1``. Los comentarios sobre el parámetro *name* para :func:`confstr` se aplican aquí también; El diccionario que proporciona información sobre los nombres conocidos viene dado por ``sysconf_names``.

source: Dictionary mapping names accepted by :func:`sysconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
es: Nombres de asignación de diccionario aceptados por :func:`sysconf` a los valores enteros definidos para esos nombres por el sistema operativo host. Esto se puede usar para determinar el conjunto de nombres conocidos por el sistema.

source: Add ``'SC_MINSIGSTKSZ'`` name.
es: Agregue el nombre ``'SC_MINSIGSTKSZ'``.

source: The following data values are used to support path manipulation operations. These are defined for all platforms.
es: Los siguientes valores de datos se utilizan para admitir operaciones de manipulación de rutas. Estos están definidos para todas las plataformas.

source: Higher-level operations on pathnames are defined in the :mod:`os.path` module.
es: Las operaciones de nivel superior en los nombres de ruta se definen en el módulo :mod:`os.path`.
