Repository: python/python-docs-es
Catalog: library/os.po
Languages: es

source: Since :func:`fwalk` yields file descriptors, those are only valid until the next iteration step, so you should duplicate them (e.g. with :func:`dup`) if you want to keep them longer.
es: Dado que :func:`fwalk` produce descriptores de archivo, estos solo son válidos hasta el siguiente paso de iteración, por lo que debe duplicarlos (por ejemplo, con :func:`dup`) si desea mantenerlos más tiempo.

source: In the next example, walking the tree bottom-up is essential: :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
es: En el siguiente ejemplo, recorrer el árbol de abajo hacia arriba es esencial: :func:`rmdir` no permite eliminar un directorio antes de que el directorio esté vacío::

source: Raises an :ref:`auditing event <auditing>` ``os.fwalk`` with arguments ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.chown`` con argumentos ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.

source: Added support for :class:`bytes` paths.
es: Se agregó soporte para rutas de acceso :class:`bytes`.

source: Create an anonymous file and return a file descriptor that refers to it. *flags* must be one of the ``os.MFD_*`` constants available on the system (or a bitwise ORed combination of them). By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
es: Cree un archivo anónimo y retorna un descriptor de archivo que se refiera a él. *flags* debe ser una de las constantes ``os.MFD_*`` disponibles en el sistema (o una combinación ORed bit a bit de ellas). Por defecto, el nuevo descriptor de archivo es :ref:`no heredable <fd_inheritance>`.

source: The name supplied in *name* is used as a filename and will be displayed as the target of the corresponding symbolic link in the directory ``/proc/self/fd/``. The displayed name is always prefixed with ``memfd:`` and serves only for debugging purposes. Names do not affect the behavior of the file descriptor, and as such multiple files can have the same name without any side effects.
es: El nombre proporcionado en *name* se utiliza como nombre de archivo y se mostrará como el destino del enlace simbólico correspondiente en el directorio ``/proc/self/fd/``. El nombre que se muestra siempre tiene el prefijo ``memfd:`` y solo sirve para fines de depuración. Los nombres no afectan el comportamiento del descriptor de archivo y, como tal, varios archivos pueden tener el mismo nombre sin efectos secundarios.

source: These flags can be passed to :func:`memfd_create`.
es: Estas flags se pueden pasar a :func:`memfd_create`.

source: The ``MFD_HUGE*`` flags are only available since Linux 4.14.
es: Las banderas ``MFD_HUGE*`` solo están disponibles desde Linux 4.14.

source: Create and return an event file descriptor. The file descriptors supports raw :func:`read` and :func:`write` with a buffer size of 8, :func:`~select.select`, :func:`~select.poll` and similar. See man page :manpage:`eventfd(2)` for more information. By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
es: Crea y retorna un descriptor de archivo de eventos. Los descriptores de archivo admiten :func:`read` y :func:`write` sin procesar con un tamaño de búfer de 8, :func:`~select.select`, :func:`~select.poll` y similares. Consulte la página de manual :manpage:`eventfd(2)` para obtener más información. De forma predeterminada, el nuevo descriptor de archivo :ref:`no es heredable <fd_inheritance>`.

source: *initval* is the initial value of the event counter. The initial value must be an 32 bit unsigned integer. Please note that the initial value is limited to a 32 bit unsigned int although the event counter is an unsigned 64 bit integer with a maximum value of 2\ :sup:`64`\ -\ 2.
es: *initval* es el valor inicial del contador de eventos. El valor inicial debe ser un entero sin signo de 32 bits. Tenga en cuenta que el valor inicial está limitado a un entero sin signo de 32 bits, aunque el contador de eventos es un entero de 64 bits sin signo con un valor máximo de 2 \ :sup:`64`\ -\ 2.

source: *flags* can be constructed from :const:`EFD_CLOEXEC`, :const:`EFD_NONBLOCK`, and :const:`EFD_SEMAPHORE`.
es: *flags* se puede construir a partir de :const:`EFD_CLOEXEC`, :const:`EFD_NONBLOCK` y :const:`EFD_SEMAPHORE`.

source: If :const:`EFD_SEMAPHORE` is specified and the event counter is non-zero, :func:`eventfd_read` returns 1 and decrements the counter by one.
es: Si se especifica :const:`EFD_SEMAPHORE` y el contador de eventos no es cero, :func:`eventfd_read` retorna 1 y reduce el contador en uno.

source: If :const:`EFD_SEMAPHORE` is not specified and the event counter is non-zero, :func:`eventfd_read` returns the current event counter value and resets the counter to zero.
es: Si no se especifica :const:`EFD_SEMAPHORE` y el contador de eventos no es cero, :func:`eventfd_read` retorna el valor actual del contador de eventos y restablece el contador a cero.

source: If the event counter is zero and :const:`EFD_NONBLOCK` is not specified, :func:`eventfd_read` blocks.
es: Si el contador de eventos es cero y no se especifica :const:`EFD_NONBLOCK`, :func:`eventfd_read` se bloquea.

source: :func:`eventfd_write` increments the event counter. Write blocks if the write operation would increment the counter to a value larger than 2\ :sup:`64`\ -\ 2.
es: :func:`eventfd_write` incrementa el contador de eventos. Escribe bloques si la operación de escritura incrementaría el contador a un valor mayor que \ :sup:`64`\ -\ 2.

source: Read value from an :func:`eventfd` file descriptor and return a 64 bit unsigned int. The function does not verify that *fd* is an :func:`eventfd`.
es: Lee el valor de un descriptor de archivo :func:`eventfd` y retorna un int sin signo de 64 bits. La función no verifica que *fd* sea un :func:`eventfd`.

source: Add value to an :func:`eventfd` file descriptor. *value* must be a 64 bit unsigned int. The function does not verify that *fd* is an :func:`eventfd`.
es: Agregue valor a un descriptor de archivo :func:`eventfd`. *value* debe ser un int sin signo de 64 bits. La función no verifica que *fd* sea un :func:`eventfd`.

source: Set close-on-exec flag for new :func:`eventfd` file descriptor.
es: Establezca el indicador close-on-exec para el nuevo descriptor de archivo :func:`eventfd`.

source: Set :const:`O_NONBLOCK` status flag for new :func:`eventfd` file descriptor.
es: Establezca el indicador de estado :const:`O_NONBLOCK` para el nuevo descriptor de archivo :func:`eventfd`.

source: Provide semaphore-like semantics for reads from a :func:`eventfd` file descriptor. On read the internal counter is decremented by one.
es: Proporcione semántica similar a un semáforo para las lecturas de un descriptor de archivo :func:`eventfd`. Al leer, el contador interno se reduce en uno.

source: Linux extended attributes
es: Atributos extendidos de Linux

source: These functions are all available on Linux only.
es: Estas funciones están disponibles solo en Linux.

source: Return the value of the extended filesystem attribute *attribute* for *path*. *attribute* can be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is str, it is encoded with the filesystem encoding.
es: Retorna el valor del atributo del sistema de archivos extendido *atrribute* para *path*. *attribute* puede ser bytes o str (directa o indirectamente a través de la interfaz :class:`PathLike`). Si es str, se codifica con la codificación del sistema de archivos.

source: Raises an :ref:`auditing event <auditing>` ``os.getxattr`` with arguments ``path``, ``attribute``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.getxattr`` con argumentos ``path``, ``atributo``.

source: Accepts a :term:`path-like object` for *path* and *attribute*.
es: Acepta un :term:`path-like object` para *path*y *attribute*.

source: Return a list of the extended filesystem attributes on *path*. The attributes in the list are represented as strings decoded with the filesystem encoding. If *path* is ``None``, :func:`listxattr` will examine the current directory.
es: Retorna una lista de los atributos del sistema de archivos extendido en *path*. Los atributos en la lista se representan como cadenas decodificadas con la codificación del sistema de archivos. Si *path* es ``None``, :func:`listxattr` examinará el directorio actual.

source: Raises an :ref:`auditing event <auditing>` ``os.listxattr`` with argument ``path``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.listxattr`` con el argumento ``path``.

source: Removes the extended filesystem attribute *attribute* from *path*. *attribute* should be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is a string, it is encoded with the :term:`filesystem encoding and error handler`.
es: Elimina el atributo extendido del sistema de archivos *attribute* de *path*. *attribute* debe ser bytes o str (directa o indirectamente a través de la interfaz :class:`PathLike`). Si es una cadena, está codificada con :term:`filesystem encoding and error handler`.

source: Raises an :ref:`auditing event <auditing>` ``os.removexattr`` with arguments ``path``, ``attribute``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.removexattr`` con argumentos ``path``, ``attribute``.

source: Set the extended filesystem attribute *attribute* on *path* to *value*. *attribute* must be a bytes or str with no embedded NULs (directly or indirectly through the :class:`PathLike` interface). If it is a str, it is encoded with the :term:`filesystem encoding and error handler`. *flags* may be :data:`XATTR_REPLACE` or :data:`XATTR_CREATE`. If :data:`XATTR_REPLACE` is given and the attribute does not exist, ``ENODATA`` will be raised. If :data:`XATTR_CREATE` is given and the attribute already exists, the attribute will not be created and ``EEXISTS`` will be raised.
es: Establece el atributo del sistema de archivos extendido *attribute* en *path* en *value*. *attribute* debe ser un bytes o una cadena sin NUL incrustados (directa o indirectamente a través de la interfaz :class:`PathLike`). Si es una cadena, está codificado con :term:`filesystem encoding and error handler`. *flags* puede ser :data:`XATTR_REPLACE` o :data:`XATTR_CREATE`. Si se proporciona :data:`XATTR_REPLACE` y el atributo no existe, se lanzará ``ENODATA``. Si se proporciona :data:`XATTR_CREATE` y el atributo ya existe, no se creará el atributo y se lanza ``EEXISTS``.

source: A bug in Linux kernel versions less than 2.6.39 caused the flags argument to be ignored on some filesystems.
es: Un error en las versiones de kernel de Linux anteriores a 2.6.39 hizo que el argumento de las flags se ignorara en algunos sistemas de archivos.

source: Raises an :ref:`auditing event <auditing>` ``os.setxattr`` with arguments ``path``, ``attribute``, ``value``, ``flags``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.setxattr`` con argumentos ``path``, ``attribute``, ``value``, ``flags``.

source: The maximum size the value of an extended attribute can be. Currently, this is 64 KiB on Linux.
es: El tamaño máximo que puede tener el valor de un atributo extendido. Actualmente, esto es 64 KiB en Linux.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must create an attribute.
es: Este es un valor posible para el argumento flags en :func:`setxattr`. Indica que la operación debe crear un atributo.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must replace an existing attribute.
es: Este es un valor posible para el argumento flags en :func:`setxattr`. Indica que la operación debe reemplazar un atributo existente.

source: Process Management
es: Gestión de proceso

source: These functions may be used to create and manage processes.
es: Estas funciones pueden usarse para crear y administrar procesos.

source: The various :func:`exec\* <execl>` functions take a list of arguments for the new program loaded into the process. In each case, the first of these arguments is passed to the new program as its own name rather than as an argument a user may have typed on a command line. For the C programmer, this is the ``argv[0]`` passed to a program's :c:func:`main`. For example, ``os.execv('/bin/echo', ['foo', 'bar'])`` will only print ``bar`` on standard output; ``foo`` will seem to be ignored.
es: Las varias funciones :func:`exec \* <execl>` toman una lista de argumentos para el nuevo programa cargado en el proceso. En cada caso, el primero de estos argumentos se pasa al nuevo programa como su propio nombre en lugar de como un argumento que un usuario puede haber escrito en una línea de comando. Para el programador C, este es el ``argv[0]`` pasado a un programa :c:func:`main`. Por ejemplo, ``os.execv('/bin/echo', ['foo', 'bar'])`` solo imprimirá ``bar`` en la salida estándar; ``foo`` parecerá ignorado.

source: Generate a :const:`SIGABRT` signal to the current process. On Unix, the default behavior is to produce a core dump; on Windows, the process immediately returns an exit code of ``3``. Be aware that calling this function will not call the Python signal handler registered for :const:`SIGABRT` with :func:`signal.signal`.
es: Genere una señal :const:`SIGABRT` para el proceso actual. En Unix, el comportamiento predeterminado es producir un volcado de núcleo; en Windows, el proceso retorna inmediatamente un código de salida de ``3``. Tenga en cuenta que llamar a esta función no llamará al controlador de señal Python registrado para :const:`SIGABRT` con :func:`signal.signal`.

source: Add a path to the DLL search path.
es: Agregue una ruta a la ruta de búsqueda de DLL.

source: This search path is used when resolving dependencies for imported extension modules (the module itself is resolved through :data:`sys.path`), and also by :mod:`ctypes`.
es: Esta ruta de búsqueda se utiliza al resolver dependencias para módulos de extensión importados (el propio módulo se resuelve mediante :data:`sys.path`) y también mediante :mod:`ctypes`.

source: Remove the directory by calling **close()** on the returned object or using it in a :keyword:`with` statement.
es: Elimina el directorio llamando a **close()** en el objeto retornado o utilizándolo en una :keyword:`with` instrucción.

source: See the `Microsoft documentation <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ for more information about how DLLs are loaded.
es: Consulte la `documentación de Microsoft <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ para obtener más información sobre cómo se cargan las DLL.

source: Raises an :ref:`auditing event <auditing>` ``os.add_dll_directory`` with argument ``path``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.add_dll_directory`` con el argumento ``path``.

source: Previous versions of CPython would resolve DLLs using the default behavior for the current process. This led to inconsistencies, such as only sometimes searching :envvar:`PATH` or the current working directory, and OS functions such as ``AddDllDirectory`` having no effect.
es: Las versiones anteriores de CPython resolverían las DLL utilizando el comportamiento predeterminado para el proceso actual. Esto condujo a inconsistencias, como solo a veces buscar :envvar:`PATH` o el directorio de trabajo actual, y las funciones del sistema operativo como ``AddDllDirectory`` no tienen ningún efecto.

source: In 3.8, the two primary ways DLLs are loaded now explicitly override the process-wide behavior to ensure consistency. See the :ref:`porting notes <bpo-36085-whatsnew>` for information on updating libraries.
es: En 3.8, las dos formas principales en que se cargan las DLL ahora anulan explícitamente el comportamiento de todo el proceso para garantizar la coherencia. Ver el :ref:`notas de portabilidad <bpo-36085-whatsnew>` para obtener información sobre la actualización de bibliotecas.

source: These functions all execute a new program, replacing the current process; they do not return. On Unix, the new executable is loaded into the current process, and will have the same process id as the caller. Errors will be reported as :exc:`OSError` exceptions.
es: Todas estas funciones ejecutan un nuevo programa, reemplazando el proceso actual; No vuelven. En Unix, el nuevo ejecutable se carga en el proceso actual y tendrá la misma identificación de proceso que la persona que llama. Los errores se informarán como excepciones :exc:`OSError`.

source: The current process is replaced immediately. Open file objects and descriptors are not flushed, so if there may be data buffered on these open files, you should flush them using :func:`sys.stdout.flush` or :func:`os.fsync` before calling an :func:`exec\* <execl>` function.
es: El proceso actual se reemplaza inmediatamente. Los objetos de archivo abierto y los descriptores no se vacían, por lo que si puede haber datos almacenados en estos archivos abiertos, debe limpiarlos usando :func:`sys.stdout.flush` o :func:`os.fsync` antes de llamar a :func:`exec\* <execl>` función.

source: The "l" and "v" variants of the :func:`exec\* <execl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`execl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process should start with the name of the command being run, but this is not enforced.
es: Las variantes "l" y "v" de las funciones :func:`exec\* <execl>` difieren en cómo se pasan los argumentos de la línea de comandos. Las variantes "l" son quizás las más fáciles de trabajar si el número de parámetros se fija cuando se escribe el código; los parámetros individuales simplemente se convierten en parámetros adicionales a las funciones :func:`execl\*`. Las variantes "v" son buenas cuando el número de parámetros es variable, y los argumentos se pasan en una lista o tupla como parámetro *args*. En cualquier caso, los argumentos del proceso secundario deben comenzar con el nombre del comando que se ejecuta, pero esto no se aplica.

source: For :func:`execle`, :func:`execlpe`, :func:`execve`, and :func:`execvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (these are used instead of the current process' environment); the functions :func:`execl`, :func:`execlp`, :func:`execv`, and :func:`execvp` all cause the new process to inherit the environment of the current process.
es: Para :func:`execle`, :func:`execlpe`, :func:`execve` y :func:`execvpe` (tenga en cuenta que todo esto termina en "e"), el parámetro *env* debe ser un mapeo que se utiliza para definir las variables de entorno para el nuevo proceso (se utilizan en lugar del entorno del proceso actual); las funciones :func:`execl`, :func:`execlp`, :func:`execv` y :func:`execvp` hacen que el nuevo proceso herede el entorno del proceso actual.

source: For :func:`execve` on some platforms, *path* may also be specified as an open file descriptor. This functionality may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_fd`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
es: Para :func:`execve` en algunas plataformas, *path* también puede especificarse como un descriptor de archivo abierto. Es posible que esta funcionalidad no sea compatible con su plataforma; puede verificar si está disponible o no usando :data:`os.supports_fd`. Si no está disponible, su uso lanzará un :exc:`NotImplementedError`.

source: Raises an :ref:`auditing event <auditing>` ``os.exec`` with arguments ``path``, ``args``, ``env``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``os.exec`` con argumentos ``ruta``, ``args``, ``env``.

source: Added support for specifying *path* as an open file descriptor for :func:`execve`.
es: Se agregó soporte para especificar *path* como un descriptor de archivo abierto para :func:`execve`.

source: Exit the process with status *n*, without calling cleanup handlers, flushing stdio buffers, etc.
es: Salga del proceso con el estado *n*, sin llamar a los controladores de limpieza, vaciar los buffers stdio, etc.

source: The following exit codes are defined and can be used with :func:`_exit`, although they are not required. These are typically used for system programs written in Python, such as a mail server's external command delivery program.
es: Los siguientes códigos de salida están definidos y se pueden usar con :func:`_exit`, aunque no son obligatorios. Por lo general, se usan para programas del sistema escritos en Python, como el programa de entrega de comandos externos de un servidor de correo.

source: Some of these may not be available on all Unix platforms, since there is some variation. These constants are defined where they are defined by the underlying platform.
es: Es posible que algunos de estos no estén disponibles en todas las plataformas Unix, ya que hay alguna variación. Estas constantes se definen donde están definidas por la plataforma subyacente.

source: Exit code that means no error occurred. May be taken from the defined value of ``EXIT_SUCCESS`` on some platforms. Generally has a value of zero.
es: Código de salida que significa que no ocurrió ningún error. Puede tomarse del valor definido de ``EXIT_SUCCESS`` en algunas plataformas. Generalmente tiene un valor de cero.

source: Exit code that means the command was used incorrectly, such as when the wrong number of arguments are given.
es: Código de salida que significa que el comando se usó incorrectamente, como cuando se da un número incorrecto de argumentos.

source: Exit code that means the input data was incorrect.
es: Código de salida que significa que los datos de entrada eran incorrectos.

source: Exit code that means an input file did not exist or was not readable.
es: Código de salida que significa que no existía un archivo de entrada o que no era legible.

source: Exit code that means a specified user did not exist.
es: Código de salida que significa que un usuario especificado no existía.

source: Exit code that means a specified host did not exist.
es: Código de salida que significa que no existía un host especificado.

source: Exit code that means that a required service is unavailable.
es: Código de salida que significa que un servicio requerido no está disponible.

source: Exit code that means an internal software error was detected.
es: Código de salida que significa que se detectó un error interno de software.

source: Exit code that means an operating system error was detected, such as the inability to fork or create a pipe.
es: Código de salida que significa que se detectó un error del sistema operativo, como la imposibilidad de bifurcar o crear una tubería.

source: Exit code that means some system file did not exist, could not be opened, or had some other kind of error.
es: Código de salida que significa que algunos archivos del sistema no existían, no podían abrirse o tenían algún otro tipo de error.

source: Exit code that means a user specified output file could not be created.
es: Código de salida que significa que no se pudo crear un archivo de salida especificado por el usuario.

source: Exit code that means that an error occurred while doing I/O on some file.
es: Código de salida que significa que se produjo un error al realizar E / S en algún archivo.
