Repository: python/python-docs-es
Catalog: library/ossaudiodev.po
Languages: es_co

source: :mod:`ossaudiodev` --- Access to OSS-compatible audio devices
es_co: :mod:`ossaudiodev` --- Acceso a dispositivos de audio compatibles con OSS

source: This module allows you to access the OSS (Open Sound System) audio interface. OSS is available for a wide range of open-source and commercial Unices, and is the standard audio interface for Linux and recent versions of FreeBSD.
es_co: Este módulo le permite acceder a la interfaz de audio OSS (Open Sound System). OSS está disponible para una amplia gama de Unices comerciales y de código abierto, y es la interfaz de audio estándar para Linux y versiones recientes de FreeBSD.

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
es_co: Las operaciones en este módulo ahora generan :exc:`OSError` donde :exc:`IOError`` es generado.

source: the official documentation for the OSS C API
es_co: la documentación oficial de la API de OSS C

source: The module defines a large number of constants supplied by the OSS device driver; see ``<sys/soundcard.h>`` on either Linux or FreeBSD for a listing.
es_co: El módulo define una gran cantidad de constantes suministradas por el controlador de dispositivo OSS; consulte ``<sys/soundcard.h>`` en Linux o FreeBSD para obtener un listado.

source: :mod:`ossaudiodev` defines the following variables and functions:
es_co: :mod:`ossaudiodev` define las siguientes variables y funciones:

source: This exception is raised on certain errors. The argument is a string describing what went wrong.
es_co: Esta excepción se genera en ciertos errores. El argumento es una cadena que describe qué salió mal.

source: (If :mod:`ossaudiodev` receives an error from a system call such as :c:func:`open`, :c:func:`write`, or :c:func:`ioctl`, it raises :exc:`OSError`. Errors detected directly by :mod:`ossaudiodev` result in :exc:`OSSAudioError`.)
es_co: (Si :mod:`ossaudiodev`` recibe un error de una llamada al sistema como :c:func:`open`, :c:func:`write`, o :c:func:`ioctl`, genera :exc:`OSError`. Los errores detectados directamente por :mod:`ossaudiodev` dan como resultado :exc:`OSSAudioError`.)

source: (For backwards compatibility, the exception class is also available as ``ossaudiodev.error``.)
es_co: (Para compatibilidad con versiones anteriores, la clase de excepción también está disponible como ``ossaudiodev.error``.)

source: Open an audio device and return an OSS audio device object. This object supports many file-like methods, such as :meth:`read`, :meth:`write`, and :meth:`fileno` (although there are subtle differences between conventional Unix read/write semantics and those of OSS audio devices). It also supports a number of audio-specific methods; see below for the complete list of methods.
es_co: Abra un dispositivo de audio y devuelva un objeto de dispositivo de audio OSS. Este objeto admite muchos métodos similares a archivos, como :meth:`read`, :meth:`write`, and :meth:`fileno` (aunque existen diferencias sutiles entre la semántica de lectura/escritura convencional de Unix y la de audio OSS dispositivos). También es compatible con varios métodos específicos de audio; vea a continuación la lista completa de métodos.

source: *device* is the audio device filename to use. If it is not specified, this module first looks in the environment variable :envvar:`AUDIODEV` for a device to use. If not found, it falls back to :file:`/dev/dsp`.
es_co: *device* es el nombre de archivo del dispositivo de audio que se utilizará. Si no se especifica, este módulo primero busca en la variable de entorno :envvar:`AUDIODEV` para un dispositivo a usar. Si no se encuentra, vuelve a :file:`/dev/dsp`.

source: *mode* is one of ``'r'`` for read-only (record) access, ``'w'`` for write-only (playback) access and ``'rw'`` for both. Since many sound cards only allow one process to have the recorder or player open at a time, it is a good idea to open the device only for the activity needed. Further, some sound cards are half-duplex: they can be opened for reading or writing, but not both at once.
es_co: *mode* es uno de ``’r’`` para acceso de solo lectura (grabación), ``’w’`` para acceso de solo escritura (reproducción) y ``’rw’`` para ambos. Dado que muchas tarjetas de sonido solo permiten que un proceso tenga la grabadora o el reproductor abiertos a la vez, es una buena idea abrir el dispositivo solo para la actividad necesaria. Además, algunas tarjetas de sonido son semidúplex: se pueden abrir para leer o escribir, pero no ambas a la vez.

source: Note the unusual calling syntax: the *first* argument is optional, and the second is required. This is a historical artifact for compatibility with the older :mod:`linuxaudiodev` module which :mod:`ossaudiodev` supersedes.
es_co: Tenga en cuenta la sintaxis de llamada inusual: el *first* argumento es opcional y el segundo es obligatorio. Este es un artefacto histórico para la compatibilidad con el módulo anterior :mod:`linuxaudiodev` que :mod:`ossaudiodev` reemplaza.

source: Open a mixer device and return an OSS mixer device object. *device* is the mixer device filename to use. If it is not specified, this module first looks in the environment variable :envvar:`MIXERDEV` for a device to use. If not found, it falls back to :file:`/dev/mixer`.
es_co: Abra un dispositivo mezclador y devuelva un objeto de dispositivo mezclador OSS. *device* es el nombre de archivo del dispositivo mezclador que se utilizará. Si no se especifica, este módulo primero busca en la variable de entorno :envvar:`MIXERDEV` para usar un dispositivo. Si no se encuentra, vuelve a :file:`/dev/mixer`.

source: Audio Device Objects
es_co: Objetos de dispositivo de audio

source: Before you can write to or read from an audio device, you must call three methods in the correct order:
es_co: Antes de poder escribir o leer desde un dispositivo de audio, debe llamar a tres métodos en el orden correcto:

source: :meth:`setfmt` to set the output format
es_co: :meth:`setfmt` para configurar el formato de salida

source: :meth:`channels` to set the number of channels
es_co: :meth:`channels` para configurar el número de canales

source: :meth:`speed` to set the sample rate
es_co: :meth:`speed` para configurar la frecuencia de muestreo

source: Alternately, you can use the :meth:`setparameters` method to set all three audio parameters at once. This is more convenient, but may not be as flexible in all cases.
es_co: Alternativamente, puede usar el método :meth:`setparameters` para configurar los tres parámetros de audio a la vez. Esto es más conveniente, pero puede que no sea tan flexible en todos los casos.

source: The audio device objects returned by :func:`.open` define the following methods and (read-only) attributes:
es_co: Los objetos de dispositivo de audio devueltos por :func:`.open` definen los siguientes métodos y atributos (de solo lectura):

source: Explicitly close the audio device. When you are done writing to or reading from an audio device, you should explicitly close it. A closed device cannot be used again.
es_co: Cierre explícitamente el dispositivo de audio. Cuando haya terminado de escribir o leer desde un dispositivo de audio, debe cerrarlo explícitamente. Un dispositivo cerrado no se puede volver a utilizar.

source: Return the file descriptor associated with the device.
es_co: Devuelve el descriptor de archivo asociado con el dispositivo.

source: Read *size* bytes from the audio input and return them as a Python string. Unlike most Unix device drivers, OSS audio devices in blocking mode (the default) will block :func:`read` until the entire requested amount of data is available.
es_co: Leer *size* bytes de la entrada de audio y devolverlos como una cadena de Python. A diferencia de la mayoría de los controladores de dispositivos Unix, los dispositivos de audio OSS en modo de bloqueo (el predeterminado) bloquearán :func:`read` hasta que esté disponible toda la cantidad de datos solicitada.

source: Write a :term:`bytes-like object` *data* to the audio device and return the number of bytes written. If the audio device is in blocking mode (the default), the entire data is always written (again, this is different from usual Unix device semantics). If the device is in non-blocking mode, some data may not be written---see :meth:`writeall`.
es_co: Escriba un :term:`bytes-like object` *data* en el dispositivo de audio y devuelva el número de bytes escritos. Si el dispositivo de audio está en modo de bloqueo (el predeterminado), todos los datos siempre se escriben (nuevamente, esto es diferente de la semántica habitual del dispositivo Unix). Si el dispositivo está en modo sin bloqueo, es posible que algunos datos no se escriban---see :meth:`writeall`.

source: Writable :term:`bytes-like object` is now accepted.
es_co: Ahora se aceptan objetos con permisos de escritura con formato :term:`bytes-like object`.

source: Write a :term:`bytes-like object` *data* to the audio device: waits until the audio device is able to accept data, writes as much data as it will accept, and repeats until *data* has been completely written. If the device is in blocking mode (the default), this has the same effect as :meth:`write`; :meth:`writeall` is only useful in non-blocking mode. Has no return value, since the amount of data written is always equal to the amount of data supplied.
es_co: Escriba un :term:`bytes-like object` *data* en el dispositivo de audio: espera hasta que el dispositivo de audio sea capaz de aceptar datos, escribe tantos datos como acepte y repite hasta que *data* se hayan escrito por completo. Si el dispositivo está en modo de bloqueo (el predeterminado), esto tiene el mismo efecto que :meth:`write`; :meth:`writeall` solo es útil en el modo sin bloqueo. No tiene valor de retorno, ya que la cantidad de datos escritos siempre es igual a la cantidad de datos suministrados.

source: Audio device objects also support the context management protocol, i.e. they can be used in a :keyword:`with` statement.
es_co: Los objetos de dispositivo de audio también admiten el protocolo de gestión de contexto, es decir, se pueden utilizar en una declaración :keyword:`with`.

source: The following methods each map to exactly one :c:func:`ioctl` system call. The correspondence is obvious: for example, :meth:`setfmt` corresponds to the ``SNDCTL_DSP_SETFMT`` ioctl, and :meth:`sync` to ``SNDCTL_DSP_SYNC`` (this can be useful when consulting the OSS documentation). If the underlying :c:func:`ioctl` fails, they all raise :exc:`OSError`.
es_co: Los siguientes métodos se asignan exactamente a una llamada al sistema :c:func:`ioctl`. La correspondencia es obvia: por ejemplo, :meth:`setfmt` corresponde al ``SNDCTL_DSP_SETFMT`` ioctl, y :meth:`sync` a ``SNDCTL_DSP_SYNC``(esto puede ser útil cuando se consulta la documentación de OSS). Si el subyacente :c:func:`ioctl` falla, todos generan :exc:`OSError`.

source: Put the device into non-blocking mode. Once in non-blocking mode, there is no way to return it to blocking mode.
es_co: Ponga el dispositivo en modo sin bloqueo. Una vez en el modo sin bloqueo, no hay forma de volverlo al modo de bloqueo.

source: Return a bitmask of the audio output formats supported by the soundcard. Some of the formats supported by OSS are:
es_co: Devuelve una máscara de bits de los formatos de salida de audio admitidos por la tarjeta de sonido. Algunos de los formatos admitidos por OSS son:

source: Format
es_co: Formato

source: Description
es_co: Descripción

source: a logarithmic encoding (used by Sun ``.au`` files and :file:`/dev/audio`)
es_co: una codificación logarítmica (utilizada por los archivos Sun ``.au`` y :file:`/dev/audio`)

source: a logarithmic encoding
es_co: una codificación logarítmica

source: a 4:1 compressed format defined by the Interactive Multimedia Association
es_co: un formato comprimido 4:1 definido por la Interactive Multimedia Association

source: Unsigned, 8-bit audio
es_co: Audio de 8 bits sin firmar

source: Signed, 16-bit audio, little-endian byte order (as used by Intel processors)
es_co: Orden de bytes little-endian firmado, audio de 16 bits (como lo utilizan los procesadores Intel)

source: Signed, 16-bit audio, big-endian byte order (as used by 68k, PowerPC, Sparc)
es_co: Orden de bytes big-endian firmado, audio de 16 bits (como lo utilizan 68k, PowerPC, Sparc)

source: Signed, 8 bit audio
es_co: Firmado, audio de 8 bits

source: Unsigned, 16-bit little-endian audio
es_co: Audio little-endian de 16 bits sin firmar

source: Unsigned, 16-bit big-endian audio
es_co: Audio big-endian de 16 bits sin firmar

source: Consult the OSS documentation for a full list of audio formats, and note that most devices support only a subset of these formats. Some older devices only support :const:`AFMT_U8`; the most common format used today is :const:`AFMT_S16_LE`.
es_co: Consulte la documentación de OSS para obtener una lista completa de los formatos de audio y tenga en cuenta que la mayoría de los dispositivos solo admiten un subconjunto de estos formatos. Algunos dispositivos antiguos solo admiten :const:`AFMT_U8`; el formato más común utilizado hoy en día es :const:`AFMT_S16_LE`.

source: Try to set the current audio format to *format*---see :meth:`getfmts` for a list. Returns the audio format that the device was set to, which may not be the requested format. May also be used to return the current audio format---do this by passing an "audio format" of :const:`AFMT_QUERY`.
es_co: Intente establecer el formato de audio actual en *format*---consulte :meth:`getfmts` para obtener una lista. Devuelve el formato de audio en el que se configuró el dispositivo, que puede no ser el formato solicitado. También se puede utilizar para devolver el formato de audio actual. Haga esto pasando un “formato de audio” de :const:`AFMT_QUERY`.

source: Set the number of output channels to *nchannels*. A value of 1 indicates monophonic sound, 2 stereophonic. Some devices may have more than 2 channels, and some high-end devices may not support mono. Returns the number of channels the device was set to.
es_co: Establezca el número de canales de salida en *nchannels*. Un valor de 1 indica sonido monofónico, 2 estereofónico. Algunos dispositivos pueden tener más de 2 canales y algunos dispositivos de gama alta pueden no admitir mono. Devuelve el número de canales en los que se configuró el dispositivo.

source: Try to set the audio sampling rate to *samplerate* samples per second. Returns the rate actually set. Most sound devices don't support arbitrary sampling rates. Common rates are:
es_co: Intente establecer la frecuencia de muestreo de audio en *samplerate* muestras por segundo. Devuelve la tasa realmente establecida. La mayoría de los dispositivos de sonido no admiten frecuencias de muestreo arbitrarias. Las tarifas comunes son:

source: Rate
es_co: Velocidad

source: default rate for :file:`/dev/audio`
es_co: tasa predeterminada para :file:`/dev/audio`

source: speech recording
es_co: grabación de voz

source: CD quality audio (at 16 bits/sample and 2 channels)
es_co: Audio con calidad de CD (a 16 bits/muestra y 2 canales)

source: DVD quality audio (at 24 bits/sample)
es_co: Audio con calidad de DVD (a 24 bits/muestra)

source: Wait until the sound device has played every byte in its buffer. (This happens implicitly when the device is closed.) The OSS documentation recommends closing and re-opening the device rather than using :meth:`sync`.
es_co: Espere hasta que el dispositivo de sonido haya reproducido todos los bytes de su búfer. (Esto sucede implícitamente cuando el dispositivo está cerrado). La documentación de OSS recomienda cerrar y volver a abrir el dispositivo en lugar de usar :meth:`sync`.

source: Immediately stop playing or recording and return the device to a state where it can accept commands. The OSS documentation recommends closing and re-opening the device after calling :meth:`reset`.
es_co: Deje de reproducir o grabar inmediatamente y devuelva el dispositivo a un estado en el que pueda aceptar comandos. La documentación de OSS recomienda cerrar y volver a abrir el dispositivo después de llamar :meth:`reset`.

source: Tell the driver that there is likely to be a pause in the output, making it possible for the device to handle the pause more intelligently. You might use this after playing a spot sound effect, before waiting for user input, or before doing disk I/O.
es_co: Dígale al controlador que es probable que haya una pausa en la salida, lo que hace posible que el dispositivo maneje la pausa de manera más inteligente. Puede usar esto después de reproducir un efecto de sonido puntual, antes de esperar la entrada del usuario o antes de realizar E/S de disco.

source: The following convenience methods combine several ioctls, or one ioctl and some simple calculations.
es_co: Los siguientes métodos de conveniencia combinan varios ioctl, o un ioctl y algunos cálculos simples.

source: Set the key audio sampling parameters---sample format, number of channels, and sampling rate---in one method call. *format*, *nchannels*, and *samplerate* should be as specified in the :meth:`setfmt`, :meth:`channels`, and :meth:`speed` methods. If *strict* is true, :meth:`setparameters` checks to see if each parameter was actually set to the requested value, and raises :exc:`OSSAudioError` if not. Returns a tuple (*format*, *nchannels*, *samplerate*) indicating the parameter values that were actually set by the device driver (i.e., the same as the return values of :meth:`setfmt`, :meth:`channels`, and :meth:`speed`).
es_co: Configure los parámetros clave de muestreo de audio (formato de muestra, número de canales y frecuencia de muestreo) en una llamada de método. *format*, *nchannels*, y *samplerate* deben ser como se especifica en los métodos :meth:`setfmt`, :meth:`channels`, y :meth:`speed`. Si *strict* es verdadero, :meth:`setparameters` comprueba si cada parámetro se estableció realmente en el valor solicitado, y genera :exc:`OSSAudioError` si no es así. Devuelve una tupla (*format*, *nchannels*, *samplerate*) que indica los valores de los parámetros que realmente estableció el controlador del dispositivo (es decir, los mismos que los valores devueltos de :meth:`setfmt`, :meth:`channels`, y :meth:`speed`).

source: For example, ::
es_co: Por ejemplo, ::

source: is equivalent to ::
es_co: es equivalente a ::

source: Returns the size of the hardware buffer, in samples.
es_co: Devuelve el tamaño del búfer de hardware, en muestras.

source: Returns the number of samples that are in the hardware buffer yet to be played.
es_co: Devuelve el número de muestras que están en el búfer de hardware que aún no se han reproducido.

source: Returns the number of samples that could be queued into the hardware buffer to be played without blocking.
es_co: Devuelve el número de muestras que se podrían poner en cola en el búfer de hardware para reproducirse sin bloqueos.

source: Audio device objects also support several read-only attributes:
es_co: Los objetos de dispositivo de audio también admiten varios atributos de solo lectura:

source: Boolean indicating whether the device has been closed.
es_co: Booleano que indica si el dispositivo se ha cerrado.

source: String containing the name of the device file.
es_co: Cadena que contiene el nombre del archivo del dispositivo.

source: The I/O mode for the file, either ``"r"``, ``"rw"``, or ``"w"``.
es_co: El modo de E/S para el archivo, ya sea ``”r”``, ``”rw”``, o ``”w”``.

source: Mixer Device Objects
es_co: Objetos del dispositivo mezclador

source: The mixer object provides two file-like methods:
es_co: El objeto del mezclador proporciona dos métodos similares a archivos:

source: This method closes the open mixer device file. Any further attempts to use the mixer after this file is closed will raise an :exc:`OSError`.
es_co: Este método cierra el archivo del dispositivo mezclador abierto. Cualquier otro intento de usar el mezclador después de que este archivo esté cerrado generará un :exc:`OSError`.

source: Returns the file handle number of the open mixer device file.
es_co: Devuelve el número de identificador de archivo del archivo del dispositivo mezclador abierto.

source: Mixer objects also support the context management protocol.
es_co: Los objetos Mixer también admiten el protocolo de gestión de contexto.

source: The remaining methods are specific to audio mixing:
es_co: Los métodos restantes son específicos para la mezcla de audio:

source: This method returns a bitmask specifying the available mixer controls ("Control" being a specific mixable "channel", such as :const:`SOUND_MIXER_PCM` or :const:`SOUND_MIXER_SYNTH`). This bitmask indicates a subset of all available mixer controls---the :const:`SOUND_MIXER_\*` constants defined at module level. To determine if, for example, the current mixer object supports a PCM mixer, use the following Python code::
es_co: Este método devuelve una máscara de bits que especifica los controles del mezclador disponibles (“Control” es un “canal” mezclable específico, como :const:`SOUND_MIXER_PCM` o :const:`SOUND_MIXER_SYNTH`). Esta máscara de bits indica un subconjunto de todos los controles de mezclador disponibles --- las constantes :const:`SOUND_MIXER_\*` definidas a nivel de módulo. Para determinar si, por ejemplo, el objeto mezclador actual admite un mezclador PCM, utilice el siguiente código Python::

source: For most purposes, the :const:`SOUND_MIXER_VOLUME` (master volume) and :const:`SOUND_MIXER_PCM` controls should suffice---but code that uses the mixer should be flexible when it comes to choosing mixer controls. On the Gravis Ultrasound, for example, :const:`SOUND_MIXER_VOLUME` does not exist.
es_co: Para la mayoría de los propósitos, los controles :const:`SOUND_MIXER_VOLUME` (volumen maestro) y :const:`SOUND_MIXER_PCM` deberían ser suficientes --- pero el código que usa el mezclador debe ser flexible cuando se trata de elegir los controles del mezclador. En el Ultrasonido Gravis, por ejemplo, :const:`SOUND_MIXER_VOLUME` no existe.

source: Returns a bitmask indicating stereo mixer controls. If a bit is set, the corresponding control is stereo; if it is unset, the control is either monophonic or not supported by the mixer (use in combination with :meth:`controls` to determine which).
es_co: Devuelve una máscara de bits que indica los controles del mezclador estéreo. Si se establece un bit, el control correspondiente es estéreo; si no está configurado, el control es monofónico o no es compatible con el mezclador (úselo en combinación con :meth:`controls` para determinar cuál).

source: See the code example for the :meth:`controls` function for an example of getting data from a bitmask.
es_co: Consulte el ejemplo de código de la función :meth:`controls` para ver un ejemplo de cómo obtener datos de una máscara de bits.

source: Returns a bitmask specifying the mixer controls that may be used to record. See the code example for :meth:`controls` for an example of reading from a bitmask.
es_co: Devuelve una máscara de bits que especifica los controles del mezclador que se pueden usar para grabar. Consulte el ejemplo de código de :meth:`controls` para ver un ejemplo de lectura desde una máscara de bits.

source: Returns the volume of a given mixer control. The returned volume is a 2-tuple ``(left_volume,right_volume)``. Volumes are specified as numbers from 0 (silent) to 100 (full volume). If the control is monophonic, a 2-tuple is still returned, but both volumes are the same.
es_co: Devuelve el volumen de un control de mezcla determinado. El volumen devuelto es una tupla de 2 ``(left_volume,right_volume)``. Los volúmenes se especifican como números del 0 (silencioso) al 100 (volumen completo). Si el control es monofónico, todavía se devuelve una tupla de 2, pero ambos volúmenes son iguales.
