Repository: python/python-docs-es
Catalog: library/ossaudiodev.po
Languages: es_co

source: Raises :exc:`OSSAudioError` if an invalid control is specified, or :exc:`OSError` if an unsupported control is specified.
es_co: Genera :exc:`OSSAudioError` si se especifica un control no válido, o :exc:`OSError` si se especifica un control no admitido.

source: Sets the volume for a given mixer control to ``(left,right)``. ``left`` and ``right`` must be ints and between 0 (silent) and 100 (full volume). On success, the new volume is returned as a 2-tuple. Note that this may not be exactly the same as the volume specified, because of the limited resolution of some soundcard's mixers.
es_co: Establece el volumen para un control de mezclador dado en ``(left,right)``. ``left`` y ``right`` deben ser enteros y estar entre 0 (silencio) y 100 (volumen completo). En caso de éxito, el nuevo volumen se devuelve como 2 tuplas. Tenga en cuenta que puede que no sea exactamente el mismo que el volumen especificado, debido a la resolución limitada de algunos mezcladores de tarjetas de sonido.

source: Raises :exc:`OSSAudioError` if an invalid mixer control was specified, or if the specified volumes were out-of-range.
es_co: Aumenta :exc:`OSSAudioError` si se especificó un control de mezcla no válido, o si los volúmenes especificados estaban fuera de rango.

source: This method returns a bitmask indicating which control(s) are currently being used as a recording source.
es_co: Este método devuelve una máscara de bits que indica qué control(es) se están utilizando actualmente como fuente de grabación.

source: Call this function to specify a recording source. Returns a bitmask indicating the new recording source (or sources) if successful; raises :exc:`OSError` if an invalid source was specified. To set the current recording source to the microphone input::
es_co: Llame a esta función para especificar una fuente de grabación. Devuelve una máscara de bits que indica la nueva fuente de grabación (o fuentes) si tiene éxito; plantea :exc:`OSError` si se especificó una fuente no válida. Para configurar la fuente de grabación actual a la entrada del micrófono::
