Repository: python/python-docs-es
Catalog: library/parser.po
Languages: es

source: :mod:`parser` --- Access Python parse trees
es: :mod:`parser` --- Acceder a árboles de análisis sintáctico de Python

source: The :mod:`parser` module provides an interface to Python's internal parser and byte-code compiler. The primary purpose for this interface is to allow Python code to edit the parse tree of a Python expression and create executable code from this. This is better than trying to parse and modify an arbitrary Python code fragment as a string because parsing is performed in a manner identical to the code forming the application. It is also faster.
es: El módulo :mod:`parser` proporciona una interfaz para el analizador sintáctico interno de Python y para el compilador de código de bytes. El propósito principal de esta interfaz es permitir que el código Python edite el árbol de análisis sintáctico de una expresión Python y cree código ejecutable a partir de este. Esto es mejor que intentar analizar y modificar una cadena de caracteres que conforma un fragmento de código Python arbitrario, porque el análisis se realiza de una manera idéntica al código que construye la aplicación. También es más rápido.

source: From Python 2.5 onward, it's much more convenient to cut in at the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
es: A partir de Python 2.5, es más práctico realizar estas operaciones entre la generación del árbol de sintaxis abstracta (AST) y la etapa de compilación, utilizando para ello el módulo :mod:`ast`.

source: There are a few things to note about this module which are important to making use of the data structures created. This is not a tutorial on editing the parse trees for Python code, but some examples of using the :mod:`parser` module are presented.
es: Hay algunas cosas a tener en cuenta sobre este módulo, que son importantes para hacer un uso correcto de las estructuras de datos creadas. Este no es un tutorial sobre cómo editar los árboles de análisis sintáctico para código Python, no obstante, sí que se proporcionan algunos ejemplos de uso del módulo :mod:`parser`.

source: Most importantly, a good understanding of the Python grammar processed by the internal parser is required. For full information on the language syntax, refer to :ref:`reference-index`. The parser itself is created from a grammar specification defined in the file :file:`Grammar/Grammar` in the standard Python distribution. The parse trees stored in the ST objects created by this module are the actual output from the internal parser when created by the :func:`expr` or :func:`suite` functions, described below. The ST objects created by :func:`sequence2st` faithfully simulate those structures. Be aware that the values of the sequences which are considered "correct" will vary from one version of Python to another as the formal grammar for the language is revised. However, transporting code from one Python version to another as source text will always allow correct parse trees to be created in the target version, with the only restriction being that migrating to an older version of the interpreter will not support more recent language constructs. The parse trees are not typically compatible from one version to another, though source code has usually been forward-compatible within a major release series.
es: Lo más importante es que se requiere una buena comprensión de la gramática de Python procesada por el analizador sintáctico interno. Para obtener información completa sobre la sintaxis del lenguaje, consulta :ref:`reference-index`. El analizador sintáctico en sí se crea a partir de una especificación gramatical definida en el archivo :file:`Grammar/Grammar` en la distribución estándar de Python. Los árboles de análisis sintáctico almacenados en los objetos ST creados por este módulo son la salida real del analizador interno cuando son creados por las funciones :func:`expr` o :func:`suite`, descritas a continuación. Los objetos ST creados por :func:`sequence2st` simulan fielmente esas estructuras. Ten en cuenta que los valores de las secuencias que se consideran "correctas" variarán de una versión de Python a otra, a medida que se revise la gramática formal del lenguaje. Por el contrario, portar código fuente en forma de texto de una versión de Python a otra siempre permitirá crear árboles de análisis correctos en la versión de destino, con la única restricción de la migración a una versión anterior del intérprete que no admita construcciones del lenguaje más recientes. Los árboles de análisis sintáctico no suelen ser compatibles de una versión a otra, aunque el código fuente suele ser compatible con versiones posteriores dentro de una misma serie de versiones principales.

source: Each element of the sequences returned by :func:`st2list` or :func:`st2tuple` has a simple form. Sequences representing non-terminal elements in the grammar always have a length greater than one. The first element is an integer which identifies a production in the grammar. These integers are given symbolic names in the C header file :file:`Include/graminit.h` and the Python module :mod:`symbol`. Each additional element of the sequence represents a component of the production as recognized in the input string: these are always sequences which have the same form as the parent. An important aspect of this structure which should be noted is that keywords used to identify the parent node type, such as the keyword :keyword:`if` in an :const:`if_stmt`, are included in the node tree without any special treatment. For example, the :keyword:`!if` keyword is represented by the tuple ``(1, 'if')``, where ``1`` is the numeric value associated with all :const:`NAME` tokens, including variable and function names defined by the user. In an alternate form returned when line number information is requested, the same token might be represented as ``(1, 'if', 12)``, where the ``12`` represents the line number at which the terminal symbol was found.
es: Cada elemento de las secuencias retornadas por :func:`st2list` o :func:`st2tuple` tiene una forma simple. Las secuencias que representan elementos no terminales en la gramática siempre tienen una longitud mayor que uno. El primer elemento es un número entero que identifica una regla de producción gramatical. Estos números enteros reciben nombres simbólicos en el archivo de cabecera :file:`Include/graminit.h` de C y en el módulo :mod:`symbol` de Python. Cada elemento adicional de la secuencia representa un componente de la producción tal como se reconoce en la cadena de entrada: siempre son secuencias que tienen la misma forma que la original. Un aspecto importante de esta estructura que debe tenerse en cuenta es que las palabras clave utilizadas para identificar el tipo de nodo principal, como la palabra clave :keyword:`if` en una :const:`if_stmt`, se incluyen en el árbol de nodos sin ningún tratamiento especial. Por ejemplo, la palabra clave :keyword:`!if` está representada por la tupla ``(1, 'if')``, donde ``1`` es el valor numérico asociado con todos los tokens :const:`NAME`, incluidos los nombres de variables y funciones definidos por el usuario. En una forma alternativa, que se retorna cuando se solicita información sobre el número de línea, el mismo token podría representarse como ``(1, 'if', 12)``, donde el ``12`` representa el número de línea en el que se encontró el símbolo terminal.

source: Terminal elements are represented in much the same way, but without any child elements and the addition of the source text which was identified. The example of the :keyword:`if` keyword above is representative. The various types of terminal symbols are defined in the C header file :file:`Include/token.h` and the Python module :mod:`token`.
es: Los elementos terminales se representan de la misma manera, pero sin ningún elemento secundario y sin la adición del texto fuente que se identificó. El anterior ejemplo de la palabra clave :keyword:`if` es representativo de esto. Los diversos tipos de símbolos terminales se definen en el archivo de cabecera :file:`Include/token.h` de C y en el módulo :mod:`token` de Python.

source: The ST objects are not required to support the functionality of this module, but are provided for three purposes: to allow an application to amortize the cost of processing complex parse trees, to provide a parse tree representation which conserves memory space when compared to the Python list or tuple representation, and to ease the creation of additional modules in C which manipulate parse trees. A simple "wrapper" class may be created in Python to hide the use of ST objects.
es: Los objetos ST no son necesarios para soportar la funcionalidad de este módulo, pero se proporcionan para tres propósitos: para permitir que una aplicación amortice el coste de procesar árboles de análisis sintáctico complejos, para proporcionar una representación en forma de árbol de análisis sintáctico que preserve espacio en memoria, en comparación con la representación una lista o tupla de Python, y para facilitar la creación de módulos adicionales en C que manipulen árboles de análisis sintáctico. Se puede crear una simple clase "contenedora" en Python para ocultar el uso de objetos ST.

source: The :mod:`parser` module defines functions for a few distinct purposes. The most important purposes are to create ST objects and to convert ST objects to other representations such as parse trees and compiled code objects, but there are also functions which serve to query the type of parse tree represented by an ST object.
es: El módulo :mod:`parser` define funciones para varios propósitos distintos. Los más importantes son crear objetos ST y convertir objetos ST en otras representaciones, como árboles de análisis sintáctico y objetos de código compilado. También existen funciones que sirven para consultar el tipo de árbol de análisis sintáctico representado por un objeto ST.

source: Module :mod:`symbol`
es: Módulo :mod:`symbol`

source: Useful constants representing internal nodes of the parse tree.
es: Constantes útiles que representan los nodos internos del árbol de análisis sintáctico.

source: Module :mod:`token`
es: Módulo :mod:`token`

source: Useful constants representing leaf nodes of the parse tree and functions for testing node values.
es: Constantes útiles que representan nodos hoja del árbol de análisis sintáctico y funciones para probar valores de nodos.

source: Creating ST Objects
es: Crear objetos ST

source: ST objects may be created from source code or from a parse tree. When creating an ST object from source, different functions are used to create the ``'eval'`` and ``'exec'`` forms.
es: Los objetos ST pueden crearse a partir del código fuente o de un árbol de análisis sintáctico. Al crear un objeto ST a partir del código fuente, se utilizan diferentes funciones para crear las formas ``'eval'`` y ``'exec'``.

source: The :func:`expr` function parses the parameter *source* as if it were an input to ``compile(source, 'file.py', 'eval')``. If the parse succeeds, an ST object is created to hold the internal parse tree representation, otherwise an appropriate exception is raised.
es: La función :func:`expr` analiza el parámetro *source* como si fuera una entrada para ``compile(source, 'file.py', 'eval')``. Si el análisis sintáctico tiene éxito, se crea un objeto ST para contener la representación del árbol de análisis sintáctico interno; de lo contrario, se lanza una excepción apropiada.

source: The :func:`suite` function parses the parameter *source* as if it were an input to ``compile(source, 'file.py', 'exec')``. If the parse succeeds, an ST object is created to hold the internal parse tree representation, otherwise an appropriate exception is raised.
es: La función :func:`suite` analiza el parámetro *source* como si fuera una entrada válida para ``compile(source, 'file.py', 'exec')``. Si el análisis sintáctico tiene éxito, se crea un objeto ST para contener la representación del árbol de análisis sintáctico interno; de lo contrario, se lanza una excepción apropiada.

source: This function accepts a parse tree represented as a sequence and builds an internal representation if possible. If it can validate that the tree conforms to the Python grammar and all nodes are valid node types in the host version of Python, an ST object is created from the internal representation and returned to the called. If there is a problem creating the internal representation, or if the tree cannot be validated, a :exc:`ParserError` exception is raised. An ST object created this way should not be assumed to compile correctly; normal exceptions raised by compilation may still be initiated when the ST object is passed to :func:`compilest`. This may indicate problems not related to syntax (such as a :exc:`MemoryError` exception), but may also be due to constructs such as the result of parsing ``del f(0)``, which escapes the Python parser but is checked by the bytecode compiler.
es: Esta función acepta un árbol de análisis sintáctico representado como una secuencia y construye una representación interna si es posible. Si puede validar que el árbol se ajusta a la gramática de Python y que todos los nodos son tipos de nodo válidos en la versión anfitriona de Python, se crea un objeto ST a partir de la representación interna y se retorna a quien la invocó. Si hay un problema creando la representación interna, o si el árbol no se puede validar, se lanza una excepción :exc:`ParserError`. No se debe dar por supuesto que un objeto ST creado de esta manera se compila correctamente; las excepciones normalmente generadas en el proceso de compilación aún pueden iniciarse cuando el objeto ST se pasa a :func:`compilest`. Esto puede indicar problemas no relacionados con la sintaxis (como una excepción :exc:`MemoryError`), pero también puede deberse a construcciones como el resultado de analizar ``del f(0)``, que escapa al analizador de Python pero es verificado por el compilador de código de bytes.

source: Sequences representing terminal tokens may be represented as either two-element lists of the form ``(1, 'name')`` or as three-element lists of the form ``(1, 'name', 56)``. If the third element is present, it is assumed to be a valid line number. The line number may be specified for any subset of the terminal symbols in the input tree.
es: Las secuencias que representan tokens terminales pueden representarse como listas de dos elementos de la forma ``(1, 'nombre')`` o como listas de tres elementos de la forma ``(1, 'nombre', 56)``. Si el tercer elemento está presente, se supone que es un número de línea válido. El número de línea puede especificarse para cualquier subconjunto de los símbolos terminales en el árbol de entrada.

source: This is the same function as :func:`sequence2st`. This entry point is maintained for backward compatibility.
es: Esta es la misma función que :func:`sequence2st`. Este punto de entrada se mantiene solo por compatibilidad con versiones anteriores.

source: Converting ST Objects
es: Convertir objetos ST

source: ST objects, regardless of the input used to create them, may be converted to parse trees represented as list- or tuple- trees, or may be compiled into executable code objects. Parse trees may be extracted with or without line numbering information.
es: Los objetos ST, independientemente de la entrada utilizada para crearlos, pueden convertirse en árboles de análisis sintáctico representados como árboles de listas o tuplas, o pueden compilarse en objetos de código ejecutable. Los árboles de análisis sintáctico se pueden extraer con o sin información de numeración de línea.

source: This function accepts an ST object from the caller in *st* and returns a Python list representing the equivalent parse tree. The resulting list representation can be used for inspection or the creation of a new parse tree in list form. This function does not fail so long as memory is available to build the list representation. If the parse tree will only be used for inspection, :func:`st2tuple` should be used instead to reduce memory consumption and fragmentation. When the list representation is required, this function is significantly faster than retrieving a tuple representation and converting that to nested lists.
es: Esta función acepta un objeto ST de quien la invoca mediante el argumento *st* y retorna una lista de Python que representa el árbol de análisis sintáctico equivalente. La representación de la lista resultante se puede utilizar para la inspección o la creación de un nuevo árbol de análisis sintáctico en forma de lista. Esta función no falla mientras haya memoria disponible para construir la representación de la lista. Si el árbol de análisis sintáctico sólo va a ser usado con fines de inspección, se debe usar :func:`st2tuple` en su lugar para reducir el consumo de memoria y la fragmentación. Cuando se requiere la representación en forma de lista, esta función es significativamente más rápida que recuperar una representación en forma de tupla y convertirla posteriormente en listas anidadas.

source: If *line_info* is true, line number information will be included for all terminal tokens as a third element of the list representing the token. Note that the line number provided specifies the line on which the token *ends*. This information is omitted if the flag is false or omitted.
es: Si *line_info* es verdadero, la información del número de línea se incluirá para todos los tokens terminales como un tercer elemento de la lista que representa el token. Ten en cuenta que el número de línea proporcionado especifica la línea en la que el token *termina*. Esta información se omite si el indicador es falso o se omite.

source: This function accepts an ST object from the caller in *st* and returns a Python tuple representing the equivalent parse tree. Other than returning a tuple instead of a list, this function is identical to :func:`st2list`.
es: Esta función acepta un objeto ST de quien la llama mediante el argumento *st* y retorna una tupla de Python que representa el árbol de análisis sintáctico equivalente. Aparte de retornar una tupla en lugar de una lista, esta función es idéntica a :func:`st2list`.

source: If *line_info* is true, line number information will be included for all terminal tokens as a third element of the list representing the token. This information is omitted if the flag is false or omitted.
es: Si *line_info* es verdadero, la información del número de línea se incluirá para todos los tokens terminales como un tercer elemento de la lista que representa el token. Esta información se omite si el indicador es falso o se omite.

source: The Python byte compiler can be invoked on an ST object to produce code objects which can be used as part of a call to the built-in :func:`exec` or :func:`eval` functions. This function provides the interface to the compiler, passing the internal parse tree from *st* to the parser, using the source file name specified by the *filename* parameter. The default value supplied for *filename* indicates that the source was an ST object.
es: El compilador de bytes de Python se puede invocar en un objeto ST para producir objetos de código que se pueden usar como parte de una llamada a las funciones incorporadas :func:`exec` o :func:`eval`. Esta función proporciona la interfaz para el compilador, pasando el árbol de análisis sintáctico interno de *st* al analizador sintáctico, utilizando el nombre del archivo fuente especificado por el parámetro *filename*. El valor predeterminado proporcionado para *filename* indica que la fuente era un objeto ST.

source: Compiling an ST object may result in exceptions related to compilation; an example would be a :exc:`SyntaxError` caused by the parse tree for ``del f(0)``: this statement is considered legal within the formal grammar for Python but is not a legal language construct. The :exc:`SyntaxError` raised for this condition is actually generated by the Python byte-compiler normally, which is why it can be raised at this point by the :mod:`parser` module. Most causes of compilation failure can be diagnosed programmatically by inspection of the parse tree.
es: La compilación de un objeto ST puede resultar en excepciones relacionadas con la compilación. Un ejemplo sería la excepción :exc:`SyntaxError` causada por el árbol de análisis sintáctico para ``del f(0)``: esta declaración se considera legal dentro de la gramática formal de Python pero no es una construcción del lenguaje legal. La excepción :exc:`SyntaxError` lanzada para esta condición es realmente generada por el compilador de bytes de Python, por lo que puede ser lanzada en este punto por el módulo :mod:`parser`. La mayoría de las causas de errores de compilación se pueden diagnosticar programáticamente mediante la inspección del árbol de análisis sintáctico.

source: Queries on ST Objects
es: Consultas en objetos ST

source: Two functions are provided which allow an application to determine if an ST was created as an expression or a suite. Neither of these functions can be used to determine if an ST was created from source code via :func:`expr` or :func:`suite` or from a parse tree via :func:`sequence2st`.
es: Se proporcionan dos funciones que permiten a una aplicación determinar si un ST se creó como una expresión o una suite. Ninguna de estas funciones se puede utilizar para determinar si un ST se creó a partir del código fuente a través de :func:`expr` o :func:`suite`, o desde un árbol de análisis mediante :func:`sequence2st`.

source: When *st* represents an ``'eval'`` form, this function returns ``True``, otherwise it returns ``False``. This is useful, since code objects normally cannot be queried for this information using existing built-in functions. Note that the code objects created by :func:`compilest` cannot be queried like this either, and are identical to those created by the built-in :func:`compile` function.
es: Esta función retorna ``True`` cuando *st* representa una forma ``'eval'`` y retorna ``False`` en caso contrario. Esto es útil, ya que los objetos de código normalmente no se pueden consultar para esta información utilizando las funciones incorporadas existentes. Ten en cuenta que los objetos de código creados por :func:`compilest` tampoco pueden consultarse así, además, son idénticos a los creados por la función incorporada :func:`compile`.

source: This function mirrors :func:`isexpr` in that it reports whether an ST object represents an ``'exec'`` form, commonly known as a "suite." It is not safe to assume that this function is equivalent to ``not isexpr(st)``, as additional syntactic fragments may be supported in the future.
es: Esta función es un espejo de :func:`isexpr`, en el sentido de que informa si un objeto ST representa una forma ``'exec'``, comúnmente conocida como "suite". No es seguro asumir que esta función es equivalente a ``not isexpr(st)``, ya que es posible que se admitan fragmentos sintácticos adicionales en el futuro.

source: Exceptions and Error Handling
es: Manejo de errores y excepciones

source: The parser module defines a single exception, but may also pass other built-in exceptions from other portions of the Python runtime environment. See each function for information about the exceptions it can raise.
es: El módulo parser define una única excepción, pero también puede lanzar otras excepciones incorporadas en otras partes del entorno de ejecución de Python. Consulta cada función para obtener información sobre las excepciones que puede generar.
