Repository: python/python-docs-es
Catalog: library/parser.po
Languages: es

source: Exception raised when a failure occurs within the parser module. This is generally produced for validation failures rather than the built-in :exc:`SyntaxError` raised during normal parsing. The exception argument is either a string describing the reason of the failure or a tuple containing a sequence causing the failure from a parse tree passed to :func:`sequence2st` and an explanatory string. Calls to :func:`sequence2st` need to be able to handle either type of exception, while calls to other functions in the module will only need to be aware of the simple string values.
es: Excepción lanzada cuando se produce un fallo dentro del módulo parser. Esto generalmente se produce ante fallos de validación, en lugar de la excepción incorporada :exc:`SyntaxError`, lanzada durante el análisis normal. El argumento de la excepción puede ser una cadena de caracteres que describa la razón del error, o también una tupla que contenga la secuencia causante del fallo en el árbol de análisis pasado a :func:`sequence2st` y una cadena explicativa. Las llamadas a :func:`sequence2st` deben poder manejar ambos tipos de excepciones, mientras que las llamadas a otras funciones en el módulo solo necesitarán tener en cuenta los valores de cadena simples.

source: Note that the functions :func:`compilest`, :func:`expr`, and :func:`suite` may raise exceptions which are normally raised by the parsing and compilation process. These include the built in exceptions :exc:`MemoryError`, :exc:`OverflowError`, :exc:`SyntaxError`, and :exc:`SystemError`. In these cases, these exceptions carry all the meaning normally associated with them. Refer to the descriptions of each function for detailed information.
es: Ten en cuenta que las funciones :func:`compilest`, :func:`expr` y :func:`suite` pueden lanzar excepciones que normalmente son generadas por el proceso de análisis y compilación. Estas incluyen las excepciones incorporadas :exc:`MemoryError`, :exc:`OverflowError`, :exc:`SyntaxError` y :exc:`SystemError`. En estos casos, estas excepciones tienen todo el significado que normalmente se asocia a ellas. Consulta las descripciones de cada función para obtener información detallada.

source: ST Objects
es: Objetos ST

source: Ordered and equality comparisons are supported between ST objects. Pickling of ST objects (using the :mod:`pickle` module) is also supported.
es: Se admiten comparaciones de orden y de igualdad entre objetos ST. También se admite la serialización de objetos ST (utilizando el módulo :mod:`pickle`).

source: The type of the objects returned by :func:`expr`, :func:`suite` and :func:`sequence2st`.
es: El tipo de los objetos retornados por :func:`expr`, :func:`suite` y :func:`sequence2st`.

source: ST objects have the following methods:
es: Los objetos ST tienen los siguientes métodos:

source: Same as ``compilest(st, filename)``.
es: Igual que ``compilest(st, filename)``.

source: Same as ``isexpr(st)``.
es: Igual que ``isexpr(st)``.

source: Same as ``issuite(st)``.
es: Igual que ``issuite(st)``.

source: Same as ``st2list(st, line_info, col_info)``.
es: Igual que ``st2list(st, line_info, col_info)``.

source: Same as ``st2tuple(st, line_info, col_info)``.
es: Igual que ``st2tuple(st, line_info, col_info)``.

source: Example: Emulation of :func:`compile`
es: Ejemplo: Emulación de :func:`compile`

source: While many useful operations may take place between parsing and bytecode generation, the simplest operation is to do nothing. For this purpose, using the :mod:`parser` module to produce an intermediate data structure is equivalent to the code ::
es: Si bien muchas operaciones útiles pueden tener lugar entre el análisis y la generación del códigos de bytes, la operación más simple es no hacer nada. Para este propósito, usar el módulo :mod:`parser` para producir una estructura de datos intermedia es equivalente al siguiente código::

source: The equivalent operation using the :mod:`parser` module is somewhat longer, and allows the intermediate internal parse tree to be retained as an ST object::
es: La operación equivalente usando el módulo :mod:`parser` es algo más larga y permite que el árbol de análisis sintáctico interno intermedio se conserve como un objeto ST::

source: An application which needs both ST and code objects can package this code into readily available functions::
es: Una aplicación que necesita tanto ST como objetos de código puede empaquetar este código en funciones fácilmente disponibles::
