Repository: python/python-docs-es
Catalog: library/pickle.po
Languages: es

source: :mod:`pickle` --- Python object serialization
es: :mod:`pickle` --- Serialización de objetos Python

source: **Source code:** :source:`Lib/pickle.py`
es: **Código fuente:** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
es: El modulo :mod:`pickle` implementa protocolos binarios para serializar y deserializar una estructura de objetos Python. *"Pickling"* es el proceso mediante el cual una jerarquía de objetos de Python se convierte en una secuencia de bytes, y el *"unpickling"* es la operación inversa, mediante la cual una secuencia de bytes de un archivo binario (:term:`binary file`) ó un objeto tipo binario (:term:`bytes-like object`) es convertido nuevamente en una jerarquía de objetos. `Pickling` (y `unpickling`) son alternativamente conocidos como "serialización", "ensamblaje," [#]_ o "aplanamiento"; sin embargo, para evitar confusiones, los términos utilizados aquí son "pickling" y "unpickling".

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
es: El modulo ``pickle`` **no es seguro**. Solo deserialize con `pickle` los datos en los que confía.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
es: Es posible construir datos maliciosos con `pickle` que **ejecuten código arbitrario durante el proceso de `unpickling`**. Nunca deserialize datos con `pickle` que podrían haber venido de una fuente no confiable, o que podrían haber sido manipulados.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
es: Considere firmar los datos con :mod:`hmac` si necesita asegurarse de que no hayan sido alterados.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
es: Los formatos de serialización más seguros como :mod:`json` pueden ser más apropiados si está procesando datos no confiables. Ver :ref:`comparison-with-json`.

source: Relationship to other Python modules
es: Relación con otros módulos de Python

source: Comparison with ``marshal``
es: Comparación con ``marshal``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
es: Python tiene un módulo de serialización más primitivo llamado :mod:`marshal`, pero en general :mod:`pickle` debería ser siempre la forma preferida de serializar objetos de Python. :mod:`marshal` existe principalmente para soportar archivos Python :file:`.pyc`.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
es: El modulo :mod:`pickle` difiere de :mod:`marshal` en varias formas significativas:

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
es: El modulo :mod:`pickle` realiza un seguimiento de los objetos que ya ha serializado, para que las referencias posteriores al mismo objeto no se serializen nuevamente. :mod:`marshal` no hace esto.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
es: Esto tiene implicaciones tanto para los objetos recursivos como para compartir objetos. Los objetos recursivos son objetos que contienen referencias a sí mismos. `Marshal` no los maneja y, de hecho, intentar agrupar objetos recursivos bloqueará su intérprete de Python. El intercambio de objetos ocurre cuando hay múltiples referencias al mismo objeto en diferentes lugares de la jerarquía de objetos que se serializan. :mod:`pickle` almacena dichos objetos solo una vez y garantiza que todas las demás referencias apunten a la copia maestra. Los objetos compartidos permanecen compartidos, lo cual puede ser muy importante para los objetos mutables.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
es: :mod:`marshal` no se puede usar para serializar clases definidas por el usuario y sus instancias. :mod:`pickle` puede guardar y restaurar instancias de clase de forma transparente, sin embargo, la definición de clase debe ser importable y vivir en el mismo módulo que cuando se almacenó el objeto.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
es: No se garantiza que el formato de serialización :mod:`marshal` sea portable a través de todas las versiones de Python. Debido a que su trabajo principal es dar soporte a archivos :file:`.pyc`, los implementadores de Python se reservan el derecho de cambiar el formato de serialización de formas no compatibles con versiones anteriores si surge la necesidad. El formato de serialización :mod:`pickle` está garantizado para ser compatible con versiones anteriores de Python siempre que se elija un protocolo de `pickle` compatible y el serializado y deserializado de código con `pickle` se encargue de lidiar con las diferencias de tipos entre Python 2 y Python 3 si sus datos están cruzando ese limite único entre las versiones del lenguaje.

source: Comparison with ``json``
es: Comparación con ``json``

source: There are fundamental differences between the pickle protocols and `JSON (JavaScript Object Notation) <http://json.org>`_:
es: Existen diferencias fundamentales entre los protocolos de `pickle` y `JSON (acrónimo de JavaScript Object Notation, «notación de objeto de JavaScript») <http://json.org>`_:

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
es: JSON es un formato de serialización de texto (genera texto unicode, aunque la mayoría de las veces se codifica a ``utf-8``), mientras que `pickle` es un formato de serialización binario;

source: JSON is human-readable, while pickle is not;
es: JSON es legible por humanos, mientras que `pickle` no lo es;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
es: JSON es interoperable y ampliamente utilizado fuera del ecosistema de Python, mientras que `pickle` es específico de Python;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
es: JSON, por defecto, solo puede representar un subconjunto de los tipos integrados de Python, y no clases personalizadas; `pickle` puede representar un número extremadamente grande de tipos de Python (muchos de ellos automáticamente, mediante el uso inteligente de la introspección de objetos en Python; los casos complejos se pueden abordar implementando API de objetos específicos, :ref:`specific object APIs <pickle-inst>`);

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
es: A diferencia de `pickle`, deserializar JSON no confiable no crea en sí mismo una vulnerabilidad de ejecución de código arbitraria.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
es: El modulo :mod:`json`: un módulo de la biblioteca estándar que permite la serialización y deserialización de JSON.

source: Data stream format
es: Formato de flujo de datos

source: The data format used by :mod:`pickle` is Python-specific. This has the advantage that there are no restrictions imposed by external standards such as JSON or XDR (which can't represent pointer sharing); however it means that non-Python programs may not be able to reconstruct pickled Python objects.
es: El formato de datos utilizado por :mod:`pickle` es específico de Python. Esto tiene la ventaja de que no hay restricciones impuestas por estándares externos como JSON o XDR (que no pueden representar el uso compartido de punteros); sin embargo, significa que los programas que no son de Python pueden no ser capaces de reconstruir objetos Python serialzados con `pickle`.

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
es: Por defecto, el formato de datos :mod:`pickle` utiliza una representación binaria relativamente compacta. Si necesita características de tamaño óptimas, puede eficientemente :doc:`comprimir <archiving>` datos serializados con `pickle`.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
es: El modulo :mod:`pickletools` contiene herramientas para analizar flujos de datos generados por :mod:`pickle`. El código fuente de :mod:`pickletools` tiene comentarios extensos sobre los códigos de operación utilizados por los protocolos de `pickle`.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
es: Actualmente hay 6 protocolos diferentes que se pueden utilizar para serializar con `pickle`. Cuanto mayor sea el protocolo utilizado, más reciente será la versión de Python necesaria para leer el `pickle` producido.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
es: La versión 0 del protocolo es el protocolo original "legible para humanos" y es compatible con versiones anteriores de Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
es: La versión 1 del protocolo es un formato binario antiguo que también es compatible con versiones anteriores de Python.

source: Protocol version 2 was introduced in Python 2.3. It provides much more efficient pickling of :term:`new-style class`\es. Refer to :pep:`307` for information about improvements brought by protocol 2.
es: La versión 2 del protocolo se introdujo en Python 2.3. Proporciona un serializado con `pickle` mucho más eficiente de clases de estilo nuevo (:term:`new-style class`). Consulte :pep:`307` para obtener información sobre las mejoras aportadas por el protocolo 2.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
es: Se agregó la versión 3 del protocolo en Python 3.0. Tiene soporte explícito para objetos :class:`bytes` y no puede ser deserializado con `pickle` por Python 2.x. Este era el protocolo predeterminado en Python 3.0--3.7.

source: Protocol version 4 was added in Python 3.4. It adds support for very large objects, pickling more kinds of objects, and some data format optimizations. It is the default protocol starting with Python 3.8. Refer to :pep:`3154` for information about improvements brought by protocol 4.
es: Se agregó la versión 4 del protocolo en Python 3.4. Agrega soporte para objetos muy grandes, `pickling` de mas tipos de objetos y algunas optimizaciones de formato de datos. Es el protocolo predeterminado que comienza con Python 3.8. Consulte :pep:`3154` para obtener información sobre las mejoras aportadas por el protocolo 4.

source: Protocol version 5 was added in Python 3.8. It adds support for out-of-band data and speedup for in-band data. Refer to :pep:`574` for information about improvements brought by protocol 5.
es: Se agregó la versión 5 del protocolo en Python 3.8. Agrega soporte para datos fuera de banda y aceleración para datos dentro de banda. Consulte :pep:`574` para obtener información sobre las mejoras aportadas por el protocolo 5.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
es: La serialización es una noción más primitiva que la persistencia; aunque :mod:`pickle` lee y escribe objetos de archivo, no maneja el problema de nombrar objetos persistentes, ni el problema (aún más complicado) de acceso concurrente a objetos persistentes. El módulo :mod:`pickle` puede transformar un objeto complejo en una secuencia de bytes y puede transformar la secuencia de bytes en un objeto con la misma estructura interna. Quizás lo más obvio que hacer con estos flujos de bytes es escribirlos en un archivo, pero también es concebible enviarlos a través de una red o almacenarlos en una base de datos. El módulo :mod:`shelve` proporciona una interfaz simple para serializar y deserializar objetos con `pickle` en archivos de bases de datos de estilo DBM.

source: Module Interface
es: Interfaz del módulo

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
es: Para serializar una jerarquía de objetos, simplemente llame a la función :func:`dumps`. De manera similar, para deserializar un flujo de datos, llama a la función :func:`loads`. Sin embargo, si desea tener más control sobre la serialización y la deserialización, puede crear un objeto :class:`Pickler` o :class:`Unpickler`, respectivamente.

source: The :mod:`pickle` module provides the following constants:
es: El módulo :mod:`pickle` proporciona las siguientes constantes:

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
es: Un entero, la versión de protocolo (:ref:`protocol version <pickle-protocols>`) más alta disponible. Este valor se puede pasar como un valor de *protocolo* a las funciones :func:`dump` y :func:`dumps` así como al constructor :class:`Pickler`.

source: An integer, the default :ref:`protocol version <pickle-protocols>` used for pickling. May be less than :data:`HIGHEST_PROTOCOL`. Currently the default protocol is 4, first introduced in Python 3.4 and incompatible with previous versions.
es: Un entero, la versión de protocolo (:ref:`protocol version <pickle-protocols>`) predeterminada utilizada para el serializado con `pickle`. Puede ser menor que :data:`HIGHEST_PROTOCOL`. Actualmente, el protocolo predeterminado es 4, introducido por primera vez en Python 3.4 e incompatible con versiones anteriores.

source: The default protocol is 3.
es: El protocolo predeterminado es 3.

source: The default protocol is 4.
es: El protocolo predeterminado es 4.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
es: El módulo :mod:`pickle` proporciona las siguientes funciones para que el proceso de `pickling` sea más conveniente:

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
es: Escribe la representación `pickle` del objeto *obj* en el *archivo* abierto :term:`file object`. Esto es equivalente a ``Pickler(file, protocol).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
es: Los argumentos *file*, *protocol*, *fix_imports* y *buffer_callback* tienen el mismo significado que en el constructor :class:`Pickler`.

source: The *buffer_callback* argument was added.
es: Se agregó el argumento *buffer_callback*.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
es: Devuelva la representación `pickle` del objeto *obj* como un objeto :class:`bytes`, en lugar de escribirlo en un archivo.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
es: Los argumentos *protocol*, *fix_imports* y *buffer_callback* tienen el mismo significado que en el constructor :class:`Pickler`.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
es: Lee la representación `pickle` de un objeto desde un *archivo* abierto :term:`file object` y devuelva la jerarquía de objetos reconstituidos especificada en el mismo. Esto es equivalente a ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
es: La versión de protocolo del `pickle` se detecta automáticamente, por lo que no se necesita ningún argumento de protocolo. Los bytes más allá de la representación empaquetada son ignorados.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
es: Los argumentos *file*, *fix_imports*, *encoding*, *errors*, *strict* y *buffers* tienen el mismo significado que en el constructor :class:`Unpickler`.

source: The *buffers* argument was added.
es: Se agregó el argumento *buffers*.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
es: Devuelve la jerarquía de objetos reconstruida de la representación `pickle` *data* de un objeto. *data* debe ser un objeto tipo binario (:term:`bytes-like object`).

source: The :mod:`pickle` module defines three exceptions:
es: El módulo :mod:`pickle` define tres excepciones:

source: Common base class for the other pickling exceptions. It inherits :exc:`Exception`.
es: Clase base común para las otras excepciones de `pickling`. Hereda de :exc:`Exception`.

source: Error raised when an unpicklable object is encountered by :class:`Pickler`. It inherits :exc:`PickleError`.
es: Error generado cuando :class:`Pickler` encuentra un objeto que no se puede serializar con `pickle` . Hereda de :exc:`PickleError`.

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
es: Consulte :ref:`pickle-picklable` para aprender qué tipos de objetos se pueden serializar con `pickle`.

source: Error raised when there is a problem unpickling an object, such as a data corruption or a security violation. It inherits :exc:`PickleError`.
es: Se produce un error cuando hay un problema al deserializar un objeto con `pickle`, por ejemplo como una corrupción de datos o una violación de seguridad. Hereda de :exc:`PickleError`.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
es: Tenga en cuenta que también se pueden generar otras excepciones durante la deserializacion con `pickle`, incluyendo (pero no necesariamente limitado a) `AttributeError`, `EOFError`, `ImportError`, e `IndexError`.

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
es: El módulo :mod:`pickle` exporta tres clases, :class:`Pickler`, :class:`Unpickler` y :class:`PickleBuffer`:

source: This takes a binary file for writing a pickle data stream.
es: Esto toma un archivo binario para escribir un flujo de datos de `pickle`.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
es: El argumento opcional *protocol* , un entero, le dice al `pickler` que use el protocolo dado; los protocolos admitidos son 0 para :data:`HIGHEST_PROTOCOL`. Si no se especifica, el valor predeterminado es :data:`DEFAULT_PROTOCOL`. Si se especifica un número negativo, :data:`HIGHEST_PROTOCOL` es seleccionado.

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
es: El argumento *file* debe tener un método *write()* que acepte un argumento de bytes individuales. Por lo tanto, puede ser un archivo en disco abierto para escritura binaria, una instancia :class:`io.BytesIO` , o cualquier otro objeto personalizado que cumpla con esta interfaz.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
es: Si *fix_imports* es verdadero y *protocol* es menor que 3, `pickle` intentará asignar los nuevos nombres de Python 3 a los nombres de módulos antiguos utilizados en Python 2, de modo que la secuencia de datos de `pickle` sea legible con Python 2.
