Repository: python/python-docs-es
Catalog: library/pickle.po
Languages: es

source: If *buffer_callback* is None (the default), buffer views are serialized into *file* as part of the pickle stream.
es: Si *buffer_callback* es None (el valor predeterminado), las vistas de búfer se serializan en *file* como parte de la secuencia de `pickle`.

source: If *buffer_callback* is not None, then it can be called any number of times with a buffer view. If the callback returns a false value (such as None), the given buffer is :ref:`out-of-band <pickle-oob>`; otherwise the buffer is serialized in-band, i.e. inside the pickle stream.
es: Si *buffer_callback* no es None, entonces se puede llamar cualquier número de veces con una vista de búfer. Si la `callback` devuelve un valor falso (como None), el búfer dado está fuera de banda (:ref:`out-of-band <pickle-oob>`); de lo contrario, el búfer se serializa en banda, es decir, dentro del flujo de `pickle`.

source: It is an error if *buffer_callback* is not None and *protocol* is None or smaller than 5.
es: Es un error si *buffer_callback* no es None y *protocol* es None o menor que 5.

source: Write the pickled representation of *obj* to the open file object given in the constructor.
es: Escribe la representación serializada con `pickle` del objeto *obj* en el objeto archivo abierto dado en el constructor.

source: Do nothing by default. This exists so a subclass can override it.
es: No hacer nada por defecto. Esto existe para que una subclase pueda sobreescribirlo.

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
es: Si :meth:`persistent_id` devuelve ``None``, *obj* es serializado con `pickle` como siempre. Cualquier otro valor hace que :class:`Pickler` emita el valor devuelto como un ID persistente para *obj*. El significado de este ID persistente debe definirse por :meth:`Unpickler.persistent_load`. Tenga en cuenta que el valor devuelto por :meth:`persistent_id` no puede tener una ID persistente.

source: See :ref:`pickle-persistent` for details and examples of uses.
es: Ver :ref:`pickle-persistent` para detalles y ejemplos de uso.

source: A pickler object's dispatch table is a registry of *reduction functions* of the kind which can be declared using :func:`copyreg.pickle`. It is a mapping whose keys are classes and whose values are reduction functions. A reduction function takes a single argument of the associated class and should conform to the same interface as a :meth:`__reduce__` method.
es: La tabla de envío de un objeto `Pickler` es un registro de *funciones de reducción* del tipo que se puede declarar usando :func:`copyreg.pickle`. Es un mapeo cuyas claves son clases y cuyos valores son funciones de reducción. Una función de reducción toma un solo argumento de la clase asociada y debe ajustarse a la misma interfaz que un método :meth:`__reduce__`.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
es: Por defecto, un objeto de `pickle` no tendrá un atributo :attr:`dispatch_table`, y en su lugar utilizará la tabla de despacho global administrada por el módulo :mod:`copyreg`. Sin embargo, para personalizar el `pickling` para un objeto de `pickle` específico, se puede establecer el atributo :attr:`dispatch_table` en un objeto tipo dict. Alternativamente, si una subclase de :class:`Pickler` tiene un atributo :attr:`dispatch_table` esto se usará como la tabla de despacho predeterminada para instancias de esa clase.

source: See :ref:`pickle-dispatch` for usage examples.
es: Ver :ref:`pickle-dispatch` para ejemplos de uso.

source: Special reducer that can be defined in :class:`Pickler` subclasses. This method has priority over any reducer in the :attr:`dispatch_table`. It should conform to the same interface as a :meth:`__reduce__` method, and can optionally return ``NotImplemented`` to fallback on :attr:`dispatch_table`-registered reducers to pickle ``obj``.
es: Reductor especial que se puede definir en subclases de :class:`Pickler`. Este método tiene prioridad sobre cualquier reductor en :attr:`dispatch_table`. Debe cumplir con la misma interfaz que un método :meth:`__reduce__`, y opcionalmente puede devolver ``NotImplemented`` para recurrir a reductores registrados en :attr:`dispatch_table` el objeto `pickle` ``obj``.

source: For a detailed example, see :ref:`reducer_override`.
es: Para un ejemplo detallado, ver :ref:`reducer_override`.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
es: Obsoleto. Habilite el modo rápido si se establece en un valor verdadero. El modo rápido deshabilita el uso de memo, por lo tanto, acelera el proceso de `pickling` al no generar códigos de operación PUT superfluos. No debe usarse con objetos autorreferenciales; de lo contrario, la clase :class:`Pickler` se repetirá infinitamente.

source: Use :func:`pickletools.optimize` if you need more compact pickles.
es: Use :func:`pickletools.optimize` si necesita `pickles` más compactos.

source: This takes a binary file for reading a pickle data stream.
es: Esto toma un archivo binario para leer un flujo de datos de `pickle`.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
es: La versión de protocolo de `pickle` se detecta automáticamente, por lo que no se necesita ningún argumento de protocolo.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
es: El argumento *file* debe tener tres métodos, un método read() que toma un argumento entero, un método `readinto()` que toma un argumento búfer y un método `readline()` que no requiere argumentos, como en la interfaz :class:`io.BufferedIOBase`. Por lo tanto *file* puede ser un archivo en disco abierto para lectura binaria, un objeto :class:`io.BytesIO`, o cualquier otro objeto personalizado que cumpla con esta interfaz.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
es: Los argumentos opcionales *fix_imports*, *encoding* and *errors* se utilizan para controlar el soporte de compatibilidad para el flujo de `pickle` generado por Python 2. Si *fix_imports* es verdadero, `pickle` intentará asignar los nombres antiguos de Python 2 a los nuevos nombres utilizados en Python 3. Tanto *encoding* como *errors* le indican a `pickle` cómo decodificar instancias de cadenas de 8 bits seleccionadas por Python 2; estos son predeterminados a 'ASCII' y 'strict', respectivamente. *encoding* puede ser 'bytes' para leer estas instancias de cadena de 8 bits como objetos de bytes. Se requiere el uso de ``encoding='latin1'`` para realizar el `unpickling` de arreglos de NumPy e instancias de :class:`~datetime.datetime`, :class:`~datetime.date` y :class:`~datetime.time` serializados con `pickle` por Python 2.

source: If *buffers* is None (the default), then all data necessary for deserialization must be contained in the pickle stream. This means that the *buffer_callback* argument was None when a :class:`Pickler` was instantiated (or when :func:`dump` or :func:`dumps` was called).
es: Si *buffers* es None (el valor predeterminado), todos los datos necesarios para la deserialización deben estar contenidos en el flujo de `pickle`. Esto significa que el argumento *buffer_callback* era None cuando se instanciaba una clase :class:`Pickler` (o cuando se llamaba a :func:`dump` o :func:`dumps`).

source: If *buffers* is not None, it should be an iterable of buffer-enabled objects that is consumed each time the pickle stream references an :ref:`out-of-band <pickle-oob>` buffer view. Such buffers have been given in order to the *buffer_callback* of a Pickler object.
es: Si *buffers* no es None, debería ser un iterable de objetos habilitados para almacenamiento intermedio que se consumen cada vez que el flujo de `pickle` hace referencia a una vista de buffer fuera de banda (:ref:`out-of-band <pickle-oob>`). Tales buffers se han dado para el *buffer_callback* de un objeto `Pickler`.

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
es: Lee la representación serializada con `pickle` de un objeto desde el objeto de archivo abierto dado en el constructor, y devuelva la jerarquía de objetos reconstituidos especificada allí. Los Bytes más allá de la representación serializada con `pickle` del objeto se ignoran.

source: Raise an :exc:`UnpicklingError` by default.
es: Lanza un :exc:`UnpicklingError` de forma predeterminada.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
es: Si se define, :meth:`persistent_load` debería devolver el objeto especificado por el ID persistente *pid*. Si se encuentra un ID persistente no válido, se debe lanzar un :exc:`UnpicklingError`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
es: Importa *module* si es necesario y devuelve el objeto llamado *name* desde el, donde los argumentos *module* y *name* son objetos de :class:`str`. Tenga en cuenta que, a diferencia de lo que sugiere su nombre, :meth:`find_class` también se usa para buscar funciones.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
es: Las subclases pueden sobreescribir esto para obtener control sobre qué tipo de objetos y cómo se pueden cargar, reduciendo potencialmente los riesgos de seguridad. Consulte :ref:`pickle-restrict` para obtener más detalles.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
es: Lanza un :ref:`auditing event <auditing>` ``pickle.find_class`` con argumentos ``module``, ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
es: Un envoltorio (`wrapper`) para un búfer que representa datos serializables con `pickle` (`picklable data`). *buffer* debe ser un objeto que proporciona un búfer (:ref:`buffer-providing <bufferobjects>`), como objeto tipo binario (:term:`bytes-like object`) o un arreglo N-dimensional.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
es: :class:`PickleBuffer` es en sí mismo un proveedor de búfer, por lo que es posible pasarlo a otras API que esperan un objeto que provea un búfer, como :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
es: Los objetos :class:`PickleBuffer` solo se pueden serializar usando el protocolo `pickle` 5 o superior. Son elegibles para serialización fuera de banda (:ref:`out-of-band serialization <pickle-oob>`).

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
es: Devuelve un :class:`memoryview` del área de memoria subyacente a este búfer. El objeto devuelto es una vista de memoria unidimensional, C-contigua con formato ``B`` (bytes sin firmar). :exc:`BufferError` es lanzado si el búfer no es contiguo a C ni a Fortran.

source: Release the underlying buffer exposed by the PickleBuffer object.
es: Libera el búfer subyacente expuesto por el objeto PickleBuffer.

source: What can be pickled and unpickled?
es: ¿Qué se puede serializar (pickled) y deserializar (unpickled) con `pickle`?

source: The following types can be pickled:
es: Los siguientes tipos se pueden serializar con `pickle` (pickled):

source: ``None``, ``True``, and ``False``
es: ``None``, ``True``, y ``False``

source: integers, floating point numbers, complex numbers
es: enteros, números de coma flotante, números complejos

source: strings, bytes, bytearrays
es: cadenas, bytes, bytearrays

source: tuples, lists, sets, and dictionaries containing only picklable objects
es: tuplas, listas, conjuntos y diccionarios que contiene solo objetos serializables con `pickle`

source: functions defined at the top level of a module (using :keyword:`def`, not :keyword:`lambda`)
es: funciones definidas en el nivel superior de un módulo (usando :keyword:`def`, no :keyword:`lambda`)

source: built-in functions defined at the top level of a module
es: funciones integradas definidas en el nivel superior de un módulo

source: classes that are defined at the top level of a module
es: clases que se definen en el nivel superior de un módulo

source: instances of such classes whose :attr:`~object.__dict__` or the result of calling :meth:`__getstate__` is picklable (see section :ref:`pickle-inst` for details).
es: instancias de tales clases cuyo :attr:`~object.__dict__` o el resultado de llamar a :meth:`__getstate__` es serializable con `pickle` (picklable) (consulte la sección :ref:`pickle-inst` para obtener más detalles).

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
es: Los intentos de serializar objetos no serializables con `pickle` lanzaran la excepción :exc:`PicklingError`; cuando esto sucede, es posible que ya se haya escrito una cantidad no especificada de bytes en el archivo subyacente. Intentar serializar con `pickle` una estructura de datos altamente recursiva puede exceder la profundidad máxima de recursividad, en este caso se lanzará un :exc:`RecursionError`. Puede aumentar cuidadosamente este límite con :func:`sys.setrecursionlimit`.

source: Note that functions (built-in and user-defined) are pickled by "fully qualified" name reference, not by value. [#]_ This means that only the function name is pickled, along with the name of the module the function is defined in. Neither the function's code, nor any of its function attributes are pickled. Thus the defining module must be importable in the unpickling environment, and the module must contain the named object, otherwise an exception will be raised. [#]_
es: Tenga en cuenta que las funciones (integradas y definidas por el usuario) se serializan con `pickle` por referencia de nombre "totalmente calificado", no por valor. [#]_ Esto significa que solo se serializa con `pickle` el nombre de la función, junto con el nombre del módulo en el que está definida la función. Ni el código de la función, ni ninguno de sus atributos de función se serializa. Por lo tanto, el módulo de definición debe ser importable en el entorno donde se hará el `unpickling`, y el módulo debe contener el objeto nombrado; de lo contrario, se lanzará una excepción. [#]_

source: Similarly, classes are pickled by named reference, so the same restrictions in the unpickling environment apply. Note that none of the class's code or data is pickled, so in the following example the class attribute ``attr`` is not restored in the unpickling environment::
es: De manera similar, las clases se serializan con `pickle` por referencia con nombre, por lo que se aplican las mismas restricciones en el entorno donde se hará el `unpickling`. Tenga en cuenta que ninguno de los datos o el código de la clase son serializados con `pickle`, por lo que en el siguiente ejemplo el atributo de clase ``attr`` no se restaura en el entorno donde se hará el `unpickling`::

source: These restrictions are why picklable functions and classes must be defined in the top level of a module.
es: Estas restricciones son la razón por la que las funciones y clases serializables con `pickle` deben definirse en el nivel superior de un módulo.

source: Similarly, when class instances are pickled, their class's code and data are not pickled along with them. Only the instance data are pickled. This is done on purpose, so you can fix bugs in a class or add methods to the class and still load objects that were created with an earlier version of the class. If you plan to have long-lived objects that will see many versions of a class, it may be worthwhile to put a version number in the objects so that suitable conversions can be made by the class's :meth:`__setstate__` method.
es: De manera similar, cuando las instancias de clases son serializadas con `pickle`, el código y los datos de la clase no son serializadas junto con ella. Solo los datos de la instancia son serializados con `pickle` (`pickled`). Esto se hace a propósito, por lo que puede corregir errores en una clase o agregar métodos a la clase y aún cargar objetos que fueron creados con una versión anterior de la clase. Si planea tener objetos de larga duración que verán muchas versiones de una clase, puede valer la pena poner un número de versión en los objetos para que las conversiones adecuadas se puedan realizar mediante el método :meth:`__setstate__`.

source: Pickling Class Instances
es: `Pickling` de Instancias de clases

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
es: En esta sección, describimos los mecanismos generales disponibles para que usted defina, personalice y controle cómo se serializan y deserializan con `Pickle` las instancias de clase.

source: In most cases, no additional code is needed to make instances picklable. By default, pickle will retrieve the class and the attributes of an instance via introspection. When a class instance is unpickled, its :meth:`__init__` method is usually *not* invoked. The default behaviour first creates an uninitialized instance and then restores the saved attributes. The following code shows an implementation of this behaviour::
es: En la mayoría de los casos, no se necesita código adicional para hacer que las instancias sean `picklable` (serializables con `pickle`). Por defecto, `pickle` recuperará la clase y los atributos de una instancia a través de la introspección. Cuando una instancia de clase es deserializada con `pickle` (`unpickled`), su método :meth:`__init__` generalmente *no* se invoca. El comportamiento predeterminado es que primero crea una instancia no inicializada y luego restaura los atributos guardados. El siguiente código muestra una implementación de este comportamiento::

source: Classes can alter the default behaviour by providing one or several special methods:
es: Las clases pueden alterar el comportamiento predeterminado proporcionando uno o varios métodos especiales:

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
es: En los protocolos 2 y más recientes, las clases que implementan el método :meth:`__getnewargs_ex__` pueden dictar los valores pasados al método :meth:`__new__` al hacer`unpickling`. El método debe devolver un par ``(args, kwargs)`` donde *args* es una tupla de argumentos posicionales y *kwargs* un diccionario de argumentos con nombre para construir el objeto. Estos se pasarán al método :meth:`__new__` al hacer `unpickling`.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
es: Debes implementar este método si el método :meth:`__new__` de tu clase requiere argumentos de solo palabras clave. De lo contrario, se recomienda para la compatibilidad implementar :meth:`__getnewargs__`.

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
es: :meth:`__getnewargs_ex__` ahora se usa en los protocolos 2 y 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
es: Este método tiene un propósito similar a :meth:`__getnewargs_ex__`, pero solo admite argumentos posicionales. Debe devolver una tupla de argumentos ``args`` que se pasarán al método :meth:`__new__` al hacer `unpickling`.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
es: :meth:`__getnewargs__` no se llamará si :meth:`__getnewargs_ex__` está definido.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
es: Antes de Python 3.6, se llamaba a, :meth:`__getnewargs__` en lugar de :meth:`__getnewargs_ex__` en los protocolos 2 y 3.
