Repository: python/python-docs-es
Catalog: library/pickle.po
Languages: es

source: Classes can further influence how their instances are pickled; if the class defines the method :meth:`__getstate__`, it is called and the returned object is pickled as the contents for the instance, instead of the contents of the instance's dictionary. If the :meth:`__getstate__` method is absent, the instance's :attr:`~object.__dict__` is pickled as usual.
es: Las clases pueden influir aún más en cómo sus instancias se serializan con `pickle`; si la clase define el método :meth:`__getstate__`, este es llamado y el objeto devuelto se selecciona como contenido de la instancia, en lugar del contenido del diccionario de la instancia. Si el método :meth:`__getstate__` está ausente, el :attr:`~object.__dict__` de la instancia se conserva como de costumbre.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
es: Al hacer `unpickling`, si la clase define :meth:`__setstate__`, este es llamado con el estado `unpickled` (no serializado con `pickle`). En ese caso, no es necesario que el objeto de estado sea un diccionario. De lo contrario, el estado `pickled` (`pickled state`) debe ser un diccionario y sus elementos se asignan al diccionario de la nueva instancia.

source: If :meth:`__getstate__` returns a false value, the :meth:`__setstate__` method will not be called upon unpickling.
es: Si :meth:`__getstate__` devuelve un valor falso, el método :meth:`__setstate__` no se llamará al hacer `unpickling`.

source: Refer to the section :ref:`pickle-state` for more information about how to use the methods :meth:`__getstate__` and :meth:`__setstate__`.
es: Consulte la sección :ref:`pickle-state` para obtener más información sobre cómo utilizar los métodos :meth:`__getstate__` y :meth:`__setstate__`.

source: At unpickling time, some methods like :meth:`__getattr__`, :meth:`__getattribute__`, or :meth:`__setattr__` may be called upon the instance. In case those methods rely on some internal invariant being true, the type should implement :meth:`__new__` to establish such an invariant, as :meth:`__init__` is not called when unpickling an instance.
es: Al momento de hacer `unpickling`, algunos métodos como :meth:`__getattr__`, :meth:`__getattribute__`, o :meth:`__setattr__` pueden invocarse sobre la instancia. En caso de que esos métodos dependan de que algún invariante interno sea verdadero, el tipo debería implementar :meth:`__new__` para establecer tal invariante, ya que :meth:`__init__` no se llama cuando se hace `unpickling` de una instancia.

source: As we shall see, pickle does not use directly the methods described above. In fact, these methods are part of the copy protocol which implements the :meth:`__reduce__` special method. The copy protocol provides a unified interface for retrieving the data necessary for pickling and copying objects. [#]_
es: Como veremos, `pickle` no utiliza directamente los métodos descritos anteriormente. De hecho, estos métodos son parte del protocolo de copia que implementa el método especial :meth:`__reduce__`. El protocolo de copia proporciona una interfaz unificada para recuperar los datos necesarios para hacer el `pickling` y la copia de objetos. [#]_

source: Although powerful, implementing :meth:`__reduce__` directly in your classes is error prone. For this reason, class designers should use the high-level interface (i.e., :meth:`__getnewargs_ex__`, :meth:`__getstate__` and :meth:`__setstate__`) whenever possible. We will show, however, cases where using :meth:`__reduce__` is the only option or leads to more efficient pickling or both.
es: Aunque es poderoso, implementar :meth:`__reduce__` directamente en sus clases es propenso a errores. Por esta razón, los diseñadores de clases deben usar la interfaz de alto nivel (es decir, :meth:`__getnewargs_ex__`, :meth:`__getstate__` y :meth:`__setstate__`) siempre que sea posible. Sin embargo, mostraremos casos en los que usar :meth:`__reduce__` es la única opción o conduce a un `pickling` más eficiente o ambos.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
es: La interfaz se define actualmente de la siguiente manera. El método :meth:`__reduce__` no toma ningún argumento y devolverá una cadena o preferiblemente una tupla (el objeto devuelto a menudo se denomina "valor reducido").

source: If a string is returned, the string should be interpreted as the name of a global variable. It should be the object's local name relative to its module; the pickle module searches the module namespace to determine the object's module. This behaviour is typically useful for singletons.
es: Si se devuelve una cadena, la cadena debe interpretarse como el nombre de una variable global. Debe ser el nombre local del objeto relativo a su módulo; el módulo `pickle` busca en el espacio de nombres del módulo para determinar el módulo del objeto. Este comportamiento suele ser útil para singletons.

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
es: Cuando se devuelve una tupla, debe tener entre dos y seis elementos. Los elementos opcionales se pueden omitir o se puede proporcionar ``None`` como su valor. La semántica de cada elemento está en orden:

source: A callable object that will be called to create the initial version of the object.
es: Un objeto invocable que se llamará para crear la versión inicial del objeto.

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
es: Una tupla de argumentos para el objeto invocable. Se debe proporcionar una tupla vacía si el invocable no acepta ningún argumento.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
es: Opcionalmente, el estado del objeto, que se pasará al método :meth:`__setstate__` del objeto como se describió anteriormente. Si el objeto no tiene dicho método, el valor debe ser un diccionario y se agregará al atributo :attr:`~object.__dict__` del objeto.

source: Optionally, an iterator (and not a sequence) yielding successive items. These items will be appended to the object either using ``obj.append(item)`` or, in batch, using ``obj.extend(list_of_items)``. This is primarily used for list subclasses, but may be used by other classes as long as they have :meth:`append` and :meth:`extend` methods with the appropriate signature. (Whether :meth:`append` or :meth:`extend` is used depends on which pickle protocol version is used as well as the number of items to append, so both must be supported.)
es: Opcionalmente, un iterador (y no una secuencia) produce elementos sucesivos. Estos elementos se agregarán al objeto usando ``obj.append(item)`` o, por lotes, usando ``obj.extend(list_of_items)``. Esto se usa principalmente para subclases de lista, pero puede ser usado por otras clases siempre que tengan los métodos :meth:`append` y :meth:`extend` con la firma apropiada. (El uso de :meth:`append` o :meth:`extend` depende de la versión del protocolo `pickle` que se use, así como de la cantidad de elementos que se agregarán, por lo que ambos deben ser soportados.)

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
es: Opcionalmente, un iterador (no una secuencia) que produce pares clave-valor sucesivos. Estos elementos se almacenarán en el objeto usando ``obj[key] = value``. Esto se usa principalmente para subclases de diccionario, pero otras clases pueden usarlo siempre que implementen :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
es: Opcionalmente, un invocable con una firma ``(obj, state)``. Este invocable permite al usuario controlar programáticamente el comportamiento de actualización de estado de un objeto específico, en lugar de usar el método estático de ``obj`` :meth:`__setstate__`. Si no es ``None``, este invocable tendrá prioridad sobre ``obj``'s :meth:`__setstate__`.

source: The optional sixth tuple item, ``(obj, state)``, was added.
es: Se agregó el sexto elemento opcional de tupla ``(obj, state)``.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
es: Alternativamente, se puede definir un método :meth:`__reduce_ex__`. La única diferencia es que este método debe tomar un único argumento entero, la versión del protocolo. Cuando esté definido, `pickle` lo preferirá en lugar del método :meth:`__reduce__`. Además, :meth:`__reduce__` se convierte automáticamente en sinónimo de la versión extendida. El uso principal de este método es proporcionar valores reducidos compatibles con versiones anteriores para versiones anteriores de Python.

source: Persistence of External Objects
es: Persistencia de objetos externos

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
es: Para el beneficio de la persistencia del objeto, el módulo :mod:`pickle` admite la noción de una referencia a un objeto fuera del flujo de datos serializados con `pickle`. Dichos objetos son referenciados por un ID persistente, que debe ser una cadena de caracteres alfanuméricos (para el protocolo 0) [#]_ o simplemente un objeto arbitrario (para cualquier protocolo más nuevo).

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
es: La resolución de tales ID persistentes no está definida por el módulo :mod:`pickle`; delegará esta resolución a los métodos definidos por el usuario en el `pickler` y el `unpickler`, :meth:`~Pickler.persistent_id` y :meth:`~Unpickler.persistent_load` respectivamente.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
es: Para seleccionar objetos que tienen una ID persistente externo, el `pickler` debe tener un método personalizado :meth:`~Pickler.persistent_id` que toma un objeto como argumento y devuelve ``None`` o el ID persistente para ese objeto. Cuando se devuelve ``None``, el `pickler` simplemente serializará el objeto de forma normal. Cuando se devuelve una cadena de identificación persistente, el `pickler` serializará ese objeto, junto con un marcador para que el `unpickler` lo reconozca como una identificación persistente.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
es: Para hacer el `unpickling` objetos externos, el `unpickler` debe tener un método personalizado :meth:`~Unpickler.persistent_load` que toma un objeto de identificación persistente y devuelve el objeto referenciado.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
es: Aquí hay un ejemplo completo que presenta cómo se puede usar la identificación persistente para hacer el `pickling` objetos externos por referencia.

source: Dispatch Tables
es: Tablas de despacho

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
es: Si se desea personalizar el `pickling` de algunas clases sin alterar ningún otro código que dependa del `pickling`, se puede crear un `pickler` con una tabla de despacho privada.

source: The global dispatch table managed by the :mod:`copyreg` module is available as :data:`copyreg.dispatch_table`. Therefore, one may choose to use a modified copy of :data:`copyreg.dispatch_table` as a private dispatch table.
es: La tabla de despacho global administrada por el módulo :mod:`copyreg` está disponible como :data:`copyreg.dispatch_table`. Por lo tanto, se puede optar por utilizar una copia modificada de :data:`copyreg.dispatch_table` como tabla de envío privada.

source: For example ::
es: Por ejemplo ::

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
es: crea una instancia de :class:`pickle.Pickler` con una tabla de despacho privada que maneja la clase ``AlgunaClase`` especialmente. Alternativamente, el código ::

source: does the same, but all instances of ``MyPickler`` will by default share the same dispatch table. The equivalent code using the :mod:`copyreg` module is ::
es: hace lo mismo, pero todas las instancias de ``MiPickler`` compartirán por defecto la misma tabla de despacho. El código equivalente que usa el módulo :mod:`copyreg` es ::

source: Handling Stateful Objects
es: Manejo de objetos con estado

source: Here's an example that shows how to modify pickling behavior for a class. The :class:`TextReader` class opens a text file, and returns the line number and line contents each time its :meth:`!readline` method is called. If a :class:`TextReader` instance is pickled, all attributes *except* the file object member are saved. When the instance is unpickled, the file is reopened, and reading resumes from the last location. The :meth:`__setstate__` and :meth:`__getstate__` methods are used to implement this behavior. ::
es: Aquí hay un ejemplo que muestra cómo modificar el comportamiento del `pickling` de una clase. La clase :class:`TextReader` abre un archivo de texto y devuelve el número de línea y el contenido de la línea cada vez que se llama a su método :meth:`!readline` . Si se selecciona una instancia de :class:`TextReader` se guardan todos los atributos *excepto* el miembro del objeto de archivo. Cuando se hace el `unpickling` de la instancia, el archivo se vuelve a abrir y la lectura se reanuda desde la última ubicación. Los métodos :meth:`__setstate__` y :meth:`__getstate__` se utilizan para implementar este comportamiento. ::

source: A sample usage might be something like this::
es: Un ejemplo de uso podría ser algo como esto::

source: Custom Reduction for Types, Functions, and Other Objects
es: Reducción personalizada para tipos, funciones y otros objetos

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
es: A veces, :attr:`~Pickler.dispatch_table` puede no ser lo suficientemente flexible. En particular, es posible que deseemos personalizar el `pickling` en función de otro criterio que no sea el tipo de objeto, o es posible que deseemos personalizar el `pickling` de funciones y clases.

source: For those cases, it is possible to subclass from the :class:`Pickler` class and implement a :meth:`~Pickler.reducer_override` method. This method can return an arbitrary reduction tuple (see :meth:`__reduce__`). It can alternatively return ``NotImplemented`` to fallback to the traditional behavior.
es: Para esos casos, es posible crear una subclase de la clase :class:`Pickler` e implementar el método :meth:`~Pickler.reducer_override`. Este método puede devolver una tupla de reducción arbitraria (ver :meth:`__reduce__`). Alternativamente, puede devolver ``NotImplemented`` para volver al comportamiento tradicional.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
es: Si se definen tanto :attr:`~Pickler.dispatch_table` como :meth:`~Pickler.reducer_override`, entonces :meth:`~Pickler.reducer_override` tiene prioridad.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
es: Por motivos de rendimiento, no se puede llamar a :meth:`~Pickler.reducer_override` para los siguientes objetos: ``None``, ``True``, ``False``, e instancias exactas de :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` y :class:`tuple`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
es: Aquí hay un ejemplo simple donde permitimos el `pickling` y reconstruir una clase dada class::

source: Out-of-band Buffers
es: Búferes fuera de banda

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
es: En algunos contextos, el módulo :mod:`pickle` se usa para transferir cantidades masivas de datos. Por lo tanto, puede ser importante minimizar el número de copias de memoria para preservar el rendimiento y el consumo de recursos. Sin embargo, el funcionamiento normal del módulo :mod:`pickle`, ya que transforma una estructura gráfica de objetos en un flujo secuencial de bytes, implica intrínsecamente copiar datos hacia y desde el flujo `pickle`.

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
es: Esta restricción puede evitarse si tanto el *proveedor* (la implementación de los tipos de objeto a transferir) como el *consumidor* (a implementación del sistema de comunicaciones) admiten las facilidades de transferencia fuera de banda proporcionadas por el protocolo `pickle` 5 y mayor.

source: Provider API
es: API de proveedor

source: The large data objects to be pickled must implement a :meth:`__reduce_ex__` method specialized for protocol 5 and higher, which returns a :class:`PickleBuffer` instance (instead of e.g. a :class:`bytes` object) for any large data.
es: Los objetos de datos grandes que se van a serializar con `pickle` deben implementar un método :meth:`__reduce_ex__` especializado para el protocolo 5 y superior, que devuelve una instancia de :class:`PickleBuffer` (en lugar de, por ejemplo, un objeto :class:`bytes` object) para cualquier datos.

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
es: Un objeto :class:`PickleBuffer` *indica* que el búfer subyacente es elegible para la transferencia de datos fuera de banda. Estos objetos siguen siendo compatibles con el uso normal del módulo :mod:`pickle` . Sin embargo, los consumidores también pueden optar por decirle a :mod:`pickle` que manejarán esos búferes por sí mismos.

source: Consumer API
es: API de consumidor

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
es: Un sistema de comunicaciones puede permitir el manejo personalizado de los objetos :class:`PickleBuffer` generados al serializar un gráfico de objetos.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
es: En el lado del envío, necesita pasar un argumento *buffer_callback* a :class:`Pickler` (o a las funciones :func:`dump` o :func:`dumps`), que se llamará con cada :class:`PickleBuffer` generado al hacer `pickling` del gráfico del objeto. Los búferes acumulados por *buffer_callback* no verán sus datos copiados en el flujo de `pickle`, solo se insertará un marcador barato.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
es: En el lado receptor, necesita pasar un argumento *buffers* a :class:`Unpickler` (o a las funciones :func:`load` o :func:`loads`), que es un iterable de los búferes que fueron pasado a *buffer_callback*. Ese iterable debería producir búferes en el mismo orden en que se pasaron a *buffer_callback*. Esos búferes proporcionarán los datos esperados por los reconstructores de los objetos cuyo `pickling` produjo los objetos originales :class:`PickleBuffer`.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
es: Entre el lado de envío y el lado de recepción, el sistema de comunicaciones es libre de implementar su propio mecanismo de transferencia para memorias intermedias fuera de banda. Las posibles optimizaciones incluyen el uso de memoria compartida o compresión dependiente del tipo de datos.

source: Example
es: Ejemplo
