Repository: python/python-docs-es
Catalog: library/pickle.po
Languages: es

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
es: Aquí hay un ejemplo trivial donde implementamos una subclase :class:`bytearray` capaz de participar en el `pickling` de un búfer fuera de banda::

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
es: El reconstructor (el método de clase ``_reconstruct``) devuelve el objeto que proporciona el búfer si tiene el tipo correcto. Esta es una manera fácil de simular el comportamiento de copia cero en este ejemplo de juguete.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
es: En el lado del consumidor, podemos serializar con `pickle` esos objetos de la forma habitual, que cuando no se serializan nos dará una copia del objeto original::

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
es: Pero si pasamos un *buffer_callback* y luego devolvemos los búferes acumulados al anular la serialización, podemos recuperar el objeto original::

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
es: Este ejemplo está limitado por el hecho de que :class:`bytearray` asigna su propia memoria: no puedes crear una instancia de :class:`bytearray` que esté respaldada por la memoria de otro objeto. Sin embargo, los tipos de datos de terceros, como las matrices NumPy no tienen esta limitación y permiten el uso de `pickling` de copia cero (o realizar la menor cantidad de copias posible) cuando se transfieren entre procesos o sistemas distintos.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
es: :pep:`574` -- Protocolo Pickle 5 con datos fuera de banda

source: Restricting Globals
es: Restricción de Globals

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
es: De forma predeterminada, el `unpickling` importará cualquier clase o función que encuentre en los datos de `pickle`. Para muchas aplicaciones, este comportamiento es inaceptable, ya que permite al `unpickler` importar e invocar código arbitrario. Solo considere lo que hace este flujo de datos de `pickle` hechos a mano cuando se carga::

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
es: En este ejemplo, el `unpickler` importa la función :func:`os.system` y luego aplica el argumento de cadena `"echo hello world"`. Aunque este ejemplo es inofensivo, no es difícil imaginar uno que pueda dañar su sistema.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
es: Por esta razón, es posible que desee controlar lo que se deserializa con `pickle` personalizando :meth:`Unpickler.find_class`. A diferencia de lo que sugiere su nombre, :meth:`Unpickler.find_class` se llama siempre que se solicita un global (es decir, una clase o una función). Por lo tanto, es posible prohibir completamente los globales o restringirlos a un subconjunto seguro.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
es: Aquí hay un ejemplo de un `unpickler` que permite cargar solo unas pocas clases seguras del módulo :mod:`builtins`::

source: A sample usage of our unpickler working has intended::
es: Un uso de muestra de nuestro `unpickler` trabajando tiene la intención de::

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
es: Como muestran nuestros ejemplos, debes tener cuidado con lo que permites que se deserialize con `pickle`. Por lo tanto, si la seguridad es un problema, puede considerar alternativas como la API de `marshalling` en :mod:`xmlrpc.client` o soluciones de terceros.

source: Recent versions of the pickle protocol (from protocol 2 and upwards) feature efficient binary encodings for several common features and built-in types. Also, the :mod:`pickle` module has a transparent optimizer written in C.
es: Las versiones recientes del protocolo `pickle` (desde el protocolo 2 en adelante) cuentan con codificaciones binarias eficientes para varias características comunes y tipos integrados. Además, el módulo :mod:`pickle` tiene un optimizador transparente escrito en C.

source: Examples
es: Ejemplos

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
es: Para obtener el código más simple, use las funciones :func:`dump` y :func:`load`. ::

source: The following example reads the resulting pickled data. ::
es: El siguiente ejemplo lee los datos serializados con `pickle` resultantes. ::

source: Module :mod:`copyreg`
es: Módulo :mod:`copyreg`

source: Pickle interface constructor registration for extension types.
es: Registro de constructor de interfaz `Pickle` para tipos de extensión.

source: Module :mod:`pickletools`
es: Módulo :mod:`pickletools`

source: Tools for working with and analyzing pickled data.
es: Herramientas para trabajar y analizar datos serializados con `pickle`.

source: Module :mod:`shelve`
es: Módulo :mod:`shelve`

source: Indexed databases of objects; uses :mod:`pickle`.
es: Bases de datos indexadas de objetos; usa :mod:`pickle`.

source: Shallow and deep object copying.
es: Copia de objetos superficial y profunda.

source: Module :mod:`marshal`
es: Módulo :mod:`marshal`

source: High-performance serialization of built-in types.
es: Serialización de alto rendimiento de tipos integrados.

source: Footnotes
es: Notas al pie

source: Don't confuse this with the :mod:`marshal` module
es: No confunda esto con el módulo :mod:`marshal`

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
es: Esta es la razón por la que las funciones :keyword:`lambda` no se pueden serializar con `pickle`: todas las funciones :keyword:`!lambda` comparten el mismo nombre: ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
es: La excepción generada probablemente será un :exc:`ImportError` o un :exc:`AttributeError` pero podría ser otra cosa.

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
es: El módulo :mod:`copy` utiliza este protocolo para operaciones de copia superficial y profunda.

source: The limitation on alphanumeric characters is due to the fact the persistent IDs, in protocol 0, are delimited by the newline character. Therefore if any kind of newline characters occurs in persistent IDs, the resulting pickle will become unreadable.
es: La limitación de caracteres alfanuméricos se debe al hecho de que los ID persistentes, en el protocolo 0, están delimitados por el carácter de nueva línea. Por lo tanto, si se produce algún tipo de carácter de nueva línea en los ID persistentes, el serializado con `pickle` resultante se volverá ilegible.
