Repository: python/python-docs-es
Catalog: library/pkgutil.po
Languages: es

source: :mod:`pkgutil` --- Package extension utility
es: :mod:`pkgutil` --- Utilidad de extensión de paquete

source: **Source code:** :source:`Lib/pkgutil.py`
es: **Código fuente:** :source:`Lib/pkgutil.py`

source: This module provides utilities for the import system, in particular package support.
es: Este módulo proporciona utilidades para el sistema de importación, en particular soporte para paquetes.

source: A namedtuple that holds a brief summary of a module's info.
es: Una tupla nombrada que contiene un breve resumen de la información del módulo.

source: Extend the search path for the modules which comprise a package. Intended use is to place the following code in a package's :file:`__init__.py`::
es: Extiende la ruta de búsqueda de los módulos que componen un paquete. El uso previsto es colocar el siguiente código en :file:`__init__.py`: de un paquete:

source: It also looks for :file:`\*.pkg` files beginning where ``*`` matches the *name* argument. This feature is similar to :file:`\*.pth` files (see the :mod:`site` module for more information), except that it doesn't special-case lines starting with ``import``. A :file:`\*.pkg` file is trusted at face value: apart from checking for duplicates, all entries found in a :file:`\*.pkg` file are added to the path, regardless of whether they exist on the filesystem. (This is a feature.)
es: También busca archivos :file:`\*.pkg` donde ``*`` coincide con el argumento *name*. Esta característica es similar a archivos :file:`\*.pth` (vea el módulo :mod:`site` para más información) excepto que no incluye líneas de casos especiales que comienzan con ``ìmport``. Un archivo :file:`\*.pkg` es confiable al pie de la letra: además de buscar duplicados, todas las entradas encontradas en un :file:`\*.pkg` se agregan a la ruta, independientemente de si existen en el sistema de archivos. (Esto es una funcionalidad).

source: If the input path is not a list (as is the case for frozen packages) it is returned unchanged. The input path is not modified; an extended copy is returned. Items are only appended to the copy at the end.
es: Si la ruta de entrada no es una lista (como es el caso de los paquetes congelados), se retorna sin cambios. La ruta de entrada no se modifica; se retorna una copia ampliada. Los elementos solo se adjuntan a la copia al final.

source: It is assumed that :data:`sys.path` is a sequence. Items of :data:`sys.path` that are not strings referring to existing directories are ignored. Unicode items on :data:`sys.path` that cause errors when used as filenames may cause this function to raise an exception (in line with :func:`os.path.isdir` behavior).
es: Se supone que :data:`sys.path` es una secuencia. Los elementos de :data:`sys.path` que no sean cadenas de caracteres que se refieran a directorios existentes se ignoran. Los elementos Unicode en :data:`sys.path` que causan errores cuando se utilizan como nombres de archivo pueden hacer que esta función lance una excepción (en línea con el comportamiento de :func:`os.path.isdir`).

source: Retrieve a module :term:`loader` for the given *fullname*.
es: Recupera un módulo :term:`loader` para un *fullname* dado.

source: Updated to be based directly on :mod:`importlib` rather than relying on the package internal :pep:`302` import emulation.
es: Actualizado para basarse directamente en :mod:`importlib` en lugar de depender del paquete interno :pep:`302` emulación de importación.

source: Updated to be based on :pep:`451`
es: Actualizado basado en :pep:`451`

source: Retrieve a :term:`finder` for the given *path_item*.
es: Recupera un :term:`finder` para el *path_item*.

source: The returned finder is cached in :data:`sys.path_importer_cache` if it was newly created by a path hook.
es: El buscador retornado se almacena en caché en :data:`sys.path_importer_cache` si fue creado recientemente por un enlace de ruta.

source: The cache (or part of it) can be cleared manually if a rescan of :data:`sys.path_hooks` is necessary.
es: La caché (o parte de ella) puede ser borrada manualmente si el escaneo de :data:`sys.path_hooks` es necesario.

source: Get a :term:`loader` object for *module_or_name*.
es: Obtiene un objeto :term:`loader` para *module_or_name*.

source: If the module or package is accessible via the normal import mechanism, a wrapper around the relevant part of that machinery is returned. Returns ``None`` if the module cannot be found or imported. If the named module is not already imported, its containing package (if any) is imported, in order to establish the package ``__path__``.
es: Si se puede acceder al módulo o paquete a través del mecanismo de importación normal, se devuelve un contenedor alrededor de la parte relevante de esa maquinaria. Retorna ``None`` si el módulo no se puede encontrar o importar. Si el módulo nombrado aún no se ha importado, se importa el paquete que lo contiene (si lo hay), para establecer el paquete ``__path__``.

source: Yield :term:`finder` objects for the given module name.
es: Cede (*yield*) objetos :term:`finder` para el nombre de módulo dado.

source: If the named module is in a package, that package is imported as a side effect of invoking this function.
es: Si el módulo nombrado está en un paquete, ese paquete se importa como un efecto secundario de invocar esta función.

source: If no module name is specified, all top level finders are produced.
es: Si no se especifica ningún nombre de módulo, se generan todos los buscadores de nivel superior.

source: *path* should be either ``None`` or a list of paths to look for modules in.
es: *path* tendría que ser ``None`` o una list de rutas en las que buscar módulos.

source: *prefix* is a string to output on the front of every module name on output.
es: *prefix* es una cadena para mostrar delante de cada nombre de módulo en la salida.

source: Only works for a :term:`finder` which defines an ``iter_modules()`` method. This interface is non-standard, so the module also provides implementations for :class:`importlib.machinery.FileFinder` and :class:`zipimport.zipimporter`.
es: Sólo funciona para un :term:`finder` que define un método ``iter_modules()``. Esta interfaz no es estándar, por lo que el módulo también proporciona implementaciones para :class:`importlib.machinery.FileFinder` y :class:`zipimport.zipimporter`.

source: Yields :class:`ModuleInfo` for all modules recursively on *path*, or, if *path* is ``None``, all accessible modules.
es: Cede (*yield*) :class:`ModuleInfo` para todos los módulos de forma recursiva en *path*, o, si *path* es ``None``, todos los módulos accesibles.

source: Note that this function must import all *packages* (*not* all modules!) on the given *path*, in order to access the ``__path__`` attribute to find submodules.
es: Note que esta función debe importar todos los *packages* (¡*no* todos los módulos!) en el *path* especificado, para acceder al atributo ``__path__`` para encontrar submódulos.

source: *onerror* is a function which gets called with one argument (the name of the package which was being imported) if any exception occurs while trying to import a package. If no *onerror* function is supplied, :exc:`ImportError`\s are caught and ignored, while all other exceptions are propagated, terminating the search.
es: *onerror* es una función que se llama con un argumento (el nombre del paquete que se estaba importando) si se produce alguna excepción al intentar importar un paquete. Si no se proporciona ninguna función *onerror*, los :exc:`ImportError` se capturan e ignoran, mientras que todas las demás excepciones se propagan, terminando la búsqueda.

source: Examples::
es: Ejemplos::

source: Get a resource from a package.
es: Obtiene un recurso de un paquete.

source: This is a wrapper for the :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>` API. The *package* argument should be the name of a package, in standard module format (``foo.bar``). The *resource* argument should be in the form of a relative filename, using ``/`` as the path separator. The parent directory name ``..`` is not allowed, and nor is a rooted name (starting with a ``/``).
es: Esto es un contenedor para la API :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>`. El argumento *package* debe ser el nombre de un paquete, en formato de módulo estándar (``foo.bar``).El argumento *resource* debe tener la forma de un nombre de archivo relativo, utilizando ``/`` como separador de ruta.El nombre del directorio principal ``..`` no está permitido, ni tampoco un nombre raíz (empezando por ``/``).

source: The function returns a binary string that is the contents of the specified resource.
es: La función retorna una cadena de caracteres binaria que es el contenido del recurso especificado.

source: For packages located in the filesystem, which have already been imported, this is the rough equivalent of::
es: Para los paquetes ubicados en el sistema de archivos, que ya se han importado, este es el equivalente aproximado de::

source: If the package cannot be located or loaded, or it uses a :term:`loader` which does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, then ``None`` is returned. In particular, the :term:`loader` for :term:`namespace packages <namespace package>` does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.
es: Si el paquete no puede ser localizado o cargado, o usa un :term:`loader` el cuál no soporta :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, entonces retorna ``None``. En particular, el: término :term:`loader` para :term:`namespace packages <namespace package>` no soporta :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.

source: Resolve a name to an object.
es: Resuelve un nombre a un objeto.

source: This functionality is used in numerous places in the standard library (see :issue:`12915`) - and equivalent functionality is also in widely used third-party packages such as setuptools, Django and Pyramid.
es: Esta funcionalidad es usada en numerosos lugares en la librería estándar (ver :issue:`12915`) - y existe funcionalidad equivalente también en librerías de terceros ampliamente usadas, tales como setuptools, Django y Pyramid.

source: It is expected that *name* will be a string in one of the following formats, where W is shorthand for a valid Python identifier and dot stands for a literal period in these pseudo-regexes:
es: Se espera que *name* sea una cadena de caracteres en uno de los siguientes formatos, donde W representa un identificador de Python válido, y un punto representa literalmente un punto en las siguientes pseudo-expresiones regulares:

source: The first form is intended for backward compatibility only. It assumes that some part of the dotted name is a package, and the rest is an object somewhere within that package, possibly nested inside other objects. Because the place where the package stops and the object hierarchy starts can't be inferred by inspection, repeated attempts to import must be done with this form.
es: La primera forma existe sólo para mantener compatibilidad con versiones anteriores. Asume que parte del nombre con puntos es un paquete, y el resto es un objeto en algún lugar dentro de ese paquete, posiblemente anidado dentro de otros objetos. Dado que el lugar donde el paquete termina y la jerarquía de objetos comienza no puede ser inferida por inspección, con esta forma se debe realizar repetidos intentos de importación.

source: In the second form, the caller makes the division point clear through the provision of a single colon: the dotted name to the left of the colon is a package to be imported, and the dotted name to the right is the object hierarchy within that package. Only one import is needed in this form. If it ends with the colon, then a module object is returned.
es: En la segunda forma, el usuario hace claro el punto de división al proveer un signo de dos puntos: el nombre con puntos a la izquierda de los dos puntos es el paquete a ser importado, y el nombre con puntos a la derecha es la jerarquía de nombres dentro de ese paquete. Sólo una importación se necesaria con esta forma. Si termina con dos puntos, entonces se retorna un objeto módulo.

source: The function will return an object (which might be a module), or raise one of the following exceptions:
es: La función retornará un objeto (el cual puede ser un módulo), o lanzará una de las siguientes excepciones:

source: :exc:`ValueError` -- if *name* isn't in a recognised format.
es: :exc:`ValueError` -- si *name* no tiene un formato reconocido.

source: :exc:`ImportError` -- if an import failed when it shouldn't have.
es: :exc:`ImportError` -- si una importación falló cuando no lo debería haber hecho.

source: :exc:`AttributeError` -- If a failure occurred when traversing the object hierarchy within the imported package to get to the desired object.
es: :exc:`AttributeError` -- Si un fallo ocurrió mientras se atravesaba la jerarquía de objetos dentro del paquete importado para obtener el objeto deseado.
