Repository: python/python-docs-es
Catalog: library/profile.po
Languages: es_co

source: ``your_time_func`` should return a single number. If it returns integers, you can also invoke the class constructor with a second argument specifying the real duration of one unit of time. For example, if ``your_integer_time_func`` returns times measured in thousands of seconds, you would construct the :class:`Profile` instance as follows::
es_co: ``your_time_func`` debería devolver un solo número. Si devuelve enteros, también puede invocar al constructor de la clase con un segundo argumento que especifique la duración real de una unidad de tiempo. Por ejemplo, si ``your_integer_time_func`` retorna tiempos medidos en miles de segundos, construiría la instancia :class:`Profile` de la siguiente manera::

source: As the :class:`cProfile.Profile` class cannot be calibrated, custom timer functions should be used with care and should be as fast as possible. For the best results with a custom timer, it might be necessary to hard-code it in the C source of the internal :mod:`_lsprof` module.
es_co: Como la clase :class:`cProfile.Profile` no se puede calibrar, las funciones de temporizador personalizadas deben usarse con cuidado y deben ser lo más rápidas posible. Para obtener los mejores resultados con un temporizador personalizado, puede ser necesario codificarlo en la fuente C del módulo interno :mod:`_lsprof`.

source: Python 3.3 adds several new functions in :mod:`time` that can be used to make precise measurements of process or wall-clock time. For example, see :func:`time.perf_counter`.
es_co: Python 3.3 agrega varias funciones nuevas en :mod:`time` que se puede usar para realizar mediciones precisas del proceso o el tiempo del reloj de pared. Por ejemplo, vea :func:`time.perf_counter`.
