Repository: python/python-docs-es
Catalog: library/profile.po
Languages: es_co

source: The Python Profilers
es_co: Los perfiladores de Python

source: **Source code:** :source:`Lib/profile.py` and :source:`Lib/pstats.py`
es_co: **Código fuente:** :source:`Lib/profile.py` y :fuente:`Lib/pstats.py`

source: Introduction to the profilers
es_co: Introducción a los perfiladores

source: :mod:`cProfile` and :mod:`profile` provide :dfn:`deterministic profiling` of Python programs. A :dfn:`profile` is a set of statistics that describes how often and for how long various parts of the program executed. These statistics can be formatted into reports via the :mod:`pstats` module.
es_co: :mod:`cProfile` y :mod:`profile` proporcionan :dfn:`deterministic profiling` de los programas de Python. :dfn:`profile` es un conjunto de estadísticas que describe con qué frecuencia y durante cuánto tiempo se ejecutaron varias partes del programa. Estas estadísticas pueden formatearse en informes a través del módulo :mod:`pstats` module.

source: The Python standard library provides two different implementations of the same profiling interface:
es_co: La biblioteca estándar de Python proporciona dos implementaciones diferentes de la misma interfaz de creación de perfiles:

source: :mod:`cProfile` is recommended for most users; it's a C extension with reasonable overhead that makes it suitable for profiling long-running programs. Based on :mod:`lsprof`, contributed by Brett Rosen and Ted Czotter.
es_co: :mod:`cProfile` se recomienda para la mayoría de los usuarios; Es una extensión C con una sobrecarga razonable que la hace adecuada para perfilar programas de larga duración. Basado en :mod:`lsprof`, aportado por Brett Rosen y Ted Czotter.

source: :mod:`profile`, a pure Python module whose interface is imitated by :mod:`cProfile`, but which adds significant overhead to profiled programs. If you're trying to extend the profiler in some way, the task might be easier with this module. Originally designed and written by Jim Roskind.
es_co: :mod:`profile`, un módulo Python puro cuya interfaz es imitada por :mod:`cProfile`, pero que agrega una sobrecarga significativa a los programas perfilados. Si está intentando extender el generador de perfiles de alguna manera, la tarea podría ser más fácil con este módulo. Originalmente diseñado y escrito por Jim Roskind.

source: The profiler modules are designed to provide an execution profile for a given program, not for benchmarking purposes (for that, there is :mod:`timeit` for reasonably accurate results). This particularly applies to benchmarking Python code against C code: the profilers introduce overhead for Python code, but not for C-level functions, and so the C code would seem faster than any Python one.
es_co: Los módulos del generador de perfiles están diseñados para proporcionar un perfil de ejecución para un programa determinado, no para fines de evaluación comparativa (para eso, está :mod:`timeit` que permite obtener resultados razonablemente precisos). Esto se aplica particularmente a la evaluación comparativa del código Python contra el código C: los perfiladores introducen gastos generales para el código Python, pero no para las funciones de nivel C, por lo que el código C parecería más rápido que cualquier Python.

source: Instant User's Manual
es_co: Manual instantáneo de usuario

source: This section is provided for users that "don't want to read the manual." It provides a very brief overview, and allows a user to rapidly perform profiling on an existing application.
es_co: Esta sección se proporciona a los usuarios que \”no quieren leer el manual\”. Proporciona una visión general muy breve y permite a un usuario realizar perfiles rápidamente en una aplicación existente.

source: To profile a function that takes a single argument, you can do::
es_co: Para perfilar una función que toma un solo argumento, puede hacer::

source: (Use :mod:`profile` instead of :mod:`cProfile` if the latter is not available on your system.)
es_co: (Use :mod:`profile` en lugar de :mod:`cProfile` si este último no está disponible en su sistema.)

source: The above action would run :func:`re.compile` and print profile results like the following::
es_co: La acción anterior ejecutaría :func:`re.compile` e imprime resultados de perfil como los siguientes::

source: The first line indicates that 197 calls were monitored. Of those calls, 192 were :dfn:`primitive`, meaning that the call was not induced via recursion. The next line: ``Ordered by: standard name``, indicates that the text string in the far right column was used to sort the output. The column headings include:
es_co: La primera línea indica que se monitorearon 197 llamadas. De esas llamadas, 192 fueron :dfn:`primitive`, lo que significa que la llamada no fue inducida por recursividad. La siguiente línea: ``Ordered by: standard name``, indica que la cadena de texto en la columna del extremo derecho se utilizó para ordenar la salida. Los encabezados de columna incluyen:

source: for the number of calls.
es_co: por el número de llamadas.

source: for the total time spent in the given function (and excluding time made in calls to sub-functions)
es_co: para el tiempo total empleado en la función dada (y excluyendo el tiempo realizado en llamadas a subfunciones)

source: is the quotient of ``tottime`` divided by ``ncalls``
es_co: es el cociente de ``tottime`` dividido por ``ncalls``

source: is the cumulative time spent in this and all subfunctions (from invocation till exit). This figure is accurate *even* for recursive functions.
es_co: es el tiempo acumulado empleado en esta y todas las subfunciones (desde la invocación hasta la salida). Esta cifra es precisa *incluso* para funciones recursivas.

source: is the quotient of ``cumtime`` divided by primitive calls
es_co: es el cociente de ``cumtime`` dividido por llamadas primitivas

source: filename:lineno(function)
es_co: filename:lineno(función)

source: provides the respective data of each function
es_co: proporciona los datos respectivos de cada función

source: When there are two numbers in the first column (for example ``3/1``), it means that the function recursed. The second value is the number of primitive calls and the former is the total number of calls. Note that when the function does not recurse, these two values are the same, and only the single figure is printed.
es_co: Cuando hay dos números en la primera columna (por ejemplo, ``3/1``), significa que la función se repite. El segundo valor es el número de llamadas primitivas y el primero es el número total de llamadas. Tenga en cuenta que cuando la función no se repite, estos dos valores son iguales y solo se imprime la figura.

source: Instead of printing the output at the end of the profile run, you can save the results to a file by specifying a filename to the :func:`run` function::
es_co: En lugar de imprimir la salida al final de la ejecución del perfil, puede guardar los resultados en un archivo especificando un nombre de archivo en la función :func:`run`::

source: The :class:`pstats.Stats` class reads profile results from a file and formats them in various ways.
es_co: La clase class:`pstats.Stats` lee los resultados del perfil desde un archivo y los formatea de varias maneras.

source: The files :mod:`cProfile` and :mod:`profile` can also be invoked as a script to profile another script. For example::
es_co: Los archivos :mod:`cProfile` y :mod:`profile` también se pueden invocar como un script para perfilar otro script. Por ejemplo::

source: ``-o`` writes the profile results to a file instead of to stdout
es_co: ``-o`` escribe los resultados del perfil en un archivo en lugar de stdout

source: ``-s`` specifies one of the :func:`~pstats.Stats.sort_stats` sort values to sort the output by. This only applies when ``-o`` is not supplied.
es_co: ``-s`` especifica uno de los valores de clasificación :func:`~pstats.Stats.sort_stats` para ordenar la salida. Esto solo se aplica cuando ``-o`` no se suministra.

source: ``-m`` specifies that a module is being profiled instead of a script.
es_co: ``-m`` especifica que se está perfilando un módulo en lugar de un script.

source: Added the ``-m`` option to :mod:`cProfile`.
es_co: Se agregó la opción ``-m`` a :mod:`cProfile`.

source: Added the ``-m`` option to :mod:`profile`.
es_co: Se agregó la opción ``-m`` a :mod:`profile`.

source: The :mod:`pstats` module's :class:`~pstats.Stats` class has a variety of methods for manipulating and printing the data saved into a profile results file::
es_co: Los módulos :mod:`pstats` clase :class:`~pstats.Stats` tienen una variedad de métodos para manipular e imprimir los datos guardados en un archivo de resultados de perfil::

source: The :meth:`~pstats.Stats.strip_dirs` method removed the extraneous path from all the module names. The :meth:`~pstats.Stats.sort_stats` method sorted all the entries according to the standard module/line/name string that is printed. The :meth:`~pstats.Stats.print_stats` method printed out all the statistics. You might try the following sort calls::
es_co: El método :meth:`~pstats.Stats.strip_dirs` eliminó la ruta extraña de todos los nombres de módulos. El método :meth:`~pstats.Stats.sort_stats` clasificó todas las entradas de acuerdo con el módulo/línea/nombre de cadena de caracteres estándar que se imprime. El método :meth:`~pstats.Stats.print_stats` imprimió todas las estadísticas. Puede intentar las siguientes llamadas de clasificación::

source: The first call will actually sort the list by function name, and the second call will print out the statistics. The following are some interesting calls to experiment with::
es_co: La primera llamada realmente ordenará la lista por nombre de función, y la segunda llamada imprimirá las estadísticas. Las siguientes son algunas llamadas interesantes para experimentar::

source: This sorts the profile by cumulative time in a function, and then only prints the ten most significant lines. If you want to understand what algorithms are taking time, the above line is what you would use.
es_co: Esto ordena el perfil por tiempo acumulado en una función y luego solo imprime las diez líneas más significativas. Si desea comprender qué algoritmos están tomando tiempo, la línea anterior es lo que usaría.

source: If you were looking to see what functions were looping a lot, and taking a lot of time, you would do::
es_co: Si estuviera buscando ver qué funciones se repetían mucho y toman mucho tiempo, usted haría::

source: to sort according to time spent within each function, and then print the statistics for the top ten functions.
es_co: para ordenar según el tiempo dedicado a cada función y luego imprimir las estadísticas de las diez funciones principales.

source: You might also try::
es_co: También puedes probar::

source: This will sort all the statistics by file name, and then print out statistics for only the class init methods (since they are spelled with ``__init__`` in them). As one final example, you could try::
es_co: Esto ordenará todas las estadísticas por nombre de archivo y luego imprimirá estadísticas solo para los métodos de inicio de clase (ya que están escritos con ``__init__`` en ellos). Como último ejemplo, puedes probar::

source: This line sorts statistics with a primary key of time, and a secondary key of cumulative time, and then prints out some of the statistics. To be specific, the list is first culled down to 50% (re: ``.5``) of its original size, then only lines containing ``init`` are maintained, and that sub-sub-list is printed.
es_co: Esta línea clasifica las estadísticas con una clave primaria de tiempo y una clave secundaria de tiempo acumulado, y luego imprime algunas de las estadísticas. Para ser específicos, la lista primero se reduce al 50% (re: ``.5``) de su tamaño original, luego solo se mantienen las líneas que contienen ```init`` y se imprime esa sub-sublista.

source: If you wondered what functions called the above functions, you could now (``p`` is still sorted according to the last criteria) do::
es_co: Si se preguntó qué funciones denominaban las funciones anteriores, ahora podría (``p`` todavía está ordenada según el último criterio) hacer::

source: and you would get a list of callers for each of the listed functions.
es_co: y obtendría una lista de llamadas para cada una de las funciones enumeradas.

source: If you want more functionality, you're going to have to read the manual, or guess what the following functions do::
es_co: Si desea más funcionalidad, tendrá que leer el manual o adivinar lo que hacen las siguientes funciones::

source: Invoked as a script, the :mod:`pstats` module is a statistics browser for reading and examining profile dumps. It has a simple line-oriented interface (implemented using :mod:`cmd`) and interactive help.
es_co: Invocado como un script, el módulo :mod:`pstats` es un navegador de estadísticas para leer y examinar volcados de perfil. Tiene una interfaz simple orientada a la línea de comandos (implementada usando :mod:`cmd`) y ayuda interactiva.

source: :mod:`profile` and :mod:`cProfile` Module Reference
es_co: Referencia del módulo :mod:`profile` y :mod:`cProfile`

source: Both the :mod:`profile` and :mod:`cProfile` modules provide the following functions:
es_co: Los módulos :mod:`profile` y :mod:`cProfile` proporcionan las siguientes funciones:

source: This function takes a single argument that can be passed to the :func:`exec` function, and an optional file name. In all cases this routine executes::
es_co: Esta función toma un único argumento que se puede pasar a la función :func:`exec` y un nombre de archivo opcional. En todos los casos esta rutina ejecuta::

source: and gathers profiling statistics from the execution. If no file name is present, then this function automatically creates a :class:`~pstats.Stats` instance and prints a simple profiling report. If the sort value is specified, it is passed to this :class:`~pstats.Stats` instance to control how the results are sorted.
es_co: y recopila estadísticas de perfiles de la ejecución. Si no hay ningún nombre de archivo, esta función crea automáticamente una instancia de :class:`~pstats.Stats` e imprime un informe de perfil simple. Si se especifica el valor de clasificación, se pasa a esta instancia :class:`~pstats.Stats` para controlar cómo se ordenan los resultados.

source: This function is similar to :func:`run`, with added arguments to supply the globals and locals dictionaries for the *command* string. This routine executes::
es_co: Esta función es similar a :func:`run`, con argumentos agregados para proporcionar los diccionarios globales y locales para la cadena de caracteres *command*. Esta rutina ejecuta::

source: and gathers profiling statistics as in the :func:`run` function above.
es_co: y recopila estadísticas de perfiles como en la función :func:`run` anterior.

source: This class is normally only used if more precise control over profiling is needed than what the :func:`cProfile.run` function provides.
es_co: Esta clase normalmente solo es usada si se necesita un control más preciso sobre la creación de perfiles que el que proporciona la función :func:`cProfile.run`.

source: A custom timer can be supplied for measuring how long code takes to run via the *timer* argument. This must be a function that returns a single number representing the current time. If the number is an integer, the *timeunit* specifies a multiplier that specifies the duration of each unit of time. For example, if the timer returns times measured in thousands of seconds, the time unit would be ``.001``.
es_co: Se puede suministrar un temporizador personalizado para medir cuánto tiempo tarda el código en ejecutarse mediante el argumento *timer*. Esta debe ser una función que devuelve un solo número que representa la hora actual. Si el número es un entero, la *timeunit* especifica un multiplicador que especifica la duración de cada unidad de tiempo. Por ejemplo, si el temporizador devuelve tiempos medidos en miles de segundos, la unidad de tiempo sería ``.001``.

source: Directly using the :class:`Profile` class allows formatting profile results without writing the profile data to a file::
es_co: El uso directo de la clase :class:`Profile` permite formatear los resultados del perfil sin escribir los datos del perfil en un archivo::

source: The :class:`Profile` class can also be used as a context manager (supported only in :mod:`cProfile` module. see :ref:`typecontextmanager`)::
es_co: La clase :class:`Profile` también se puede usar como administrador de contexto (solo se admite en el módulo :mod:`cProfile`. Ver :ref:`typecontextmanager`)::

source: Added context manager support.
es_co: Se agregó soporte de administrador de contexto.

source: Start collecting profiling data. Only in :mod:`cProfile`.
es_co: Comience a recopilar datos de perfiles. Solo en :mod:`cProfile`.

source: Stop collecting profiling data. Only in :mod:`cProfile`.
es_co: Deje de recopilar datos de perfiles. Solo en :mod:`cProfile`.

source: Stop collecting profiling data and record the results internally as the current profile.
es_co: Deje de recopilar datos de perfiles y registre los resultados internamente como el perfil actual.

source: Create a :class:`~pstats.Stats` object based on the current profile and print the results to stdout.
es_co: Cree un objeto :class:`~pstats.Stats` en función del perfil actual e imprima los resultados en *stdout*.

source: Write the results of the current profile to *filename*.
es_co: Escriba los resultados del perfil actual en *filename*.

source: Profile the cmd via :func:`exec`.
es_co: Perfile el cmd a través de :func:`exec`.

source: Profile the cmd via :func:`exec` with the specified global and local environment.
es_co: Perfile el cmd a través de :func:`exec` con el entorno global y local especificado.

source: Profile ``func(*args, **kwargs)``
es_co: Perfil ``func(*args, **kwargs)``

source: Note that profiling will only work if the called command/function actually returns. If the interpreter is terminated (e.g. via a :func:`sys.exit` call during the called command/function execution) no profiling results will be printed.
es_co: Tenga en cuenta que la creación de perfiles solo funcionará si el comando/función llamado realmente regresa. Si el intérprete se termina (por ejemplo, a través de una llamada a :func:`sys.exit` durante la ejecución del comando/función llamado) no se imprimirán resultados de generación de perfiles.

source: The :class:`Stats` Class
es_co: La clase :class:`Stats`

source: Analysis of the profiler data is done using the :class:`~pstats.Stats` class.
es_co: El análisis de los datos del generador de perfiles es realizado utilizando la clase :class:`~pstats.Stats`.

source: This class constructor creates an instance of a "statistics object" from a *filename* (or list of filenames) or from a :class:`Profile` instance. Output will be printed to the stream specified by *stream*.
es_co: Este constructor de clase crea una instancia de un \“objeto de estadísticas\” a partir de un *filename* (o una lista de nombres de archivo) o de una instancia :class:`Profile`. La salida se imprimirá en la secuencia especificada por *stream*.

source: The file selected by the above constructor must have been created by the corresponding version of :mod:`profile` or :mod:`cProfile`. To be specific, there is *no* file compatibility guaranteed with future versions of this profiler, and there is no compatibility with files produced by other profilers, or the same profiler run on a different operating system. If several files are provided, all the statistics for identical functions will be coalesced, so that an overall view of several processes can be considered in a single report. If additional files need to be combined with data in an existing :class:`~pstats.Stats` object, the :meth:`~pstats.Stats.add` method can be used.
es_co: El archivo seleccionado por el constructor anterior debe haber sido creado por la versión correspondiente de :mod:`profile` o :mod:`cProfile`. Para ser específicos, *no* hay compatibilidad de archivos garantizada con futuras versiones de este generador de perfiles, y no hay compatibilidad con archivos producidos por otros perfiladores, o el mismo generador de perfiles ejecutado en un sistema operativo diferente. Si se proporcionan varios archivos, se combinarán todas las estadísticas para funciones idénticas, de modo que se pueda considerar una vista general de varios procesos en un solo informe. Si es necesario combinar archivos adicionales con datos en un objeto existente :class:`~pstats.Stats`, se puede usar el método :meth:`~pstats.Stats.add`.

source: Instead of reading the profile data from a file, a :class:`cProfile.Profile` or :class:`profile.Profile` object can be used as the profile data source.
es_co: En lugar de leer los datos del perfil de un archivo, se puede usar un objeto :class:`cProfile.Profile` o :class:`profile.Profile` como fuente de datos del perfil.

source: :class:`Stats` objects have the following methods:
es_co: los objetos :class:`Stats tienen los siguientes métodos:

source: This method for the :class:`Stats` class removes all leading path information from file names. It is very useful in reducing the size of the printout to fit within (close to) 80 columns. This method modifies the object, and the stripped information is lost. After performing a strip operation, the object is considered to have its entries in a "random" order, as it was just after object initialization and loading. If :meth:`~pstats.Stats.strip_dirs` causes two function names to be indistinguishable (they are on the same line of the same filename, and have the same function name), then the statistics for these two entries are accumulated into a single entry.
es_co: Este método para la clase :class:`Stats` elimina toda la información de ruta principal de los nombres de archivo. Es muy útil para reducir el tamaño de la impresión para que quepa en (cerca de) 80 columnas. Este método modifica el objeto y se pierde la información eliminada. Después de realizar una operación de tira, se considera que el objeto tiene sus entradas en un orden \“aleatorio\”, como lo fue justo después de la inicialización y carga del objeto. Si :meth:`~pstats.Stats.strip_dirs` hace que dos nombres de funciones no se puedan distinguir (están en la misma línea del mismo nombre de archivo y tienen el mismo nombre de función), entonces las estadísticas para estas dos entradas se acumulan en un sola entrada.

source: This method of the :class:`Stats` class accumulates additional profiling information into the current profiling object. Its arguments should refer to filenames created by the corresponding version of :func:`profile.run` or :func:`cProfile.run`. Statistics for identically named (re: file, line, name) functions are automatically accumulated into single function statistics.
es_co: Este método de la clase :class:`Stats` acumula información de perfil adicional en el objeto de perfil actual. Sus argumentos deben referirse a los nombres de archivo creados por la versión correspondiente de :func:`profile.run` or :func:`cProfile.run`. Las estadísticas para funciones con nombre idéntico (re: archivo, línea, nombre) se acumulan automáticamente en estadísticas de función única.

source: Save the data loaded into the :class:`Stats` object to a file named *filename*. The file is created if it does not exist, and is overwritten if it already exists. This is equivalent to the method of the same name on the :class:`profile.Profile` and :class:`cProfile.Profile` classes.
es_co: Guarde los datos cargados en el objeto :class:`Stats` en un archivo llamado *filename*. El archivo se crea si no existe y se sobrescribe si ya existe. Esto es equivalente al método del mismo nombre en las clases: class :class:`profile.Profile` y :class:`cProfile.Profile`.
