Repository: python/python-docs-es
Catalog: library/pty.po
Languages: es

source: :mod:`pty` --- Pseudo-terminal utilities
es: :mod:`pty` --- Utilidades para Pseudo-terminal

source: **Source code:** :source:`Lib/pty.py`
es: **Código Fuente:** :source:`Lib/pty.py`

source: The :mod:`pty` module defines operations for handling the pseudo-terminal concept: starting another process and being able to write to and read from its controlling terminal programmatically.
es: El módulo :mod:`pty` define las operaciones para manejar el concepto de pseudo-terminal: iniciar otro proceso para poder escribir y leer desde su propia terminal mediante programación.

source: Pseudo-terminal handling is highly platform dependent. This code is mainly tested on Linux, FreeBSD, and macOS (it is supposed to work on other POSIX platforms but it's not been thoroughly tested).
es: El manejo de pseudo-terminales depende en gran medida de la plataforma. Este código se prueba principalmente en Linux, FreeBSD y macOS (se supone que funciona en otras plataformas POSIX, pero no se ha probado a fondo).

source: The :mod:`pty` module defines the following functions:
es: El modulo :mod:`pty` define las siguientes funciones:

source: Fork. Connect the child's controlling terminal to a pseudo-terminal. Return value is ``(pid, fd)``. Note that the child gets *pid* 0, and the *fd* is *invalid*. The parent's return value is the *pid* of the child, and *fd* is a file descriptor connected to the child's controlling terminal (and also to the child's standard input and output).
es: Bifurcación. Conectar en su propia terminal (terminal hijo) una pseudo-terminal. El valor de retorno es ``(pid, fd)``. Tener en cuenta que la terminal hijo tiene como valor *pid* 0 y *fd* es *invalid*. El valor de retorno del padre es el *pid* del hijo, y *fd* es un descriptor de archivo conectado a la terminal hijo (también a la salida y entrada estándar de la terminal hijo)

source: Open a new pseudo-terminal pair, using :func:`os.openpty` if possible, or emulation code for generic Unix systems. Return a pair of file descriptors ``(master, slave)``, for the master and the slave end, respectively.
es: Abre un nuevo par de pseudo-terminales, usando :func:`os.openpty`, o código de emulación para sistemas genéricos de Unix. Retorna un par de descriptores de archivo ``(master, slave)``, para el *master* y el *slave* respectivamente.

source: Spawn a process, and connect its controlling terminal with the current process's standard io. This is often used to baffle programs which insist on reading from the controlling terminal. It is expected that the process spawned behind the pty will eventually terminate, and when it does *spawn* will return.
es: Genera un proceso conectado a su terminal con el io estándar del proceso actual. Esto se usa a frecuentemente para confundir programas que insisten en leer desde la terminal de control. Se espera que el proceso generado detrás de pty sea finalizado y cuando lo haga *spawn* se retornará.

source: A loop copies STDIN of the current process to the child and data received from the child to STDOUT of the current process. It is not signaled to the child if STDIN of the current process closes down.
es: Un bucle copia STDIN del proceso actual al hijo y los datos recibidos del niño a STDOUT del proceso actual. No se le indica al hijo si STDIN del proceso actual se cierra.

source: The functions *master_read* and *stdin_read* are passed a file descriptor which they should read from, and they should always return a byte string. In order to force spawn to return before the child process exits an empty byte array should be returned to signal end of file.
es: A las funciones *master_read* y *stdin_read* se les pasa un descriptor de archivo del cual deben leer, y siempre deben retornar una cadena de bytes. Para forzar el retorno de spawn antes de que el proceso hijo salga, se debe retornar un arreglo de bytes vacía para señalar el final del archivo.

source: The default implementation for both functions will read and return up to 1024 bytes each time the function is called. The *master_read* callback is passed the pseudoterminal’s master file descriptor to read output from the child process, and *stdin_read* is passed file descriptor 0, to read from the parent process's standard input.
es: La implementación predeterminada para ambas funciones retornará hasta 1024 bytes cada vez que se llamen. El dato retornado de *master_read* se pasa al descriptor de archivo maestro para leer la salida del proceso hijo, y *stdin_read* pasa el descriptor de archivo 0, para leer desde la entrada del proceso padre.

source: Returning an empty byte string from either callback is interpreted as an end-of-file (EOF) condition, and that callback will not be called after that. If *stdin_read* signals EOF the controlling terminal can no longer communicate with the parent process OR the child process. Unless the child process will quit without any input, *spawn* will then loop forever. If *master_read* signals EOF the same behavior results (on linux at least).
es: Retornando una cadena de bytes vacía de cualquier llamado es interpretado como una condición de fin de archivo (EOF), y el llamado no se realizará después de eso. Si *stdin_read* retorna EOF la terminal de control ya no puede comunicarse con el proceso padre o el proceso hijo. A menos que el proceso hijo se cierre sin ninguna entrada *spawn* se repetirá para siempre. Si *master_read* retorna EOF se produce el mismo comportamiento (al menos en Linux)

source: Return the exit status value from :func:`os.waitpid` on the child process.
es: Retorna el valor del estado de salida de :func:`os.waitpid` en el proceso hijo.

source: :func:`os.waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
es: :func:`os.waitstatus_to_exitcode` se puede utilizar para convertir el estado de salida en un código de salida.

source: Raises an :ref:`auditing event <auditing>` ``pty.spawn`` with argument ``argv``.
es: Lanza un :ref:`evento de auditoria <auditing>` ``pty.spawn`` con el argumento ``argv``.

source: :func:`spawn` now returns the status value from :func:`os.waitpid` on the child process.
es: :func:`spawn` ahora retorna el valor de estado de :func:`os.waitpid` para los procesos hijos.

source: Example
es: Ejemplo

source: The following program acts like the Unix command :manpage:`script(1)`, using a pseudo-terminal to record all input and output of a terminal session in a "typescript". ::
es: El siguiente programa actúa como el comando de Unix :manpage:`script(1)`, usando una pseudo-terminal para registrar todas las entradas y salidas de una sesión en "typescript". ::
