Repository: python/python-docs-es
Catalog: library/pydoc.po
Languages: es_pe

source: :mod:`pydoc` --- Documentation generator and online help system
es_pe: :mod:`pydoc` --- Generador de documentación y Sistema de ayuda en línea

source: **Source code:** :source:`Lib/pydoc.py`
es_pe: **Código fuente:** :source:`Lib/pydoc.py`

source: The :mod:`pydoc` module automatically generates documentation from Python modules. The documentation can be presented as pages of text on the console, served to a web browser, or saved to HTML files.
es_pe: El módulo :mod:`pydoc` genera automáticamente documentación a partir de módulos de Python. La documentación puede presentarse como páginas de texto en la consola, enviarse a un navegador web o guardarse en archivos HTML.

source: For modules, classes, functions and methods, the displayed documentation is derived from the docstring (i.e. the :attr:`__doc__` attribute) of the object, and recursively of its documentable members. If there is no docstring, :mod:`pydoc` tries to obtain a description from the block of comment lines just above the definition of the class, function or method in the source file, or at the top of the module (see :func:`inspect.getcomments`).
es_pe: Para módulos, clases, funciones y métodos, la documentación mostrada es derivada del *docstring* (i.e. el atributo :attr:`__doc__`) del objeto, y recursivamente de sus miembros que se puedan documentar. Si no existe el *docstring*, :mod:`pydoc` trata de obtener una descripción del bloque de comentarios arriba de la definición de la clase, función o método en el archivo fuente, o encima del módulo (véase :func:`inspect.getcomments`).

source: The built-in function :func:`help` invokes the online help system in the interactive interpreter, which uses :mod:`pydoc` to generate its documentation as text on the console. The same text documentation can also be viewed from outside the Python interpreter by running :program:`pydoc` as a script at the operating system's command prompt. For example, running ::
es_pe: La función incorporada :func:`help` invoca el sistema de ayuda en línea en el interpretador interactivo, que usa :mod:`pydoc` para generar su documentación como texto en la consola. La misma documentación del texto se puede ver desde afuera del interpretador de python al ejecutar :program:`pydoc` como un script en la consola del sistema operativo. Por ejemplo, ejecutando ::

source: at a shell prompt will display documentation on the :mod:`sys` module, in a style similar to the manual pages shown by the Unix :program:`man` command. The argument to :program:`pydoc` can be the name of a function, module, or package, or a dotted reference to a class, method, or function within a module or module in a package. If the argument to :program:`pydoc` looks like a path (that is, it contains the path separator for your operating system, such as a slash in Unix), and refers to an existing Python source file, then documentation is produced for that file.
es_pe: en la entrada de la consola mostrará la documentación sobre el módulo :mod:`sys`, en un estilo similar a las páginas del manual que se muestran por el comando :program:`man` de Unix. El argumento de :program:`pydoc` puede ser el nombre de una función, módulo, o paquete, o una referencia con puntos (*dotted reference*) de una clase, método, o función dentro de un módulo o módulo en un paquete. Si el argumento de :program:`pydoc` se parece a una ruta (*path*) (es decir, que contiene el separador de rutas para tu sistema operativo como una barra en Unix), y hace referencia a un archivo fuente de Python existente, entonces se produce la documentación para ese archivo.

source: In order to find objects and their documentation, :mod:`pydoc` imports the module(s) to be documented. Therefore, any code on module level will be executed on that occasion. Use an ``if __name__ == '__main__':`` guard to only execute code when a file is invoked as a script and not just imported.
es_pe: Para encontrar los objetos y su documentación, :mod:`pydoc` importa el módulo o los módulos que serán documentados. Por lo tanto, cualquier código a nivel de módulo va a ser ejecutado en esa ocasión. Use ``if __name__=='__main__':`` como protección para sólo ejecutar código cuando un archivo es invocado como un script y no sólo importado.

source: When printing output to the console, :program:`pydoc` attempts to paginate the output for easier reading. If the :envvar:`PAGER` environment variable is set, :program:`pydoc` will use its value as a pagination program.
es_pe: Cuando se imprime la salida a la consola, :program:`pydoc` intenta paginar la salida para una lectura más fácil. Si la variable de entorno :envvar:`PAGER` está puesta, :program:`pydoc` usará su valor como el programa de paginación.

source: Specifying a ``-w`` flag before the argument will cause HTML documentation to be written out to a file in the current directory, instead of displaying text on the console.
es_pe: Especificar un bandera (*flag*) ``-w`` antes del argumento hará que la documentación HTML sea escrita en un archivo de la carpeta actual, en vez de mostrar el texto en la consola.

source: Specifying a ``-k`` flag before the argument will search the synopsis lines of all available modules for the keyword given as the argument, again in a manner similar to the Unix :program:`man` command. The synopsis line of a module is the first line of its documentation string.
es_pe: Especificar una bandera (*flag*) ``-k`` antes del argumento buscará las líneas de la sinopsis de todos los módulos disponibles por la palabra clave (*keyword*) dada como argumento, de nuevo en una manera similar al comando :program:`man` de Unix. La sinopsis de un módulo es la primera línea de su cadena de documentación.

source: When :program:`pydoc` generates documentation, it uses the current environment and path to locate modules. Thus, invoking :program:`pydoc spam` documents precisely the version of the module you would get if you started the Python interpreter and typed ``import spam``.
es_pe: Cuando :program:`pydoc` genera la documentación, se usa el entorno y ruta actual para localizar los módulos. Así, invocar :program:`pydoc spam` precisamente documenta la versión del módulo que tu obtendrías si empezaras el interpretador de Python y escribieras ``import spam``.

source: Module docs for core modules are assumed to reside in ``https://docs.python.org/X.Y/library/`` where ``X`` and ``Y`` are the major and minor version numbers of the Python interpreter. This can be overridden by setting the :envvar:`PYTHONDOCS` environment variable to a different URL or to a local directory containing the Library Reference Manual pages.
es_pe: Se asume que la documentación del módulos principales residen en ``https://docs.python.org/X.Y/library/`` donde ``X`` y ``Y`` son la versión mayor y menor de tu interpretador de Python. Esto puede ser sobre-escrito al poner a la variable de entorno :envvar:`PYTHONDOCS` una URL diferente o un directorio local conteniendo la páginas de referencia.

source: Added the ``-b`` option.
es_pe: Se añadió la opción ``-b``.

source: The ``-g`` command line option was removed.
es_pe: La opción de la línea de comandos ``-g`` se eliminó.

source: :mod:`pydoc` now uses :func:`inspect.signature` rather than :func:`inspect.getfullargspec` to extract signature information from callables.
es_pe: :mod:`pydoc` ahora usa :func:`inspect.signature` en vez de :func:`inspect.getfullargspec` para extraer la información distintiva de los invocables (*callables*).

source: Added the ``-n`` option.
es_pe: Se añadió la opción ``-n``.
