Repository: python/python-docs-es
Catalog: library/re.po
Languages: es

source: The index in *pattern* where compilation failed (may be ``None``).
es: El índice en *pattern* ("patrón") donde la compilación falló (puede ser ``None``).

source: The line corresponding to *pos* (may be ``None``).
es: La línea correspondiente a *pos* (puede ser ``None``).

source: The column corresponding to *pos* (may be ``None``).
es: La columna correspondiente a *pos* (puede ser ``None``).

source: Added additional attributes.
es: Se añadieron atributos adicionales.

source: Regular Expression Objects
es: Objetos expresión regular

source: Compiled regular expression objects support the following methods and attributes:
es: Los objetos expresión regular compilados soportan los siguientes métodos y atributos:

source: Scan through *string* looking for the first location where this regular expression produces a match, and return a corresponding :ref:`match object <match-objects>`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
es: Escanea a través de la *string* ("cadena") buscando la primera ubicación donde esta expresión regular produce una coincidencia, y retorna un :ref:`objeto match <match-objects>` correspondiente. Retorna ``None`` si ninguna posición en la cadena coincide con el patrón; notar que esto es diferente a encontrar una coincidencia de longitud cero en algún punto de la cadena.

source: The optional second parameter *pos* gives an index in the string where the search is to start; it defaults to ``0``. This is not completely equivalent to slicing the string; the ``'^'`` pattern character matches at the real beginning of the string and at positions just after a newline, but not necessarily at the index where the search is to start.
es: El segundo parámetro opcional *pos* proporciona un índice en la cadena donde la búsqueda debe comenzar; por defecto es ``0``. Esto no es completamente equivalente a dividir la cadena; el patrón de carácter ``'^'`` coincide en el inicio real de la cadena y en las posiciones justo después de una nueva línea, pero no necesariamente en el índice donde la búsqueda va a comenzar.

source: The optional parameter *endpos* limits how far the string will be searched; it will be as if the string is *endpos* characters long, so only the characters from *pos* to ``endpos - 1`` will be searched for a match. If *endpos* is less than *pos*, no match will be found; otherwise, if *rx* is a compiled regular expression object, ``rx.search(string, 0, 50)`` is equivalent to ``rx.search(string[:50], 0)``. ::
es: El parámetro opcional *endpos* limita hasta dónde se buscará la cadena; será como si la cadena fuera de *endpos* caracteres de largo, por lo que sólo se buscará una coincidencia entre los caracteres de *pos* a ``endpos - 1``. Si *endpos* es menor que *pos*, no se encontrará ninguna coincidencia; de lo contrario, si *rx* es un objeto de expresión regular compilado, ``rx.search(string, 0, 50)`` es equivalente a ``rx.search(string[:50], 0)``. ::

source: If zero or more characters at the *beginning* of *string* match this regular expression, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
es: Si cero o más caracteres en el *beginning* ("comienzo") de la *string* ("cadena") coinciden con esta expresión regular, retorna un :ref:`objeto match <match-objects>` correspondiente. Retorna ``None`` si la cadena no coincide con el patrón; notar que esto es diferente de una coincidencia de longitud cero.

source: The optional *pos* and *endpos* parameters have the same meaning as for the :meth:`~Pattern.search` method. ::
es: Los parámetros opcionales *pos* y *endpos* tienen el mismo significado que para el método :meth:`~Pattern.search`. ::

source: If you want to locate a match anywhere in *string*, use :meth:`~Pattern.search` instead (see also :ref:`search-vs-match`).
es: Si se quiere encontrar una coincidencia en cualquier lugar de *string*, utilizar :meth:`~Pattern.search` en su lugar (ver también :ref:`search-vs-match`).

source: If the whole *string* matches this regular expression, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
es: Si toda la *string* ("cadena") coincide con esta expresión regular, retorna un :ref:`objeto match <match-objects>` correspondiente. Retorna ``None`` si la cadena no coincide con el patrón; notar que esto es diferente de una coincidencia de longitud cero.

source: Identical to the :func:`split` function, using the compiled pattern.
es: Idéntico a la función :func:`split`, usando el patrón compilado.

source: Similar to the :func:`findall` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
es: Similar a la función :func:`findall`, usando el patrón compilado, pero también acepta parámetros opcionales *pos* y *endpos* que limitan la región de búsqueda como para :meth:`search`.

source: Similar to the :func:`finditer` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
es: Similar a la función :func:`finditer`, usando el patrón compilado, pero también acepta parámetros opcionales *pos* y *endpos* que limitan la región de búsqueda como para :meth:`search`.

source: Identical to the :func:`sub` function, using the compiled pattern.
es: Idéntico a la función :func:`sub`, usando el patrón compilado.

source: Identical to the :func:`subn` function, using the compiled pattern.
es: Idéntico a la función :func:`subn`, usando el patrón compilado.

source: The regex matching flags. This is a combination of the flags given to :func:`.compile`, any ``(?...)`` inline flags in the pattern, and implicit flags such as :data:`UNICODE` if the pattern is a Unicode string.
es: Los indicadores regex de coincidencia. Esta es una combinación de los indicadores dados a :func:`.compile`, cualquier indicador ``(?...)`` en línea en el patrón, y los indicadores implícitos como :data:`UNICODE` si el patrón es una cadena de Unicode.

source: The number of capturing groups in the pattern.
es: El número de grupos de captura en el patrón.

source: A dictionary mapping any symbolic group names defined by ``(?P<id>)`` to group numbers. The dictionary is empty if no symbolic groups were used in the pattern.
es: Un diccionario que mapea cualquier nombre de grupo simbólico definido por ``(?P<id>)`` para agrupar números. El diccionario está vacío si no se utilizaron grupos simbólicos en el patrón.

source: The pattern string from which the pattern object was compiled.
es: La cadena de patrones a partir de la cual el objeto de patrón fue compilado.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Compiled regular expression objects are considered atomic.
es: Se añadió el soporte de :func:`copy.copy` y :func:`copy.deepcopy`. Los objetos expresión regular compilados se consideran atómicos.

source: Match Objects
es: Objetos de coincidencia

source: Match objects always have a boolean value of ``True``. Since :meth:`~Pattern.match` and :meth:`~Pattern.search` return ``None`` when there is no match, you can test whether there was a match with a simple ``if`` statement::
es: Los objetos de coincidencia siempre tienen un valor booleano de ``True`` ("Verdadero"). Ya que :meth:`~Pattern.match` y :meth:`~Pattern.search` retornan ``None`` cuando no hay coincidencia. Se puede probar si hubo una coincidencia con una simple declaración ``if``::

source: Match objects support the following methods and attributes:
es: Los objetos de coincidencia admiten los siguientes métodos y atributos:

source: Return the string obtained by doing backslash substitution on the template string *template*, as done by the :meth:`~Pattern.sub` method. Escapes such as ``\n`` are converted to the appropriate characters, and numeric backreferences (``\1``, ``\2``) and named backreferences (``\g<1>``, ``\g<name>``) are replaced by the contents of the corresponding group.
es: Retorna la cadena obtenida al hacer la sustitución de la barra inversa en la cadena de la plantilla *template*, como se hace con el método :meth:`~Pattern.sub`. Escapes como ``\n`` son convertidos a los caracteres apropiados, y las referencias inversas numéricas (``\1``, ``\2``) y las referencias inversas con nombre (``\g<1>``, ``\g<name>``) son reemplazadas por el contenido del grupo correspondiente.

source: Returns one or more subgroups of the match. If there is a single argument, the result is a single string; if there are multiple arguments, the result is a tuple with one item per argument. Without arguments, *group1* defaults to zero (the whole match is returned). If a *groupN* argument is zero, the corresponding return value is the entire matching string; if it is in the inclusive range [1..99], it is the string matching the corresponding parenthesized group. If a group number is negative or larger than the number of groups defined in the pattern, an :exc:`IndexError` exception is raised. If a group is contained in a part of the pattern that did not match, the corresponding result is ``None``. If a group is contained in a part of the pattern that matched multiple times, the last match is returned. ::
es: Retorna uno o más subgrupos de la coincidencia. Si hay un solo argumento, el resultado es una sola cadena; si hay múltiples argumentos, el resultado es una tupla con un elemento por argumento. Sin argumentos, *group1* tiene un valor por defecto de cero (se retorna la coincidencia completa). Si un argumento *groupN* es cero, el valor de retorno correspondiente es toda la cadena coincidente; si está en el rango inclusivo [1..99], es la cadena coincidente con el grupo correspondiente entre paréntesis. Si un número de grupo es negativo o mayor que el número de grupos definidos en el patrón, se produce una excepción :exc:`IndexError`. Si un grupo está contenido en una parte del patrón que no coincidió, el resultado correspondiente es ``None``. Si un grupo está contenido en una parte del patrón que coincidió varias veces, se retorna la última coincidencia. ::

source: If the regular expression uses the ``(?P<name>...)`` syntax, the *groupN* arguments may also be strings identifying groups by their group name. If a string argument is not used as a group name in the pattern, an :exc:`IndexError` exception is raised.
es: Si la expresión regular usa la sintaxis ``(?P<name>...)``, los argumentos *groupN* también pueden ser cadenas que identifican a los grupos por su nombre de grupo. Si un argumento de cadena no se usa como nombre de grupo en el patrón, se produce una excepción :exc:`IndexError`.

source: A moderately complicated example::
es: Un ejemplo moderadamente complicado::

source: Named groups can also be referred to by their index::
es: Los grupos nombrados también pueden ser referidos por su índice::

source: If a group matches multiple times, only the last match is accessible::
es: Si un grupo coincide varias veces, sólo se puede acceder a la última coincidencia::

source: This is identical to ``m.group(g)``. This allows easier access to an individual group from a match::
es: Esto es idéntico a ``m.group(g)``. Esto permite un acceso más fácil a un grupo individual de una coincidencia::

source: Return a tuple containing all the subgroups of the match, from 1 up to however many groups are in the pattern. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``.
es: Retorna una tupla que contenga todos los subgrupos de la coincidencia, desde 1 hasta tantos grupos como haya en el patrón. El argumento *default* ("por defecto") se utiliza para los grupos que no participaron en la coincidencia; por defecto es ``None``.

source: For example::
es: Por ejemplo::

source: If we make the decimal place and everything after it optional, not all groups might participate in the match. These groups will default to ``None`` unless the *default* argument is given::
es: Si hacemos que el decimal y todo lo que sigue sea opcional, no todos los grupos podrían participar en la coincidencia. Estos grupos serán por defecto ``None`` a menos que se utilice el argumento *default*::

source: Return a dictionary containing all the *named* subgroups of the match, keyed by the subgroup name. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``. For example::
es: Retorna un diccionario que contiene todos los subgrupos *nombrados* de la coincidencia, tecleado por el nombre del subgrupo. El argumento *por defecto* se usa para los grupos que no participaron en la coincidencia; por defecto es ``None``. Por ejemplo::

source: Return the indices of the start and end of the substring matched by *group*; *group* defaults to zero (meaning the whole matched substring). Return ``-1`` if *group* exists but did not contribute to the match. For a match object *m*, and a group *g* that did contribute to the match, the substring matched by group *g* (equivalent to ``m.group(g)``) is ::
es: Retorna los índices del comienzo y el final de la subcadena coincidiendo con el *group*; el *group* por defecto es cero (es decir, toda la subcadena coincidente). Retorna ``-1`` si *grupo* existe pero no ha contribuido a la coincidencia. Para un objeto coincidente *m*, y un grupo *g* que sí contribuyó a la coincidencia, la subcadena coincidente con el grupo *g* (equivalente a ``m.group(g)``) es ::

source: Note that ``m.start(group)`` will equal ``m.end(group)`` if *group* matched a null string. For example, after ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` is 1, ``m.end(0)`` is 2, ``m.start(1)`` and ``m.end(1)`` are both 2, and ``m.start(2)`` raises an :exc:`IndexError` exception.
es: Notar que ``m.start(group)`` será igual a ``m.end(group)`` si *group* coincidió con una cadena nula. Por ejemplo, después de ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` es 1, ``m.end(0)`` es 2, ``m.start(1)`` y ``m.end(1)`` son ambos 2, y ``m.start(2)`` produce una excepción :exc:`IndexError`.

source: An example that will remove *remove_this* from email addresses::
es: Un ejemplo que eliminará *remove_this* ("quita esto") de las direcciones de correo electrónico::

source: For a match *m*, return the 2-tuple ``(m.start(group), m.end(group))``. Note that if *group* did not contribute to the match, this is ``(-1, -1)``. *group* defaults to zero, the entire match.
es: Para una coincidencia *m*, retorna la tupla-2 ``(m.inicio(grupo), m.fin(grupo))``. Notar que si *group* no contribuyó a la coincidencia, esto es ``(-1, -1)``. *group* por se convierte a cero para toda la coincidencia.

source: The value of *pos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string at which the RE engine started looking for a match.
es: El valor de *pos* que fue pasado al método :meth:`~Pattern.search` o :meth:`~Pattern.match` de un :ref:`objeto regex <re-objects>`. Este es el índice de la cadena en la que el motor RE comenzó a buscar una coincidencia.

source: The value of *endpos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string beyond which the RE engine will not go.
es: El valor de *endpos* que se pasó al método :meth:`~Pattern.search` o :meth:`~Pattern.match` de un :ref:`objeto regex <re-objects>`. Este es el índice de la cadena más allá de la cual el motor RE no irá.

source: The integer index of the last matched capturing group, or ``None`` if no group was matched at all. For example, the expressions ``(a)b``, ``((a)(b))``, and ``((ab))`` will have ``lastindex == 1`` if applied to the string ``'ab'``, while the expression ``(a)(b)`` will have ``lastindex == 2``, if applied to the same string.
es: El índice entero del último grupo de captura coincidente, o``None`` si no hay ningún grupo coincidente. Por ejemplo, las expresiones ``(a)b``, ``((a)(b))`` y ``((ab))`` tendrán ``lastindex == 1`` si se aplican a la cadena ``'ab'``, mientras que la expresión ``(a)(b)`` tendrá ``lastindex == 2``, si se aplica a la misma cadena.

source: The name of the last matched capturing group, or ``None`` if the group didn't have a name, or if no group was matched at all.
es: El nombre del último grupo capturador coincidente, o``None`` si el grupo no tenía nombre, o si no había ningún grupo coincidente.

source: The :ref:`regular expression object <re-objects>` whose :meth:`~Pattern.match` or :meth:`~Pattern.search` method produced this match instance.
es: El :ref:`objeto de expresión regular <re-objects>` cuyo método :meth:`~Pattern.match` o :meth:`~Pattern.search` produce esta instancia de coincidencia.

source: The string passed to :meth:`~Pattern.match` or :meth:`~Pattern.search`.
es: La cadena pasada a :meth:`~Pattern.match` o :meth:`~Pattern.search`.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Match objects are considered atomic.
es: Se añadió el soporte de :func:`copy.copy` y :func:`copy.deepcopy`. Los objetos de coincidencia se consideran atómicos.

source: Regular Expression Examples
es: Ejemplos de expresiones regulares

source: Checking for a Pair
es: Buscando un par

source: In this example, we'll use the following helper function to display match objects a little more gracefully::
es: En este ejemplo, se utilizará la siguiente función de ayuda para mostrar los objetos de coincidencia con un poco más de elegancia::

source: Suppose you are writing a poker program where a player's hand is represented as a 5-character string with each character representing a card, "a" for ace, "k" for king, "q" for queen, "j" for jack, "t" for 10, and "2" through "9" representing the card with that value.
es: Supongamos que se está escribiendo un programa de póquer en el que la mano de un jugador se representa como una cadena de 5 caracteres en la que cada carácter representa una carta, "a" para el as, "k" para el rey, "q" para la reina, "j" para la jota, "t" para el 10, y del " 2" al "9" representando la carta con ese valor.

source: To see if a given string is a valid hand, one could do the following::
es: Para ver si una cadena dada es una mano válida, se podría hacer lo siguiente::

source: That last hand, ``"727ak"``, contained a pair, or two of the same valued cards. To match this with a regular expression, one could use backreferences as such::
es: Esa última mano, ``"727ak"``, contenía un par, o dos de las mismas cartas de valor. Para igualar esto con una expresión regular, se podrían usar referencias inversas como tales::

source: To find out what card the pair consists of, one could use the :meth:`~Match.group` method of the match object in the following manner::
es: Para averiguar en qué carta consiste el par, se podría utilizar el método :meth:`~Match.group` del objeto de coincidencia de la siguiente manera::

source: Simulating scanf()
es: Simular scanf()

source: Python does not currently have an equivalent to :c:func:`scanf`. Regular expressions are generally more powerful, though also more verbose, than :c:func:`scanf` format strings. The table below offers some more-or-less equivalent mappings between :c:func:`scanf` format tokens and regular expressions.
es: Python no tiene actualmente un equivalente a :c:func:`scanf`. Las expresiones regulares son generalmente más poderosas, aunque también más verbosas, que las cadenas de formato :c:func:`scanf`. La tabla siguiente ofrece algunos mapeos más o menos equivalentes entre tokens de formato :c:func:`scanf` y expresiones regulares.

source: :c:func:`scanf` Token
es: Token :c:func:`scanf`

source: Regular Expression
es: Expresión regular

source: To extract the filename and numbers from a string like ::
es: Para extraer el nombre de archivo y los números de una cadena como ::

source: you would use a :c:func:`scanf` format like ::
es: se usaría un formato :c:func:`scanf` como ::

source: The equivalent regular expression would be ::
es: La expresión regular equivalente sería ::

source: Python offers two different primitive operations based on regular expressions: :func:`re.match` checks for a match only at the beginning of the string, while :func:`re.search` checks for a match anywhere in the string (this is what Perl does by default).
es: Python ofrece dos operaciones primitivas diferentes basadas en expresiones regulares: :func:`re.match` comprueba si hay una coincidencia sólo al principio de la cadena, mientras que :func:`re.search` comprueba si hay una coincidencia en cualquier parte de la cadena (esto es lo que hace Perl por defecto).

source: Regular expressions beginning with ``'^'`` can be used with :func:`search` to restrict the match at the beginning of the string::
es: Las expresiones regulares que comienzan con ``'^'`` pueden ser usadas con :func:`search` para restringir la coincidencia al principio de la cadena::

source: Note however that in :const:`MULTILINE` mode :func:`match` only matches at the beginning of the string, whereas using :func:`search` with a regular expression beginning with ``'^'`` will match at the beginning of each line. ::
es: Notar, sin embargo, que en el modo :const:`MULTILINE` :func:`match` sólo coincide al principio de la cadena, mientras que usando :func:`search` con una expresión regular que comienza con ``'^'`` coincidirá al principio de cada línea. ::

source: Making a Phonebook
es: Haciendo una guía telefónica

source: :func:`split` splits a string into a list delimited by the passed pattern. The method is invaluable for converting textual data into data structures that can be easily read and modified by Python as demonstrated in the following example that creates a phonebook.
es: :func:`split` divide una cadena en una lista delimitada por el patrón recibido. El método es muy útil para convertir datos textuales en estructuras de datos que pueden ser fácilmente leídas y modificadas por Python, como se demuestra en el siguiente ejemplo en el que se crea una guía telefónica.

source: First, here is the input. Normally it may come from a file, here we are using triple-quoted string syntax
es: Primero, aquí está la información. Normalmente puede venir de un archivo, aquí se usa la sintaxis de cadena de triple comilla

source: The entries are separated by one or more newlines. Now we convert the string into a list with each nonempty line having its own entry:
es: Las entradas (*entries*) están separadas por una o más líneas nuevas. Ahora se convierte la cadena en una lista en la que cada línea no vacía tiene su propia entrada:

source: Finally, split each entry into a list with first name, last name, telephone number, and address. We use the ``maxsplit`` parameter of :func:`split` because the address has spaces, our splitting pattern, in it:
es: Finalmente, se divide cada entrada en una lista con nombre, apellido, número de teléfono y dirección. Se utiliza el parámetro ``maxsplit`` (división máxima) de :func:`split` porque la dirección tiene espacios dentro del patrón de división:

source: The ``:?`` pattern matches the colon after the last name, so that it does not occur in the result list. With a ``maxsplit`` of ``4``, we could separate the house number from the street name:
es: El patrón ``:?`` coincide con los dos puntos después del apellido, de manera que no aparezca en la lista de resultados. Con ``maxsplit`` de ``4``, se podría separar el número de casa del nombre de la calle:

source: Text Munging
es: Mungear texto
