Repository: python/python-docs-es
Catalog: library/re.po
Languages: es

source: The module defines several functions, constants, and an exception. Some of the functions are simplified versions of the full featured methods for compiled regular expressions. Most non-trivial applications always use the compiled form.
es: El módulo define varias funciones, constantes y una excepción. Algunas de las funciones son versiones simplificadas de los métodos completos de las expresiones regulares compiladas. La mayoría de las aplicaciones no triviales utilizan siempre la forma compilada.

source: Flag constants are now instances of :class:`RegexFlag`, which is a subclass of :class:`enum.IntFlag`.
es: Ahora las constantes de indicadores son instancias de :class:`RegexFlag`, que es una subclase de :class:`enum.IntFlag`.

source: Compile a regular expression pattern into a :ref:`regular expression object <re-objects>`, which can be used for matching using its :func:`~Pattern.match`, :func:`~Pattern.search` and other methods, described below.
es: Compila un patrón de expresión regular en un :ref:`objeto de expresión regular <re-objects>`, que puede ser usado para las coincidencias usando :func:`~Pattern.match`, :func:`~Pattern.search` y otros métodos, descritos más adelante.

source: The expression's behaviour can be modified by specifying a *flags* value. Values can be any of the following variables, combined using bitwise OR (the ``|`` operator).
es: El comportamiento de la expresión puede modificarse especificando un valor de *indicadores*. Los valores pueden ser cualquiera de las siguientes variables, combinadas usando el operador OR (el operador ``|``).

source: The sequence ::
es: La secuencia ::

source: is equivalent to ::
es: es equivalente a ::

source: but using :func:`re.compile` and saving the resulting regular expression object for reuse is more efficient when the expression will be used several times in a single program.
es: pero usando :func:`re.compile` y guardando el objeto resultante de la expresión regular para su reutilización es más eficiente cuando la expresión será usada varias veces en un solo programa.

source: The compiled versions of the most recent patterns passed to :func:`re.compile` and the module-level matching functions are cached, so programs that use only a few regular expressions at a time needn't worry about compiling regular expressions.
es: Las versiones compiladas de los patrones más recientes pasaron a :func:`re.compile` y las funciones de coincidencia a nivel de módulo están en caché, así que los programas que usan sólo unas pocas expresiones regulares a la vez no tienen que preocuparse de compilar expresiones regulares.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns. Corresponds to the inline flag ``(?a)``.
es: Hace que ``\w``, ``\W``, ``\b``, ``\B``, ``\d``, ``\D``, ``\s`` y ``\S`` realicen una coincidencia ASCII en lugar de una concordancia Unicode. Esto sólo tiene sentido para los patrones de Unicode, y se ignora para los patrones de bytes. Corresponde al indicador en línea ``(?a)``.

source: Note that for backward compatibility, the :const:`re.U` flag still exists (as well as its synonym :const:`re.UNICODE` and its embedded counterpart ``(?u)``), but these are redundant in Python 3 since matches are Unicode by default for strings (and Unicode matching isn't allowed for bytes).
es: Notar que para la compatibilidad con versiones anteriores, el indicador :const:`re.U` todavía existe (así como su sinónimo :const:`re.UNICODE` y su contraparte incrustada ``(?u)``), pero estos son redundantes en Python 3 ya que las coincidencias son Unicode por defecto para las cadenas (y no se permite la coincidencia Unicode para los bytes).

source: Display debug information about compiled expression. No corresponding inline flag.
es: Muestra información de depuración (*debug*) sobre la expresión compilada. No hay un indicador en línea que corresponda.

source: Perform case-insensitive matching; expressions like ``[A-Z]`` will also match lowercase letters. Full Unicode matching (such as ``Ü`` matching ``ü``) also works unless the :const:`re.ASCII` flag is used to disable non-ASCII matches. The current locale does not change the effect of this flag unless the :const:`re.LOCALE` flag is also used. Corresponds to the inline flag ``(?i)``.
es: Realiza una coincidencia insensible a las mayúsculas y minúsculas; expresiones como ``[A-Z]`` también coincidirán con las minúsculas. La coincidencia completa de Unicode (como ``Ü`` coincidencia ``ü``) también funciona a menos que el indicador :const:`re.ASCII` se utilice para desactivar las coincidencias que no sean ASCII. La configuración regional vigente no cambia el efecto de este indicador a menos que también se use el indicador :const:`re.LOCALE`. Corresponde al indicador en línea ``(?i)``.

source: Note that when the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). If the :const:`ASCII` flag is used, only letters 'a' to 'z' and 'A' to 'Z' are matched.
es: Notar que cuando los patrones Unicode ``[a-z]`` o ``[A-Z]`` se usan en combinación con el indicador :const:`IGNORECASE``, coincidirán con las 52 letras ASCII y 4 letras adicionales no ASCII: 'İ' (U+0130, letra mayúscula latina I con punto arriba), 'ı' (U+0131, letra minúscula latina sin punto i), 'ſ' (U+017F, letra minúscula latina s larga) y 'K' (U+212A, signo Kelvin). Si se usa el indicador :const:`ASCII`, sólo las letras de la 'a' a la 'z' y de la 'A' a la 'Z' coinciden.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale. This flag can be used only with bytes patterns. The use of this flag is discouraged as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages. Corresponds to the inline flag ``(?L)``.
es: Hace que las coincidencias ``\w``, ``\W``, ``\b``, ``\B`` y las coincidencias insensibles a mayúsculas y minúsculas dependan de la configuración regional vigente. Este indicador sólo puede ser usado con patrones de bytes. Se desaconseja su uso ya que el mecanismo de configuración regional no es fiable, sólo maneja una "cultura" a la vez, y sólo funciona con localizaciones de 8 bits. La coincidencia Unicode ya está activada por defecto en Python 3 para los patrones Unicode (str), y es capaz de manejar diferentes localizaciones/idiomas. Corresponde al indicador en línea ``(?L)``.

source: :const:`re.LOCALE` can be used only with bytes patterns and is not compatible with :const:`re.ASCII`.
es: :const:`re.LOCALE` sólo se puede usar con patrones de bytes y no es compatible con :const:`re.ASCII`.

source: Compiled regular expression objects with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Only the locale at matching time affects the result of matching.
es: Los objetos expresión regular compilados con el indicador :const:`re.LOCALE` ya no dependen del lugar en el momento de la compilación. Sólo la configuración regional durante la coincidencia afecta al resultado obtenido.

source: When specified, the pattern character ``'^'`` matches at the beginning of the string and at the beginning of each line (immediately following each newline); and the pattern character ``'$'`` matches at the end of the string and at the end of each line (immediately preceding each newline). By default, ``'^'`` matches only at the beginning of the string, and ``'$'`` only at the end of the string and immediately before the newline (if any) at the end of the string. Corresponds to the inline flag ``(?m)``.
es: Cuando se especifica, el patrón de caracteres ``'^'`` coincide al principio de la cadena y al principio de cada línea (inmediatamente después de cada nueva línea); y el patrón de caracteres ``'$'`` coincide al final de la cadena y al final de cada línea (inmediatamente antes de cada nueva línea). Por defecto, ``'^'`` coincide sólo al principio de la cadena, y ``'$'`` sólo al final de la cadena e inmediatamente antes de la nueva línea (si la hay) al final de la cadena. Corresponde al indicador en línea ``(?m)``.

source: Make the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline. Corresponds to the inline flag ``(?s)``.
es: Hace que el carácter especial ``'.'`` coincida con cualquier carácter, incluyendo una nueva línea. Sin este indicador, ``'.'`` coincidirá con cualquier cosa, *excepto* con una nueva línea. Corresponde al indicador en línea ``(?s)``.

source: This flag allows you to write regular expressions that look nicer and are more readable by allowing you to visually separate logical sections of the pattern and add comments. Whitespace within the pattern is ignored, except when in a character class, or when preceded by an unescaped backslash, or within tokens like ``*?``, ``(?:`` or ``(?P<...>``. When a line contains a ``#`` that is not in a character class and is not preceded by an unescaped backslash, all characters from the leftmost such ``#`` through the end of the line are ignored.
es: Este indicador permite escribir expresiones regulares que se ven mejor y son más legibles al facilitar la separación visual de las secciones lógicas del patrón y añadir comentarios. Los espacios en blanco dentro del patrón se ignoran, excepto cuando están en una clase de caracteres, o cuando están precedidos por una barra inversa no escapada, o dentro de fichas como ``*?``, ``(?:`` o ``(?P<...>``. Cuando una línea contiene un ``#`` que no está en una clase de caracteres y no está precedida por una barra inversa no escapada, se ignoran todos los caracteres desde el más a la izquierda (como ``#``) hasta el final de la línea.

source: This means that the two following regular expression objects that match a decimal number are functionally equal::
es: Esto significa que los dos siguientes objetos expresión regular que coinciden con un número decimal son funcionalmente iguales::

source: Corresponds to the inline flag ``(?x)``.
es: Corresponde al indicador en línea ``(?x)``.

source: Scan through *string* looking for the first location where the regular expression *pattern* produces a match, and return a corresponding :ref:`match object <match-objects>`. Return ``None`` if no position in the string matches the pattern; note that this is different from finding a zero-length match at some point in the string.
es: Examina a través de la *string* ("cadena") buscando el primer lugar donde el *pattern* ("patrón") de la expresión regular produce una coincidencia, y retorna un :ref:`objeto match <match-objects>` correspondiente. Retorna ``None`` si ninguna posición en la cadena coincide con el patrón; notar que esto es diferente a encontrar una coincidencia de longitud cero en algún punto de la cadena.

source: If zero or more characters at the beginning of *string* match the regular expression *pattern*, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
es: Si cero o más caracteres al principio de la *string* ("cadena") coinciden con el *pattern* ("patrón") de la expresión regular, retorna un :ref:`objeto match <match-objects>` correspondiente. Retorna ``None`` si la cadena no coincide con el patrón; notar que esto es diferente de una coincidencia de longitud cero.

source: Note that even in :const:`MULTILINE` mode, :func:`re.match` will only match at the beginning of the string and not at the beginning of each line.
es: Notar que incluso en el modo :const:`MULTILINE`, :func:`re.match` sólo coincidirá al principio de la cadena y no al principio de cada línea.

source: If you want to locate a match anywhere in *string*, use :func:`search` instead (see also :ref:`search-vs-match`).
es: Si se quiere localizar una coincidencia en cualquier lugar de la *string* ("cadena"), se utiliza :func:`search` en su lugar (ver también :ref:`search-vs-match`).

source: If the whole *string* matches the regular expression *pattern*, return a corresponding :ref:`match object <match-objects>`. Return ``None`` if the string does not match the pattern; note that this is different from a zero-length match.
es: Si toda la *string* ("cadena") coincide con el *pattern* ("patrón") de la expresión regular, retorna un correspondiente :ref:`objeto match <match-objects>`. Retorna ``None`` si la cadena no coincide con el patrón; notar que esto es diferente de una coincidencia de longitud cero.

source: Split *string* by the occurrences of *pattern*. If capturing parentheses are used in *pattern*, then the text of all groups in the pattern are also returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits occur, and the remainder of the string is returned as the final element of the list. ::
es: Divide la *string* ("cadena") por el número de ocurrencias del *pattern* ("patrón"). Si se utilizan paréntesis de captura en *pattern*, entonces el texto de todos los grupos en el patrón también se retornan como parte de la lista resultante. Si *maxsplit* (máxima divisibilidad) es distinta de cero, como mucho se producen *maxsplit* divisiones, y el resto de la cadena se retorna como elemento final de la lista. ::

source: If there are capturing groups in the separator and it matches at the start of the string, the result will start with an empty string. The same holds for the end of the string::
es: Si hay grupos de captura en el separador y coincide al principio de la cadena, el resultado comenzará con una cadena vacía. Lo mismo ocurre con el final de la cadena::

source: That way, separator components are always found at the same relative indices within the result list.
es: De esa manera, los componentes de los separadores se encuentran siempre en los mismos índices relativos dentro de la lista de resultados.

source: Empty matches for the pattern split the string only when not adjacent to a previous empty match.
es: Las coincidencias vacías para el patrón dividen la cadena sólo cuando no están adyacentes a una coincidencia vacía anterior.

source: Added the optional flags argument.
es: Se añadió el argumento de los indicadores opcionales.

source: Added support of splitting on a pattern that could match an empty string.
es: Se añadió el soporte de la división en un patrón que podría coincidir con una cadena vacía.

source: Return all non-overlapping matches of *pattern* in *string*, as a list of strings. The *string* is scanned left-to-right, and matches are returned in the order found. If one or more groups are present in the pattern, return a list of groups; this will be a list of tuples if the pattern has more than one group. Empty matches are included in the result.
es: Retorna todas las coincidencias no superpuestas del *pattern* ("patrón") en la *string* ("cadena"), como una lista de cadenas. La cadena es examinada de izquierda a derecha, y las coincidencias son retornadas en el orden en que fueron encontradas. Si uno o más grupos están presentes en el patrón, retorna una lista de grupos; esta será una lista de tuplas si el patrón tiene más de un grupo. Las coincidencias vacías se incluyen en el resultado.

source: Non-empty matches can now start just after a previous empty match.
es: Las coincidencias no vacías ahora pueden empezar justo después de una coincidencia vacía anterior.

source: Return an :term:`iterator` yielding :ref:`match objects <match-objects>` over all non-overlapping matches for the RE *pattern* in *string*. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
es: Retorna un :term:`iterator` que produce :ref:`objetos de coincidencia <match-objects>` sobre todas las coincidencias no superpuestas para *pattern* ("patrón") de RE en la *string* ("cadena"). La *string* es examinada de izquierda a derecha, y las coincidencias son retornadas en el orden en que se encuentran. Las coincidencias vacías se incluyen en el resultado.

source: Return the string obtained by replacing the leftmost non-overlapping occurrences of *pattern* in *string* by the replacement *repl*. If the pattern isn't found, *string* is returned unchanged. *repl* can be a string or a function; if it is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes of ASCII letters are reserved for future use and treated as errors. Other unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by group 6 in the pattern. For example::
es: Retorna la cadena obtenida reemplazando las ocurrencias no superpuestas del *pattern* ("patrón") en la *string* ("cadena") por el reemplazo de *repl*. Si el patrón no se encuentra, se retorna *string* sin cambios. *repl* puede ser una cadena o una función; si es una cadena, cualquier barra inversa escapada en ella es procesada. Es decir, ``\n`` se convierte en un carácter de una sola línea nueva, ``\r`` se convierte en un retorno de carro, y así sucesivamente. Los escapes desconocidos de las letras ASCII se reservan para un uso futuro y se tratan como errores. Otros escapes desconocidos como ``\&`` no se utilizan. Las referencias inversas, como ``\6``, se reemplazan por la subcadena que corresponde al grupo 6 del patrón. Por ejemplo::

source: If *repl* is a function, it is called for every non-overlapping occurrence of *pattern*. The function takes a single :ref:`match object <match-objects>` argument, and returns the replacement string. For example::
es: Si *repl* es una función, se llama para cada ocurrencia no superpuesta de *pattern*. La función toma un solo argumento :ref:`objeto match <match-objects>`, y retorna la cadena de sustitución. Por ejemplo::

source: The pattern may be a string or a :ref:`pattern object <re-objects>`.
es: El patrón puede ser una cadena o un :ref:`objeto patrón <re-objects>`.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. If omitted or zero, all occurrences will be replaced. Empty matches for the pattern are replaced only when not adjacent to a previous empty match, so ``sub('x*', '-', 'abxd')`` returns ``'-a-b--d-'``.
es: El argumento opcional *count* ("recuento") es el número máximo de ocurrencias de patrones a ser reemplazados; *count* debe ser un número entero no negativo. Si se omite o es cero, todas las ocurrencias serán reemplazadas. Las coincidencias vacías del patrón se reemplazan sólo cuando no están adyacentes a una coincidencia vacía anterior, así que ``sub('x*', '-', 'abxd')`` retorna ``'-a-b--d-'``.

source: In string-type *repl* arguments, in addition to the character escapes and backreferences described above, ``\g<name>`` will use the substring matched by the group named ``name``, as defined by the ``(?P<name>...)`` syntax. ``\g<number>`` uses the corresponding group number; ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement such as ``\g<2>0``. ``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``. The backreference ``\g<0>`` substitutes in the entire substring matched by the RE.
es: En los argumentos *repl* de tipo cadena, además de los escapes de caracteres y las referencias inversas descritas anteriormente, ``\g<name>`` usará la subcadena coincidente con el grupo llamado ``name``, como se define en la sintaxis ``(?P<name>...)``. ``\g<number>`` utiliza el número de grupo correspondiente; ``\g<2>`` es por lo tanto equivalente a ``\2``, pero no es ambiguo en un reemplazo como sucede con ``\g<2>0``. ``\20`` se interpretaría como una referencia al grupo 20, no como una referencia al grupo 2 seguido del carácter literal ``'0'``. La referencia inversa ``\g<0>`` sustituye en toda la subcadena coincidente con la RE.

source: Unmatched groups are replaced with an empty string.
es: Los grupos no coincidentes son reemplazados por una cadena vacía.

source: Unknown escapes in *pattern* consisting of ``'\'`` and an ASCII letter now are errors.
es: Los escapes desconocidos en el *pattern* que consisten en ``'\'`` y una letra ASCII ahora son errores.

source: Unknown escapes in *repl* consisting of ``'\'`` and an ASCII letter now are errors.
es: Los escapes desconocidos en *repl* que consisten en ``'\'`` y una letra ASCII ahora son errores.

source: Empty matches for the pattern are replaced when adjacent to a previous non-empty match.
es: Las coincidencias vacías para el patrón se reemplazan cuando están adyacentes a una coincidencia anterior no vacía.

source: Perform the same operation as :func:`sub`, but return a tuple ``(new_string, number_of_subs_made)``.
es: Realiza la misma operación que :func:`sub`, pero retorna una tupla ``(new_string, number_of_subs_made)``.

source: Escape special characters in *pattern*. This is useful if you want to match an arbitrary literal string that may have regular expression metacharacters in it. For example::
es: Caracteres de escape especiales en *pattern* (" patrón"). Esto es útil si quieres hacer coincidir una cadena literal arbitraria que puede tener metacaracteres de expresión regular en ella. Por ejemplo::

source: This function must not be used for the replacement string in :func:`sub` and :func:`subn`, only backslashes should be escaped. For example::
es: Esta función no debe usarse para la cadena de reemplazo en :func:`sub` y :func:`subn`, sólo deben escaparse las barras inversas. Por ejemplo::

source: The ``'_'`` character is no longer escaped.
es: El carácter de ``'_'`` ya no se escapa.

source: Only characters that can have special meaning in a regular expression are escaped. As a result, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, and ``"`"`` are no longer escaped.
es: Sólo se escapan los caracteres que pueden tener un significado especial en una expresión regular. Como resultado, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'`` y ``"`"`` ya no se escapan.

source: Clear the regular expression cache.
es: Despeja la caché de expresión regular.

source: Exception raised when a string passed to one of the functions here is not a valid regular expression (for example, it might contain unmatched parentheses) or when some other error occurs during compilation or matching. It is never an error if a string contains no match for a pattern. The error instance has the following additional attributes:
es: Excepción señalada cuando una cadena enviada a una de las funciones descritas aquí no es una expresión regular válida (por ejemplo, podría contener paréntesis no coincidentes) o cuando se produce algún otro error durante la compilación o la coincidencia. Nunca es un error si una cadena no contiene ninguna coincidencia para un patrón. La instancia de error tiene los siguientes atributos adicionales:

source: The unformatted error message.
es: El mensaje de error sin formato.

source: The regular expression pattern.
es: El patrón de expresión regular.
