Repository: python/python-docs-es
Catalog: library/re.po
Languages: es

source: :func:`sub` replaces every occurrence of a pattern with a string or the result of a function. This example demonstrates using :func:`sub` with a function to "munge" text, or randomize the order of all the characters in each word of a sentence except for the first and last characters::
es: :func:`sub` reemplaza cada ocurrencia de un patrón con una cadena o el resultado de una función. Este ejemplo demuestra el uso de :func:`sub` con una función para "mungear" (*munge*) el texto, o aleatorizar el orden de todos los caracteres en cada palabra de una frase excepto el primer y último carácter::

source: Finding all Adverbs
es: Encontrar todos los adverbios

source: :func:`findall` matches *all* occurrences of a pattern, not just the first one as :func:`search` does. For example, if a writer wanted to find all of the adverbs in some text, they might use :func:`findall` in the following manner::
es: :func:`findall` coincide con *todas* las ocurrencias de un patrón, no sólo con la primera, como lo hace :func:`search`. Por ejemplo, si un escritor quisiera encontrar todos los adverbios en algún texto, podría usar :func:`findall` de la siguiente manera::

source: Finding all Adverbs and their Positions
es: Encontrar todos los adverbios y sus posiciones

source: If one wants more information about all matches of a pattern than the matched text, :func:`finditer` is useful as it provides :ref:`match objects <match-objects>` instead of strings. Continuing with the previous example, if a writer wanted to find all of the adverbs *and their positions* in some text, they would use :func:`finditer` in the following manner::
es: Si uno quiere más información sobre todas las coincidencias de un patrón en lugar del texto coincidente, :func:`finditer` es útil ya que proporciona :ref:`objetos de coincidencia <match-objects>` en lugar de cadenas. Continuando con el ejemplo anterior, si un escritor quisiera encontrar todos los adverbios *y sus posiciones* en algún texto, usaría :func:`finditer` de la siguiente manera::

source: Raw String Notation
es: Notación de cadena *raw*

source: Raw string notation (``r"text"``) keeps regular expressions sane. Without it, every backslash (``'\'``) in a regular expression would have to be prefixed with another one to escape it. For example, the two following lines of code are functionally identical::
es: La notación de cadena *raw* (``r "text"``) permite escribir expresiones regulares razonables. Sin ella, para "escapar" cada barra inversa (``'\'``) en una expresión regular tendría que ser precedida por otra. Por ejemplo, las dos siguientes líneas de código son funcionalmente idénticas::

source: When one wants to match a literal backslash, it must be escaped in the regular expression. With raw string notation, this means ``r"\\"``. Without raw string notation, one must use ``"\\\\"``, making the following lines of code functionally identical::
es: Cuando uno quiere igualar una barra inversa literal, debe escaparse en la expresión regular. Con la notación de cadena *raw*, esto significa ``r"\\"``. Sin la notación de cadena, uno debe usar ``"\\\\"``, haciendo que las siguientes líneas de código sean funcionalmente idénticas::

source: Writing a Tokenizer
es: Escribir un Tokenizador

source: A `tokenizer or scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyzes a string to categorize groups of characters. This is a useful first step in writing a compiler or interpreter.
es: Un `tokenizador o analizador léxico <https://es.wikipedia.org/wiki/Analizador_léxico>`_ analiza una cadena para categorizar grupos de caracteres. Este es un primer paso útil para escribir un compilador o intérprete.

source: The text categories are specified with regular expressions. The technique is to combine those into a single master regular expression and to loop over successive matches::
es: Las categorías de texto se especifican con expresiones regulares. La técnica consiste en combinarlas en una única expresión regular maestra y en hacer un bucle sobre las sucesivas coincidencias::

source: The tokenizer produces the following output::
es: El tokenizador produce el siguiente resultado::

source: Friedl, Jeffrey. Mastering Regular Expressions. 3rd ed., O'Reilly Media, 2009. The third edition of the book no longer covers Python at all, but the first edition covered writing good regular expression patterns in great detail.
es: Friedl, Jeffrey. *Mastering Regular Expressions*. 3a ed., O'Reilly Media, 2009. La tercera edición del libro ya no abarca a Python en absoluto, pero la primera edición cubría la escritura de buenos patrones de expresiones regulares con gran detalle.
