Repository: python/python-docs-es
Catalog: library/re.po
Languages: es

source: Matches whatever regular expression is inside the parentheses, and indicates the start and end of a group; the contents of a group can be retrieved after a match has been performed, and can be matched later in the string with the ``\number`` special sequence, described below. To match the literals ``'('`` or ``')'``, use ``\(`` or ``\)``, or enclose them inside a character class: ``[(]``, ``[)]``.
es: Coincide con cualquier expresión regular que esté dentro de los paréntesis, e indica el comienzo y el final de un grupo; el contenido de un grupo puede ser recuperado después de que se haya realizado una coincidencia, y puede coincidir más adelante en la cadena con la secuencia especial ``\number``, que se describe más adelante. Para hacer coincidir los literales ```'('`` o ``')'``, se usa ``\(`` o ``\)``, o se envuelve dentro de una clase de caracteres: ``[(]``, ``[)]``.

source: This is an extension notation (a ``'?'`` following a ``'('`` is not meaningful otherwise). The first character after the ``'?'`` determines what the meaning and further syntax of the construct is. Extensions usually do not create a new group; ``(?P<name>...)`` is the only exception to this rule. Following are the currently supported extensions.
es: Esta es una notación de extensión (un ``'?'`` después de un ``'('`` no tiene ningún otro significado). El primer carácter después de ``'?'`` determina el significado y la sintaxis de la construcción. Las extensiones normalmente no crean un nuevo grupo; ``(?P<name>…)`` es la única excepción a esta regla. A continuación se muestran las extensiones actualmente soportadas.

source: (One or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) The group matches the empty string; the letters set the corresponding flags: :const:`re.A` (ASCII-only matching), :const:`re.I` (ignore case), :const:`re.L` (locale dependent), :const:`re.M` (multi-line), :const:`re.S` (dot matches all), :const:`re.U` (Unicode matching), and :const:`re.X` (verbose), for the entire regular expression. (The flags are described in :ref:`contents-of-module-re`.) This is useful if you wish to include the flags as part of the regular expression, instead of passing a *flag* argument to the :func:`re.compile` function. Flags should be used first in the expression string.
es: (Una o más letras del conjunto ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``.) El grupo coincide con la cadena vacía; las letras ponen los indicadores correspondientes: :const:`re.A` (coincidencia sólo en ASCII), :const:`re.I` (ignorar mayúsculas o minúsculas), :const:`re. L` (dependiente de la configuración regional), :const:`re.M` (multilínea), :const:`re.S` (el punto coincide con todo), :const:`re.U` (coincidencia con Unicode), y :const:`re.X` (modo *verbose*), para toda la expresión regular. (Los indicadores se describen en :ref:`contents-of-module-re`.) Esto es útil si se desea incluir los indicadores como parte de la expresión regular, en lugar de pasar un argumento *flag* (indicador) a la función :func:`re.compile`. Los indicadores deben ser usados primero en la cadena de expresión.

source: A non-capturing version of regular parentheses. Matches whatever regular expression is inside the parentheses, but the substring matched by the group *cannot* be retrieved after performing a match or referenced later in the pattern.
es: Una versión no capturable de los paréntesis regulares. Hace coincidir cualquier expresión regular que esté dentro de los paréntesis, pero la subcadena coincidente con el grupo *no puede* ser recuperada después de realizar una coincidencia o referenciada más adelante en el patrón.

source: (Zero or more letters from the set ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, optionally followed by ``'-'`` followed by one or more letters from the ``'i'``, ``'m'``, ``'s'``, ``'x'``.) The letters set or remove the corresponding flags: :const:`re.A` (ASCII-only matching), :const:`re.I` (ignore case), :const:`re.L` (locale dependent), :const:`re.M` (multi-line), :const:`re.S` (dot matches all), :const:`re.U` (Unicode matching), and :const:`re.X` (verbose), for the part of the expression. (The flags are described in :ref:`contents-of-module-re`.)
es: (Cero o más letras del conjunto ``'a'``, ``'i'``, ``'L'``, ``'m'``, ``'s'``, ``'u'``, ``'x'``, opcionalmente seguido de ``'-'`` seguido de una o más letras de ``'i'``, ``'m'``, ``'s'``, ``'x'``.) Las letras ponen o quitan los indicadores correspondientes: :const:`re.A` (coincidencia sólo en ASCII), :const:`re.I` (ignorar mayúsculas o minúsculas), :const:`re. L` (dependiente de la configuración regional), :const:`re.M` (multilínea), :const:`re.S` (el punto coincide con todo), :const:`re.U` (coincidencia con Unicode), y :const:`re.X` (modo *verbose*) para la parte de la expresión. (Los indicadores se describen en :ref:`contents-of-module-re`.)

source: The letters ``'a'``, ``'L'`` and ``'u'`` are mutually exclusive when used as inline flags, so they can't be combined or follow ``'-'``. Instead, when one of them appears in an inline group, it overrides the matching mode in the enclosing group. In Unicode patterns ``(?a:...)`` switches to ASCII-only matching, and ``(?u:...)`` switches to Unicode matching (default). In byte pattern ``(?L:...)`` switches to locale depending matching, and ``(?a:...)`` switches to ASCII-only matching (default). This override is only in effect for the narrow inline group, and the original matching mode is restored outside of the group.
es: Las letras ``'a'``, ``'L'`` y ``'u'`` se excluyen mutuamente cuando se usan como indicadores en línea, así que no pueden combinarse o ser seguidos por ``'-'``. En cambio, cuando uno de ellos aparece en un grupo dentro de la línea, anula el modo de coincidencia en el grupo que lo rodea. En los patrones Unicode, ``(?a:…)`` cambia al modo de concordancia sólo en ASCII, y ``(?u:…)`` cambia al modo de concordancia Unicode (por defecto). En el patrón de bytes ``(?L:…)`` se cambia a una correspondencia en función de la configuración regional, y ``(?a:…)`` se cambia a una correspondencia sólo en ASCII (predeterminado). Esta anulación sólo tiene efecto para el grupo de línea restringida, y el modo de coincidencia original se restaura fuera del grupo.

source: The letters ``'a'``, ``'L'`` and ``'u'`` also can be used in a group.
es: Las letras ``'a'``, ``'L'`` y ``'u'`` también pueden ser usadas en un grupo.

source: Similar to regular parentheses, but the substring matched by the group is accessible via the symbolic group name *name*. Group names must be valid Python identifiers, and each group name must be defined only once within a regular expression. A symbolic group is also a numbered group, just as if the group were not named.
es: Similar a los paréntesis regulares, pero la subcadena coincidente con el grupo es accesible a través del nombre simbólico del grupo, *name* . Los nombres de grupo deben ser identificadores válidos de Python, y cada nombre de grupo debe ser definido sólo una vez dentro de una expresión regular. Un grupo simbólico es también un grupo numerado, del mismo modo que si el grupo no tuviera nombre.

source: Named groups can be referenced in three contexts. If the pattern is ``(?P<quote>['"]).*?(?P=quote)`` (i.e. matching a string quoted with either single or double quotes):
es: Los grupos con nombre pueden ser referenciados en tres contextos. Si el patrón es ``(?P<quote>['"]).*?(?P=quote)`` (es decir, hacer coincidir una cadena citada con comillas simples o dobles):

source: Context of reference to group "quote"
es: Contexto de la referencia al grupo *quote* (cita)

source: Ways to reference it
es: Formas de hacer referencia

source: in the same pattern itself
es: en el mismo patrón en sí mismo

source: ``(?P=quote)`` (as shown)
es: ``(?P=quote)`` (como se muestra)

source: when processing match object *m*
es: cuando se procesa el objeto de la coincidencia *m*

source: in a string passed to the *repl* argument of ``re.sub()``
es: en una cadena pasada al argumento *repl* de ``re.sub()``

source: A backreference to a named group; it matches whatever text was matched by the earlier group named *name*.
es: Una referencia inversa a un grupo nombrado; coincide con cualquier texto correspondido por el grupo anterior llamado *name*.

source: A comment; the contents of the parentheses are simply ignored.
es: Un comentario; el contenido de los paréntesis es simplemente ignorado.

source: Matches if ``...`` matches next, but doesn't consume any of the string. This is called a :dfn:`lookahead assertion`. For example, ``Isaac (?=Asimov)`` will match ``'Isaac '`` only if it's followed by ``'Asimov'``.
es: Coincide si ``…`` coincide con el siguiente patrón, pero no procesa nada de la cadena. Esto se llama una :dfn:`lookahead assertion` (aserción de búsqueda anticipada). Por ejemplo, ``Isaac (?=Asimov)`` coincidirá con ``'Isaac '`` sólo si va seguido de ``'Asimov'``.

source: Matches if ``...`` doesn't match next. This is a :dfn:`negative lookahead assertion`. For example, ``Isaac (?!Asimov)`` will match ``'Isaac '`` only if it's *not* followed by ``'Asimov'``.
es: Coincide si ``…`` no coincide con el siguiente. Esta es una :dfn:`negative lookahead assertion` (aserción negativa de búsqueda anticipada). Por ejemplo, ``Isaac (?!Asimov)`` coincidirá con ``'Isaac '`` sólo si *no* es seguido por ``'Asimov'``.

source: Matches if the current position in the string is preceded by a match for ``...`` that ends at the current position. This is called a :dfn:`positive lookbehind assertion`. ``(?<=abc)def`` will find a match in ``'abcdef'``, since the lookbehind will back up 3 characters and check if the contained pattern matches. The contained pattern must only match strings of some fixed length, meaning that ``abc`` or ``a|b`` are allowed, but ``a*`` and ``a{3,4}`` are not. Note that patterns which start with positive lookbehind assertions will not match at the beginning of the string being searched; you will most likely want to use the :func:`search` function rather than the :func:`match` function:
es: Coincide si la posición actual en la cadena es precedida por una coincidencia para ``…`` que termina en la posición actual. Esto se llama una :dfn:`positive lookbehind assertion` (aserciones positivas de búsqueda tardía). ``(?<=abc)def`` encontrará una coincidencia en ``'abcdef'``, ya que la búsqueda tardía hará una copia de seguridad de 3 caracteres y comprobará si el patrón contenido coincide. El patrón contenido sólo debe coincidir con cadenas de alguna longitud fija, lo que significa que ``abc`` o ``a|b`` están permitidas, pero ``a*`` y ``a{3,4}`` no lo están. Hay que tener en cuenta que los patrones que empiezan con aserciones positivas de búsqueda tardía no coincidirán con el principio de la cadena que se está buscando; lo más probable es que se quiera usar la función :func:`search` en lugar de la función :func:`match`:

source: This example looks for a word following a hyphen:
es: Este ejemplo busca una palabra seguida de un guión:

source: Added support for group references of fixed length.
es: Se añadió soporte a las referencias de grupo de longitud fija.

source: Matches if the current position in the string is not preceded by a match for ``...``. This is called a :dfn:`negative lookbehind assertion`. Similar to positive lookbehind assertions, the contained pattern must only match strings of some fixed length. Patterns which start with negative lookbehind assertions may match at the beginning of the string being searched.
es: Coincide si la posición actual en la cadena no está precedida por una coincidencia de "…". Esto se llama una :dfn:`negative lookbehind assertion` (Aserciones negativas de búsqueda tardía). Similar a las aserciones positivas de búsqueda tardía, el patrón contenido sólo debe coincidir con cadenas de alguna longitud fija. Los patrones que empiezan con aserciones negativas pueden coincidir al principio de la cadena que se busca.

source: Will try to match with ``yes-pattern`` if the group with given *id* or *name* exists, and with ``no-pattern`` if it doesn't. ``no-pattern`` is optional and can be omitted. For example, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` is a poor email matching pattern, which will match with ``'<user@host.com>'`` as well as ``'user@host.com'``, but not with ``'<user@host.com'`` nor ``'user@host.com>'``.
es: Tratará de coincidir con el ``yes-pattern`` (con patrón) si el grupo con un *id* o *nombre* existe, y con el ``no-pattern`` (sin patrón) si no existe. El ``no-pattern`` es opcional y puede ser omitido. Por ejemplo, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>||$)`` es un patrón de coincidencia de correo electrónico deficiente, ya que coincidirá con ``'<user@host.com>'`` así como con ``'user@host.com'``, pero no con ``'<user@host.com'`` ni con ``'user@host.com>'``.

source: The special sequences consist of ``'\'`` and a character from the list below. If the ordinary character is not an ASCII digit or an ASCII letter, then the resulting RE will match the second character. For example, ``\$`` matches the character ``'$'``.
es: Las secuencias especiales consisten en ``'\'`` y un carácter de la lista que aparece más adelante. Si el carácter ordinario no es un dígito ASCII o una letra ASCII, entonces el RE resultante coincidirá con el segundo carácter. Por ejemplo, ``\$`` coincide con el carácter ``'$'``.

source: Matches the contents of the group of the same number. Groups are numbered starting from 1. For example, ``(.+) \1`` matches ``'the the'`` or ``'55 55'``, but not ``'thethe'`` (note the space after the group). This special sequence can only be used to match one of the first 99 groups. If the first digit of *number* is 0, or *number* is 3 octal digits long, it will not be interpreted as a group match, but as the character with octal value *number*. Inside the ``'['`` and ``']'`` of a character class, all numeric escapes are treated as characters.
es: Coincide con el contenido del grupo del mismo número. Los grupos se numeran empezando por el 1. Por ejemplo, ``(.+) \1`` coincide con ``'el el'`` o ``'55 55'``, pero no con ``'elel'`` (notar el espacio después del grupo). Esta secuencia especial sólo puede ser usada para hacer coincidir uno de los primeros 99 grupos. Si el primer dígito del *número* es 0, o el *número* tiene 3 dígitos octales, no se interpretará como una coincidencia de grupo, sino como el carácter con valor octal *número*. Dentro de los ``'['`` y ``']'`` de una clase de caracteres, todos los escapes numéricos son tratados como caracteres.

source: Matches only at the start of the string.
es: Coincide sólo al principio de la cadena.

source: Matches the empty string, but only at the beginning or end of a word. A word is defined as a sequence of word characters. Note that formally, ``\b`` is defined as the boundary between a ``\w`` and a ``\W`` character (or vice versa), or between ``\w`` and the beginning/end of the string. This means that ``r'\bfoo\b'`` matches ``'foo'``, ``'foo.'``, ``'(foo)'``, ``'bar foo baz'`` but not ``'foobar'`` or ``'foo3'``.
es: Coincide con la cadena vacía, pero sólo al principio o al final de una palabra. Una palabra se define como una secuencia de caracteres de palabras. Notar que formalmente, ``\b`` se define como el límite entre un carácter ``\w`` y un carácter ``\W`` (o viceversa), o entre ``\w`` y el principio/fin de la cadena. Esto significa que ``r'\bfoo\b'`` coincide con ``'foo'``, ``'foo.'``, ``'(foo)'``, ``'bar foo baz'`` pero no ``'foobar'`` o ``'foo3'``.

source: By default Unicode alphanumerics are the ones used in Unicode patterns, but this can be changed by using the :const:`ASCII` flag. Word boundaries are determined by the current locale if the :const:`LOCALE` flag is used. Inside a character range, ``\b`` represents the backspace character, for compatibility with Python's string literals.
es: Por defecto, los alfanuméricos Unicode son los que se usan en los patrones Unicode, pero esto se puede cambiar usando el indicador :const:`ASCII`. Los límites de las palabras están determinados por la configuración regional actual si se usa el indicador :const:`LOCALE`. Dentro de un rango de caracteres, ``\b`` representa el carácter de retroceso (*backspace*), para compatibilidad con los literales de las cadenas de Python.

source: Matches the empty string, but only when it is *not* at the beginning or end of a word. This means that ``r'py\B'`` matches ``'python'``, ``'py3'``, ``'py2'``, but not ``'py'``, ``'py.'``, or ``'py!'``. ``\B`` is just the opposite of ``\b``, so word characters in Unicode patterns are Unicode alphanumerics or the underscore, although this can be changed by using the :const:`ASCII` flag. Word boundaries are determined by the current locale if the :const:`LOCALE` flag is used.
es: Coincide con la cadena vacía, pero sólo cuando *no* está al principio o al final de una palabra. Esto significa que ``r'py\B'`` coincide con ``'python'``, ``'py3'``, ``'py2'``, pero no con ``'py'``, ``'py.'`` o ``'py!'``. ``\B`` es justo lo opuesto a ``\b``, por lo que los caracteres de las palabras en los patrones de Unicode son alfanuméricos o el subrayado, aunque esto puede ser cambiado usando el indicador :const:`ASCII`. Los límites de las palabras están determinados por la configuración regional actual si se usa el indicador :const:`LOCALE`.

source: For Unicode (str) patterns:
es: Para los patrones de Unicode (str):

source: Matches any Unicode decimal digit (that is, any character in Unicode character category [Nd]). This includes ``[0-9]``, and also many other digit characters. If the :const:`ASCII` flag is used only ``[0-9]`` is matched.
es: Coincide con cualquier dígito decimal de Unicode (es decir, cualquier carácter de la categoría de caracteres de Unicode [Nd]). Esto incluye a ``[0-9]``, y también muchos otros caracteres de dígitos. Si se usa el indicador :const:`ASCII`, sólo coincide con ``[0-9]``.

source: For 8-bit (bytes) patterns:
es: Para patrones de 8 bits (bytes):

source: Matches any decimal digit; this is equivalent to ``[0-9]``.
es: Coincide con cualquier dígito decimal; esto equivale a ``[0-9]``.

source: Matches any character which is not a decimal digit. This is the opposite of ``\d``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^0-9]``.
es: Coincide con cualquier carácter que no sea un dígito decimal. Esto es lo opuesto a ``\d``. Si se usa el indicador :const:`ASCII` esto se convierte en el equivalente a ``[^0-9]``.

source: Matches Unicode whitespace characters (which includes ``[ \t\n\r\f\v]``, and also many other characters, for example the non-breaking spaces mandated by typography rules in many languages). If the :const:`ASCII` flag is used, only ``[ \t\n\r\f\v]`` is matched.
es: Coincide con los caracteres de los espacios en blanco de Unicode (que incluye ``[ \t\n\r\f\v]``, y también muchos otros caracteres, por ejemplo los espacios duros exigidos por las reglas tipográficas en muchos idiomas). Si se usa el indicador :const:`ASCII``, sólo ``[ \t\n\r\f\v]`` coincide.

source: Matches characters considered whitespace in the ASCII character set; this is equivalent to ``[ \t\n\r\f\v]``.
es: Coincide con los caracteres considerados como espacios en blanco en el conjunto de caracteres ASCII, lo que equivale a ``[ \t\n\r\f\v]``.

source: Matches any character which is not a whitespace character. This is the opposite of ``\s``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^ \t\n\r\f\v]``.
es: Coincide con cualquier carácter que no sea un carácter de espacio en blanco. Esto es lo opuesto a ``\s``. Si se usa el indicador :const:`ASCII` se convierte en el equivalente a `[^ \t\n\r\f\v]`.

source: Matches Unicode word characters; this includes most characters that can be part of a word in any language, as well as numbers and the underscore. If the :const:`ASCII` flag is used, only ``[a-zA-Z0-9_]`` is matched.
es: Coincide con los caracteres de palabras de Unicode; esto incluye la mayoría de los caracteres que pueden formar parte de una palabra en cualquier idioma, así como los números y el guión bajo. Si se usa el indicador :const:`ASCII`, sólo coincide con ``[a-zA-Z0-9_]``.

source: Matches characters considered alphanumeric in the ASCII character set; this is equivalent to ``[a-zA-Z0-9_]``. If the :const:`LOCALE` flag is used, matches characters considered alphanumeric in the current locale and the underscore.
es: Coincide con los caracteres considerados alfanuméricos en el conjunto de caracteres ASCII; esto equivale a ``[a-zA-Z0-9_]``. Si se usa el indicador :const:`LOCALE`, coincide con los caracteres considerados alfanuméricos en la configuración regional actual y el guión bajo.

source: Matches any character which is not a word character. This is the opposite of ``\w``. If the :const:`ASCII` flag is used this becomes the equivalent of ``[^a-zA-Z0-9_]``. If the :const:`LOCALE` flag is used, matches characters which are neither alphanumeric in the current locale nor the underscore.
es: Coincide con cualquier carácter que no sea un carácter de una palabra. Esto es lo opuesto a ``\w``. Si se usa el indicador :const:`ASCII` esto se convierte en el equivalente a ``[^a-zA-Z0-9_]``. Si se usa el indicador :const:`LOCALE`, coincide con los caracteres que no son ni alfanuméricos en la configuración regional actual ni con el guión bajo.

source: Matches only at the end of the string.
es: Coincide sólo el final de la cadena.

source: Most of the standard escapes supported by Python string literals are also accepted by the regular expression parser::
es: La mayoría de los escapes estándar soportados por los literales de la cadena de Python también son aceptados por el analizador de expresiones regulares::

source: (Note that ``\b`` is used to represent word boundaries, and means "backspace" only inside character classes.)
es: (Notar que ``\b`` se usa para representar los límites de las palabras, y significa "retroceso" (*backspace*) sólo dentro de las clases de caracteres.)

source: ``'\u'``, ``'\U'``, and ``'\N'`` escape sequences are only recognized in Unicode patterns. In bytes patterns they are errors. Unknown escapes of ASCII letters are reserved for future use and treated as errors.
es: Las secuencias de escape ``'\u'``, ``'\U'`` y ``'\N'`` sólo se reconocen en los patrones Unicode. En los patrones de bytes son errores. Los escapes desconocidos de las letras ASCII se reservan para su uso posterior y se consideran errores.

source: Octal escapes are included in a limited form. If the first digit is a 0, or if there are three octal digits, it is considered an octal escape. Otherwise, it is a group reference. As for string literals, octal escapes are always at most three digits in length.
es: Los escapes octales se incluyen en una forma limitada. Si el primer dígito es un 0, o si hay tres dígitos octales, se considera un escape octal. De lo contrario, es una referencia de grupo. En cuanto a los literales de cadena, los escapes octales siempre tienen como máximo tres dígitos de longitud.

source: The ``'\u'`` and ``'\U'`` escape sequences have been added.
es: Se han añadido las secuencias de escape ``'\u'`` y ``'\U'``.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter now are errors.
es: Los escapes desconocidos que consisten en ``'\'`` y una letra ASCII ahora son errores.

source: The ``'\N{name}'`` escape sequence has been added. As in string literals, it expands to the named Unicode character (e.g. ``'\N{EM DASH}'``).
es: Se añadió la secuencia de escape ``'\N{name}'``. Como en los literales de cadena, se expande al carácter Unicode nombrado (por ej. ``'\N{EM DASH}'``).

source: Module Contents
es: Contenidos del módulo
