Repository: python/python-docs-es
Catalog: library/re.po
Languages: es

source: :mod:`re` --- Regular expression operations
es: :mod:`re` --- Operaciones con expresiones regulares

source: **Source code:** :source:`Lib/re.py`
es: **Código fuente:** :source:`Lib/re.py`

source: This module provides regular expression matching operations similar to those found in Perl.
es: Este módulo proporciona operaciones de coincidencia de expresiones regulares similares a las encontradas en Perl.

source: Both patterns and strings to be searched can be Unicode strings (:class:`str`) as well as 8-bit strings (:class:`bytes`). However, Unicode strings and 8-bit strings cannot be mixed: that is, you cannot match a Unicode string with a byte pattern or vice-versa; similarly, when asking for a substitution, the replacement string must be of the same type as both the pattern and the search string.
es: Tanto los patrones como las cadenas de texto a buscar pueden ser cadenas de Unicode (:class:`str`) así como cadenas de 8 bits (:class:`bytes`). Sin embargo, las cadenas Unicode y las cadenas de 8 bits no se pueden mezclar: es decir, no se puede hacer coincidir una cadena Unicode con un patrón de bytes o viceversa; del mismo modo, al pedir una sustitución, la cadena de sustitución debe ser del mismo tipo que el patrón y la cadena de búsqueda.

source: Regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This collides with Python's usage of the same character for the same purpose in string literals; for example, to match a literal backslash, one might have to write ``'\\\\'`` as the pattern string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. Also, please note that any invalid escape sequences in Python's usage of the backslash in string literals now generate a :exc:`DeprecationWarning` and in the future this will become a :exc:`SyntaxError`. This behaviour will happen even if it is a valid escape sequence for a regular expression.
es: Las expresiones regulares usan el carácter de barra inversa (``'\'``) para indicar formas especiales o para permitir el uso de caracteres especiales sin invocar su significado especial. Esto choca con el uso de Python de este carácter para el mismo propósito con los literales de cadena; por ejemplo, para hacer coincidir una barra inversa literal, se podría escribir ``'\\\\'`` como patrón, porque la expresión regular debe ser ``\\``, y cada barra inversa debe ser expresada como ``\\`` dentro de un literal de cadena regular de Python. También, notar que cualquier secuencia de escape inválida mientras se use la barra inversa de Python en los literales de cadena ahora genera un :exc:`DeprecationWarning` y en el futuro esto se convertirá en un :exc:`SyntaxError`. Este comportamiento ocurrirá incluso si es una secuencia de escape válida para una expresión regular.

source: The solution is to use Python's raw string notation for regular expression patterns; backslashes are not handled in any special way in a string literal prefixed with ``'r'``. So ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Usually patterns will be expressed in Python code using this raw string notation.
es: La solución es usar la notación de cadena *raw* de Python para los patrones de expresiones regulares; las barras inversas no se manejan de ninguna manera especial en un literal de cadena prefijado con ``'r'``. Así que ``r"\n"`` es una cadena de dos caracteres que contiene ``'\'`` y ``'n'``, mientras que ``"\n"`` es una cadena de un carácter que contiene una nueva línea. Normalmente los patrones se expresan en código Python usando esta notación de cadena *raw*.

source: It is important to note that most regular expression operations are available as module-level functions and methods on :ref:`compiled regular expressions <re-objects>`. The functions are shortcuts that don't require you to compile a regex object first, but miss some fine-tuning parameters.
es: Es importante señalar que la mayoría de las operaciones de expresiones regulares están disponibles como funciones y métodos a nivel de módulo en :ref:`expresiones regulares compiladas <re-objects>` (expresiones regulares compiladas). Las funciones son atajos que no requieren de compilar un objeto regex primero, aunque pasan por alto algunos parámetros de ajuste.

source: The third-party `regex <https://pypi.org/project/regex/>`_ module, which has an API compatible with the standard library :mod:`re` module, but offers additional functionality and a more thorough Unicode support.
es: El módulo de terceros `regex <https://pypi.org/project/regex/>`_ , cuenta con una API compatible con el módulo de la biblioteca estándar :mod:`re`, el cual ofrece una funcionalidad adicional y un soporte Unicode más completo.

source: Regular Expression Syntax
es: Sintaxis de expresiones regulares

source: A regular expression (or RE) specifies a set of strings that matches it; the functions in this module let you check if a particular string matches a given regular expression (or if a given regular expression matches a particular string, which comes down to the same thing).
es: Una expresión regular (o RE, por sus siglas en inglés) especifica un conjunto de cadenas que coinciden con ella; las funciones de este módulo permiten comprobar si una determinada cadena coincide con una expresión regular dada (o si una expresión regular dada coincide con una determinada cadena, que se reduce a lo mismo).

source: Regular expressions can be concatenated to form new regular expressions; if *A* and *B* are both regular expressions, then *AB* is also a regular expression. In general, if a string *p* matches *A* and another string *q* matches *B*, the string *pq* will match AB. This holds unless *A* or *B* contain low precedence operations; boundary conditions between *A* and *B*; or have numbered group references. Thus, complex expressions can easily be constructed from simpler primitive expressions like the ones described here. For details of the theory and implementation of regular expressions, consult the Friedl book [Frie09]_, or almost any textbook about compiler construction.
es: Las expresiones regulares pueden ser concatenadas para formar nuevas expresiones regulares; si *A* y *B* son ambas expresiones regulares, entonces *AB* es también una expresión regular. En general, si una cadena *p* coincide con *A* y otra cadena *q* coincide con *B*, la cadena *porque* coincidirá con AB. Esto se mantiene a menos que *A* o *B* contengan operaciones de baja precedencia; condiciones límite entre *A* y *B*; o tengan referencias de grupo numeradas. Así, las expresiones complejas pueden construirse fácilmente a partir de expresiones primitivas más simples como las que se describen aquí. Para detalles de la teoría e implementación de las expresiones regulares, consulte el libro de Friedl [Frie09]_, o casi cualquier libro de texto sobre la construcción de compiladores.

source: A brief explanation of the format of regular expressions follows. For further information and a gentler presentation, consult the :ref:`regex-howto`.
es: A continuación se explica brevemente el formato de las expresiones regulares. Para más información y una presentación más amena, consultar la :ref:`regex-howto`.

source: Regular expressions can contain both special and ordinary characters. Most ordinary characters, like ``'A'``, ``'a'``, or ``'0'``, are the simplest regular expressions; they simply match themselves. You can concatenate ordinary characters, so ``last`` matches the string ``'last'``. (In the rest of this section, we'll write RE's in ``this special style``, usually without quotes, and strings to be matched ``'in single quotes'``.)
es: Las expresiones regulares pueden contener tanto caracteres especiales como ordinarios. La mayoría de los caracteres ordinarios, como ``'A'``, ``'a'``, o ``'0'`` son las expresiones regulares más sencillas; simplemente se ajustan a sí mismas. Se pueden concatenar caracteres ordinarios, así que ``last`` coincide con la cadena ``'last'``. (En el resto de esta sección, se escribirán los RE en ``este estilo especial``, normalmente sin comillas, y las cadenas que deban coincidir ``'entre comillas simples'``.)

source: Some characters, like ``'|'`` or ``'('``, are special. Special characters either stand for classes of ordinary characters, or affect how the regular expressions around them are interpreted.
es: Algunos caracteres, como ``'|'`` o ``'('``, son especiales. Los caracteres especiales representan clases de caracteres ordinarios, o afectan a la forma en que se interpretan las expresiones regulares que los rodean.

source: Repetition qualifiers (``*``, ``+``, ``?``, ``{m,n}``, etc) cannot be directly nested. This avoids ambiguity with the non-greedy modifier suffix ``?``, and with other modifiers in other implementations. To apply a second repetition to an inner repetition, parentheses may be used. For example, the expression ``(?:a{6})*`` matches any multiple of six ``'a'`` characters.
es: Los delimitadores de repetición (``*``, ``+``, ``?``, ``{m,n}``, etc.) no pueden ser anidados directamente. Esto evita la ambigüedad con el sufijo modificador no *greedy* (codiciosos) ``?``, y con otros modificadores en otras implementaciones. Para aplicar una segunda repetición a una repetición interna, se pueden usar paréntesis. Por ejemplo, la expresión ``(?:a{6})*`` coincide con cualquier múltiplo de seis caracteres ``'a'``.

source: The special characters are:
es: Los caracteres especiales son:

source: (Dot.) In the default mode, this matches any character except a newline. If the :const:`DOTALL` flag has been specified, this matches any character including a newline.
es: (Punto.) En el modo predeterminado, esto coincide con cualquier carácter excepto con una nueva línea. Si se ha especificado el indicador :const:`DOTALL`, esto coincide con cualquier carácter que incluya una nueva línea.

source: (Caret.) Matches the start of the string, and in :const:`MULTILINE` mode also matches immediately after each newline.
es: (Circunflejo.) Coincide con el comienzo de la cadena, y en modo :const:`MULTILINE` también coincide inmediatamente después de cada nueva línea.

source: Matches the end of the string or just before the newline at the end of the string, and in :const:`MULTILINE` mode also matches before a newline. ``foo`` matches both 'foo' and 'foobar', while the regular expression ``foo$`` matches only 'foo'. More interestingly, searching for ``foo.$`` in ``'foo1\nfoo2\n'`` matches 'foo2' normally, but 'foo1' in :const:`MULTILINE` mode; searching for a single ``$`` in ``'foo\n'`` will find two (empty) matches: one just before the newline, and one at the end of the string.
es: Coincide con el final de la cadena o justo antes de la nueva línea al final de la cadena, y en modo :const:`MULTILINE` también coincide antes de una nueva línea. ``foo`` coincide con 'foo' y 'foobar', mientras que la expresión regular ``foo$`` sólo coincide con 'foo'. Más interesante aún, al buscar ``foo.$`` en ``'foo1\nfoo2\n'`` coincide con 'foo2' normalmente, pero solo 'foo1' en :const:`MULTILINE``; si busca un solo ``$`` en ``'foo\n'`` encontrará dos coincidencias (vacías): una justo antes de una nueva línea, y otra al final de la cadena.

source: Causes the resulting RE to match 0 or more repetitions of the preceding RE, as many repetitions as are possible. ``ab*`` will match 'a', 'ab', or 'a' followed by any number of 'b's.
es: Hace que el RE resultante coincida con 0 o más repeticiones del RE precedente, tantas repeticiones como sean posibles. ``ab*`` coincidirá con 'a', 'ab' o 'a' seguido de cualquier número de 'b'.

source: Causes the resulting RE to match 1 or more repetitions of the preceding RE. ``ab+`` will match 'a' followed by any non-zero number of 'b's; it will not match just 'a'.
es: Hace que la RE resultante coincida con 1 o más repeticiones de la RE precedente. ``ab+`` coincidirá con 'a' seguido de cualquier número distinto de cero de 'b'; no coincidirá solo con 'a'.

source: Causes the resulting RE to match 0 or 1 repetitions of the preceding RE. ``ab?`` will match either 'a' or 'ab'.
es: Hace que la RE resultante coincida con 0 o 1 repeticiones de la RE precedente. ``ab?`` coincidirá con 'a' o 'ab'.

source: The ``'*'``, ``'+'``, and ``'?'`` qualifiers are all :dfn:`greedy`; they match as much text as possible. Sometimes this behaviour isn't desired; if the RE ``<.*>`` is matched against ``'<a> b <c>'``, it will match the entire string, and not just ``'<a>'``. Adding ``?`` after the qualifier makes it perform the match in :dfn:`non-greedy` or :dfn:`minimal` fashion; as *few* characters as possible will be matched. Using the RE ``<.*?>`` will match only ``'<a>'``.
es: Los delimitadores "*", "+" y "*" son todos :dfn:`greedy` (codiciosos); coinciden con la mayor cantidad de texto posible. A veces este comportamiento no es deseado; si el RE ``<.*>`` se utiliza para coincidir con ``'<a> b <c>'``, coincidirá con toda la cadena, y no sólo con ``'<a>'``. Añadiendo ``?`` después del delimitador hace que se realice la coincidencia de manera :dfn:`non-greedy` o :dfn:`minimal`; coincidirá la *mínima* cantidad de caracteres como sea posible. Usando el RE ``<.*?>`` sólo coincidirá con ``'<a>'``.

source: Specifies that exactly *m* copies of the previous RE should be matched; fewer matches cause the entire RE not to match. For example, ``a{6}`` will match exactly six ``'a'`` characters, but not five.
es: Especifica que exactamente *m* copias de la RE anterior deben coincidir; menos coincidencias hacen que la RE entera no coincida. Por ejemplo, ``a{6}`` coincidirá exactamente con seis caracteres ``'a'``, pero no con cinco.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as many repetitions as possible. For example, ``a{3,5}`` will match from 3 to 5 ``'a'`` characters. Omitting *m* specifies a lower bound of zero, and omitting *n* specifies an infinite upper bound. As an example, ``a{4,}b`` will match ``'aaaab'`` or a thousand ``'a'`` characters followed by a ``'b'``, but not ``'aaab'``. The comma may not be omitted or the modifier would be confused with the previously described form.
es: Hace que el RE resultante coincida de *m* a *n* repeticiones del RE precedente, tratando de coincidir con el mayor número de repeticiones posible. Por ejemplo, ``a{3,5}`` coincidirá de 3 a 5 caracteres ``'a'``. Omitiendo *m* se especifica un límite inferior de cero, y omitiendo *n* se especifica un límite superior infinito. Por ejemplo, ``a{4,}b`` coincidirá con ``'aaaab'`` o mil caracteres ``'a'`` seguidos de una ``'b'``, pero no ``'aaab'``. La coma no puede ser omitida o el modificador se confundiría con la forma descrita anteriormente.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as *few* repetitions as possible. This is the non-greedy version of the previous qualifier. For example, on the 6-character string ``'aaaaaa'``, ``a{3,5}`` will match 5 ``'a'`` characters, while ``a{3,5}?`` will only match 3 characters.
es: Hace que el RE resultante coincida de *m* a *n* repeticiones del RE precedente, tratando de coincidir con el *mínimo de* repeticiones posible. Esta es la versión *non-greedy* (no codiciosa) del delimitador anterior. Por ejemplo, en la cadena de 6 caracteres ``'aaaaaaa'``, ``a{3,5}`` coincidirá con 5 caracteres ``'a'``, mientras que ``a{3,5}?`` solo coincidirá con 3 caracteres.

source: Either escapes special characters (permitting you to match characters like ``'*'``, ``'?'``, and so forth), or signals a special sequence; special sequences are discussed below.
es: O bien se escapan a los caracteres especiales (lo que le permite hacer coincidir caracteres como ``'*'``, ``'?'``, y así sucesivamente), o se señala una secuencia especial; las secuencias especiales se explican más adelante.

source: If you're not using a raw string to express the pattern, remember that Python also uses the backslash as an escape sequence in string literals; if the escape sequence isn't recognized by Python's parser, the backslash and subsequent character are included in the resulting string. However, if Python would recognize the resulting sequence, the backslash should be repeated twice. This is complicated and hard to understand, so it's highly recommended that you use raw strings for all but the simplest expressions.
es: Si no se utiliza una cadena *raw* para expresar el patrón, recuerde que Python también utiliza la barra inversa como secuencia de escape en los literales de la cadena; si el analizador sintáctico de Python no reconoce la secuencia de escape, la barra inversa y el carácter subsiguiente se incluyen en la cadena resultante. Sin embargo, si Python quisiera reconocer la secuencia resultante, la barra inversa debería repetirse dos veces. Esto es complicado y difícil de entender, por lo que se recomienda encarecidamente utilizar cadenas *raw* para todas las expresiones salvo las más simples.

source: Used to indicate a set of characters. In a set:
es: Se utiliza para indicar un conjunto de caracteres. En un conjunto:

source: Characters can be listed individually, e.g. ``[amk]`` will match ``'a'``, ``'m'``, or ``'k'``.
es: Los caracteres pueden ser listados individualmente, ej. ``[amk]`` coincidirá con ``'a'``, ``'m'``, o ``'k'``.

source: Ranges of characters can be indicated by giving two characters and separating them by a ``'-'``, for example ``[a-z]`` will match any lowercase ASCII letter, ``[0-5][0-9]`` will match all the two-digits numbers from ``00`` to ``59``, and ``[0-9A-Fa-f]`` will match any hexadecimal digit. If ``-`` is escaped (e.g. ``[a\-z]``) or if it's placed as the first or last character (e.g. ``[-a]`` or ``[a-]``), it will match a literal ``'-'``.
es: Los rangos de caracteres se pueden indicar mediante dos caracteres y separándolos con un ``'-'``. Por ejemplo, ``[a-z]`` coincidirá con cualquier letra ASCII en minúscula, ``[0-5][0-9]`` coincidirá con todos los números de dos dígitos desde el ``00`` hasta el ``59``, y ``[0-9A-Fa-f]`` coincidirá con cualquier dígito hexadecimal. Si se escapa ``-`` (por ejemplo, ``[a\-z]``) o si se coloca como el primer o el último carácter (por ejemplo, ``[-a]`` o ``[a-]``), coincidirá con un literal ``'-'``.

source: Special characters lose their special meaning inside sets. For example, ``[(+*)]`` will match any of the literal characters ``'('``, ``'+'``, ``'*'``, or ``')'``.
es: Los caracteres especiales pierden su significado especial dentro de los sets. Por ejemplo, ``[(+*)]`` coincidirá con cualquiera de los caracteres literales ``'('``, ``'+'``, ``'*'``, o ``')'``.

source: Character classes such as ``\w`` or ``\S`` (defined below) are also accepted inside a set, although the characters they match depends on whether :const:`ASCII` or :const:`LOCALE` mode is in force.
es: Las clases de caracteres como ``\w`` o ``\S`` (definidas más adelante) también se aceptan dentro de un conjunto, aunque los caracteres que coinciden dependen de si el modo :const:`ASCII` o :const:`LOCALE` está activo.

source: Characters that are not within a range can be matched by :dfn:`complementing` the set. If the first character of the set is ``'^'``, all the characters that are *not* in the set will be matched. For example, ``[^5]`` will match any character except ``'5'``, and ``[^^]`` will match any character except ``'^'``. ``^`` has no special meaning if it's not the first character in the set.
es: Los caracteres que no están dentro de un rango pueden ser coincidentes con :dfn:`complementing` el conjunto. Si el primer carácter del conjunto es ``'^'``, todos los caracteres que *no* están en el conjunto coincidirán. Por ejemplo, ``[^5]`` coincidirá con cualquier carácter excepto con ``'5'``, y ``[^^]`` coincidirá con cualquier carácter excepto con ``'^'``. ``^`` no tiene un significado especial si no es el primer carácter del conjunto.

source: To match a literal ``']'`` inside a set, precede it with a backslash, or place it at the beginning of the set. For example, both ``[()[\]{}]`` and ``[]()[{}]`` will both match a parenthesis.
es: Para coincidir con un ``']'`` literal dentro de un set, se debe preceder con una barra inversa, o colocarlo al principio del set. Por ejemplo, tanto ``[()[\][{}]`` como ``[]()[{}]`` coincidirá con los paréntesis, corchetes y llaves.

source: Support of nested sets and set operations as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax, so to facilitate this change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That includes sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning escape them with a backslash.
es: El soporte de conjuntos anidados y operaciones de conjuntos como en `Unicode Technical Standard #18`_ podría ser añadido en el futuro. Esto cambiaría la sintaxis, así que por el momento se planteará un :exc:`FutureWarning` en casos ambiguos para facilitar este cambio. Ello incluye conjuntos que empiecen con un literal ``'['`` o que contengan secuencias de caracteres literales ``'—'``, ``'&&'``, ``'~~'`` y ``'||'``. Para evitar una advertencia, utilizar el código de escape con una barra inversa.

source: :exc:`FutureWarning` is raised if a character set contains constructs that will change semantically in the future.
es: :exc:`FutureWarning` se genera si un conjunto de caracteres contiene construcciones que cambiarán semánticamente en el futuro.

source: ``A|B``, where *A* and *B* can be arbitrary REs, creates a regular expression that will match either *A* or *B*. An arbitrary number of REs can be separated by the ``'|'`` in this way. This can be used inside groups (see below) as well. As the target string is scanned, REs separated by ``'|'`` are tried from left to right. When one pattern completely matches, that branch is accepted. This means that once *A* matches, *B* will not be tested further, even if it would produce a longer overall match. In other words, the ``'|'`` operator is never greedy. To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
es: ``A|B``, donde *A* y *B* pueden ser RE arbitrarias, crea una expresión regular que coincidirá con *A* or *B*. Un número arbitrario de RE puede ser separado por ``'|'`` de esta manera. Esto puede también ser usado dentro de grupos (ver más adelante). Cuando la cadena de destino es procesada, los RE separados por ``'|'`` son probados de izquierda a derecha. Cuando un patrón coincide completamente, esa rama es aceptada. Esto significa que una vez que *A* coincida, *B* no se comprobará más, incluso si se produce una coincidencia general más larga. En otras palabras, el operador de ``'|'`` nunca es codicioso. Para emparejar un literal ``'|'``, se usa ``\|``, o se envuelve dentro de una clase de caracteres, como en ``[|]``.
