Repository: python/python-docs-es
Catalog: library/resource.po
Languages: es

source: :mod:`resource` --- Resource usage information
es: :mod:`resource` --- Información sobre el uso de recursos

source: This module provides basic mechanisms for measuring and controlling system resources utilized by a program.
es: Este módulo proporciona mecanismos básicos para medir y controlar los recursos del sistema utilizados por un programa.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Ver :ref:`wasm-availability` para más información.

source: Symbolic constants are used to specify particular system resources and to request usage information about either the current process or its children.
es: Las constantes simbólicas se utilizan para especificar recursos concretos del sistema y para solicitar información de uso sobre el proceso actual o sus elementos secundarios.

source: An :exc:`OSError` is raised on syscall failure.
es: Se genera un :exc:`OSError` cuando la llamada al sistema (*syscall*) falla.

source: A deprecated alias of :exc:`OSError`.
es: Un alias en desuso de :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
es: Tras :pep:`3151` esta clase se convirtió en un alias de :exc:`OSError`.

source: Resource Limits
es: Límites de recursos

source: Resources usage can be limited using the :func:`setrlimit` function described below. Each resource is controlled by a pair of limits: a soft limit and a hard limit. The soft limit is the current limit, and may be lowered or raised by a process over time. The soft limit can never exceed the hard limit. The hard limit can be lowered to any value greater than the soft limit, but not raised. (Only processes with the effective UID of the super-user can raise a hard limit.)
es: El uso de recursos se puede limitar usando la función :func:`setrlimit` que se describe a continuación. Cada recurso está controlado por un par de límites: un límite flexible y un límite duro. El límite flexible es el límite actual, y puede ser reducido o elevado con el tiempo mediante un proceso. El límite flexible nunca puede exceder el límite duro. El límite duro se puede reducir a cualquier valor mayor que el del límite flexible, pero no se puede elevar. (Solo los procesos con el UID efectivo del superusuario pueden aumentar un límite duro.)

source: The specific resources that can be limited are system dependent. They are described in the :manpage:`getrlimit(2)` man page. The resources listed below are supported when the underlying operating system supports them; resources which cannot be checked or controlled by the operating system are not defined in this module for those platforms.
es: Los recursos específicos que se pueden limitar dependen del sistema. Se describen en la página de manual :manpage:`getrlimit(2)`. Los recursos enumerados a continuación se admiten cuando el sistema operativo subyacente los admite; los recursos que no pueden ser verificados o controlados por el sistema operativo no se definen en este módulo para esas plataformas.

source: Constant used to represent the limit for an unlimited resource.
es: Constante utilizada para representar el límite de un recurso ilimitado.

source: Returns a tuple ``(soft, hard)`` with the current soft and hard limits of *resource*. Raises :exc:`ValueError` if an invalid resource is specified, or :exc:`error` if the underlying system call fails unexpectedly.
es: Retorna una tupla ``(soft, hard)`` con los límites flexible y duro actuales de *resource*. Genera :exc:`ValueError` si se especifica un recurso no válido o :exc:`error` si la llamada al sistema subyacente falla inesperadamente.

source: Sets new limits of consumption of *resource*. The *limits* argument must be a tuple ``(soft, hard)`` of two integers describing the new limits. A value of :data:`~resource.RLIM_INFINITY` can be used to request a limit that is unlimited.
es: Establece nuevos límites para el consumo de *resource*. El argumento *limits* debe ser una tupla de dos enteros ``(soft, hard)`` que describe los nuevos límites. Un valor de :data:`~resource.RLIM_INFINITY` se puede utilizar para solicitar un límite ilimitado.

source: Raises :exc:`ValueError` if an invalid resource is specified, if the new soft limit exceeds the hard limit, or if a process tries to raise its hard limit. Specifying a limit of :data:`~resource.RLIM_INFINITY` when the hard or system limit for that resource is not unlimited will result in a :exc:`ValueError`. A process with the effective UID of super-user can request any valid limit value, including unlimited, but :exc:`ValueError` will still be raised if the requested limit exceeds the system imposed limit.
es: Genera :exc:`ValueError` si se especifica un recurso no válido, si el nuevo límite flexible excede el límite duro, o si un proceso intenta aumentar el límite duro. Si se especifica un límite de :data:`~resource.RLIM_INFINITY` cuando el límite duro o el límite del sistema para ese recurso no son ilimitados, se producirá un :exc:`ValueError`. Un proceso con el UID efectivo de superusuario puede solicitar cualquier valor de límite válido, incluso ilimitado, pero se lanzará un :exc:`ValueError` si el límite solicitado excede el límite impuesto por el sistema.

source: ``setrlimit`` may also raise :exc:`error` if the underlying system call fails.
es: ``setrlimit`` también puede generar un :exc:`error` si falla la llamada al sistema subyacente.

source: VxWorks only supports setting :data:`RLIMIT_NOFILE`.
es: VxWorks solo admite configurar :data:`RLIMIT_NOFILE`.

source: Raises an :ref:`auditing event <auditing>` ``resource.setrlimit`` with arguments ``resource``, ``limits``.
es: Genera un :ref:`auditing event <auditing>` ``resource.setrlimit`` con los argumentos ``resource``, ``limits``.

source: Combines :func:`setrlimit` and :func:`getrlimit` in one function and supports to get and set the resources limits of an arbitrary process. If *pid* is 0, then the call applies to the current process. *resource* and *limits* have the same meaning as in :func:`setrlimit`, except that *limits* is optional.
es: Combina :func:`setrlimit` y :func:`getrlimit` en una sola función y admite obtener y establecer los límites de recursos de un proceso arbitrario. Si *pid* es 0, entonces la llamada se aplica al proceso actual. *resource* y *limits* tienen el mismo significado que en :func:`setrlimit`, excepto por que *limits* es opcional.

source: When *limits* is not given the function returns the *resource* limit of the process *pid*. When *limits* is given the *resource* limit of the process is set and the former resource limit is returned.
es: Cuando no se proporciona *limits* la función retorna el límite de *resource* del proceso *pid*. Cuando se proporciona *limits*, se establece el límite de *resource* del proceso y se retorna el límite de recursos anterior.

source: Raises :exc:`ProcessLookupError` when *pid* can't be found and :exc:`PermissionError` when the user doesn't have ``CAP_SYS_RESOURCE`` for the process.
es: Genera :exc:`ProcessLookupError` cuando no se encuentra *pid* y :exc:`PermissionError` cuando el usuario no tiene ``CAP_SYS_RESOURCE`` para el proceso.

source: Raises an :ref:`auditing event <auditing>` ``resource.prlimit`` with arguments ``pid``, ``resource``, ``limits``.
es: Genera un :ref:`evento de auditoría <auditing>` ``resource.prlimit`` con los argumentos ``pid``, ``resource``, ``limits``.

source: :ref:`Availability <availability>`: Linux >= 2.6.36 with glibc >= 2.13.
es: :ref:`Disponibilidad <availability>`: Linux 2.6.36 o posterior con glibc 2.13 o posterior.

source: These symbols define resources whose consumption can be controlled using the :func:`setrlimit` and :func:`getrlimit` functions described below. The values of these symbols are exactly the constants used by C programs.
es: Estos símbolos definen los recursos cuyo consumo se puede controlar usando las funciones :func:`setrlimit` y :func:`getrlimit` que se describen más abajo. Los valores de estos símbolos son exactamente las constantes utilizadas por programas en C.

source: The Unix man page for :manpage:`getrlimit(2)` lists the available resources. Note that not all systems use the same symbol or same value to denote the same resource. This module does not attempt to mask platform differences --- symbols not defined for a platform will not be available from this module on that platform.
es: La página de manual de Unix para :manpage:`getrlimit(2)` detalla los recursos disponibles. Tenga en cuenta que no todos los sistemas usan el mismo símbolo o el mismo valor para referirse al mismo recurso. Este módulo no pretende enmascarar las diferencias entre plataformas --- los símbolos no definidos para una plataforma no estarán disponibles en este módulo en esa plataforma.

source: The maximum size (in bytes) of a core file that the current process can create. This may result in the creation of a partial core file if a larger core would be required to contain the entire process image.
es: El tamaño máximo (en bytes) de un archivo central que puede crear el proceso actual. Esto podría resultar en la creación de un archivo central parcial si se requiriera uno más grande para contener la imagen del proceso entera.

source: The maximum amount of processor time (in seconds) that a process can use. If this limit is exceeded, a :const:`SIGXCPU` signal is sent to the process. (See the :mod:`signal` module documentation for information about how to catch this signal and do something useful, e.g. flush open files to disk.)
es: La cantidad máxima de tiempo del procesador (en segundos) que puede utilizar un proceso. Si se excede este límite se envía una señal :const:`SIGXCPU` al proceso. (Vea la documentación del módulo :mod:`signal` para más información sobre cómo detectar esta señal y hacer algo productivo, p. ej. descargar los archivos abiertos al disco).

source: The maximum size of a file which the process may create.
es: El tamaño máximo de un archivo que pueda crear el proceso.

source: The maximum size (in bytes) of the process's heap.
es: El tamaño máximo (en bytes) de la memoria *heap* del proceso.

source: The maximum size (in bytes) of the call stack for the current process. This only affects the stack of the main thread in a multi-threaded process.
es: El tamaño máximo (en bytes) de la pila de llamadas para el proceso actual. Esto afecta únicamente a la pila del hilo principal en un proceso multi-hilo.

source: The maximum resident set size that should be made available to the process.
es: El tamaño máximo del conjunto residente (*RSS*) del que puede disponer el proceso.

source: The maximum number of processes the current process may create.
es: El número máximo de procesos que puede crear el proceso actual.

source: The maximum number of open file descriptors for the current process.
es: El número máximo de descriptores de archivo abierto para el proceso actual.

source: The BSD name for :const:`RLIMIT_NOFILE`.
es: El nombre BDS para :const:`RLIMIT_NOFILE`.

source: The maximum address space which may be locked in memory.
es: El espacio de direcciones máximo que se puede bloquear en la memoria.

source: The largest area of mapped memory which the process may occupy.
es: El área de memoria mapeada más grande que puede ocupar el proceso.

source: The maximum area (in bytes) of address space which may be taken by the process.
es: El área máxima (en bytes) de espacio de direcciones que puede tomar el proceso.

source: The number of bytes that can be allocated for POSIX message queues.
es: El número de bytes que se pueden asignar a las colas de mensajes POSIX.

source: :ref:`Availability <availability>`: Linux >= 2.6.8.
es: :ref:`Disponibilidad <availability>`: Linux 2.6.8 o posterior.

source: The ceiling for the process's nice level (calculated as 20 - rlim_cur).
es: El techo del nivel del proceso *nice* (calculado como 20 - rlim_cur).

source: :ref:`Availability <availability>`: Linux >= 2.6.12.
es: :ref:`Disponibilidad <availability>`: Linux 2.6.12 o posterior.

source: The ceiling of the real-time priority.
es: El techo de la prioridad en tiempo real.

source: The time limit (in microseconds) on CPU time that a process can spend under real-time scheduling without making a blocking syscall.
es: El límite de tiempo (en microsegundos) en tiempo de CPU que puede dedicar un proceso de programación en tiempo real sin hacer una llamada al sistema de bloqueo.

source: :ref:`Availability <availability>`: Linux >= 2.6.25.
es: :ref:`Disponibilidad <availability>`: Linux 2.6.25 o posterior.

source: The number of signals which the process may queue.
es: El número de señales que el proceso puede poner en cola.

source: The maximum size (in bytes) of socket buffer usage for this user. This limits the amount of network memory, and hence the amount of mbufs, that this user may hold at any time.
es: El tamaño máximo (en bytes) de uso del búfer del socket para este usuario. Esto limita la cantidad de memoria de red, y por lo tanto la cantidad de mbufs, que este usuario puede retener en todo momento.

source: :ref:`Availability <availability>`: FreeBSD.
es: :ref:`Disponibilidad <availability>`: FreeBSD.

source: The maximum size (in bytes) of the swap space that may be reserved or used by all of this user id's processes. This limit is enforced only if bit 1 of the vm.overcommit sysctl is set. Please see `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ for a complete description of this sysctl.
es: El tamaño máximo (en bytes) del espacio de intercambio que puede ser reservado o utilizado por todos los procesos de este ID de usuario. Este límite se aplica solo si se establece el bit 1 de vm.overcommit sysctl. Consulte `tuning(7) <https://www.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ para obtener una descripción completa de este sysctl.

source: The maximum number of pseudo-terminals created by this user id.
es: El número máximo de pseudo-terminales que puede crear esta ID de usuario.

source: The maximum number of kqueues this user id is allowed to create.
es: El número máximo de kqueues que este ID de usuario puede crear.

source: :ref:`Availability <availability>`: FreeBSD >= 11.
es: :ref:`Disponibilidad <availability>`: FreeBSD 11 o posterior.

source: Resource Usage
es: Utilización de recursos

source: These functions are used to retrieve resource usage information:
es: Estas funciones se usan para recuperar la información de utilización de recursos:

source: This function returns an object that describes the resources consumed by either the current process or its children, as specified by the *who* parameter. The *who* parameter should be specified using one of the :const:`RUSAGE_\*` constants described below.
es: Esta función retorna un objeto que describe los recursos consumidos por el proceso actual o sus elementos secundarios, según como esté especificado en el parámetro *who*. El parámetro *who* debe especificarse usando una de las constantes :const:`RUSAGE_\*` descritas más abajo.

source: A simple example::
es: Un ejemplo sencillo::

source: The fields of the return value each describe how a particular system resource has been used, e.g. amount of time spent running is user mode or number of times the process was swapped out of main memory. Some values are dependent on the clock tick internal, e.g. the amount of memory the process is using.
es: Los campos del valor retornado describen cómo se ha utilizado un recurso específico, p. ej. la cantidad de tiempo dedicada a la ejecución en modo usuario o el número de veces que el proceso ha sido intercambiado desde la memoria principal. Algunos valores dependen del intervalo de tic del reloj, p. ej. la cantidad de memoria que está usando el proceso.

source: For backward compatibility, the return value is also accessible as a tuple of 16 elements.
es: Por compatibilidad con versiones anteriores, el valor retornado es accesible también como una tupla de 16 elementos.

source: The fields :attr:`ru_utime` and :attr:`ru_stime` of the return value are floating point values representing the amount of time spent executing in user mode and the amount of time spent executing in system mode, respectively. The remaining values are integers. Consult the :manpage:`getrusage(2)` man page for detailed information about these values. A brief summary is presented here:
es: Los campos :attr:`ru_utime` y :attr:`ru_stime` del valor retornado son valores de coma flotante que representan la cantidad de tiempo dedicada a la ejecución en modo usuario y la cantidad de tiempo dedicada a la ejecución en modo sistema respectivamente. Los valores restantes son enteros. Consulte la página del manual :manpage:`getrusage(2)` para información detallada sobre estos valores. A continuación se presenta un breve resumen:

source: Index
es: Índice

source: Field
es: Campo

source: Resource
es: Recurso

source: time in user mode (float seconds)
es: tiempo en modo usuario (flotante en segundos)

source: time in system mode (float seconds)
es: tiempo en modo sistema (flotante en segundos)

source: maximum resident set size
es: tamaño máximo del conjunto residente

source: shared memory size
es: tamaño de memoria compartida

source: unshared memory size
es: tamaño de memoria no compartida

source: unshared stack size
es: tamaño de la pila no compartida

source: page faults not requiring I/O
es: fallos de página que no requieran E/S

source: page faults requiring I/O
es: fallos de página que requieran E/S

source: number of swap outs
es: número de intercambios

source: block input operations
es: bloque de operaciones de entrada

source: block output operations
es: bloque de operaciones de salida

source: messages sent
es: mensajes enviados

source: messages received
es: mensajes recibidos

source: signals received
es: señales recibidas

source: voluntary context switches
es: intercambios de contexto voluntarios

source: involuntary context switches
es: intercambios de contexto involuntarios

source: This function will raise a :exc:`ValueError` if an invalid *who* parameter is specified. It may also raise :exc:`error` exception in unusual circumstances.
es: Esta función lanzará un :exc:`ValueError` si el parámetro *who* especificado no es válido. También puede generar una excepción :exc:`error` en circunstancias inusuales.

source: Returns the number of bytes in a system page. (This need not be the same as the hardware page size.)
es: Retorna el número de bytes en una página de sistema. (Esta no es necesariamente del mismo tamaño que la página de hardware).

source: The following :const:`RUSAGE_\*` symbols are passed to the :func:`getrusage` function to specify which processes information should be provided for.
es: Los siguientes símbolos :const:`RUSAGE_\*` se pasan a la función :func:`getrusage` para especificar qué información de procesos se debería proporcionar.

source: Pass to :func:`getrusage` to request resources consumed by the calling process, which is the sum of resources used by all threads in the process.
es: Pasar a :func:`getrusage` para solicitar recursos consumidos por el proceso de llamada, que es la suma de recursos utilizados por todos los hilos en el proceso.

source: Pass to :func:`getrusage` to request resources consumed by child processes of the calling process which have been terminated and waited for.
es: Pasar a :func:`getrusage` para solicitar recursos consumidos por procesos secundarios del proceso de llamada que se han terminado o a los que se les está esperando.

source: Pass to :func:`getrusage` to request resources consumed by both the current process and child processes. May not be available on all systems.
es: Pasar a :func:`getrusage` para solicitar recursos consumidos por el proceso actual y sus procesos secundarios. Puede que no esté disponible en todos los sistemas.

source: Pass to :func:`getrusage` to request resources consumed by the current thread. May not be available on all systems.
es: Pasa a :func:`getrusage` para solicitar recursos consumidos por el hilo actual. Puede que no esté disponible en todos los sistemas.
