Repository: python/python-docs-es
Catalog: library/secrets.po
Languages: es

source: :mod:`secrets` --- Generate secure random numbers for managing secrets
es: :mod:`secrets` --- Genera números aleatorios seguros para trabajar con secretos criptográficos

source: **Source code:** :source:`Lib/secrets.py`
es: **Código fuente:** :source:`Lib/secrets.py`

source: The :mod:`secrets` module is used for generating cryptographically strong random numbers suitable for managing data such as passwords, account authentication, security tokens, and related secrets.
es: El módulo :mod:`secrets` se usa para generar números aleatorios criptográficamente fuertes, apropiados para trabajar con datos como contraseñas, autenticación de cuentas, tokens de seguridad y secretos relacionados.

source: In particular, :mod:`secrets` should be used in preference to the default pseudo-random number generator in the :mod:`random` module, which is designed for modelling and simulation, not security or cryptography.
es: En particular, :mod:`secrets` se debe usar en lugar del generador de números pseudoaleatorios del módulo :mod:`random`, que está diseñado para el modelado y la simulación, no para la seguridad o la criptografía.

source: Random numbers
es: Números aleatorios

source: The :mod:`secrets` module provides access to the most secure source of randomness that your operating system provides.
es: El módulo :mod:`secrets` provee acceso a la fuente más segura de aleatoriedad que proporciona su sistema operativo.

source: A class for generating random numbers using the highest-quality sources provided by the operating system. See :class:`random.SystemRandom` for additional details.
es: Una clase para generar números aleatorios utilizando las fuentes de mayor calidad que proporciona el sistema operativo. Ver :class:`random.SystemRandom` para más detalles.

source: Return a randomly chosen element from a non-empty sequence.
es: Retorna un elemento elegido aleatoriamente a partir de una secuencia no vacía.

source: Return a random int in the range [0, *n*).
es: Retorna un entero aleatorio en el rango [0, *n*).

source: Return an int with *k* random bits.
es: Retorna un entero con *k* bits aleatorios.

source: Generating tokens
es: Generando tokens

source: The :mod:`secrets` module provides functions for generating secure tokens, suitable for applications such as password resets, hard-to-guess URLs, and similar.
es: El módulo :mod:`secrets` provee funciones para generar tokens seguros, adecuados para aplicaciones como el restablecimiento de contraseñas, URLs difíciles de adivinar, y similares.

source: Return a random byte string containing *nbytes* number of bytes. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
es: Retorna una cadena de bytes aleatorios que contiene *nbytes* número de bytes. Si *nbytes* es ``None`` o no se suministra, se utiliza un valor por defecto razonable.

source: Return a random text string, in hexadecimal. The string has *nbytes* random bytes, each byte converted to two hex digits. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
es: Retorna una cadena de caracteres aleatoria, en hexadecimal. La cadena de caracteres tiene *nbytes* bytes aleatorios, cada byte convertido a dos dígitos hexadecimales. Si *nbytes* es ``None`` o no se suministra, se utiliza un valor por defecto razonable.

source: Return a random URL-safe text string, containing *nbytes* random bytes. The text is Base64 encoded, so on average each byte results in approximately 1.3 characters. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
es: Retorna una cadena de caracteres aleatoria para usarse en URLs, que contiene *nbytes* bytes aleatorios. El texto está codificado en Base64, por lo que en promedio cada byte resulta en aproximadamente 1,3 caracteres. Si *nbytes* es ``None`` o no se suministra, se utiliza un valor por defecto razonable.

source: How many bytes should tokens use?
es: ¿Cuántos bytes deben tener los tokens?

source: To be secure against `brute-force attacks <https://en.wikipedia.org/wiki/Brute-force_attack>`_, tokens need to have sufficient randomness. Unfortunately, what is considered sufficient will necessarily increase as computers get more powerful and able to make more guesses in a shorter period. As of 2015, it is believed that 32 bytes (256 bits) of randomness is sufficient for the typical use-case expected for the :mod:`secrets` module.
es: Para estar seguros contra los `ataques de fuerza bruta <https://es.wikipedia.org/wiki/Ataque_de_fuerza_bruta>`_, los tokens deben tener suficiente aleatoriedad. Desafortunadamente, lo que es considerado suficiente necesariamente aumentará a medida que las computadoras se vuelvan más potentes y capaces de hacer más pruebas en un período más corto. Desde 2015 se cree que 32 bytes (256 bits) de aleatoriedad son considerados suficientes para el típico caso de uso del módulo :mod:`secrets`.

source: For those who want to manage their own token length, you can explicitly specify how much randomness is used for tokens by giving an :class:`int` argument to the various ``token_*`` functions. That argument is taken as the number of bytes of randomness to use.
es: Para quienes quieran gestionar la longitud de sus propios tokens, pueden especificar explícitamente cuánta aleatoriedad se utiliza para los tokens dando un argumento :class:`int` a las funciones ``token_*``. Ese argumento se toma como el número de bytes de aleatoriedad a utilizar.

source: Otherwise, if no argument is provided, or if the argument is ``None``, the ``token_*`` functions will use a reasonable default instead.
es: En caso contrario, si no se proporciona ningún argumento, o si el argumento es ``None``, las funciones ``token_*`` utilizarán en su lugar un valor por defecto razonable.

source: That default is subject to change at any time, including during maintenance releases.
es: El valor por defecto está sujeto a cambios en cualquier momento, incluso en los lanzamientos de mantenimiento.

source: Other functions
es: Otras funciones

source: Return ``True`` if strings or :term:`bytes-like objects <bytes-like object>` *a* and *b* are equal, otherwise ``False``, using a "constant-time compare" to reduce the risk of `timing attacks <https://codahale.com/a-lesson-in-timing-attacks/>`_. See :func:`hmac.compare_digest` for additional details.
es: Retorna ``True`` si las cadenas de caracteres o :term:`objetos tipo-bytes <bytes-like object>` *a* y *b* son iguales, de lo contrario ``False``, usando una "comparación de tiempo constante" para reducir el riesgo de `ataques de análisis temporal <https://codahale.com/a-lesson-in-timing-attacks/>`_. Ver :func:`hmac.compare_digest`` para detalles adicionales.

source: Recipes and best practices
es: Recetas y mejores prácticas

source: This section shows recipes and best practices for using :mod:`secrets` to manage a basic level of security.
es: Esta sección muestra las recetas y las mejores prácticas para usar :mod:`secrets` para conseguir un nivel mínimo de seguridad.

source: Generate an eight-character alphanumeric password:
es: Generar una contraseña alfanumérica de ocho caracteres:

source: Applications should not `store passwords in a recoverable format <https://cwe.mitre.org/data/definitions/257.html>`_, whether plain text or encrypted. They should be salted and hashed using a cryptographically strong one-way (irreversible) hash function.
es: Las aplicaciones no deben `almacenar contraseñas en un formato recuperable <http://cwe.mitre.org/data/definitions/257.html>`_, ya sea en texto plano o encriptado. Deberían ser saladas y hasheadas usando una función hash unidireccional (irreversible) y criptográficamente fuerte.

source: Generate a ten-character alphanumeric password with at least one lowercase character, at least one uppercase character, and at least three digits:
es: Generar una contraseña alfanumérica de diez caracteres con al menos un carácter en minúscula, al menos un carácter en mayúscula y al menos tres dígitos:

source: Generate an `XKCD-style passphrase <https://xkcd.com/936/>`_:
es: Generar una `contraseña al estilo XKCD <https://xkcd.com/936/>`_:

source: Generate a hard-to-guess temporary URL containing a security token suitable for password recovery applications:
es: Generar una URL temporal difícil de adivinar que contenga un token de seguridad adecuado para la recuperación de contraseñas:
