Repository: python/python-docs-es
Catalog: library/selectors.po
Languages: es

source: :mod:`selectors` --- High-level I/O multiplexing
es: :mod:`selectors` — Multiplexación de E/S de alto nivel

source: **Source code:** :source:`Lib/selectors.py`
es: **Código fuente:** :source:`Lib/selectors.py`

source: Introduction
es: Introducción

source: This module allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives. Users are encouraged to use this module instead, unless they want precise control over the OS-level primitives used.
es: Este módulo permite multiplexación de E/S eficiente y de alto nivel, basada en los primitivos del módulo :mod:`select`. Se recomienda a los usuarios utilizar este módulo en su lugar, a menos que deseen un control preciso sobre los primitivos a nivel de sistema operativo utilizados.

source: It defines a :class:`BaseSelector` abstract base class, along with several concrete implementations (:class:`KqueueSelector`, :class:`EpollSelector`...), that can be used to wait for I/O readiness notification on multiple file objects. In the following, "file object" refers to any object with a :meth:`fileno()` method, or a raw file descriptor. See :term:`file object`.
es: Define una clase base abstracta :class:`BaseSelector`, junto con varias implementaciones concretas (:class:`KqueueSelector`, :class:`EpollSelector`…), que se pueden utilizar para esperar la notificación de disponibilidad para E/S en varios objetos de archivo. De aquí en adelante, "objeto de archivo" hace referencia a cualquier objeto con un método :meth:`fileno()` o un descriptor de archivo sin procesar. Véase :term:`file object`.

source: :class:`DefaultSelector` is an alias to the most efficient implementation available on the current platform: this should be the default choice for most users.
es: :class:`DefaultSelector` es un alias de la implementación más eficiente disponible en la plataforma actual: esta debería ser la opción predeterminada para la mayoría de los usuarios.

source: The type of file objects supported depends on the platform: on Windows, sockets are supported, but not pipes, whereas on Unix, both are supported (some other types may be supported as well, such as fifos or special file devices).
es: El tipo de objetos de archivo admitidos depende de la plataforma: en Windows, se admiten sockets, pero no *pipes*, mientras que en Unix, ambos son compatibles (también se pueden admitir algunos otros tipos, como FIFOs o dispositivos de archivo especiales).

source: Low-level I/O multiplexing module.
es: Módulo de multiplexación de E/S de bajo nivel.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este modulo no funciona o no está disponible para plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para más información.

source: Classes
es: Clases

source: Classes hierarchy::
es: Jerarquía de clases::

source: In the following, *events* is a bitwise mask indicating which I/O events should be waited for on a given file object. It can be a combination of the modules constants below:
es: De aquí en adelante, *events* es una máscara bit a bit que indica qué eventos de E/S se deben esperar en un objeto de archivo determinado. Puede ser cualquier combinación de las siguientes constantes de módulo:

source: Constant
es: Constante

source: Meaning
es: Significado

source: Available for read
es: Disponible para lectura

source: Available for write
es: Disponible para escritura

source: A :class:`SelectorKey` is a :class:`~collections.namedtuple` used to associate a file object to its underlying file descriptor, selected event mask and attached data. It is returned by several :class:`BaseSelector` methods.
es: La clase :class:`SelectorKey` es una :class:`~collections.namedtuple` que se utiliza para asociar un objeto de archivo a su descriptor de archivo subyacente, máscara de evento seleccionada y datos adjuntos. Es retornada por varios métodos :class:`BaseSelector`.

source: File object registered.
es: Objeto de archivo registrado.

source: Underlying file descriptor.
es: Descriptor de archivo subyacente.

source: Events that must be waited for on this file object.
es: Eventos que se deben esperar en este objeto de archivo.

source: Optional opaque data associated to this file object: for example, this could be used to store a per-client session ID.
es: Datos opacos opcionales asociados a este objeto de archivo: por ejemplo, podría usarse para almacenar un ID de sesión por cliente.

source: A :class:`BaseSelector` is used to wait for I/O event readiness on multiple file objects. It supports file stream registration, unregistration, and a method to wait for I/O events on those streams, with an optional timeout. It's an abstract base class, so cannot be instantiated. Use :class:`DefaultSelector` instead, or one of :class:`SelectSelector`, :class:`KqueueSelector` etc. if you want to specifically use an implementation, and your platform supports it. :class:`BaseSelector` and its concrete implementations support the :term:`context manager` protocol.
es: Un :class:`BaseSelector` se usa para esperar a que el evento de E/S esté listo en varios objetos de archivo. Admite el registro y la cancelación del registro de secuencias de archivos y un método para esperar eventos de E/S en esas secuencias, con un tiempo de espera opcional. Es una clase base abstracta, por lo que no se puede crear una instancia. Use :class:`DefaultSelector` en su lugar, o un :class:`SelectSelector`, :class:`KqueueSelector`, etc. si deseas usar específicamente una implementación y su plataforma la admite. :class:`BaseSelector` y sus implementaciones concretas soportan el protocolo :term:`context manager`.

source: Register a file object for selection, monitoring it for I/O events.
es: Registra un objeto de archivo para su selección y lo monitoriza en busca de eventos de E/S.

source: *fileobj* is the file object to monitor. It may either be an integer file descriptor or an object with a ``fileno()`` method. *events* is a bitwise mask of events to monitor. *data* is an opaque object.
es: *fileobj* es el objeto de archivo a monitorear. Puede ser un descriptor de archivo de tipo entero o un objeto con un método ``fileno()``. *events* es una máscara bit a bit de eventos para monitorear. *data* es un objeto opaco.

source: This returns a new :class:`SelectorKey` instance, or raises a :exc:`ValueError` in case of invalid event mask or file descriptor, or :exc:`KeyError` if the file object is already registered.
es: Esto retorna una nueva instancia :class:`SelectorKey`, o lanza un :exc:`ValueError` en caso de una máscara de evento o un descriptor de archivo no válidos, o :exc:`KeyError` si el objeto de archivo ya está registrado.

source: Unregister a file object from selection, removing it from monitoring. A file object shall be unregistered prior to being closed.
es: Anula el registro de un objeto de archivo de la selección y lo elimina del monitoreo. Se anulará el registro de un objeto de archivo antes de cerrarlo.

source: *fileobj* must be a file object previously registered.
es: *fileobj* debe ser un objeto de archivo previamente registrado.

source: This returns the associated :class:`SelectorKey` instance, or raises a :exc:`KeyError` if *fileobj* is not registered. It will raise :exc:`ValueError` if *fileobj* is invalid (e.g. it has no ``fileno()`` method or its ``fileno()`` method has an invalid return value).
es: Esto retorna la instancia :class:`SelectorKey` asociada, o lanza un :exc:`KeyError` si *fileobj* no está registrado. Se lanzará un :exc:`ValueError` si *fileobj* no es válido (por ejemplo, no tiene el método ``fileno ()`` o su método ``fileno ()`` tiene un valor de retorno no válido).

source: Change a registered file object's monitored events or attached data.
es: Cambia los eventos monitorizados de un objeto de archivo registrado o los datos adjuntos.

source: This is equivalent to ``BaseSelector.unregister(fileobj)`` followed by ``BaseSelector.register(fileobj, events, data)``, except that it can be implemented more efficiently.
es: Esto es equivalente a `BaseSelector.unregister(fileobj)` seguido de `BaseSelector.register(fileobj, events, data)`, excepto que se puede implementar de manera más eficiente.

source: This returns a new :class:`SelectorKey` instance, or raises a :exc:`ValueError` in case of invalid event mask or file descriptor, or :exc:`KeyError` if the file object is not registered.
es: Esto retorna una nueva instancia de :class:`SelectorKey`, o lanza un :exc:`ValueError` en caso de una máscara de evento o un descriptor de archivo no válidos, o :exc:`KeyError` si el objeto de archivo no está registrado.

source: Wait until some registered file objects become ready, or the timeout expires.
es: Espera hasta que algunos objetos de archivo registrados estén listos o el tiempo de espera expire.

source: If ``timeout > 0``, this specifies the maximum wait time, in seconds. If ``timeout <= 0``, the call won't block, and will report the currently ready file objects. If *timeout* is ``None``, the call will block until a monitored file object becomes ready.
es: Si ``timeout > 0``, esto especifica el tiempo máximo de espera, en segundos. Si ``timeout <= 0``, la llamada no se bloqueará y reportará los objetos de archivo actualmente listos. Si *timeout* es ``None``, la llamada se bloqueará hasta que un objeto de archivo monitorizado esté listo.

source: This returns a list of ``(key, events)`` tuples, one for each ready file object.
es: Retorna una lista de tuplas ``(key, events)``, una por cada objeto de archivo listo.

source: *key* is the :class:`SelectorKey` instance corresponding to a ready file object. *events* is a bitmask of events ready on this file object.
es: *key* es la instancia :class:`SelectorKey` correspondiente a un objeto de archivo listo. *events* es una máscara de bits de eventos listos en este objeto de archivo.

source: This method can return before any file object becomes ready or the timeout has elapsed if the current process receives a signal: in this case, an empty list will be returned.
es: Este método puede regresar antes de que cualquier objeto de archivo esté listo o haya transcurrido el tiempo de espera si el proceso actual recibe una señal: en este caso, se retornará una lista vacía.

source: The selector is now retried with a recomputed timeout when interrupted by a signal if the signal handler did not raise an exception (see :pep:`475` for the rationale), instead of returning an empty list of events before the timeout.
es: El selector ahora se reintenta con un tiempo de espera recalculado cuando es interrumpido por una señal si el gestor de señales no lanzó una excepción (ver :pep:`475` para la justificación), en lugar de retornar una lista vacía de eventos antes del tiempo de espera.

source: Close the selector.
es: Cierra el selector.

source: This must be called to make sure that any underlying resource is freed. The selector shall not be used once it has been closed.
es: Se debe llamar para asegurarse de que se libera cualquier recurso subyacente. El selector no se utilizará una vez cerrado.

source: Return the key associated with a registered file object.
es: Retorna la clave asociada con un objeto de archivo registrado.

source: This returns the :class:`SelectorKey` instance associated to this file object, or raises :exc:`KeyError` if the file object is not registered.
es: Esto retorna la instancia :class:`SelectorKey` asociada a este objeto de archivo, o lanza un :exc:`KeyError` si el objeto de archivo no está registrado.

source: Return a mapping of file objects to selector keys.
es: Retorna un mapeo asociando objetos de archivo a las llaves del selector.

source: This returns a :class:`~collections.abc.Mapping` instance mapping registered file objects to their associated :class:`SelectorKey` instance.
es: Retorna una instancia de :class:`~collections.abc.Mapping` mapeando objetos de archivo registrados a su instancia :class:`SelectorKey` asociada.

source: The default selector class, using the most efficient implementation available on the current platform. This should be the default choice for most users.
es: La clase de selector predeterminada, utiliza la implementación más eficiente disponible en la plataforma actual. Esta debería ser la opción predeterminada para la mayoría de los usuarios.

source: :func:`select.select`-based selector.
es: Selector basado en :func:`select.select`.

source: :func:`select.poll`-based selector.
es: Selector basado en :func:`select.poll`.

source: :func:`select.epoll`-based selector.
es: Selector basado en :func:`select.epoll`.

source: This returns the file descriptor used by the underlying :func:`select.epoll` object.
es: Esto retorna el descriptor de archivo utilizado por el objeto :func:`select.epoll` subyacente.

source: :func:`select.devpoll`-based selector.
es: Selector basado en :func:`select.devpoll`.

source: This returns the file descriptor used by the underlying :func:`select.devpoll` object.
es: Esto retorna el descriptor de archivo utilizado por el objeto :func:`select.devpoll` subyacente.

source: :func:`select.kqueue`-based selector.
es: Selector basado en :func:`select.kqueue`.

source: This returns the file descriptor used by the underlying :func:`select.kqueue` object.
es: Esto retorna el descriptor de archivo utilizado por el objeto :func:`select.kqueue` subyacente.

source: Examples
es: Ejemplos

source: Here is a simple echo server implementation::
es: Aquí hay una implementación simple de un servidor de eco::
