Repository: python/python-docs-es
Catalog: library/shelve.po
Languages: es_es

source: :mod:`shelve` --- Python object persistence
es_es: :mod:`shelve` --- Persistencia de objetos de Python

source: A "shelf" is a persistent, dictionary-like object. The difference with "dbm" databases is that the values (not the keys!) in a shelf can be essentially arbitrary Python objects --- anything that the :mod:`pickle` module can handle. This includes most class instances, recursive data types, and objects containing lots of shared sub-objects. The keys are ordinary strings.
es_es: Un "estante" o *shelve*, es un objeto persistente similar a un diccionario. La diferencia con las bases de datos "dbm" es que los valores (¡no las claves!) en un estante pueden ser esencialmente objetos Python arbitrarios --- cualquier cosa que el módulo :mod:`pickle` pueda manejar. Esto incluye la mayoría de las instancias de clase, tipos de datos recursivos y objetos que contienen muchos subobjetos compartidos. Las claves son cadenas ordinarias.

source: Open a persistent dictionary. The filename specified is the base filename for the underlying database. As a side-effect, an extension may be added to the filename and more than one file may be created. By default, the underlying database file is opened for reading and writing. The optional *flag* parameter has the same interpretation as the *flag* parameter of :func:`dbm.open`.
es_es: Abre un diccionario persistente. El nombre de archivo especificado es el nombre de archivo base para la base de datos subyacente. Como efecto secundario, se puede agregar una extensión al nombre de archivo y se puede crear más de un archivo. De forma predeterminada, el archivo de base de datos subyacente se abre para leer y escribir. El parámetro opcional *flag* tiene la misma interpretación que el parámetro *flag* de :func:`dbm.open`.

source: Because of Python semantics, a shelf cannot know when a mutable persistent-dictionary entry is modified. By default modified objects are written *only* when assigned to the shelf (see :ref:`shelve-example`). If the optional *writeback* parameter is set to ``True``, all entries accessed are also cached in memory, and written back on :meth:`~Shelf.sync` and :meth:`~Shelf.close`; this can make it handier to mutate mutable entries in the persistent dictionary, but, if many entries are accessed, it can consume vast amounts of memory for the cache, and it can make the close operation very slow since all accessed entries are written back (there is no way to determine which accessed entries are mutable, nor which ones were actually mutated).
es_es: Debido a la semántica de Python, un estante no puede saber cuándo se modifica una entrada de diccionario persistente mutable. De forma predeterminada, los objetos modificados se escriben *sólo* cuando se asignan al estante (consulte :ref:`shelve-example`). Si el parámetro opcional *writeback* se establece en ``True``, todas las entradas a las que se accede también se almacenan en caché en la memoria y se vuelven a escribir en :meth:`~Shelf.sync` y :meth:`~Shelf.close`; esto puede hacer que sea más práctico mutar entradas mutables en el diccionario persistente, pero, si se accede a muchas entradas, puede consumir grandes cantidades de memoria para la memoria caché, y puede hacer que la operación de cierre sea muy lenta ya que todas las entradas a las que se accede se vuelven a escribir (no hay manera de determinar qué entradas a las que se accede son mutables, ni cuáles se mutaron realmente).

source: Accepts :term:`path-like object` for filename.
es_es: Acepta :term:`path-like object` por nombre de archivo.

source: Do not rely on the shelf being closed automatically; always call :meth:`~Shelf.close` explicitly when you don't need it any more, or use :func:`shelve.open` as a context manager::
es_es: No confíe en que el estante se cerrará automáticamente; siempre llame a :meth:`~Shelf.close` explícitamente cuando ya no lo necesite, o use :func:`shelve.open` como administrador de contexto::

source: Because the :mod:`shelve` module is backed by :mod:`pickle`, it is insecure to load a shelf from an untrusted source. Like with pickle, loading a shelf can execute arbitrary code.
es_es: Debido a que el módulo :mod:`shelve` está respaldado por :mod:`pickle`, es inseguro cargar un estante desde una fuente que no es de confianza. Al igual que con el *pickle*, cargar un estante puede ejecutar código arbitrario.

source: Shelf objects support most of methods and operations supported by dictionaries (except copying, constructors and operators ``|`` and ``|=``). This eases the transition from dictionary based scripts to those requiring persistent storage.
es_es: Los objetos de estante admiten la mayoría de los métodos y operaciones admitidos por los diccionarios (excepto copiar, constructores y los operadores ``|`` y ``|=``). Esto facilita la transición de scripts basados en diccionarios a aquellos que requieren almacenamiento persistente.

source: Two additional methods are supported:
es_es: Se admiten dos métodos adicionales:

source: Write back all entries in the cache if the shelf was opened with *writeback* set to :const:`True`. Also empty the cache and synchronize the persistent dictionary on disk, if feasible. This is called automatically when the shelf is closed with :meth:`close`.
es_es: Escriba todas las entradas en la caché si el estante se abrió con *writeback* establecido en :const:`True`. También vacíe la caché y sincronice el diccionario persistente en el disco, si es posible. Esto se llama automáticamente cuando el estante se cierra con :meth:`close`.

source: Synchronize and close the persistent *dict* object. Operations on a closed shelf will fail with a :exc:`ValueError`.
es_es: Sincronice y cierre el objeto persistente *dict*. Las operaciones en un estante cerrado fallarán con un :exc:`ValueError`.

source: `Persistent dictionary recipe <https://code.activestate.com/recipes/576642/>`_ with widely supported storage formats and having the speed of native dictionaries.
es_es: `Receta de diccionario persistente <https://code.activestate.com/recipes/576642/>`_ con formatos de almacenamiento ampliamente compatibles y con la velocidad de los diccionarios nativos.

source: Restrictions
es_es: Restricciones

source: The choice of which database package will be used (such as :mod:`dbm.ndbm` or :mod:`dbm.gnu`) depends on which interface is available. Therefore it is not safe to open the database directly using :mod:`dbm`. The database is also (unfortunately) subject to the limitations of :mod:`dbm`, if it is used --- this means that (the pickled representation of) the objects stored in the database should be fairly small, and in rare cases key collisions may cause the database to refuse updates.
es_es: La elección de qué paquete de base de datos se utilizará (como :mod:`dbm.ndbm` o :mod:`dbm.gnu`) depende de la interfaz disponible. Por lo tanto, no es seguro abrir la base de datos directamente usando :mod:`dbm`. La base de datos también está (desafortunadamente) sujeta a las limitaciones de :mod:`dbm`, si se usa --- esto significa que (la representación *pickle* de) los objetos almacenados en la base de datos debe ser bastante pequeña, y en casos raros las colisiones de claves pueden hacer que la base de datos rechace las actualizaciones.

source: The :mod:`shelve` module does not support *concurrent* read/write access to shelved objects. (Multiple simultaneous read accesses are safe.) When a program has a shelf open for writing, no other program should have it open for reading or writing. Unix file locking can be used to solve this, but this differs across Unix versions and requires knowledge about the database implementation used.
es_es: El módulo :mod:`shelve` no admite el acceso *concurrent* de lectura/escritura a los objetos almacenados. (Los accesos de lectura múltiples simultáneos son seguros). Cuando un programa tiene un estante abierto para escritura, ningún otro programa debe tenerlo abierto para lectura o escritura. El bloqueo de archivos Unix se puede usar para resolver esto, pero esto difiere entre las versiones de Unix y requiere conocimiento sobre la implementación de la base de datos utilizada.

source: A subclass of :class:`collections.abc.MutableMapping` which stores pickled values in the *dict* object.
es_es: Una subclase de :class:`collections.abc.MutableMapping` que almacena valores *pickle* en el objeto *dict*.

source: If the *writeback* parameter is ``True``, the object will hold a cache of all entries accessed and write them back to the *dict* at sync and close times. This allows natural operations on mutable entries, but can consume much more memory and make sync and close take a long time.
es_es: Si el parámetro *writeback* es ``True``, el objeto mantendrá un caché de todas las entradas a las que se accedió y las volverá a escribir en el *dict* en las horas de sincronización y cierre. Esto permite operaciones naturales en entradas mutables, pero puede consumir mucha más memoria y hacer que la sincronización y el cierre tomen mucho tiempo.

source: The *keyencoding* parameter is the encoding used to encode keys before they are used with the underlying dict.
es_es: El parámetro *keyencoding* es la codificación utilizada para codificar las claves antes de que se utilicen con el *dict* subyacente.

source: A :class:`Shelf` object can also be used as a context manager, in which case it will be automatically closed when the :keyword:`with` block ends.
es_es: El objeto :class:`Shelf` también se puede utilizar como administrador de contexto, en cuyo caso se cerrará automáticamente cuando finalice el bloque :keyword:`with`.

source: Added the *keyencoding* parameter; previously, keys were always encoded in UTF-8.
es_es: Se agregó el parámetro *keyencoding*; anteriormente, las claves siempre estaban codificadas en UTF-8.

source: Added context manager support.
es_es: Agregado soporte para administrador de contexto.

source: A subclass of :class:`Shelf` which exposes :meth:`first`, :meth:`!next`, :meth:`previous`, :meth:`last` and :meth:`set_location` which are available in the third-party :mod:`bsddb` module from `pybsddb <https://www.jcea.es/programacion/pybsddb.htm>`_ but not in other database modules. The *dict* object passed to the constructor must support those methods. This is generally accomplished by calling one of :func:`bsddb.hashopen`, :func:`bsddb.btopen` or :func:`bsddb.rnopen`. The optional *protocol*, *writeback*, and *keyencoding* parameters have the same interpretation as for the :class:`Shelf` class.
es_es: Una subclase de :class:`Shelf` que expone :meth:`first`, :meth:`!next`, :meth:`previous`, :meth:`last` y :meth:`set_location` que están disponibles en el módulo de terceros :mod:`bsddb` de `pybsddb <https://www.jcea.es/programacion/pybsddb.htm>`_ pero no en otros módulos de base de datos. El objeto *dict* que se pasa al constructor debe admitir esos métodos. Esto se logra generalmente llamando a uno de los siguientes :func:`bsddb.hashopen`, :func:`bsddb.btopen` o :func:`bsddb.rnopen`. Los parámetros opcionales *protocol*, *writeback* y *keyencoding* tienen la misma interpretación que para la clase :class:`Shelf`.

source: A subclass of :class:`Shelf` which accepts a *filename* instead of a dict-like object. The underlying file will be opened using :func:`dbm.open`. By default, the file will be created and opened for both read and write. The optional *flag* parameter has the same interpretation as for the :func:`.open` function. The optional *protocol* and *writeback* parameters have the same interpretation as for the :class:`Shelf` class.
es_es: Una subclase de :class:`Shelf` que acepta un *filename* en lugar de un objeto tipo diccionario (*dict*). El archivo subyacente se abrirá usando :func:`dbm.open`. De forma predeterminada, el archivo se creará y se abrirá tanto para lectura como para escritura. El parámetro opcional *flag* tiene la misma interpretación que para la función :func:`.open`. Los parámetros opcionales *protocol* y *writeback* tienen la misma interpretación que para la clase :class:`Shelf`.

source: Example
es_es: Ejemplo

source: To summarize the interface (``key`` is a string, ``data`` is an arbitrary object)::
es_es: Para resumir la interfaz (``key`` es una cadena de caracteres, ``data`` es un objeto arbitrario)::

source: Module :mod:`dbm`
es_es: Módulo :mod:`dbm`

source: Generic interface to ``dbm``-style databases.
es_es: Interfaz genérica para bases de datos estilo ``dbm``.

source: Module :mod:`pickle`
es_es: Módulo :mod:`pickle`

source: Object serialization used by :mod:`shelve`.
es_es: Serialización de objetos utilizada por :mod:`shelve`.
