Repository: python/python-docs-es
Catalog: library/shlex.po
Languages: es

source: If :attr:`~shlex.whitespace_split` is ``False``, any character not declared to be a word character, whitespace, or a quote will be returned as a single-character token. If it is ``True``, :class:`~shlex.shlex` will only split words in whitespaces;
es: Si :attr:`~shlex.whitepace_split` es ``False``, cualquier carácter que no sea declarado como un carácter de palabra, espacio en blanco, o una cita será retornado como un token de un solo carácter. Si es ``True``, :class:`~shlex.shlex` sólo dividirá las palabras en espacios en blanco;

source: EOF is signaled with an empty string (``''``);
es: EOF es señalado con una cadena de caracteres vacía (``''``);

source: It's not possible to parse empty strings, even if quoted.
es: No es posible analizar cadenas de caracteres vacías, incluso si se citan.

source: When operating in POSIX mode, :class:`~shlex.shlex` will try to obey to the following parsing rules.
es: Cuando se opera en el modo POSIX, :class:`~shlex.shlex` intentará obedecer a las siguientes reglas de análisis.

source: Quotes are stripped out, and do not separate words (``"Do"Not"Separate"`` is parsed as the single word ``DoNotSeparate``);
es: Las comillas se eliminan y no separan las palabras (``"Do"Not"Separate"`` se analiza como la sola palabra ``DoNotSeparate``);

source: Non-quoted escape characters (e.g. ``'\'``) preserve the literal value of the next character that follows;
es: Los caracteres de escape no citados (por ejemplo ``'\'``) conservan el valor literal del siguiente carácter que continua;

source: Enclosing characters in quotes which are not part of :attr:`~shlex.escapedquotes` (e.g. ``"'"``) preserve the literal value of all characters within the quotes;
es: Encerrar caracteres entre comillas que no forman parte de :attr:`~shlex.escapedquotes` (por ejemplo, ``""``) conservan el valor literal de todos los caracteres dentro de las comillas;

source: Enclosing characters in quotes which are part of :attr:`~shlex.escapedquotes` (e.g. ``'"'``) preserves the literal value of all characters within the quotes, with the exception of the characters mentioned in :attr:`~shlex.escape`. The escape characters retain its special meaning only when followed by the quote in use, or the escape character itself. Otherwise the escape character will be considered a normal character.
es: Encerrar caracteres entre comillas que forman parte de :attr:`~shlex.escapedquotes` (por ejemplo, ``""``) conserva el valor literal de todos los caracteres dentro de las comillas, con la excepción de los caracteres mencionados en :attr:`~shlex.escape`. Los caracteres de escape conservan su significado especial solo cuando van seguidos de la comilla en uso, o el propio carácter de escape. De lo contrario, el carácter de escape sera considerado un carácter normal.

source: EOF is signaled with a :const:`None` value;
es: EOF es señalado con un valor :const:`None`;

source: Quoted empty strings (``''``) are allowed.
es: Se permiten cadenas de caracteres vacías entrecomilladas (``''``).

source: Improved Compatibility with Shells
es: Compatibilidad mejorada con intérprete de comandos

source: The :class:`shlex` class provides compatibility with the parsing performed by common Unix shells like ``bash``, ``dash``, and ``sh``. To take advantage of this compatibility, specify the ``punctuation_chars`` argument in the constructor. This defaults to ``False``, which preserves pre-3.6 behaviour. However, if it is set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters is returned as a single token. While this is short of a full parser for shells (which would be out of scope for the standard library, given the multiplicity of shells out there), it does allow you to perform processing of command lines more easily than you could otherwise. To illustrate, you can see the difference in the following snippet:
es: La clase :class:`shlex` provee compatibilidad con el análisis realizado por los intérprete de comandos comunes de Unix como ``bash``, ``dash`` y ``sh``. Para aprovechar esta compatibilidad, especifica el argumento ``punctuation_chars`` en el constructor. Esto por defecto es ``False``, el cual conserva el comportamiento pre-3.6. Sin embargo, si se establece como ``True``, entonces se cambia el análisis de los caracteres ``();<>|&``: cualquier ejecución de estos caracteres se retorna como un único token. Mientras que esto se queda corto en un analizador completo para los intérprete de comandos (que estaría fuera del alcance de la biblioteca estándar, dada la multiplicidad de intérpretes de comandos que hay), te permite realizar el procesamiento de las líneas de comandos más fácilmente de lo que podrías hacerlo de otra manera. Para ilustrarlo, puede ver la diferencia en el siguiente fragmento:

source: Of course, tokens will be returned which are not valid for shells, and you'll need to implement your own error checks on the returned tokens.
es: Por supuesto, se retornarán tokens que no son válidos para los intérpretes de comandos y deberá implementar sus propias comprobaciones de errores en los tokens retornados.

source: Instead of passing ``True`` as the value for the punctuation_chars parameter, you can pass a string with specific characters, which will be used to determine which characters constitute punctuation. For example::
es: En lugar de pasar ``True`` como valor para el parámetro punctuation_chars, puede pasar una cadena con caracteres específicos, que se usará para determinar qué caracteres constituyen puntuación. Por ejemplo::

source: When ``punctuation_chars`` is specified, the :attr:`~shlex.wordchars` attribute is augmented with the characters ``~-./*?=``. That is because these characters can appear in file names (including wildcards) and command-line arguments (e.g. ``--color=auto``). Hence::
es: Cuando es especificado ``punctuation_chars``, el atributo :attr:`~shlex.wordchars` se aumenta con los caracteres ``~-./*?=``. Esto se debe a que estos caracteres pueden aparecer en los nombres de archivo (incluidos los comodines) y en los argumentos de la línea de comandos (por ejemplo, ``--color=auto``). Por lo tanto::

source: However, to match the shell as closely as possible, it is recommended to always use ``posix`` and :attr:`~shlex.whitespace_split` when using :attr:`~shlex.punctuation_chars`, which will negate :attr:`~shlex.wordchars` entirely.
es: Sin embargo, para que coincida con el intérprete de comandos lo más cerca posible, se recomienda utilizar siempre ``posix`` y :attr:`~shlex.whitespace_split` cuando se utiliza :attr:`~shlex.punctuation_chars`, el cual negará por completo :attr:`~shlex.wordchars`.

source: For best effect, ``punctuation_chars`` should be set in conjunction with ``posix=True``. (Note that ``posix=False`` is the default for :class:`~shlex.shlex`.)
es: Para obtener el mejor efecto, ``punctuation_chars`` debe establecerse junto con ``posix=True``. (Tenga en cuenta que ``posix=False`` es el valor predeterminado para :class:`~shlex.shlex`.)
