Repository: python/python-docs-es
Catalog: library/shlex.po
Languages: es

source: :mod:`shlex` --- Simple lexical analysis
es: :mod:`shlex` --- Análisis léxico simple

source: **Source code:** :source:`Lib/shlex.py`
es: **Código fuente:** :source:`Lib/shlex.py`

source: The :class:`~shlex.shlex` class makes it easy to write lexical analyzers for simple syntaxes resembling that of the Unix shell. This will often be useful for writing minilanguages, (for example, in run control files for Python applications) or for parsing quoted strings.
es: La clase :class:`~shlex.shlex` facilita la escritura de analizadores léxicos para sintaxis simples que se parecen al intérprete de comandos de Unix. Esto será a menudo útil para escribir pequeños lenguajes, (por ejemplo, en archivos de control para aplicaciones Python) o para analizar cadenas de texto citadas.

source: The :mod:`shlex` module defines the following functions:
es: El módulo :mod:`shlex` define las siguientes funciones:

source: Split the string *s* using shell-like syntax. If *comments* is :const:`False` (the default), the parsing of comments in the given string will be disabled (setting the :attr:`~shlex.commenters` attribute of the :class:`~shlex.shlex` instance to the empty string). This function operates in POSIX mode by default, but uses non-POSIX mode if the *posix* argument is false.
es: Divide la cadena de caracteres *s* usando una sintaxis similar a la de un intérprete de comandos. Si *comments* es :const:`False` (por defecto), el análisis de los comentarios en la cadena de caracteres dada sera deshabilitada (estableciendo el atributo :attr:`~shlex.commenters` de la instancia :class:`~shlex.shlex` a la cadena de caracteres vacía). Esta función trabaja en modo POSIX por defecto, pero utiliza el modo non-POSIX si el argumento *posix* es falso.

source: Passing ``None`` for *s* argument now raises an exception, rather than reading :data:`sys.stdin`.
es: Pasar ``None`` para el argumento *s* ahora lanza una excepción, en lugar de leer :data:`sys.stdin`.

source: Concatenate the tokens of the list *split_command* and return a string. This function is the inverse of :func:`split`.
es: Concatena los tokens de la lista *split_command* y retorna una cadena. Esta función es la inversa de :func:`split`.

source: The returned value is shell-escaped to protect against injection vulnerabilities (see :func:`quote`).
es: El valor retornado se escapa del intérprete de comandos para protegerlo contra vulnerabilidades de inyección (consulte :func:`quote`).

source: Return a shell-escaped version of the string *s*. The returned value is a string that can safely be used as one token in a shell command line, for cases where you cannot use a list.
es: Retorna una versión con escape del intérprete de comandos de la cadena *s*. El valor retornado es una cadena que se puede usar de forma segura como un token en un intérprete de línea de comandos, para los casos en los que no se puede usar una lista.

source: The ``shlex`` module is **only designed for Unix shells**.
es: El módulo ``shlex`` **solo está diseñado para los intérpretes de comandos UNIX**.

source: The :func:`quote` function is not guaranteed to be correct on non-POSIX compliant shells or shells from other operating systems such as Windows. Executing commands quoted by this module on such shells can open up the possibility of a command injection vulnerability.
es: No se garantiza que la función :func:`quote` sea correcta en shells no compatibles con POSIX o shells de otros sistemas operativos como Windows. La ejecución de comandos citados por este módulo en tales shells puede abrir la posibilidad de una vulnerabilidad de inyección de comandos.

source: Consider using functions that pass command arguments with lists such as :func:`subprocess.run` with ``shell=False``.
es: Considere el uso de funciones que pasen argumentos mediante listas tal como :func:`subprocess.run` con ``shell=False``.

source: This idiom would be unsafe:
es: Este idioma sería inseguro:

source: :func:`quote` lets you plug the security hole:
es: :func:`quote` te permite tapar el agujero de seguridad:

source: The quoting is compatible with UNIX shells and with :func:`split`:
es: La cita es compatible con los intérpretes de comandos UNIX y con :func:`split`:

source: The :mod:`shlex` module defines the following class:
es: El módulo :mod:`shlex` define las siguientes clases:

source: A :class:`~shlex.shlex` instance or subclass instance is a lexical analyzer object. The initialization argument, if present, specifies where to read characters from. It must be a file-/stream-like object with :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` methods, or a string. If no argument is given, input will be taken from ``sys.stdin``. The second optional argument is a filename string, which sets the initial value of the :attr:`~shlex.infile` attribute. If the *instream* argument is omitted or equal to ``sys.stdin``, this second argument defaults to "stdin". The *posix* argument defines the operational mode: when *posix* is not true (default), the :class:`~shlex.shlex` instance will operate in compatibility mode. When operating in POSIX mode, :class:`~shlex.shlex` will try to be as close as possible to the POSIX shell parsing rules. The *punctuation_chars* argument provides a way to make the behaviour even closer to how real shells parse. This can take a number of values: the default value, ``False``, preserves the behaviour seen under Python 3.5 and earlier. If set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters (considered punctuation characters) is returned as a single token. If set to a non-empty string of characters, those characters will be used as the punctuation characters. Any characters in the :attr:`wordchars` attribute that appear in *punctuation_chars* will be removed from :attr:`wordchars`. See :ref:`improved-shell-compatibility` for more information. *punctuation_chars* can be set only upon :class:`~shlex.shlex` instance creation and can't be modified later.
es: Una instancia o instancia de la subclase :class:`~shlex.shlex` es un objeto de analizador léxico. El argumento de inicialización, si está presente, especifica de dónde leer caracteres. Debe ser un objeto similar a un archivo/stream con los métodos :meth:`~io.TextIOBase.read` y :meth:`~io.TextIOBase.readline` o una cadena de caracteres. Si no se da ningún argumento, la entrada se tomará de ``sys.stdin``. El segundo argumento opcional es una cadena de nombre de archivo, que establece el valor inicial del atributo :attr:`~shlex.infile`. Si el argumento *instream* es omitido o es igual a ``sys.stdin``, este segundo argumento tiene como valor predeterminado "stdin". El argumento *posix* define el modo operativo: cuando *posix* no es true (predeterminado), la instancia :class:`~shlex.shlex` funcionará en modo de compatibilidad. Cuando se opera en modo POSIX, :class:`~shlex.shlex` intentará estar lo más cerca posible de las reglas de análisis de el intérprete de comandos POSIX. El argumento *punctuation_chars* proporciona una manera de hacer que el comportamiento sea aún más cercano a la forma en que se analizan los intérpretes de comandos reales. Esto puede tomar una serie de valores: el valor predeterminado, ``False``, conserva el comportamiento visto en Python 3.5 y versiones anteriores. Si se establece en ``True``, se cambia el análisis de los caracteres ``();<>|&``: cualquier ejecución de estos caracteres (caracteres considerados de puntuación) se retorna como un único token. Si se establece en una cadena de caracteres no vacía, esos caracteres se utilizarán como caracteres de puntuación. Los caracteres del atributo :attr:`wordchars` que aparecen en *punctuation_chars* se eliminarán de :attr:`wordchars`. Consulte :ref:`improved-shell-compatibility` para obtener más información. *punctuation_chars* solo se puede establecer en la creación de la instancia :class:`~shlex.shlex` y no se puede modificar más adelante.

source: The *punctuation_chars* parameter was added.
es: Se añadió el parámetro *punctuation_chars*.

source: Module :mod:`configparser`
es: Módulo :mod:`configparser`

source: Parser for configuration files similar to the Windows :file:`.ini` files.
es: Analizador de archivos de configuración similares a los archivos :file:`.ini` de Windows.

source: shlex Objects
es: objetos ``shlex``

source: A :class:`~shlex.shlex` instance has the following methods:
es: Una instancia :class:`~shlex.shlex` tiene los siguientes métodos:

source: Return a token. If tokens have been stacked using :meth:`push_token`, pop a token off the stack. Otherwise, read one from the input stream. If reading encounters an immediate end-of-file, :attr:`eof` is returned (the empty string (``''``) in non-POSIX mode, and ``None`` in POSIX mode).
es: Retorna un token. Si los tokens han sido apiladas usando :meth:`push_token`, saca una ficha de la pila. De lo contrario, lee uno de la secuencia de entrada. Si la lectura encuentra un fin de archivo inmediato, :attr:`eof` se retorna (la cadena de caracteres vacía (``''``) en modo no-POSIX, y ``None`` en modo POSIX).

source: Push the argument onto the token stack.
es: Coloca el argumento en la pila de tokens.

source: Read a raw token. Ignore the pushback stack, and do not interpret source requests. (This is not ordinarily a useful entry point, and is documented here only for the sake of completeness.)
es: Lee un token sin procesar. Ignora la pila de retroceso y no interpreta las peticiones de la fuente. (Este no es normalmente un punto de entrada útil, y está documentado aquí sólo para completarlo.)

source: When :class:`~shlex.shlex` detects a source request (see :attr:`source` below) this method is given the following token as argument, and expected to return a tuple consisting of a filename and an open file-like object.
es: Cuando :class:`~shlex.shlex` detecta una petición de fuente (ver :attr:`source` abajo) este método recibe el siguiente token como argumento, y se espera que retorne una tupla que consista en un nombre de archivo y un archivo abierto como objeto.

source: Normally, this method first strips any quotes off the argument. If the result is an absolute pathname, or there was no previous source request in effect, or the previous source was a stream (such as ``sys.stdin``), the result is left alone. Otherwise, if the result is a relative pathname, the directory part of the name of the file immediately before it on the source inclusion stack is prepended (this behavior is like the way the C preprocessor handles ``#include "file.h"``).
es: Normalmente, este método primero elimina las comillas del argumento. Si el resultado es un nombre de ruta absoluto, o no había ninguna solicitud de origen anterior en vigor, o el origen anterior era una secuencia (como ``sys.stdin``), el resultado se deja solo. De lo contrario, si el resultado es un nombre de ruta relativo, la parte del directorio del nombre del archivo se pone inmediatamente antes en la pila de inclusión de origen (este comportamiento es similar a la forma en que el preprocesador de C controla ``#include "file.h"``).

source: The result of the manipulations is treated as a filename, and returned as the first component of the tuple, with :func:`open` called on it to yield the second component. (Note: this is the reverse of the order of arguments in instance initialization!)
es: El resultado de las manipulaciones se trata como un nombre de archivo y se retorna como el primer componente de la tupla, con :func:`open` llamado en él para producir el segundo componente. (Nota: esto es lo contrario del orden de los argumentos en la inicialización de instancia!)

source: This hook is exposed so that you can use it to implement directory search paths, addition of file extensions, and other namespace hacks. There is no corresponding 'close' hook, but a shlex instance will call the :meth:`~io.IOBase.close` method of the sourced input stream when it returns EOF.
es: Este enlace se expone para que pueda usarlo para implementar rutas de búsqueda de directorios, adición de extensiones de archivo y otros trucos de espacios de nombres. No hay ningún enlace 'close' correspondiente, pero una instancia de ``shlex`` llamará el método :meth:`~io.IOBase.close` de la secuencia de entrada de origen cuando retorna EOF.

source: For more explicit control of source stacking, use the :meth:`push_source` and :meth:`pop_source` methods.
es: Para un control más explícito del apilamiento de código fuente, utilice los métodos :meth:`push_source` y :meth:`pop_source`.

source: Push an input source stream onto the input stack. If the filename argument is specified it will later be available for use in error messages. This is the same method used internally by the :meth:`sourcehook` method.
es: Inserta una secuencia de fuente de entrada en la pila de entrada. Si se especifica el argumento de nombre de archivo, más adelante estará disponible para su uso en mensajes de error. Este es el mismo método utilizado internamente por el método :meth:`sourcehook`.

source: Pop the last-pushed input source from the input stack. This is the same method used internally when the lexer reaches EOF on a stacked input stream.
es: Saca la última fuente de entrada de la pila de entrada. Este es el mismo método que el analizador léxico utiliza cuando llega al EOF en una secuencia de entrada apilada.

source: This method generates an error message leader in the format of a Unix C compiler error label; the format is ``'"%s", line %d: '``, where the ``%s`` is replaced with the name of the current source file and the ``%d`` with the current input line number (the optional arguments can be used to override these).
es: Este método genera un mensaje de error líder en el formato de una etiqueta de error del compilador de Unix C; el formato es ``'"%s", line %d: '``, donde el ``%s`` es reemplazado con el nombre del archivo fuente actual y el ``%d`` con el número de línea de entrada actual (los argumentos opcionales pueden ser usado para sobrescribir estos).

source: This convenience is provided to encourage :mod:`shlex` users to generate error messages in the standard, parseable format understood by Emacs and other Unix tools.
es: Esta conveniencia se proporciona para animar a los usuarios de :mod:`shlex` a generar mensajes de error en el formato estándar y analizable que entienden Emacs y otras herramientas de Unix.

source: Instances of :class:`~shlex.shlex` subclasses have some public instance variables which either control lexical analysis or can be used for debugging:
es: Las instancias de las subclases :class:`~shlex.shlex` tienen algunas variables de instancia pública que controlan el análisis léxico o pueden ser usadas para la depuración:

source: The string of characters that are recognized as comment beginners. All characters from the comment beginner to end of line are ignored. Includes just ``'#'`` by default.
es: La cadena de caracteres que son reconocidos como comentarios de principiantes. Todos los caracteres desde el comentario principiante hasta el final de la línea son ignorados. Incluye sólo ``'#'`` por defecto.

source: The string of characters that will accumulate into multi-character tokens. By default, includes all ASCII alphanumerics and underscore. In POSIX mode, the accented characters in the Latin-1 set are also included. If :attr:`punctuation_chars` is not empty, the characters ``~-./*?=``, which can appear in filename specifications and command line parameters, will also be included in this attribute, and any characters which appear in ``punctuation_chars`` will be removed from ``wordchars`` if they are present there. If :attr:`whitespace_split` is set to ``True``, this will have no effect.
es: La cadena de caracteres que se acumulará en tokens de varios caracteres. Por defecto, incluye todos los alfanuméricos ASCII y el subrayado. En el modo POSIX, los caracteres acentuados del conjunto Latin-1 también están incluidos. Si :attr:`punctuation_chars` no está vacío, los caracteres ``~-./*?=``, que pueden aparecer en las especificaciones del nombre de archivo y en los parámetros de la línea de comandos, también se incluirán en este atributo, y cualquier carácter que aparezca en ``punctuation_chars`` será eliminado de ``wordchars`` si están presentes allí. Si :attr:`whitespace_split` se establece en ``True``, esto no tendrá ningún efecto.

source: Characters that will be considered whitespace and skipped. Whitespace bounds tokens. By default, includes space, tab, linefeed and carriage-return.
es: Caracteres que serán considerados como espacio en blanco y salteados. El espacio blanco limita los tokens. Por defecto, incluye espacio, tabulación, salto de línea y retorno de carro.

source: Characters that will be considered as escape. This will be only used in POSIX mode, and includes just ``'\'`` by default.
es: Caracteres que serán considerados como de escape. Esto sólo se usará en el modo POSIX, e incluye sólo ``'\'`` por defecto.

source: Characters that will be considered string quotes. The token accumulates until the same quote is encountered again (thus, different quote types protect each other as in the shell.) By default, includes ASCII single and double quotes.
es: Los caracteres que serán considerados como citas de la cadena. El token se acumula hasta que la misma cita se encuentra de nuevo (así, los diferentes tipos de citas se protegen entre sí como en el intérprete de comandos.) Por defecto, incluye ASCII comillas simples y dobles.

source: Characters in :attr:`quotes` that will interpret escape characters defined in :attr:`escape`. This is only used in POSIX mode, and includes just ``'"'`` by default.
es: Caracteres en :attr:`quotes` que interpretarán los caracteres de escape definidos en :attr:`escape`. Esto sólo se usa en el modo POSIX, e incluye sólo ``'"'`` por defecto.

source: If ``True``, tokens will only be split in whitespaces. This is useful, for example, for parsing command lines with :class:`~shlex.shlex`, getting tokens in a similar way to shell arguments. When used in combination with :attr:`punctuation_chars`, tokens will be split on whitespace in addition to those characters.
es: Si es ``True``, los tokens sólo se dividirán en espacios en blanco. Esto es útil, por ejemplo, para analizar las líneas de comando con :class:`~shlex.shlex`, obteniendo los tokens de forma similar a los argumentos de el intérprete de comandos. Cuando se utiliza en combinación con :attr:`puntuation_chars`, los tokens se dividirán en espacios en blanco además de esos caracteres.

source: The :attr:`punctuation_chars` attribute was made compatible with the :attr:`whitespace_split` attribute.
es: El atributo :attr:`puntuation_chars` se hizo compatible con el atributo :attr:`whitespace_split`.

source: The name of the current input file, as initially set at class instantiation time or stacked by later source requests. It may be useful to examine this when constructing error messages.
es: El nombre del archivo de entrada actual, como se estableció inicialmente al momento de la instanciación de la clase o apilado por solicitudes de fuente posteriores. Puede ser útil examinar esto cuando se construyan mensajes de error.

source: The input stream from which this :class:`~shlex.shlex` instance is reading characters.
es: El flujo de entrada del cual esta instancia :class:`~shlex.shlex` está leyendo caracteres.

source: This attribute is ``None`` by default. If you assign a string to it, that string will be recognized as a lexical-level inclusion request similar to the ``source`` keyword in various shells. That is, the immediately following token will be opened as a filename and input will be taken from that stream until EOF, at which point the :meth:`~io.IOBase.close` method of that stream will be called and the input source will again become the original input stream. Source requests may be stacked any number of levels deep.
es: Este atributo es ``None`` por defecto. Si le asignas una cadena, esa cadena será reconocida como una solicitud de inclusión a nivel léxico similar a la palabra clave ``source`` en varios intérpretes de comandos. Es decir, el token inmediatamente siguiente se abrirá como un nombre de archivo y la entrada se tomará de ese flujo hasta EOF, en cuyo momento se llamará al método :meth:`~io.IOBase.close` de ese flujo y la fuente de entrada se convertirá de nuevo en el flujo de entrada original. Las peticiones de origen pueden ser apiladas a cualquier número de niveles de profundidad.

source: If this attribute is numeric and ``1`` or more, a :class:`~shlex.shlex` instance will print verbose progress output on its behavior. If you need to use this, you can read the module source code to learn the details.
es: Si este atributo es numérico y ``1`` o más, una instancia :class:`~shlex.shlex` imprimirá una salida de progreso verboso en su comportamiento. Si necesitas usar esto, puedes leer el código fuente del módulo para conocer los detalles.

source: Source line number (count of newlines seen so far plus one).
es: Numero de linea de fuente (conteo de las nuevas lineas vistas hasta ahora mas uno).

source: The token buffer. It may be useful to examine this when catching exceptions.
es: El buffer de tokens. Puede ser útil examinarlo cuando se capturan excepciones.

source: Token used to determine end of file. This will be set to the empty string (``''``), in non-POSIX mode, and to ``None`` in POSIX mode.
es: Token usado para determinar el final del archivo. Esto se ajustará a la cadena de caracteres vacía (``''``), en el modo no-POSIX, y a ``None`` en el modo POSIX.

source: A read-only property. Characters that will be considered punctuation. Runs of punctuation characters will be returned as a single token. However, note that no semantic validity checking will be performed: for example, '>>>' could be returned as a token, even though it may not be recognised as such by shells.
es: Una propiedad de sólo lectura. Caracteres que serán considerados como puntuación. Las series de caracteres de puntuación se retornarán como un único token. Sin embargo, tenga en cuenta que no se realizará ninguna comprobación de validez semántica: por ejemplo, '>>>' podría ser retornado como un token, aunque no sea reconocido como tal por los intérpretes de comandos.

source: Parsing Rules
es: Reglas de análisis

source: When operating in non-POSIX mode, :class:`~shlex.shlex` will try to obey to the following rules.
es: Cuando se opera en modo no-POSIX, :class:`~shlex.shlex` intentará obedecer las siguientes reglas.

source: Quote characters are not recognized within words (``Do"Not"Separate`` is parsed as the single word ``Do"Not"Separate``);
es: Los caracteres entre comillas no son reconocidos dentro de las palabras (``Do"Not"Separate`` es analizado como la única palabra ``Do"Not"Separate``);

source: Escape characters are not recognized;
es: Los caracteres de escape no son reconocidos;

source: Enclosing characters in quotes preserve the literal value of all characters within the quotes;
es: El encerrar los caracteres entre comillas preserva el valor literal de todos los caracteres dentro de las comillas;

source: Closing quotes separate words (``"Do"Separate`` is parsed as ``"Do"`` and ``Separate``);
es: Las comillas finales separan las palabras (``"Do"Separate`` es analizado como ``"Do"`` y ``Separate``);
