Repository: python/python-docs-es
Catalog: library/smtplib.po
Languages: es

source: *authobject* must be a callable object taking an optional single argument:
es: *authobject* debe ser un objeto invocable que tome un único argumento opcional:

source: If optional keyword argument *initial_response_ok* is true, ``authobject()`` will be called first with no argument. It can return the :rfc:`4954` "initial response" ASCII ``str`` which will be encoded and sent with the ``AUTH`` command as below. If the ``authobject()`` does not support an initial response (e.g. because it requires a challenge), it should return ``None`` when called with ``challenge=None``. If *initial_response_ok* is false, then ``authobject()`` will not be called first with ``None``.
es: Si la verificación de respuesta inicial devuelve ``None``, o si *initial_response_ok* es falso, se llamará a ``authobject()`` para procesar la respuesta de desafío del servidor; el argumento *challenge* que se pasa será un ``bytes``. Debería devolver *data* ASCII ``str`` que serán codificados en base64 y enviados al servidor.

source: If the initial response check returns ``None``, or if *initial_response_ok* is false, ``authobject()`` will be called to process the server's challenge response; the *challenge* argument it is passed will be a ``bytes``. It should return ASCII ``str`` *data* that will be base64 encoded and sent to the server.
es: Si la verificación de respuesta inicial devuelve ``None``, o si *initial_response_ok* es falso, se llamará a ``authobject()`` para procesar la respuesta de desafío del servidor; el argumento *challenge* que se pasa será un ``bytes``. Debería devolver *data* ASCII ``str`` que serán codificados en base64 y enviados al servidor.

source: The ``SMTP`` class provides ``authobjects`` for the ``CRAM-MD5``, ``PLAIN``, and ``LOGIN`` mechanisms; they are named ``SMTP.auth_cram_md5``, ``SMTP.auth_plain``, and ``SMTP.auth_login`` respectively. They all require that the ``user`` and ``password`` properties of the ``SMTP`` instance are set to appropriate values.
es: La clase ``SMTP`` proporciona ``authobjects`` para los mecanismos ``CRAM-MD5``, ``PLAIN`` y ``LOGIN``; se denominan ``SMTP.auth_cram_md5``, ``SMTP.auth_plain`` y ``SMTP.auth_login`` respectivamente. Todos requieren que las propiedades de ``user`` y ``password`` de la instancia ``SMTP`` se establezcan en los valores adecuados.

source: User code does not normally need to call ``auth`` directly, but can instead call the :meth:`login` method, which will try each of the above mechanisms in turn, in the order listed. ``auth`` is exposed to facilitate the implementation of authentication methods not (or not yet) supported directly by :mod:`smtplib`.
es: El código de usuario normalmente no necesita llamar a ``auth`` directamente, sino que puede llamar al método :meth:`login`, que probará cada uno de los mecanismos anteriores a su vez, en el orden indicado. ``auth`` está expuesto para facilitar la implementación de métodos de autenticación que no (o aún no) son compatibles directamente con :mod:`smtplib`.

source: Put the SMTP connection in TLS (Transport Layer Security) mode. All SMTP commands that follow will be encrypted. You should then call :meth:`ehlo` again.
es: Ponga la conexión SMTP en modo TLS (Seguridad de la capa de transporte). Todos los comandos SMTP que siguen se cifrarán. Entonces deberías llamar a :meth:`ehlo` de nuevo.

source: If *keyfile* and *certfile* are provided, they are used to create an :class:`ssl.SSLContext`.
es: Si se proporcionan *keyfile* y *certfile*, se utilizan para crear una :class:`ssl.SSLContext`.

source: Optional *context* parameter is an :class:`ssl.SSLContext` object; This is an alternative to using a keyfile and a certfile and if specified both *keyfile* and *certfile* should be ``None``.
es: El parámetro *context* opcional es un objeto :class:`ssl.SSLContext`; Esta es una alternativa al uso de un archivo de claves y un archivo de certificado y, si se especifica, tanto *keyfile* como *certfile* deben ser ``None``.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first.
es: Si no ha habido ningún comando ``EHLO`` o ``HELO`` anterior en esta sesión, este método intenta ESMTP ``EHLO`` primero.

source: The server does not support the STARTTLS extension.
es: El servidor no admite la extensión STARTTLS.

source: SSL/TLS support is not available to your Python interpreter.
es: La compatibilidad con SSL/TLS no está disponible para su intérprete de Python.

source: The method now supports hostname check with :attr:`SSLContext.check_hostname` and *Server Name Indicator* (see :data:`~ssl.HAS_SNI`).
es: El método ahora admite la verificación del nombre de host con :attr:`SSLContext.check_hostname` y *Server Name Indicator* (ver :data:`~ssl.HAS_SNI`).

source: The error raised for lack of STARTTLS support is now the :exc:`SMTPNotSupportedError` subclass instead of the base :exc:`SMTPException`.
es: El error generado por falta de compatibilidad con STARTTLS ahora es la subclase :exc:`SMTPNotSupportedError` en lugar de la base :exc:`SMTPException`.

source: Send mail. The required arguments are an :rfc:`822` from-address string, a list of :rfc:`822` to-address strings (a bare string will be treated as a list with 1 address), and a message string. The caller may pass a list of ESMTP options (such as ``8bitmime``) to be used in ``MAIL FROM`` commands as *mail_options*. ESMTP options (such as ``DSN`` commands) that should be used with all ``RCPT`` commands can be passed as *rcpt_options*. (If you need to use different ESMTP options to different recipients you have to use the low-level methods such as :meth:`mail`, :meth:`rcpt` and :meth:`data` to send the message.)
es: Enviar correo. Los argumentos requeridos son :rfc:`822` cadena de dirección de origen, una lista de :rfc:`822` cadenas de dirección (una cadena simple se tratará como una lista con 1 dirección) y una cadena de mensaje. La persona que llama puede pasar una lista de opciones de ESMTP (como ``8bitmime``) para usar en los comandos ``MAIL FROM`` como *mail_options*. Las opciones de ESMTP (como los comandos ``DSN``) que deben usarse con todos los comandos ``RCPT`` se pueden pasar como *rcpt_options*. (Si necesita usar diferentes opciones de ESMTP para diferentes destinatarios, debe usar los métodos de bajo nivel como :meth:`mail`, :meth:`rcpt` y :meth:`data` para enviar el mensaje).

source: The *from_addr* and *to_addrs* parameters are used to construct the message envelope used by the transport agents. ``sendmail`` does not modify the message headers in any way.
es: Los parámetros *from_addr* y *to_addrs* se utilizan para construir el sobre del mensaje utilizado por los agentes de transporte. ``sendmail`` no modifica los encabezados de los mensajes de ninguna manera.

source: *msg* may be a string containing characters in the ASCII range, or a byte string. A string is encoded to bytes using the ascii codec, and lone ``\r`` and ``\n`` characters are converted to ``\r\n`` characters. A byte string is not modified.
es: *msg* puede ser una cadena que contenga caracteres en el rango ASCII o una cadena de bytes. Una cadena se codifica en bytes utilizando el códec ascii, y los caracteres ``\r`` y ``\n`` solitarios se convierten en caracteres ``\ r\n``. Una cadena de bytes no se modifica.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. If the server does ESMTP, message size and each of the specified options will be passed to it (if the option is in the feature set the server advertises). If ``EHLO`` fails, ``HELO`` will be tried and ESMTP options suppressed.
es: Si no ha habido ningún comando ``EHLO`` o ``HELO`` anterior en esta sesión, este método prueba primero ESMTP ``EHLO``. Si el servidor utiliza ESMTP, se le pasará el tamaño del mensaje y cada una de las opciones especificadas (si la opción está en el conjunto de funciones que anuncia el servidor). Si ``EHLO`` falla, se probará ``HELO`` y se eliminarán las opciones de ESMTP.

source: This method will return normally if the mail is accepted for at least one recipient. Otherwise it will raise an exception. That is, if this method does not raise an exception, then someone should get your mail. If this method does not raise an exception, it returns a dictionary, with one entry for each recipient that was refused. Each entry contains a tuple of the SMTP error code and the accompanying error message sent by the server.
es: Este método volverá normalmente si se acepta el correo para al menos un destinatario. De lo contrario, lanzará una excepción. Es decir, si este método no genera una excepción, alguien debería recibir su correo. Si este método no genera una excepción, devuelve un diccionario, con una entrada para cada destinatario rechazado. Cada entrada contiene una tupla del código de error SMTP y el mensaje de error adjunto enviado por el servidor.

source: If ``SMTPUTF8`` is included in *mail_options*, and the server supports it, *from_addr* and *to_addrs* may contain non-ASCII characters.
es: Si se incluye ``SMTPUTF8``' en *mail_options * y el servidor lo admite, *from_addr* y *to_addrs* pueden contener caracteres no ASCII.

source: This method may raise the following exceptions:
es: Este método puede lanzar las siguientes excepciones:

source: All recipients were refused. Nobody got the mail. The :attr:`recipients` attribute of the exception object is a dictionary with information about the refused recipients (like the one returned when at least one recipient was accepted).
es: Todos los destinatarios fueron rechazados. Nadie recibió el correo. El atributo :attr:`recipients` del objeto de excepción es un diccionario con información sobre los destinatarios rechazados (como el que se retorna cuando se aceptó al menos un destinatario).

source: The server didn't accept the *from_addr*.
es: El servidor no aceptó el *from_addr*.

source: The server replied with an unexpected error code (other than a refusal of a recipient).
es: El servidor respondió con un código de error inesperado (que no sea el rechazo de un destinatario).

source: ``SMTPUTF8`` was given in the *mail_options* but is not supported by the server.
es: Se proporcionó ``SMTPUTF8`` en *mail_options* pero el servidor no lo admite.

source: Unless otherwise noted, the connection will be open even after an exception is raised.
es: A menos que se indique lo contrario, la conexión estará abierta incluso después de que se lance una excepción.

source: *msg* may be a byte string.
es: *msg* puede ser una cadena de bytes.

source: ``SMTPUTF8`` support added, and :exc:`SMTPNotSupportedError` may be raised if ``SMTPUTF8`` is specified but the server does not support it.
es: Se agregó compatibilidad con ``SMTPUTF8``, así que la :exc:`SMTPNotSupportedError` puede ser lanzada si se especifica ``SMTPUTF8`` ya que el servidor no lo admite.

source: This is a convenience method for calling :meth:`sendmail` with the message represented by an :class:`email.message.Message` object. The arguments have the same meaning as for :meth:`sendmail`, except that *msg* is a ``Message`` object.
es: Este es un método conveniente para llamar a :meth:`sendmail` con el mensaje representado por un objeto :class:`email.message.Message`. Los argumentos tienen el mismo significado que para :meth:`sendmail`, excepto que *msg* es un objeto ``Mensaje``.

source: If *from_addr* is ``None`` or *to_addrs* is ``None``, ``send_message`` fills those arguments with addresses extracted from the headers of *msg* as specified in :rfc:`5322`\: *from_addr* is set to the :mailheader:`Sender` field if it is present, and otherwise to the :mailheader:`From` field. *to_addrs* combines the values (if any) of the :mailheader:`To`, :mailheader:`Cc`, and :mailheader:`Bcc` fields from *msg*. If exactly one set of :mailheader:`Resent-*` headers appear in the message, the regular headers are ignored and the :mailheader:`Resent-*` headers are used instead. If the message contains more than one set of :mailheader:`Resent-*` headers, a :exc:`ValueError` is raised, since there is no way to unambiguously detect the most recent set of :mailheader:`Resent-` headers.
es: Si *from_addr* es ``None`` o *to_addrs* es ``None``, ``send_message`` llena esos argumentos con direcciones extraídas de los encabezados de *msg* como se especifica en :rfc:`5322`\: *from_addr* se establece en el campo :mailheader:`Sender` si está presente, y de lo contrario, en el campo :mailheader:`From`. *to_addrs* combina los valores (si los hay) de los campos :mailheader:`To`, :mailheader:`Cc` y :mailheader:`Bcc` de *msg*. Si aparece exactamente un conjunto de encabezados :mailheader:`Resent-*` en el mensaje, los encabezados normales se ignoran y en su lugar se utilizan los encabezados :mailheader:`Resent- *`. Si el mensaje contiene más de un conjunto de encabezados :mailheader:`Resent-*`, se lanza un :exc:`ValueError`, ya que no hay forma de detectar sin ambigüedades el conjunto más reciente de encabezados :mailheader:`Resent-`.

source: ``send_message`` serializes *msg* using :class:`~email.generator.BytesGenerator` with ``\r\n`` as the *linesep*, and calls :meth:`sendmail` to transmit the resulting message. Regardless of the values of *from_addr* and *to_addrs*, ``send_message`` does not transmit any :mailheader:`Bcc` or :mailheader:`Resent-Bcc` headers that may appear in *msg*. If any of the addresses in *from_addr* and *to_addrs* contain non-ASCII characters and the server does not advertise ``SMTPUTF8`` support, an :exc:`SMTPNotSupported` error is raised. Otherwise the ``Message`` is serialized with a clone of its :mod:`~email.policy` with the :attr:`~email.policy.EmailPolicy.utf8` attribute set to ``True``, and ``SMTPUTF8`` and ``BODY=8BITMIME`` are added to *mail_options*.
es: ``send_message`` serializa *msg* usando :class:`~email.generator.BytesGenerator` con``\ r \ n`` como *linesep*, y llama a :meth:`sendmail` para transmitir el mensaje resultante. Independientemente de los valores de *from_addr* y *to_addrs*, ``send_message`` no transmite ningún encabezado :mailheader:`Bcc` o :mailheader:`Resent-Bcc` que puedan aparecer en *msg*. Si alguna de las direcciones en *from_addr* y *to_addrs* contiene caracteres que no son ASCII y el servidor no anuncia la compatibilidad con ``SMTPUTF8``, se lanza un error :exc:`SMTPNotSupported`. De lo contrario, el ``Message`` se serializa con un clon de su :mod:`~email.policy` con el atributo :attr:`~email.policy.EmailPolicy.utf8` establecido en ``True`` y ``SMTPUTF8`` y ``BODY=8BITMIME`` se agregan a *mail_options*.

source: Support for internationalized addresses (``SMTPUTF8``).
es: Soporte para direcciones internacionalizadas (``SMTPUTF8``).

source: Terminate the SMTP session and close the connection. Return the result of the SMTP ``QUIT`` command.
es: Termine la sesión SMTP y cierre la conexión. Retorna el resultado del comando SMTP ``QUIT``.

source: Low-level methods corresponding to the standard SMTP/ESMTP commands ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT``, and ``DATA`` are also supported. Normally these do not need to be called directly, so they are not documented here. For details, consult the module code.
es: Los métodos de bajo nivel correspondientes a los comandos estándar SMTP/ESMTP ```HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT``, y ``DATA`` también están soportados. Normalmente, no es necesario llamarlos directamente, por lo que no se documentan aquí. Para más detalles, consulte el código del módulo.

source: SMTP Example
es: Ejemplo SMTP

source: This example prompts the user for addresses needed in the message envelope ('To' and 'From' addresses), and the message to be delivered. Note that the headers to be included with the message must be included in the message as entered; this example doesn't do any processing of the :rfc:`822` headers. In particular, the 'To' and 'From' addresses must be included in the message headers explicitly. ::
es: Este ejemplo solicita al usuario las direcciones necesarias en el sobre del mensaje (direcciones 'To' y 'From' ) y el mensaje que se entregará. Tenga en cuenta que los encabezados que se incluirán con el mensaje deben incluirse en el mensaje tal y como se introdujeron; este ejemplo no procesa los encabezados :rfc:`822` . En particular, las direcciones 'To' y 'From deben incluirse explícitamente en los encabezados de los mensajes. ::

source: In general, you will want to use the :mod:`email` package's features to construct an email message, which you can then send via :meth:`~smtplib.SMTP.send_message`; see :ref:`email-examples`.
es: En general, querrá usar las características del paquete :mod:`email` para construir un mensaje de correo electrónico, que luego puede enviar a través de :meth:`~smtplib.SMTP.send_message`; ver :ref:`email-examples`.
