Repository: python/python-docs-es
Catalog: library/smtplib.po
Languages: es

source: :mod:`smtplib` --- SMTP protocol client
es: :mod:`smtplib` --- Cliente de protocolo SMTP

source: **Source code:** :source:`Lib/smtplib.py`
es: **Código fuente:** :source:`Lib/smtplib.py`

source: The :mod:`smtplib` module defines an SMTP client session object that can be used to send mail to any internet machine with an SMTP or ESMTP listener daemon. For details of SMTP and ESMTP operation, consult :rfc:`821` (Simple Mail Transfer Protocol) and :rfc:`1869` (SMTP Service Extensions).
es: El módulo :mod:`smtplib` define un objeto de sesión de cliente SMTP que se puede utilizar para enviar correo a cualquier máquina de Internet con un demonio de escucha SMTP o ESMTP. Para obtener detalles sobre el funcionamiento de SMTP y ESMTP, consulte :rfc:`821` (Protocolo simple de transferencia de correo) y :rfc:`1869` (Extensiones de servicio SMTP).

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este modulo no funciona o no está disponible para plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para más información.

source: An :class:`SMTP` instance encapsulates an SMTP connection. It has methods that support a full repertoire of SMTP and ESMTP operations. If the optional host and port parameters are given, the SMTP :meth:`connect` method is called with those parameters during initialization. If specified, *local_hostname* is used as the FQDN of the local host in the HELO/EHLO command. Otherwise, the local hostname is found using :func:`socket.getfqdn`. If the :meth:`connect` call returns anything other than a success code, an :exc:`SMTPConnectError` is raised. The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). If the timeout expires, :exc:`TimeoutError` is raised. The optional source_address parameter allows binding to some specific source address in a machine with multiple network interfaces, and/or to some specific source TCP port. It takes a 2-tuple (host, port), for the socket to bind to as its source address before connecting. If omitted (or if host or port are ``''`` and/or 0 respectively) the OS default behavior will be used.
es: Una instancia :class:`SMTP` encapsula una conexión SMTP. Tiene métodos que admiten un repertorio completo de operaciones SMTP y ESMTP. Si se proporcionan los parámetros de puerto y host opcionales, se llama al método SMTP :meth:`connect` con esos parámetros durante la inicialización. Si se especifica, *local_hostname* se utiliza como FQDN del host local en el comando HELO / EHLO. De lo contrario, el nombre de host local se encuentra mediante :func:`socket.getfqdn`. Si la llamada :meth:`connect` retorna algo que no sea un código de éxito, se lanza un :exc:`SMTPConnectError`. El parámetro opcional *timeout* especifica un tiempo de espera en segundos para bloquear operaciones como el intento de conexión (si no se especifica, se utilizará la configuración de tiempo de espera global predeterminada). Si expira el tiempo de espera, se lanza :exc:`TimeoutError`. El parámetro opcional source_address permite la vinculación a alguna dirección de origen específica en una máquina con múltiples interfaces de red y/o algún puerto TCP de origen específico. Se necesita una tupla de 2 (host, puerto), para que el socket se vincule como su dirección de origen antes de conectarse. Si se omite (o si el host o el puerto son ``''`` y / o 0 respectivamente), se utilizará el comportamiento predeterminado del sistema operativo.

source: For normal use, you should only require the initialization/connect, :meth:`sendmail`, and :meth:`SMTP.quit` methods. An example is included below.
es: Para un uso normal, solo debe requerir los métodos initialization/connect, :meth:`sendmail` y :meth:`SMTP.quit`. A continuación se incluye un ejemplo.

source: The :class:`SMTP` class supports the :keyword:`with` statement. When used like this, the SMTP ``QUIT`` command is issued automatically when the :keyword:`!with` statement exits. E.g.::
es: La clase :class:`SMTP` admite la instrucción :keyword:`with`. Cuando se usa así, el comando SMTP ``QUIT`` se emite automáticamente cuando la :keyword:`!with` sale de la instrucción. por ejemplo::

source: Raises an :ref:`auditing event <auditing>` ``smtplib.send`` with arguments ``self``, ``data``.
es: Genera un :ref:`auditing event <auditing>` ``smtplib.send`` con argumentos ``self``, ``data``.

source: All commands will raise an :ref:`auditing event <auditing>` ``smtplib.SMTP.send`` with arguments ``self`` and ``data``, where ``data`` is the bytes about to be sent to the remote host.
es: Todos los comandos lanzarán un :ref:`evento de auditoría <auditing>` ``smtplib.SMTP.send`` con argumentos ``self`` y ``data``, donde ``data`` son los bytes que están a punto de ser enviado al host remoto.

source: Support for the :keyword:`with` statement was added.
es: Se agregó soporte para la sentencia :keyword:`with`.

source: source_address argument was added.
es: se agrego el argumento source_address.

source: The SMTPUTF8 extension (:rfc:`6531`) is now supported.
es: La extensión SMTPUTF8 (:rfc:`6531`) ahora es compatible.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket
es: Si el parámetro *timeout* se mantiene en cero, lanzará un :class:`ValueError` para evitar la creación de un socket no bloqueante

source: An :class:`SMTP_SSL` instance behaves exactly the same as instances of :class:`SMTP`. :class:`SMTP_SSL` should be used for situations where SSL is required from the beginning of the connection and using :meth:`starttls` is not appropriate. If *host* is not specified, the local host is used. If *port* is zero, the standard SMTP-over-SSL port (465) is used. The optional arguments *local_hostname*, *timeout* and *source_address* have the same meaning as they do in the :class:`SMTP` class. *context*, also optional, can contain a :class:`~ssl.SSLContext` and allows configuring various aspects of the secure connection. Please read :ref:`ssl-security` for best practices.
es: Una instancia de :class:`SMTP_SSL` se comporta exactamente igual que las instancias de :class:`SMTP`. :class:`SMTP_SSL` debe usarse para situaciones donde se requiere SSL desde el comienzo de la conexión y el uso :meth:`starttls` no es apropiado. Si no se especifica *host*, se utiliza el host local. Si *port* es cero, se utiliza el puerto estándar SMTP sobre SSL (465). Los argumentos opcionales *local_hostname*, *timeout* y *source_address* tienen el mismo significado que en la clase :class:`SMTP`. *context*, también opcional, puede contener una :class:`~ssl.SSLContext` y permite configurar varios aspectos de la conexión segura. Por favor lea :ref:`ssl-security` para conocer las mejores prácticas.

source: *keyfile* and *certfile* are a legacy alternative to *context*, and can point to a PEM formatted private key and certificate chain file for the SSL connection.
es: *keyfile* y *certfile* son una alternativa heredada a *context* y pueden apuntar a una clave privada con formato PEM y un archivo de cadena de certificados para la conexión SSL.

source: *context* was added.
es: se agregó *contexto*.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
es: La clase ahora admite la verificación del nombre de host con :attr:`ssl.SSLContext.check_hostname` y *Server Name Indication* (ver :data:`ssl.HAS_SNI`).

source: *keyfile* and *certfile* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
es: *keyfile* y *certfile* están obsoletos en favor de *context*. Por favor use :meth:`ssl.SSLContext.load_cert_chain` en su lugar, o deje que :func:`ssl.create_default_context` seleccione los certificados CA confiables del sistema para usted.

source: The LMTP protocol, which is very similar to ESMTP, is heavily based on the standard SMTP client. It's common to use Unix sockets for LMTP, so our :meth:`connect` method must support that as well as a regular host:port server. The optional arguments local_hostname and source_address have the same meaning as they do in the :class:`SMTP` class. To specify a Unix socket, you must use an absolute path for *host*, starting with a '/'.
es: El protocolo LMTP, que es muy similar a ESMTP, se basa en gran medida en el cliente SMTP estándar. Es común usar sockets Unix para LMTP, por lo que nuestro método :meth:`connect` debe ser compatible con eso, así como con un servidor host:puerto normal. Los argumentos opcionales local_hostname y source_address tienen el mismo significado que en la clase :class:`SMTP`. Para especificar un socket Unix, debe usar una ruta absoluta para *host*, comenzando con '/'.

source: Authentication is supported, using the regular SMTP mechanism. When using a Unix socket, LMTP generally don't support or require any authentication, but your mileage might vary.
es: Se admite la autenticación mediante el mecanismo SMTP habitual. Cuando se usa un socket Unix, LMTP generalmente no admite ni requiere autenticación, pero su millaje puede variar.

source: The optional *timeout* parameter was added.
es: Se ha añadido el parámetro opcional *timeout*.

source: A nice selection of exceptions is defined as well:
es: También se define una buena selección de excepciones:

source: Subclass of :exc:`OSError` that is the base exception class for all the other exceptions provided by this module.
es: Subclase de :exc:`OSError` que es la clase de excepción base para todas las demás excepciones proporcionadas por este módulo.

source: SMTPException became subclass of :exc:`OSError`
es: SMTPException se convirtió en subclase de :exc:`OSError`

source: This exception is raised when the server unexpectedly disconnects, or when an attempt is made to use the :class:`SMTP` instance before connecting it to a server.
es: Esta excepción se genera cuando el servidor se desconecta inesperadamente o cuando se intenta usar la instancia :class:`SMTP` antes de conectarlo a un servidor.

source: Base class for all exceptions that include an SMTP error code. These exceptions are generated in some instances when the SMTP server returns an error code. The error code is stored in the :attr:`smtp_code` attribute of the error, and the :attr:`smtp_error` attribute is set to the error message.
es: Clase base para todas las excepciones que incluyen un código de error SMTP. Estas excepciones se generan en algunos casos cuando el servidor SMTP devuelve un código de error. El código de error se almacena en el atributo :attr:`smtp_code` del error, y el atributo :attr:`smtp_error` se establece en el mensaje de error.

source: Sender address refused. In addition to the attributes set by on all :exc:`SMTPResponseException` exceptions, this sets 'sender' to the string that the SMTP server refused.
es: Dirección del remitente rechazada. Además de los atributos establecidos por todas las excepciones :exc:`SMTPResponseException`, éste establece 'remitente' para la cadena de caracteres que el servidor SMTP rechazó.

source: All recipient addresses refused. The errors for each recipient are accessible through the attribute :attr:`recipients`, which is a dictionary of exactly the same sort as :meth:`SMTP.sendmail` returns.
es: Se rechazaron todas las direcciones de destinatarios. Los errores para cada destinatario son accesibles mediante el atributo :attr:`recipients`, el cual es un diccionario del mismo tipo que el :meth:`SMTP.sendmail` retorna.

source: The SMTP server refused to accept the message data.
es: El servidor SMTP se negó a aceptar los datos del mensaje.

source: Error occurred during establishment of a connection with the server.
es: Se produjo un error durante el establecimiento de conexión con el servidor.

source: The server refused our ``HELO`` message.
es: El servidor rechazó nuestro mensaje ``HELO``.

source: The command or option attempted is not supported by the server.
es: El servidor no admite el comando o la opción que se intentó.

source: SMTP authentication went wrong. Most probably the server didn't accept the username/password combination provided.
es: La autenticación SMTP salió mal. Lo más probable es que el servidor no aceptó la combinación proporcionada de username/password.

source: Protocol definition for SMTP. This document covers the model, operating procedure, and protocol details for SMTP.
es: Definición de protocolo para SMTP. Este documento cubre el modelo, el procedimiento operativo y los detalles del protocolo para SMTP.

source: :rfc:`1869` - SMTP Service Extensions
es: :rfc:`1869` - Extensiones de Servicio SMTP

source: Definition of the ESMTP extensions for SMTP. This describes a framework for extending SMTP with new commands, supporting dynamic discovery of the commands provided by the server, and defines a few additional commands.
es: Definición de las extensiones ESMTP para SMTP. Esto describe un marco para extender SMTP con nuevos comandos, que admite el descubrimiento dinámico de los comandos proporcionados por el servidor y define algunos comandos adicionales.

source: SMTP Objects
es: Objetos SMTP

source: An :class:`SMTP` instance has the following methods:
es: Una instancia :class:`SMTP` tiene los siguientes métodos:

source: Set the debug output level. A value of 1 or ``True`` for *level* results in debug messages for connection and for all messages sent to and received from the server. A value of 2 for *level* results in these messages being timestamped.
es: Establezca el nivel de salida de depuración. Un valor de 1 o ``True`` para *level* da como resultado mensajes de depuración para la conexión y para todos los mensajes enviados y recibidos desde el servidor. Un valor de 2 para *level* da como resultado que estos mensajes tengan una marca de tiempo.

source: Added debuglevel 2.
es: Se agregó el nivel de depuración 2.

source: Send a command *cmd* to the server. The optional argument *args* is simply concatenated to the command, separated by a space.
es: Envíe un comando *cmd* al servidor. El argumento opcional *args* simplemente se concatena al comando, separado por un espacio.

source: This returns a 2-tuple composed of a numeric response code and the actual response line (multiline responses are joined into one long line.)
es: Esto devuelve una tupla de 2 compuestos por un código de respuesta numérico y la línea de respuesta real (las respuestas de varias líneas se unen en una línea larga).

source: In normal operation it should not be necessary to call this method explicitly. It is used to implement other methods and may be useful for testing private extensions.
es: En funcionamiento normal, no debería ser necesario llamar a este método explícitamente. Se utiliza para implementar otros métodos y puede resultar útil para probar extensiones privadas.

source: If the connection to the server is lost while waiting for the reply, :exc:`SMTPServerDisconnected` will be raised.
es: Si se pierde la conexión con el servidor mientras se espera la respuesta, se activará :exc:`SMTPServerDisconnected`.

source: Connect to a host on a given port. The defaults are to connect to the local host at the standard SMTP port (25). If the hostname ends with a colon (``':'``) followed by a number, that suffix will be stripped off and the number interpreted as the port number to use. This method is automatically invoked by the constructor if a host is specified during instantiation. Returns a 2-tuple of the response code and message sent by the server in its connection response.
es: Conéctese a un host en un puerto determinado. Los valores predeterminados son para conectarse al host local en el puerto SMTP estándar (25). Si el nombre de host termina con dos puntos (``':'``) seguido de un número, ese sufijo se eliminará y el número se interpretará como el número de puerto a utilizar. El constructor invoca automáticamente este método si se especifica un host durante la instanciación. Devuelve una tupla de 2 del código de respuesta y el mensaje enviado por el servidor en su respuesta de conexión.

source: Raises an :ref:`auditing event <auditing>` ``smtplib.connect`` with arguments ``self``, ``host``, ``port``.
es: Genera un :ref:`evento de auditoría <auditing>` ``smtplib.connect`` con argumentos ``self``, ``host``, ``port``.

source: Identify yourself to the SMTP server using ``HELO``. The hostname argument defaults to the fully qualified domain name of the local host. The message returned by the server is stored as the :attr:`helo_resp` attribute of the object.
es: Identifíquese en el servidor SMTP usando ``HELO``. El argumento del nombre de host tiene como valor predeterminado el nombre de dominio completo del host local. El mensaje devuelto por el servidor se almacena como el atributo :attr:`helo_resp` del objeto.

source: In normal operation it should not be necessary to call this method explicitly. It will be implicitly called by the :meth:`sendmail` when necessary.
es: En funcionamiento normal, no debería ser necesario llamar a este método explícitamente. Será llamado implícitamente por :meth:`sendmail` cuando sea necesario.

source: Identify yourself to an ESMTP server using ``EHLO``. The hostname argument defaults to the fully qualified domain name of the local host. Examine the response for ESMTP option and store them for use by :meth:`has_extn`. Also sets several informational attributes: the message returned by the server is stored as the :attr:`ehlo_resp` attribute, :attr:`does_esmtp` is set to ``True`` or ``False`` depending on whether the server supports ESMTP, and :attr:`esmtp_features` will be a dictionary containing the names of the SMTP service extensions this server supports, and their parameters (if any).
es: Identifíquese en un servidor ESMTP mediante ``EHLO``. El argumento del nombre de host tiene como valor predeterminado el nombre de dominio completo del host local. Examine la respuesta para la opción ESMTP y guárdelos para que los utilice :meth:`has_extn`. También establece varios atributos informativos: el mensaje retornado por el servidor se almacena como el atributo :attr:`ehlo_resp`, :attr:`does_esmtp` se establece en ``True`` o ``False`` dependiendo de si el servidor admite ESMTP, y :attr:`esmtp_features` será un diccionario que contiene los nombres de las extensiones de servicio SMTP de este servidor soportes, y sus parámetros (si los hay).

source: Unless you wish to use :meth:`has_extn` before sending mail, it should not be necessary to call this method explicitly. It will be implicitly called by :meth:`sendmail` when necessary.
es: A menos que desee utilizar :meth:`has_extn` antes de enviar correo, no debería ser necesario llamar a este método explícitamente. Se llamará implícitamente por :meth:`sendmail` cuando sea necesario.

source: This method calls :meth:`ehlo` and/or :meth:`helo` if there has been no previous ``EHLO`` or ``HELO`` command this session. It tries ESMTP ``EHLO`` first.
es: Este método llama a :meth:`ehlo` o :meth:`helo` si no ha habido ningún comando ``EHLO`` o ``HELO`` anterior en esta sesión. Primero prueba ESMTP ``EHLO``.

source: The server didn't reply properly to the ``HELO`` greeting.
es: El servidor no respondió correctamente al saludo ``HELO``.

source: Return :const:`True` if *name* is in the set of SMTP service extensions returned by the server, :const:`False` otherwise. Case is ignored.
es: Retorna :const:`True` si *name* está en el conjunto de extensiones de servicio SMTP devueltas por el servidor, :const:`False` en caso contrario. El método es insensible a la presencia de mayúsculas en *name*.

source: Check the validity of an address on this server using SMTP ``VRFY``. Returns a tuple consisting of code 250 and a full :rfc:`822` address (including human name) if the user address is valid. Otherwise returns an SMTP error code of 400 or greater and an error string.
es: Verifique la validez de una dirección en este servidor usando SMTP ``VRFY``. Retorna una tupla que consta del código 250 y una dirección completa :rfc:`822` (incluido el nombre humano) si la dirección del usuario es válida. De lo contrario, devuelve un código de error SMTP de 400 o más y una cadena de error.

source: Many sites disable SMTP ``VRFY`` in order to foil spammers.
es: Muchos sitios desactivan SMTP ``VRFY`` para frustrar a los spammers.

source: Log in on an SMTP server that requires authentication. The arguments are the username and the password to authenticate with. If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. This method will return normally if the authentication was successful, or may raise the following exceptions:
es: Inicie sesión en un servidor SMTP que requiera autenticación. Los argumentos son el nombre de usuario y la contraseña para autenticarse. Si no ha habido ningún comando ``EHLO`` o ``HELO`` anterior en esta sesión, este método prueba primero ESMTP ``EHLO``. Este método regresará normalmente si la autenticación fue exitosa o puede generar las siguientes excepciones:

source: The server didn't accept the username/password combination.
es: El servidor no aceptó la combinación de nombre de username/password.

source: The ``AUTH`` command is not supported by the server.
es: El servidor no admite el comando ``AUTH``.

source: No suitable authentication method was found.
es: No se encontró ningún método de autenticación adecuado.

source: Each of the authentication methods supported by :mod:`smtplib` are tried in turn if they are advertised as supported by the server. See :meth:`auth` for a list of supported authentication methods. *initial_response_ok* is passed through to :meth:`auth`.
es: Cada uno de los métodos de autenticación admitidos por :mod:`smtplib` se prueban a su vez si se anuncian como admitidos por el servidor. Consulte :meth:`auth` para obtener una lista de los métodos de autenticación admitidos. *initial_response_ok* se pasa a :meth:`auth`.

source: Optional keyword argument *initial_response_ok* specifies whether, for authentication methods that support it, an "initial response" as specified in :rfc:`4954` can be sent along with the ``AUTH`` command, rather than requiring a challenge/response.
es: El argumento de palabra clave opcional *initial_response_ok* especifica si, para los métodos de autenticación que lo admiten, se puede enviar una "respuesta inicial" como se especifica en :rfc:`4954` junto con el comando ``AUTH``, en lugar de requerir un desafío/respuesta .

source: :exc:`SMTPNotSupportedError` may be raised, and the *initial_response_ok* parameter was added.
es: :exc:`SMTPNotSupportedError` se puede generar y se agregó el parámetro *initial_response_ok*.

source: Issue an ``SMTP`` ``AUTH`` command for the specified authentication *mechanism*, and handle the challenge response via *authobject*.
es: Emita un comando ``SMTP`` ``AUTH`` para el *mechanism* de autenticación especificado y maneje la respuesta de desafío a través de *authobject*.

source: *mechanism* specifies which authentication mechanism is to be used as argument to the ``AUTH`` command; the valid values are those listed in the ``auth`` element of :attr:`esmtp_features`.
es: *mechanism* especifica qué mecanismo de autenticación se utilizará como argumento para el comando ``AUTH``; los valores válidos son los enumerados en el elemento ``auth`` de :attr:`esmtp_features`.
