Repository: python/python-docs-es
Catalog: library/smtpd.po
Languages: es

source: :mod:`smtpd` --- SMTP Server
es: :mod:`smtpd` --- Servidor SMTP

source: This module offers several classes to implement SMTP (email) servers.
es: Este módulo ofrece varias clases para implementar servidores SMTP (correo electrónico).

source: The :mod:`smtpd` module is deprecated (see :pep:`PEP 594 <594#smtpd>` for details). The `aiosmtpd <https://aiosmtpd.readthedocs.io/>`_ package is a recommended replacement for this module. It is based on :mod:`asyncio` and provides a more straightforward API.
es: El módulo :mod:`smtpd` está obsoleto (ver :pep:`PEP 594 <594#smtpd>` para más detalles). Se recomienda el paquete `aiosmtpd <https://aiosmtpd.readthedocs.io/>`_ como sustituto para este módulo. Está basado en :mod:`asyncio` y proporciona una API más sencilla.

source: Several server implementations are present; one is a generic do-nothing implementation, which can be overridden, while the other two offer specific mail-sending strategies.
es: Este módulo ofrece varias implementaciones del servidor; una es una implementación genérica de no hace nada, pero cuyos métodos pueden ser sobrescritos para crear una implementación concreta, mientras que las otras dos ofrecen estrategias específicas de envío de correo.

source: Additionally the SMTPChannel may be extended to implement very specific interaction behaviour with SMTP clients.
es: Además, SMTPChannel puede ampliarse para implementar un comportamiento de interacción muy específico con clientes SMTP.

source: The code supports :RFC:`5321`, plus the :rfc:`1870` SIZE and :rfc:`6531` SMTPUTF8 extensions.
es: El código admite :RFC:`5321`, más las extensiones :rfc:`1870` SIZE y :rfc:`6531` SMTPUTF8.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para obtener más información.

source: SMTPServer Objects
es: Objetos SMTPServer

source: Create a new :class:`SMTPServer` object, which binds to local address *localaddr*. It will treat *remoteaddr* as an upstream SMTP relayer. Both *localaddr* and *remoteaddr* should be a :ref:`(host, port) <host_port>` tuple. The object inherits from :class:`asyncore.dispatcher`, and so will insert itself into :mod:`asyncore`'s event loop on instantiation.
es: Crea un nuevo objeto :class:`SMTPServer`, que se vincula a la dirección local *localaddr*. Tratará *remoteaddr* como un transmisor SMTP ascendente. Tanto *localaddr* como *remoteaddr* deben ser una tupla :ref:`(host, port) <host_port>`. El objeto hereda de :class:`asyncore.dispatcher`, por lo que se insertará en el bucle de eventos de :mod:`asyncore` en la instanciación.

source: *data_size_limit* specifies the maximum number of bytes that will be accepted in a ``DATA`` command. A value of ``None`` or ``0`` means no limit.
es: *data_size_limit* especifica el número máximo de bytes que se aceptarán en un comando ``DATA``. Un valor de ``None`` o ``0`` significa que no hay límite.

source: *map* is the socket map to use for connections (an initially empty dictionary is a suitable value). If not specified the :mod:`asyncore` global socket map is used.
es: *map* es el mapa de conectores que se utilizará para las conexiones (un diccionario inicialmente vacío es un valor adecuado). Si no se especifica, se utiliza el mapa de socket global :mod:`asyncore`.

source: *enable_SMTPUTF8* determines whether the ``SMTPUTF8`` extension (as defined in :RFC:`6531`) should be enabled. The default is ``False``. When ``True``, ``SMTPUTF8`` is accepted as a parameter to the ``MAIL`` command and when present is passed to :meth:`process_message` in the ``kwargs['mail_options']`` list. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
es: *enable_SMTPUTF8* determina si la extensión ``SMTPUTF8`` (como se define en :RFC:`6531`) debe estar habilitada. El valor predeterminado es ``False``. Cuando es ``True``, ``SMTPUTF8`` se acepta como parámetro para el comando ``MAIL`` y cuando está presente se pasa a :meth:`process_message` en la lista ``kwargs[‘mail_options’]`` . *decode_data* y *enable_SMTPUTF8* no se pueden establecer en ``True`` al mismo tiempo.

source: *decode_data* specifies whether the data portion of the SMTP transaction should be decoded using UTF-8. When *decode_data* is ``False`` (the default), the server advertises the ``8BITMIME`` extension (:rfc:`6152`), accepts the ``BODY=8BITMIME`` parameter to the ``MAIL`` command, and when present passes it to :meth:`process_message` in the ``kwargs['mail_options']`` list. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
es: *decode_data* especifica si la porción de datos de la transacción SMTP debe decodificarse usando UTF-8. Cuando *decode_data* es ``False`` (el valor predeterminado), el servidor anuncia la extensión ``8BITMIME`` (:rfc:`6152`), acepta el parámetro ``BODY=8BITMIME`` al comando ``MAIL``, y cuando está presente lo pasa a :meth:`process_message` en la lista ``kwargs['mail_options']``. *decode_data* y *enable_SMTPUTF8* no se pueden establecer en ``True`` al mismo tiempo.

source: Raise a :exc:`NotImplementedError` exception. Override this in subclasses to do something useful with this message. Whatever was passed in the constructor as *remoteaddr* will be available as the :attr:`_remoteaddr` attribute. *peer* is the remote host's address, *mailfrom* is the envelope originator, *rcpttos* are the envelope recipients and *data* is a string containing the contents of the e-mail (which should be in :rfc:`5321` format).
es: Lanza una excepción :exc:`NotImplementedError`. Sobrescribe este método en subclases para hacer algo útil con este mensaje. Todo lo que se haya pasado en el constructor como *remoteaddr* estará disponible en el atributo :attr:`_remoteaddr`. *peer* es la dirección del host remoto, *mailfrom* es el creador del sobre, *rcpttos* son los destinatarios del sobre y *data* es una cadena de caracteres que contiene el contenido del correo electrónico (que debe estar en formato :rfc:`5321`).

source: If the *decode_data* constructor keyword is set to ``True``, the *data* argument will be a unicode string. If it is set to ``False``, it will be a bytes object.
es: Si la palabra clave del constructor *decode_data* se establece en ``True``, el argumento *data* será una cadena Unicode. Si se establece en ``False``, será un objeto de bytes.

source: *kwargs* is a dictionary containing additional information. It is empty if ``decode_data=True`` was given as an init argument, otherwise it contains the following keys:
es: *kwargs* es un diccionario que contiene información adicional. Está vacío si se proporcionó ``decode_data=True`` como argumento de inicialización; de lo contrario, contiene las siguientes claves:

source: a list of all received parameters to the ``MAIL`` command (the elements are uppercase strings; example: ``['BODY=8BITMIME', 'SMTPUTF8']``).
es: una lista de todos los parámetros recibidos para el comando ``MAIL`` (los elementos son cadenas en mayúsculas; ejemplo: ``['BODY=8BITMIME', 'SMTPUTF8']``).

source: same as *mail_options* but for the ``RCPT`` command. Currently no ``RCPT TO`` options are supported, so for now this will always be an empty list.
es: igual que *mail_options* pero para el comando ``RCPT``. Actualmente, no se admiten las opciones ``RCPT TO``, por lo que, por ahora, siempre será una lista vacía.

source: Implementations of ``process_message`` should use the ``**kwargs`` signature to accept arbitrary keyword arguments, since future feature enhancements may add keys to the kwargs dictionary.
es: Las implementaciones de ``process_message`` deben usar la firma ``**kwargs`` para aceptar argumentos por palabra clave arbitrarios, ya que las mejoras de características futuras pueden agregar claves al diccionario de argumentos de palabras clave.

source: Return ``None`` to request a normal ``250 Ok`` response; otherwise return the desired response string in :RFC:`5321` format.
es: Retorne ``None`` para solicitar una respuesta normal de ``250 Ok``; de lo contrario, retorne la cadena de respuesta deseada en formato :RFC:`5321`.

source: Override this in subclasses to use a custom :class:`SMTPChannel` for managing SMTP clients.
es: Sobrescriba este método en las subclases para usar una clase :class:`SMTPChannel` personalizada para administrar clientes SMTP.

source: The *map* constructor argument.
es: El argumento del constructor *map*.

source: *localaddr* and *remoteaddr* may now contain IPv6 addresses.
es: *localaddr* y *remoteaddr* ahora pueden contener direcciones IPv6.

source: The *decode_data* and *enable_SMTPUTF8* constructor parameters, and the *kwargs* parameter to :meth:`process_message` when *decode_data* is ``False``.
es: Los parámetros del constructor *decode_data* y *enable_SMTPUTF8*, y el parámetro *kwargs* para :meth:`process_message` cuando *decode_data* es ``False``.

source: *decode_data* is now ``False`` by default.
es: *decode_data* ahora es ``False`` por defecto.

source: DebuggingServer Objects
es: Objetos DebuggingServer

source: Create a new debugging server. Arguments are as per :class:`SMTPServer`. Messages will be discarded, and printed on stdout.
es: Crea un nuevo servidor de depuración. Los argumentos son iguales que en :class:`SMTPServer`. Los mensajes se descartarán y se imprimirán en la salida estándar.

source: PureProxy Objects
es: Objetos PureProxy

source: Create a new pure proxy server. Arguments are as per :class:`SMTPServer`. Everything will be relayed to *remoteaddr*. Note that running this has a good chance to make you into an open relay, so please be careful.
es: Crea un nuevo servidor proxy puro. Los argumentos son iguales que en :class:`SMTPServer`. Todo se transmitirá a *remoteaddr*. Tenga en cuenta que ejecutar esto implica una buena posibilidad de convertirlo en un relé abierto, así que tenga cuidado.

source: SMTPChannel Objects
es: Objetos SMTPChannel

source: Create a new :class:`SMTPChannel` object which manages the communication between the server and a single SMTP client.
es: Crea un nuevo objeto :class:`SMTPChannel` que gestiona la comunicación entre el servidor y un único cliente SMTP.

source: *conn* and *addr* are as per the instance variables described below.
es: *conn* y *addr* son según las variables de instancia que se describen a continuación.

source: *enable_SMTPUTF8* determines whether the ``SMTPUTF8`` extension (as defined in :RFC:`6531`) should be enabled. The default is ``False``. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
es: *enable_SMTPUTF8* determina si la extensión ``SMTPUTF8`` (como se define en :RFC:`6531`) debe estar habilitada. El valor predeterminado es ``False``. *decode_data* y *enable_SMTPUTF8* no se pueden establecer en ``True`` al mismo tiempo.

source: A dictionary can be specified in *map* to avoid using a global socket map.
es: Se puede especificar un diccionario en *map* para evitar el uso de un mapa de socket global.

source: *decode_data* specifies whether the data portion of the SMTP transaction should be decoded using UTF-8. The default is ``False``. *decode_data* and *enable_SMTPUTF8* cannot be set to ``True`` at the same time.
es: *decode_data* especifica si la porción de datos de la transacción SMTP debe decodificarse usando UTF-8. El valor predeterminado es ``False``. *decode_data* y *enable_SMTPUTF8* no se pueden establecer en ``True`` al mismo tiempo.

source: To use a custom SMTPChannel implementation you need to override the :attr:`SMTPServer.channel_class` of your :class:`SMTPServer`.
es: Para utilizar una implementación SMTPChannel personalizada, debe anular :attr:`SMTPServer.channel_class` de su :class:`SMTPServer`.

source: The *decode_data* and *enable_SMTPUTF8* parameters were added.
es: Se agregaron los parámetros *decode_data* y *enable_SMTPUTF8*.

source: The :class:`SMTPChannel` has the following instance variables:
es: La clase :class:`SMTPChannel` tiene las siguientes variables de instancia:

source: Holds the :class:`SMTPServer` that spawned this channel.
es: Contiene el :class:`SMTPServer` que generó este canal.

source: Holds the socket object connecting to the client.
es: Contiene el objeto de socket que se conecta al cliente.

source: Holds the address of the client, the second value returned by :func:`socket.accept <socket.socket.accept>`
es: Contiene la dirección del cliente, el segundo valor retornado por :func:`socket.accept <socket.socket.accept>`

source: Holds a list of the line strings (decoded using UTF-8) received from the client. The lines have their ``"\r\n"`` line ending translated to ``"\n"``.
es: Contiene una lista de las cadenas de línea (decodificadas mediante UTF-8) recibidas del cliente. Las líneas tienen su final de línea ``"\r\n"`` traducido a ``"\n"``.

source: Holds the current state of the channel. This will be either :attr:`COMMAND` initially and then :attr:`DATA` after the client sends a "DATA" line.
es: Contiene el estado actual del canal. Será :attr:`COMMAND` inicialmente y luego :attr:`DATA` después de que el cliente envíe una línea "DATA".

source: Holds a string containing the greeting sent by the client in its "HELO".
es: Contiene una cadena de caracteres que contiene el saludo enviado por el cliente en su "HELO".

source: Holds a string containing the address identified in the "MAIL FROM:" line from the client.
es: Contiene una cadena de caracteres que contiene la dirección identificada en la línea "MAIL FROM:" del cliente.

source: Holds a list of strings containing the addresses identified in the "RCPT TO:" lines from the client.
es: Contiene una lista de cadenas de caracteres que contienen las direcciones identificadas en las líneas "RCPT TO:" del cliente.

source: Holds a string containing all of the data sent by the client during the DATA state, up to but not including the terminating ``"\r\n.\r\n"``.
es: Contiene una cadena de caracteres que contiene todos los datos enviados por el cliente durante el estado de DATA, hasta pero sin incluir la terminación ``"\r\n.\r\n"``.

source: Holds the fully qualified domain name of the server as returned by :func:`socket.getfqdn`.
es: Contiene el nombre de dominio completo del servidor tal y como lo retorna :func:`socket.getfqdn`.

source: Holds the name of the client peer as returned by ``conn.getpeername()`` where ``conn`` is :attr:`conn`.
es: Contiene el nombre del par del cliente como lo retorna ``conn.getpeername()`` donde ``conn`` es :attr:`conn`.

source: The :class:`SMTPChannel` operates by invoking methods named ``smtp_<command>`` upon reception of a command line from the client. Built into the base :class:`SMTPChannel` class are methods for handling the following commands (and responding to them appropriately):
es: La clase :class:`SMTPChannel` opera invocando métodos llamados ``smtp_<command>`` al recibir una línea de comando del cliente. Construidos en la clase base :class:`SMTPChannel`, son métodos para manejar los siguientes comandos (y responder a ellos de manera apropiada):

source: Command
es: Comando

source: Action taken
es: Acción tomada

source: Accepts the greeting from the client and stores it in :attr:`seen_greeting`. Sets server to base command mode.
es: Acepta el saludo del cliente y lo almacena en :attr:`seen_greeting`. Establece el servidor en el modo de comando base.

source: Accepts the greeting from the client and stores it in :attr:`seen_greeting`. Sets server to extended command mode.
es: Acepta el saludo del cliente y lo almacena en :attr:`seen_greeting`. Establece el servidor en el modo de comando extendido.

source: Takes no action.
es: No realiza ninguna acción.

source: Closes the connection cleanly.
es: Cierra la conexión limpiamente.

source: Accepts the "MAIL FROM:" syntax and stores the supplied address as :attr:`mailfrom`. In extended command mode, accepts the :rfc:`1870` SIZE attribute and responds appropriately based on the value of *data_size_limit*.
es: Acepta la sintaxis "MAIL FROM:" y almacena la dirección proporcionada como :attr:`mailfrom`. En el modo de comando extendido, acepta el atributo :rfc:`1870` SIZE y responde apropiadamente según el valor de *data_size_limit*.

source: Accepts the "RCPT TO:" syntax and stores the supplied addresses in the :attr:`rcpttos` list.
es: Acepta la sintaxis "RCPT TO:" y almacena las direcciones proporcionadas en la lista :attr:`rcpttos`.

source: Resets the :attr:`mailfrom`, :attr:`rcpttos`, and :attr:`received_data`, but not the greeting.
es: Restablece :attr:`mailfrom`, :attr:`rcpttos` y :attr:`received_data`, pero no el saludo.

source: Sets the internal state to :attr:`DATA` and stores remaining lines from the client in :attr:`received_data` until the terminator ``"\r\n.\r\n"`` is received.
es: Establece el estado interno en :attr:`DATA` y almacena las líneas restantes del cliente en :attr:`received_data` hasta que se recibe el terminador ``”\r\n.\r\n”``.

source: Returns minimal information on command syntax
es: Retorna información mínima sobre la sintaxis del comando

source: Returns code 252 (the server doesn't know if the address is valid)
es: Retorna el código 252 (el servidor no sabe si la dirección es válida)

source: Reports that the command is not implemented.
es: Informa que el comando no está implementado.
