Repository: python/python-docs-es
Catalog: library/spwd.po
Languages: es

source: :mod:`spwd` --- The shadow password database
es: :mod:`spwd` --- La base de datos de contraseñas ocultas

source: The :mod:`spwd` module is deprecated (see :pep:`PEP 594 <594#spwd>` for details and alternatives).
es: El módulo :mod:`spwd` está obsoleto (consulte :pep:`PEP 594 <594#spwd>` para más detalles y alternativas).

source: This module provides access to the Unix shadow password database. It is available on various Unix versions.
es: Este módulo proporciona acceso a la base de datos de contraseñas ocultas de Unix. Está disponible en varias versiones de Unix.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Availability <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para más información.

source: You must have enough privileges to access the shadow password database (this usually means you have to be root).
es: Debe tener suficientes privilegios para acceder a la base de datos de contraseñas ocultas (esto generalmente significa que debe ser root).

source: Shadow password database entries are reported as a tuple-like object, whose attributes correspond to the members of the ``spwd`` structure (Attribute field below, see ``<shadow.h>``):
es: Las entradas de la base de datos de contraseñas ocultas se informan como un objeto similar a una tupla, cuyos atributos corresponden a los miembros de la estructura ``spwd`` (campo de atributo a continuación, consulte ``<shadow.h>``):

source: Index
es: Índice

source: Attribute
es: Atributo

source: Meaning
es: Significado

source: Login name
es: Nombre de inicio de sesión

source: Encrypted password
es: Contraseña encriptada

source: Date of last change
es: Fecha del último cambio

source: Minimal number of days between changes
es: Número mínimo de días entre cambios

source: Maximum number of days between changes
es: Número máximo de días entre cambios

source: Number of days before password expires to warn user about it
es: Número de días antes de que expire la contraseña para advertir al usuario sobre ello

source: Number of days after password expires until account is disabled
es: Número de días desde que caduca la contraseña hasta que se deshabilita la cuenta

source: Number of days since 1970-01-01 when account expires
es: Número de días desde 1970-01-01 cuando expira la cuenta

source: Reserved
es: Reservado

source: The sp_namp and sp_pwdp items are strings, all others are integers. :exc:`KeyError` is raised if the entry asked for cannot be found.
es: Los elementos sp_namp y sp_pwdp son cadenas, todos los demás son números enteros. Se lanza :exc:`KeyError` si no se puede encontrar la entrada solicitada.

source: The following functions are defined:
es: Se definen las siguientes funciones:

source: Return the shadow password database entry for the given user name.
es: Retorna la entrada de la base de datos de contraseñas ocultas para el nombre de usuario especificado.

source: Raises a :exc:`PermissionError` instead of :exc:`KeyError` if the user doesn't have privileges.
es: Lanza un :exc:`PermissionError` en vez de :exc:`KeyError` si el usuario no tiene privilegios.

source: Return a list of all available shadow password database entries, in arbitrary order.
es: Retorna una lista de todas las entradas de la base de datos de contraseñas ocultas disponibles, en orden arbitrario.

source: Module :mod:`grp`
es: Módulo :mod:`grp`

source: An interface to the group database, similar to this.
es: Una interfaz para la base de datos del grupo, similar a esta.

source: Module :mod:`pwd`
es: Módulo :mod:`pwd`

source: An interface to the normal password database, similar to this.
es: Una interfaz para la base de datos de contraseñas normal, similar a esta.
