Repository: python/python-docs-es
Catalog: library/stat.po
Languages: es

source: :mod:`stat` --- Interpreting :func:`~os.stat` results
es: :mod:`stat` --- Interpretación de los resultados de :func:`~os.stat`

source: **Source code:** :source:`Lib/stat.py`
es: **Código fuente:** :source:`Lib/stat.py`

source: The :mod:`stat` module defines constants and functions for interpreting the results of :func:`os.stat`, :func:`os.fstat` and :func:`os.lstat` (if they exist). For complete details about the :c:func:`stat`, :c:func:`!fstat` and :c:func:`!lstat` calls, consult the documentation for your system.
es: El módulo :mod:`stat` define constantes y funciones para interpretar los resultados de :func:`os.stat`, :func:`os.fstat` y :func:`os.lstat` (si existen). Para obtener los detalles completos sobre las llamadas a :c:func:`stat`, :c:func:`!fstat` y :c:func:`!lstat`, consulta la documentación de tu sistema.

source: The stat module is backed by a C implementation.
es: El módulo *stat* se apoya en una implementación en C.

source: The :mod:`stat` module defines the following functions to test for specific file types:
es: El módulo :mod:`stat` define las siguientes funciones para comprobar tipos de archivo específicos:

source: Return non-zero if the mode is from a directory.
es: Retorna un valor no nulo si el modo es de un directorio.

source: Return non-zero if the mode is from a character special device file.
es: Retorna un valor no nulo si el modo es de un archivo de un dispositivo especial de caracteres.

source: Return non-zero if the mode is from a block special device file.
es: Retorna un valor no nulo si el modo es de un archivo de un dispositivo especial de bloques.

source: Return non-zero if the mode is from a regular file.
es: Retorna un valor no nulo si el modo es de un archivo normal.

source: Return non-zero if the mode is from a FIFO (named pipe).
es: Retorna un valor no nulo si el modo es de un *FIFO* (tubería con nombre).

source: Return non-zero if the mode is from a symbolic link.
es: Retorna un valor no nulo si el modo es de un enlace simbólico.

source: Return non-zero if the mode is from a socket.
es: Retorna un valor no nulo si el modo es de un socket.

source: Return non-zero if the mode is from a door.
es: Retorna un valor no nulo si el modo es de un *door*.

source: Return non-zero if the mode is from an event port.
es: Retorna un valor no nulo si el modo es de un *event port*.

source: Return non-zero if the mode is from a whiteout.
es: Retorna un valor no nulo si el modo es de un *whiteout*.

source: Two additional functions are defined for more general manipulation of the file's mode:
es: Se definen dos funciones adicionales para una manipulación más general del modo del archivo:

source: Return the portion of the file's mode that can be set by :func:`os.chmod`\ ---that is, the file's permission bits, plus the sticky bit, set-group-id, and set-user-id bits (on systems that support them).
es: Retorna la porción del modo del archivo que puede ser establecida por :func:`os.chmod`\ --- esto es, los bits de los permisos del archivo más los bits *sticky bit*, *set-group-id* y *set-user-id* (en los sistemas que lo soporten).

source: Return the portion of the file's mode that describes the file type (used by the :func:`!S_IS\*` functions above).
es: Retorna la porción del modo del archivo que describe el tipo de archivo (usado por las funciones :func:`!S_IS\*` de más arriba).

source: Normally, you would use the :func:`!os.path.is\*` functions for testing the type of a file; the functions here are useful when you are doing multiple tests of the same file and wish to avoid the overhead of the :c:func:`stat` system call for each test. These are also useful when checking for information about a file that isn't handled by :mod:`os.path`, like the tests for block and character devices.
es: Normalmente se usarían las funciones :func:`!os.path.is\*` para comprobar el tipo de un archivo; estas funciones de aquí son útiles cuando se hacen múltiples comprobaciones sobre el mismo archivo y se desea evitar la sobrecarga causada por la llamada al sistema :c:func:`stat` en cada comprobación. También son útiles cuando se comprueba información de un archivo que no es gestionada por :mod:`os.path`, como buscar dispositivos de bloques o caracteres.

source: Example::
es: Ejemplo::

source: An additional utility function is provided to convert a file's mode in a human readable string:
es: Se proporciona una función de utilidad adicional para convertir el modo del archivo en una cadena de caracteres legible por humanos:

source: Convert a file's mode to a string of the form '-rwxrwxrwx'.
es: Convierte el modo del archivo a una cadena de caracteres de la forma '-rwxrwxrwx'.

source: The function supports :data:`S_IFDOOR`, :data:`S_IFPORT` and :data:`S_IFWHT`.
es: La función soporta :data:`S_IFDOOR`, :data:`S_IFPORT` y :data:`S_IFWHT`.

source: All the variables below are simply symbolic indexes into the 10-tuple returned by :func:`os.stat`, :func:`os.fstat` or :func:`os.lstat`.
es: Todas las variables de debajo son simplemente índices simbólicos sobre la tupla de 10 elementos retornada por :func:`os.stat`, :func:`os.fstat` o :func:`os.lstat`.

source: Inode protection mode.
es: Modo de protección del *inode*.

source: Inode number.
es: Número del *inode*.

source: Device inode resides on.
es: Dispositivo en el que reside el *inode*.

source: Number of links to the inode.
es: Número de enlaces al *inode*.

source: User id of the owner.
es: *Id* de usuario del propietario.

source: Group id of the owner.
es: *Id* del grupo del propietario.

source: Size in bytes of a plain file; amount of data waiting on some special files.
es: Tamaño en bytes de un archivo normal; cantidad de datos esperando en algunos archivos especiales.

source: Time of last access.
es: Momento del último acceso.

source: Time of last modification.
es: Momento de la última modificación.

source: The "ctime" as reported by the operating system. On some systems (like Unix) is the time of the last metadata change, and, on others (like Windows), is the creation time (see platform documentation for details).
es: El "ctime" reportado por el sistema operativo. En algunos sistemas (como Unix) es el momento del último cambio en los metadatos, y en otros (como Windows), es el momento de creación (véase la documentación de la plataforma para más detalles).

source: The interpretation of "file size" changes according to the file type. For plain files this is the size of the file in bytes. For FIFOs and sockets under most flavors of Unix (including Linux in particular), the "size" is the number of bytes waiting to be read at the time of the call to :func:`os.stat`, :func:`os.fstat`, or :func:`os.lstat`; this can sometimes be useful, especially for polling one of these special files after a non-blocking open. The meaning of the size field for other character and block devices varies more, depending on the implementation of the underlying system call.
es: La interpretación de "tamaño de archivo" cambia dependiendo del tipo de archivo. Para archivos normales es el tamaño del archivo en bytes. En la mayoría de sistemas Unix (incluyendo Linux en particular), para *FIFOs* y sockets es el número de bytes que esperan ser leídos en el momento de la llamada a :func:`os.stat`, :func:`os.fstat`, o :func:`os.lstat`; en ocasiones, esto puede ser útil, especialmente para sondear uno de estos archivos especiales después de una apertura no bloqueante. Para otros dispositivos de caracteres y bloques el significado del campo *size* es más variado, dependiendo de la implementación de la llamada al sistema subyacente.

source: The variables below define the flags used in the :data:`ST_MODE` field.
es: Las variables de debajo definen los flags usados en el campo :data:`ST_MODE`.

source: Use of the functions above is more portable than use of the first set of flags:
es: El uso de las funciones de arriba es más portable que el uso del primer juego de flags:

source: Symbolic link.
es: Enlace simbólico.

source: Regular file.
es: Archivo normal.

source: Block device.
es: Dispositivo de bloques.

source: Directory.
es: Directorio.

source: Character device.
es: Dispositivo de caracteres.

source: :data:`S_IFDOOR`, :data:`S_IFPORT` or :data:`S_IFWHT` are defined as 0 when the platform does not have support for the file types.
es: :data:`S_IFDOOR`, :data:`S_IFPORT` o :data:`S_IFWHT` se definen como 0 cuando la plataforma no soporta los tipos de archivo.

source: The following flags can also be used in the *mode* argument of :func:`os.chmod`:
es: Los siguientes flags también pueden usarse en el argumento *mode* de :func:`os.chmod`:

source: Set UID bit.
es: Establecer el bit *UID*.

source: Set-group-ID bit. This bit has several special uses. For a directory it indicates that BSD semantics is to be used for that directory: files created there inherit their group ID from the directory, not from the effective group ID of the creating process, and directories created there will also get the :data:`S_ISGID` bit set. For a file that does not have the group execution bit (:data:`S_IXGRP`) set, the set-group-ID bit indicates mandatory file/record locking (see also :data:`S_ENFMT`).
es: Bit *Set-group-ID*. Este bit tiene varios usos especiales. Para un directorio indica que la semántica BSD debe usarse para ese directorio: los archivos creados ahí heredan el *ID* de grupo del directorio, no del *ID* de grupo efectivo del proceso que los crea, y los directorios creados ahí también tendrán activado el bit :data:`S_ISGID`. Para un archivo que no tiene activado el bit de ejecución de grupo (:data:`S_IXGRP`), el bit *Set-group-ID* indica el bloqueo obligatorio del archivo/registro (véase también :data:`S_ENFMT`).

source: Sticky bit. When this bit is set on a directory it means that a file in that directory can be renamed or deleted only by the owner of the file, by the owner of the directory, or by a privileged process.
es: *Sticky bit*. Cuando este bit está activado en un directorio, significa que un archivo dentro de ese directorio puede ser renombrado o borrado sólo por el propietario del archivo, por el propietario del directorio, o por un proceso con privilegios.

source: Mask for file owner permissions.
es: Máscara para los permisos del propietario del archivo.

source: Owner has read permission.
es: El propietario tiene permiso de lectura.

source: Owner has write permission.
es: El propietario tiene permiso de escritura.

source: Owner has execute permission.
es: El propietario tiene permiso de ejecución.

source: Mask for group permissions.
es: Máscara para los permisos del grupo.

source: Group has read permission.
es: El grupo tiene permiso de lectura.

source: Group has write permission.
es: El grupo tiene permiso de escritura.

source: Group has execute permission.
es: El grupo tiene permiso de ejecución.

source: Mask for permissions for others (not in group).
es: Máscara para permisos de los otros (no en el grupo).

source: Others have read permission.
es: Los otros tienen permiso de lectura.

source: Others have write permission.
es: Los otros tienen permiso de escritura.

source: Others have execute permission.
es: Los otros tienen permiso de ejecución.

source: System V file locking enforcement. This flag is shared with :data:`S_ISGID`: file/record locking is enforced on files that do not have the group execution bit (:data:`S_IXGRP`) set.
es: Imposición del bloqueo de archivos de System V. Este flag se comparte con :data:`S_ISGID`: se impone el bloqueo de archivos/registros en archivos que no tengan activado el bit de ejecución por el grupo (:data:`S_IXGRP`).

source: Unix V7 synonym for :data:`S_IRUSR`.
es: Sinónimo de :data:`S_IRUSR` en Unix V7.

source: Unix V7 synonym for :data:`S_IWUSR`.
es: Sinónimo de :data:`S_IWUSR` en Unix V7.

source: Unix V7 synonym for :data:`S_IXUSR`.
es: Sinónimo de :data:`S_IXUSR` en Unix V7.

source: The following flags can be used in the *flags* argument of :func:`os.chflags`:
es: Los siguientes flags pueden usarse como argumento *flags* de :func:`os.chflags`:

source: Do not dump the file.
es: No volcar el archivo.

source: The file may not be changed.
es: El archivo no puede ser modificado.

source: The file may only be appended to.
es: Sólo se puede añadir al archivo.

source: The directory is opaque when viewed through a union stack.
es: El directorio es opaco cuando se mira a través de un *union stack*.

source: The file may not be renamed or deleted.
es: El archivo no puede ser renombrado o borrado.

source: The file is stored compressed (macOS 10.6+).
es: El archivo se almacena comprimido (macOS 10.6+).

source: The file should not be displayed in a GUI (macOS 10.5+).
es: El archivo no debe ser mostrado en una GUI (macOS 10.5+).

source: The file may be archived.
es: El archivo puede ser archivado.

source: The file is a snapshot file.
es: El archivo es una instantánea.

source: See the \*BSD or macOS systems man page :manpage:`chflags(2)` for more information.
es: Consulte la página de manual de sistemas \ * BSD o macOS :manpage:`chflags(2)` para obtener más información.

source: On Windows, the following file attribute constants are available for use when testing bits in the ``st_file_attributes`` member returned by :func:`os.stat`. See the `Windows API documentation <https://msdn.microsoft.com/en-us/library/windows/desktop/gg258117.aspx>`_ for more detail on the meaning of these constants.
es: En Windows, las siguientes constantes de atributos de fichero están disponibles para ser usadas al comprobar los bits del miembro ``st_file_attributes`` retornado por :func:`os.stat`. Véase `Windows API documentation <https://msdn.microsoft.com/en-us/library/windows/desktop/gg258117.aspx>`_ para más detalles sobre el significado de estas constantes.

source: On Windows, the following constants are available for comparing against the ``st_reparse_tag`` member returned by :func:`os.lstat`. These are well-known constants, but are not an exhaustive list.
es: En Windows, las siguientes constantes están disponibles para la comparación con el miembro ``st_reparse_tag`` retornado por :func:`os.lstat`. Estas constantes son muy conocidas, pero no se trata de una lista exhaustiva.
