Repository: python/python-docs-es
Catalog: library/struct.po
Languages: es_es

source: Native byte order examples (designated by the ``'@'`` format prefix or lack of any prefix character) may not match what the reader's machine produces as that depends on the platform and compiler.
es_es: Los ejemplos de orden de bytes nativos (designados por el prefijo de formato ``'@'`` o la falta de cualquier carácter de prefijo) pueden no coincidir con lo que produce la máquina del lector, ya que eso depende de la plataforma y el compilador.

source: Pack and unpack integers of three different sizes, using big endian ordering::
es_es: Empaqueta y desempaqueta enteros de tres tamaños diferentes, utilizando el orden *big endian*::

source: Attempt to pack an integer which is too large for the defined field::
es_es: Intenta empaquetar un entero que es demasiado grande para el campo definido::

source: Demonstrate the difference between ``'s'`` and ``'c'`` format characters::
es_es: Demuestra la diferencia entre los caracteres de formato ``'s'`` y ``'c'``::

source: Unpacked fields can be named by assigning them to variables or by wrapping the result in a named tuple::
es_es: Los campos desempaquetados se pueden nombrar asignándolos a variables o ajustando el resultado en una tupla con nombre::

source: The ordering of format characters may have an impact on size in native mode since padding is implicit. In standard mode, the user is responsible for inserting any desired padding. Note in the first ``pack`` call below that three NUL bytes were added after the packed ``'#'`` to align the following integer on a four-byte boundary. In this example, the output was produced on a little endian machine::
es_es: El orden de los caracteres de formato puede afectar el tamaño en el modo nativo, ya que el relleno está implícito. En el modo estándar, el usuario es responsable de insertar el relleno que desee. Toma en cuenta que en la primera llamada ``pack`` a continuación se agregaron tres bytes NUL después del ``'#'`` empaquetado para alinear el siguiente entero en un límite de cuatro bytes. En este ejemplo, el resultado se produjo en una máquina little endian::

source: The following format ``'llh0l'`` results in two pad bytes being added at the end, assuming the platform's longs are aligned on 4-byte boundaries::
es_es: El siguiente formato ``'llh0l'`` especifica dos bytes de relleno al final, suponiendo que los tipos *longs* están alineados en los límites de 4 bytes::

source: Module :mod:`array`
es_es: Módulo :mod:`array`

source: Packed binary storage of homogeneous data.
es_es: Almacenamiento binario empaquetado de datos homogéneos.

source: Module :mod:`json`
es_es: Módulo :mod:`json`

source: JSON encoder and decoder.
es_es: Codificador y decodificador JSON.

source: Module :mod:`pickle`
es_es: Módulo :mod:`pickle`

source: Python object serialization.
es_es: Serialización de objetos Python.

source: Applications
es_es: Aplicaciones

source: Two main applications for the :mod:`struct` module exist, data interchange between Python and C code within an application or another application compiled using the same compiler (:ref:`native formats<struct-native-formats>`), and data interchange between applications using agreed upon data layout (:ref:`standard formats<struct-standard-formats>`). Generally speaking, the format strings constructed for these two domains are distinct.
es_es: Existen dos aplicaciones principales para el módulo :mod:`struct`, el intercambio de datos entre el código Python y C dentro de una aplicación u otra aplicación compilada usando el mismo compilador (:ref:`formatos nativos<struct-native-formats>`) y el intercambio de datos entre aplicaciones usando un diseño de datos acordado (:ref:`formatos estándar <struct-standard-formats>`). En términos generales, las cadenas de formato construidas para estos dos dominios son distintas.

source: Native Formats
es_es: Formatos nativos

source: When constructing format strings which mimic native layouts, the compiler and machine architecture determine byte ordering and padding. In such cases, the ``@`` format character should be used to specify native byte ordering and data sizes. Internal pad bytes are normally inserted automatically. It is possible that a zero-repeat format code will be needed at the end of a format string to round up to the correct byte boundary for proper alignment of consecutive chunks of data.
es_es: Al construir cadenas de formato que imitan diseños nativos, el compilador y la arquitectura de la máquina determinan el orden y el relleno de los bytes. En tales casos, se debe utilizar el carácter de formato ``@`` para especificar el orden de bytes nativo y el tamaño de los datos. Los bytes de relleno internos normalmente se insertan automáticamente. Es posible que se necesite un código de formato de repetición cero al final de una cadena de formato para redondear hasta el límite de bytes correcto para una alineación adecuada de fragmentos de datos consecutivos.

source: Consider these two simple examples (on a 64-bit, little-endian machine)::
es_es: Considera estos dos ejemplos sencillos (en una máquina little-endian de 64 bits)::

source: Data is not padded to an 8-byte boundary at the end of the second format string without the use of extra padding. A zero-repeat format code solves that problem::
es_es: Los datos no se rellenan hasta un límite de 8 bytes al final de la segunda cadena de formato sin el uso de relleno adicional. Un código de formato de repetición cero resuelve ese problema::

source: The ``'x'`` format code can be used to specify the repeat, but for native formats it is better to use a zero-repeat format like ``'0l'``.
es_es: El código de formato ``'x'`` se puede utilizar para especificar la repetición, pero para formatos nativos es mejor utilizar un formato de repetición cero como ``'0l'``.

source: By default, native byte ordering and alignment is used, but it is better to be explicit and use the ``'@'`` prefix character.
es_es: De forma predeterminada, se utiliza el orden y la alineación de bytes nativos, pero es mejor ser explícito y utilizar el carácter de prefijo ``'@'``.

source: Standard Formats
es_es: Formatos estándar

source: When exchanging data beyond your process such as networking or storage, be precise. Specify the exact byte order, size, and alignment. Do not assume they match the native order of a particular machine. For example, network byte order is big-endian, while many popular CPUs are little-endian. By defining this explicitly, the user need not care about the specifics of the platform their code is running on. The first character should typically be ``<`` or ``>`` (or ``!``). Padding is the responsibility of the programmer. The zero-repeat format character won't work. Instead, the user must explicitly add ``'x'`` pad bytes where needed. Revisiting the examples from the previous section, we have::
es_es: Cuando intercambia datos más allá de su proceso, como redes o almacenamiento, sé preciso. Especifica el orden de bytes, el tamaño y la alineación exactos. No asumas que coinciden con el orden nativo de una máquina en particular. Por ejemplo, el orden de los bytes de la red es big-endian, mientras que muchas CPU populares son little-endian. Al definir esto explícitamente, el usuario no necesita preocuparse por las especificaciones de la plataforma en la que se ejecuta su código. El primer carácter normalmente debería ser ``<`` o ``>`` (o ``!``). El relleno es responsabilidad del programador. El carácter de formato de repetición cero no funcionará. En su lugar, el usuario debe agregar explícitamente ``'x'`` bytes de relleno donde sea necesario. Revisando los ejemplos de la sección anterior, tenemos::

source: The above results (executed on a 64-bit machine) aren't guaranteed to match when executed on different machines. For example, the examples below were executed on a 32-bit machine::
es_es: No se garantiza que los resultados anteriores (ejecutados en una máquina de 64 bits) coincidan cuando se ejecutan en diferentes máquinas. Por ejemplo, los siguientes ejemplos se ejecutaron en una máquina de 32 bits::

source: Classes
es_es: Clases

source: The :mod:`struct` module also defines the following type:
es_es: El módulo :mod:`struct` también define el siguiente tipo:

source: Return a new Struct object which writes and reads binary data according to the format string *format*. Creating a ``Struct`` object once and calling its methods is more efficient than calling module-level functions with the same format since the format string is only compiled once.
es_es: Retorna un nuevo objeto Struct que escribe y lee datos binarios según la cadena de formato *format*. Crear un objeto ``Struct`` una vez y llamar a sus métodos es más eficaz que llamar a las funciones a nivel de módulo con el mismo formato, ya que la cadena de formato solo se compila una vez.

source: The compiled versions of the most recent format strings passed to the module-level functions are cached, so programs that use only a few format strings needn't worry about reusing a single :class:`Struct` instance.
es_es: Las versiones compiladas de las cadenas de formato más recientes pasadas a las funciones de nivel de módulo se almacenan en caché, por lo que los programas que utilizan solo unas pocas cadenas de formato no necesitan preocuparse por volver a usar una sola instancia :class:`Struct`.

source: Compiled Struct objects support the following methods and attributes:
es_es: Los objetos Struct compilados admiten los siguientes métodos y atributos:

source: Identical to the :func:`pack` function, using the compiled format. (``len(result)`` will equal :attr:`size`.)
es_es: Idéntico a la función :func:`pack`, utilizando el formato compilado. (``len(result)`` será igual a :attr:`size`.)

source: Identical to the :func:`pack_into` function, using the compiled format.
es_es: Idéntico a la función :func:`pack_into`, utilizando el formato compilado.

source: Identical to the :func:`unpack` function, using the compiled format. The buffer's size in bytes must equal :attr:`size`.
es_es: Idéntico a la función :func:`unpack`, utilizando el formato compilado. El tamaño del búfer en bytes debe ser igual a :attr:`size`.

source: Identical to the :func:`unpack_from` function, using the compiled format. The buffer's size in bytes, starting at position *offset*, must be at least :attr:`size`.
es_es: Idéntico a la función :func:`unpack_from`, utilizando el formato compilado. El tamaño del búfer en bytes, comenzando en la posición *offset*, debe ser al menos :attr:`size`.

source: Identical to the :func:`iter_unpack` function, using the compiled format. The buffer's size in bytes must be a multiple of :attr:`size`.
es_es: Idéntico a la función :func:`iter_unpack`, utilizando el formato compilado. El tamaño del búfer en bytes debe ser un múltiplo de :attr:`size`.

source: The format string used to construct this Struct object.
es_es: Cadena de formato utilizada para construir este objeto Struct.

source: The format string type is now :class:`str` instead of :class:`bytes`.
es_es: El tipo de cadena de formato es ahora :class:`str` en lugar de :class:`bytes`.

source: The calculated size of the struct (and hence of the bytes object produced by the :meth:`pack` method) corresponding to :attr:`format`.
es_es: El tamaño calculado de la estructura (y, por lo tanto, del objeto bytes generado por el método :meth:`pack`) correspondiente a :attr:`format`.

source: structures
es_es: estructuras

source: packing
es_es: empaquetado

source: binary
es_es: binario

source: data
es_es: datos

source: @ (at)
es_es: @ (en)

source: in struct format strings
es_es: en cadenas de formato de estructura

source: = (equals)
es_es: = (igual a)

source: < (less)
es_es: < (menor que)

source: > (greater)
es_es: > (mayor que)

source: ! (exclamation)
es_es: ! (exclamación)

source: ? (question mark)
es_es: ? (signo de interrogación)
