Repository: python/python-docs-es
Catalog: library/struct.po
Languages: es_es

source: :mod:`struct` --- Interpret bytes as packed binary data
es_es: :mod:`struct` --- Interpreta bytes como paquetes de datos binarios

source: **Source code:** :source:`Lib/struct.py`
es_es: **Código fuente:** :source:`Lib/struct.py`

source: This module converts between Python values and C structs represented as Python :class:`bytes` objects. Compact :ref:`format strings <struct-format-strings>` describe the intended conversions to/from Python values. The module's functions and objects can be used for two largely distinct applications, data exchange with external sources (files or network connections), or data transfer between the Python application and the C layer.
es_es: Este módulo convierte entre valores de Python y estructuras de C representadas como objetos de Python :class:`bytes`. Las :ref:`cadenas de formato <struct-format-strings>` compacto describen las conversiones previstas hacia/desde valores de Python. Las funciones y objetos del módulo se pueden utilizar para dos aplicaciones en gran medida distintas, el intercambio de datos con fuentes externas (archivos o conexiones de red) o la transferencia de datos entre la aplicación de Python y la capa de C.

source: When no prefix character is given, native mode is the default. It packs or unpacks data based on the platform and compiler on which the Python interpreter was built. The result of packing a given C struct includes pad bytes which maintain proper alignment for the C types involved; similarly, alignment is taken into account when unpacking. In contrast, when communicating data between external sources, the programmer is responsible for defining byte ordering and padding between elements. See :ref:`struct-alignment` for details.
es_es: Cuando no se proporciona ningún carácter de prefijo, el modo nativo es el predeterminado. Empaqueta o desempaqueta datos según la plataforma y el compilador en el que se creó el intérprete de Python. El resultado de empaquetar una estructura C determinada incluye bytes de relleno que mantienen la alineación adecuada para los tipos C involucrados; asimismo, se tiene en cuenta la alineación al desempaquetar. Por el contrario, cuando se comunican datos entre fuentes externas, el programador es responsable de definir el orden de bytes y el relleno entre elementos. Ver :ref:`struct-alignment` para más detalles.

source: Several :mod:`struct` functions (and methods of :class:`Struct`) take a *buffer* argument. This refers to objects that implement the :ref:`bufferobjects` and provide either a readable or read-writable buffer. The most common types used for that purpose are :class:`bytes` and :class:`bytearray`, but many other types that can be viewed as an array of bytes implement the buffer protocol, so that they can be read/filled without additional copying from a :class:`bytes` object.
es_es: Varias funciones :mod:`struct` (y métodos de :class:`Struct`) toman un argumento *buffer*. Esto hace referencia a los objetos que implementan :ref:`bufferobjects` y proporcionan un búfer de lectura o de lectura/escritura. Los tipos más comunes utilizados para ese propósito son :class:`bytes` y :class:`bytearray`, pero muchos otros tipos que se pueden ver como una lista de bytes implementan el protocolo de búfer, para que se puedan leer/rellenar sin necesidad de copiar a partir de un objeto :class:`bytes`.

source: Functions and Exceptions
es_es: Funciones y excepciones

source: The module defines the following exception and functions:
es_es: El módulo define la siguiente excepción y funciones:

source: Exception raised on various occasions; argument is a string describing what is wrong.
es_es: Excepción lanzada en varias ocasiones; el argumento es una *string* que describe lo que está mal.

source: Return a bytes object containing the values *v1*, *v2*, ... packed according to the format string *format*. The arguments must match the values required by the format exactly.
es_es: Retorna un objeto bytes que contiene los valores *v1*, *v2*, ... empaquetado de acuerdo con la cadena de formato *format*. Los argumentos deben coincidir exactamente con los valores requeridos por el formato.

source: Pack the values *v1*, *v2*, ... according to the format string *format* and write the packed bytes into the writable buffer *buffer* starting at position *offset*. Note that *offset* is a required argument.
es_es: Empaqueta los valores *v1*, *v2*, ... de acuerdo con la cadena de formato *format* y escribe los bytes empaquetados en el búfer de escritura *buffer* comenzando en la posición *offset*. Nota: *offset* es un argumento obligatorio.

source: Unpack from the buffer *buffer* (presumably packed by ``pack(format, ...)``) according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes must match the size required by the format, as reflected by :func:`calcsize`.
es_es: Desempaqueta del búfer *buffer* (normalmente empaquetado por ``pack(format, ...)``) según la cadena de formato *format*. El resultado es una tupla incluso si contiene un solo elemento. El tamaño del búfer en bytes debe coincidir con el tamaño requerido por el formato, como se refleja en :func:`calcsize`.

source: Unpack from *buffer* starting at position *offset*, according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes, starting at position *offset*, must be at least the size required by the format, as reflected by :func:`calcsize`.
es_es: Desempaqueta del *buffer* comenzando en la posición *offset*, según la cadena de formato *format*. El resultado es una tupla incluso si contiene un solo elemento. El tamaño del búfer en bytes, comenzando en la posición *offset*, debe tener al menos el tamaño requerido por el formato, como se refleja en :func:`calcsize`.

source: Iteratively unpack from the buffer *buffer* according to the format string *format*. This function returns an iterator which will read equally sized chunks from the buffer until all its contents have been consumed. The buffer's size in bytes must be a multiple of the size required by the format, as reflected by :func:`calcsize`.
es_es: Desempaqueta de manera iterativa desde el búfer *buffer* según la cadena de formato *format*. Esta función retorna un iterador que leerá fragmentos de igual tamaño desde el búfer hasta que se haya consumido todo su contenido. El tamaño del búfer en bytes debe ser un múltiplo del tamaño requerido por el formato, como se refleja en :func:`calcsize`.

source: Each iteration yields a tuple as specified by the format string.
es_es: Cada iteración produce una tupla según lo especificado por la cadena de formato.

source: Return the size of the struct (and hence of the bytes object produced by ``pack(format, ...)``) corresponding to the format string *format*.
es_es: Retorna el tamaño de la estructura (y, por lo tanto, del objeto bytes generado por ``pack(format, ...)``) correspondiente a la cadena de formato *format*.

source: Format Strings
es_es: Cadenas de formato

source: Format strings describe the data layout when packing and unpacking data. They are built up from :ref:`format characters<format-characters>`, which specify the type of data being packed/unpacked. In addition, special characters control the :ref:`byte order, size and alignment<struct-alignment>`. Each format string consists of an optional prefix character which describes the overall properties of the data and one or more format characters which describe the actual data values and padding.
es_es: Las cadenas de formato describen el diseño de los datos cuando empaquetan y desempaquetan datos. Se construyen a partir :ref:`caracteres de formato<format-characters>`, que especifican el tipo de datos que se empaquetan/desempaquetan. Además, los caracteres especiales controlan el :ref:`orden de bytes, tamaño y alineación<struct-alignment>`. Cada cadena de formato consta de un carácter de prefijo opcional que describe las propiedades generales de los datos y uno o más caracteres de formato que describen los valores de datos actuales y el relleno.

source: Byte Order, Size, and Alignment
es_es: Orden de bytes, tamaño y alineación

source: By default, C types are represented in the machine's native format and byte order, and properly aligned by skipping pad bytes if necessary (according to the rules used by the C compiler). This behavior is chosen so that the bytes of a packed struct correspond exactly to the memory layout of the corresponding C struct. Whether to use native byte ordering and padding or standard formats depends on the application.
es_es: Por defecto, los tipos C se representan en el formato nativo y el orden de bytes de la máquina, y se alinean correctamente omitiendo *bytes* de relleno si es necesario (según las reglas utilizadas por el compilador de C). Se elige este comportamiento para que los bytes de una estructura empaquetada correspondan correctamente al diseño de memoria de la estructura C correspondiente. El uso de ordenamiento y relleno de bytes nativos o formatos estándar depende de la aplicación.

source: Alternatively, the first character of the format string can be used to indicate the byte order, size and alignment of the packed data, according to the following table:
es_es: Como alternativa, el primer carácter de la cadena de formato se puede utilizar para indicar el orden de bytes, el tamaño y la alineación de los datos empaquetados, según la tabla siguiente:

source: Character
es_es: Carácter

source: Byte order
es_es: Orden de bytes

source: Size
es_es: Tamaño

source: Alignment
es_es: Alineamiento

source: native
es_es: nativo

source: network (= big-endian)
es_es: red (= big-endian)

source: If the first character is not one of these, ``'@'`` is assumed.
es_es: Si el primer carácter no es uno de estos, se asume ``'@'``.

source: Native byte order is big-endian or little-endian, depending on the host system. For example, Intel x86, AMD64 (x86-64), and Apple M1 are little-endian; IBM z and many legacy architectures are big-endian. Use :data:`sys.byteorder` to check the endianness of your system.
es_es: El orden de bytes nativo es big-endian o little-endian, dependiendo del sistema host. Por ejemplo, Intel x86, AMD64 (x86-64) y Apple M1 son little-endian; IBM z y muchas arquitecturas heredadas son big-endian; ARM e Intel *Itanium* tienen la propiedad de trabajar con ambos formatos (middle-endian). Utiliza :data:`sys.byteorder` para comprobar la endianness ("extremidad") de tu sistema.

source: Native size and alignment are determined using the C compiler's ``sizeof`` expression. This is always combined with native byte order.
es_es: El tamaño y la alineación nativos se determinan mediante la expresión ``sizeof`` del compilador de C. Esto siempre se combina con el orden de bytes nativo.

source: Standard size depends only on the format character; see the table in the :ref:`format-characters` section.
es_es: El tamaño estándar depende únicamente del carácter de formato; ver la tabla en la sección :ref:`format-characters`.

source: Note the difference between ``'@'`` and ``'='``: both use native byte order, but the size and alignment of the latter is standardized.
es_es: Nótese la diferencia entre ``'@'`` y ``'='`` : ambos utilizan el orden de bytes nativo, pero el tamaño y la alineación de este último está estandarizado.

source: The form ``'!'`` represents the network byte order which is always big-endian as defined in `IETF RFC 1700 <IETF RFC 1700_>`_.
es_es: La forma ``'!'`` representa el orden de bytes en la red, el cuál siempre es big-endian tal como se define en `IETF RFC 1700 <IETF RFC 1700_>`_.

source: There is no way to indicate non-native byte order (force byte-swapping); use the appropriate choice of ``'<'`` or ``'>'``.
es_es: No hay manera de indicar el orden de bytes no nativo (forzar el intercambio de bytes); utiliza la elección adecuada de ``'<'`` o ``'>'``.

source: Notes:
es_es: Notas:

source: Padding is only automatically added between successive structure members. No padding is added at the beginning or the end of the encoded struct.
es_es: El relleno solo se agrega automáticamente entre los miembros sucesivos de la estructura. No se agrega ningún relleno al principio o al final de la estructura codificada.

source: No padding is added when using non-native size and alignment, e.g. with '<', '>', '=', and '!'.
es_es: No se añade ningún relleno cuando se utiliza el tamaño y la alineación no nativos, por ejemplo, con '<', '>', '=' y '!'.

source: To align the end of a structure to the alignment requirement of a particular type, end the format with the code for that type with a repeat count of zero. See :ref:`struct-examples`.
es_es: Para alinear el final de una estructura con el requisito de alineación de un tipo determinado, termina el formato con el código de ese tipo con un conteo repetido de ceros. Véase :ref:`struct-examples`.

source: Format Characters
es_es: Caracteres de formato

source: Format characters have the following meaning; the conversion between C and Python values should be obvious given their types. The 'Standard size' column refers to the size of the packed value in bytes when using standard size; that is, when the format string starts with one of ``'<'``, ``'>'``, ``'!'`` or ``'='``. When using native size, the size of the packed value is platform-dependent.
es_es: Los caracteres de formato tienen el siguiente significado; la conversión entre los valores de C y Python debe ser obvia dados sus tipos. La columna 'Tamaño estándar' hace referencia al tamaño del valor empaquetado en bytes cuando se utiliza el tamaño estándar; es decir, cuando la cadena de formato comienza con uno de ``'<'``, ``'>'``, ``'!'`` o ``'='``. Cuando se utiliza el tamaño nativo, el tamaño del valor empaquetado depende de la plataforma.

source: Format
es_es: Formato

source: C Type
es_es: Tipo C

source: Python type
es_es: Tipo Python

source: Standard size
es_es: Tamaño estándar

source: Notes
es_es: Notas

source: pad byte
es_es: byte de relleno

source: no value
es_es: sin valor

source: bytes of length 1
es_es: bytes de longitud 1

source: Added support for the ``'n'`` and ``'N'`` formats.
es_es: Soporte añadido para los formatos ``'n'`` y ``'N'``.

source: Added support for the ``'e'`` format.
es_es: Soporte añadido para el formato ``'e'``.

source: The ``'?'`` conversion code corresponds to the :c:expr:`_Bool` type defined by C99. If this type is not available, it is simulated using a :c:expr:`char`. In standard mode, it is always represented by one byte.
es_es: El código de conversión ``'?'`` corresponde al tipo :c:expr:`_Bool` definido por C99. Si este tipo no está disponible, se simula mediante un :c:expr:`char`. En el modo estándar, siempre se representa mediante un byte.

source: When attempting to pack a non-integer using any of the integer conversion codes, if the non-integer has a :meth:`~object.__index__` method then that method is called to convert the argument to an integer before packing.
es_es: Al intentar empaquetar un no entero mediante cualquiera de los códigos de conversión de enteros, si el no entero tiene un método :meth:`~object.__index__`, se llama a ese método para convertir el argumento en un entero antes de empaquetar.

source: Added use of the :meth:`~object.__index__` method for non-integers.
es_es: Agregado el uso del método :meth:`~object.__index__` para los no enteros.

source: The ``'n'`` and ``'N'`` conversion codes are only available for the native size (selected as the default or with the ``'@'`` byte order character). For the standard size, you can use whichever of the other integer formats fits your application.
es_es: Los códigos de conversión ``'n'`` y ``'N'`` solo están disponibles para el tamaño nativo (seleccionado como predeterminado o con el carácter de orden de bytes ``'@'``). Para el tamaño estándar, puedes usar cualquiera de los otros formatos enteros que se ajusten a tu aplicación.

source: For the ``'f'``, ``'d'`` and ``'e'`` conversion codes, the packed representation uses the IEEE 754 binary32, binary64 or binary16 format (for ``'f'``, ``'d'`` or ``'e'`` respectively), regardless of the floating-point format used by the platform.
es_es: Para los códigos de conversión ``'f'``, ``'d'`` y ``'e'``, la representación empaquetada utiliza el formato IEEE 754 binary32, binary64 o binary16 (para ``'f'``, ``'d'`` o ``'e'`` respectivamente), independientemente del formato de punto flotante utilizado por la plataforma.

source: The ``'P'`` format character is only available for the native byte ordering (selected as the default or with the ``'@'`` byte order character). The byte order character ``'='`` chooses to use little- or big-endian ordering based on the host system. The struct module does not interpret this as native ordering, so the ``'P'`` format is not available.
es_es: El carácter de formato ``'P'`` solo está disponible para el orden nativo de bytes (seleccionado como predeterminado o con el carácter de orden de bytes ``'@'``). El carácter de orden de bytes ``'='`` elige utilizar el orden little- o big-endian basado en el sistema host. El módulo *struct* no interpreta esto como un orden nativo, por lo que el formato ``'P'`` no está disponible.

source: The IEEE 754 binary16 "half precision" type was introduced in the 2008 revision of the `IEEE 754 standard <ieee 754 standard_>`_. It has a sign bit, a 5-bit exponent and 11-bit precision (with 10 bits explicitly stored), and can represent numbers between approximately ``6.1e-05`` and ``6.5e+04`` at full precision. This type is not widely supported by C compilers: on a typical machine, an unsigned short can be used for storage, but not for math operations. See the Wikipedia page on the `half-precision floating-point format <half precision format_>`_ for more information.
es_es: El tipo IEEE 754 binary16 "half precision" se introdujo en la revisión de 2008 del `IEEE 754 estándar <ieee 754 standard_>`_. Tiene un bit de signo, un exponente de 5 bits y una precisión de 11 bits (con 10 bits almacenados explícitamente) y puede representar números entre aproximadamente ``6.1e-05`` y ``6.5e+04`` con total precisión. Este tipo no es ampliamente compatible con los compiladores de C: en un equipo típico, un *unsigned* short se puede usar para el almacenamiento, pero no para las operaciones matemáticas. Consulte la página de Wikipedia en el `formato de punto flotante de media precisión <half precision format_>`_ para obtener más información.

source: When packing, ``'x'`` inserts one NUL byte.
es_es: Al empaquetar, ``'x'`` inserta un byte NUL.

source: The ``'p'`` format character encodes a "Pascal string", meaning a short variable-length string stored in a *fixed number of bytes*, given by the count. The first byte stored is the length of the string, or 255, whichever is smaller. The bytes of the string follow. If the string passed in to :func:`pack` is too long (longer than the count minus 1), only the leading ``count-1`` bytes of the string are stored. If the string is shorter than ``count-1``, it is padded with null bytes so that exactly count bytes in all are used. Note that for :func:`unpack`, the ``'p'`` format character consumes ``count`` bytes, but that the string returned can never contain more than 255 bytes.
es_es: El carácter de formato ``'p'`` codifica una "cadena de Pascal", lo que significa una cadena de longitud variable corta almacenada en un número *fijo de bytes*, dado por el recuento. El primer byte almacenado es el valor mínimo entre la longitud de la cadena o 255. A continuación se encuentran los bytes de la cadena. Si la cadena pasada a :func:`pack` es demasiado larga (más larga que la cuenta menos 1), solo se almacenan los bytes iniciales ``count-1`` de la cadena. Si la cadena es más corta que ``count-1``, se rellena con bytes nulos para que se utilicen exactamente los bytes de recuento en total. Tenga en cuenta que para :func:`unpack`, el carácter de formato ``'p'`` consume bytes ``count``, pero que la cadena retornada nunca puede contener más de 255 bytes.

source: For the ``'s'`` format character, the count is interpreted as the length of the bytes, not a repeat count like for the other format characters; for example, ``'10s'`` means a single 10-byte string mapping to or from a single Python byte string, while ``'10c'`` means 10 separate one byte character elements (e.g., ``cccccccccc``) mapping to or from ten different Python byte objects. (See :ref:`struct-examples` for a concrete demonstration of the difference.) If a count is not given, it defaults to 1. For packing, the string is truncated or padded with null bytes as appropriate to make it fit. For unpacking, the resulting bytes object always has exactly the specified number of bytes. As a special case, ``'0s'`` means a single, empty string (while ``'0c'`` means 0 characters).
es_es: Para el carácter de formato ``'s'``, el recuento se interpreta como la longitud de los bytes, no un recuento de repetición como para los otros caracteres de formato; por ejemplo, ``'10s'`` significa una sola cadena de 10 bytes asignada hacia o desde una sola cadena de bytes de Python, mientras que ``'10c'`` significa 10 elementos de caracteres separados de un byte (por ejemplo, ``cccccccccc``) asignada hacia o desde diez objetos de *bytes* de Python diferentes. (Ver :ref:`struct-examples` para una demostración concreta de la diferencia.) Si no se da un recuento, el valor predeterminado es 1. Para el empaquetado, la cadena es truncada o rellenada con bytes nulos según corresponda para que se ajuste. Para desempaquetar, el objeto bytes resultante siempre tiene exactamente el número especificado de bytes. Como caso especial, ``'0s'`` significa una sola cadena vacía (mientras que ``'0c'`` significa 0 caracteres).

source: A format character may be preceded by an integral repeat count. For example, the format string ``'4h'`` means exactly the same as ``'hhhh'``.
es_es: Un carácter de formato puede ir precedido de un número de recuento que repite tantas veces el carácter. Por ejemplo, la cadena de formato ``'4h'`` significa exactamente lo mismo que ``'hhhh'`` .

source: Whitespace characters between formats are ignored; a count and its format must not contain whitespace though.
es_es: Se omiten los caracteres de espacio entre formatos; sin embargo, un recuento y su formato no deben contener espacios en blanco.

source: When packing a value ``x`` using one of the integer formats (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), if ``x`` is outside the valid range for that format then :exc:`struct.error` is raised.
es_es: Al empaquetar un valor ``x`` utilizando uno de los formatos enteros (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), si ``x`` está fuera de un rango válido para ese formato, entonces se lanza la excepción :exc:`struct.error`.

source: Previously, some of the integer formats wrapped out-of-range values and raised :exc:`DeprecationWarning` instead of :exc:`struct.error`.
es_es: Anteriormente, algunos de los formatos enteros ajustaban los valores fuera de rango y lanzaban :exc:`DeprecationWarning` en vez de :exc:`struct.error`.

source: For the ``'?'`` format character, the return value is either :const:`True` or :const:`False`. When packing, the truth value of the argument object is used. Either 0 or 1 in the native or standard bool representation will be packed, and any non-zero value will be ``True`` when unpacking.
es_es: Para el carácter de formato ``'?'``, el valor retornado es :const:`True` o :const:`False`. Al empaquetar, se utiliza el valor verdadero del objeto del argumento. Se empaquetará 0 o 1 en la representación *bool* nativa o estándar, y cualquier valor distinto de cero será ``True`` al desempaquetar.

source: Examples
es_es: Ejemplos
