Repository: python/python-docs-es
Catalog: library/subprocess.po
Languages: es

source: In addition, the replacements using :func:`check_output` will fail with a :exc:`CalledProcessError` if the requested operation produces a non-zero return code. The output is still available as the :attr:`~CalledProcessError.output` attribute of the raised exception.
es: Además, las funciones de reemplazo que usan :func:`check_output` fracasarán con un error :exc:`CalledProcessError` si la operación solicitada produce un código de retorno diferente de cero. La salida queda disponible en el atributo :attr:`~CalledProcessError.output` de la excepción lanzada.

source: In the following examples, we assume that the relevant functions have already been imported from the :mod:`subprocess` module.
es: En los siguientes ejemplos, se asume que las funciones relevantes ya han sido importadas del módulo :mod:`subprocess`.

source: Replacing :program:`/bin/sh` shell command substitution
es: Cómo reemplazar la sustitución de órdenes de :program:`/bin/sh`

source: becomes::
es: se convierte en::

source: Replacing shell pipeline
es: Cómo remplazar los flujos de la shell

source: The ``p1.stdout.close()`` call after starting the p2 is important in order for p1 to receive a SIGPIPE if p2 exits before p1.
es: La llamada a ``p1.stdout.close()`` tras lanzar *p2* es importante para que *p1* reciba un SIGPIPE si *p2* retorna antes que *p1*.

source: Alternatively, for trusted input, the shell's own pipeline support may still be used directly:
es: Alternativamente, para entrada de confianza, se puede usar el propio soporte de pipeline de la shell directamente:

source: Replacing :func:`os.system`
es: Cómo reemplazar :func:`os.system`

source: Notes:
es: Notas:

source: Calling the program through the shell is usually not required.
es: No suele hacer falta llamar al programa a través de la shell.

source: The :func:`call` return value is encoded differently to that of :func:`os.system`.
es: El valor de retorno de :func:`call` se codifica de forma diferente al de :func:`os.system`.

source: The :func:`os.system` function ignores SIGINT and SIGQUIT signals while the command is running, but the caller must do this separately when using the :mod:`subprocess` module.
es: La función :func:`os.system` ignora las señales SIGINT y SIGQUIT mientras se ejecuta el comando, pero el llamador debe hacerlo por separado cuando usa el módulo :mod:`subprocess`.

source: A more realistic example would look like this::
es: Un ejemplo más creíble::

source: Replacing the :func:`os.spawn <os.spawnl>` family
es: Cómo reemplazar la familia :func:`os.spawn <os.spawnl>`

source: P_NOWAIT example::
es: Ejemplo de P_NOWAIT::

source: P_WAIT example::
es: Ejemplo de P_WAIT::

source: Vector example::
es: Ejemplo de vector::

source: Environment example::
es: Ejemplo de entorno::

source: Replacing :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`
es: Cómo reemplazar :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`

source: Return code handling translates as follows::
es: La gestión del código de retorno se traduce así::

source: Replacing functions from the :mod:`popen2` module
es: Cómo reemplazar las funciones del módulo :mod:`popen2`

source: If the cmd argument to popen2 functions is a string, the command is executed through /bin/sh. If it is a list, the command is directly executed.
es: Si el argumento *cmd* de las funciones popen2 es una cadena, la orden se ejecuta a través de `/bin/sh`. Si es una lista, la orden se ejecuta directamente.

source: :class:`popen2.Popen3` and :class:`popen2.Popen4` basically work as :class:`subprocess.Popen`, except that:
es: :class:`popen2.Popen3` y :class:`popen2.Popen4` funcionan a grandes rasgos como :class:`subprocess.Popen`, salvo:

source: :class:`Popen` raises an exception if the execution fails.
es: :class:`Popen` lanza una excepción si falla la ejecución.

source: The *capturestderr* argument is replaced with the *stderr* argument.
es: El argumento *capturestderr* se sustituye por el argumento *stderr*.

source: ``stdin=PIPE`` and ``stdout=PIPE`` must be specified.
es: Se ha de especificar ``stdin=PIPE`` y ``stdout=PIPE``.

source: popen2 closes all file descriptors by default, but you have to specify ``close_fds=True`` with :class:`Popen` to guarantee this behavior on all platforms or past Python versions.
es: popen2 cierra todos los descriptores de fichero por omisión, pero se ha de especificar ``close_fds=True`` con :class:`Popen` para garantizar este comportamiento en todas las plataformas o en versiones anteriores de Python.

source: Legacy Shell Invocation Functions
es: Funciones de llamada a la shell de retrocompatibilidad

source: This module also provides the following legacy functions from the 2.x ``commands`` module. These operations implicitly invoke the system shell and none of the guarantees described above regarding security and exception handling consistency are valid for these functions.
es: Este módulo también proporciona las siguientes funciones de compatibilidad del módulo ``commands`` de las versiones 2.X. Estas operaciones invocan implícitamente a la shell del sistema y no se les aplican ninguna de las garantías descritas anteriormente respecto a seguridad o consistencia en la gestión de excepciones.

source: Return ``(exitcode, output)`` of executing *cmd* in a shell.
es: Retorna ``(exitcode, output)`` de ejecutar *cmd* en una shell.

source: Execute the string *cmd* in a shell with :meth:`Popen.check_output` and return a 2-tuple ``(exitcode, output)``. *encoding* and *errors* are used to decode output; see the notes on :ref:`frequently-used-arguments` for more details.
es: Ejecuta la cadena *cmd* en un shell con :meth:`Popen.check_output` y retorna una tupla ``(exitcode, output)`` de 2. *encoding* y *errors* se utilizan para decodificar la salida; consulte las notas sobre :ref:`frequently-used-arguments` para obtener más detalles.

source: A trailing newline is stripped from the output. The exit code for the command can be interpreted as the return code of subprocess. Example::
es: Se elimina un salto de línea final de la salida. El código de salida de la orden se puede interpretar como el código de retorno del subproceso. Por ejemplo::

source: Windows support was added.
es: Se añadió soporte de Windows.

source: The function now returns (exitcode, output) instead of (status, output) as it did in Python 3.3.3 and earlier. exitcode has the same value as :attr:`~Popen.returncode`.
es: La función ahora retorna ``(exitcode, output)`` en lugar de ``(status, output)`` como en Python 3.3.3 y anteriores. *exitcode* tiene el mismo valor que :attr:`~Popen.returncode`.

source: Added *encoding* and *errors* arguments.
es: Se agregaron argumentos *encoding* y *errors*.

source: Return output (stdout and stderr) of executing *cmd* in a shell.
es: Retorna la salida (stdout y stderr) de ejecutar *cmd* en una shell.

source: Like :func:`getstatusoutput`, except the exit code is ignored and the return value is a string containing the command's output. Example::
es: Como :func:`getstatusoutput`, salvo que se ignora el código de salida y el valor retornado es una cadena que contiene la salida del comando. Por ejemplo::

source: Windows support added
es: Se añadió soporte de Windows

source: Notes
es: Notas

source: Converting an argument sequence to a string on Windows
es: Cómo convertir una secuencia de argumentos a una cadena en Windows

source: On Windows, an *args* sequence is converted to a string that can be parsed using the following rules (which correspond to the rules used by the MS C runtime):
es: En Windows, para convertir una secuencia *args* en una cadena que puede ser analizada con las siguientes reglas (correspondientes a las reglas que usa la biblioteca de ejecución de MS C):

source: Arguments are delimited by white space, which is either a space or a tab.
es: Los argumentos se separan por espacio en blanco, que debe ser un espacio o un tabulador.

source: A string surrounded by double quotation marks is interpreted as a single argument, regardless of white space contained within. A quoted string can be embedded in an argument.
es: Una cadena entre comillas dobles se interpreta como un argumento simple, sin importar los espacios en blanco que contenga. Se puede incrustar una cadena entre comillas en un argumento.

source: A double quotation mark preceded by a backslash is interpreted as a literal double quotation mark.
es: Una comilla doble precedida de una barra invertida se interpreta literalmente como una comilla doble.

source: Backslashes are interpreted literally, unless they immediately precede a double quotation mark.
es: Las barras invertidas se interpretan literalmente, salvo que precedan a una comilla doble.

source: If backslashes immediately precede a double quotation mark, every pair of backslashes is interpreted as a literal backslash. If the number of backslashes is odd, the last backslash escapes the next double quotation mark as described in rule 3.
es: Si las barras invertidas preceden inmediatamente a una doble comilla, cada par de barras invertidas se interpreta como una barra invertida literal. Si el número de barras invertidas es impar, la última barra invertida escapa la siguiente comilla doble según se describe en la regla 3.

source: Module which provides function to parse and escape command lines.
es: Módulo que proporciona una función para analizar y escapar líneas de órdenes.

source: Disabling use of ``vfork()`` or ``posix_spawn()``
es: Deshabilitar el uso de ``vfork()`` o ``posix_spawn()``

source: On Linux, :mod:`subprocess` defaults to using the ``vfork()`` system call internally when it is safe to do so rather than ``fork()``. This greatly improves performance.
es: En Linux, :mod:`subprocess` usa de forma predeterminada la llamada al sistema ``vfork()`` internamente cuando es seguro hacerlo en lugar de ``fork()``. Esto mejora mucho el rendimiento.

source: Please file issues any time you have to use these private knobs with a way to reproduce the issue you were seeing. Link to that issue from a comment in your code.
es: Presente los problemas cada vez que tenga que usar estas perillas privadas con una forma de reproducir el problema que estaba viendo. Enlace a ese problema desde un comentario en su código.
