Repository: python/python-docs-es
Catalog: library/subprocess.po
Languages: es

source: :mod:`subprocess` --- Subprocess management
es: :mod:`subprocess` --- Gestión de subprocesos

source: **Source code:** :source:`Lib/subprocess.py`
es: **Código fuente:** :source:`Lib/subprocess.py`

source: The :mod:`subprocess` module allows you to spawn new processes, connect to their input/output/error pipes, and obtain their return codes. This module intends to replace several older modules and functions::
es: El módulo :mod:`subprocess` permite lanzar nuevos procesos, conectarse a sus pipes de entrada/salida/error y obtener sus códigos de resultado. Este módulo está destinado a reemplazar múltiples módulos y funciones previamente existentes::

source: Information about how the :mod:`subprocess` module can be used to replace these modules and functions can be found in the following sections.
es: Se puede obtener información sobre cómo utilizar el módulo :mod:`subprocess` para reemplazar estos módulos y funciones en las siguientes secciones.

source: :pep:`324` -- PEP proposing the subprocess module
es: :pep:`324` -- PEP de proposición del módulo `subprocess`

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para obtener más información.

source: Using the :mod:`subprocess` Module
es: Uso del módulo :mod:`subprocess`

source: The recommended approach to invoking subprocesses is to use the :func:`run` function for all use cases it can handle. For more advanced use cases, the underlying :class:`Popen` interface can be used directly.
es: La opción recomendada para invocar subprocesos es utilizar la función :func:`run` para todos los casos al alcance de ésta. Para usos más avanzados, se puede utilizar la interfaz de más bajo nivel :class:`Popen`.

source: Run the command described by *args*. Wait for command to complete, then return a :class:`CompletedProcess` instance.
es: Ejecuta la orden descrita por *args*. Espera a que termine y retorna una instancia de :class:`CompletedProcess`.

source: The arguments shown above are merely the most common ones, described below in :ref:`frequently-used-arguments` (hence the use of keyword-only notation in the abbreviated signature). The full function signature is largely the same as that of the :class:`Popen` constructor - most of the arguments to this function are passed through to that interface. (*timeout*, *input*, *check*, and *capture_output* are not.)
es: Los argumentos mostrados en la definición superior son sólo los más comunes; que se describen posteriormente en :ref:`frequently-used-arguments` (de ahí el uso de la notación por clave en la signatura abreviada). La signatura completa de la función es a grandes rasgos la misma que la del constructor de :class:`Popen`; la mayoría de los argumentos de esta función se pasan a esa interfaz (no es el caso de *timeout*, *input*, *check* ni *capture_output*).

source: If *capture_output* is true, stdout and stderr will be captured. When used, the internal :class:`Popen` object is automatically created with ``stdout=PIPE`` and ``stderr=PIPE``. The *stdout* and *stderr* arguments may not be supplied at the same time as *capture_output*. If you wish to capture and combine both streams into one, use ``stdout=PIPE`` and ``stderr=STDOUT`` instead of *capture_output*.
es: Si *capture_output* es verdadero, se capturarán stdout y stderr. En tal caso, el objeto :class:`Popen` interno se crea automáticamente con ``stdout=PIPE`` y ``stderr=PIPE``. No se pueden proporcionar los argumentos *stdout* y *stderr* a la vez que *capture_output*. Si se desea capturar y combinar los dos flujos, se ha de usar ``stdout=PIPE`` y ``stderr=STDOUT`` en lugar de *capture_output*.

source: The *input* argument is passed to :meth:`Popen.communicate` and thus to the subprocess's stdin. If used it must be a byte sequence, or a string if *encoding* or *errors* is specified or *text* is true. When used, the internal :class:`Popen` object is automatically created with ``stdin=PIPE``, and the *stdin* argument may not be used as well.
es: Se pasará el argumento *input* a :meth:`Popen.communicate` y de ahí, a la entrada estándar del subproceso. Si se usa, debe ser una secuencia de bytes o una cadena de texto si se especifican *encoding* o *errors* o *text* en verdadero. Cuando se usa, el objeto :class:`Popen` interno se crea automáticamente con ``stdin=PIPE`` y no se puede usar el argumento *stdin* a la vez.

source: If *check* is true, and the process exits with a non-zero exit code, a :exc:`CalledProcessError` exception will be raised. Attributes of that exception hold the arguments, the exit code, and stdout and stderr if they were captured.
es: Si *check* es verdadero y el proceso retorna un resultado distinto de cero, se lanzará una excepción :exc:`CalledProcessError`. Los atributos de dicha excepción contendrán los argumentos, el código retornado y tanto stdout como stderr si se capturaron.

source: If *encoding* or *errors* are specified, or *text* is true, file objects for stdin, stdout and stderr are opened in text mode using the specified *encoding* and *errors* or the :class:`io.TextIOWrapper` default. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
es: Si se especifican *encoding* o *errors* o *text* es verdadero, se abrirán los objetos fichero para stdin, stdout y stderr en modo texto, con los *encoding* y *errors* especificados o los valores predeterminados de :class:`io.TextIOWrapper`. El argumento *universal_newlines* equivale a *text* y se admite por compatibilidad hacia atrás. Los objetos fichero se abren en modo binario por defecto.

source: Examples::
es: Ejemplos::

source: Added *encoding* and *errors* parameters
es: Se añadieron los parámetros *encoding* y *errors*

source: Added the *text* parameter, as a more understandable alias of *universal_newlines*. Added the *capture_output* parameter.
es: Se añadió el parámetro *text* como alias más comprensible de *universal_newlines*. Se añadió el parámetro *capture_output*.

source: The return value from :func:`run`, representing a process that has finished.
es: El valor retornado por :func:`run`, que representa un proceso ya terminado.

source: The arguments used to launch the process. This may be a list or a string.
es: Los argumentos utilizados para lanzar el proceso. Pueden ser una lista o una cadena.

source: Exit status of the child process. Typically, an exit status of 0 indicates that it ran successfully.
es: Estado de salida del proceso hijo. Típicamente, un estado de salida 0 indica que la ejecución tuvo éxito.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
es: Un valor negativo ``-N`` indica que el hijo fue forzado a terminar con la señal ``N`` (solamente POSIX).

source: Captured stdout from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stdout was not captured.
es: La salida estándar capturada del proceso hijo. Una secuencia de bytes, o una cadena si se llamó a :func:`run` con *encoding*, *errors*, o *text* establecidos a ``True``. ``None`` si no se capturó el error estándar.

source: If you ran the process with ``stderr=subprocess.STDOUT``, stdout and stderr will be combined in this attribute, and :attr:`stderr` will be ``None``.
es: Si se ejecutó el proceso con ``stderr=subprocess.STDOUT``, stdout y stderr se combinarán en este atributo, y :attr:`stderr` será ``None``.

source: Captured stderr from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stderr was not captured.
es: El error estándar capturado del proceso hijo. Una secuencia de bytes, o una cadena si se llamó a :func:`run` con *encoding*, *errors*, o *text* establecidos a ``True``. ``None`` si no se capturó el error estándar.

source: If :attr:`returncode` is non-zero, raise a :exc:`CalledProcessError`.
es: Si :attr:`returncode` no es cero, lanza un :exc:`CalledProcessError`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that the special file :data:`os.devnull` will be used.
es: Valor especial que se puede usar como argumento *stdin*, *stdout* o *stderr* de :class:`Popen` y que indica que se usará el fichero especial :data:`os.devnull`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that a pipe to the standard stream should be opened. Most useful with :meth:`Popen.communicate`.
es: Valor especial que se puede usar como argumento *stdin*, *stdout* o *stderr* de :class:`Popen` y que indica que se abrirá un pipe al flujo indicado. Es útil para usarlo con :meth:`Popen.communicate`.

source: Special value that can be used as the *stderr* argument to :class:`Popen` and indicates that standard error should go into the same handle as standard output.
es: Valor especial que se puede usar de argumento *stderr* a :class:`Popen` y que indica que el error estándar debería ir al mismo gestor que la salida estándar.

source: Base class for all other exceptions from this module.
es: Clase base para el resto de excepciones de este módulo.

source: Subclass of :exc:`SubprocessError`, raised when a timeout expires while waiting for a child process.
es: Subclase de :exc:`SubprocessError`, se lanza cuando expira un plazo de ejecución esperando a un proceso hijo.

source: Command that was used to spawn the child process.
es: Orden que se utilizó para lanzar el proceso hijo.

source: Timeout in seconds.
es: Plazo de ejecución en segundos.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``. This is always :class:`bytes` when any output was captured regardless of the ``text=True`` setting. It may remain ``None`` instead of ``b''`` when no output was observed.
es: Salida del proceso hijo si fue capturado por :func:`run` o :func:`check_output`. De lo contrario, ``None``. Siempre es :class:`bytes` cuando se capturó cualquier salida, independientemente de la configuración de ``text=True``. Puede permanecer ``None`` en lugar de ``b''`` cuando no se observó ningún resultado.

source: Alias for output, for symmetry with :attr:`stderr`.
es: Alias de *output*, por simetría con :attr:`stderr`.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``. This is always :class:`bytes` when stderr output was captured regardless of the ``text=True`` setting. It may remain ``None`` instead of ``b''`` when no stderr output was observed.
es: Salida Stderr del proceso hijo si fue capturado por :func:`run`. De lo contrario, ``None``. Siempre es :class:`bytes` cuando se capturó la salida de stderr independientemente de la configuración de ``text=True``. Puede permanecer como ``None`` en lugar de ``b''`` cuando no se observó ninguna salida de stderr.

source: *stdout* and *stderr* attributes added
es: Se añadieron los atributos *stdout* y *stderr*

source: Subclass of :exc:`SubprocessError`, raised when a process run by :func:`check_call`, :func:`check_output`, or :func:`run` (with ``check=True``) returns a non-zero exit status.
es: Subclase de :exc:`SubprocessError`, lanzada cuando un proceso ejecutado por :func:`check_call`, :func:`check_output` o :func:`run` (con ``check=True``) devuelve un estado de salida distinto de cero.

source: Exit status of the child process. If the process exited due to a signal, this will be the negative signal number.
es: Estado de salida del proceso hijo. Si el proceso terminó por causa de una señal, el estado será el número de la señal en negativo.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``.
es: Salida del proceso hijo si fue capturada por :func:`run` o :func:`check_output`. De otro modo, ``None``.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``.
es: Salida de *stderr* del proceso hijo si fue capturada por :func:`run`. De otro modo, ``None``.

source: Frequently Used Arguments
es: Argumentos frecuentemente empleados

source: To support a wide variety of use cases, the :class:`Popen` constructor (and the convenience functions) accept a large number of optional arguments. For most typical use cases, many of these arguments can be safely left at their default values. The arguments that are most commonly needed are:
es: Para permitir una gran variedad de usos, el constructor de :class:`Popen` (y las funciones asociadas) aceptan un gran número de argumentos opcionales. Para los usos más habituales, se pueden dejar de forma segura los valores por defecto. Los argumentos más frecuentemente necesarios son:

source: *args* is required for all calls and should be a string, or a sequence of program arguments. Providing a sequence of arguments is generally preferred, as it allows the module to take care of any required escaping and quoting of arguments (e.g. to permit spaces in file names). If passing a single string, either *shell* must be :const:`True` (see below) or else the string must simply name the program to be executed without specifying any arguments.
es: *args* se requiere en todas las llamadas; debe ser una cadena o una secuencia de argumentos al programa. En general, es mejor proporcionar una secuencia de argumentos porque permite que el módulo se ocupe de las secuencias de escape y los entrecomillados de los argumentos (por ejemplo, para permitir espacios en los nombres de fichero). Si se pasa una cadena simple, se ha de especificar *shell* como :const:`True` (ver más adelante) o la cadena debe ser el nombre del programa a ejecutar sin especificar ningún argumento.

source: If *encoding* or *errors* are specified, or *text* (also known as *universal_newlines*) is true, the file objects *stdin*, *stdout* and *stderr* will be opened in text mode using the *encoding* and *errors* specified in the call or the defaults for :class:`io.TextIOWrapper`.
es: Si se especifican *encoding* o *errors*, o *text* (o su alias *universal_newlines*) es verdadero, se abrirán en modo texto los objetos fichero *stdin*, *stdout* y *stderr* usando los *encoding* y *errors* especificados en la llamada o los valores predeterminados de :class:`io.TextIOWrapper`.

source: For *stdin*, line ending characters ``'\n'`` in the input will be converted to the default line separator :data:`os.linesep`. For *stdout* and *stderr*, all line endings in the output will be converted to ``'\n'``. For more information see the documentation of the :class:`io.TextIOWrapper` class when the *newline* argument to its constructor is ``None``.
es: Para *stdin*, los saltos del línea ``'\n'`` de la entrada serán convertidos al separador de línea predeterminado :data:`os.linesep`. Para *stdout* y *stderr*, todos los saltos de línea de la salida serán convertidos a ``'\n'``. Hay más información en la documentación de la clase :class:`io.TextIOWrapper` para el caso en que el argumento *newline* de su constructor es ``None``.

source: If text mode is not used, *stdin*, *stdout* and *stderr* will be opened as binary streams. No encoding or line ending conversion is performed.
es: Si no se usa el modo texto, *stdin*, *stdout* y *stderr* se abrirán como flujos binarios. No se realizará ninguna codificación ni conversión de salto de línea.

source: Added *encoding* and *errors* parameters.
es: Se añadieron los parámetros *encoding* y *errors*.

source: Added the *text* parameter as an alias for *universal_newlines*.
es: Se añadió el parámetro *text* como alias de *universal_newlines*.

source: The newlines attribute of the file objects :attr:`Popen.stdin`, :attr:`Popen.stdout` and :attr:`Popen.stderr` are not updated by the :meth:`Popen.communicate` method.
es: El atributo `newlines` de los objetos fichero :attr:`Popen.stdin`, :attr:`Popen.stdout` y :attr:`Popen.stderr` no es actualizado por el método :meth:`Popen.communicate`.

source: If *shell* is ``True``, the specified command will be executed through the shell. This can be useful if you are using Python primarily for the enhanced control flow it offers over most system shells and still want convenient access to other shell features such as shell pipes, filename wildcards, environment variable expansion, and expansion of ``~`` to a user's home directory. However, note that Python itself offers implementations of many shell-like features (in particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, and :mod:`shutil`).
es: Si *shell* es ``True``, la orden especificada se ejecutará pasando por la shell. Esto tiene utilidad si se usa Python principalmente por el flujo de control mejorado sobre la mayoría de las shell de sistema, pero se desea también un acceso práctico a otras características de la shell, como pipes, nombres de fichero con comodines, expansión de variables de entorno o expansión de ``~`` al directorio *home* del usuario. Sin embargo, no se debe olvidar que el propio Python tiene implementaciones de muchas características tipo shell (en particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, y :mod:`shutil`).

source: When *universal_newlines* is ``True``, the class uses the encoding :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` instead of ``locale.getpreferredencoding()``. See the :class:`io.TextIOWrapper` class for more information on this change.
es: Cuando *universal_newlines* es ``True``, la clase usa la codificación :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` en lugar de ``locale.getpreferredencoding()``. Ver la clase :class:`io.TextIOWrapper` para obtener más información sobre este cambio.

source: Read the `Security Considerations`_ section before using ``shell=True``.
es: Leer la sección `Consideraciones sobre la seguridad`_ antes de usar ``shell=True``.

source: These options, along with all of the other options, are described in more detail in the :class:`Popen` constructor documentation.
es: Estas opciones y el resto se describen con más detalle en la documentación del constructor de :class:`Popen`.

source: Popen Constructor
es: El constructor de Popen

source: The underlying process creation and management in this module is handled by the :class:`Popen` class. It offers a lot of flexibility so that developers are able to handle the less common cases not covered by the convenience functions.
es: El proceso interno de creación y gestión de este módulo lo gestiona la clase :class:`Popen`. Proporciona una gran flexibilidad para que los desarrolladores sean capaces de gestionar los casos menos comunes que quedan sin cubrir por las funciones auxiliares.

source: Execute a child program in a new process. On POSIX, the class uses :meth:`os.execvpe`-like behavior to execute the child program. On Windows, the class uses the Windows ``CreateProcess()`` function. The arguments to :class:`Popen` are as follows.
es: Ejecuta un programa hijo en un proceso nuevo. En POSIX, la clase usa :meth:`os.execvp` como comportamiento para lanzar el proceso hijo. En Windows, la clase usa la función ``CreateProcess()`` de Windows. Los argumentos de :class:`Popen` son los siguientes.

source: *args* should be a sequence of program arguments or else a single string or :term:`path-like object`. By default, the program to execute is the first item in *args* if *args* is a sequence. If *args* is a string, the interpretation is platform-dependent and described below. See the *shell* and *executable* arguments for additional differences from the default behavior. Unless otherwise stated, it is recommended to pass *args* as a sequence.
es: *args* debe ser o una secuencia de argumentos de programa o una cadena simple o un :term:`objeto tipo ruta <path-like object>`. Por omisión, el programa a ejecutar es el primer elemento de *args* si *args* es una secuencia. Si *args* es una cadena, la interpretación es dependiente de la plataforma, según se describe más abajo. Véase los argumentos *shell* y *executable* para más información sobre el comportamiento por defecto. Salvo que se indique, se recomienda pasar los *args* como una secuencia.

source: For maximum reliability, use a fully qualified path for the executable. To search for an unqualified name on :envvar:`PATH`, use :meth:`shutil.which`. On all platforms, passing :data:`sys.executable` is the recommended way to launch the current Python interpreter again, and use the ``-m`` command-line format to launch an installed module.
es: Para obtener la máxima confiabilidad, use una ruta completa para el ejecutable. Para buscar un nombre no calificado en :envvar:`PATH`, use :meth:`shutil.which`. En todas las plataformas, pasar :data:`sys.executable` es la forma recomendada de iniciar de nuevo el intérprete de Python actual y usar el formato de línea de comandos ``-m`` para iniciar un módulo instalado.

source: Resolving the path of *executable* (or the first item of *args*) is platform dependent. For POSIX, see :meth:`os.execvpe`, and note that when resolving or searching for the executable path, *cwd* overrides the current working directory and *env* can override the ``PATH`` environment variable. For Windows, see the documentation of the ``lpApplicationName`` and ``lpCommandLine`` parameters of WinAPI ``CreateProcess``, and note that when resolving or searching for the executable path with ``shell=False``, *cwd* does not override the current working directory and *env* cannot override the ``PATH`` environment variable. Using a full path avoids all of these variations.
es: La resolución de la ruta de *executable* (o el primer elemento de *args*) depende de la plataforma. Para POSIX, consulte :meth:`os.execvpe`, y tenga en cuenta que al resolver o buscar la ruta ejecutable, *cwd* anula el directorio de trabajo actual y *env* puede anular la variable de entorno ``PATH``. Para Windows, consulte la documentación de los parámetros ``lpApplicationName`` e ``lpCommandLine`` de WinAPI ``CreateProcess``, y tenga en cuenta que al resolver o buscar la ruta ejecutable con ``shell = False``, *cwd* no anula el directorio de trabajo actual y *env* no puede anular la variable de entorno ``PATH``. El uso de una ruta completa evita todas estas variaciones.

source: An example of passing some arguments to an external program as a sequence is::
es: Un ejemplo del paso de argumentos a un programa externo mediante una secuencia::

source: On POSIX, if *args* is a string, the string is interpreted as the name or path of the program to execute. However, this can only be done if not passing arguments to the program.
es: En POSIX, si *args* es una cadena se interpreta como el nombre o la ruta del programa que ejecutar. Sin embargo, esto solamente funciona si no hay que pasar argumentos al programa.

source: It may not be obvious how to break a shell command into a sequence of arguments, especially in complex cases. :meth:`shlex.split` can illustrate how to determine the correct tokenization for *args*::
es: Puede que no resulte evidente cómo descomponer una orden de la shell en una secuencia de argumentos, especialmente en casos complejos. :meth:`shlex.split` puede aclarar cómo determinar la descomposición en tokens de *args*::
