Repository: python/python-docs-es
Catalog: library/subprocess.po
Languages: es

source: This will deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates enough output to a pipe such that it blocks waiting for the OS pipe buffer to accept more data. Use :meth:`Popen.communicate` when using pipes to avoid that.
es: Esto causará un bloqueo cuando se use ``stdout=PIPE`` o ``stderr=PIPE`` y el proceso hijo genere suficiente salida hacia un pipe como para bloquear esperando que el búfer del pipe del SO acepte más datos. Se debe usar :meth:`Popen.communicate` cuando se usen pipes para evitar esto.

source: The function is implemented using a busy loop (non-blocking call and short sleeps). Use the :mod:`asyncio` module for an asynchronous wait: see :class:`asyncio.create_subprocess_exec`.
es: Esta función se implementa mediante una espera activa (llamada no bloqueante y breves llamadas a `sleep`). Se debe usar el módulo :mod:`asyncio` para hacer una espera asíncrona: ver :class:`asyncio.create_subprocess_exec`.

source: *timeout* was added.
es: Se añadió *timeout*.

source: Interact with process: Send data to stdin. Read data from stdout and stderr, until end-of-file is reached. Wait for process to terminate and set the :attr:`~Popen.returncode` attribute. The optional *input* argument should be data to be sent to the child process, or ``None``, if no data should be sent to the child. If streams were opened in text mode, *input* must be a string. Otherwise, it must be bytes.
es: Interactúa con el proceso: Envía datos a stdin. Lee datos de stdout y stderr hasta encontrar un fin-de-fichero. Espera a que termine el proceso y escribe el atributo :attr:`~Popen.returncode`. El argumento opcional *input* debe contener los datos que hay que enviar al proceso hijo o ``None`` si no hay que enviar datos al proceso hijo. Si se abrieron los flujos en modo texto, *input* ha de ser una cadena de caracteres. En caso contrario, debe contener bytes.

source: :meth:`communicate` returns a tuple ``(stdout_data, stderr_data)``. The data will be strings if streams were opened in text mode; otherwise, bytes.
es: :meth:`communicate` retorna una tupla ``(stdout_data, stderr_data)``. Los datos serán cadenas si se abrieron los flujos en modo texto, en caso contrario serán bytes.

source: Note that if you want to send data to the process's stdin, you need to create the Popen object with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, you need to give ``stdout=PIPE`` and/or ``stderr=PIPE`` too.
es: Adviértase que si se desea enviar datos al stdin del proceso, se ha de crear el objeto Popen con ``stdin=PIPE``. Análogamente, para obtener algo diferente de ``None`` en la tupla del resultado, hay que suministrar ``stdout=PIPE`` o ``stderr=PIPE`` también.

source: If the process does not terminate after *timeout* seconds, a :exc:`TimeoutExpired` exception will be raised. Catching this exception and retrying communication will not lose any output.
es: Si el proceso no termina tras *timeout* segundos, se lanza una excepción :exc:`TimeoutExpired`. Si se captura dicha excepción y se reintenta la comunicación, no se perderán datos de salida.

source: The child process is not killed if the timeout expires, so in order to cleanup properly a well-behaved application should kill the child process and finish communication::
es: No se matará el proceso si vence el plazo de ejecución, así que para hacer limpieza, una aplicación correcta debería matar el proceso y terminar la comunicación::

source: The data read is buffered in memory, so do not use this method if the data size is large or unlimited.
es: Los datos leídos pasan por un búfer en memoria, así que no se ha de usar este método para un tamaño de datos grande o ilimitado.

source: Sends the signal *signal* to the child.
es: Envía la señal *signal* al proceso hijo.

source: Do nothing if the process completed.
es: No hace nada si el proceso ya ha terminado.

source: On Windows, SIGTERM is an alias for :meth:`terminate`. CTRL_C_EVENT and CTRL_BREAK_EVENT can be sent to processes started with a *creationflags* parameter which includes ``CREATE_NEW_PROCESS_GROUP``.
es: En Windows, SIGTERM es un alias de :meth:`terminate`. CTRL_C_EVENT y CTRL_BREAK_EVENT se pueden enviar a procesos iniciados con un parámetro *creationflags* que incluye ``CREATE_NEW_PROCESS_GROUP``.

source: Stop the child. On POSIX OSs the method sends SIGTERM to the child. On Windows the Win32 API function :c:func:`TerminateProcess` is called to stop the child.
es: Detiene el proceso hijo. En sistemas operativos POSIX este método envía SIGTERM al proceso hijo. En Windows se llama a la función :c:func:`TerminateProcess` de la API de Win32 para detener el proceso hijo.

source: Kills the child. On POSIX OSs the function sends SIGKILL to the child. On Windows :meth:`kill` is an alias for :meth:`terminate`.
es: Mata el proceso hijo. En sistemas operativos POSIX la función envía SIGKILL al proceso hijo. En Windows :meth:`kill` es un alias de :meth:`terminate`.

source: The *args* argument as it was passed to :class:`Popen` -- a sequence of program arguments or else a single string.
es: El argumento *args* según se pasó a :class:`Popen`: o una secuencia de argumentos del programa o una cadena sencilla.

source: Use :meth:`~Popen.communicate` rather than :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` or :attr:`.stderr.read <Popen.stderr>` to avoid deadlocks due to any of the other OS pipe buffers filling up and blocking the child process.
es: Se ha de usar :meth:`~Popen.communicate` en lugar de :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` o :attr:`.stderr.read <Popen.stderr>` para evitar bloqueos por búfer de pipes del SO llenos que puedan bloquear el proceso hijo.

source: The process ID of the child process.
es: El ID de proceso del hijo.

source: Note that if you set the *shell* argument to ``True``, this is the process ID of the spawned shell.
es: Adviértase que si se establece el argumento *shell* a ``True``, éste es el ID de proceso del la shell generada.

source: Windows Popen Helpers
es: Elementos auxiliares de Popen en Windows

source: The :class:`STARTUPINFO` class and following constants are only available on Windows.
es: La clase :class:`STARTUPINFO` y las siguientes constantes sólo están disponibles en Windows.

source: Partial support of the Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ structure is used for :class:`Popen` creation. The following attributes can be set by passing them as keyword-only arguments.
es: Se utiliza un soporte parcial de la estructura `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ de Windows para la creación de :class:`Popen`. Se pueden establecer los siguientes atributos pasándolos como argumentos sólo por clave.

source: Keyword-only argument support was added.
es: Se añadió el soporte de argumentos sólo por clave.

source: A bit field that determines whether certain :class:`STARTUPINFO` attributes are used when the process creates a window. ::
es: Un campo bit que determina si se usan ciertos atributos de :class:`STARTUPINFO` cuando el proceso crea una ventana. ::

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard input handle for the process. If :data:`STARTF_USESTDHANDLES` is not specified, the default for standard input is the keyboard buffer.
es: Si :attr:`dwFlags` especifica :data:`STARTF_USESTDHANDLES`, este atributo es el gestor de entrada estándar del proceso. Si no se especifica :data:`STARTF_USESTDHANDLES`, el valor predeterminado de entrada estándar es el búfer de teclado.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard output handle for the process. Otherwise, this attribute is ignored and the default for standard output is the console window's buffer.
es: Si :attr:`dwFlags` especifica :data:`STARTF_USESTDHANDLES`, este atributo es el gestor de salida estándar del proceso. En caso contrario, se hace caso omiso del atributo y el valor predeterminado de salida estándar es el búfer de ventana.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard error handle for the process. Otherwise, this attribute is ignored and the default for standard error is the console window's buffer.
es: Si :attr:`dwFlags` especifica :data:`STARTF_USESTDHANDLES`, este atributo es el gestor de error estándar del proceso. En caso contrario, se hace caso omiso del atributo y el valor predeterminado de error estándar es el búfer de ventana.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESHOWWINDOW`, this attribute can be any of the values that can be specified in the ``nCmdShow`` parameter for the `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__ function, except for ``SW_SHOWDEFAULT``. Otherwise, this attribute is ignored.
es: Si :attr:`dwFlags` especifica :data:`STARTF_USESHOWWINDOW`, este atributo puede ser cualquiera de los valores que pueden especificarse en el parámetro ``nCmdShow`` para la función `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__, salvo ``SW_SHOWDEFAULT``. De otro modo, se hace caso omiso del atributo.

source: :data:`SW_HIDE` is provided for this attribute. It is used when :class:`Popen` is called with ``shell=True``.
es: Se proporciona :data:`SW_HIDE` para este atributo. Se usa cuando se llama a :class:`Popen` con ``shell=True``.

source: A dictionary of additional attributes for process creation as given in ``STARTUPINFOEX``, see `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
es: Un diccionario de atributos adicionales para la creación del proceso, según ``STARTUPINFOEX``, véase `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.

source: Supported attributes:
es: Atributos admitidos:

source: Sequence of handles that will be inherited. *close_fds* must be true if non-empty.
es: Una secuencia de gestores que se heredará. *close_fds* debe ser verdadero si no viene vacío.

source: The handles must be temporarily made inheritable by :func:`os.set_handle_inheritable` when passed to the :class:`Popen` constructor, else :class:`OSError` will be raised with Windows error ``ERROR_INVALID_PARAMETER`` (87).
es: Los gestores deben hacerse temporalmente heredables por :func:`os.set_handle_inheritable` cuando se pasan al constructor de :class:`Popen` o de lo contrario, se lanzará :class:`OSError` con el error de Windows ``ERROR_INVALID_PARAMETER`` (87).

source: In a multithreaded process, use caution to avoid leaking handles that are marked inheritable when combining this feature with concurrent calls to other process creation functions that inherit all handles such as :func:`os.system`. This also applies to standard handle redirection, which temporarily creates inheritable handles.
es: En un proceso multihilo, hay que evitar filtrar gestores no heredables cuando se combina esta característica con llamadas concurrentes a otras funciones de creación de procesos que heredan todos los gestores, como :func:`os.system`. Esto también rige para la redirección de gestores estándar, que crea temporalmente gestores heredables.

source: Windows Constants
es: Constantes de Windows

source: The :mod:`subprocess` module exposes the following constants.
es: El módulo :mod:`subprocess` expone las siguientes constantes.

source: The standard input device. Initially, this is the console input buffer, ``CONIN$``.
es: El dispositivo de entrada estándar. Inicialmente, es el búfer de entrada de la consola, ``CONIN$``.

source: The standard output device. Initially, this is the active console screen buffer, ``CONOUT$``.
es: El dispositivo de salida estándar. Inicialmente, es el búfer de pantalla de la consola activa, ``CONOUT$``.

source: The standard error device. Initially, this is the active console screen buffer, ``CONOUT$``.
es: El dispositivo de error estándar. Inicialmente, es el búfer de pantalla de la consola activa, ``CONOUT$``.

source: Hides the window. Another window will be activated.
es: Oculta la ventana. Se activará otra ventana.

source: Specifies that the :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, and :attr:`STARTUPINFO.hStdError` attributes contain additional information.
es: Especifica que los atributos :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, y :attr:`STARTUPINFO.hStdError` contienen información adicional.

source: Specifies that the :attr:`STARTUPINFO.wShowWindow` attribute contains additional information.
es: Especifica que el atributo :attr:`STARTUPINFO.wShowWindow` contiene información adicional.

source: The new process has a new console, instead of inheriting its parent's console (the default).
es: El nuevo proceso obtiene una nueva consola, en lugar de heredar la consola del padre (que es el comportamiento predeterminado).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process group will be created. This flag is necessary for using :func:`os.kill` on the subprocess.
es: Un parámetro :class:`Popen` ``creationflags`` para especificar que se cree un nuevo grupo de procesos. Este indicador es necesario para usar :func:`os.kill` sobre el subproceso.

source: This flag is ignored if :data:`CREATE_NEW_CONSOLE` is specified.
es: Este indicador no se tiene en cuenta si se especifica :data:`CREATE_NEW_CONSOLE`.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an above average priority.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso tendrá una prioridad superior a la media.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a below average priority.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso tendrá una prioridad inferior a la media.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a high priority.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso tendrá una prioridad elevada.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an idle (lowest) priority.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso tendrá una la mínima prioridad.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an normal priority. (default)
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso tendrá una prioridad normal (éste es el valor predeterminado).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have realtime priority. You should almost never use REALTIME_PRIORITY_CLASS, because this interrupts system threads that manage mouse input, keyboard input, and background disk flushing. This class can be appropriate for applications that "talk" directly to hardware or that perform brief tasks that should have limited interruptions.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso tendrá una prioridad de tiempo real. Raramente se debería usar REALTIME_PRIORITY_CLASS, porque esto interrumpe los hilos que gestionan la entrada del ratón y del teclado, así como la gestión del volcado de búfer del disco. Esta clase es apropiada para aplicaciones que se comunican directamente con el hardware o que llevan a cabo tareas breves que no admitan interrupciones.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not create a window.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso no creará una ventana.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not inherit its parent's console. This value cannot be used with CREATE_NEW_CONSOLE.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso no heredará la consola del padre. Este valor es incompatible con CREATE_NEW_CONSOLE.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process does not inherit the error mode of the calling process. Instead, the new process gets the default error mode. This feature is particularly useful for multithreaded shell applications that run with hard errors disabled.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso no hereda el modo de error del proceso padre. En su lugar, el proceso parte del modo de error predeterminado. Esta característica es particularmente útil para aplicaciones de shell multihilo que se ejecutan con los errores 'duros' desactivados.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process is not associated with the job.
es: Parámetro :class:`Popen` ``creationflags`` para especificar que el nuevo proceso no está asociado a la tarea.

source: Older high-level API
es: Antigua API de alto nivel

source: Prior to Python 3.5, these three functions comprised the high level API to subprocess. You can now use :func:`run` in many cases, but lots of existing code calls these functions.
es: Antes de Python 3.5, estas tres funciones conformaban la API de alto nivel para subprocesos. Ahora se puede usar :func:`run` en muchos casos, pero hay mucho código escrito con estas funciones.

source: Run the command described by *args*. Wait for command to complete, then return the :attr:`~Popen.returncode` attribute.
es: Ejecutar la orden descrita por *args*. Esperar que la orden se complete y retornar al atributo :attr:`~Popen.returncode`.

source: Code needing to capture stdout or stderr should use :func:`run` instead::
es: El código que requiera capturar stdout o stderr debería usar :func:`run` en su lugar::

source: To suppress stdout or stderr, supply a value of :data:`DEVNULL`.
es: Para suprimir stdout o stderr se ha de proporcionar un valor de :data:`DEVNULL`.

source: The arguments shown above are merely some common ones. The full function signature is the same as that of the :class:`Popen` constructor - this function passes all supplied arguments other than *timeout* directly through to that interface.
es: Se muestran algunos argumentos comunes. La signatura completa de la función es la misma que la del constructor de :class:`Popen`; esta función pasa todos los argumentos proporcionados (salvo *timeout*) directamente a esa interfaz.

source: Do not use ``stdout=PIPE`` or ``stderr=PIPE`` with this function. The child process will block if it generates enough output to a pipe to fill up the OS pipe buffer as the pipes are not being read from.
es: No usar ``stdout=PIPE`` ni ``stderr=PIPE`` con esta función. El proceso hijo se bloqueará si genera suficiente salida a un pipe como para saturar el búfer del pipe del sistema operativo mientras no se lee de los pipes.

source: Run command with arguments. Wait for command to complete. If the return code was zero then return, otherwise raise :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute. If :func:`check_call` was unable to start the process it will propagate the exception that was raised.
es: Ejecuta la instrucción con argumentos. Espera a que la instrucción se complete. Si el código de retorno es cero retorna; en caso contrario, lanza :exc:`CalledProcessError`. El objeto :exc:`CalledProcessError` tendrá el código de retorno en el atributo :attr:`~CalledProcessError.returncode`.Si :func:`check_call` no pudo iniciar el proceso, propagará la excepción que fue lanzada.

source: Run command with arguments and return its output.
es: Ejecuta orden con argumentos y retorna su salida.

source: If the return code was non-zero it raises a :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute and any output in the :attr:`~CalledProcessError.output` attribute.
es: Si el código de retorno fue diferente de cero lanza un :exc:`CalledProcessError`. El objeto :exc:`CalledProcessError` tendrá el código de retorno en el atributo :attr:`~CalledProcessError.returncode` y los datos de salida en el atributo :attr:`~CalledProcessError.output`.

source: This is equivalent to::
es: Esto equivale a::

source: The arguments shown above are merely some common ones. The full function signature is largely the same as that of :func:`run` - most arguments are passed directly through to that interface. One API deviation from :func:`run` behavior exists: passing ``input=None`` will behave the same as ``input=b''`` (or ``input=''``, depending on other arguments) rather than using the parent's standard input file handle.
es: Los argumentos mostrados arriba son meramente algunos de los comunes. La signatura completa de la función es casi la misma que la de :func:`run` - la mayoría de los argumentos se pasa directamente a esa interfaz. Existe una diferencia con la interfaz de :func:`run` respecto al comportamiento: pasar ``input=None`` genera el mismo comportamiento que ``input=b''`` (o ``input=''``, dependiendo de otros argumentos) en vez de usar el flujo entrada estándar del padre.

source: By default, this function will return the data as encoded bytes. The actual encoding of the output data may depend on the command being invoked, so the decoding to text will often need to be handled at the application level.
es: Por omisión, esta función retornará los datos como bytes codificados. La codificación real de los datos podría depender de la orden invocada, por lo que la decodificación a texto se deberá hacer al nivel de la aplicación.

source: This behaviour may be overridden by setting *text*, *encoding*, *errors*, or *universal_newlines* to ``True`` as described in :ref:`frequently-used-arguments` and :func:`run`.
es: Este comportamiento se puede modificar estableciendo *text*, *encoding*, *errors*, o *universal_newlines* a ``True``, como se describe en :ref:`frequently-used-arguments` y :func:`run`.

source: To also capture standard error in the result, use ``stderr=subprocess.STDOUT``::
es: Para capturar también el error estándar del resultado se debe usar ``stderr=subprocess.STDOUT``::

source: Support for the *input* keyword argument was added.
es: Se añadió soporte para el argumento por clave *input*.

source: *encoding* and *errors* were added. See :func:`run` for details.
es: Se añadieron *encoding* y *errors*. Ver :func:`run` para más detalles.

source: Replacing Older Functions with the :mod:`subprocess` Module
es: Cómo reemplazar anteriores funciones con el módulo :mod:`subprocess`

source: In this section, "a becomes b" means that b can be used as a replacement for a.
es: En esta sección, "a se convierte en b" significa que b se puede usar en lugar de.

source: All "a" functions in this section fail (more or less) silently if the executed program cannot be found; the "b" replacements raise :exc:`OSError` instead.
es: Todas las funciones "a" de esta sección fracasan silenciosamente (o casi) si no se halla el programa ejecutado; las funciones de reemplazo "b" lanzan :exc:`OSError` en lugar de esto.
