Repository: python/python-docs-es
Catalog: library/subprocess.po
Languages: es

source: Note in particular that options (such as *-input*) and arguments (such as *eggs.txt*) that are separated by whitespace in the shell go in separate list elements, while arguments that need quoting or backslash escaping when used in the shell (such as filenames containing spaces or the *echo* command shown above) are single list elements.
es: Hay que destacar en particular que las opciones (como *-input*) y los argumentos (como *eggs.txt*) que van separados por espacio en blanco en la shell van en elementos de lista separados, mientras los argumentos que necesitan entrecomillado o escapado de espacios cuando se usan en la shell (como los nombres de ficheros con espacios o la orden *echo* anteriormente mostrada) son elementos simples de la lista.

source: On Windows, if *args* is a sequence, it will be converted to a string in a manner described in :ref:`converting-argument-sequence`. This is because the underlying ``CreateProcess()`` operates on strings.
es: En Windows, si *args* es una secuencia, se convertirá a cadena del modo descrito en :ref:`converting-argument-sequence`. Esto es así porque la función de bajo nivel ``CreateProcess()`` funciona sobre cadenas.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing path-like objects on POSIX.
es: El parámetro *args* toma un :term:`objeto tipo ruta <path-like object>` si *shell* es ``False`` y una secuencia de objetos tipo fichero en POSIX.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing bytes and path-like objects on Windows.
es: El parámetro *args* toma un :term:`objeto tipo ruta <path-like object>` si *shell* es ``False`` y una secuencia de bytes y objetos tipo fichero en Windows.

source: The *shell* argument (which defaults to ``False``) specifies whether to use the shell as the program to execute. If *shell* is ``True``, it is recommended to pass *args* as a string rather than as a sequence.
es: El argumento *shell* (``False`` por defecto) especifica si usar la shell como programa a ejecutar. Si *shell* es ``True``, se recomienda pasar *args* como cadena mejor que como secuencia.

source: On POSIX with ``shell=True``, the shell defaults to :file:`/bin/sh`. If *args* is a string, the string specifies the command to execute through the shell. This means that the string must be formatted exactly as it would be when typed at the shell prompt. This includes, for example, quoting or backslash escaping filenames with spaces in them. If *args* is a sequence, the first item specifies the command string, and any additional items will be treated as additional arguments to the shell itself. That is to say, :class:`Popen` does the equivalent of::
es: En POSIX con ``shell=True``, la shell predeterminada es :file:`/bin/sh`. Si *args* es una cadena, ésta especifica la orden a ejecutar por la shell. Esto significa que la cadena tiene que tener el formato que tendría si se tecleara en la línea de órdenes. Esto incluye, por ejemplo, el entrecomillado y las secuencias de escape necesarias para los nombres de fichero que contengan espacios. Si *args* es una secuencia, el primer elemento especifica la cadena de la orden y cualquier otro elemento será tratado como argumentos adicionales a la propia shell. De este modo, :class:`Popen` hace el equivalente de::

source: On Windows with ``shell=True``, the :envvar:`COMSPEC` environment variable specifies the default shell. The only time you need to specify ``shell=True`` on Windows is when the command you wish to execute is built into the shell (e.g. :command:`dir` or :command:`copy`). You do not need ``shell=True`` to run a batch file or console-based executable.
es: En Windows con ``shell=True``, la variable de entorno :envvar:`COMSPEC` especifica la shell predeterminada. Solamente hace falta especificar ``shell=True`` en Windows cuando la orden que se desea ejecutar es interna a la shell (como. :command:`dir` o :command:`copy`). No hace falta especificar ``shell=True`` para ejecutar un fichero por lotes o un ejecutable de consola.

source: *bufsize* will be supplied as the corresponding argument to the :func:`open` function when creating the stdin/stdout/stderr pipe file objects:
es: Se proporcionará *bufsize* como el argumento correspondiente a la función :func:`open` cuando se creen los objetos fichero de los flujos stdin/stdout/stderr:

source: any other positive value means use a buffer of approximately that size
es: cualquier otro valor positivo indica que hay que usar un búfer de aproximadamente dicho tamaño

source: negative bufsize (the default) means the system default of io.DEFAULT_BUFFER_SIZE will be used.
es: *bufsize* negativo (el valor por defecto) indica que se use el valor predeterminado del sistema, `io.DEFAULT_BUFFER_SIZE`.

source: The *executable* argument specifies a replacement program to execute. It is very seldom needed. When ``shell=False``, *executable* replaces the program to execute specified by *args*. However, the original *args* is still passed to the program. Most programs treat the program specified by *args* as the command name, which can then be different from the program actually executed. On POSIX, the *args* name becomes the display name for the executable in utilities such as :program:`ps`. If ``shell=True``, on POSIX the *executable* argument specifies a replacement shell for the default :file:`/bin/sh`.
es: El argumento *executable* especifica un programa de reemplazo que ejecutar. Esto es muy poco frecuente. Cuando ``shell=False``, *executable* reemplaza al programa especificado por *args*. Sin embargo, se pasan los *args* originales al programa. La mayoría de los programas tratan el programa especificado en los *args* como el nombre del programa, que puede ser diferente del programa realmente ejecutado. En POSIX, el nombre en *args* funciona como nombre visible en utilidades como :program:`ps`. Si ``shell=True``, en POSIX el argumento *executable* especifica una shell de reemplazo de la predeterminada :file:`/bin/sh`.

source: *executable* parameter accepts a :term:`path-like object` on POSIX.
es: El parámetro *executable* acepta un :term:`objeto tipo ruta <path-like object>` en POSIX.

source: *executable* parameter accepts a bytes and :term:`path-like object` on Windows.
es: El parámetro *executable* acepta bytes y un :term:`objeto tipo ruta <path-like object>` en POSIX.

source: If *preexec_fn* is set to a callable object, this object will be called in the child process just before the child is executed. (POSIX only)
es: Si se establece *preexec_fn* a un objeto invocable, se llamará a dicho objeto en el proceso hijo justo antes de que se ejecute el hijo. (solamente POSIX)

source: The *preexec_fn* parameter is NOT SAFE to use in the presence of threads in your application. The child process could deadlock before exec is called.
es: El parámetro *preexec_fn* NO ES SEGURO para usar en presencia de hilos en su aplicación. El subproceso podría bloquearse antes de que se llame a exec.

source: If you need to modify the environment for the child use the *env* parameter rather than doing it in a *preexec_fn*. The *start_new_session* and *process_group* parameters should take the place of code using *preexec_fn* to call :func:`os.setsid` or :func:`os.setpgid` in the child.
es: Si necesita modificar el entorno para el subproceso, use el parámetro *env* en lugar de hacerlo en un *preexec_fn*. Los parámetros *start_new_session* y *process_group* deben ocupar el lugar del código que usa *preexec_fn* para llamar a :func:`os.setsid` o :func:`os.setpgid` en el subproceso

source: The *preexec_fn* parameter is no longer supported in subinterpreters. The use of the parameter in a subinterpreter raises :exc:`RuntimeError`. The new restriction may affect applications that are deployed in mod_wsgi, uWSGI, and other embedded environments.
es: Se ha abandonado el soporte de *preexec_fn* en subintérpretes. El uso de dicho parámetro en un subintérprete lanza :exc:`RuntimeError`. La nueva restricción puede afectar a aplicaciones desplegadas en *mod_wsgi*, *uWSGI* y otros entornos incrustados.

source: On Windows, if *close_fds* is true then no handles will be inherited by the child process unless explicitly passed in the ``handle_list`` element of :attr:`STARTUPINFO.lpAttributeList`, or by standard handle redirection.
es: En Windows, si *close_fds* es verdadero el proceso hijo no heredará ningún gestor de fichero salvo que se le pasen explícitamente en el elemento ``handle_list`` de :attr:`STARTUPINFO.lpAttributeList`, o mediante redirección estándar.

source: The default for *close_fds* was changed from :const:`False` to what is described above.
es: El valor predeterminado de *close_fds* se cambió de :const:`False` a lo antes descrito.

source: On Windows the default for *close_fds* was changed from :const:`False` to :const:`True` when redirecting the standard handles. It's now possible to set *close_fds* to :const:`True` when redirecting the standard handles.
es: En Windows, el valor predeterminado de *close_fds* se cambió de :const:`False` a :const:`True` al redirigir los gestores estándar. Ahora es posible establecer *close_fds* a :const:`True` cuando se redirigen los gestores estándar.

source: *pass_fds* is an optional sequence of file descriptors to keep open between the parent and child. Providing any *pass_fds* forces *close_fds* to be :const:`True`. (POSIX only)
es: *pass_fds* es una secuencia de descriptor de ficheros opcional que han de mantenerse abiertos entre el proceso padre e hijo. Si se proporciona un valor a *pass_fds* se fuerza *close_fds* a :const:`True`. (solamente POSIX)

source: The *pass_fds* parameter was added.
es: Se añadió el parámetro *pass_fds*.

source: If *cwd* is not ``None``, the function changes the working directory to *cwd* before executing the child. *cwd* can be a string, bytes or :term:`path-like <path-like object>` object. On POSIX, the function looks for *executable* (or for the first item in *args*) relative to *cwd* if the executable path is a relative path.
es: Si *cwd* no es ``None``, la función cambia el directorio de trabajo a *cwd* antes de ejecutar el proceso hijo. *cwd* puede ser una cadena, o un objeto bytes o :term:`tipo ruta <path-like object>`. En POSIX, la función busca *executable* (o el primer elemento de *args*) relativo a *cwd* si la ruta del ejecutable es relativa.

source: *cwd* parameter accepts a :term:`path-like object` on POSIX.
es: El parámetro *cwd* acepta un :term:`objeto tipo ruta <path-like object>` en POSIX.

source: *cwd* parameter accepts a :term:`path-like object` on Windows.
es: El parámetro *cwd* acepta un :term:`objeto tipo ruta <path-like object>` en Windows.

source: *cwd* parameter accepts a bytes object on Windows.
es: El parámetro *cwd* acepta un objeto bytes en Windows.

source: If *restore_signals* is true (the default) all signals that Python has set to SIG_IGN are restored to SIG_DFL in the child process before the exec. Currently this includes the SIGPIPE, SIGXFZ and SIGXFSZ signals. (POSIX only)
es: Si *restore_signals* es verdadero (el valor por defecto) todas las señales que Python ha establecido a SIG_IGN se restauran a SIG_DFL en el proceso hijo antes del *exec*. En la actualidad, esto incluye las señales SIGPIPE, SIGXFZ y SIGXFSZ (solamente POSIX).

source: *restore_signals* was added.
es: Se añadió *restore_signals*.

source: If *start_new_session* is true the ``setsid()`` system call will be made in the child process prior to the execution of the subprocess.
es: Si *start_new_session* es verdadero, la llamada al sistema ``setsid()`` se realizará en el proceso secundario antes de la ejecución del subproceso.

source: :ref:`Availability <availability>`: POSIX
es: :ref:`Disponibilidad <availability>`: POSIX

source: *start_new_session* was added.
es: Se añadió *start_new_session*.

source: If *process_group* is a non-negative integer, the ``setpgid(0, value)`` system call will be made in the child process prior to the execution of the subprocess.
es: Si *process_group* es un entero no negativo, la llamada al sistema ``setpgid(0, value)`` se realizará en el proceso secundario antes de la ejecución del subproceso.

source: *process_group* was added.
es: Se agregó *process_group*.

source: If *group* is not ``None``, the setregid() system call will be made in the child process prior to the execution of the subprocess. If the provided value is a string, it will be looked up via :func:`grp.getgrnam()` and the value in ``gr_gid`` will be used. If the value is an integer, it will be passed verbatim. (POSIX only)
es: Si *group* no es ``None``, la llamada a sistema setregid() se hará en el proceso hijo antes de la ejecución del subproceso. Si el valor proveído es una cadena de caracteres, será buscado usando :func:`grp.getgrnam()` y el valor en ``gr_gid`` será usado. Si el valor es un entero, será pasado literalmente. (solamente POSIX)

source: If *extra_groups* is not ``None``, the setgroups() system call will be made in the child process prior to the execution of the subprocess. Strings provided in *extra_groups* will be looked up via :func:`grp.getgrnam()` and the values in ``gr_gid`` will be used. Integer values will be passed verbatim. (POSIX only)
es: Si *extra_groups* no es ``None``, la llamada a sistema setgroups() se hará en el proceso hijo antes de la ejecución del subproceso. Cadenas de caracteres proveídas en *extra_groups* serán buscadas usando :func:`grp.getgrnam()` y los valores en ``gr_gid`` serán usados. Valor enteros serán pasados literalmente. (solamente POSIX)

source: If *user* is not ``None``, the setreuid() system call will be made in the child process prior to the execution of the subprocess. If the provided value is a string, it will be looked up via :func:`pwd.getpwnam()` and the value in ``pw_uid`` will be used. If the value is an integer, it will be passed verbatim. (POSIX only)
es: Si *user* no es ``None``, la llamada a sistema setreuid() se hará en el proceso hijo antes de la ejecución del subproceso. Si el valor proveído es una cadena de caracteres, será buscado usando :func:`pwd.getpwnam()` y el valor en ``pw_uid`` será usado. Si el valor es un entero, será pasado literalmente. (solamente POSIX)

source: If *umask* is not negative, the umask() system call will be made in the child process prior to the execution of the subprocess.
es: Si *umask* no es negativo, la llamada a sistema umask() se hará en el proceso hijo antes de la ejecución del subproceso.

source: If specified, *env* must provide any variables required for the program to execute. On Windows, in order to run a `side-by-side assembly`_ the specified *env* **must** include a valid :envvar:`SystemRoot`.
es: Si se especifica, *env* debe proporcionar las variables necesarias para que el programa se ejecute. En Windows, para ejecutar una `side-by-side assembly`_ el *env* especificado **debe** incluir un :envvar:`SystemRoot` válido.

source: If *encoding* or *errors* are specified, or *text* is true, the file objects *stdin*, *stdout* and *stderr* are opened in text mode with the specified *encoding* and *errors*, as described above in :ref:`frequently-used-arguments`. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
es: Si se especifican *encoding* o *errors*, o *text* es verdadero, los objetos de archivo *stdin*, *stdout* y *stderr* se abren en modo de texto con los *encoding* y *errors* especificados, como se describe anteriormente en :ref:`frequently-used-arguments`. El argumento *universal_newlines* es equivalente a *text* y se proporciona para compatibilidad con versiones anteriores. De forma predeterminada, los objetos de archivo se abren en modo binario.

source: *encoding* and *errors* were added.
es: Se añadieron *encoding* y *errors*.

source: *text* was added as a more readable alias for *universal_newlines*.
es: Se añadió *text* como alias más legible de *universal_newlines*.

source: If given, *startupinfo* will be a :class:`STARTUPINFO` object, which is passed to the underlying ``CreateProcess`` function. *creationflags*, if given, can be one or more of the following flags:
es: Si se proporciona, *startupinfo* será un objeto :class:`STARTUPINFO`, que se pasa a la función de más bajo nivel ``CreateProcess``. *creationflags*, si está presente, puede ser uno o más de los siguientes indicadores:

source: *pipesize* can be used to change the size of the pipe when :data:`PIPE` is used for *stdin*, *stdout* or *stderr*. The size of the pipe is only changed on platforms that support this (only Linux at this time of writing). Other platforms will ignore this parameter.
es: *pipeize* se puede usar para cambiar el tamaño de la tubería cuando :data:`PIPE` se usa para *stdin*, *stdout* o *stderr*. El tamaño de la tubería solo se cambia en plataformas que lo admiten (solo Linux en este momento de redacción). Otras plataformas ignorarán este parámetro.

source: The ``pipesize`` parameter was added.
es: Se añadió el parámetro ``pipesize``.

source: Popen objects are supported as context managers via the :keyword:`with` statement: on exit, standard file descriptors are closed, and the process is waited for. ::
es: Se puede usar los objetos Popen como gestores de contexto mediante sentencia :keyword:`with`: a la salida, los descriptores de flujo se cierran y se espera a que acabe el proceso. ::

source: Raises an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, ``env``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``subprocess.Popen`` con argumentos ``executable``, ``args``, ``cwd``, ``env``.

source: Popen and the other functions in this module that use it raise an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, and ``env``. The value for ``args`` may be a single string or a list of strings, depending on platform.
es: Popen y el resto de las funciones de este módulo que la usan lanzan un :ref:`evento de auditoría <auditing>` ``subprocess.Popen`` con argumentos ``executable``, ``args``, ``cwd`` y ``env``. El valor de ``args`` puede ser una cadena simple o un alista de cadenas, dependiendo de la plataforma.

source: Added context manager support.
es: Se añadió la funcionalidad de gestor de contexto.

source: Popen destructor now emits a :exc:`ResourceWarning` warning if the child process is still running.
es: El destructor de Popen ahora emite una advertencia :exc:`ResourceWarning` si el proceso hijo todavía se está ejecutando.

source: Popen can use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, Popen constructor using :func:`os.posix_spawn` no longer raise an exception on errors like missing program, but the child process fails with a non-zero :attr:`~Popen.returncode`.
es: Popen puede usar :func:`os.posix_spawn` en algunos casos para obtener mejor rendimiento. En el Subsistema de Windows para Linux (WSL) y en la emulación del modo usuario de QEMU, el constructor de Popen que use :func:`os.posix_spawn` ya no lanzará una excepción cuando se den errores tales como que un programa no esté, sino que el proceso hijo fracasará con un :attr:`~Popen.returncode` distinto de cero.

source: Exceptions
es: Excepciones

source: Exceptions raised in the child process, before the new program has started to execute, will be re-raised in the parent.
es: Las excepciones lanzadas en el proceso hijo, antes de que el nuevo programa haya empezado a ejecutarse, se relanzarán en el padre.

source: The most common exception raised is :exc:`OSError`. This occurs, for example, when trying to execute a non-existent file. Applications should prepare for :exc:`OSError` exceptions. Note that, when ``shell=True``, :exc:`OSError` will be raised by the child only if the selected shell itself was not found. To determine if the shell failed to find the requested application, it is necessary to check the return code or output from the subprocess.
es: La excepción más común que se lanza es :exc:`OSError`. Esto ocurre, por ejemplo, al intentar ejecutar un archivo inexistente. Las aplicaciones deben prepararse para excepciones :exc:`OSError`. Tenga en cuenta que, cuando ``shell = True``, :exc:`OSError` será lanzado por el hijo solo si no se encontró el shell seleccionado. Para determinar si el shell no pudo encontrar la aplicación solicitada, es necesario verificar el código de retorno o la salida del subproceso.

source: A :exc:`ValueError` will be raised if :class:`Popen` is called with invalid arguments.
es: Se lanzará un :exc:`ValueError` si se llama a :class:`Popen` con argumentos no válidos.

source: :func:`check_call` and :func:`check_output` will raise :exc:`CalledProcessError` if the called process returns a non-zero return code.
es: :func:`check_call` y :func:`check_output` lanzarán un :exc:`CalledProcessError` si el proceso invocado retorna un código de retorno distinto de cero.

source: Exceptions defined in this module all inherit from :exc:`SubprocessError`.
es: Todas las excepciones definidas en este módulo heredan de :exc:`SubprocessError`.

source: The :exc:`SubprocessError` base class was added.
es: Se añadió la clase base :exc:`SubprocessError`.

source: Security Considerations
es: Consideraciones sobre seguridad

source: Unlike some other popen functions, this implementation will never implicitly call a system shell. This means that all characters, including shell metacharacters, can safely be passed to child processes. If the shell is invoked explicitly, via ``shell=True``, it is the application's responsibility to ensure that all whitespace and metacharacters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. On :ref:`some platforms <shlex-quote-warning>`, it is possible to use :func:`shlex.quote` for this escaping.
es: Al contrario que otras funciones popen, esta implementación nunca llamará implícitamente a la shell del sistema. Esto significa que todos los caracteres, incluidos los metacaracteres de la shell, se pueden pasar de manera segura a los procesos hijos. Si se invoca la shell explícitamente, mediante ``shell=True``, es responsabilidad de la aplicación asegurar que todo el espaciado y metacaracteres se entrecomillan adecuadamente para evitar vulnerabilidades de `inyección de código <https://es.wikipedia.org/wiki/Inyecci%C3%B3n_de_c%C3%B3digo>`_. En :ref:`algunas plataformas <shlex-quote-warning>`, es posible usar :func:`shlex.quote` para este escape.

source: Popen Objects
es: Objetos Popen

source: Instances of the :class:`Popen` class have the following methods:
es: Las instancias de la clase :class:`Popen` cuentan con los siguientes métodos:

source: Check if child process has terminated. Set and return :attr:`~Popen.returncode` attribute. Otherwise, returns ``None``.
es: Comprueba si el proceso hijo ha finalizado. Establece y retorna el atributo :attr:`~Popen.returncode`. De lo contrario, retorna ``None``.

source: Wait for child process to terminate. Set and return :attr:`~Popen.returncode` attribute.
es: Espera a que termine el proceso hijo. Establece y retorna el atributo :attr:`~Popen.returncode`.

source: If the process does not terminate after *timeout* seconds, raise a :exc:`TimeoutExpired` exception. It is safe to catch this exception and retry the wait.
es: Si el proceso no finaliza tras *timeout* segundos, lanza una excepción :exc:`TimeoutExpired`. Se puede capturar esta excepción para reintentar la espera.
