Repository: python/python-docs-es
Catalog: library/sunau.po
Languages: es_ar

source: :mod:`sunau` --- Read and write Sun AU files
es_ar: :mod:`sunau` --- Lectura y escritura de ficheros Sun AU

source: **Source code:** :source:`Lib/sunau.py`
es_ar: **Código fuente:** :source:`Lib/sunau.py`

source: The :mod:`sunau` module provides a convenient interface to the Sun AU sound format. Note that this module is interface-compatible with the modules :mod:`aifc` and :mod:`wave`.
es_ar: El módulo :mod:`sunau` provee una interfaz conveniente para el formato de sonido Sun AU. Note que este módulo es de interfaz compatible con los módulos :mod:`aifc` y :mod:`wave`.

source: An audio file consists of a header followed by the data. The fields of the header are:
es_ar: Un fichero de audio consiste de un encabezado seguido por la información. Los campos del encabezado son:

source: Field
es_ar: Campo

source: Contents
es_ar: Contenido

source: magic word
es_ar: palabra mágica

source: The four bytes ``.snd``.
es_ar: Los cuatro bytes ``.snd``.

source: header size
es_ar: tamaño del encabezado

source: Size of the header, including info, in bytes.
es_ar: Tamaño del encabezado, incluyendo información, en bytes.

source: data size
es_ar: tamaño de la información

source: Physical size of the data, in bytes.
es_ar: Tamaño físico de la información, en bytes.

source: encoding
es_ar: codificación

source: Indicates how the audio samples are encoded.
es_ar: Indica cómo las muestras de audio están codificadas.

source: sample rate
es_ar: tasa de muestra

source: The sampling rate.
es_ar: La tasa de muestreo.

source: # of channels
es_ar: # de canales

source: The number of channels in the samples.
es_ar: El número de canales en las muestras.

source: info
es_ar: información

source: ASCII string giving a description of the audio file (padded with null bytes).
es_ar: Cadena de caracteres ASCII dando una descripción del fichero de audio (rellenada con bytes nulos).

source: Apart from the info field, all header fields are 4 bytes in size. They are all 32-bit unsigned integers encoded in big-endian byte order.
es_ar: Aparte del campo de información, todos los campos de encabezado tienen 4 bytes de tamaño. Todos ellos son enteros sin signo codificados en orden de bytes *big-endian*.

source: The :mod:`sunau` module defines the following functions:
es_ar: El módulo :mod:`sunau` define las siguientes funciones:

source: If *file* is a string, open the file by that name, otherwise treat it as a seekable file-like object. *mode* can be any of
es_ar: Si *file* es una cadena, abre el fichero por ese nombre, de otra forma lo trata como un objeto similar a un fichero buscable. *mode* puede ser cualquiera de

source: Read only mode.
es_ar: Modo de sólo lectura.

source: Write only mode.
es_ar: Modo de sólo escritura.

source: Note that it does not allow read/write files.
es_ar: Note que no acepta ficheros de lectura/escritura.

source: A *mode* of ``'r'`` returns an :class:`AU_read` object, while a *mode* of ``'w'`` or ``'wb'`` returns an :class:`AU_write` object.
es_ar: Un *mode* de ``'r'`` retorna un objeto :class:`AU_read`, mientras un *mode* de ``'w'`` o ``'wb'`` retorna un objeto :class:`AU_write`.

source: A synonym for :func:`.open`, maintained for backwards compatibility.
es_ar: Un sinónimo para :func:`.open`, mantenido para compatibilidad con versiones anteriores.

source: The :mod:`sunau` module defines the following exception:
es_ar: El módulo :mod:`sunau` define la siguiente excepción:

source: An error raised when something is impossible because of Sun AU specs or implementation deficiency.
es_ar: Un error generado cuando algo es imposible por especificaciones de Sun AU o deficiencia de implementación.

source: The :mod:`sunau` module defines the following data items:
es_ar: El módulo :mod:`sunau` define los siguientes ítems de información:

source: An integer every valid Sun AU file begins with, stored in big-endian form. This is the string ``.snd`` interpreted as an integer.
es_ar: Un entero por cada fichero Sun AU válido comienza con, almacenada en la forma *big-endian*. Esto es la cadena ``.snd`` interpretada como un entero.

source: Values of the encoding field from the AU header which are supported by this module.
es_ar: Valores del campo de codificación para el encabezado AU que son soportados por este módulo.

source: Additional known values of the encoding field from the AU header, but which are not supported by this module.
es_ar: Valores adicionales conocidos por el campo de codificación del encabezado AU, pero que no son soportados por este módulo.

source: AU_read Objects
es_ar: Objetos AU_read

source: AU_read objects, as returned by :func:`.open` above, have the following methods:
es_ar: Objetos AU_read, como se retornan por :func:`.open` arriba, tienen los siguientes métodos:

source: Close the stream, and make the instance unusable. (This is called automatically on deletion.)
es_ar: Cierra el flujo, y hace que la instancia sea inutilizable. (Esto es llamado automáticamente en la eliminación.)

source: Returns number of audio channels (1 for mono, 2 for stereo).
es_ar: Retorna el número de canales de audio (1 para mono, 2 para estéreo).

source: Returns sample width in bytes.
es_ar: Retorna el ancho de muestra en bytes.

source: Returns sampling frequency.
es_ar: Retorna la frecuencia de muestreo.

source: Returns number of audio frames.
es_ar: Retorna el número de cuadros por segundo de audio.

source: Returns compression type. Supported compression types are ``'ULAW'``, ``'ALAW'`` and ``'NONE'``.
es_ar: Retorna el tipo de compresión. Los tipos de compresión soportados son ``'ULAW'``, ``'ALAW'`` y ``'NONE'``.

source: Human-readable version of :meth:`getcomptype`. The supported types have the respective names ``'CCITT G.711 u-law'``, ``'CCITT G.711 A-law'`` and ``'not compressed'``.
es_ar: Versión legible por humanos de :meth:`getcomptype`. Los tipos soportados tienen los nombres respectivos ``'CCITT G.711 u-law'``, ``'CCITT G.711 A-law'`` y ``'not compressed'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
es_ar: Retorna un :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalente a la salida de los métodos :meth:`get\*`.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object. The data will be returned in linear format. If the original data is in u-LAW format, it will be converted.
es_ar: Lee y retorna al menos *n* fotogramas de audio, como un objeto :class:`bytes`. La información será retornada en formato linear. Si la información original está en formato u-LAW, será convertida.

source: Rewind the file pointer to the beginning of the audio stream.
es_ar: Rebobina el puntero del fichero al comienzo del flujo de audio.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
es_ar: Los siguientes dos métodos definen un término "position" el cual es compatible entre ellos, y es de otra manera dependiente de la implementación.

source: Set the file pointer to the specified position. Only values returned from :meth:`tell` should be used for *pos*.
es_ar: Establece el puntero del fichero a la posición especificada. Sólo valores retornados desde :meth:`tell` deberían ser utilizados por *pos*.

source: Return current file pointer position. Note that the returned value has nothing to do with the actual position in the file.
es_ar: Retorna la posición actual del puntero de fichero. Note que el valor retornado no tiene nada que ver con la posición actual en el fichero.

source: The following two functions are defined for compatibility with the :mod:`aifc`, and don't do anything interesting.
es_ar: Las siguientes dos funciones están definidas por compatibilidad con el :mod:`aifc`, y no hace nada interesante.

source: Returns ``None``.
es_ar: Retorna ``None``.

source: Raise an error.
es_ar: Lanza un error.

source: AU_write Objects
es_ar: Objetos AU_write

source: AU_write objects, as returned by :func:`.open` above, have the following methods:
es_ar: Objetos AU_write, como se retornan por :func:`.open` arriba, tienen los siguientes métodos:

source: Set the number of channels.
es_ar: Establece el número de canales.

source: Set the sample width (in bytes.)
es_ar: Establece el ancho de muestra (en bytes.)

source: Added support for 24-bit samples.
es_ar: Agregado soporte para muestras de 24 bits.

source: Set the frame rate.
es_ar: Establece la velocidad de cuadros por segundo.

source: Set the number of frames. This can be later changed, when and if more frames are written.
es_ar: Establece el número de cuadros por segundo. Esto puede ser cambiado más adelante, cuando y si más cuadros por segundo son escritos.

source: Set the compression type and description. Only ``'NONE'`` and ``'ULAW'`` are supported on output.
es_ar: Establece el tipo de compresión y descripción. Sólo ``'NONE'`` y ``'ULAW'`` son soportados en salida.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the :meth:`set\*` methods. Set all parameters.
es_ar: La *tuple* debería ser ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, con valores válidos para los métodos :meth:`set\*`. Establece todos los parámetros.

source: Return current position in the file, with the same disclaimer for the :meth:`AU_read.tell` and :meth:`AU_read.setpos` methods.
es_ar: Retorna la posición actual en el fichero, con los mismos descargos de responsabilidad para los métodos :meth:`AU_read.tell` y :meth:`AU_read.setpos`.

source: Write audio frames, without correcting *nframes*.
es_ar: Escribe cuadros por segundo de audio, sin corregir *nframes*.

source: Any :term:`bytes-like object` is now accepted.
es_ar: Cualquier :term:`bytes-like object` es aceptado ahora.

source: Write audio frames and make sure *nframes* is correct.
es_ar: Escribe cuadros por segundo de audio y se asegura que *nframes* sea correcto.

source: Make sure *nframes* is correct, and close the file.
es_ar: Se asegura que *nframes* sea correcto, y cierra el fichero.

source: This method is called upon deletion.
es_ar: Este método es llamado después de la eliminación.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`.
es_ar: Note que es inválido establecer cualquier parámetro después de llamar :meth:`writeframes` o :meth:`writeframesraw`.
