Repository: python/python-docs-es
Catalog: library/sys_path_init.po
Languages: es

source: The initialization of the :data:`sys.path` module search path
es: La inicialización de la ruta de búsqueda de módulo de :data:`sys.path`

source: A module search path is initialized when Python starts. This module search path may be accessed at :data:`sys.path`.
es: Una ruta de búsqueda de módulo se inicializa cuando se inicia Python. Se puede acceder a esta ruta de búsqueda de módulo en :data:`sys.path`.

source: The first entry in the module search path is the directory that contains the input script, if there is one. Otherwise, the first entry is the current directory, which is the case when executing the interactive shell, a :option:`-c` command, or :option:`-m` module.
es: La primera entrada en la ruta de búsqueda de módulo es el directorio que contiene el script de entrada, si lo hay. De lo contrario, la primera entrada es el directorio actual, que es el caso cuando se ejecuta el shell interactivo, un comando :option:`-c` o un módulo :option:`-m`.

source: The :envvar:`PYTHONPATH` environment variable is often used to add directories to the search path. If this environment variable is found then the contents are added to the module search path.
es: La variable de entorno :envvar:`PYTHONPATH` se utiliza a menudo para añadir directorios a la ruta de búsqueda. Si se encuentra esta variable de entorno, su contenido se añade a la ruta de búsqueda del módulo.

source: :envvar:`PYTHONPATH` will affect all installed Python versions/environments. Be wary of setting this in your shell profile or global environment variables. The :mod:`site` module offers more nuanced techniques as mentioned below.
es: :envvar:`PYTHONPATH` afectará a todas las versiones/entornos de Python instalados. Tenga cuidado al establecer esto en su perfil de shell o en las variables de entorno globales. El módulo :mod:`site` ofrece técnicas más suavizadas como se menciona a continuación.

source: The next items added are the directories containing standard Python modules as well as any :term:`extension module`\s that these modules depend on. Extension modules are ``.pyd`` files on Windows and ``.so`` files on other platforms. The directory with the platform-independent Python modules is called ``prefix``. The directory with the extension modules is called ``exec_prefix``.
es: Los siguientes elementos que se añaden son los directorios que contienen los módulos estándar de Python, así como los :term:`extension module` de los que dependen estos módulos. Los módulos de extensión son archivos ``.pyd`` en Windows y archivos ``.so`` en otras plataformas. El directorio con los módulos Python independientes de la plataforma se llama ``prefix``. El directorio con los módulos de extensión se llama ``exec_prefix``.

source: The :envvar:`PYTHONHOME` environment variable may be used to set the ``prefix`` and ``exec_prefix`` locations. Otherwise these directories are found by using the Python executable as a starting point and then looking for various 'landmark' files and directories. Note that any symbolic links are followed so the real Python executable location is used as the search starting point. The Python executable location is called ``home``.
es: La variable de entorno :envvar:`PYTHONHOME` puede utilizarse para establecer las ubicaciones ``prefix`` y ``exec_prefix``. De lo contrario, estos directorios se encuentran utilizando el ejecutable de Python como punto de partida y luego buscando varios archivos y directorios "de referencia". Tenga en cuenta que cualquier enlace simbólico se sigue, por lo que la ubicación real del ejecutable de Python se utiliza como punto de partida de la búsqueda. La ubicación del ejecutable de Python se llama ``home``.

source: Once ``home`` is determined, the ``prefix`` directory is found by first looking for :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). On Windows the zip archive is searched for in ``home`` and on Unix the archive is expected to be in :file:`lib`. Note that the expected zip archive location is added to the module search path even if the archive does not exist. If no archive was found, Python on Windows will continue the search for ``prefix`` by looking for :file:`Lib\\os.py`. Python on Unix will look for :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). On Windows ``prefix`` and ``exec_prefix`` are the same, however on other platforms :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) is searched for and used as an anchor for ``exec_prefix``. On some platforms :file:`lib` may be :file:`lib64` or another value, see :data:`sys.platlibdir` and :envvar:`PYTHONPLATLIBDIR`.
es: Una vez determinado ``home``, el directorio ``prefix`` se encuentra buscando primero :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). En Windows el archivo zip se busca en ``home`` y en Unix se espera que el archivo esté en :file:`lib`. Tenga en cuenta que la ubicación esperada del archivo zip se añade a la ruta de búsqueda del módulo incluso si el archivo no existe. Si no se encuentra ningún archivo, Python en Windows continuará la búsqueda de ``prefix`` buscando en :file:`Lib\\os.py`. Python en Unix buscará :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). En Windows ``prefix`` y ``prefix_exec`` son los mismos, sin embargo en otras plataformas se busca :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) y se utiliza como ancla para ``prefix_exec``. En algunas plataformas :file:`lib` puede ser :file:`lib64` u otro valor, ver :data:`sys.platlibdir` y :envvar:`PYTHONPLATLIBDIR`.

source: Once found, ``prefix`` and ``exec_prefix`` are available at :data:`sys.prefix` and :data:`sys.exec_prefix` respectively.
es: Una vez encontrados, ``prefix`` y ``exec_prefix`` están disponibles en :data:`sys.prefix` y :data:`sys.exec_prefix` respectivamente.

source: Finally, the :mod:`site` module is processed and :file:`site-packages` directories are added to the module search path. A common way to customize the search path is to create :mod:`sitecustomize` or :mod:`usercustomize` modules as described in the :mod:`site` module documentation.
es: Finalmente, el módulo :mod:`site` se procesa y los directorios :file:`site-packages` se añaden a la ruta de búsqueda de módulo. Una forma común de personalizar la ruta de búsqueda es crear módulos :mod:`sitecustomize` o :mod:`usercustomize` como se describe en la documentación del módulo :mod:`site`.

source: Certain command line options may further affect path calculations. See :option:`-E`, :option:`-I`, :option:`-s` and :option:`-S` for further details.
es: Ciertas opciones de la línea de comandos pueden afectar aún más los cálculos de ruta. Vea :option:`-E`, :option:`-I`, :option:`-s` y :option:`-S` para más detalles.

source: Virtual environments
es: Entornos virtuales

source: If Python is run in a virtual environment (as described at :ref:`tut-venv`) then ``prefix`` and ``exec_prefix`` are specific to the virtual environment.
es: Si Python se ejecuta en un entorno virtual (como se describe en :ref:`tut-venv`) entonces ``prefix`` y ``exec_prefix`` son específicos del entorno virtual.

source: If a ``pyvenv.cfg`` file is found alongside the main executable, or in the directory one level above the executable, the following variations apply:
es: Si se encuentra un archivo ``pyvenv.cfg`` junto al ejecutable principal, o en el directorio un nivel por encima del ejecutable, se aplican las siguientes variaciones:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing ``prefix`` and ``exec_prefix``.
es: Si ``home`` es una ruta absoluta y :envvar:`PYTHONHOME` no está establecido, esta ruta se utiliza en lugar de la ruta al ejecutable principal cuando se deduce ``prefix`` y ``exec_prefix``.

source: _pth files
es: Archivos _pth

source: To completely override :data:`sys.path` create a ``._pth`` file with the same name as the shared library or executable (``python._pth`` or ``python311._pth``). The shared library path is always known on Windows, however it may not be available on other platforms. In the ``._pth`` file specify one line for each path to add to :data:`sys.path`. The file based on the shared library name overrides the one based on the executable, which allows paths to be restricted for any program loading the runtime if desired.
es: Para anular completamente :data:`sys.path` cree un archivo ``._pth`` con el mismo nombre que la biblioteca compartida o el ejecutable (``python._pth`` o ``python311._pth``). La ruta de la biblioteca compartida se conoce siempre en Windows, pero puede no estar disponible en otras plataformas. En el archivo ``._pth`` especifique una línea por cada ruta a añadir a :data:`sys.path``. El archivo basado en el nombre de la biblioteca compartida anula el basado en el ejecutable, lo que permite restringir las rutas para cualquier programa en tiempo de ejecución si se desea.

source: When the file exists, all registry and environment variables are ignored, isolated mode is enabled, and :mod:`site` is not imported unless one line in the file specifies ``import site``. Blank paths and lines starting with ``#`` are ignored. Each path may be absolute or relative to the location of the file. Import statements other than to ``site`` are not permitted, and arbitrary code cannot be specified.
es: Cuando el archivo existe, se ignoran todas las variables de registro y de entorno, se habilita el modo aislado y no se importa :mod:`site` a menos que una línea del archivo especifique ``import site``. Las rutas en blanco y las líneas que comienzan con ``#`` son ignoradas. Cada ruta puede ser absoluta o relativa a la ubicación del fichero. No se permiten declaraciones de importación distintas de ``site``, y no se puede especificar código arbitrario.

source: Note that ``.pth`` files (without leading underscore) will be processed normally by the :mod:`site` module when ``import site`` has been specified.
es: Tenga en cuenta que los archivos ``.pth`` (sin guión bajo inicial) serán procesados normalmente por el módulo :mod:`site` cuando se haya especificado ``import site``.

source: Embedded Python
es: Python embebido

source: If Python is embedded within another application :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure can be used to initialize Python. The path specific details are described at :ref:`init-path-config`. Alternatively the older :c:func:`Py_SetPath` can be used to bypass the initialization of the module search path.
es: Si Python está embebido dentro de otra aplicación :c:func:`Py_InitializeFromConfig` y la estructura :c:type:`PyConfig` pueden utilizarse para inicializar Python. Los detalles específicos de la ruta se describen en :ref:`init-path-config`. Alternativamente se puede utilizar la antigua :c:func:`Py_SetPath` para saltarse la inicialización de la ruta de búsqueda de módulo.

source: :ref:`windows_finding_modules` for detailed Windows notes.
es: :ref:`windows_finding_modules` para las notas detalladas de Windows.

source: :ref:`using-on-unix` for Unix details.
es: :ref:`using-on-unix` para los detalles de Unix.
