Repository: python/python-docs-es
Catalog: library/sysconfig.po
Languages: es

source: :mod:`sysconfig` --- Provide access to Python's configuration information
es: :mod:`sysconfig` --- Proporciona acceso a la información de configuración de Python

source: **Source code:** :source:`Lib/sysconfig.py`
es: **Código fuente:** :source:`Lib/sysconfig.py`

source: The :mod:`sysconfig` module provides access to Python's configuration information like the list of installation paths and the configuration variables relevant for the current platform.
es: El módulo :mod:`sysconfig` proporcionado acceso a la información de configuración de Python, como la lista de rutas de instalación y las variables de configuración relevantes para la plataforma actual.

source: Configuration variables
es: Variables de configuración

source: A Python distribution contains a :file:`Makefile` and a :file:`pyconfig.h` header file that are necessary to build both the Python binary itself and third-party C extensions compiled using :mod:`distutils`.
es: Una distribución de Python contiene un :file:`Makefile` y un archivo de cabecera :file:`pyconfig.h` que son necesarios para construir tanto el propio binario de Python como las extensiones C de terceros compiladas usando :mod:`distutils`.

source: :mod:`sysconfig` puts all variables found in these files in a dictionary that can be accessed using :func:`get_config_vars` or :func:`get_config_var`.
es: :mod:`sysconfig` coloca todas las variables que se encuentran en estos archivos un diccionario al que se puede acceder usando :func:`get_config_vars` o :func:`get_config_var`.

source: Notice that on Windows, it's a much smaller set.
es: Tenga en cuenta que en Windows, es un conjunto mucho más pequeño.

source: With no arguments, return a dictionary of all configuration variables relevant for the current platform.
es: Sin argumentos, retorna un diccionario de todas las variables de configuración relevantes para la plataforma actual.

source: With arguments, return a list of values that result from looking up each argument in the configuration variable dictionary.
es: Con argumentos, retorna un lista de valores que resultan de buscar cada argumento en el diccionario de variables de configuración.

source: For each argument, if the value is not found, return ``None``.
es: Por cada argumento, si no se encuentra el valor, retorna ``None``.

source: Return the value of a single variable *name*. Equivalent to ``get_config_vars().get(name)``.
es: Retorna el valor de un solo nombre de variable (*name*). Equivalente a ``get_config_vars().get(name)``.

source: If *name* is not found, return ``None``.
es: Si no se encuentra *name*, retorna ``None``.

source: Example of usage::
es: Ejemplos de uso::

source: Installation paths
es: Rutas de instalación

source: Python uses an installation scheme that differs depending on the platform and on the installation options. These schemes are stored in :mod:`sysconfig` under unique identifiers based on the value returned by :const:`os.name`.
es: Python usa un esquema de instalación que difiere según la plataforma y en las opciones de instalación. Estos esquemas son almacenados en :mod:`sysconfig` con identificadores únicos basados en el valor retornado por :const:`os.name`.

source: Every new component that is installed using :mod:`distutils` or a Distutils-based system will follow the same scheme to copy its file in the right places.
es: Cada nuevo componente que se instala usando :mod:`distutils` o un sistema basado en *Distutils* seguirá el mismo esquema para copiar su archivo en los lugares correctos.

source: Python currently supports nine schemes:
es: Python actualmente admite nueve esquemas:

source: *posix_prefix*: scheme for POSIX platforms like Linux or macOS. This is the default scheme used when Python or a component is installed.
es: *posix_prefix*: esquema para plataformas POSIX como Linux o macOS. Este es el esquema predeterminado que se usa cuando se instala Python o un componente.

source: *posix_home*: scheme for POSIX platforms used when a *home* option is used upon installation. This scheme is used when a component is installed through Distutils with a specific home prefix.
es: *posix_home*: esquema para plataformas POSIX usado cuando se usa una opción *home* en la instalación. Este esquema se usa cuando se instala un componente a través de *Disutils* con un prefijo de inicio específico.

source: *posix_user*: scheme for POSIX platforms used when a component is installed through Distutils and the *user* option is used. This scheme defines paths located under the user home directory.
es: *posix_user*: esquema para plataformas POSIX usado cuando se instala un componente a través de Distutils y se usa la opción *user*. Este esquema define rutas ubicadas bajo el directorio de inicio del usuario.

source: *posix_venv*: scheme for :mod:`Python virtual environments <venv>` on POSIX platforms; by default it is the same as *posix_prefix* .
es: *posix_venv*: esquema para :mod:`Entornos virtuales de Python <venv>` en plataformas POSIX; por defecto es el mismo que *posix_prefix* .

source: *nt*: scheme for NT platforms like Windows.
es: *nt*: esquema para plataformas NT como Windows.

source: *nt_user*: scheme for NT platforms, when the *user* option is used.
es: *nt_user*: esquema para plataformas NT, cuando se usa la opción *user*.

source: *nt_venv*: scheme for :mod:`Python virtual environments <venv>` on NT platforms; by default it is the same as *nt* .
es: *nt_venv*: esquema para :mod:`Entornos virtuales de Python <venv>` en plataformas NT; por defecto es el mismo que *nt* .

source: *venv*: a scheme with values from ether *posix_venv* or *nt_venv* depending on the platform Python runs on
es: *venv*: un esquema con valores como *posix_venv* o *nt_venv* dependiendo de la plataforma donde Python está funcionando

source: *osx_framework_user*: scheme for macOS, when the *user* option is used.
es: *nt_user*: esquema para macOS, cuando se usa la opción *user*.

source: Each scheme is itself composed of a series of paths and each path has a unique identifier. Python currently uses eight paths:
es: Cada esquema está compuesto por una serie de rutas y cada ruta tiene un identificador único. Python actualmente usa ocho rutas:

source: *stdlib*: directory containing the standard Python library files that are not platform-specific.
es: *stdlib*: directorio que contiene los archivos de la biblioteca estándar de Python que no son específicos de la plataforma.

source: *platstdlib*: directory containing the standard Python library files that are platform-specific.
es: *platstdlib*: directorio que contiene los archivos de la biblioteca estándar de Python que son específicos de la plataforma.

source: *platlib*: directory for site-specific, platform-specific files.
es: *platlib*: directorio para archivos específicos del sitio, específicos de la plataforma.

source: *purelib*: directory for site-specific, non-platform-specific files.
es: *purelib*: directorio para archivos específicos del sitio, no específicos de la plataforma.

source: *include*: directory for non-platform-specific header files for the Python C-API.
es: *include*: directorio para plataformas no especificadas para archivos de encabezado de Python C-API.

source: *platinclude*: directory for platform-specific header files for the Python C-API.
es: *include*: directorio para plataformas especificadas para archivos de encabezado de Python C-API.

source: *scripts*: directory for script files.
es: *scripts*: directorio para archivos de script.

source: *data*: directory for data files.
es: *data*: directorio para archivos de datos.

source: :mod:`sysconfig` provides some functions to determine these paths.
es: :mod:`sysconfig` proporciona algunas funciones para determinar estas rutas.

source: Return a tuple containing all schemes currently supported in :mod:`sysconfig`.
es: Retorna una tupla que contiene todos los esquemas admitidos actualmente en :mod:`sysconfig`.

source: Return the default scheme name for the current platform.
es: Retorna el nombre del esquema predeterminado para la plataforma actual.

source: This function was previously named ``_get_default_scheme()`` and considered an implementation detail.
es: Esta función se llamaba anteriormente ``_get_default_scheme()`` y se consideraba un detalle de implementación.

source: When Python runs from a virtual environment, the *venv* scheme is returned.
es: Cuando Python se ejecuta desde un entorno virtual, este retorna el esquema *venv*.

source: Return a preferred scheme name for an installation layout specified by *key*.
es: Retorna un nombre de esquema preferido para un diseño de instalación especificado por *key*.

source: *key* must be either ``"prefix"``, ``"home"``, or ``"user"``.
es: *key* debe ser ``"prefix"``, ``"home"`` o ``"user"``.

source: The return value is a scheme name listed in :func:`get_scheme_names`. It can be passed to :mod:`sysconfig` functions that take a *scheme* argument, such as :func:`get_paths`.
es: El valor de retorno es un nombre de esquema que aparece en :func:`get_scheme_names`. Se puede pasar a funciones :mod:`sysconfig` que toman un argumento *scheme*, como :func:`get_paths`.

source: When Python runs from a virtual environment and ``key="prefix"``, the *venv* scheme is returned.
es: Cuando Python se ejecuta desde un entorno virtual con ``key="prefix"``, este retorna el esquema *venv*.

source: Return a dict containing preferred scheme names on the current platform. Python implementers and redistributors may add their preferred schemes to the ``_INSTALL_SCHEMES`` module-level global value, and modify this function to return those scheme names, to e.g. provide different schemes for system and language package managers to use, so packages installed by either do not mix with those by the other.
es: Retorna un diccionario que contiene los nombres de los esquemas preferidos en la plataforma actual. Los implementadores y redistribuidores de Python pueden agregar sus esquemas preferidos al valor global de nivel de módulo ``_INSTALL_SCHEMES`` y modificar esta función para devolver esos nombres de esquema, p. Ej. proporcionan diferentes esquemas para que los utilicen los administradores de paquetes de idioma y sistema, de modo que los paquetes instalados por uno no se mezclen con los del otro.

source: End users should not use this function, but :func:`get_default_scheme` and :func:`get_preferred_scheme()` instead.
es: Los usuarios finales no deben utilizar esta función, sino :func:`get_default_scheme` y :func:`get_preferred_scheme()` en su lugar.

source: Return a tuple containing all path names currently supported in :mod:`sysconfig`.
es: Retorna una tupla que contiene todo los nombres de rutas admitidos actualmente en :mod:`sysconfig`.

source: Return an installation path corresponding to the path *name*, from the install scheme named *scheme*.
es: Retorna una ruta de instalación correspondiente a la ruta *name*, del esquema de instalación denominado *scheme*.

source: *name* has to be a value from the list returned by :func:`get_path_names`.
es: *name* tiene que ser un valor de la lista retornado por :func:`get_path_names`.

source: :mod:`sysconfig` stores installation paths corresponding to each path name, for each platform, with variables to be expanded. For instance the *stdlib* path for the *nt* scheme is: ``{base}/Lib``.
es: :mod:`sysconfig` almacena las rutas de instalación correspondientes a cada nombre de ruta, para cada plataforma, con variables que se expandirán. Por ejemplo, la ruta *stdlib* para el esquema *nt* es: ``{base}/Lib``.

source: :func:`get_path` will use the variables returned by :func:`get_config_vars` to expand the path. All variables have default values for each platform so one may call this function and get the default value.
es: :func:`get_path` utilizará las variables retornadas por :func:`get_config_vars` para expandir la ruta. Todas las variables tienen valores predeterminados para cada plataforma, por lo que se puede llamar a esta función y obtener el valor predeterminado.

source: If *scheme* is provided, it must be a value from the list returned by :func:`get_scheme_names`. Otherwise, the default scheme for the current platform is used.
es: Si se proporciona el esquema (*scheme*), debe ser un valor de la lista retornada por :func:`get_scheme_names`. De lo contrario, se utiliza el esquema predeterminado para la plataforma actual.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary return by :func:`get_config_vars`.
es: Si se proporciona *vars*, debe ser un diccionario de variables que actualizará el retorno del diccionario mediante :func:`get_config_vars`.

source: If *expand* is set to ``False``, the path will not be expanded using the variables.
es: Si *expand* se establece en ``False``, la ruta no se expandirá usando las variables.

source: If *name* is not found, raise a :exc:`KeyError`.
es: Si no se encuentra *name*, lanza un :exc:`KeyError`.

source: Return a dictionary containing all installation paths corresponding to an installation scheme. See :func:`get_path` for more information.
es: Retorna un diccionario de contiene todas las rutas de instalación correspondientes a un esquema de instalación. Consulte :func:`get_path` para obtener más información.

source: If *scheme* is not provided, will use the default scheme for the current platform.
es: Si no se proporciona el esquema (*scheme*), utilizará el esquema predeterminado para la plataforma actual.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary used to expand the paths.
es: Si se proporciona *vars*, debe ser un diccionario de variables que actualizará el diccionario utilizado para expandir las rutas.

source: If *expand* is set to false, the paths will not be expanded.
es: Si *expand* se establece en falso, las rutas no se expandirán.

source: If *scheme* is not an existing scheme, :func:`get_paths` will raise a :exc:`KeyError`.
es: Si *scheme* no es un esquema existente, :func:`get_paths` lanzará un :exc:`KeyError`.

source: Other functions
es: Otras funciones

source: Return the ``MAJOR.MINOR`` Python version number as a string. Similar to ``'%d.%d' % sys.version_info[:2]``.
es: Retorna el número de versión versión ``MAJOR.MINOR`` de Python como una cadena. Similar a ``'%d.%d' % sys.version_info[:2]``.

source: Return a string that identifies the current platform.
es: Retorna una cadena que identifica la plataforma actual.

source: This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by 'os.uname()'), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
es: Se utiliza principalmente para distinguir los directorios de compilación específicos de la plataforma y las distribuciones compiladas específicas de la plataforma. Por lo general se incluye el nombre y la versión del sistema operativo y la arquitectura (como lo proporciona 'os.uname()'), aunque la información exacta incluida depende del sistema operativo: por ejemplo, en Linux, la versión del kernel no es particularmente importante.

source: Examples of returned values:
es: Ejemplo de valores retornados:

source: Windows will return one of:
es: Windows retornará uno de:

source: win-amd64 (64bit Windows on AMD64, aka x86_64, Intel64, and EM64T)
es: win-amd64 (Windows de 64 bits en AMD64, también conocido como x86_64, Intel64 y EM64T)

source: win32 (all others - specifically, sys.platform is returned)
es: win32 (todos los demás - específicamente se retorna sys.platform)

source: macOS can return:
es: macOS puede retornar:

source: For other non-POSIX platforms, currently just returns :data:`sys.platform`.
es: Para otras plataformas que no son POSIX, actualmente solo retorna :data:`sys.platform`.

source: Return ``True`` if the running Python interpreter was built from source and is being run from its built location, and not from a location resulting from e.g. running ``make install`` or installing via a binary installer.
es: Retorna ``True`` si el intérprete de Python en ejecución se compiló a partir de la fuente y se está ejecutando desde su ubicación compilada, y no desde una ubicación resultante de por ejemplo ejecutando ``make install`` o instalando a través de un instalador binario.

source: Parse a :file:`config.h`\-style file.
es: Analiza un archivo de estilo :file:`config.h`.

source: *fp* is a file-like object pointing to the :file:`config.h`\-like file.
es: *fp* es un objeto similar a un archivo que apunta al archivo similar a :file:`config.h`.

source: A dictionary containing name/value pairs is returned. If an optional dictionary is passed in as the second argument, it is used instead of a new dictionary, and updated with the values read in the file.
es: Se retorna un diccionario que contiene pares de nombre/valor. Si se pasa un diccionario opcional como un segundo argumento, se utiliza en lugar de un nuevo diccionario y se actualiza con los valores leídos en el archivo.

source: Return the path of :file:`pyconfig.h`.
es: Retorna la ruta de :file:`pyconfig.h`.

source: Return the path of :file:`Makefile`.
es: Retorna la ruta de :file:`Makefile`.

source: Using :mod:`sysconfig` as a script
es: Usando :mod:`sysconfig` como un script

source: You can use :mod:`sysconfig` as a script with Python's *-m* option:
es: Puedes usar :mod:`sysconfig` como un script con la opción *-m* de Python:

source: This call will print in the standard output the information returned by :func:`get_platform`, :func:`get_python_version`, :func:`get_path` and :func:`get_config_vars`.
es: Esta llamada imprimirá en la salida estándar la información retornada por :func:`get_platform`, :func:`get_python_version`, :func:`get_path` y :func:`get_config_vars`.
