Repository: python/python-docs-es
Catalog: library/syslog.po
Languages: es

source: :mod:`syslog` --- Unix syslog library routines
es: :mod:`syslog` --- Rutinas de la biblioteca syslog de Unix

source: This module provides an interface to the Unix ``syslog`` library routines. Refer to the Unix manual pages for a detailed description of the ``syslog`` facility.
es: Este módulo ofrece una interfaz a las rutinas de la biblioteca ``syslog`` de Unix. Consulte las páginas del manual de Unix para una descripción detallada de la *facility* (es así como se llama en la documentación a un subsistema de aplicaciones) ``syslog``.

source: This module wraps the system ``syslog`` family of routines. A pure Python library that can speak to a syslog server is available in the :mod:`logging.handlers` module as :class:`SysLogHandler`.
es: Este módulo envuelve la familia de rutinas de ``syslog``. En el módulo :mod:`logging.handlers` está disponible :class:`SysLogHandler`, una biblioteca en Python puro que puede comunicarse con un servidor syslog.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este modulo no funciona o no está disponible para plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para más información.

source: The module defines the following functions:
es: El módulo define las siguientes funciones:

source: Send the string *message* to the system logger. A trailing newline is added if necessary. Each message is tagged with a priority composed of a *facility* and a *level*. The optional *priority* argument, which defaults to :const:`LOG_INFO`, determines the message priority. If the facility is not encoded in *priority* using logical-or (``LOG_INFO | LOG_USER``), the value given in the :func:`openlog` call is used.
es: Envía la cadena de caracteres *message* al registrador del sistema. Se añade un final de línea si es necesario. Cada mensaje se etiqueta con una prioridad compuesta por una *facility* y un *nivel*. El argumento opcional *priority*, que por defecto es :const:`LOG_INFO`, determina la prioridad del mensaje. Si la *facility* no está codificada en *priority* usando un OR lógico (``LOG_INFO | LOG_USER``), se usará el valor con el que se llama a :func:`openlog`.

source: If :func:`openlog` has not been called prior to the call to :func:`syslog`, :func:`openlog` will be called with no arguments.
es: Si :func:`openlog` no se ha llamado antes de la llamada a :func:`syslog`, entonces :func:`openlog` se llamará sin argumentos.

source: Raises an :ref:`auditing event <auditing>` ``syslog.syslog`` with arguments ``priority``, ``message``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``syslog.syslog`` con los argumentos ``priority``, ``message``.

source: In previous versions, :func:`openlog` would not be called automatically if it wasn't called prior to the call to :func:`syslog`, deferring to the syslog implementation to call ``openlog()``.
es: En versiones anteriores, :func:`openlog` no sería llamado automáticamente si no fuera un llamado previo de la llamada a la función :func:`syslog`, postergando la implementación de syslog para llamar a ``openlog()``.

source: This function is restricted in subinterpreters. (Only code that runs in multiple interpreters is affected and the restriction is not relevant for most users.) :func:`openlog` must be called in the main interpreter before :func:`syslog` may be used in a subinterpreter. Otherwise it will raise :exc:`RuntimeError`.
es: Esta función está restringida en subintérpretes. (Solo el código que se ejecuta en múltiples intérpretes se ve afectado y la restricción no es relevante para la mayoría de los usuarios.) :func:`openlog` debe ser llamada en el intérprete principal antes de que :func:`syslog` pueda ser utilizada en un subintérprete. De lo contrario, lanzará :exc:`RuntimeError`.

source: Logging options of subsequent :func:`syslog` calls can be set by calling :func:`openlog`. :func:`syslog` will call :func:`openlog` with no arguments if the log is not currently open.
es: Las opciones de registro de las llamadas a :func:`syslog` pueden establecerse llamando a la función :func:`openlog`. :func:`syslog` llamará a :func:`openlog` sin argumentos si el registro no está abierto actualmente.

source: The optional *ident* keyword argument is a string which is prepended to every message, and defaults to ``sys.argv[0]`` with leading path components stripped. The optional *logoption* keyword argument (default is 0) is a bit field -- see below for possible values to combine. The optional *facility* keyword argument (default is :const:`LOG_USER`) sets the default facility for messages which do not have a facility explicitly encoded.
es: El argumento por palabra clave opcional *ident* es una cadena de caracteres que precede a cada mensaje, y por defecto es ``sys.argv[0]`` retirando los componentes delanteros de la ruta. El argumento nombrado opcional *logoption* (por defecto es 0) es un campo de tipo bit -- véanse a continuación los posibles valores que pueden combinarse. El argumento nombrado opcional *facility* (por defecto es :const:`LOG_USER`) establece una *facility* por defecto para mensajes que no tienen una *facility* explícitamente codificada.

source: Raises an :ref:`auditing event <auditing>` ``syslog.openlog`` with arguments ``ident``, ``logoption``, ``facility``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``syslog.openlog`` con los argumentos ``ident``, ``logoption``, ``facility``.

source: In previous versions, keyword arguments were not allowed, and *ident* was required.
es: En versiones anteriores, argumentos por palabras llave no eran permitidos, y la *ident* era obligatoria.

source: This function is restricted in subinterpreters. (Only code that runs in multiple interpreters is affected and the restriction is not relevant for most users.) This may only be called in the main interpreter. It will raise :exc:`RuntimeError` if called in a subinterpreter.
es: Esta función está restringida en subintérpretes. (Solo el código que se ejecuta en múltiples intérpretes se ve afectado y la restricción no es relevante para la mayoría de los usuarios.) Esta solo puede ser llamada en el intérprete principal. Lanzará :exc:`RuntimeError` si se llama en un subintérprete.

source: Reset the syslog module values and call the system library ``closelog()``.
es: Reinicia los valores del módulo syslog y llama a la librería del sistema ``closelog()``.

source: This causes the module to behave as it does when initially imported. For example, :func:`openlog` will be called on the first :func:`syslog` call (if :func:`openlog` hasn't already been called), and *ident* and other :func:`openlog` parameters are reset to defaults.
es: Esto provoca que el módulo actúe como lo hacía cuando fue importado inicialmente. Por ejemplo, se llamará a :func:`openlog` en la primera llamada a :func:`syslog` (si no se ha llamado a :func:`openlog` ya), e *ident* y otros parámetros de :func:`openlog` se reiniciarán a sus valores por defecto.

source: Raises an :ref:`auditing event <auditing>` ``syslog.closelog`` with no arguments.
es: Lanza un :ref:`evento de auditoría <auditing>` ``syslog.closelog`` sin argumentos.

source: Set the priority mask to *maskpri* and return the previous mask value. Calls to :func:`syslog` with a priority level not set in *maskpri* are ignored. The default is to log all priorities. The function ``LOG_MASK(pri)`` calculates the mask for the individual priority *pri*. The function ``LOG_UPTO(pri)`` calculates the mask for all priorities up to and including *pri*.
es: Asigna la máscara de prioridad a *maskpri* y retorna el valor anterior de la máscara. Las llamadas a :func:`syslog` con un nivel de prioridad no asignado en *maskpri* se ignoran. El comportamiento por defecto es registrar todas las prioridades. La función ``LOG_MASK(pri)`` calcula la máscara para la prioridad individual *pri*. La función ``LOG_UPTO(pri)`` calcula la máscara para todas las prioridades mayores o iguales que *pri*.

source: Raises an :ref:`auditing event <auditing>` ``syslog.setlogmask`` with argument ``maskpri``.
es: Lanza un :ref:`evento de auditoría <auditing>` ``syslog.setlogmask`` con argumento ``maskpri``.

source: The module defines the following constants:
es: El módulo define las siguientes constantes:

source: Priority levels (high to low):
es: Niveles de prioridad (de más alto a más bajo):

source: :const:`LOG_KERN`, :const:`LOG_USER`, :const:`LOG_MAIL`, :const:`LOG_DAEMON`, :const:`LOG_AUTH`, :const:`LOG_LPR`, :const:`LOG_NEWS`, :const:`LOG_UUCP`, :const:`LOG_CRON`, :const:`LOG_SYSLOG`, :const:`LOG_LOCAL0` to :const:`LOG_LOCAL7`, and, if defined in ``<syslog.h>``, :const:`LOG_AUTHPRIV`.
es: :const:`LOG_KERN`, :const:`LOG_USER`, :const:`LOG_MAIL`, :const:`LOG_DAEMON`, :const:`LOG_AUTH`, :const:`LOG_LPR`, :const:`LOG_NEWS`, :const:`LOG_UUCP`, :const:`LOG_CRON`, :const:`LOG_SYSLOG`,de :const:`LOG_LOCAL0` a :const:`LOG_LOCAL7`, y, si está definida en ``<syslog.h>``, :const:`LOG_AUTHPRIV`.

source: Log options:
es: Opciones de registro:

source: :const:`LOG_PID`, :const:`LOG_CONS`, :const:`LOG_NDELAY`, and, if defined in ``<syslog.h>``, :const:`LOG_ODELAY`, :const:`LOG_NOWAIT`, and :const:`LOG_PERROR`.
es: :const:`LOG_PID`, :const:`LOG_CONS`, :const:`LOG_NDELAY`, y, si están definidas en ``<syslog.h>``, :const:`LOG_ODELAY`, :const:`LOG_NOWAIT`, y :const:`LOG_PERROR`.

source: Examples
es: Ejemplos

source: Simple example
es: Ejemplo sencillo

source: A simple set of examples::
es: Un conjunto sencillo de ejemplos::

source: An example of setting some log options, these would include the process ID in logged messages, and write the messages to the destination facility used for mail logging::
es: Un ejemplo de configuración de varias opciones de registro, que incluirán el identificador del proceso en los mensajes registrados, y escribirán los mensajes a la facility de destino usada para el registro de correo::
