Repository: python/python-docs-es
Catalog: library/tarfile.po
Languages: es

source: Extract all members from the archive to the current working directory or directory *path*. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`. Directory information like owner, modification time and permissions are set after all members have been extracted. This is done to work around two problems: A directory's modification time is reset each time a file is created in it. And, if a directory's permissions do not allow writing, extracting files to it will fail.
es: Extrae todos los miembros de un archivo al directorio de trabajo actual o al directorio de *path*. Si se proporciona el parámetro opcional *members*, debe ser un subconjunto de la lista retornada por el método :meth:`getmembers`. Información de directorio como dueño, fecha de modificación y permisos son establecidos una vez que todos los miembros han sido extraídos. Esto se realiza para trabajar con dos problemáticas: La fecha de modificación de un directorio es modificada cada vez que un archivo es creado en el. Y si los permisos de un directorio no permiten escritura, extraer archivos en el no será posible.

source: If *numeric_owner* is :const:`True`, the uid and gid numbers from the tarfile are used to set the owner/group for the extracted files. Otherwise, the named values from the tarfile are used.
es: Si *numeric_owner* tiene el valor de :const:`True`, los números uid y gid del archivo tar se utilizan para establecer el dueño/grupo de los archivos extraídos. De lo contrario, se utilizan los valores nombrados del archivo tar.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of *path*, e.g. members that have absolute filenames starting with ``"/"`` or filenames with two dots ``".."``.
es: Nunca extraigas archivos de fuentes no confiables sin una inspección previa. Es posible que los archivos se creen fuera de *path*, Ej. miembros que tienen nombres de archivo absolutos que comienzan con ``"/"`` o nombres de archivo con dos puntos ``".."``.

source: Added the *numeric_owner* parameter.
es: Se agregó el parámetro *numeric_owner*.

source: The *path* parameter accepts a :term:`path-like object`.
es: El parámetro *path* acepta a :term:`path-like object`.

source: Extract a member from the archive to the current working directory, using its full name. Its file information is extracted as accurately as possible. *member* may be a filename or a :class:`TarInfo` object. You can specify a different directory using *path*. *path* may be a :term:`path-like object`. File attributes (owner, mtime, mode) are set unless *set_attrs* is false.
es: Extrae un miembro del archivo al directorio de trabajo actual utilizando su nombre completo. La información de su archivo se extrae con la mayor precisión posible. *member* puede ser un nombre de archivo o un objeto :class:`TarInfo`. Puedes especificar un directorio diferente utilizando *path*. *path* puede ser un :term:`path-like object`. Los atributos de archivo (dueño, fecha de modificación, modo) son establecidos a no ser que *set_attrs* sea falso.

source: The :meth:`extract` method does not take care of several extraction issues. In most cases you should consider using the :meth:`extractall` method.
es: El método :meth:`extract` no cuida de varios problemas de extracción. En la mayoría de los casos deberías considerar utilizar el método :meth:`extractall`.

source: See the warning for :meth:`extractall`.
es: Consulta la advertencia para :meth:`extractall`.

source: Added the *set_attrs* parameter.
es: Se agregó el parámetro *set_attrs*.

source: Return an :class:`io.BufferedReader` object.
es: Retorna un objeto :class:`io.BufferedReader`.

source: Add the file *name* to the archive. *name* may be any type of file (directory, fifo, symbolic link, etc.). If given, *arcname* specifies an alternative name for the file in the archive. Directories are added recursively by default. This can be avoided by setting *recursive* to :const:`False`. Recursion adds entries in sorted order. If *filter* is given, it should be a function that takes a :class:`TarInfo` object argument and returns the changed :class:`TarInfo` object. If it instead returns :const:`None` the :class:`TarInfo` object will be excluded from the archive. See :ref:`tar-examples` for an example.
es: Añade el archivo *name* al archivo. *name* puede ser cualquier tipo de archivo (directorio, fifo, enlace simbólico, etc.). Si se proporciona, *arcname* especifica un nombre alternativo para el archivo en el archivo. Los directorios se agregan de forma recursiva de forma predeterminada. Esto se puede evitar estableciendo *recursive* con el valor de :const:`False`. La recursividad agrega entradas en orden ordenado. Si se proporciona *filter*, debería ser una función que tome un argumento de objeto :class:`TarInfo` y retorna el objeto :class:`TarInfo` modificado. Si en cambio retorna :const:`None`, el objeto :class:`TarInfo` será excluido del archivo. Consulta :ref:`tar-examples` para ver un ejemplo.

source: Added the *filter* parameter.
es: Se agregó el parámetro *filter*.

source: Recursion adds entries in sorted order.
es: La recursividad agrega entradas en orden ordenado.

source: Add the :class:`TarInfo` object *tarinfo* to the archive. If *fileobj* is given, it should be a :term:`binary file`, and ``tarinfo.size`` bytes are read from it and added to the archive. You can create :class:`TarInfo` objects directly, or by using :meth:`gettarinfo`.
es: Añade el objeto :class:`TarInfo` *tarinfo* al archivo. Si se proporciona *fileobj*, debería ser un :term:`binary file`, y los bytes de ``tarinfo.size`` se leen y se agregan al archivo. Puedes crear objetos :class:`TarInfo` directamente o usando :meth:`gettarinfo`.

source: Create a :class:`TarInfo` object from the result of :func:`os.stat` or equivalent on an existing file. The file is either named by *name*, or specified as a :term:`file object` *fileobj* with a file descriptor. *name* may be a :term:`path-like object`. If given, *arcname* specifies an alternative name for the file in the archive, otherwise, the name is taken from *fileobj*’s :attr:`~io.FileIO.name` attribute, or the *name* argument. The name should be a text string.
es: Crea un objeto :class:`TarInfo` a partir del resultado de :func:`os.stat` o equivalente en un archivo existente. El archivo es nombrado por *name* o especificado como un objeto :term:`file object` *fileobj* con un descriptor de archivo. *name* puede ser un objeto :term:`path-like object`. Si es proporcionado, *arcname* especifica un nombre alternativo para el archivo en el archivo, de otra forma, el nombre es tomado del atributo *fileobj*’s :attr:`~io.FileIO.name`, o el argumento *name*. El nombre puede ser una cadena de texto.

source: You can modify some of the :class:`TarInfo`’s attributes before you add it using :meth:`addfile`. If the file object is not an ordinary file object positioned at the beginning of the file, attributes such as :attr:`~TarInfo.size` may need modifying. This is the case for objects such as :class:`~gzip.GzipFile`. The :attr:`~TarInfo.name` may also be modified, in which case *arcname* could be a dummy string.
es: Puedes modificar algunos de los atributos de la clase :class:`TarInfo`’ antes de que lo añadas utilizado el método :meth:`addfile`. Si el archivo objeto no es un archivo objeto ordinario posicionado al principio del archivo, atributos como :attr:`~TarInfo.size` puede que necesiten modificaciones. Este es el caso para objetos como :class:`~gzip.GzipFile`. El atributo :attr:`~TarInfo.name` también puede ser modificado, en cuyo caso *arcname* podría ser una cadena ficticia.

source: Close the :class:`TarFile`. In write mode, two finishing zero blocks are appended to the archive.
es: Cierra :class:`TarFile`. En el modo de escritura, se añaden dos bloques de cero de finalización al archivo.

source: A dictionary containing key-value pairs of pax global headers.
es: Un diccionario que contiene pares de *pax global headers* en key-value.

source: TarInfo Objects
es: Objetos TarInfo

source: A :class:`TarInfo` object represents one member in a :class:`TarFile`. Aside from storing all required attributes of a file (like file type, size, time, permissions, owner etc.), it provides some useful methods to determine its type. It does *not* contain the file's data itself.
es: Un objeto :class:`TarInfo` representa un miembro en :class:`TarFile`. Además de almacenar todos los atributos requeridos de un archivo (como tipo de archivo, tamaño, fecha, permisos, dueño, etc.), provee de algunos métodos útiles para determinar su tipo. No contiene los datos del archivo por si mismo.

source: :class:`TarInfo` objects are returned by :class:`TarFile`'s methods :meth:`getmember`, :meth:`getmembers` and :meth:`gettarinfo`.
es: Los objetos :class:`TarInfo` son retornados por métodos :class:`TarFile`' :meth:`getmember`, :meth:`getmembers` y :meth:`gettarinfo`.

source: Create a :class:`TarInfo` object.
es: Crea un objeto :class:`TarInfo`.

source: Create and return a :class:`TarInfo` object from string buffer *buf*.
es: Crea y retorna un objeto :class:`TarInfo`.

source: Raises :exc:`HeaderError` if the buffer is invalid.
es: Lanza una excepción :exc:`HeaderError` si el buffer es invalido.

source: Read the next member from the :class:`TarFile` object *tarfile* and return it as a :class:`TarInfo` object.
es: Lee el siguiente miembro del objeto de la clase :class:`TarFile` *tarfile* y lo retorna como un objeto :class:`TarInfo`.

source: Create a string buffer from a :class:`TarInfo` object. For information on the arguments see the constructor of the :class:`TarFile` class.
es: Crear un *buffer* de cadena a partir de un objeto :class:`TarInfo`. Para información sobre los argumentos consulta el constructor de la clase :class:`TarFile`.

source: A ``TarInfo`` object has the following public data attributes:
es: Un objeto ``TarInfo`` tiene los siguientes atributos de dato públicos:

source: Name of the archive member.
es: Nombre del archivo miembro.

source: Size in bytes.
es: Tamaño en bytes.

source: Time of last modification.
es: Hora de la última modificación.

source: Permission bits.
es: Bits de permiso.

source: File type. *type* is usually one of these constants: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. To determine the type of a :class:`TarInfo` object more conveniently, use the ``is*()`` methods below.
es: Tipo de archivo. *type* es por lo general una de las siguientes constantes: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. Para determinar el tipo de un objeto :class:`TarInfo` de forma más conveniente, utiliza los métodos ``is*()`` de abajo.

source: Name of the target file name, which is only present in :class:`TarInfo` objects of type :const:`LNKTYPE` and :const:`SYMTYPE`.
es: Nombre del archivo objetivo, el cual solo está presente en los objetos :class:`TarInfo` de tipo :const:`LNKTYPE` y del tipo :const:`SYMTYPE`.

source: User ID of the user who originally stored this member.
es: ID de usuario que originalmente almacenó este miembro.

source: Group ID of the user who originally stored this member.
es: ID de grupo del usuario que originalmente almacenó este miembro.

source: User name.
es: Nombre de usuario.

source: Group name.
es: Nombre del grupo.

source: A dictionary containing key-value pairs of an associated pax extended header.
es: Un diccionario que contiene pares *key-value* de un encabezado *pax extended*.

source: A :class:`TarInfo` object also provides some convenient query methods:
es: Un objeto :class:`TarInfo` también provee de algunos métodos de consulta convenientes:

source: Return :const:`True` if the :class:`Tarinfo` object is a regular file.
es: Retorna :const:`True` si el objeto :class:`Tarinfo` es un archivo regular.

source: Same as :meth:`isfile`.
es: Igual que :meth:`isfile`.

source: Return :const:`True` if it is a directory.
es: Retorna :const:`True` si es un directorio.

source: Return :const:`True` if it is a symbolic link.
es: Retorna :const:`True` si es un enlace simbólico.

source: Return :const:`True` if it is a hard link.
es: Retorna :const:`True` si es un enlace duro.

source: Return :const:`True` if it is a character device.
es: Retorna :const:`True` si es un dispositivo de caracter.

source: Return :const:`True` if it is a block device.
es: Retorna :const:`True` si es un dispositivo de bloque.

source: Return :const:`True` if it is a FIFO.
es: Retorna :const:`True` si es un FIFO.

source: Return :const:`True` if it is one of character device, block device or FIFO.
es: Retorna :const:`True` si es uno de los caracteres de dispositivo, dispositivo de bloque o FIFO.

source: Command-Line Interface
es: Interfaz de línea de comandos

source: The :mod:`tarfile` module provides a simple command-line interface to interact with tar archives.
es: El módulo :mod:`tarfile` provee una interfaz de línea de comandos sencilla para interactuar con archivos tar.

source: If you want to create a new tar archive, specify its name after the :option:`-c` option and then list the filename(s) that should be included:
es: Si quieres crear un nuevo archivo tar, especifica su nombre después de la opción :option:`-c` y después lista el nombre de archivo(s) que deberían ser incluidos:

source: Passing a directory is also acceptable:
es: Proporcionar un directorio también es aceptable:

source: If you want to extract a tar archive into the current directory, use the :option:`-e` option:
es: Si deseas extraer un archivo tar en el directorio actual, utiliza la opción :option:`-e`:

source: You can also extract a tar archive into a different directory by passing the directory's name:
es: También puedes extraer un archivo tar en un directorio diferente pasando el nombre del directorio como parámetro:

source: For a list of the files in a tar archive, use the :option:`-l` option:
es: Para obtener una lista de archivos dentro de un archivo tar, utiliza la opción :option:`-l`:

source: Command-line options
es: Opciones de línea de comandos

source: List files in a tarfile.
es: Listar archivos en un tar.

source: Create tarfile from source files.
es: Crear archivo tar desde archivos fuente.

source: Extract tarfile into the current directory if *output_dir* is not specified.
es: Extrae el archivo tar en el directorio actual si *output_dir* no es especificado.

source: Test whether the tarfile is valid or not.
es: Probar si el archivo tar es valido o no.

source: Verbose output.
es: Output *verbose*.

source: Examples
es: Ejemplos

source: How to extract an entire tar archive to the current working directory::
es: Cómo extraer un archivo tar entero al directorio de trabajo actual::

source: How to extract a subset of a tar archive with :meth:`TarFile.extractall` using a generator function instead of a list::
es: Cómo extraer un subconjunto de un archivo tar con :meth:`TarFile.extractall` utilizando una función generadora en lugar de una lista::

source: How to create an uncompressed tar archive from a list of filenames::
es: Cómo crear un archivo tar sin comprimir desde una lista de nombres de archivo::

source: The same example using the :keyword:`with` statement::
es: El mismo ejemplo utilizando la declaración :keyword:`with`::

source: How to read a gzip compressed tar archive and display some member information::
es: Cómo leer un archivo tar comprimido con gzip y desplegar un poco de información del miembro::

source: How to create an archive and reset the user information using the *filter* parameter in :meth:`TarFile.add`::
es: Cómo crear un archivo y reiniciar la información del usuario usando el parámetro *filter* en :meth:`TarFile.add`::

source: Supported tar formats
es: Formatos tar con soporte

source: There are three tar formats that can be created with the :mod:`tarfile` module:
es: Hay tres formatos tar que puede ser creados con el módulo :mod:`tarfile`:

source: The POSIX.1-1988 ustar format (:const:`USTAR_FORMAT`). It supports filenames up to a length of at best 256 characters and linknames up to 100 characters. The maximum file size is 8 GiB. This is an old and limited but widely supported format.
es: El formato (:const:`USTAR_FORMAT`) POSIX.1-1988 ustar. Admite nombres de archivos de hasta una longitud de 256 caracteres y nombres de enlace de hasta 100 caracteres. El tamaño máximo de archivo es de 8 GiB. Este es un formato viejo y limitado pero con amplio soporte.

source: The GNU tar format (:const:`GNU_FORMAT`). It supports long filenames and linknames, files bigger than 8 GiB and sparse files. It is the de facto standard on GNU/Linux systems. :mod:`tarfile` fully supports the GNU tar extensions for long names, sparse file support is read-only.
es: El formato GNU tar (:const:`GNU_FORMAT`). Admite nombres de archivo largos y nombres de enlace, archivos más grandes que 8 GiB de tamaño y archivos dispersos. Es el estándar *de facto* en sistemas GNU/Linux. :mod:`tarfile` admite de forma completa las extensiones de GNU tar para nombres largos, el soporte para archivos dispersos es de solo lectura.

source: The POSIX.1-2001 pax format (:const:`PAX_FORMAT`). It is the most flexible format with virtually no limits. It supports long filenames and linknames, large files and stores pathnames in a portable way. Modern tar implementations, including GNU tar, bsdtar/libarchive and star, fully support extended *pax* features; some old or unmaintained libraries may not, but should treat *pax* archives as if they were in the universally-supported *ustar* format. It is the current default format for new archives.
es: El formato pax POSIX.1-2001 (:const:`PAX_FORMAT`). Es el formato más flexible prácticamente sin límites. Admite nombres de archivo largos y nombres de enlaces, archivos grandes y almacena nombres de ruta de forma portátil. Las implementaciones modernas de tar, incluyendo GNU tar, *bsdtar/libarchive* y star, son totalmente compatibles con las características extendidas *pax*; Es posible que algunas bibliotecas antiguas o no mantenidas no lo hagan, pero deberían tratar los archivos *pax* como si estuvieran en el formato *ustar* compatible universalmente. Es el formato predeterminado actual para archivos nuevos.

source: It extends the existing *ustar* format with extra headers for information that cannot be stored otherwise. There are two flavours of pax headers: Extended headers only affect the subsequent file header, global headers are valid for the complete archive and affect all following files. All the data in a pax header is encoded in *UTF-8* for portability reasons.
es: Extiende el formato existente *ustar* con cabeceras adicionales para información que no puede ser almacenada de otra manera. Hay dos variaciones de encabezados pax: Los encabezados extendidos solo afectan al encabezado del archivo posterior, las encabezados globales son validos para el archivo entero y afectan todos los siguientes archivos. Todos los datos en un encabezado pax son codificados en *UTF-8* por razones de portabilidad.

source: There are some more variants of the tar format which can be read, but not created:
es: Existen más variantes del formato tar que puede ser leídas, pero no creadas:

source: The ancient V7 format. This is the first tar format from Unix Seventh Edition, storing only regular files and directories. Names must not be longer than 100 characters, there is no user/group name information. Some archives have miscalculated header checksums in case of fields with non-ASCII characters.
es: El antiguo formato V7. Este es el primer formato tar de *Unix Seventh Edition*, almacena solo archivos y directorios normales. Los nombres no deben tener más de 100 caracteres, no hay información de nombre de usuario/grupo disponible. Algunos archivos tienen sumas de comprobación de encabezado mal calculadas en el caso de campos con caracteres que no son ASCII.

source: The SunOS tar extended format. This format is a variant of the POSIX.1-2001 pax format, but is not compatible.
es: El formato extendido tar de SunOS. Este formato es una variante del formato POSIX.1-2001 pax, pero no es compatible.

source: Unicode issues
es: Problemas Unicode

source: The tar format was originally conceived to make backups on tape drives with the main focus on preserving file system information. Nowadays tar archives are commonly used for file distribution and exchanging archives over networks. One problem of the original format (which is the basis of all other formats) is that there is no concept of supporting different character encodings. For example, an ordinary tar archive created on a *UTF-8* system cannot be read correctly on a *Latin-1* system if it contains non-*ASCII* characters. Textual metadata (like filenames, linknames, user/group names) will appear damaged. Unfortunately, there is no way to autodetect the encoding of an archive. The pax format was designed to solve this problem. It stores non-ASCII metadata using the universal character encoding *UTF-8*.
es: El formato tar fue originalmente concebido para realizar respaldos en unidades de cinta con el objetivo principal de preservar la información del sistema de archivos. Hoy en día los archivos tar son comúnmente utilizados para distribución de archivos e intercambio de archivos sobre redes. Un problema del formato original (el cual es la base de todos los demás formatos) es que no hay concepto de soporte para diferentes codificaciones de caracteres. Por ejemplo, un archivo tar ordinario creado en un sistema *UTF-8* no puede ser leído correctamente en un sistema *Latin-1* si este contiene caracteres de tipo no ASCII. Los meta-datos textuales (como nombres de archivos, nombres de enlace, nombres de usuario/grupo) aparecerán dañados. Desafortunadamente, no hay manera de detectar de forma automática la codificación de un archivo. El formato *pax* fue diseñado para resolver este problema. Almacena los metadatos no ASCII usando una codificación de caracteres universal *UTF-8*.

source: The details of character conversion in :mod:`tarfile` are controlled by the *encoding* and *errors* keyword arguments of the :class:`TarFile` class.
es: Los detalles de la conversión de caracteres en el módulo :mod:`tarfile` son controlados por los argumentos de palabra clave *encoding* y *errors* de la clase :class:`TarFile`.

source: *encoding* defines the character encoding to use for the metadata in the archive. The default value is :func:`sys.getfilesystemencoding` or ``'ascii'`` as a fallback. Depending on whether the archive is read or written, the metadata must be either decoded or encoded. If *encoding* is not set appropriately, this conversion may fail.
es: *encoding* define la codificación de caracteres a utilizar para los metadatos del archivo. El valor predeterminado es :func:`sys.getfilesystemencoding` o ``'ascii'`` como una alternativa. Dependiendo de si el archivo se lee o escribe, los metadatos deben decodificarse o codificarse. Si el *encoding* no se configura correctamente, esta conversión puede fallar.
