Repository: python/python-docs-es
Catalog: library/tarfile.po
Languages: es

source: :mod:`tarfile` --- Read and write tar archive files
es: :mod:`tarfile` --- Leer y escribir archivos tar

source: **Source code:** :source:`Lib/tarfile.py`
es: **Código fuente:** :source:`Lib/tarfile.py`

source: The :mod:`tarfile` module makes it possible to read and write tar archives, including those using gzip, bz2 and lzma compression. Use the :mod:`zipfile` module to read or write :file:`.zip` files, or the higher-level functions in :ref:`shutil <archiving-operations>`.
es: El módulo :mod:`tarfile` hace posible escribir y leer archivos tar, incluyendo aquellos que hacen uso de compresión gzip, bz2 y lzma. Utiliza el módulo :mod:`zipfile` para leer o escribir archivos :file:`.zip`, o las funciones de nivel superior en :ref:`shutil <archiving-operations>`.

source: Some facts and figures:
es: Algunos hechos y cifras:

source: reads and writes :mod:`gzip`, :mod:`bz2` and :mod:`lzma` compressed archives if the respective modules are available.
es: lee y escribe archivos comprimidos :mod:`gzip`, :mod:`bz2` y :mod:`lzma` si los respectivos módulos están disponibles.

source: read/write support for the POSIX.1-1988 (ustar) format.
es: soporte de lectura/escritura para el formato POSIX.1-1988 (ustar).

source: read/write support for the GNU tar format including *longname* and *longlink* extensions, read-only support for all variants of the *sparse* extension including restoration of sparse files.
es: soporte de lectura/escritira para el formato GNU tar incluyendo extensiones *longname* y *longlink*, soporte de solo escritura para todas las variantes de extensiones de *sparse* (archivo disperso) incluyendo restablecimiento de archivos dispersos.

source: read/write support for the POSIX.1-2001 (pax) format.
es: soporte de lectura/escritura para el formato POSIX.1-2001 (pax).

source: handles directories, regular files, hardlinks, symbolic links, fifos, character devices and block devices and is able to acquire and restore file information like timestamp, access permissions and owner.
es: gestiona directorios, archivos regulares, enlaces duros, enlaces simbólicos, fifos, dispositivos de carácter, dispositivos de bloque y puede adquirir y restaurar información de archivo como marca de tiempo, permisos de acceso y dueño.

source: Added support for :mod:`lzma` compression.
es: Añadido soporte para compresión :mod:`lzma`.

source: Return a :class:`TarFile` object for the pathname *name*. For detailed information on :class:`TarFile` objects and the keyword arguments that are allowed, see :ref:`tarfile-objects`.
es: Retorna un objeto :class:`TarFile` para el nombre de ruta *name*. Para información detallada en los objetos de la clase :class:`TarFile` y los argumentos por palabra clave que están permitidos, dirígete a :ref:`tarfile-objects`.

source: *mode* has to be a string of the form ``'filemode[:compression]'``, it defaults to ``'r'``. Here is a full list of mode combinations:
es: *mode* tiene que ser una cadena de texto en el formato ``'filemode[:compression]'``, adquiere el valor de ``'r'`` de forma predeterminada. Aquí hay una lista completa de combinaciones de modo:

source: mode
es: modo

source: action
es: acción

source: ``'r' or 'r:*'``
es: ``'r' o 'r:*'``

source: Open for reading with transparent compression (recommended).
es: Abrir para leer con compresión transparente (recomendado).

source: Open for reading exclusively without compression.
es: Abrir para leer exclusivamente sin compresión.

source: Open for reading with gzip compression.
es: Abrir para leer con compresión gzip.

source: Open for reading with bzip2 compression.
es: Abrir para leer con compresión bzip2.

source: Open for reading with lzma compression.
es: Abrir para leer con compresión lzma.

source: ``'x'`` or ``'x:'``
es: ``'x'`` o ``'x:'``

source: Create a tarfile exclusively without compression. Raise an :exc:`FileExistsError` exception if it already exists.
es: Crear un archivo *tarfile* exclusivamente sin compresión. Lanza una excepción :exc:`FileExistsError` si el archivo ya existe.

source: Create a tarfile with gzip compression. Raise an :exc:`FileExistsError` exception if it already exists.
es: Crear un archivo tar con compresión gzip. Lanza una excepción :exc:`FileExistsError` si ya existe.

source: Create a tarfile with bzip2 compression. Raise an :exc:`FileExistsError` exception if it already exists.
es: Crear un archivo tar con compresión bzip2. Lanza una excepción :exc:`FileExistsError` si ya existe.

source: Create a tarfile with lzma compression. Raise an :exc:`FileExistsError` exception if it already exists.
es: Crear un archivo tar con compresión lzma. Lanza una excepción :exc:`FileExistsError` si ya existe.

source: Open for appending with no compression. The file is created if it does not exist.
es: Abrir para anexar sin compresión. El archivo se crea si no existe.

source: ``'w' or 'w:'``
es: ``'w' o 'w:'``

source: Open for uncompressed writing.
es: Abrir para escritura con compresión lzma.

source: Open for gzip compressed writing.
es: Abrir para escritura con compresión gzip.

source: Open for bzip2 compressed writing.
es: Abrir para escritura con compresión bzip2.

source: Open for lzma compressed writing.
es: Abrir para escritura con compresión lzma.

source: Note that ``'a:gz'``, ``'a:bz2'`` or ``'a:xz'`` is not possible. If *mode* is not suitable to open a certain (compressed) file for reading, :exc:`ReadError` is raised. Use *mode* ``'r'`` to avoid this. If a compression method is not supported, :exc:`CompressionError` is raised.
es: Ten en cuenta que ``'a:gz'``, ``'a:bz2'`` or ``'a:xz'`` no son posibles. Si *mode* no es apropiado para abrir ciertos archivos (comprimidos) para lectura, se lanza una excepción de tipo :exc:`ReadError`. Usa el *modo* ``'r'`` para evitar esto. Si el método de compresión no es admitido, se lanza una excepción :exc:`CompressionError`.

source: If *fileobj* is specified, it is used as an alternative to a :term:`file object` opened in binary mode for *name*. It is supposed to be at position 0.
es: Si *fileobj* es especificado, se utiliza como alternativa a :term:`file object` abierto en modo binario para *name*. Debe estar en la posición 0.

source: For modes ``'w:gz'``, ``'r:gz'``, ``'w:bz2'``, ``'r:bz2'``, ``'x:gz'``, ``'x:bz2'``, :func:`tarfile.open` accepts the keyword argument *compresslevel* (default ``9``) to specify the compression level of the file.
es: Para los modos ``'w:gz'``, ``'r:gz'``, ``'w:bz2'``, ``'r:bz2'``, ``'x:gz'``, ``'x:bz2'``, :func:`tarfile.open` acepta el argumento por palabra clave *compresslevel* (por defecto ``9``) para especificar el nivel de compresión del archivo.

source: For special purposes, there is a second format for *mode*: ``'filemode|[compression]'``. :func:`tarfile.open` will return a :class:`TarFile` object that processes its data as a stream of blocks. No random seeking will be done on the file. If given, *fileobj* may be any object that has a :meth:`read` or :meth:`write` method (depending on the *mode*). *bufsize* specifies the blocksize and defaults to ``20 * 512`` bytes. Use this variant in combination with e.g. ``sys.stdin``, a socket :term:`file object` or a tape device. However, such a :class:`TarFile` object is limited in that it does not allow random access, see :ref:`tar-examples`. The currently possible modes:
es: Para propósitos especiales, hay un segundo formato para *modo*: ``'filemode|[compression]'``. :func:`tarfile.open` retornará un objeto :class:`TarFile` que procesa sus datos como un *stream* de bloques. No se realizará una búsqueda aleatoria en el archivo. Si se proporciona, *fileobj* puede ser un objeto con los métodos :meth:`read` o :meth:`write` (dependiendo del *modo*). *bufsize* especifica el *blocksize* y por default tiene un valor de ``20 * 512`` bytes. Utiliza esta variante en combinación con por ejemplo ``sys.stdin``, un socket :term:`file object` o un *tape device*. Sin embargo, dicho objeto :class:`TarFile` está limitado en el aspecto de que no permite acceso aleatorio. Consulta :ref:`tar-examples`. Los modos posibles:

source: Mode
es: Modo

source: Action
es: Acción

source: Open a *stream* of tar blocks for reading with transparent compression.
es: Abre un *stream* de bloques tar para leer con compresión transparente.

source: Open a *stream* of uncompressed tar blocks for reading.
es: Abre un *stream* de bloques tar sin comprimir para lectura.

source: Open a gzip compressed *stream* for reading.
es: Abre un *stream* comprimido con gzip para lectura.

source: Open a bzip2 compressed *stream* for reading.
es: Abre un *stream* bzip2 comprimido para lectura.

source: Open an lzma compressed *stream* for reading.
es: Abre un *stream* lzma comprimido para lectura.

source: Open an uncompressed *stream* for writing.
es: Abre un *stream* sin comprimir para escritura.

source: Open a gzip compressed *stream* for writing.
es: Abre un *stream* gzip comprimido para escritura.

source: Open a bzip2 compressed *stream* for writing.
es: Abre un *stream* bzip2 comprimido para escritura.

source: Open an lzma compressed *stream* for writing.
es: Abre un *stream* lzma comprimido para escritura.

source: The ``'x'`` (exclusive creation) mode was added.
es: El modo ``'x'`` (creación exclusiva) fue añadido.

source: The *name* parameter accepts a :term:`path-like object`.
es: El parámetro *name* acepta un objeto :term:`path-like object`.

source: Class for reading and writing tar archives. Do not use this class directly: use :func:`tarfile.open` instead. See :ref:`tarfile-objects`.
es: Clase para leer y escribir archivos tar. No utilices esta clase directamente; usa :func:`tarfile.open` en su lugar. Consulta :ref:`tarfile-objects`.

source: Return :const:`True` if *name* is a tar archive file, that the :mod:`tarfile` module can read.
es: Retorna :const:`True` si *name* es un archivo tar, que el módulo :mod:`tarfile` puede leer.

source: The :mod:`tarfile` module defines the following exceptions:
es: El módulo :mod:`tarfile` define las siguientes excepciones:

source: Base class for all :mod:`tarfile` exceptions.
es: Clase base para todas las excepciones del módulo :mod:`tarfile`.

source: Is raised when a tar archive is opened, that either cannot be handled by the :mod:`tarfile` module or is somehow invalid.
es: Se lanza cuando un archivo tar se abre, que no puede ser manejado por el módulo :mod:`tarfile` o de alguna manera no es válido.

source: Is raised when a compression method is not supported or when the data cannot be decoded properly.
es: Se lanza cuando un método de compresión no tiene soporte o cuando la información no puede ser decodificada de manera apropiada.

source: Is raised for the limitations that are typical for stream-like :class:`TarFile` objects.
es: Se lanza para limitaciones que son comunes para objetos *stream-like* :class:`TarFile`.

source: Is raised for *non-fatal* errors when using :meth:`TarFile.extract`, but only if :attr:`TarFile.errorlevel`\ ``== 2``.
es: Se lanza para errores no fatales cuando se utiliza :meth:`TarFile.extract`, pero solo si :attr:`TarFile.errorlevel`\ ``== 2``.

source: Is raised by :meth:`TarInfo.frombuf` if the buffer it gets is invalid.
es: Se lanza por :meth:`TarInfo.frombuf` si el buffer que obtiene es invalido.

source: The following constants are available at the module level:
es: Las siguientes constantes están disponibles a nivel de módulo:

source: The default character encoding: ``'utf-8'`` on Windows, the value returned by :func:`sys.getfilesystemencoding` otherwise.
es: La codificación para caracteres predeterminada: ``'utf-8'`` en Windows, de otra manera, el valor retornado por :func:`sys.getfilesystemencoding`.

source: Each of the following constants defines a tar archive format that the :mod:`tarfile` module is able to create. See section :ref:`tar-formats` for details.
es: Cada una de las siguientes constantes define un formato de archivo tar que el módulo :mod:`tarfile` puede crear. Ve la sección: :ref:`tar-formats` para más detalles.

source: POSIX.1-1988 (ustar) format.
es: Formato POSIX.1-1988 (ustar).

source: GNU tar format.
es: Formato GNU tar.

source: POSIX.1-2001 (pax) format.
es: Formato POSIX.1-2001 (pax).

source: The default format for creating archives. This is currently :const:`PAX_FORMAT`.
es: El formato predeterminado para crear archivos. Es actualmente :const:`PAX_FORMAT`.

source: The default format for new archives was changed to :const:`PAX_FORMAT` from :const:`GNU_FORMAT`.
es: El formato predeterminado para nuevos archivos fue cambiado de :const:`GNU_FORMAT` a :const:`PAX_FORMAT`

source: Module :mod:`zipfile`
es: Módulo :mod:`zipfile`

source: Documentation of the :mod:`zipfile` standard module.
es: Documentación del módulo estándar :mod:`zipfile`.

source: Documentation of the higher-level archiving facilities provided by the standard :mod:`shutil` module.
es: Documentación para las facilidades de archivos de más alto nivel proporcionadas por el módulo estándar :mod:`shutil`.

source: `GNU tar manual, Basic Tar Format <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_
es: `Manual GNU tar, formato básico tar <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_

source: Documentation for tar archive files, including GNU tar extensions.
es: Documentación para archivos de tipo tar, incluyendo extensiones GNU tar.

source: TarFile Objects
es: Objetos *TarFile*

source: The :class:`TarFile` object provides an interface to a tar archive. A tar archive is a sequence of blocks. An archive member (a stored file) is made up of a header block followed by data blocks. It is possible to store a file in a tar archive several times. Each archive member is represented by a :class:`TarInfo` object, see :ref:`tarinfo-objects` for details.
es: El objeto :class:`TarFile` provee una interfaz a un archivo tar. Un archivo tar es una secuencia de bloques. Un miembro de archivos (un archivo almacenado) está hecho de un bloque de encabezado seguido de bloques de datos. Es posible almacenar un archivo dentro de un tar múltiples veces. Cada archivo miembro está representado por un objeto :class:`TarInfo`, consulta :ref:`tarinfo-objects` para más detalles.

source: A :class:`TarFile` object can be used as a context manager in a :keyword:`with` statement. It will automatically be closed when the block is completed. Please note that in the event of an exception an archive opened for writing will not be finalized; only the internally used file object will be closed. See the :ref:`tar-examples` section for a use case.
es: Un objeto :class:`TarFile` puede ser usado como un administrador de contexto en una declaración :keyword:`with`. Será automáticamente cerrado cuando el bloque sea completado. Ten en cuenta que en el evento de una excepción un archivo abierto para escritura no será terminado; solo el objeto de archivo interno será cerrado. Consulta la sección :ref:`tar-examples` para un caso de uso.

source: Added support for the context management protocol.
es: Añadido soporte para el protocolo de administración de contexto.

source: All following arguments are optional and can be accessed as instance attributes as well.
es: Los siguientes argumentos son opcionales y también se pueden acceder como atributos de instancia.

source: *name* is the pathname of the archive. *name* may be a :term:`path-like object`. It can be omitted if *fileobj* is given. In this case, the file object's :attr:`name` attribute is used if it exists.
es: *name* es el nombre de ruta del archivo. *name* puede ser un objeto :term:`path-like object`. Puede ser omitido si *fileobj* se proporciona. En este caso, el atributo :attr:`name` del objeto de archivo se usa si existe.

source: *mode* is either ``'r'`` to read from an existing archive, ``'a'`` to append data to an existing file, ``'w'`` to create a new file overwriting an existing one, or ``'x'`` to create a new file only if it does not already exist.
es: *mode* puede ser ``'r'`` para leer desde un archivo existente, ``'a'`` para adjuntar datos a un archivo existente,``'w'`` para crear un nuevo archivo sobrescribiendo uno existente, o ``'x'`` para crear un nuevo archivo únicamente si este no existe.

source: If *fileobj* is given, it is used for reading or writing data. If it can be determined, *mode* is overridden by *fileobj*'s mode. *fileobj* will be used from position 0.
es: Si *fileobj* es proporcionado, se utiliza para escritura o lectura de datos. Si puede ser determinado, *mode* puede ser anulado por el modo de *fileobj*. *fileobj* será usado desde la posición 0.

source: *fileobj* is not closed, when :class:`TarFile` is closed.
es: *fileobj* no se cierra cuando :class:`TarFile` se cierra.

source: *format* controls the archive format for writing. It must be one of the constants :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` or :const:`PAX_FORMAT` that are defined at module level. When reading, format will be automatically detected, even if different formats are present in a single archive.
es: *format* controla el formato de archivo para la escritura. Debe ser una de las constantes :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` o :const:`PAX_FORMAT` que se definen a nivel de módulo. Al leer, el formato se detectará automáticamente, incluso si hay diferentes formatos en un solo archivo.

source: The *tarinfo* argument can be used to replace the default :class:`TarInfo` class with a different one.
es: El argumento *tarinfo* puede ser utilizado para reemplazar la clase predeterminada :class:`TarInfo` con una diferente.

source: If *dereference* is :const:`False`, add symbolic and hard links to the archive. If it is :const:`True`, add the content of the target files to the archive. This has no effect on systems that do not support symbolic links.
es: Si *dereference* tiene el valor de :const:`False`, añade enlaces simbólicos y duros al archivo. Si tiene el valor de :const:`True`, añade el contenido de archivos objetivo al archivo. Esto no tiene ningún efecto en los sistemas que no admiten enlaces simbólicos.

source: If *ignore_zeros* is :const:`False`, treat an empty block as the end of the archive. If it is :const:`True`, skip empty (and invalid) blocks and try to get as many members as possible. This is only useful for reading concatenated or damaged archives.
es: Si *ignore_zeros* tiene el valor de :const:`False`, trata un bloque vacío como el final del archivo. Si es :const:`True`, omite los bloques vacíos (y no válidos) e intenta obtener tantos miembros como sea posible. Esto solo es útil para leer archivos concatenados o dañados.

source: *debug* can be set from ``0`` (no debug messages) up to ``3`` (all debug messages). The messages are written to ``sys.stderr``.
es: *debug* puede ser establecido con valores desde ``0`` (sin mensajes de depuración) hasta ``3`` (todos los mensajes de depuración). Los mensajes son escritos en ``sys.stderr``.

source: If *errorlevel* is ``0``, all errors are ignored when using :meth:`TarFile.extract`. Nevertheless, they appear as error messages in the debug output, when debugging is enabled. If ``1``, all *fatal* errors are raised as :exc:`OSError` exceptions. If ``2``, all *non-fatal* errors are raised as :exc:`TarError` exceptions as well.
es: Si *errorlevel* es ``0``, todos los errores son ignorados cuando se utiliza :meth:`TarFile.extract`. Sin embargo, aparecen como mensajes de error en la salida de depuración, cuando la depuración está habilitada. Si *errorlevel* es ``1``, todos los errores *fatal* son levantados como excepciones :exc:`OSError`. Si *errorlevel* es ``2``, todos los errores *non-fatal* son levantados como excepciones :exc:`TarError`.

source: The *encoding* and *errors* arguments define the character encoding to be used for reading or writing the archive and how conversion errors are going to be handled. The default settings will work for most users. See section :ref:`tar-unicode` for in-depth information.
es: Los argumentos *encoding* y *errors* definen la codificación de caracteres que se utilizará para lectura o escritura del archivo y como los errores de conversión van a ser manejados. La configuración predeterminada funcionará para la mayoría de los usuarios. Mira la sección :ref:`tar-unicode` para más información a detalle.

source: The *pax_headers* argument is an optional dictionary of strings which will be added as a pax global header if *format* is :const:`PAX_FORMAT`.
es: El argumento *pax_headers* es un diccionario opcional de cadenas las cuales serán añadidas como un encabezado pax global si el valor de *format* es :const:`PAX_FORMAT`.

source: Use ``'surrogateescape'`` as the default for the *errors* argument.
es: Utiliza ``'surrogateescape'`` como valor predeterminado del argumento *errors*.

source: Alternative constructor. The :func:`tarfile.open` function is actually a shortcut to this classmethod.
es: Constructor alternativo. La función :func:`tarfile.open` es un acceso directo a este método de la clase

source: Return a :class:`TarInfo` object for member *name*. If *name* can not be found in the archive, :exc:`KeyError` is raised.
es: Retorna un objeto :class:`TarInfo` para el miembro *name*. Si *name* no puede ser encontrado, entonces una excepción de tipo :exc:`KeyError` será lanzada.

source: If a member occurs more than once in the archive, its last occurrence is assumed to be the most up-to-date version.
es: Si un miembro aparece más de una vez en el archivo, se asume que su última aparición es la versión más actualizada.

source: Return the members of the archive as a list of :class:`TarInfo` objects. The list has the same order as the members in the archive.
es: Retorna los miembros del archivo como una lista de objetos :class:`TarInfo`. La lista tiene el mismo orden que los miembros del archivo.

source: Return the members as a list of their names. It has the same order as the list returned by :meth:`getmembers`.
es: Retorna los miembros como una lista de sus nombres. Tiene el mismo orden que la lista retornada por :meth:`getmembers`.

source: Print a table of contents to ``sys.stdout``. If *verbose* is :const:`False`, only the names of the members are printed. If it is :const:`True`, output similar to that of :program:`ls -l` is produced. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`.
es: Imprime en ``sys.stdout`` una tabla de contenidos. Si *verbose* es :const:`False`, solo los nombres de los miembros son impresos. si es :const:`True`, se produce una salida de impresión similar a la de :program:`ls -l`. Si el parámetro *members* es proporcionado, debe ser un subconjunto de la lista retornada por :meth:`getmembers`.

source: Added the *members* parameter.
es: Se agregó el parámetro *members*.

source: Return the next member of the archive as a :class:`TarInfo` object, when :class:`TarFile` is opened for reading. Return :const:`None` if there is no more available.
es: Retorna el siguiente miembro del archivo como un objeto :class:`TarInfo` cuando :class:`TarFile` se abre para lectura. Retorna :const:`None` si no hay más miembros disponibles.
