Repository: python/python-docs-es
Catalog: library/tarfile.po
Languages: es

source: The *errors* argument defines how characters are treated that cannot be converted. Possible values are listed in section :ref:`error-handlers`. The default scheme is ``'surrogateescape'`` which Python also uses for its file system calls, see :ref:`os-filenames`.
es: El argumento *errors* define como van a ser tratados los caracteres que no pueden ser transformados. Los valores admitidos están listados en la sección :ref:`error-handlers`. El esquema predeterminado es ``'surrogateescape'`` el cual Python también utiliza para sus llamadas al sistema de archivos. Consulta :ref:`os-filenames`.

source: For :const:`PAX_FORMAT` archives (the default), *encoding* is generally not needed because all the metadata is stored using *UTF-8*. *encoding* is only used in the rare cases when binary pax headers are decoded or when strings with surrogate characters are stored.
es: Para archivos :const:`PAX_FORMAT` (el formato default), el *encoding* generalmente no es necesario porque todos los meta-datos son almacenados utilizando *UTF-8*, el *encoding* solo es utilizado en aquellos casos cuando las cabeceras binarias PAX son decodificadas o cuando se almacenan cadenas de texto con caracteres sustitutos.
