Repository: python/python-docs-es
Catalog: library/test.po
Languages: es

source: Skip tests if the :mod:`multiprocessing.synchronize` module is missing, if there is no available semaphore implementation, or if creating a lock raises an :exc:`OSError`.
es: Omite las pruebas si el módulo no se encuentra al :mod:`multiprocessing.synchronize`, si no hay una implementación de semáforo disponible, o si crear un *lock* lanza un :exc:`OSError`.

source: Assert that type *tp* cannot be instantiated using *args* and *kwds*.
es: Se aserciona que el tipo *tp* no pueda ser instanciado usando *args* y *kwds*.

source: This function returns a context manager that will change the global :func:`sys.set_int_max_str_digits` setting for the duration of the context to allow execution of test code that needs a different limit on the number of digits when converting between an integer and string.
es: Esta función devuelve un administrador de contexto que cambiará la configuración global de :func:`sys.set_int_max_str_digits` durante la duración del contexto para permitir la ejecución de código de prueba que necesita un límite diferente en la cantidad de dígitos al convertir entre un número entero y una cadena.

source: The :mod:`test.support` module defines the following classes:
es: El módulo :mod:`test.support` define las siguientes clases:

source: A context manager used to try to prevent crash dialog popups on tests that are expected to crash a subprocess.
es: Un administrador de contexto suele intentar evitar ventanas emergentes de diálogo de bloqueo en las pruebas que se espera que bloqueen un subproceso.

source: On Windows, it disables Windows Error Reporting dialogs using `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.
es: En Windows, deshabilita los cuadros de diálogo de Informe de errores de Windows usando `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.

source: On both platforms, the old value is restored by :meth:`__exit__`.
es: En ambas plataformas, el valor anterior se restaura mediante :meth:`__exit__`.

source: Class to save and restore signal handlers registered by the Python signal handler.
es: Clase para guardar y restaurar manejadores (*handlers*) de señal registrados por el manejador de señal Python.

source: Save the signal handlers to a dictionary mapping signal numbers to the current signal handler.
es: Guarda los controladores de señales en un diccionario que asigna números de señales al controlador de señales actual.

source: Set the signal numbers from the :meth:`save` dictionary to the saved handler.
es: Establece los números de señal del diccionario :meth:`save` en el controlador guardado.

source: Try to match a single dict with the supplied arguments.
es: Intenta hacer coincidir una sola sentencia con los argumentos proporcionados.

source: Try to match a single stored value (*dv*) with a supplied value (*v*).
es: Intenta hacer coincidir un único valor almacenado (*dv*) con un valor proporcionado (*v*).

source: :mod:`test.support.socket_helper` --- Utilities for socket tests
es: :mod:`test.support.socket_helper` --- Utilidades para pruebas de socket

source: The :mod:`test.support.socket_helper` module provides support for socket tests.
es: El módulo :mod:`test.support.socket_helper` proporciona soporte para las pruebas de socket.

source: Set to ``True`` if IPv6 is enabled on this host, ``False`` otherwise.
es: Se establece como ``True`` si IPv6 está habilitado en este host, ``False`` en caso contrario.

source: Returns an unused port that should be suitable for binding. This is achieved by creating a temporary socket with the same family and type as the ``sock`` parameter (default is :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), and binding it to the specified host address (defaults to ``0.0.0.0``) with the port set to 0, eliciting an unused ephemeral port from the OS. The temporary socket is then closed and deleted, and the ephemeral port is returned.
es: Retorna un puerto no utilizado que debería ser adecuado para el enlace. Esto se logra creando un *socket* temporal con la misma familia y tipo que el parámetro ``sock`` (el valor predeterminado es :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`) y vinculándolo a la dirección de host especificada (por defecto es ``0.0.0.0``) con el puerto establecido en 0, provocando un puerto efímero no utilizado del sistema operativo. El *socket* temporal se cierra y se elimina, y se retorna el puerto efímero.

source: Either this method or :func:`bind_port` should be used for any tests where a server socket needs to be bound to a particular port for the duration of the test. Which one to use depends on whether the calling code is creating a Python socket, or if an unused port needs to be provided in a constructor or passed to an external program (i.e. the ``-accept`` argument to openssl's s_server mode). Always prefer :func:`bind_port` over :func:`find_unused_port` where possible. Using a hard coded port is discouraged since it can make multiple instances of the test impossible to run simultaneously, which is a problem for buildbots.
es: Este método o :func:`bind_port` debe usarse para cualquier prueba en la que un *socket* del servidor deba estar vinculado a un puerto en particular durante la duración de la prueba. Cuál usar depende de si el código de llamada está creando un *socket* Python, o si un puerto no utilizado debe proporcionarse en un constructor o pasar a un programa externo (es decir, el argumento ``-accept`` al modo *s_server de openssl*). Siempre es preferible :func:`bind_port` sobre :func:`find_unused_port` donde sea posible. Se desaconseja el uso de un puerto codificado ya que puede hacer que varias instancias de la prueba sean imposibles de ejecutar simultáneamente, lo cual es un problema para los *buildbots*.

source: Bind the socket to a free port and return the port number. Relies on ephemeral ports in order to ensure we are using an unbound port. This is important as many tests may be running simultaneously, especially in a buildbot environment. This method raises an exception if the ``sock.family`` is :const:`~socket.AF_INET` and ``sock.type`` is :const:`~socket.SOCK_STREAM`, and the socket has :const:`~socket.SO_REUSEADDR` or :const:`~socket.SO_REUSEPORT` set on it. Tests should never set these socket options for TCP/IP sockets. The only case for setting these options is testing multicasting via multiple UDP sockets.
es: Se enlaza el *socket* a un puerto libre y retorna el número de puerto. Se basa en puertos efímeros para garantizar que estemos utilizando un puerto independiente. Esto es importante ya que muchas pruebas pueden ejecutarse simultáneamente, especialmente en un entorno *buildbot*. Este método lanza una excepción si ``sock.family`` es :const:`~ socket.AF_INET` y ``sock.type`` es :const:`~ socket.SOCK_STREAM`, y el *socket* tiene :const:`~socket.SO_REUSEADDR` o :const:`~socket.SO_REUSEPORT` establecido en él. Las pruebas nunca deben configurar estas opciones de *socket* para los *sockets TCP/IP*. El único caso para configurar estas opciones es probar la multidifusión (*multicasting*) a través de múltiples *sockets UDP*.

source: Additionally, if the :const:`~socket.SO_EXCLUSIVEADDRUSE` socket option is available (i.e. on Windows), it will be set on the socket. This will prevent anyone else from binding to our host/port for the duration of the test.
es: Además, si la opción de *socket* :const:`~ socket.SO_EXCLUSIVEADDRUSE` está disponible (es decir, en Windows), se establecerá en el *socket*. Esto evitará que otras personas se vinculen a nuestro host/puerto mientras dure la prueba.

source: Bind a Unix socket, raising :exc:`unittest.SkipTest` if :exc:`PermissionError` is raised.
es: Enlaza un socket Unix, lanzando :exc:`unittest.SkipTest` si se lanza :exc:`PermissionError`.

source: A decorator for running tests that require a functional ``bind()`` for Unix sockets.
es: Un decorador para ejecutar pruebas que requieren un enlace(``bind()``) funcional para sockets en sistemas Unix.

source: A context manager that raises :exc:`~test.support.ResourceDenied` when various issues with the internet connection manifest themselves as exceptions.
es: Un gestor de contexto que lanza :exc:`~test.support.ResourceDenied` cuando varios problemas con la conexión a Internet se manifiestan como excepciones.

source: :mod:`test.support.script_helper` --- Utilities for the Python execution tests
es: :mod:`test.support.script_helper` ---Utilidades para las pruebas de ejecución de Python

source: The :mod:`test.support.script_helper` module provides support for Python's script execution tests.
es: El módulo :mod:`test.support.script_helper` proporciona soporte para las pruebas de ejecución de script de Python.

source: Return ``True`` if ``sys.executable interpreter`` requires environment variables in order to be able to run at all.
es: Retorna ``True`` si el ``sys.executable interpreter`` requiere variables de entorno para poder ejecutarse.

source: This is designed to be used with ``@unittest.skipIf()`` to annotate tests that need to use an ``assert_python*()`` function to launch an isolated mode (``-I``) or no environment mode (``-E``) sub-interpreter process.
es: Esto está diseñado para usarse con ``@unittest.skipIf()`` para anotar pruebas que necesitan usar una función ``assert_python*()`` para iniciar un modo aislado (``-I``) o sin entorno proceso de subinterpretador de modo (``-E``).

source: A normal build & test does not run into this situation but it can happen when trying to run the standard library test suite from an interpreter that doesn't have an obvious home with Python's current home finding logic.
es: Una compilación y prueba normal no se encuentra en esta situación, pero puede suceder cuando se intenta ejecutar el conjunto de pruebas de biblioteca estándar desde un intérprete que no tiene un directorio principal obvio con la lógica de búsqueda de directorio principal actual de Python.

source: Setting :envvar:`PYTHONHOME` is one way to get most of the testsuite to run in that situation. :envvar:`PYTHONPATH` or :envvar:`PYTHONUSERSITE` are other common environment variables that might impact whether or not the interpreter can start.
es: La configuración :envvar:`PYTHONHOME` es una forma de hacer que la mayoría del *testuite* se ejecute en esa situación. :envvar:`PYTHONPATH` o :envvar:`PYTHONUSERSITE` son otras variables de entorno comunes que pueden afectar si el intérprete puede o no comenzar.

source: Set up the environment based on *env_vars* for running the interpreter in a subprocess. The values can include ``__isolated``, ``__cleanenv``, ``__cwd``, and ``TERM``.
es: Configura el entorno basado en *env_vars* para ejecutar el intérprete en un subproceso. Los valores pueden incluir ``__isolated``, ``__cleanenv``, ``__cwd`` y ``TERM``.

source: The function no longer strips whitespaces from *stderr*.
es: La función ya no elimina los espacios en blanco de *stderr*.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* succeeds (``rc == 0``) and return a ``(return code, stdout, stderr)`` tuple.
es: Aserción de que ejecutar el intérprete con *arg* y variables de entorno opcionales *env_vars* tiene éxito (``rc == 0``) y retorna una tupla ``(código de retorno, stdout, stderr)``.

source: If the *__cleanenv* keyword-only parameter is set, *env_vars* is used as a fresh environment.
es: Si se establece el parámetro de solo palabra clave *__cleanenv*, *env_vars* se usa como un entorno nuevo.

source: Python is started in isolated mode (command line option ``-I``), except if the *__isolated* keyword-only parameter is set to ``False``.
es: Python se inicia en modo aislado (opción de línea de comando ``-I``), excepto si el parámetro de solo palabra clave *__isolated* se establece en ``False``.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* fails (``rc != 0``) and return a ``(return code, stdout, stderr)`` tuple.
es: Aserciona que la ejecución del intérprete con *args* y variables de entorno opcionales *env_vars* falla (``rc! = 0``) y retorna una tupla ``(return code, stdout, stderr)``.

source: See :func:`assert_python_ok` for more options.
es: Consulte :func:`assert_python_ok` para más opciones.

source: Run a Python subprocess with the given arguments.
es: Ejecuta un subproceso de Python con los argumentos dados.

source: *kw* is extra keyword args to pass to :func:`subprocess.Popen`. Returns a :class:`subprocess.Popen` object.
es: *kw* es un argumento adicional de palabras clave para pasar a :func:`subprocess.Popen`. Retorna un objeto a :class:`subprocess.Popen`.

source: Run the given :class:`subprocess.Popen` process until completion and return stdout.
es: Ejecuta el proceso dado :class:`subprocess.Popen` hasta que finalice y retorne *stdout*.

source: Create script containing *source* in path *script_dir* and *script_basename*. If *omit_suffix* is ``False``, append ``.py`` to the name. Return the full script path.
es: Crea un script que contiene *source* en la ruta *script_dir* y *script_basename*. Si *omit_suffix* es ``False``, agregue ``.py`` al nombre. Retorna la ruta completa del script.

source: Create zip file at *zip_dir* and *zip_basename* with extension ``zip`` which contains the files in *script_name*. *name_in_zip* is the archive name. Return a tuple containing ``(full path, full path of archive name)``.
es: Crea un archivo zip en *zip_dir* y *zip_basename* con la extensión ``zip`` que contiene los archivos en *script_name*. *name_in_zip* es el nombre del archivo. Retorna una tupla que contiene ``(ruta completa, ruta completa del nombre del archivo)``.

source: Create a directory named *pkg_dir* containing an ``__init__`` file with *init_source* as its contents.
es: Crea un directorio llamado *pkg_dir* que contiene un archivo ``__init__`` con *init_source* como su contenido.

source: Create a zip package directory with a path of *zip_dir* and *zip_basename* containing an empty ``__init__`` file and a file *script_basename* containing the *source*. If *compiled* is ``True``, both source files will be compiled and added to the zip package. Return a tuple of the full zip path and the archive name for the zip file.
es: Crea un directorio de paquete zip con una ruta de *zip_dir* y *zip_basename* que contiene un archivo ``__init__`` vacío y un archivo *script_basename* que contiene el *source*. Si *compilado* es ``True``, ambos archivos fuente se compilarán y se agregarán al paquete zip. Retorna una tupla de la ruta zip completa y el nombre de archivo para el archivo zip.

source: :mod:`test.support.bytecode_helper` --- Support tools for testing correct bytecode generation
es: :mod:`test.support.bytecode_helper` --- Herramientas de apoyo para comprobar la correcta generación de bytecode

source: The :mod:`test.support.bytecode_helper` module provides support for testing and inspecting bytecode generation.
es: El módulo :mod:`test.support.bytecode_helper` proporciona soporte para probar e inspeccionar la generación de código de bytes.

source: The module defines the following class:
es: El módulo define la siguiente clase:

source: This class has custom assertion methods for inspecting bytecode.
es: Esta clase tiene métodos de aserción personalizados para inspeccionar el código de bytes.

source: Return the disassembly of *co* as string.
es: Retorna el desensamblaje de *co* como cadena.

source: Return instr if *opname* is found, otherwise throws :exc:`AssertionError`.
es: Retorna instr si se encuentra *opname*, de lo contrario lanza :exc:`AssertionError`.

source: Throws :exc:`AssertionError` if *opname* is found.
es: Lanza :exc:`AssertionError` si se encuentra *opname*.

source: :mod:`test.support.threading_helper` --- Utilities for threading tests
es: :mod:`test.support.threading_helper` --- Utilidades para pruebas con hilos

source: The :mod:`test.support.threading_helper` module provides support for threading tests.
es: El módulo :mod:`test.support.threading_helper` proporciona soporte para las pruebas de socket.

source: Join a *thread* within *timeout*. Raise an :exc:`AssertionError` if thread is still alive after *timeout* seconds.
es: Se une un *thread* dentro de *timeout*. Lanza un :exc:`AssertionError` si el hilo sigue vivo después de unos segundos de *timeout*.

source: Decorator to ensure the threads are cleaned up even if the test fails.
es: Decorador para garantizar que los hilos se limpien incluso si la prueba falla.

source: Context manager to start *threads*, which is a sequence of threads. *unlock* is a function called after the threads are started, even if an exception was raised; an example would be :meth:`threading.Event.set`. ``start_threads`` will attempt to join the started threads upon exit.
es: Administrador de contexto para iniciar *threads*, que es una secuencia de subprocesos. *unlock* es una función a la que se llama después de que se inician los subprocesos, incluso si se generó una excepción; un ejemplo sería :meth:`threading.Event.set`. ``start_threads`` intentará unirse a los subprocesos iniciados al salir.

source: Cleanup up threads not specified in *original_values*. Designed to emit a warning if a test leaves running threads in the background.
es: Se limpia los hilos no especificados en *original_values*. Diseñado para emitir una advertencia si una prueba deja hilos en ejecución en segundo plano.

source: Return current thread count and copy of dangling threads.
es: Retorna el recuento del hilo actual y copia de subprocesos colgantes.

source: Context manager to wait until all threads created in the ``with`` statement exit.
es: El administrador de contexto debe esperar hasta que salgan todos los hilos creados en la declaración ``with``.

source: Context manager catching :class:`threading.Thread` exception using :func:`threading.excepthook`.
es: El administrador de contexto captura :class:`threading.Thread` excepción usando :func:`threading.excepthook`.

source: Attributes set when an exception is caught:
es: Atributos establecidos cuando se captura una excepción:

source: See :func:`threading.excepthook` documentation.
es: Consulte la documentación para :func:`threading.excepthook`.

source: These attributes are deleted at the context manager exit.
es: Estos atributos se eliminan en la salida del administrador de contexto.

source: :mod:`test.support.os_helper` --- Utilities for os tests
es: :mod:`test.support.os_helper` --- Utilidades para pruebas de sistemas operativos

source: The :mod:`test.support.os_helper` module provides support for os tests.
es: El módulo :mod:`test.support.os_helper` proporciona soporte para las pruebas de sistemas operativos.

source: A non-ASCII character encodable by :func:`os.fsencode`.
es: Un carácter no codificable ASCII codificable por :func:`os.fsencode`.

source: Set to :func:`os.getcwd`.
es: Establecido :func:`os.getcwd`.

source: Set to a name that is safe to use as the name of a temporary file. Any temporary file that is created should be closed and unlinked (removed).
es: Establecido a un nombre que sea seguro de usar como nombre de un archivo temporal. Cualquier archivo temporal que se cree debe cerrarse y desvincularse (eliminarse).

source: Set to a filename containing the :data:`FS_NONASCII` character, if it exists. This guarantees that if the filename exists, it can be encoded and decoded with the default filesystem encoding. This allows tests that require a non-ASCII filename to be easily skipped on platforms where they can't work.
es: Establecido en un nombre de archivo que contiene el carácter :data:`FS_NONASCII`, si existe. Esto garantiza que, si existe el nombre de archivo, se puede codificar y decodificar con la codificación predeterminada del sistema de archivos. Esto permite omitir fácilmente las pruebas que requieren un nombre de archivo que no sea ASCII en plataformas donde no pueden funcionar.

source: Set to a filename (str type) that should not be able to be encoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
es: Establecido un nombre de archivo (tipo *str*) que no se pueda codificar mediante la codificación del sistema de archivos en modo estricto. Puede ser ``None`` si no es posible generar dicho nombre de archivo.

source: Set to a filename (bytes type) that should not be able to be decoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
es: Establecido un nombre de archivo (tipo de bytes) que no pueda descodificarse mediante la codificación del sistema de archivos en modo estricto. Puede ser ``None`` si no es posible generar dicho nombre de archivo.

source: Set to a non-ASCII name for a temporary file.
es: Establecido un nombre que no sea ASCII para un archivo temporal.

source: Class used to temporarily set or unset environment variables. Instances can be used as a context manager and have a complete dictionary interface for querying/modifying the underlying ``os.environ``. After exit from the context manager all changes to environment variables done through this instance will be rolled back.
es: Clase utilizada para establecer o deshabilitar temporalmente las variables de entorno. Las instancias se pueden usar como un administrador de contexto y tienen una interfaz de diccionario completa para consultar/modificar el ``os.environ`` subyacente. Después de salir del administrador de contexto, todos los cambios en las variables de entorno realizados a través de esta instancia se revertirán.

source: Added dictionary interface.
es: Añadido una interfaz de diccionario.

source: Simple :term:`path-like object`. It implements the :meth:`__fspath__` method which just returns the *path* argument. If *path* is an exception, it will be raised in :meth:`!__fspath__`.
es: Simple :term:`path-like object`. Se implementa el método :meth:`__fspath__` que simplemente retorna el argumento *path*. Si *path* es una excepción, se lanzará en :meth:`! __ fspath__`.

source: Temporarily set the environment variable ``envvar`` to the value of ``value``.
es: Se establece temporalmente la variable de entorno ``envvar`` en el valor de ``value``.

source: Temporarily unset the environment variable ``envvar``.
es: Deshabilita temporalmente la variable de entorno ``envvar``.

source: Return ``True`` if the OS supports symbolic links, ``False`` otherwise.
es: Retorna ``True`` si el sistema operativo admite links simbólicos, de lo contrario ``False``.

source: Return ``True`` if the OS supports xattr, ``False`` otherwise.
es: Retorna ``True`` si el sistema operativo admite *xattr*, de lo contrario ``False``.

source: A context manager that temporarily changes the current working directory to *path* and yields the directory.
es: Un administrador de contexto que cambia temporalmente el directorio de trabajo actual a *path* y produce el directorio.

source: If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, it issues only a warning and keeps the current working directory the same.
es: Si *quiet* es ``False``, el administrador de contexto lanza una excepción en caso de error. De lo contrario, solo emite una advertencia y mantiene el directorio de trabajo actual igual.

source: Create an empty file with *filename*. If it already exists, truncate it.
es: Crea un archivo vacío con *filename*. Si ya existe, truncarlo.

source: Count the number of open file descriptors.
es: Cuenta el número de descriptores de archivo abiertos.

source: Return ``True`` if the file system for *directory* is case-insensitive.
es: Retorna ``True`` si el sistema de archivos para *directory* no distingue entre mayúsculas y minúsculas.
