Repository: python/python-docs-es
Catalog: library/test.po
Languages: es

source: Raise :exc:`ResourceDenied` if *resource* is not available. *msg* is the argument to :exc:`ResourceDenied` if it is raised. Always returns ``True`` if called by a function whose ``__name__`` is ``'__main__'``. Used when tests are executed by :mod:`test.regrtest`.
es: Lanza :exc:`ResourceDenied` si *resource* no está disponible. *msg* es el argumento para :exc:`ResourceDenied` si se lanza. Siempre retorna ``True`` si es invocado por una función cuyo ``__name__`` es ``'__main__'``. Se usa cuando se ejecutan pruebas por :mod:`test.regrtest`.

source: Return a repr of *dict* with keys sorted.
es: Retorna una representación del *diccionario* con las claves ordenadas.

source: Return the path to the file named *filename*. If no match is found *filename* is returned. This does not equal a failure since it could be the path to the file.
es: Retorna la ruta al archivo llamado *filename*. Si no se encuentra ninguna coincidencia, se retorna *filename*. Esto no equivale a un fallo, ya que podría ser la ruta al archivo.

source: Setting *subdir* indicates a relative path to use to find the file rather than looking directly in the path directories.
es: La configuración *subdir* indica una ruta relativa a utilizar para encontrar el archivo en lugar de buscar directamente en los directorios de ruta.

source: Determine whether *test* matches the patterns set in :func:`set_match_tests`.
es: Determina si *test* coincide con los patrones establecidos en :func:`set_match_tests`.

source: Define match patterns on test filenames and test method names for filtering tests.
es: Define patrones de coincidencia en nombres de archivos de prueba y nombres de métodos de prueba para filtrar pruebas.

source: Execute :class:`unittest.TestCase` subclasses passed to the function. The function scans the classes for methods starting with the prefix ``test_`` and executes the tests individually.
es: Ejecuta subclases :class:`unittest.TestCase` pasadas a la función. La función escanea las clases en busca de métodos que comiencen con el prefijo ``test_`` y ejecuta las pruebas individualmente.

source: It is also legal to pass strings as parameters; these should be keys in ``sys.modules``. Each associated module will be scanned by ``unittest.TestLoader.loadTestsFromModule()``. This is usually seen in the following :func:`test_main` function::
es: También está permitido pasar cadenas de caracteres como parámetros; Estas deberían ser claves en ``sys.modules``. Cada módulo asociado será escaneado por ``unittest.TestLoader.loadTestsFromModule()``. Esto generalmente se ve en la siguiente función :func:`test_main`::

source: This will run all tests defined in the named module.
es: Esto ejecutará todas las pruebas definidas en el módulo nombrado.

source: Run :func:`doctest.testmod` on the given *module*. Return ``(failure_count, test_count)``.
es: Ejecuta :func:`doctest.testmod` en *module* dado. Retorna ``(failure_count, test_count)``.

source: If *verbosity* is ``None``, :func:`doctest.testmod` is run with verbosity set to :data:`verbose`. Otherwise, it is run with verbosity set to ``None``. *optionflags* is passed as ``optionflags`` to :func:`doctest.testmod`.
es: Si *verbosity* es ``None``, la :func:`doctest.testmod` se ejecuta con *verbosity* establecido en :data:`verbose`. De lo contrario, se ejecuta con verbosidad establecida en ``None``. *optionflags* se pasa como ``optionflags`` to :func:`doctest.testmod`.

source: Set the :func:`sys.setswitchinterval` to the given *interval*. Defines a minimum interval for Android systems to prevent the system from hanging.
es: Establecido :func:`sys.setswitchinterval` en el *intervalo* dado. Define un intervalo mínimo para los sistemas Android para evitar que el sistema se cuelgue.

source: Use this check to guard CPython's implementation-specific tests or to run them only on the implementations guarded by the arguments. This function returns ``True`` or ``False`` depending on the host platform. Example usage::
es: Use esta verificación para proteger las pruebas específicas de implementación de CPython o para ejecutarlas solo en las implementaciones protegidas por los argumentos. Esta función retorna ``True`` o ``False`` según la plataforma del host. Ejemplo de uso::

source: Set the values for :data:`max_memuse` and :data:`real_max_memuse` for big memory tests.
es: Establece los valores para :data:`max_memuse` y :data:`real_max_memuse` para pruebas de memoria grande.

source: Store the value from *stdout*. It is meant to hold the stdout at the time the regrtest began.
es: Almacene el valor de *stdout*. Está destinado a mantener el *stdout* en el momento en que comenzó el regrtest.

source: Return the original stdout set by :func:`record_original_stdout` or ``sys.stdout`` if it's not set.
es: Retorna el *stdout* original establecido por :func:`record_original_stdout` o ``sys.stdout`` si no está configurado.

source: Return a list of command line arguments reproducing the current settings in ``sys.flags`` and ``sys.warnoptions``.
es: Retorna una lista de argumentos de línea de comandos que reproducen la configuración actual en ``sys.flags`` y ``sys.warnoptions``.

source: Return a list of command line arguments reproducing the current optimization settings in ``sys.flags``.
es: Retorna una lista de argumentos de línea de comandos que reproducen la configuración de optimización actual en ``sys.flags``.

source: A context managers that temporarily replaces the named stream with :class:`io.StringIO` object.
es: Un administrador de contexto que reemplaza temporalmente la secuencia nombrada con un objeto :class:`io.StringIO`.

source: Example use with output streams::
es: Ejemplo de uso con flujos de salida::

source: Example use with input stream::
es: Ejemplo de uso con flujo de entrada::

source: A context manager that temporary disables :mod:`faulthandler`.
es: Un administrador de contexto que deshabilita temporalmente :mod:`faulthandler`.

source: Force as many objects as possible to be collected. This is needed because timely deallocation is not guaranteed by the garbage collector. This means that ``__del__`` methods may be called later than expected and weakrefs may remain alive for longer than expected.
es: Se fuerza la mayor cantidad posible de objetos para ser recolectados. Esto es necesario porque el recolector de basura no garantiza la desasignación oportuna. Esto significa que los métodos ``__del__`` pueden llamarse más tarde de lo esperado y las referencias débiles pueden permanecer vivas por más tiempo de lo esperado.

source: A context manager that disables the garbage collector on entry. On exit, the garbage collector is restored to its prior state.
es: Un administrador de contexto que deshabilita el recolector de basura al entrar. Al salir, el recolector de basura se restaura a su estado anterior.

source: Context manager to swap out an attribute with a new object.
es: Administrador de contexto para intercambiar un atributo con un nuevo objeto.

source: Usage::
es: Uso::

source: This will set ``obj.attr`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``attr`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
es: Esto establecerá ``obj.attr`` en 5 durante la duración del bloque ``with``, restaurando el valor anterior al final del bloque. Si ``attr`` no existe en ``obj``, se creará y luego se eliminará al final del bloque.

source: The old value (or ``None`` if it doesn't exist) will be assigned to the target of the "as" clause, if there is one.
es: El valor anterior (o ``None`` si no existe) se asignará al objetivo de la cláusula "como", si existe.

source: Context manager to swap out an item with a new object.
es: Administrador de contexto para intercambiar un elemento con un nuevo objeto.

source: This will set ``obj["item"]`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``item`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
es: Esto establecerá ``obj ["item"]`` a 5 durante la duración del bloque ``with``, restaurando el valor anterior al final del bloque. Si ``item`` no existe en ``obj``, se creará y luego se eliminará al final del bloque.

source: Call the ``flush()`` method on :data:`sys.stdout` and then on :data:`sys.stderr`. It can be used to make sure that the logs order is consistent before writing into stderr.
es: Llama al método ``flush()`` en :data:`sys.stdout` y luego en :data:`sys.stderr`. Se puede usar para asegurarse de que el orden de los registros sea consistente antes de escribir en stderr.

source: Print a warning into :data:`sys.__stderr__`. Format the message as: ``f"Warning -- {msg}"``. If *msg* is made of multiple lines, add ``"Warning -- "`` prefix to each line.
es: Imprime una advertencia en :data:`sys.__stderr__`. Formatea el mensaje como: ``f "Warning -- {msg}"``. Si *msg* se compone de varias líneas, añade el prefijo ``"Warning --"`` a cada línea.

source: Wait until process *pid* completes and check that the process exit code is *exitcode*.
es: Espere hasta que el proceso *pid* termine y comprobará que el código de salida del proceso es *exitcode*.

source: Raise an :exc:`AssertionError` if the process exit code is not equal to *exitcode*.
es: Lanza un :exc:`AssertionError` si el código de salida del proceso no es igual a *exitcode*.

source: If the process runs longer than *timeout* seconds (:data:`SHORT_TIMEOUT` by default), kill the process and raise an :exc:`AssertionError`. The timeout feature is not available on Windows.
es: Si el proceso se ejecuta durante más tiempo que *timeout* en segundos (:data:`SHORT_TIMEOUT` por defecto), mata el proceso y lanza un :exc:`AssertionError`. La función de tiempo de espera no está disponible en Windows.

source: Return the size of the :c:type:`PyObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
es: Retorna el tamaño del :c:type:`PyObject` cuyos miembros de estructura están definidos por *fmt*. El valor retornado incluye el tamaño del encabezado y la alineación del objeto de Python.

source: Return the size of the :c:type:`PyVarObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
es: Retorna el tamaño del :c:type:`PyVarObject` cuyos miembros de estructura están definidos por *fmt*. El valor retornado incluye el tamaño del encabezado y la alineación del objeto de Python.

source: For testcase *test*, assert that the ``sys.getsizeof`` for *o* plus the GC header size equals *size*.
es: Para el caso de prueba (*testcase*), se aserciona que el ``sys.getsizeof`` para *o* más el tamaño del encabezado *GC* es igual a *size*.

source: A decorator to conditionally mark tests with :func:`unittest.expectedFailure`. Any use of this decorator should have an associated comment identifying the relevant tracker issue.
es: Un decorador para marcar condicionalmente las pruebas con :func:`unittest.expectedFailure`. Cualquier uso de este decorador debe tener un comentario asociado que identifique el problema relevante del rastreador.

source: A decorator that skips the decorated test on TLS certification validation failures.
es: Un decorador que se salta la prueba decorada en los errores de validación de la certificación TLS.

source: A decorator for running a function in a different locale, correctly resetting it after it has finished. *catstr* is the locale category as a string (for example ``"LC_ALL"``). The *locales* passed will be tried sequentially, and the first valid locale will be used.
es: Un decorador para ejecutar una función en una configuración regional diferente, restableciéndola correctamente una vez que ha finalizado. *catstr* es la categoría de configuración regional como una cadena (por ejemplo, ``"LC_ALL"``). Las *locales* aprobadas se probarán secuencialmente y se utilizará la primera configuración regional válida.

source: A decorator for running a function in a specific timezone, correctly resetting it after it has finished.
es: Un decorador para ejecutar una función en una zona horaria específica, restableciéndola correctamente una vez que haya finalizado.

source: Decorator for the minimum version when running test on FreeBSD. If the FreeBSD version is less than the minimum, the test is skipped.
es: Decorador para la versión mínima cuando se ejecuta la prueba en FreeBSD. Si la versión de FreeBSD es inferior a la mínima, se salta la prueba.

source: Decorator for the minimum version when running test on Linux. If the Linux version is less than the minimum, the test is skipped.
es: Decorador para la versión mínima cuando se ejecuta la prueba en Linux. Si la versión de Linux es inferior a la mínima, se omite la prueba.

source: Decorator for the minimum version when running test on macOS. If the macOS version is less than the minimum, the test is skipped.
es: Decorador para la versión mínima cuando se ejecuta la prueba en macOS. Si la versión de macOS es inferior a la mínima, se omite la prueba.

source: Decorator for skipping tests on non-IEEE 754 platforms.
es: Decorador para omitir pruebas en plataformas que no son *IEEE 754*.

source: Decorator for skipping tests if :mod:`zlib` doesn't exist.
es: Decorador para omitir pruebas si :mod:`zlib` no existe.

source: Decorator for skipping tests if :mod:`gzip` doesn't exist.
es: Decorador para omitir pruebas si :mod:`gzip` no existe.

source: Decorator for skipping tests if :mod:`bz2` doesn't exist.
es: Decorador para omitir pruebas si :mod:`bz2` no existe.

source: Decorator for skipping tests if :mod:`lzma` doesn't exist.
es: Decorador para omitir pruebas si :mod:`lzma` no existe.

source: Decorator for skipping tests if *resource* is not available.
es: Decorador para omitir pruebas si *resource* no está disponible.

source: Decorator for only running the test if :data:`HAVE_DOCSTRINGS`.
es: Decorador para ejecutar solo la prueba si :data:`HAVE_DOCSTRINGS`.

source: Decorator for tests only applicable to CPython.
es: Decorador para pruebas solo aplicable a CPython.

source: Decorator for invoking :func:`check_impl_detail` on *guards*. If that returns ``False``, then uses *msg* as the reason for skipping the test.
es: Decorador para invocar :func:`check_impl_detail` en *guards*. Si eso retorna ``False``, entonces usa *msg* como la razón para omitir la prueba.

source: Decorator to temporarily turn off tracing for the duration of the test.
es: Decorador para desactivar temporalmente el seguimiento durante la duración de la prueba.

source: Decorator for tests which involve reference counting. The decorator does not run the test if it is not run by CPython. Any trace function is unset for the duration of the test to prevent unexpected refcounts caused by the trace function.
es: Decorador para pruebas que implican conteo de referencias. El decorador no ejecuta la prueba si CPython no la ejecuta. Cualquier función de rastreo no se establece durante la duración de la prueba para evitar conteos de referencia(*refcounts*) inesperados causados por la función de rastreo.

source: Decorator for bigmem tests.
es: Decorador para pruebas *bigmem*.

source: *size* is a requested size for the test (in arbitrary, test-interpreted units.) *memuse* is the number of bytes per unit for the test, or a good estimate of it. For example, a test that needs two byte buffers, of 4 GiB each, could be decorated with ``@bigmemtest(size=_4G, memuse=2)``.
es: *size* es un tamaño solicitado para la prueba (en unidades arbitrarias interpretadas por la prueba). *memuse* es el número de bytes por unidad para la prueba, o una buena estimación de la misma. Por ejemplo, una prueba que necesita dos búfers de byte, de 4 *GiB* cada uno, podría decorarse con ``@bigmemtest(size=_4G, memuse=2)``.

source: The *size* argument is normally passed to the decorated test method as an extra argument. If *dry_run* is ``True``, the value passed to the test method may be less than the requested value. If *dry_run* is ``False``, it means the test doesn't support dummy runs when ``-M`` is not specified.
es: El argumento *size* normalmente se pasa al método de prueba decorado como un argumento adicional. Si *dry_run* es ``True``, el valor pasado al método de prueba puede ser menor que el valor solicitado. Si *dry_run* es ``False``, significa que la prueba no admite ejecuciones ficticias cuando no se especifica ``-M``.

source: Decorator for tests that fill the address space.
es: Decorador para pruebas que llenan el espacio de direcciones.

source: Test for syntax errors in *statement* by attempting to compile *statement*. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the exception. If *offset* is not ``None``, compares to the offset of the exception.
es: Prueba los errores de sintaxis en *statement* intentando compilar *statement*. *testcase* es la instancia :mod:`unittest` para la prueba. *errtext* es la expresión regular que debe coincidir con la representación de cadena de caracteres que es lanza en :exc:`SyntaxError`. Si *lineno* no es ``None``, se compara con la línea de la excepción. Si *offset* no es ``None``, se compara con el desplazamiento de la excepción.

source: Open *url*. If open fails, raises :exc:`TestFailed`.
es: Abre *url*. Si la apertura falla, se lanza :exc:`TestFailed`.

source: Use this at the end of ``test_main`` whenever sub-processes are started. This will help ensure that no extra children (zombies) stick around to hog resources and create problems when looking for refleaks.
es: Se utiliza esto al final de ``test_main`` siempre que se inicien subprocesos. Esto ayudará a garantizar que ningún proceso hijo adicional (zombies) se quede para acumular recursos y crear problemas al buscar refleaks.

source: Get an attribute, raising :exc:`unittest.SkipTest` if :exc:`AttributeError` is raised.
es: Obtiene un atributo, lanzando :exc:`unittest.SkipTest` si :exc:`AttributeError` está activado.

source: Context manager catching unraisable exception using :func:`sys.unraisablehook`.
es: El administrador de contexto detectando excepciones imposibles de evaluar usando :func:`sys.unraisablehook`.

source: Storing the exception value (``cm.unraisable.exc_value``) creates a reference cycle. The reference cycle is broken explicitly when the context manager exits.
es: El almacenamiento del valor de excepción (``cm.unraisable.exc_value``) crea un ciclo de referencia. El ciclo de referencia se interrumpe explícitamente cuando sale el administrador de contexto.

source: Storing the object (``cm.unraisable.object``) can resurrect it if it is set to an object which is being finalized. Exiting the context manager clears the stored object.
es: El almacenamiento del objeto (``cm.unraisable.object``) puede resucitarlo si se establece en un objeto que se está finalizando. Salir del administrador de contexto borra el objeto almacenado.

source: Generic implementation of the :mod:`unittest` ``load_tests`` protocol for use in test packages. *pkg_dir* is the root directory of the package; *loader*, *standard_tests*, and *pattern* are the arguments expected by ``load_tests``. In simple cases, the test package's ``__init__.py`` can be the following::
es: La implementación genérica del protocolo :mod:`unittest` ``load_tests`` para usar en paquetes de prueba. *pkg_dir* es el directorio raíz del paquete; *loader*, *standard_tests* y *pattern* son los argumentos esperados por ``load_tests``. En casos simples, el paquete de prueba ``__init __. Py`` puede ser el siguiente::

source: Returns the set of attributes, functions or methods of *ref_api* not found on *other_api*, except for a defined list of items to be ignored in this check specified in *ignore*.
es: Retorna el conjunto de atributos, funciones o métodos de *ref_api* que no se encuentra en *other_api *, excepto por una lista definida de elementos que se ignorarán en esta comprobación especificada en *ignore*.

source: By default this skips private attributes beginning with '_' but includes all magic methods, i.e. those starting and ending in '__'.
es: De forma predeterminada, omite los atributos privados que comienzan con '_' pero incluye todos los métodos mágicos, es decir, los que comienzan y terminan en '__'.

source: Override *object_to_patch.attr_name* with *new_value*. Also add cleanup procedure to *test_instance* to restore *object_to_patch* for *attr_name*. The *attr_name* should be a valid attribute for *object_to_patch*.
es: Se anula *object_to_patch.attr_name* con *new_value*. Se agrega también el procedimiento de limpieza a *test_instance* para restaurar *object_to_patch* para *attr_name*. *Attr_name* debe ser un atributo válido para *object_to_patch*.

source: Run *code* in subinterpreter. Raise :exc:`unittest.SkipTest` if :mod:`tracemalloc` is enabled.
es: Ejecuta *code* en el subinterpretador. Lanza :exc:`unittest.SkipTest` si :mod:`tracemalloc` está habilitado.

source: Assert instances of *cls* are deallocated after iterating.
es: Las instancias de aserción de *cls* se desalojan después de la iteración.

source: Check for the existence of the compiler executables whose names are listed in *cmd_names* or all the compiler executables when *cmd_names* is empty and return the first missing executable or ``None`` when none is found missing.
es: Verifica la existencia de los ejecutables del compilador cuyos nombres figuran en *cmd_names* o todos los ejecutables del compilador cuando *cmd_names* está vacío y retorna el primer ejecutable faltante o ``None`` cuando no se encuentra ninguno.

source: Assert that the ``__all__`` variable of *module* contains all public names.
es: Aserciona que la variable ``_all__`` de *module* contiene todos los nombres públicos.

source: The module's public names (its API) are detected automatically based on whether they match the public name convention and were defined in *module*.
es: Los nombres públicos del módulo (su API) se detectan automáticamente en función de si coinciden con la convención de nombres públicos y se definieron en *module*.

source: The *name_of_module* argument can specify (as a string or tuple thereof) what module(s) an API could be defined in order to be detected as a public API. One case for this is when *module* imports part of its public API from other modules, possibly a C backend (like ``csv`` and its ``_csv``).
es: El argumento *name_of_module* puede especificar (como una cadena o tupla del mismo) qué módulo(s) se podría definir una API para ser detectada como una API pública. Un caso para esto es cuando *module* importa parte de su API pública desde otros módulos, posiblemente un *backend de C* (como ``csv`` y su ``_csv``).

source: The *extra* argument can be a set of names that wouldn't otherwise be automatically detected as "public", like objects without a proper ``__module__`` attribute. If provided, it will be added to the automatically detected ones.
es: El argumento *extra* puede ser un conjunto de nombres que de otro modo no se detectarían automáticamente como "públicos" (*"public"*), como objetos sin un atributo adecuado ``__module__``. Si se proporciona, se agregará a los detectados automáticamente.

source: The *not_exported* argument can be a set of names that must not be treated as part of the public API even though their names indicate otherwise.
es: El argumento *not_exported* puede ser un conjunto de nombres que no deben tratarse como parte de la API pública aunque sus nombres indiquen lo contrario.

source: Example use::
es: Ejemplo de uso::
