Repository: python/python-docs-es
Catalog: library/test.po
Languages: es

source: :mod:`test` --- Regression tests package for Python
es: :mod:`test` --- Paquete de pruebas de regresión para Python

source: The :mod:`test` package is meant for internal use by Python only. It is documented for the benefit of the core developers of Python. Any use of this package outside of Python's standard library is discouraged as code mentioned here can change or be removed without notice between releases of Python.
es: El paquete :mod:`test` está destinado solo para uso interno de Python. Está documentado para beneficio de los desarrolladores principales de Python. Se desaconseja el uso de este paquete fuera de la biblioteca estándar de Python, ya que el código mencionado aquí puede cambiar o eliminarse sin previo aviso entre versiones de Python.

source: The :mod:`test` package contains all regression tests for Python as well as the modules :mod:`test.support` and :mod:`test.regrtest`. :mod:`test.support` is used to enhance your tests while :mod:`test.regrtest` drives the testing suite.
es: El paquete :mod:`test` contiene todas las pruebas de regresión para Python, así como los módulos :mod:`test.support` y :mod:`test.regrtest`. Se utiliza :mod:`test.support` para mejorar sus pruebas, mientras que :mod:`test.regrtest` maneja el conjunto de pruebas.

source: Each module in the :mod:`test` package whose name starts with ``test_`` is a testing suite for a specific module or feature. All new tests should be written using the :mod:`unittest` or :mod:`doctest` module. Some older tests are written using a "traditional" testing style that compares output printed to ``sys.stdout``; this style of test is considered deprecated.
es: Cada módulo en el paquete :mod:`test` cuyo nombre comienza con ``test_`` es un conjunto de pruebas para un módulo o característica específica. Todas las pruebas nuevas deben escribirse usando el módulo :mod:`unittest` o :mod:`doctest`. Algunas pruebas anteriores se escriben utilizando un estilo de prueba "tradicional" que compara la salida impresa con ``sys.stdout``; este estilo de prueba se considera obsoleto.

source: Module :mod:`unittest`
es: Módulo :mod:`unittest`

source: Writing PyUnit regression tests.
es: Escritura de pruebas de regresión de PyUnit.

source: Module :mod:`doctest`
es: Módulo :mod:`doctest`

source: Tests embedded in documentation strings.
es: Pruebas integradas en cadenas de caracteres de documentación.

source: Writing Unit Tests for the :mod:`test` package
es: Escritura de pruebas unitarias para el paquete :mod:`test`

source: It is preferred that tests that use the :mod:`unittest` module follow a few guidelines. One is to name the test module by starting it with ``test_`` and end it with the name of the module being tested. The test methods in the test module should start with ``test_`` and end with a description of what the method is testing. This is needed so that the methods are recognized by the test driver as test methods. Also, no documentation string for the method should be included. A comment (such as ``# Tests function returns only True or False``) should be used to provide documentation for test methods. This is done because documentation strings get printed out if they exist and thus what test is being run is not stated.
es: Se prefiere que las pruebas que utilizan el módulo :mod:`unittest` sigan algunas pautas. Una es nombrar el módulo de prueba comenzándolo con ``test_`` y terminarlo con el nombre del módulo que se está probando. Los métodos de prueba en el módulo de prueba deben comenzar con ``test_`` y terminar con una descripción de lo que el método está probando. Esto es necesario para que el controlador de prueba reconozca los métodos como métodos de prueba. Por lo tanto, no se debe incluir una cadena de caracteres de documentación para el método. Se debe usar un comentario (como ``# Tests function returns only True or False``) para proporcionar documentación para los métodos de prueba. Esto se hace porque las cadenas de documentación se imprimen si existen y, por lo tanto, no se indica qué prueba se está ejecutando.

source: A basic boilerplate is often used::
es: A menudo se usa una plantilla básica::

source: This code pattern allows the testing suite to be run by :mod:`test.regrtest`, on its own as a script that supports the :mod:`unittest` CLI, or via the ``python -m unittest`` CLI.
es: Este patrón de código permite que el conjunto de pruebas sea ejecutado por :mod:`test.regrtest`, como un script que admite la CLI :mod:`unittest`, o mediante la CLI ``python -m unittest``.

source: The goal for regression testing is to try to break code. This leads to a few guidelines to be followed:
es: El objetivo de las pruebas de regresión es intentar romper el código. Esto lleva a algunas pautas a seguir:

source: The testing suite should exercise all classes, functions, and constants. This includes not just the external API that is to be presented to the outside world but also "private" code.
es: El conjunto de pruebas debe ejercer todas las clases, funciones y constantes. Esto incluye no solo la API externa que se presentará al mundo exterior sino también el código "privado".

source: Whitebox testing (examining the code being tested when the tests are being written) is preferred. Blackbox testing (testing only the published user interface) is not complete enough to make sure all boundary and edge cases are tested.
es: Se prefiere la prueba de caja blanca (examinar el código que se prueba cuando se escriben las pruebas). Las pruebas de caja negra (probar solo la interfaz de usuario publicada) no son lo suficientemente completas como para garantizar que se prueben todos los casos límite y límite.

source: Make sure all possible values are tested including invalid ones. This makes sure that not only all valid values are acceptable but also that improper values are handled correctly.
es: Asegúrese de que todos los valores posibles son probados, incluidos los no válidos. Esto asegura que no solo todos los valores válidos sean aceptables, sino que los valores incorrectos se manejen correctamente.

source: Exhaust as many code paths as possible. Test where branching occurs and thus tailor input to make sure as many different paths through the code are taken.
es: Agote tantas rutas de código cómo sea posible. Pruebe donde se produce la ramificación y, por lo tanto, adapte la entrada para asegurarse de que se toman muchas rutas diferentes a través del código.

source: Add an explicit test for any bugs discovered for the tested code. This will make sure that the error does not crop up again if the code is changed in the future.
es: Añada una prueba explícita para cualquier error descubierto para el código probado. Esto asegurará que el error no vuelva a aparecer si el código se cambia en el futuro.

source: Make sure to clean up after your tests (such as close and remove all temporary files).
es: Asegúrese de limpiar después de sus pruebas (así como cerrar y eliminar todos los archivos temporales).

source: If a test is dependent on a specific condition of the operating system then verify the condition already exists before attempting the test.
es: Si una prueba depende de una condición específica del sistema operativo, verifique que la condición ya existe antes de intentar la prueba.

source: Import as few modules as possible and do it as soon as possible. This minimizes external dependencies of tests and also minimizes possible anomalous behavior from side-effects of importing a module.
es: Importe la menor cantidad de módulos posible y hágalo lo antes posible. Esto minimiza las dependencias externas de las pruebas y también minimiza el posible comportamiento anómalo de los efectos secundarios de importar un módulo.

source: Try to maximize code reuse. On occasion, tests will vary by something as small as what type of input is used. Minimize code duplication by subclassing a basic test class with a class that specifies the input::
es: Intente maximizar la reutilización del código. En ocasiones, las pruebas variarán en algo tan pequeño como qué tipo de entrada se utiliza. Minimice la duplicación de código usando como clase base una clase de prueba básica con una clase que especifique la entrada::

source: When using this pattern, remember that all classes that inherit from :class:`unittest.TestCase` are run as tests. The :class:`Mixin` class in the example above does not have any data and so can't be run by itself, thus it does not inherit from :class:`unittest.TestCase`.
es: Cuando use este patrón, recuerde que todas las clases que heredan :class:`unittest.TestCase` se ejecutan como pruebas. La clase :class:`Mixin` en el ejemplo anterior no tiene ningún dato y, por lo tanto, no se puede ejecutar solo, por lo tanto, no hereda de :class:`unittest.TestCase`.

source: Test Driven Development
es: Desarrollo dirigido por pruebas (*Test Driven Development*)

source: A book by Kent Beck on writing tests before code.
es: Un libro de *Kent Beck* sobre pruebas de escritura antes del código.

source: Running tests using the command-line interface
es: Ejecución de pruebas utilizando la interfaz de línea de comandos

source: The :mod:`test` package can be run as a script to drive Python's regression test suite, thanks to the :option:`-m` option: :program:`python -m test`. Under the hood, it uses :mod:`test.regrtest`; the call :program:`python -m test.regrtest` used in previous Python versions still works. Running the script by itself automatically starts running all regression tests in the :mod:`test` package. It does this by finding all modules in the package whose name starts with ``test_``, importing them, and executing the function :func:`test_main` if present or loading the tests via unittest.TestLoader.loadTestsFromModule if ``test_main`` does not exist. The names of tests to execute may also be passed to the script. Specifying a single regression test (:program:`python -m test test_spam`) will minimize output and only print whether the test passed or failed.
es: El paquete :mod:`test` puede ejecutarse como un script para controlar el conjunto de pruebas de regresión de Python, gracias a la opción :option:`-m` : :program:`python -m test`. Internamente, se utiliza :mod:`test.regrtest`; la llamada :program:`python -m test.regrtest` utilizada en versiones anteriores de Python todavía funciona. Ejecuta el script por sí mismo automáticamente y comienza a ejecutar todas las pruebas de regresión en el paquete :mod:`test.regrtest. Lo hace buscando todos los módulos en el paquete cuyo nombre comienza con ``test_``, importándolos y ejecutando la función :func:`test_main` si está presente o cargando las pruebas a través de *unittest.TestLoader.loadTestsFromModule* si ``test_main`` no existe. Los nombres de las pruebas a ejecutar también se pueden pasar al script. La especificación de una prueba de regresión única (:program:`python -m test test_spam`) minimizará la salida y solo imprimirá si la prueba pasó o no.

source: Running :mod:`test` directly allows what resources are available for tests to use to be set. You do this by using the ``-u`` command-line option. Specifying ``all`` as the value for the ``-u`` option enables all possible resources: :program:`python -m test -uall`. If all but one resource is desired (a more common case), a comma-separated list of resources that are not desired may be listed after ``all``. The command :program:`python -m test -uall,-audio,-largefile` will run :mod:`test` with all resources except the ``audio`` and ``largefile`` resources. For a list of all resources and more command-line options, run :program:`python -m test -h`.
es: Ejecutando :mod:`test` directamente permite establecer qué recursos están disponibles para que se usen las pruebas. Para ello, use la opción de línea de comandos ``-u``. Al especificar ``all`` como el valor para la opción ``-u`` se habilitan todos los recursos posibles: :program:`python -m test -uall`. Si se desean todos los recursos menos uno (un caso más común), se puede enumerar una lista de recursos separados por comas que no se desean después de ``all``. El comando :program:`python -m test -uall,-audio,-largefile` ejecutará :mod:`test` con todos los recursos excepto los recursos ``audio`` y ``largefile``. Para obtener una lista de todos los recursos y más opciones de línea de comandos, ejecute :program:`python -m test -h`.

source: Some other ways to execute the regression tests depend on what platform the tests are being executed on. On Unix, you can run :program:`make test` at the top-level directory where Python was built. On Windows, executing :program:`rt.bat` from your :file:`PCbuild` directory will run all regression tests.
es: Algunas otras formas de ejecutar las pruebas de regresión dependen de en qué plataforma se ejecuten las pruebas. En Unix, puede ejecutar :program:`make test` en el directorio de nivel superior donde se construyó Python. En Windows, ejecutar :program:`rt.bat` desde su directorio :file:`PCbuild` ejecutará todas las pruebas de regresión.

source: :mod:`test.support` --- Utilities for the Python test suite
es: :mod:`test.support` --- Utilidades para el conjunto de pruebas de Python

source: The :mod:`test.support` module provides support for Python's regression test suite.
es: El módulo :mod:`test.support` proporciona soporte para el conjunto de pruebas de regresión de Python.

source: :mod:`test.support` is not a public module. It is documented here to help Python developers write tests. The API of this module is subject to change without backwards compatibility concerns between releases.
es: :mod:`test.support` no es un módulo público. Está documentado aquí para ayudar a los desarrolladores de Python a escribir pruebas. La API de este módulo está sujeta a cambios sin problemas de compatibilidad con versiones anteriores entre versiones.

source: This module defines the following exceptions:
es: Este módulo define las siguientes excepciones:

source: Exception to be raised when a test fails. This is deprecated in favor of :mod:`unittest`\ -based tests and :class:`unittest.TestCase`'s assertion methods.
es: Excepción que se lanzará cuando una prueba falle. Está en desuso a favor de pruebas basadas en :mod:`unittest`\ y los métodos de aserción de :class:`unittest.TestCase`.

source: Subclass of :exc:`unittest.SkipTest`. Raised when a resource (such as a network connection) is not available. Raised by the :func:`requires` function.
es: La subclase de :exc:`unittest.SkipTest`. Se lanza cuando un recurso (como una conexión de red) no está disponible. Lanzado por la función :func:`requires`.

source: The :mod:`test.support` module defines the following constants:
es: El módulo :mod:`test.support` define las siguientes constantes:

source: ``True`` when verbose output is enabled. Should be checked when more detailed information is desired about a running test. *verbose* is set by :mod:`test.regrtest`.
es: ``True`` cuando la salida detallada está habilitada. Debe verificarse cuando se desea información más detallada sobre una prueba en ejecución. *verbose* está establecido por :mod:`test.regrtest`.

source: ``True`` if the running interpreter is Jython.
es: ``True`` si el intérprete en ejecución es Jython.

source: ``True`` if the system is Android.
es: ``True`` si el sistema es Android.

source: Path for shell if not on Windows; otherwise ``None``.
es: Ruta del shell si no está en Windows; de otra manera ``None``.

source: Timeout in seconds for tests using a network server listening on the network local loopback interface like ``127.0.0.1``.
es: Tiempo de espera en segundos para las pruebas que utilizan un servidor de red que escucha en la interfaz local de loopback de la red como ``127.0.0.1``.

source: The timeout is long enough to prevent test failure: it takes into account that the client and the server can run in different threads or even different processes.
es: El tiempo de espera es lo suficientemente largo para evitar el fracaso de la prueba: tiene en cuenta que el cliente y el servidor pueden ejecutarse en diferentes hilos o incluso en diferentes procesos.

source: The timeout should be long enough for :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` methods of :class:`socket.socket`.
es: El tiempo de espera debe ser lo suficientemente largo para los métodos :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` y :meth:`~socket.socket.send` de :class:`socket.socket`.

source: Its default value is 5 seconds.
es: Su valor por defecto es de 5 segundos.

source: See also :data:`INTERNET_TIMEOUT`.
es: Ver también :data:`INTERNET_TIMEOUT`.

source: Timeout in seconds for network requests going to the internet.
es: Tiempo de espera en segundos para las solicitudes de red que van a Internet.

source: The timeout is short enough to prevent a test to wait for too long if the internet request is blocked for whatever reason.
es: El tiempo de espera es lo suficientemente corto como para evitar que una prueba espere demasiado tiempo si la solicitud de Internet se bloquea por cualquier motivo.

source: Usually, a timeout using :data:`INTERNET_TIMEOUT` should not mark a test as failed, but skip the test instead: see :func:`~test.support.socket_helper.transient_internet`.
es: Normalmente, un tiempo de espera utilizando :data:`INTERNET_TIMEOUT` no debería marcar una prueba como fallida, sino que debería omitir la prueba: ver :func:`~test.support.socket_helper.transient_internet`.

source: Its default value is 1 minute.
es: Su valor por defecto es de 1 minuto.

source: See also :data:`LOOPBACK_TIMEOUT`.
es: Ver también :data:`LOOPBACK_TIMEOUT`.

source: Timeout in seconds to mark a test as failed if the test takes "too long".
es: Tiempo de espera en segundos para marcar una prueba como fallida si la prueba tarda "demasiado".

source: The timeout value depends on the regrtest ``--timeout`` command line option.
es: El valor del tiempo de espera depende de la opción de línea de comandos regrtest ``--timeout``.

source: If a test using :data:`SHORT_TIMEOUT` starts to fail randomly on slow buildbots, use :data:`LONG_TIMEOUT` instead.
es: Si una prueba que utiliza :data:`SHORT_TIMEOUT` empieza a fallar aleatoriamente en buildbots lentos, utilice en su lugar :data:`LONG_TIMEOUT`.

source: Its default value is 30 seconds.
es: Su valor por defecto es de 30 segundos.

source: Timeout in seconds to detect when a test hangs.
es: Tiempo de espera en segundos para detectar cuando se cuelga una prueba.

source: It is long enough to reduce the risk of test failure on the slowest Python buildbots. It should not be used to mark a test as failed if the test takes "too long". The timeout value depends on the regrtest ``--timeout`` command line option.
es: Es lo suficientemente largo como para reducir el riesgo de fracaso de la prueba en los buildbots de Python más lentos. No debe utilizarse para marcar una prueba como fallida si la prueba tarda "demasiado". El valor del tiempo de espera depende de la opción de línea de comandos regrtest ``--timeout``.

source: Its default value is 5 minutes.
es: Su valor por defecto es de 5 minutos.

source: See also :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` and :data:`SHORT_TIMEOUT`.
es: Ver también :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` y :data:`SHORT_TIMEOUT`.

source: Set when tests can be skipped when they are not useful for PGO.
es: Establecido cuando se pueden omitir las pruebas cuando no son útiles para *PGO*.

source: A constant that is likely larger than the underlying OS pipe buffer size, to make writes blocking.
es: Una constante que probablemente sea más grande que el tamaño del búfer de la tubería (*pipe*) del sistema operativo subyacente, para bloquear las escrituras.

source: A constant that is likely larger than the underlying OS socket buffer size, to make writes blocking.
es: Una constante que probablemente sea más grande que el tamaño del búfer del socket del sistema operativo subyacente para bloquear las escrituras.

source: Set to the top level directory that contains :mod:`test.support`.
es: Establecido en el directorio de nivel superior que contiene :mod:`test.support`.

source: Set to the top level directory for the test package.
es: Establecido en el directorio de nivel superior para el paquete de prueba.

source: Set to the ``data`` directory within the test package.
es: Establecido en el directorio ``data`` dentro del paquete de prueba.

source: Set to :data:`sys.maxsize` for big memory tests.
es: Establecido :data:`sys.maxsize` para pruebas de gran memoria.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Limited by :data:`MAX_Py_ssize_t`.
es: Establecido por :func:`set_memlimit` como límite de memoria para pruebas de memoria grande. Limitado por :data:`MAX_Py_ssize_t`.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Not limited by :data:`MAX_Py_ssize_t`.
es: Establecido por :func:`set_memlimit` como límite de memoria para pruebas de memoria grande. No limitado por :data:`MAX_Py_ssize_t`.

source: Set to ``True`` if Python is built without docstrings (the :c:macro:`WITH_DOC_STRINGS` macro is not defined). See the :option:`configure --without-doc-strings <--without-doc-strings>` option.
es: Vale ``True`` si Python se construye sin cadenas de documentos (la macro :c:macro:`WITH_DOC_STRINGS` no está definida). Consulte la opción :option:`configure --without-doc-strings <--without-doc-strings>`.

source: See also the :data:`HAVE_DOCSTRINGS` variable.
es: Consulte también la variable :data:`HAVE_DOCSTRINGS`.

source: Set to ``True`` if function docstrings are available. See the :option:`python -OO <-O>` option, which strips docstrings of functions implemented in Python.
es: Vale ``True`` si las cadenas de documentación de la función están disponibles. Consulte la opción :option:`python -OO <-O>`, que elimina las cadenas de documentación de las funciones implementadas en Python.

source: See also the :data:`MISSING_C_DOCSTRINGS` variable.
es: Consulte también la variable :data:`MISSING_C_DOCSTRINGS`.

source: Define the URL of a dedicated HTTP server for the network tests.
es: Define la URL de un servidor HTTP dedicado para las pruebas de red.

source: Object that is equal to anything. Used to test mixed type comparison.
es: Objeto que es igual a cualquier cosa. Se utiliza para probar la comparación de tipos mixtos.

source: Object that is not equal to anything (even to :data:`ALWAYS_EQ`). Used to test mixed type comparison.
es: Objeto que no es igual a nada (incluso a :data:`ALWAYS_EQ`). Se utiliza para probar la comparación de tipos mixtos.

source: Object that is greater than anything (except itself). Used to test mixed type comparison.
es: Objeto que es mayor que cualquier cosa (excepto a sí mismo). Se utiliza para probar la comparación de tipos mixtos.

source: Object that is less than anything (except itself). Used to test mixed type comparison.
es: Objeto que es menor que cualquier cosa (excepto él mismo). Se utiliza para probar la comparación de tipos mixtos.

source: The :mod:`test.support` module defines the following functions:
es: El módulo :mod:`test.support` define las siguientes funciones:

source: Return ``True`` if *resource* is enabled and available. The list of available resources is only set when :mod:`test.regrtest` is executing the tests.
es: Retorna ``True`` si *resource* está habilitado y disponible. La lista de recursos disponibles solo se establece cuando :mod:`test.regrtest` está ejecutando las pruebas.

source: Return ``True`` if Python was not built with ``-O0`` or ``-Og``.
es: Retorna ``True`` si Python no fue construido con ``-O0`` o ``-Og``.
