Repository: python/python-docs-es
Catalog: library/test.po
Languages: es

source: Create an invalid file descriptor by opening and closing a temporary file, and returning its descriptor.
es: Se crea un descriptor de archivo no válido abriendo y cerrando un archivo temporal y retornando su descriptor.

source: Call :func:`os.rmdir` on *filename*. On Windows platforms, this is wrapped with a wait loop that checks for the existence of the file, which is needed due to antivirus programs that can hold files open and prevent deletion.
es: Llama a :func:`os.rmdir` en *filename*. En las plataformas Windows, esto se envuelve con un ciclo de espera que verifica la existencia del archivo, que es necesario debido a los programas antivirus que pueden mantener los archivos abiertos y evitar que se eliminen.

source: Call :func:`shutil.rmtree` on *path* or call :func:`os.lstat` and :func:`os.rmdir` to remove a path and its contents. As with :func:`rmdir`, on Windows platforms this is wrapped with a wait loop that checks for the existence of the files.
es: Llama a :func:`shutil.rmtree` en *path* o llama a :func:`os.lstat` y :func:`os.rmdir` para eliminar una ruta y su contenido. Al igual que con :func:`rmdir`, en las plataformas de Windows esto se envuelve con un ciclo de espera que verifica la existencia de los archivos.

source: A decorator for running tests that require support for symbolic links.
es: Un decorador para ejecutar pruebas que requieren soporte para enlaces simbólicos.

source: A decorator for running tests that require support for xattr.
es: Un decorador para ejecutar pruebas que requieren soporte para *xattr*.

source: A context manager that temporarily creates a new directory and changes the current working directory (CWD).
es: Un administrador de contexto que crea temporalmente un nuevo directorio y cambia el directorio de trabajo actual (*CWD*).

source: The context manager creates a temporary directory in the current directory with name *name* before temporarily changing the current working directory. If *name* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`.
es: El administrador de contexto crea un directorio temporal en el directorio actual con el nombre *name* antes de cambiar temporalmente el directorio de trabajo actual. Si *name* es ``None`` , el directorio temporal se crea usando :func:`tempfile.mkdtemp`.

source: If *quiet* is ``False`` and it is not possible to create or change the CWD, an error is raised. Otherwise, only a warning is raised and the original CWD is used.
es: Si *quiet* es ``False`` y no es posible crear o cambiar el *CWD*, se lanza un error. De lo contrario, solo se lanza una advertencia y se utiliza el *CWD* original.

source: A context manager that creates a temporary directory at *path* and yields the directory.
es: Un administrador de contexto que crea un directorio temporal en *path* y produce el directorio.

source: If *path* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`. If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, if *path* is specified and cannot be created, only a warning is issued.
es: Si *path* es ``None``, el directorio temporal se crea usando :func:`tempfile.mkdtemp`. Si *quiet* es ``False``, el administrador de contexto lanza una excepción en caso de error. De lo contrario, si se especifica *path* y no se puede crear, solo se emite una advertencia.

source: A context manager that temporarily sets the process umask.
es: Un administrador de contexto que establece temporalmente el proceso *umask*.

source: Call :func:`os.unlink` on *filename*. As with :func:`rmdir`, on Windows platforms, this is wrapped with a wait loop that checks for the existence of the file.
es: Llama a :func:`os.unlink` en *filename*. Al igual que con :func:`rmdir`, en las plataformas Windows, esto se envuelve con un ciclo de espera que verifica la existencia del archivo.

source: :mod:`test.support.import_helper` --- Utilities for import tests
es: :mod:`test.support.import_helper` --- Utilidades para pruebas de importación

source: The :mod:`test.support.import_helper` module provides support for import tests.
es: El módulo :mod:`test.support.import_helper` proporciona soporte para las pruebas de importación.

source: Remove the module named *module_name* from ``sys.modules`` and delete any byte-compiled files of the module.
es: Elimina el módulo llamado *module_name* de ``sys.modules`` y elimina los archivos compilados por bytes del módulo.

source: This function imports and returns a fresh copy of the named Python module by removing the named module from ``sys.modules`` before doing the import. Note that unlike :func:`reload`, the original module is not affected by this operation.
es: Esta función importa y retorna una copia nueva del módulo Python nombrado eliminando el módulo nombrado de ``sys.modules`` antes de realizar la importación. Tenga en cuenta que a diferencia de :func:`reload`, el módulo original no se ve afectado por esta operación.

source: *fresh* is an iterable of additional module names that are also removed from the ``sys.modules`` cache before doing the import.
es: *fresh* es un iterable de nombres de módulos adicionales que también se eliminan del caché ``sys.modules`` antes de realizar la importación.

source: *blocked* is an iterable of module names that are replaced with ``None`` in the module cache during the import to ensure that attempts to import them raise :exc:`ImportError`.
es: *bloqueado* es un iterable de nombres de módulos que se reemplazan con ``None`` en la memoria caché del módulo durante la importación para garantizar que los intentos de importarlos generen :exc:`ImportError`.

source: The named module and any modules named in the *fresh* and *blocked* parameters are saved before starting the import and then reinserted into ``sys.modules`` when the fresh import is complete.
es: El módulo nombrado y los módulos nombrados en los parámetros *fresh* y *bloqueado* se guardan antes de comenzar la importación y luego se vuelven a insertar en ``sys.modules`` cuando se completa la importación fresca.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``.
es: Los mensajes de deprecación de módulos y paquetes se suprimen durante esta importación si *deprecated* es ``True``.

source: This function will raise :exc:`ImportError` if the named module cannot be imported.
es: Esta función lanzará :exc:`ImportError` si el módulo nombrado no puede importarse.

source: This function imports and returns the named module. Unlike a normal import, this function raises :exc:`unittest.SkipTest` if the module cannot be imported.
es: Esta función importa y retorna el módulo nombrado. A diferencia de una importación normal, esta función lanza :exc:`unittest.SkipTest` si el módulo no se puede importar.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``. If a module is required on a platform but optional for others, set *required_on* to an iterable of platform prefixes which will be compared against :data:`sys.platform`.
es: Los mensajes de deprecación de módulos y paquetes se suprimen durante esta importación si *deprecated* es ``True``. Si se requiere un módulo en una plataforma pero es opcional para otros, establezca *required_on* en un iterable de prefijos de plataforma que se compararán con :data:`sys.platform`.

source: Return a copy of :data:`sys.modules`.
es: Retorna una copia de :data:`sys.modules`.

source: Remove modules except for *oldmodules* and ``encodings`` in order to preserve internal cache.
es: Elimina los módulos a excepción de *oldmodules* y ``encodings`` para preservar la memoria caché interna.

source: Delete *name* from ``sys.modules``.
es: Elimina *name* de ``sys.modules``.

source: Move a :pep:`3147`/:pep:`488` pyc file to its legacy pyc location and return the file system path to the legacy pyc file. The *source* value is the file system path to the source file. It does not need to exist, however the PEP 3147/488 pyc file must exist.
es: Mueve un archivo *pyc* de :pep:`3147`/:pep:`488` a su ubicación heredada y retorna la ruta del sistema de archivos al archivo de *pyc* heredado. El valor de origen es la ruta del sistema de archivos al archivo fuente. No es necesario que exista, sin embargo, debe existir el archivo PEP 3147/488 *pyc*.

source: A context manager to force import to return a new module reference. This is useful for testing module-level behaviors, such as the emission of a :exc:`DeprecationWarning` on import. Example usage::
es: Un administrador de contexto para forzar la importación para retornar una nueva referencia de módulo. Esto es útil para probar comportamientos a nivel de módulo, como la emisión de un :exc:`DeprecationWarning` en la importación. Ejemplo de uso::

source: A context manager to temporarily add directories to :data:`sys.path`.
es: Un administrador de contexto para agregar directorios temporalmente a :data:`sys.path`.

source: This makes a copy of :data:`sys.path`, appends any directories given as positional arguments, then reverts :data:`sys.path` to the copied settings when the context ends.
es: Esto hace una copia de :data:`sys.path`, agrega cualquier directorio dado como argumento posicional, luego revierte :data:`sys.path` a la configuración copiada cuando finaliza el contexto.

source: Note that *all* :data:`sys.path` modifications in the body of the context manager, including replacement of the object, will be reverted at the end of the block.
es: Tenga en cuenta que *all* :data:`sys.path` produce modificaciones en el cuerpo del administrador de contexto, incluida la sustitución del objeto, se revertirán al final del bloque.

source: :mod:`test.support.warnings_helper` --- Utilities for warnings tests
es: :mod:`test.support.warnings_helper` --- Utilidades para pruebas de advertencias

source: The :mod:`test.support.warnings_helper` module provides support for warnings tests.
es: El módulo :mod:`test.support.warnings_helper` proporciona soporte para las pruebas de advertencias.

source: Context manager to check that no :exc:`ResourceWarning` was raised. You must remove the object which may emit :exc:`ResourceWarning` before the end of the context manager.
es: Gestor de contexto para comprobar que no se ha lanzado un :exc:`ResourceWarning` . Debe eliminar el objeto que puede emitir :exc:`ResourceWarning` antes del final del administrador de contexto.

source: Test for syntax warning in *statement* by attempting to compile *statement*. Test also that the :exc:`SyntaxWarning` is emitted only once, and that it will be converted to a :exc:`SyntaxError` when turned into error. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the emitted :exc:`SyntaxWarning` and raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the warning and exception. If *offset* is not ``None``, compares to the offset of the exception.
es: Prueba la advertencia de sintaxis en *statement* intentando compilar *statement*. Pruebe también que :exc:`SyntaxWarning` se emite solo una vez, y que se convertirá en :exc:`SyntaxError` cuando se convierta en error. *testcase* es la instancia :mod:`unittest` para la prueba. *errtext* es la expresión regular que debe coincidir con la representación de cadena del emitido :exc:`SyntaxWarning` y lanza :exc:`SyntaxError` . Si *lineno* no es ``None``, se compara con la línea de advertencia y excepción. Si *offset* no es ``None``, se compara con el desplazamiento de la excepción.

source: A convenience wrapper for :func:`warnings.catch_warnings()` that makes it easier to test that a warning was correctly raised. It is approximately equivalent to calling ``warnings.catch_warnings(record=True)`` with :meth:`warnings.simplefilter` set to ``always`` and with the option to automatically validate the results that are recorded.
es: Un envoltorio de conveniencia para :func:`warnings.catch_warnings()` que hace que sea más fácil probar que una advertencia se lanzó correctamente. Es aproximadamente equivalente a llamar a ``warnings.catch_warnings(record=True)`` con :meth:`warnings.simplefilter` establecido en ``always`` y con la opción de validar automáticamente los resultados que se registran.

source: ``check_warnings`` accepts 2-tuples of the form ``("message regexp", WarningCategory)`` as positional arguments. If one or more *filters* are provided, or if the optional keyword argument *quiet* is ``False``, it checks to make sure the warnings are as expected: each specified filter must match at least one of the warnings raised by the enclosed code or the test fails, and if any warnings are raised that do not match any of the specified filters the test fails. To disable the first of these checks, set *quiet* to ``True``.
es: ``check_warnings`` acepta 2 tuplas de la forma ``("mensaje regexp", WarningCategory)`` como argumentos posicionales. Si se proporcionan uno o más *filters*, o si el argumento opcional de palabra clave *quiet* es ``False``, se verifica para asegurarse de que las advertencias sean las esperadas: cada filtro especificado debe coincidir con al menos una de las advertencias lanzadas por el código adjunto o la prueba falla, y si se lanzan advertencias que no coinciden con ninguno de los filtros especificados, la prueba falla. Para deshabilitar la primera de estas comprobaciones, configure *quiet* en ``True``.

source: If no arguments are specified, it defaults to::
es: Si no se especifican argumentos, el valor predeterminado es::

source: In this case all warnings are caught and no errors are raised.
es: En este caso, se capturan todas las advertencias y no se lanzaran errores.

source: On entry to the context manager, a :class:`WarningRecorder` instance is returned. The underlying warnings list from :func:`~warnings.catch_warnings` is available via the recorder object's :attr:`warnings` attribute. As a convenience, the attributes of the object representing the most recent warning can also be accessed directly through the recorder object (see example below). If no warning has been raised, then any of the attributes that would otherwise be expected on an object representing a warning will return ``None``.
es: En la entrada al administrador de contexto, se retorna una instancia de :class:`WarningRecorder`. La lista de advertencias subyacentes de :func:`~warnings.catch_warnings` está disponible a través del atributo :attr:`warnings` del objeto del registrador. Como conveniencia, también se puede acceder directamente a los atributos del objeto que representa la advertencia más reciente a través del objeto grabador (vea el ejemplo a continuación). Si no se ha lanzado ninguna advertencia, cualquiera de los atributos que de otro modo se esperarían en un objeto que representa una advertencia retornará ``None``.

source: The recorder object also has a :meth:`reset` method, which clears the warnings list.
es: El objeto grabador (*recorder object*) también tiene un método :meth:`reset`, que borra la lista de advertencias.

source: The context manager is designed to be used like this::
es: El administrador de contexto está diseñado para usarse así:

source: In this case if either warning was not raised, or some other warning was raised, :func:`check_warnings` would raise an error.
es: En este caso, si no se generó ninguna advertencia, o si surgió alguna otra advertencia, :func:`check_warnings` lanzaría un error.

source: When a test needs to look more deeply into the warnings, rather than just checking whether or not they occurred, code like this can be used::
es: Cuando una prueba necesita analizar más profundamente las advertencias, en lugar de simplemente verificar si ocurrieron o no, se puede usar un código como este::

source: Here all warnings will be caught, and the test code tests the captured warnings directly.
es: Aquí se capturarán todas las advertencias, y el código de prueba prueba las advertencias capturadas directamente.

source: New optional arguments *filters* and *quiet*.
es: Nuevos argumentos opcionales *filters* y *quiet*.

source: Class used to record warnings for unit tests. See documentation of :func:`check_warnings` above for more details.
es: La clase utilizada para registrar advertencias para pruebas unitarias. Consulte la documentación de :func:`check_warnings` arriba para obtener más detalles.
