Repository: python/python-docs-es
Catalog: library/threading.po
Languages: es

source: A condition variable obeys the :ref:`context management protocol <with-locks>`: using the ``with`` statement acquires the associated lock for the duration of the enclosed block. The :meth:`~Condition.acquire` and :meth:`~Condition.release` methods also call the corresponding methods of the associated lock.
es: Una condición variable obedece el :ref:`protocolo de gestión de contexto<with-locks>`: al usar la declaración ``with`` se adquiere el *lock* asociado por la duración del bloque contenido. Los métodos :meth:`~Condition.acquire` y :meth:`~Condition.release` también llaman los métodos correspondientes del *lock* asociado.

source: Other methods must be called with the associated lock held. The :meth:`~Condition.wait` method releases the lock, and then blocks until another thread awakens it by calling :meth:`~Condition.notify` or :meth:`~Condition.notify_all`. Once awakened, :meth:`~Condition.wait` re-acquires the lock and returns. It is also possible to specify a timeout.
es: Otros métodos deben llamarse con el *lock* asociado conservado. El método :meth:`~Condition.wait` libera el *lock*, y luego bloquea hasta que otro hilo lo despierte llamando :meth:`~Condition.notify` o :meth:`~Condition.notify_all`. Una vez que ha sido despertado, :meth:`~Condition.wait` re-adquiere el *lock* y retorna. También es posible especificar un tiempo de espera.

source: The :meth:`~Condition.notify` method wakes up one of the threads waiting for the condition variable, if any are waiting. The :meth:`~Condition.notify_all` method wakes up all threads waiting for the condition variable.
es: El método :meth:`~Condition.notify` despierta a uno de los hilos que esperan a la condición variable, si es que alguno espera. El método :meth:`~Condition.notify_all` despierta a todos los hilos que estén esperando a la condición variable.

source: Note: the :meth:`~Condition.notify` and :meth:`~Condition.notify_all` methods don't release the lock; this means that the thread or threads awakened will not return from their :meth:`~Condition.wait` call immediately, but only when the thread that called :meth:`~Condition.notify` or :meth:`~Condition.notify_all` finally relinquishes ownership of the lock.
es: Nota: Los métodos :meth:`~Condition.notify` y :meth:`~Condition.notify_all` no liberan el *lock*; esto significa que el hilo o los hilos que han sido despertados no retornaran de su llamada de :meth:`~Condition.wait` inmediatamente, sino solo una vez que el hilo que haya llamado a :meth:`~Condition.notify` o :meth:`~Condition.notify_all` renuncie finalmente a la propiedad del *lock*.

source: The typical programming style using condition variables uses the lock to synchronize access to some shared state; threads that are interested in a particular change of state call :meth:`~Condition.wait` repeatedly until they see the desired state, while threads that modify the state call :meth:`~Condition.notify` or :meth:`~Condition.notify_all` when they change the state in such a way that it could possibly be a desired state for one of the waiters. For example, the following code is a generic producer-consumer situation with unlimited buffer capacity::
es: El estilo típico de programación con variables condicionales utiliza el *lock* para sincronizar el acceso a algún estado compartido; hilos que estén interesados en un cambio de estado en particular llamarán a :meth:`~Condition.wait` reiteradamente hasta que vean el estado deseado, mientras que los hilos que modifiquen el estado llamarán a :meth:`~Condition.notify` o a :meth:`~Condition.notify_all` cuando cambien el estado de modo que pudiera ser que el el estado sea el deseado por alguno de los hilos en espera. Por ejemplo, el siguiente código es una situación genérica de productor-consumidor con capacidad de búfer ilimitada::

source: The ``while`` loop checking for the application's condition is necessary because :meth:`~Condition.wait` can return after an arbitrary long time, and the condition which prompted the :meth:`~Condition.notify` call may no longer hold true. This is inherent to multi-threaded programming. The :meth:`~Condition.wait_for` method can be used to automate the condition checking, and eases the computation of timeouts::
es: El bucle ``while`` que verifica la condición de la aplicación es necesario porque :meth:`~Condition.wait` puede retornar después de una cantidad arbitraria de tiempo, y la condición que dio pie a la llamada de :meth:`~Condition.notify` puede ya no ser verdadera. Esto es inherente a la programación multi-hilo. El método :meth:`~Condition.wait_for` puede usarse para automatizar la revisión de condiciones, y facilita la computación de tiempos de espera::

source: To choose between :meth:`~Condition.notify` and :meth:`~Condition.notify_all`, consider whether one state change can be interesting for only one or several waiting threads. E.g. in a typical producer-consumer situation, adding one item to the buffer only needs to wake up one consumer thread.
es: Para elegir entre :meth:`~Condition.notify` y :meth:`~Condition.notify_all`, considérese si un cambio de estado puede ser interesante para uno o varios hilos en espera. Por ejemplo en una típica situación productor-consumidor, agregar un elemento al búfer sólo necesita despertar un hilo consumidor.

source: This class implements condition variable objects. A condition variable allows one or more threads to wait until they are notified by another thread.
es: Esta clase implementa objetos de condición variable. Una condición variable permite que uno o más hilos esperen hasta que sean notificados por otro hilo.

source: If the *lock* argument is given and not ``None``, it must be a :class:`Lock` or :class:`RLock` object, and it is used as the underlying lock. Otherwise, a new :class:`RLock` object is created and used as the underlying lock.
es: Si se provee un argumento *lock* distinto de ``None``, debe ser un objeto :class:`Lock` o :class:`RLock`, y se utiliza como el *lock* subyacente. De otro modo, se crea un nuevo objeto :class:`RLock` y se utiliza como el *lock* subyacente.

source: changed from a factory function to a class.
es: cambiado de función de fábrica a una clase.

source: Acquire the underlying lock. This method calls the corresponding method on the underlying lock; the return value is whatever that method returns.
es: Adquiere el *lock* subyacente. Este método llama al método correspondiente sobre el *lock* subyacente; el valor de retorno es lo que retorne aquel método.

source: Release the underlying lock. This method calls the corresponding method on the underlying lock; there is no return value.
es: Libera el *lock* subyacente. Este método llama al método correspondiente en el *lock* subyacente; no tiene valor de retorno.

source: Wait until notified or until a timeout occurs. If the calling thread has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
es: Espera hasta ser notificado o hasta que el tiempo de espera caduque. Si el hilo invocador no ha adquirido el *lock* cuando este método es llamado, se lanza un :exc:`RuntimeError`.

source: This method releases the underlying lock, and then blocks until it is awakened by a :meth:`notify` or :meth:`notify_all` call for the same condition variable in another thread, or until the optional timeout occurs. Once awakened or timed out, it re-acquires the lock and returns.
es: Este método libera el *lock* subyacente, y luego bloquea hasta ser despertado por una llamada a :meth:`notify` o :meth:`notify_all` para la misma condición variable en otro hilo, o hasta que el tiempo de espera opcional se cumpla. Una vez que ha sido despertado o el tiempo de espera ha pasado, re-adquiere el *lock* y retorna.

source: When the *timeout* argument is present and not ``None``, it should be a floating point number specifying a timeout for the operation in seconds (or fractions thereof).
es: Cuando haya un argumento *timeout* presente y no sea ``None``, debe ser un número de punto flotante que especifique un tiempo de espera para la operación en segundos (o fracciones de segundo).

source: When the underlying lock is an :class:`RLock`, it is not released using its :meth:`release` method, since this may not actually unlock the lock when it was acquired multiple times recursively. Instead, an internal interface of the :class:`RLock` class is used, which really unlocks it even when it has been recursively acquired several times. Another internal interface is then used to restore the recursion level when the lock is reacquired.
es: Cuando el *lock* subyacente es un :class:`RLock`, no se libera utilizando su método :meth:`release`, ya que esto podría no abrir realmente el *lock* cuando haya sido adquirido múltiples veces recursivamente. En cambio, se usa una interfaz interna de la clase :class:`RLock`, que lo abre realmente incluso cuando haya sido adquirido múltiples veces recursivamente. Otra interfaz interna se usa luego para restablecer el nivel de recursividad cuando el *lock* es readquirido.

source: The return value is ``True`` unless a given *timeout* expired, in which case it is ``False``.
es: El valor de retorno es ``True`` a menos que un *timeout* dado haya expirado, en cuyo caso será ``False``.

source: Previously, the method always returned ``None``.
es: Previamente, el método siempre retornaba ``None``.

source: Wait until a condition evaluates to true. *predicate* should be a callable which result will be interpreted as a boolean value. A *timeout* may be provided giving the maximum time to wait.
es: Espera a que una condición se evalúe como verdadera. *predicate* debe ser un invocable cuyo resultado se interpretará como un valor booleano. Se puede proveer un *timeout* que especifique el máximo tiempo de espera.

source: This utility method may call :meth:`wait` repeatedly until the predicate is satisfied, or until a timeout occurs. The return value is the last return value of the predicate and will evaluate to ``False`` if the method timed out.
es: Este método utilitario puede llamar a :meth:`wait` reiteradas veces hasta que se satisfaga el predicado, o hasta que la espera caduque. El valor de retorno es el último valor de retorno del predicado y se evaluará a ``False`` si el método ha caducado.

source: Ignoring the timeout feature, calling this method is roughly equivalent to writing::
es: Al ignorar la propiedad *feature*, llamar a este método equivale vagamente a escribir::

source: Therefore, the same rules apply as with :meth:`wait`: The lock must be held when called and is re-acquired on return. The predicate is evaluated with the lock held.
es: Por ende, aplican las mismas reglas que con :meth:`wait`: El *lock* debe ser conservado cuando se llame y es re-adquirido al momento del retorno. El predicado se evalúa con el *lock* conservado.

source: By default, wake up one thread waiting on this condition, if any. If the calling thread has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
es: Por defecto, despierta a un hilo que esté esperando por esta condición, si lo existe. Si el hilo llamador no ha adquirido el *lock* cuando se llama este método, se lanza un :exc:`RuntimeError`.

source: This method wakes up at most *n* of the threads waiting for the condition variable; it is a no-op if no threads are waiting.
es: Este método despierta como máximo *n* de los hilos que estén esperando por la condición variable; no es una opción si no hay hilos esperando.

source: The current implementation wakes up exactly *n* threads, if at least *n* threads are waiting. However, it's not safe to rely on this behavior. A future, optimized implementation may occasionally wake up more than *n* threads.
es: La implementación actual despierta exactamente *n* hilos, si hay por lo menos *n* hilos esperando. Sin embargo, no es seguro apoyarse en este comportamiento. A futuro, una implementación optimizada podría ocasionalmente despertar a más de *n* hilos.

source: Note: an awakened thread does not actually return from its :meth:`wait` call until it can reacquire the lock. Since :meth:`notify` does not release the lock, its caller should.
es: Nota: un hilo que ha sido despertado no retorna realmente de su llamada a :meth:`wait` hasta que pueda readquirir el *lock*. Ya que :meth:`notify` no libera el *lock*, su llamador debiera hacerlo.

source: Wake up all threads waiting on this condition. This method acts like :meth:`notify`, but wakes up all waiting threads instead of one. If the calling thread has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
es: Despierta a todos los hilos que esperen por esta condición. Este método actúa como :meth:`notify`, pero despierta a todos los hilos en espera en vez de a uno. Si el hilo llamador no ha adquirido el *lock* cuando se llama a este método, se lanza un :exc:`RuntimeError`.

source: The method ``notifyAll`` is a deprecated alias for this method.
es: El método ``notifyAll`` es un alias obsoleto para este método.

source: Semaphore Objects
es: Objetos semáforo

source: This is one of the oldest synchronization primitives in the history of computer science, invented by the early Dutch computer scientist Edsger W. Dijkstra (he used the names ``P()`` and ``V()`` instead of :meth:`~Semaphore.acquire` and :meth:`~Semaphore.release`).
es: Éste es uno de las primitivas de sincronización más antiguos en la historia de las ciencias de la computación, inventado por el pionero en ciencias de la computación holandés Edsger W. Dijkstra (él utilizó los nombres ``P()`` y ``V()`` en lugar de :meth:`~Semaphore.acquire` y :meth:`~Semaphore.release`)

source: A semaphore manages an internal counter which is decremented by each :meth:`~Semaphore.acquire` call and incremented by each :meth:`~Semaphore.release` call. The counter can never go below zero; when :meth:`~Semaphore.acquire` finds that it is zero, it blocks, waiting until some other thread calls :meth:`~Semaphore.release`.
es: Un semáforo administra un contador interno que se disminuye por cada llamada a :meth:`~Semaphore.acquire` y se incrementa por cada llamada a :meth:`~Semaphore.release`. El contador no puede bajar de cero; cuando :meth:`~Semaphore.acquire` lo encuentra en cero, bloquea, esperando hasta que otro hilo llame :meth:`~Semaphore.release`.

source: Semaphores also support the :ref:`context management protocol <with-locks>`.
es: Los semáforos también tienen soporte para el :ref:`protocolo de gestión de contexto <with-locks>`.

source: This class implements semaphore objects. A semaphore manages an atomic counter representing the number of :meth:`release` calls minus the number of :meth:`acquire` calls, plus an initial value. The :meth:`acquire` method blocks if necessary until it can return without making the counter negative. If not given, *value* defaults to 1.
es: Esta clase implementa los objetos semáforo. Un semáforo gestiona un contador atómico que representa el número de llamadas a :meth:`release` menos el número de llamadas a :meth:`acquire`, más un valor inicial. El método :meth:`acquire` bloquea si es necesario, hasta que pueda retornar sin volver el contador negativo. Si no es provisto, el valor por defecto de *value* será 1.

source: The optional argument gives the initial *value* for the internal counter; it defaults to ``1``. If the *value* given is less than 0, :exc:`ValueError` is raised.
es: El argumento opcional da el *value* inicial al contador interno; por defecto es ``1``. Si el *value* provisto es menor a 0; se lanza un :exc:`ValueError`.

source: Acquire a semaphore.
es: Adquirir un semáforo.

source: When invoked without arguments:
es: Cuando se invoca sin argumentos:

source: If the internal counter is larger than zero on entry, decrement it by one and return ``True`` immediately.
es: Si el contador interno es mayor a cero de entrada, lo disminuye en uno y retorna ``True`` inmediatamente.

source: If the internal counter is zero on entry, block until awoken by a call to :meth:`~Semaphore.release`. Once awoken (and the counter is greater than 0), decrement the counter by 1 and return ``True``. Exactly one thread will be awoken by each call to :meth:`~Semaphore.release`. The order in which threads are awoken should not be relied on.
es: Si el contador interno es cero de entrada, bloquea hasta ser despertado por una llamada a :meth:`~Semaphore.release`. Una vez despierto (y el contador sea mayor a 0), disminuye el contador en 1 y retorna ``True``. Se despertará exactamente un hilo por cada llamada a :meth:`~Semaphore.release`. No debiese confiarse en el orden en que los hilos sean despertados.

source: When invoked with *blocking* set to ``False``, do not block. If a call without an argument would block, return ``False`` immediately; otherwise, do the same thing as when called without arguments, and return ``True``.
es: Cuando se invoca con *blocking* fijado en ``False``, no bloquea. Si una llamada sin un argumento bloquease, retorna ``False`` inmediatamente; de otro modo, hace lo mismo que cuando se llama sin argumentos, y retorna ``True``.

source: When invoked with a *timeout* other than ``None``, it will block for at most *timeout* seconds. If acquire does not complete successfully in that interval, return ``False``. Return ``True`` otherwise.
es: Cuando se invoca con *timeout* distinto de ``None``, bloqueará por un tiempo máximo en segundos fijados en *timeout*. Si *acquire* no se completa exitosamente en ese intervalo, retorna ``False``. De otro modo retorna ``True``.

source: Release a semaphore, incrementing the internal counter by *n*. When it was zero on entry and other threads are waiting for it to become larger than zero again, wake up *n* of those threads.
es: Suelta un semáforo, incrementando el contador interno por *n*. Cuando era cero en la entrada y otros subprocesos están esperando que vuelva a ser mayor que cero, active *n* de esos subprocesos.

source: Added the *n* parameter to release multiple waiting threads at once.
es: Se agregó el parámetro *n* para liberar varios subprocesos en espera a la vez.

source: Class implementing bounded semaphore objects. A bounded semaphore checks to make sure its current value doesn't exceed its initial value. If it does, :exc:`ValueError` is raised. In most situations semaphores are used to guard resources with limited capacity. If the semaphore is released too many times it's a sign of a bug. If not given, *value* defaults to 1.
es: Clase que implementa objetos de semáforo delimitados. Un semáforo delimitado verifica que su valor actual no exceda su valor inicial. Si lo hace, se lanza un :exc:`ValueError`. En la mayoría de las situaciones se utilizan los semáforos para cuidar recursos con capacidad limitada. Si se libera el semáforo demasiadas veces es signo de un *bug*. Si no se provee, el valor por defecto de *value* será 1.

source: :class:`Semaphore` Example
es: Ejemplo de :class:`Semaphore`

source: Semaphores are often used to guard resources with limited capacity, for example, a database server. In any situation where the size of the resource is fixed, you should use a bounded semaphore. Before spawning any worker threads, your main thread would initialize the semaphore::
es: Los semáforos suelen utilizarse para cuidar recursos con capacidad limitada, por ejemplo, un servidor de base de datos. En cualquier situación en que el tamaño de los recursos sea fijo, se debe usar un semáforo delimitado. Antes de generar cualquier hilo de trabajo, tu hilo principal debe inicializar el semáforo::

source: Once spawned, worker threads call the semaphore's acquire and release methods when they need to connect to the server::
es: Una vez que han sido generados, los hilos de trabajo llaman a los métodos *acquire* y *release* cuando necesitan conectarse al servidor::

source: The use of a bounded semaphore reduces the chance that a programming error which causes the semaphore to be released more than it's acquired will go undetected.
es: El uso de semáforos delimitados reduce la posibilidad de que pase inadvertido un error de programación que cause que el semáforo sea liberado más veces de las que sea adquirido.

source: Event Objects
es: Objetos de eventos

source: This is one of the simplest mechanisms for communication between threads: one thread signals an event and other threads wait for it.
es: Éste es uno de los mecanismos más simples de comunicación entre hilos: un hilo señala un evento y otro hilo lo espera.

source: An event object manages an internal flag that can be set to true with the :meth:`~Event.set` method and reset to false with the :meth:`~Event.clear` method. The :meth:`~Event.wait` method blocks until the flag is true.
es: Un objeto de evento maneja una marca interna que puede ser establecida como verdadera mediante el método :meth:`~Event.set` y restablecida a falsa mediante el método :meth:`~Meth.clear`. El método :meth:`~Meth.wait` bloquea hasta que la marca sea *true*.

source: Class implementing event objects. An event manages a flag that can be set to true with the :meth:`~Event.set` method and reset to false with the :meth:`clear` method. The :meth:`wait` method blocks until the flag is true. The flag is initially false.
es: Clase que implementa los objetos de evento. Un evento gestiona un indicador que puede ser establecido a verdadero mediante el método :meth:`~Event.set` y restablecido a falso con el método :meth:`clear`. El método :meth:`wait` bloquea hasta que el indicador sea verdadero. El indicador es inicialmente falso.

source: Return ``True`` if and only if the internal flag is true.
es: Retorna ``True`` exclusivamente si el indicador interno es verdadero.

source: The method ``isSet`` is a deprecated alias for this method.
es: El método ``isSet`` es un alias obsoleto para este método.

source: Set the internal flag to true. All threads waiting for it to become true are awakened. Threads that call :meth:`wait` once the flag is true will not block at all.
es: Establece el indicador interno a verdadero. Todos los hilos que estén esperando que se vuelva verdadero serán despertados. Los hilos que llaman a :meth:`wait` una vez que el indicador marca verdadero no bloquearán.

source: Reset the internal flag to false. Subsequently, threads calling :meth:`wait` will block until :meth:`.set` is called to set the internal flag to true again.
es: Restablece el indicador a falso. Posteriormente, los hilos que llamen a :meth:`wait` bloquearán hasta que se llame a :meth:`set` para establecer el indicador interno a verdadero nuevamente.

source: Block until the internal flag is true. If the internal flag is true on entry, return immediately. Otherwise, block until another thread calls :meth:`.set` to set the flag to true, or until the optional timeout occurs.
es: Bloquea hasta que el indicador interno sea verdadero. Si el indicador interno es verdadero de entrada, retorna inmediatamente. De otro modo, bloquea hasta que otro hilo llame a :meth:`.set` para establecer el indicador a verdadero, o hasta que el tiempo de espera opcional caduque.

source: When the timeout argument is present and not ``None``, it should be a floating point number specifying a timeout for the operation in seconds (or fractions thereof).
es: Cuando se presenta un argumento para el tiempo de espera *timeout* distinto de ``None``, debe ser un número de punto flotante que especifique un tiempo de espera para la operación en segundos (o fracciones en su defecto).
