Repository: python/python-docs-es
Catalog: library/threading.po
Languages: es

source: *target* is the callable object to be invoked by the :meth:`run` method. Defaults to ``None``, meaning nothing is called.
es: *target* es el objeto invocable a ser invocado por el método :meth:`run`. Por defecto es ``None``, lo que significa que nada es llamado.

source: *name* is the thread name. By default, a unique name is constructed of the form "Thread-*N*" where *N* is a small decimal number, or "Thread-*N* (target)" where "target" is ``target.__name__`` if the *target* argument is specified.
es: *name* es el nombre del hilo. De forma predeterminada, se construye un nombre único con el formato "Hilo-*N*", donde *N* es un número decimal pequeño, o "Hilo-*N* (target)" donde "target" es ``target.__name__`` si se especifica el argumento *target*.

source: *args* is a list or tuple of arguments for the target invocation. Defaults to ``()``.
es: *args* es una lista o tupla de argumentos para la invocación de destino. Por defecto es ``()``.

source: *kwargs* is a dictionary of keyword arguments for the target invocation. Defaults to ``{}``.
es: *kwargs* es un diccionario de argumentos de palabra clave para la invocación objetivo. Por defecto es ``{}``.

source: If not ``None``, *daemon* explicitly sets whether the thread is daemonic. If ``None`` (the default), the daemonic property is inherited from the current thread.
es: Si no es ``None``, *daemon* establece explícitamente si el hilo es demoníaco. Si es ``None`` (el valor por defecto), la propiedad demoníaca es heredada del hilo actual.

source: If the subclass overrides the constructor, it must make sure to invoke the base class constructor (``Thread.__init__()``) before doing anything else to the thread.
es: Si la subclase sobrescribe el constructor, debe asegurarse de invocar al constructor de la clase base (``Thread.__init__()``) antes de hacer cualquier otra cosa al hilo.

source: Use the *target* name if *name* argument is omitted.
es: Utilice el nombre *target* si se omite el argumento *name*.

source: Added the *daemon* argument.
es: Se agregó el argumento *daemon*.

source: Start the thread's activity.
es: Inicia la actividad del hilo.

source: It must be called at most once per thread object. It arranges for the object's :meth:`~Thread.run` method to be invoked in a separate thread of control.
es: Debe ser llamada máximo una vez por objeto hilo. Se encarga de que el método :meth:`~Thread.run` del objeto sea invocado en un hilo de control separado.

source: This method will raise a :exc:`RuntimeError` if called more than once on the same thread object.
es: Este método lanzará un :exc:`RuntimeError` si se llama más de una vez en el mismo objeto hilo.

source: Method representing the thread's activity.
es: Método que representa la actividad del hilo.

source: You may override this method in a subclass. The standard :meth:`run` method invokes the callable object passed to the object's constructor as the *target* argument, if any, with positional and keyword arguments taken from the *args* and *kwargs* arguments, respectively.
es: Se puede sobrescribir este método en una subclase. El método estándar :meth:`run` invoca el objeto invocable pasado al constructor del objeto como argumento *target*, si lo hay, con argumentos posicionales y de palabra clave tomados de los argumentos *args* y *kwargs*, respectivamente.

source: Using list or tuple as the *args* argument which passed to the :class:`Thread` could achieve the same effect.
es: Usar una lista o tupla como el argumento *args* que se pasa a :class:`Thread` podría lograr el mismo efecto.

source: Example::
es: Ejemplo::

source: Wait until the thread terminates. This blocks the calling thread until the thread whose :meth:`~Thread.join` method is called terminates -- either normally or through an unhandled exception -- or until the optional timeout occurs.
es: Espera a que el hilo termine. Esto bloquea el hilo llamador hasta que el hilo cuyo método :meth:`~Thread.join` es llamado finalice -- ya sea normalmente o a través de una excepción no gestionada -- o hasta que el tiempo de espera opcional caduque.

source: When the *timeout* argument is present and not ``None``, it should be a floating point number specifying a timeout for the operation in seconds (or fractions thereof). As :meth:`~Thread.join` always returns ``None``, you must call :meth:`~Thread.is_alive` after :meth:`~Thread.join` to decide whether a timeout happened -- if the thread is still alive, the :meth:`~Thread.join` call timed out.
es: Cuando se presenta un argumento *timeout* y no es ``None``, debe ser un número de punto flotante que especifique un tiempo de espera en segundos (o en fracciones de segundo) para la operación . Ya que :meth:`~Thread.join` siempre retorna ``None``, se debe llamar a :meth:`~Thread.is_alive` después de :meth:`~Thread.join` para decidir si acaso caducó el tiempo de espera -- si el hilo todavía está vivo, la llamada a :meth:`~Thread.join` caducó.

source: When the *timeout* argument is not present or ``None``, the operation will block until the thread terminates.
es: Cuando el argumento *timeout* no se presenta o es ``None``, la operación bloqueará hasta que el hilo termine.

source: A thread can be joined many times.
es: Un hilo puede unirse varias veces.

source: :meth:`~Thread.join` raises a :exc:`RuntimeError` if an attempt is made to join the current thread as that would cause a deadlock. It is also an error to :meth:`~Thread.join` a thread before it has been started and attempts to do so raise the same exception.
es: :meth:`~Thread.join` lanza un :exc:`RuntimeError` si se intenta unir el hilo actual ya que ello generaría un punto muerto. También es un error aplicar :meth:`~Thread.join` a un hilo antes de que haya sido iniciado y los intentos de hacerlo lanzaran la misma excepción.

source: A string used for identification purposes only. It has no semantics. Multiple threads may be given the same name. The initial name is set by the constructor.
es: Un *string* utilizado con propósitos de identificación. No posee semántica. Se puede dar el mismo nombre a múltiples hilos. El nombre inicial es establecido por el constructor.

source: Deprecated getter/setter API for :attr:`~Thread.name`; use it directly as a property instead.
es: API getter/setter obsoleta para :attr:`~Thread.name`; utilícelo directamente como una propiedad en su lugar.

source: The 'thread identifier' of this thread or ``None`` if the thread has not been started. This is a nonzero integer. See the :func:`get_ident` function. Thread identifiers may be recycled when a thread exits and another thread is created. The identifier is available even after the thread has exited.
es: El 'identificador de hilo' de este hilo o ``None`` si el hilo no ha sido iniciado. Es un entero distinto de cero. Ver la función :func:`get_ident`. Los identificadores de hilos pueden ser reciclados cuando un hilo finaliza y otro hilo es creado. El identificador está disponible incuso después de que el hilo ha abandonado.

source: The Thread ID (``TID``) of this thread, as assigned by the OS (kernel). This is a non-negative integer, or ``None`` if the thread has not been started. See the :func:`get_native_id` function. This value may be used to uniquely identify this particular thread system-wide (until the thread terminates, after which the value may be recycled by the OS).
es: El ID de subproceso (``TID``) de este subproceso, según lo asignado por el sistema operativo (kernel). Este es un número entero no negativo, o ``None`` si el hilo no se ha iniciado. Consulte la función :func:`get_native_id`. Este valor se puede usar para identificar de forma única este hilo en particular en todo el sistema (hasta que el hilo termine, después de lo cual el sistema operativo puede reciclar el valor).

source: Similar to Process IDs, Thread IDs are only valid (guaranteed unique system-wide) from the time the thread is created until the thread has been terminated.
es: Similar a las *Process IDs*, las *Thread IDs* sólo son válidas (garantizadas como únicas a través de todo el sistema) desde el momento en que se crea el hilo hasta que el hilo es finalizado.

source: Return whether the thread is alive.
es: Retornar si acaso el hilo está vivo.

source: This method returns ``True`` just before the :meth:`~Thread.run` method starts until just after the :meth:`~Thread.run` method terminates. The module function :func:`.enumerate` returns a list of all alive threads.
es: Este método retorna ``True`` desde justo antes de que el método :meth:`~Thread.run` inicie hasta junto antes de que el método :meth:`~Thread.run` termine. La función :func:`.enumerate` del módulo retorna una lista de todos los hilos vivos.

source: A boolean value indicating whether this thread is a daemon thread (``True``) or not (``False``). This must be set before :meth:`~Thread.start` is called, otherwise :exc:`RuntimeError` is raised. Its initial value is inherited from the creating thread; the main thread is not a daemon thread and therefore all threads created in the main thread default to :attr:`~Thread.daemon` = ``False``.
es: Un valor booleano que indica si este hilo es un hilo demonio (*True*) o no (*False*). Debe ser establecido antes de que se llame a :meth:`~Thread.start`, de lo contrario se lanzará un :exc:`RuntimeError`. Su valor inicial se hereda del hilo creador; el hilo principal no es un hilo demonio y por lo tanto todos los hilos creados en el hilo principal tienen por defecto un valor :attr:`~Thread.daemon` = ``False``.

source: The entire Python program exits when no alive non-daemon threads are left.
es: El programa de Python en su totalidad finaliza cuando no queda ningún hilo no-demonio vivo.

source: Deprecated getter/setter API for :attr:`~Thread.daemon`; use it directly as a property instead.
es: API getter/setter obsoleta para :attr:`~Thread.daemon`; utilícelo directamente como una propiedad en su lugar.

source: Lock Objects
es: Objetos tipo *lock*

source: A primitive lock is a synchronization primitive that is not owned by a particular thread when locked. In Python, it is currently the lowest level synchronization primitive available, implemented directly by the :mod:`_thread` extension module.
es: Una primitiva *lock*, es una primitiva de sincronización que no pertenece a ningún hilo en particular cuando está cerrado. En Python, es la primitiva de sincronización de más bajo nivel actualmente disponible, implementado directamente por el módulo de extensión :mod:`_thread`.

source: A primitive lock is in one of two states, "locked" or "unlocked". It is created in the unlocked state. It has two basic methods, :meth:`~Lock.acquire` and :meth:`~Lock.release`. When the state is unlocked, :meth:`~Lock.acquire` changes the state to locked and returns immediately. When the state is locked, :meth:`~Lock.acquire` blocks until a call to :meth:`~Lock.release` in another thread changes it to unlocked, then the :meth:`~Lock.acquire` call resets it to locked and returns. The :meth:`~Lock.release` method should only be called in the locked state; it changes the state to unlocked and returns immediately. If an attempt is made to release an unlocked lock, a :exc:`RuntimeError` will be raised.
es: Una primitiva *lock* está en uno de dos estados, "cerrado" o "abierto" (*locked*/*unlocked*). Se crea en estado abierto. Tiene dos métodos básicos, :meth:`~Lock.acquire` (adquirir) y :meth:`~Lock.release` (liberar). Cuando el estado es *abierto*, :meth:`~Lock.acquire` cambia el estado a cerrado y retorna inmediatamente. Cuando el estado es *cerrado*, :meth:`~Lock.acquire` bloquea hasta que una llamada a :meth:`~Lock.release` en otro hilo lo cambie a abierto, luego la llamada a :meth:`~Lock.acquire` lo restablece a cerrado y retorna. El método :meth:`~Lock.release` sólo debe ser llamado en el estado cerrado; cambia el estado a abierto y retorna inmediatamente. Si se realiza un intento de liberar un *lock* abierto, se lanzará un :exc:`RuntimeError`.

source: Locks also support the :ref:`context management protocol <with-locks>`.
es: Los *locks* también soportan el :ref:`protocolo de gestión de contexto <with-locks>`.

source: When more than one thread is blocked in :meth:`~Lock.acquire` waiting for the state to turn to unlocked, only one thread proceeds when a :meth:`~Lock.release` call resets the state to unlocked; which one of the waiting threads proceeds is not defined, and may vary across implementations.
es: Cuando más de un hilo está bloqueado en :meth:`~Lock.acquire` esperando que el estado sea abierto, sólo un hilo procederá cuando una llamada a :meth:`~Lock.release` restablezca el estado a abierto; cuál de los hilos en espera procederá no está definido, y puede variar a través de las implementaciones.

source: All methods are executed atomically.
es: Todos los métodos se ejecutan de manera atómica.

source: The class implementing primitive lock objects. Once a thread has acquired a lock, subsequent attempts to acquire it block, until it is released; any thread may release it.
es: La clase que implemente los objetos de la primitiva *lock*. Una vez que un hilo ha adquirido un *lock*, intentos subsecuentes por adquirirlo bloquearán, hasta que sea liberado; cualquier hilo puede liberarlo.

source: Note that ``Lock`` is actually a factory function which returns an instance of the most efficient version of the concrete Lock class that is supported by the platform.
es: Nótese que ``Lock`` es una función de fábrica que retorna una instancia de la versión más eficiente de la clase *Lock* concreta soportada por la plataforma.

source: Acquire a lock, blocking or non-blocking.
es: Adquirir un *lock*, bloqueante o no bloqueante.

source: When invoked with the *blocking* argument set to ``True`` (the default), block until the lock is unlocked, then set it to locked and return ``True``.
es: Cuando se invoca con el argumento *blocking* establecido como ``True`` (el valor por defecto), bloquea hasta que el *lock* se abra, luego lo establece como cerrado y retorna ``True``.

source: When invoked with the *blocking* argument set to ``False``, do not block. If a call with *blocking* set to ``True`` would block, return ``False`` immediately; otherwise, set the lock to locked and return ``True``.
es: Cuando es invocado con el argumento *blocking* como ``False``, no bloquea. Si una llamada con *blocking* establecido como ``True`` bloqueara, retorna ``Falso`` inmediatamente; de otro modo, cierra el *lock* y retorna ``True``.

source: When invoked with the floating-point *timeout* argument set to a positive value, block for at most the number of seconds specified by *timeout* and as long as the lock cannot be acquired. A *timeout* argument of ``-1`` specifies an unbounded wait. It is forbidden to specify a *timeout* when *blocking* is ``False``.
es: Cuando se invoca con el argumento de punto flotante *timeout* fijado a un valor positivo, bloquea por a lo más el número de segundos especificado en *timeout* y mientras el *lock* no pueda ser adquirido. Un argumento *timeout* de "-1" especifica una espera ilimitada. No está admitido especificar un *timeout* cuando *blocking* es ``False``.

source: The return value is ``True`` if the lock is acquired successfully, ``False`` if not (for example if the *timeout* expired).
es: El valor de retorno es ``True`` si el *lock* es adquirido con éxito, ``Falso`` si no (por ejemplo si *timeout* expiró).

source: The *timeout* parameter is new.
es: El parámetro *timeout* es nuevo.

source: Lock acquisition can now be interrupted by signals on POSIX if the underlying threading implementation supports it.
es: La adquisición de un *lock* ahora puede ser interrumpida por señales en POSIX si la implementación de hilado subyacente lo soporta.

source: Release a lock. This can be called from any thread, not only the thread which has acquired the lock.
es: Libera un *lock*. Puede ser llamado desde cualquier hilo, no solo el hilo que ha adquirido el *lock*.

source: When the lock is locked, reset it to unlocked, and return. If any other threads are blocked waiting for the lock to become unlocked, allow exactly one of them to proceed.
es: Cuando el *lock* está cerrado, lo restablece a abierto, y retorna. Si cualquier otro hilo está bloqueado esperando que el *lock* se abra, permite que exactamente uno de ellos proceda.

source: When invoked on an unlocked lock, a :exc:`RuntimeError` is raised.
es: Cuando se invoca en un *lock* abierto, se lanza un :exc:`RuntimeError`.

source: There is no return value.
es: No hay valor de retorno.

source: Return ``True`` if the lock is acquired.
es: Retorna ``True`` si se adquiere el bloqueo.

source: RLock Objects
es: Objetos *Rlock*

source: A reentrant lock is a synchronization primitive that may be acquired multiple times by the same thread. Internally, it uses the concepts of "owning thread" and "recursion level" in addition to the locked/unlocked state used by primitive locks. In the locked state, some thread owns the lock; in the unlocked state, no thread owns it.
es: Un *lock* reentrante es una primitiva de sincronización que puede ser adquirido múltiples veces por el mismo hilo. Internamente, utiliza el concepto de "hilo dueño" y "nivel de recursividad" además del estado abierto/cerrado utilizado por las primitivas *locks*. Si está en estado cerrado, algún hilo es dueño del *lock*; si está en estado abierto, ningún hilo es dueño.

source: To lock the lock, a thread calls its :meth:`~RLock.acquire` method; this returns once the thread owns the lock. To unlock the lock, a thread calls its :meth:`~Lock.release` method. :meth:`~Lock.acquire`/:meth:`~Lock.release` call pairs may be nested; only the final :meth:`~Lock.release` (the :meth:`~Lock.release` of the outermost pair) resets the lock to unlocked and allows another thread blocked in :meth:`~Lock.acquire` to proceed.
es: Para cerrar el *lock*, un hilo llama a su método :meth:`~RLock.acquire`; esto retorna una vez que el hilo se ha adueñado del *lock*. Para abrir el *lock*, un hilo llama a su método :meth:`~Lock.release`. Pares de llamadas :meth:`~Lock.acquire`/:meth:`~Lock.release` pueden anidarse; sólo el :meth:`~Lock.release` final (el :meth:`~Lock.release` del par más externo) restablece el *lock* a abierto y permite que otro hilo bloqueado en :meth:`~Lock.acquire` proceda.

source: Reentrant locks also support the :ref:`context management protocol <with-locks>`.
es: Los *locks* reentrantes también soportan el :ref:`protocolo de manejo de contextos <with-locks>`.

source: This class implements reentrant lock objects. A reentrant lock must be released by the thread that acquired it. Once a thread has acquired a reentrant lock, the same thread may acquire it again without blocking; the thread must release it once for each time it has acquired it.
es: Esta clase implementa objetos tipo *lock* reentrantes. Un *lock* reentrante debe ser liberado por el hilo que lo adquirió. Una vez que un hilo ha adquirido un *lock* reentrante, el mismo hilo puede adquirirlo otra vez sin bloquearse; el hilo debe liberarlo una vez por vez que lo adquiere.

source: Note that ``RLock`` is actually a factory function which returns an instance of the most efficient version of the concrete RLock class that is supported by the platform.
es: Nótese que ``RLock`` en realidad es una función fábrica que retorna una instancia de la versión más eficiente de la clase RLock concreta que sea soportada por la plataforma.

source: When invoked without arguments: if this thread already owns the lock, increment the recursion level by one, and return immediately. Otherwise, if another thread owns the lock, block until the lock is unlocked. Once the lock is unlocked (not owned by any thread), then grab ownership, set the recursion level to one, and return. If more than one thread is blocked waiting until the lock is unlocked, only one at a time will be able to grab ownership of the lock. There is no return value in this case.
es: Cuando se invoca sin argumentos: si este subproceso ya posee el bloqueo, incrementa el nivel de recursión en uno y devuelve inmediatamente. En caso contrario, si el bloqueo pertenece a otro subproceso, se bloquea hasta que se desbloquea el bloqueo. Una vez que se desbloquea el bloqueo (no es propiedad de ningún hilo), se toma la propiedad, se establece el nivel de recursividad en uno y se devuelve. Si hay más de un proceso bloqueado esperando a que se desbloquee el bloqueo, sólo uno a la vez podrá hacerse con la propiedad del bloqueo. En este caso no hay valor de retorno.

source: When invoked with the *blocking* argument set to ``True``, do the same thing as when called without arguments, and return ``True``.
es: Cuando se invoca con el argumento *blocking* fijado en ``True``, hace lo mismo que cuando se llama sin argumentos y retorna ``True``.

source: When invoked with the *blocking* argument set to ``False``, do not block. If a call without an argument would block, return ``False`` immediately; otherwise, do the same thing as when called without arguments, and return ``True``.
es: Cuando se invoca con el argumento *blocking* fijado a ``False``, no bloquea. Si una llamada sin argumento bloquease, retorna ``False`` inmediatamente; de otro modo, hace lo mismo que al llamarse sin argumentos, y retorna ``True``.

source: When invoked with the floating-point *timeout* argument set to a positive value, block for at most the number of seconds specified by *timeout* and as long as the lock cannot be acquired. Return ``True`` if the lock has been acquired, ``False`` if the timeout has elapsed.
es: Cuando se invoca con el argumento de coma flotante *timeout* fijado a un valor positivo, bloquea por máximo el número de segundos especificado por *timeout* y mientras el lock no pueda ser adquirido. Retorna ``True`` si el lock ha sido adquirido, ``False`` si el tiempo de espera ha caducado.

source: Release a lock, decrementing the recursion level. If after the decrement it is zero, reset the lock to unlocked (not owned by any thread), and if any other threads are blocked waiting for the lock to become unlocked, allow exactly one of them to proceed. If after the decrement the recursion level is still nonzero, the lock remains locked and owned by the calling thread.
es: Libera un *lock*, disminuyendo el nivel de recursividad. Si después de la disminución es cero, restablece el *lock* a abierto (no perteneciente a ningún hilo), y si cualquier otro hilo está bloqueado esperando que se abra el *lock*, permite que exactamente uno de ellos proceda. Si luego de la disminución el nivel de recursividad todavía no es cero, el *lock* permanece cerrado y perteneciente al hilo llamador.

source: Only call this method when the calling thread owns the lock. A :exc:`RuntimeError` is raised if this method is called when the lock is unlocked.
es: Solo llámese este método cuando el hilo llamador sea dueño del *lock*. Se lanza un :exc:`RuntimeError` si se llama este método cuando el *lock* esta abierto.

source: Condition Objects
es: Objetos condicionales

source: A condition variable is always associated with some kind of lock; this can be passed in or one will be created by default. Passing one in is useful when several condition variables must share the same lock. The lock is part of the condition object: you don't have to track it separately.
es: Una condición variable siempre va asociada a algún tipo de *lock*. éste puede ser provisto o se creará uno por defecto. Proveer uno es útil cuando varias variables de condición deben compartir el mismo *lock*. El *lock* es parte del objeto condicional: no es necesario rastrearlo por separado.
