Repository: python/python-docs-es
Catalog: library/threading.po
Languages: es

source: This method returns ``True`` if and only if the internal flag has been set to true, either before the wait call or after the wait starts, so it will always return ``True`` except if a timeout is given and the operation times out.
es: Este método retorna ``True`` exclusivamente si el indicador interno ha sido establecido a verdadero, ya sea antes de la llamada a la espera o después de que la espera inicie, por lo que siempre retorna ``True`` excepto si se provee un tiempo de espera máximo y la operación caduca.

source: Timer Objects
es: Objetos temporizadores

source: This class represents an action that should be run only after a certain amount of time has passed --- a timer. :class:`Timer` is a subclass of :class:`Thread` and as such also functions as an example of creating custom threads.
es: Esta clase representa una acción que sólo debe ejecutarse luego de que una cierta cantidad de tiempo transcurra --- un temporizador. :class:`Timer` es una subclase de :class:`Thread` y en tanto tal también funciona como un ejemplo de creación de hilos personalizados.

source: Timers are started, as with threads, by calling their :meth:`Timer.start <Thread.start>` method. The timer can be stopped (before its action has begun) by calling the :meth:`~Timer.cancel` method. The interval the timer will wait before executing its action may not be exactly the same as the interval specified by the user.
es: Los temporizadores son iniciados, tal como los hilos, al llamarse su método :meth:`Timer.start <Thread.start>`. El temporizador puede ser detenido (antes de que su acción haya comenzado) al llamar al método :meth:`~Timer.cancel`. El intervalo que el temporizador esperará antes de ejecutar su acción puede no ser exactamente el mismo que el intervalo especificado por el usuario.

source: For example::
es: Por ejemplo:

source: Create a timer that will run *function* with arguments *args* and keyword arguments *kwargs*, after *interval* seconds have passed. If *args* is ``None`` (the default) then an empty list will be used. If *kwargs* is ``None`` (the default) then an empty dict will be used.
es: Crear un temporizador que ejecutará *function* con los argumentos *args* y los argumentos de palabra clave *kwargs*, luego de que una cantidad *interval* de segundos hayan transcurrido. Si *args* es ``None`` (por defecto) se utilizará una lista vacía. Si *kwargs* es ``None`` (por defecto) se utilizará un *dict* vacío.

source: Stop the timer, and cancel the execution of the timer's action. This will only work if the timer is still in its waiting stage.
es: Detiene el temporizador, y cancela la ejecución de la acción del temporizador. Esto sólo funcionará si el temporizador está en etapa de espera.

source: Barrier Objects
es: Objetos de barrera

source: This class provides a simple synchronization primitive for use by a fixed number of threads that need to wait for each other. Each of the threads tries to pass the barrier by calling the :meth:`~Barrier.wait` method and will block until all of the threads have made their :meth:`~Barrier.wait` calls. At this point, the threads are released simultaneously.
es: Esta clase provee una primitiva de sincronización simple para ser usado por un número fijo de hilos que necesitan esperarse entre ellos. Cada uno de los hilos intenta pasar la barrera llamando al método :meth:`~Barrier.wait` y bloqueará hasta que todos los hilos hayan hecho sus respectivas llamadas a :meth:`~Barrier.wait`. En este punto, los hilos son liberados simultáneamente.

source: The barrier can be reused any number of times for the same number of threads.
es: La barrera puede ser reutilizada cualquier número de veces para el mismo número de hilos.

source: As an example, here is a simple way to synchronize a client and server thread::
es: Como ejemplo, aquí hay una manera simple de sincronizar un hilo cliente con uno servidor::

source: Create a barrier object for *parties* number of threads. An *action*, when provided, is a callable to be called by one of the threads when they are released. *timeout* is the default timeout value if none is specified for the :meth:`wait` method.
es: Crear un objeto de barrera para un número *parties* de hilos. Una *action*, si es provista, es un invocable a ser llamado por uno de los hilos cuando sean liberados. *timeout* es el valor de tiempo de espera máximo por defecto si no se especifica uno en el método :meth:`wait`.

source: Pass the barrier. When all the threads party to the barrier have called this function, they are all released simultaneously. If a *timeout* is provided, it is used in preference to any that was supplied to the class constructor.
es: Pasa la barrera. Cuando todos los hilos involucrados en el objeto barrera han llamado esta función, se liberan todos simultáneamente. Si se provee un valor *timeout*, se utilizará con preferencia sobre cualquiera que haya sido suministrado al constructor de la clase.

source: The return value is an integer in the range 0 to *parties* -- 1, different for each thread. This can be used to select a thread to do some special housekeeping, e.g.::
es: El valor de retorno es un entero en el rango desde 0 hasta *parties* -- 1, diferente para cada hilo. Puede ser utilizado para seleccionar a un hilo para que haga alguna limpieza especial, por ejemplo::

source: If an *action* was provided to the constructor, one of the threads will have called it prior to being released. Should this call raise an error, the barrier is put into the broken state.
es: Se se provee una *action* al constructor, uno de los hilos la habrá llamado antes de ser liberado. Si acaso esta llamada lanzara un error, la barrera entra en estado *broken* (roto).

source: If the call times out, the barrier is put into the broken state.
es: Si se agota el tiempo de llamada, la barrera pasa al estado roto.

source: This method may raise a :class:`BrokenBarrierError` exception if the barrier is broken or reset while a thread is waiting.
es: Este método podría lanzar una excepción :class:`BrokenBarrierError` si la barrera está rota o si se reinicia mientras el hilo está esperando.

source: Return the barrier to the default, empty state. Any threads waiting on it will receive the :class:`BrokenBarrierError` exception.
es: Retorna la barrera al estado por defecto, vacío. Cualquier hilo que esté a su espera recibirá la excepción :class:`BrokenBarrierError`.

source: Note that using this function may require some external synchronization if there are other threads whose state is unknown. If a barrier is broken it may be better to just leave it and create a new one.
es: Nótese que utilizar esta función podría requerir alguna sincronización externa si existen otros hilos cuyos estados sean desconocidos. Si una barrera se rompe puede ser mejor abandonarla y crear una nueva.

source: Put the barrier into a broken state. This causes any active or future calls to :meth:`wait` to fail with the :class:`BrokenBarrierError`. Use this for example if one of the threads needs to abort, to avoid deadlocking the application.
es: Coloca la barrera en estado roto. Esto causa que cualquier llamada activa o futura a :meth:`wait` falle con el error :class:`BrokenBarrierError`. Úsese por ejemplo si uno de los hilos necesita abortar, para evitar que la aplicación quede en punto muerto.

source: It may be preferable to simply create the barrier with a sensible *timeout* value to automatically guard against one of the threads going awry.
es: Puede ser preferible simplemente crear la barrera con un valor *timeout* sensato para cuidarse automáticamente de que uno de los hilos falle.

source: The number of threads required to pass the barrier.
es: El número de hilos requeridos para pasar la barrera.

source: The number of threads currently waiting in the barrier.
es: El número de hilos actualmente esperando en la barrera.

source: A boolean that is ``True`` if the barrier is in the broken state.
es: Un valor booleano que será ``True`` si la barrera está en el estado roto.

source: This exception, a subclass of :exc:`RuntimeError`, is raised when the :class:`Barrier` object is reset or broken.
es: Esta excepción, una subclase de :exc:`RuntimeError`, se lanza cuando el objeto :class:`Barrier` se restablece o se rompe.

source: Using locks, conditions, and semaphores in the :keyword:`!with` statement
es: Uso de *locks*, condiciones y semáforos en la declaración :keyword:`!with`

source: All of the objects provided by this module that have ``acquire`` and ``release`` methods can be used as context managers for a :keyword:`with` statement. The ``acquire`` method will be called when the block is entered, and ``release`` will be called when the block is exited. Hence, the following snippet::
es: Todos los objetos provistos por este módulo que tienen métodos ``acquire`` y ``release`` pueden ser utilizados como administradores de contexto para una declaración :keyword:`with`. El método ``acquire`` será llamado cuando se ingresa al bloque y el método ``release`` será llamado cuando se abandona el bloque. De ahí que, el siguiente fragmento::

source: is equivalent to::
es: sea equivalente a::

source: Currently, :class:`Lock`, :class:`RLock`, :class:`Condition`, :class:`Semaphore`, and :class:`BoundedSemaphore` objects may be used as :keyword:`with` statement context managers.
es: Actualmente, los objetos :class:`Lock`, :class:`RLock`, :class:`Condition`, :class:`Semaphore`, y :class:`BoundedSemaphore` pueden ser utilizados como gestores de contexto con declaraciones :keyword:`with`.
