Repository: python/python-docs-es
Catalog: library/threading.po
Languages: es

source: :mod:`threading` --- Thread-based parallelism
es: :mod:`threading` --- Paralelismo basado en hilos

source: **Source code:** :source:`Lib/threading.py`
es: **Código fuente:** :source:`Lib/threading.py`

source: This module constructs higher-level threading interfaces on top of the lower level :mod:`_thread` module.
es: Este módulo construye interfaces de hilado de alto nivel sobre el módulo de más bajo nivel :mod:`_thread`.

source: This module used to be optional, it is now always available.
es: Este módulo solía ser opcional, ahora está siempre disponible.

source: :class:`concurrent.futures.ThreadPoolExecutor` offers a higher level interface to push tasks to a background thread without blocking execution of the calling thread, while still being able to retrieve their results when needed.
es: :class:`concurrent.futures.ThreadPoolExecutor` ofrece una interfaz a mas alto nivel para enviar tareas a un hilo en segundo plano sin bloquear la ejecución del hilo de llamada, pero manteniendo la capacidad de recuperar sus resultados cuando sea necesario.

source: :mod:`queue` provides a thread-safe interface for exchanging data between running threads.
es: :mod:`queue` proporciona una interfaz segura a nivel de hilos intercambiar datos entre hilos en ejecución.

source: :mod:`asyncio` offers an alternative approach to achieving task level concurrency without requiring the use of multiple operating system threads.
es: :mod:`asyncio` ofrece un enfoque alternativo para lograr la concurrencia a nivel de tarea sin requerir el uso de múltiples subprocesos del sistema operativo.

source: In the Python 2.x series, this module contained ``camelCase`` names for some methods and functions. These are deprecated as of Python 3.10, but they are still supported for compatibility with Python 2.5 and lower.
es: En la serie Python 2.x, este módulo contenía nombres ``camelCase`` para algunos métodos y funciones. Estos están obsoletos a partir de Python 3.10, pero aún son compatibles por compatibilidad con Python 2.5 y versiones anteriores.

source: In CPython, due to the :term:`Global Interpreter Lock <global interpreter lock>`, only one thread can execute Python code at once (even though certain performance-oriented libraries might overcome this limitation). If you want your application to make better use of the computational resources of multi-core machines, you are advised to use :mod:`multiprocessing` or :class:`concurrent.futures.ProcessPoolExecutor`. However, threading is still an appropriate model if you want to run multiple I/O-bound tasks simultaneously.
es: En CPython, debido al :term:`Candado de intérprete global <global interpreter lock>`, solo un hilo puede ejecutar código Python a la vez (aunque ciertas bibliotecas orientadas al rendimiento pueden superar esta limitación). Si desea que su aplicación haga un mejor uso de los recursos computacionales de las máquinas multinúcleo, se recomienda utilizar :mod:`multiprocessing` o :class:`concurrent.futures.ProcessPoolExecutor`. Sin embargo, el subproceso sigue siendo un modelo apropiado si desea ejecutar varias tareas vinculadas a E/S simultáneamente.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para obtener más información.

source: This module defines the following functions:
es: Este módulo define las siguientes funciones:

source: Return the number of :class:`Thread` objects currently alive. The returned count is equal to the length of the list returned by :func:`.enumerate`.
es: Retorna el número de objetos :class:`Thread` actualmente con vida. La cuenta retornada es igual al largo de la lista retornada por :func:`.enumerate`.

source: The function ``activeCount`` is a deprecated alias for this function.
es: La función ``activeCount`` es un alias obsoleto para esta función.

source: Return the current :class:`Thread` object, corresponding to the caller's thread of control. If the caller's thread of control was not created through the :mod:`threading` module, a dummy thread object with limited functionality is returned.
es: Retorna el objeto :class:`Thread` actual, correspondiente al hilo de control del invocador. Si el hilo de control del invocador no fue creado a través del módulo :mod:`threading`, se retorna un objeto hilo *dummy* con funcionalidad limitada.

source: The function ``currentThread`` is a deprecated alias for this function.
es: La función ``currentThread`` es un alias obsoleto para esta función.

source: Handle uncaught exception raised by :func:`Thread.run`.
es: Gestiona una excepción lanzada por :func:`Thread.run`.

source: The *args* argument has the following attributes:
es: El argumento *args* posee los siguientes atributos:

source: *exc_type*: Exception type.
es: *exc_type*: Tipo de excepción.

source: *exc_value*: Exception value, can be ``None``.
es: *exc_value*: Valor de la excepción, puede ser ``None``.

source: *exc_traceback*: Exception traceback, can be ``None``.
es: *exc_traceback*: Rastreo de la excepción, puede ser ``None``.

source: *thread*: Thread which raised the exception, can be ``None``.
es: *thread*: El hilo que ha lanzado la excepción, puede ser ``None``.

source: If *exc_type* is :exc:`SystemExit`, the exception is silently ignored. Otherwise, the exception is printed out on :data:`sys.stderr`.
es: Si *exc_type* es :exc:`SystemExit`, la excepción es silenciosamente ignorada. De otro modo, la excepción se imprime en :data:`sys.stderr`.

source: If this function raises an exception, :func:`sys.excepthook` is called to handle it.
es: Si esta función lanza una excepción, se llama a :func:`sys.excepthook` para manejarla.

source: :func:`threading.excepthook` can be overridden to control how uncaught exceptions raised by :func:`Thread.run` are handled.
es: :func:`threading.excepthook` se puede sobrescribir para controlar cómo se gestionan las excepciones levantadas por :func:`Thread.run`.

source: Storing *exc_value* using a custom hook can create a reference cycle. It should be cleared explicitly to break the reference cycle when the exception is no longer needed.
es: Guarda *exc_value* usando un *hook* personalizado puede crear un ciclo de referencias. Debe ser aclarado explícitamente que se rompa el ciclo de referencias cuando la excepción ya no se necesite.

source: Storing *thread* using a custom hook can resurrect it if it is set to an object which is being finalized. Avoid storing *thread* after the custom hook completes to avoid resurrecting objects.
es: Guardando *thread* usando un *hook* personalizado puede resucitarlo si se asigna a un objeto que esté siendo finalizado. Evítese que *thread* sea almacenado después de que el *hook* personalizado se complete para evitar resucitar objetos.

source: :func:`sys.excepthook` handles uncaught exceptions.
es: :func:`sys.excepthook` gestiona excepciones no capturadas.

source: Holds the original value of :func:`threading.excepthook`. It is saved so that the original value can be restored in case they happen to get replaced with broken or alternative objects.
es: Mantiene el valor original de :func:`threading.excepthook`. Se guarda para que se pueda restaurar el valor original en caso de que se reemplacen con objetos rotos o alternativos.

source: Return the 'thread identifier' of the current thread. This is a nonzero integer. Its value has no direct meaning; it is intended as a magic cookie to be used e.g. to index a dictionary of thread-specific data. Thread identifiers may be recycled when a thread exits and another thread is created.
es: Retorna el 'identificador de hilo' del hilo actual. Éste es un entero distinto de cero. Su valor no tiene un significado directo; ha sido pensado como una *cookie* mágica para usarse, por ejemplo, en indexar un diccionario con datos específicos del hilo. Los identificadores de hilo pueden ser reciclados cuando se abandona un hilo y se crea otro hilo.

source: Return the native integral Thread ID of the current thread assigned by the kernel. This is a non-negative integer. Its value may be used to uniquely identify this particular thread system-wide (until the thread terminates, after which the value may be recycled by the OS).
es: Retorna la ID de Hilo (*Thread ID*) nativo integral del hilo actual asignado por el kernel. Este es un entero distinto de cero. Su valor puede utilizarse para identificar de forma única a este hilo en particular a través de todo el sistema (hasta que el hilo termine, luego de lo cual el valor puede ser reciclado por el SO).

source: :ref:`Availability <availability>`: Windows, FreeBSD, Linux, macOS, OpenBSD, NetBSD, AIX, DragonFlyBSD.
es: :ref:`Disponibilidad <availability>`: Windows, FreeBSD, Linux, macOS, OpenBSD, NetBSD, AIX, DragonFlyBSD.

source: Return a list of all :class:`Thread` objects currently active. The list includes daemonic threads and dummy thread objects created by :func:`current_thread`. It excludes terminated threads and threads that have not yet been started. However, the main thread is always part of the result, even when terminated.
es: Retorna una lista de todos los objetos :class:`Thread` actualmente activos. La lista incluye subprocesos demoníacos y objetos de subprocesos ficticios creados por :func:`current_thread`. Excluye los subprocesos terminados y los subprocesos que aún no se han iniciado. Sin embargo, el hilo principal siempre es parte del resultado, incluso cuando se termina.

source: Return the main :class:`Thread` object. In normal conditions, the main thread is the thread from which the Python interpreter was started.
es: Retorna el objeto :class:`Thread` principal. En condiciones normales, el hilo principal es el hilo desde el que fue inicializado el intérprete de Python.

source: Set a trace function for all threads started from the :mod:`threading` module. The *func* will be passed to :func:`sys.settrace` for each thread, before its :meth:`~Thread.run` method is called.
es: Establece una función de seguimiento para todos los hilos iniciados desde el módulo :mod:`threading` . La *func* se pasará a :func:`sys.settrace` por cada hilo, antes de que su método :meth:`~Thread.run` sea invocado.

source: Set a trace function for all threads started from the :mod:`threading` module and all Python threads that are currently executing.
es: Establece una función de seguimiento para todos los hilos iniciados desde el módulo :mod:`threading` y todos los hilos de Python que se estén ejecutando en ese momento.

source: The *func* will be passed to :func:`sys.settrace` for each thread, before its :meth:`~Thread.run` method is called.
es: La *func* será pasada a :func:`sys.settrace` para cada hilo, antes de que su método :meth:`~Thread.run` sea invocado.

source: Get the trace function as set by :func:`settrace`.
es: Obtiene la función de rastreo según lo establecido por :func:`settrace`.

source: Set a profile function for all threads started from the :mod:`threading` module. The *func* will be passed to :func:`sys.setprofile` for each thread, before its :meth:`~Thread.run` method is called.
es: Establece una función de perfil para todos los hilos iniciados desde el módulo :mod:`threading`. La *func* se pasará a :func:`sys.setprofile` por cada hilo, antes de que se llame a su método :meth:`~Thread.run`.

source: Set a profile function for all threads started from the :mod:`threading` module and all Python threads that are currently executing.
es: Establece una función de perfil para todos los hilos iniciados desde el módulo :mod:`threading` y todos los hilos de Python que se estén ejecutando en ese momento.

source: The *func* will be passed to :func:`sys.setprofile` for each thread, before its :meth:`~Thread.run` method is called.
es: La *func* se pasará a :func:`sys.setprofile` para cada hilo, antes de que se llame a su método :meth:`~Thread.run`.

source: Get the profiler function as set by :func:`setprofile`.
es: Obtiene la función de generador de perfiles establecida por :func:`setprofile`.

source: Return the thread stack size used when creating new threads. The optional *size* argument specifies the stack size to be used for subsequently created threads, and must be 0 (use platform or configured default) or a positive integer value of at least 32,768 (32 KiB). If *size* is not specified, 0 is used. If changing the thread stack size is unsupported, a :exc:`RuntimeError` is raised. If the specified stack size is invalid, a :exc:`ValueError` is raised and the stack size is unmodified. 32 KiB is currently the minimum supported stack size value to guarantee sufficient stack space for the interpreter itself. Note that some platforms may have particular restrictions on values for the stack size, such as requiring a minimum stack size > 32 KiB or requiring allocation in multiples of the system memory page size - platform documentation should be referred to for more information (4 KiB pages are common; using multiples of 4096 for the stack size is the suggested approach in the absence of more specific information).
es: Retorna el tamaño de pila usado para crear nuevos hilos. El argumento opcional *size* (tamaño) especifica el tamaño de pila a ser utilizado para hilos creados posteriormente, y debe ser 0 (usar el valor por defecto de la plataforma o el configurado) o un valor entero positivo de al menos 32.768 (32KiB). Si no se especifica *size*, se usará 0. Si no existe soporte para cambiar el tamaño de pila, se lanzará un :exc:`RuntimeError`. Si el tamaño de pila especificado es inválido, se lanzará un :exc:`ValueError` y el tamaño de pila no será modificado. El tamaño mínimo de pila actualmente soportado es de 32KiB para garantizar suficiente espacio de pila para el intérprete mismo. Nótese que algunas plataformas pueden tener restricciones particulares de valores para tamaños de pila, como requerir un tamaño de pila > 32KiB, o requerir una asignación en múltiplos del tamaño de página de la memoria del sistema. Debe consultarse la documentación de cada plataforma para mayor información (páginas de 4KiB son comunes; se recomienda el uso de múltiplos de 4096 para el tamaño de pila en ausencia de información más específica)

source: :ref:`Availability <availability>`: Windows, pthreads.
es: :ref:`Disponibilidad <availability>`: Windows, pthreads.

source: Unix platforms with POSIX threads support.
es: Plataformas Unix con soporte para subprocesos POSIX.

source: This module also defines the following constant:
es: Este módulo también define la siguiente constante:

source: The maximum value allowed for the *timeout* parameter of blocking functions (:meth:`Lock.acquire`, :meth:`RLock.acquire`, :meth:`Condition.wait`, etc.). Specifying a timeout greater than this value will raise an :exc:`OverflowError`.
es: El máximo valor permitido para el parámetro *timeout* de las funciones bloqueantes (:meth:`Lock.acquire`, :meth:`RLock.acquire`, :meth:`Condition.wait`, etc.). La especificación de un tiempo de espera mayor a este valor lanzará un :exc:`OverflowError`.

source: This module defines a number of classes, which are detailed in the sections below.
es: Este módulo define un número de clases, las cuales son detalladas en las siguientes secciones.

source: The design of this module is loosely based on Java's threading model. However, where Java makes locks and condition variables basic behavior of every object, they are separate objects in Python. Python's :class:`Thread` class supports a subset of the behavior of Java's Thread class; currently, there are no priorities, no thread groups, and threads cannot be destroyed, stopped, suspended, resumed, or interrupted. The static methods of Java's Thread class, when implemented, are mapped to module-level functions.
es: El diseño de este módulo está vagamente basado en el modelo de hilos de Java. Sin embargo, donde Java hace que los bloqueos y las variables de condición sean comportamientos básicos de cada objeto, en Python son objetos separados. La clase :class:`Thread` de Python soporta un subconjunto del comportamiento de la clase Thread de Java; actualmente, no hay prioridades, no hay grupos de hilos, y los hilos no pueden ser destruidos, detenidos, suspendidos, reanudados o interrumpidos. Los métodos estáticos de la clase Thread de Java, cuando se implementan, se asignan a funciones de nivel de módulo.

source: All of the methods described below are executed atomically.
es: Todos los métodos descritos abajo son ejecutados de manera atómica.

source: Thread-Local Data
es: Datos locales del hilo

source: Thread-local data is data whose values are thread specific. To manage thread-local data, just create an instance of :class:`local` (or a subclass) and store attributes on it::
es: Los datos locales de hilo son datos cuyos valores son específicos a cada hilo. Para manejar los datos locales de hilos, simplemente crear una instancia de :class:`local` (o una subclase) y almacenar los atributos en ella::

source: The instance's values will be different for separate threads.
es: Los valores de instancia serán diferentes para hilos distintos.

source: A class that represents thread-local data.
es: Una clase que representa datos locales de hilo.

source: For more details and extensive examples, see the documentation string of the :mod:`!_threading_local` module: :source:`Lib/_threading_local.py`.
es: Para más detalles y ejemplos extensivos, véase la documentación del módulo :mod:`!_threading_local` module: :source:`Lib/_threading_local.py`.

source: Thread Objects
es: Objetos tipo hilo

source: The :class:`Thread` class represents an activity that is run in a separate thread of control. There are two ways to specify the activity: by passing a callable object to the constructor, or by overriding the :meth:`~Thread.run` method in a subclass. No other methods (except for the constructor) should be overridden in a subclass. In other words, *only* override the ``__init__()`` and :meth:`~Thread.run` methods of this class.
es: La clase :class:`Thread` representa una actividad que corre en un hilo de control separado. Hay dos manera de especificar la actividad: pasando un objeto invocable al constructor, o sobrescribiendo el método :meth:`~Thread.run` en una subclase. Ningún otro método (a excepción del constructor) deberá ser sobrescrito en una subclase. En otras palabras, *solo* sobrescribir los métodos ``__init__()`` y :meth:`~Thread.run` de esta clase.

source: Once a thread object is created, its activity must be started by calling the thread's :meth:`~Thread.start` method. This invokes the :meth:`~Thread.run` method in a separate thread of control.
es: Una vez que un objeto *thread* es creado, su actividad debe ser iniciada llamando al método :meth:`~Thread.start` del hilo. Ésto invoca el método :meth:`~Thread.run` en un hilo de control separado.

source: Once the thread's activity is started, the thread is considered 'alive'. It stops being alive when its :meth:`~Thread.run` method terminates -- either normally, or by raising an unhandled exception. The :meth:`~Thread.is_alive` method tests whether the thread is alive.
es: Una vez que la actividad del hilo ha sido iniciada, el hilo se considerará 'vivo'. Deja de estar vivo cuando su método :meth:`~Thread.run` termina -- ya sea normalmente, o por lanzar una excepción no manejada. El método :meth:`~Thread.is_alive` verifica si acaso el hilo está vivo.

source: Other threads can call a thread's :meth:`~Thread.join` method. This blocks the calling thread until the thread whose :meth:`~Thread.join` method is called is terminated.
es: Otras hilos pueden llamar al método :meth:`~Thread.join`. Esto bloquea el hilo que llama hasta que el hilo cuyo método :meth:`~Hilo.join` es llamado termina.

source: A thread has a name. The name can be passed to the constructor, and read or changed through the :attr:`~Thread.name` attribute.
es: Un hilo tiene un nombre. El nombre puede ser pasado al constructor y leído o cambiado a través del atributo :attr:`~Thread.name`.

source: If the :meth:`~Thread.run` method raises an exception, :func:`threading.excepthook` is called to handle it. By default, :func:`threading.excepthook` ignores silently :exc:`SystemExit`.
es: Si el método :meth:`~Thread.run` lanza una excepción, se llama a :func:`threading.excepthook` para gestionarla. Por defecto, :func:`threading.excepthook` ignora silenciosamente a :exc:`SystemExit`.

source: A thread can be flagged as a "daemon thread". The significance of this flag is that the entire Python program exits when only daemon threads are left. The initial value is inherited from the creating thread. The flag can be set through the :attr:`~Thread.daemon` property or the *daemon* constructor argument.
es: Un hilo puede ser marcado como un "hilo demonio". El significado de esta marca es que la totalidad del programa de Python finalizará cuando solo queden hilos demonio. El valor inicial es heredado del hilo creador. La marca puede ser establecida a través de la propiedad :attr:`~Thread.daemon` o del argumento *daemon* en el constructor.

source: Daemon threads are abruptly stopped at shutdown. Their resources (such as open files, database transactions, etc.) may not be released properly. If you want your threads to stop gracefully, make them non-daemonic and use a suitable signalling mechanism such as an :class:`Event`.
es: Los hilos demonio son detenidos abruptamente al momento del cierre. Sus recursos (tales como archivos abiertos, transacciones con bases de datos, etc.) pueden no ser liberados adecuadamente. Si se requiere que los hilos se detengan con gracia, háganse no-demoníacos y úsese un mecanismo de señalización adecuado tal como un :class:`Event`.

source: There is a "main thread" object; this corresponds to the initial thread of control in the Python program. It is not a daemon thread.
es: Existe un objeto "hilo principal"; éste corresponde al hilo de control inicial del programa de Python. No es un hilo demonio.

source: There is the possibility that "dummy thread objects" are created. These are thread objects corresponding to "alien threads", which are threads of control started outside the threading module, such as directly from C code. Dummy thread objects have limited functionality; they are always considered alive and daemonic, and cannot be :ref:`joined <meth-thread-join>`. They are never deleted, since it is impossible to detect the termination of alien threads.
es: Existe la posibilidad de crear "objetos de hilos *dummy*". Estos son objetos hilo correspondientes a "hilos extranjeros", que son hilos de control iniciados afuera del modulo *threading*, por ejemplo directamente de código en C. Los objetos de hilos *dummy* tienen funcionalidad limitada; siempre se consideran vivos y demoníacos, y no pueden se les puede aplicar el método :ref:`joined <meth-thread-join>`. Nunca son eliminados, ya que es imposible detectar la terminación de hilos extranjeros.

source: This constructor should always be called with keyword arguments. Arguments are:
es: Este constructor siempre debe ser llamado con argumentos de palabra clave. Los argumentos son:

source: *group* should be ``None``; reserved for future extension when a :class:`!ThreadGroup` class is implemented.
es: *group* debe ser `None`; reservado para una futura extensión cuando se implemente una clase :class:`!ThreadGroup`.
