Repository: python/python-docs-es
Catalog: library/time.po
Languages: es

source: Second as a decimal number [00,61].
es: Segunda como un número decimal [00,61].

source: Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
es: Número de semana del año (domingo como primer día de la semana) como número decimal [00,53]. Todos los días en un nuevo año anterior al primer domingo se consideran en la semana 0.

source: Weekday as a decimal number [0(Sunday),6].
es: Día de la semana como un número decimal [0 (domingo), 6].

source: Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.
es: Número de semana del año (lunes como primer día de la semana) como número decimal [00,53]. Todos los días en un nuevo año anterior al primer lunes se consideran en la semana 0.

source: Locale's appropriate date representation.
es: Representación de fecha apropiada de la localidad.

source: Locale's appropriate time representation.
es: Representación del tiempo apropiado de la localidad.

source: Year without century as a decimal number [00,99].
es: Año sin siglo como número decimal [00,99].

source: Year with century as a decimal number.
es: Año con siglo como número decimal.

source: A literal ``'%'`` character.
es: Un carácter literal ``'%'``.

source: Notes:
es: Notas:

source: When used with the :func:`strptime` function, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
es: Cuando se usa con la función :func:`strptime`, la directiva ``%p`` solo afecta el campo de hora de salida si se usa la directiva ``%I`` para analizar la hora.

source: The range really is ``0`` to ``61``; value ``60`` is valid in timestamps representing `leap seconds`_ and value ``61`` is supported for historical reasons.
es: El rango realmente es ``0`` a ``61``; el valor ``60`` es válido en las marcas de tiempo que representan `segundos intercalares`_ y el valor ``61`` es compatible por razones históricas.

source: When used with the :func:`strptime` function, ``%U`` and ``%W`` are only used in calculations when the day of the week and the year are specified.
es: Cuando se usa con la función :func:`strptime`, ``%U`` y ``%W`` solo se usan en los cálculos cuando se especifica el día de la semana y el año.

source: Additional directives may be supported on certain platforms, but only the ones listed here have a meaning standardized by ANSI C. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation.
es: Es posible que se admitan directivas adicionales en ciertas plataformas, pero solo las que se enumeran aquí tienen un significado estandarizado por ANSI C. Para ver el conjunto completo de códigos de formato admitidos en su plataforma, consulte la documentación de :manpage:`strftime(3)`.

source: On some platforms, an optional field width and precision specification can immediately follow the initial ``'%'`` of a directive in the following order; this is also not portable. The field width is normally 2 except for ``%j`` where it is 3.
es: En algunas plataformas, una especificación de precisión y ancho de campo opcional puede seguir inmediatamente el ``'%'`` inicial de una directiva en el siguiente orden; Esto tampoco es portátil. El ancho del campo es normalmente 2 excepto ``%j`` donde es 3.

source: Parse a string representing a time according to a format. The return value is a :class:`struct_time` as returned by :func:`gmtime` or :func:`localtime`.
es: Analiza una cadena que representa un tiempo de acuerdo con un formato. El valor de retorno es a :class:`struct_time` como lo retorna :func:`gmtime` o :func:`localtime`.

source: The *format* parameter uses the same directives as those used by :func:`strftime`; it defaults to ``"%a %b %d %H:%M:%S %Y"`` which matches the formatting returned by :func:`ctime`. If *string* cannot be parsed according to *format*, or if it has excess data after parsing, :exc:`ValueError` is raised. The default values used to fill in any missing data when more accurate values cannot be inferred are ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Both *string* and *format* must be strings.
es: El parámetro *format* utiliza las mismas directivas que las utilizadas por :func:`strftime`; el valor predeterminado es ``"%a %b %d %H:%M:%S %Y"`` que coincide con el formato retornado por :func:`ctime`. Si *string* no se puede analizar de acuerdo con *format*, o si tiene un exceso de datos después del análisis, se lanza un :exc:`ValueError`. Los valores predeterminados utilizados para completar los datos faltantes cuando no se pueden inferir valores más precisos son ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Tanto *string* como *format* deben ser strings.

source: For example:
es: Por ejemplo:

source: Support for the ``%Z`` directive is based on the values contained in ``tzname`` and whether ``daylight`` is true. Because of this, it is platform-specific except for recognizing UTC and GMT which are always known (and are considered to be non-daylight savings timezones).
es: La compatibilidad con la directiva ``%Z`` se basa en los valores contenidos en ``tzname`` y en si ``daylight`` es verdadero. Debido a esto, es específico de la plataforma, excepto para reconocer UTC y GMT que siempre se conocen (y se consideran zonas horarias que no son de horario de verano).

source: Only the directives specified in the documentation are supported. Because ``strftime()`` is implemented per platform it can sometimes offer more directives than those listed. But ``strptime()`` is independent of any platform and thus does not necessarily support all directives available that are not documented as supported.
es: Solo se admiten las directivas especificadas en la documentación. Debido a que ``strftime()`` se implementa por plataforma, a veces puede ofrecer más directivas que las enumeradas. Pero ``strptime()`` es independiente de cualquier plataforma y, por lo tanto, no necesariamente admite todas las directivas disponibles que no están documentadas como compatibles.

source: The type of the time value sequence returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`. It is an object with a :term:`named tuple` interface: values can be accessed by index and by attribute name. The following values are present:
es: El tipo de secuencia de valores de tiempo retornado por :func:`gmtime`, :func:`localtime`, y :func:`strptime`. Es un objeto con una interfaz :term:`named tuple`: se puede acceder a los valores por índice y por nombre de atributo. Los siguientes valores están presentes:

source: Index
es: Índice

source: Attribute
es: Atributo

source: Values
es: Valores

source: (for example, 1993)
es: (por ejemplo, 1993)

source: range [1, 12]
es: rango [1, 12]

source: range [1, 31]
es: rango [1, 31]

source: range [0, 23]
es: rango [0, 23]

source: range [0, 59]
es: rango [0, 59]

source: range [0, 61]; see **(2)** in :func:`strftime` description
es: rango [0, 61]; ver **(2)** in :func:`strftime` descripción

source: range [0, 6], Monday is 0
es: rango [0, 6], Lunes es 0

source: range [1, 366]
es: rango [1, 366]

source: 0, 1 or -1; see below
es: 0, 1 ó -1; ver abajo

source: abbreviation of timezone name
es: abreviatura del nombre de la zona horaria

source: offset east of UTC in seconds
es: desplazamiento al este de UTC en segundos

source: Note that unlike the C structure, the month value is a range of [1, 12], not [0, 11].
es: Tenga en cuenta que, a diferencia de la estructura C, el valor del mes es un rango de [1, 12], no [0, 11].

source: In calls to :func:`mktime`, :attr:`tm_isdst` may be set to 1 when daylight savings time is in effect, and 0 when it is not. A value of -1 indicates that this is not known, and will usually result in the correct state being filled in.
es: En llamadas a :func:`mktime`, :attr:`tm_isdst` puede establecerse en 1 cuando el horario de verano está vigente y 0 cuando no lo está. Un valor de -1 indica que esto no se conoce y, por lo general, se completará el estado correcto.

source: When a tuple with an incorrect length is passed to a function expecting a :class:`struct_time`, or having elements of the wrong type, a :exc:`TypeError` is raised.
es: Cuando una tupla con una longitud incorrecta se pasa a una función que espera a :class:`struct_time`, o que tiene elementos del tipo incorrecto, se lanza un :exc:`TypeError`.

source: Note that even though the time is always returned as a floating point number, not all systems provide time with a better precision than 1 second. While this function normally returns non-decreasing values, it can return a lower value than a previous call if the system clock has been set back between the two calls.
es: Tenga en cuenta que aunque el tiempo siempre se retorna como un número de coma flotante, no todos los sistemas proporcionan tiempo con una precisión superior a 1 segundo. Si bien esta función normalmente retorna valores no decrecientes, puede retornar un valor más bajo que una llamada anterior si el reloj del sistema se ha retrasado entre las dos llamadas.

source: The number returned by :func:`.time` may be converted into a more common time format (i.e. year, month, day, hour, etc...) in UTC by passing it to :func:`gmtime` function or in local time by passing it to the :func:`localtime` function. In both cases a :class:`struct_time` object is returned, from which the components of the calendar date may be accessed as attributes.
es: El número retornado por :func:`.time` se puede convertir a un formato de hora más común (es decir, año, mes, día, hora, etc.) en UTC pasándolo a función :func:`gmtime` o en hora local pasándola a la función :func:`localtime`. En ambos casos se retorna un objeto :class:`struct_time`, desde el cual se puede acceder a los componentes de la fecha del calendario como atributos.

source: Use :func:`time_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice :func:`time_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: Similar to :func:`~time.time` but returns time as an integer number of nanoseconds since the epoch_.
es: Similar a :func:`~ time.time` pero retorna el tiempo como un número entero de nanosegundos desde la época_.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current thread. It does not include time elapsed during sleep. It is thread-specific by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls in the same thread is valid.
es: Retorna el valor (en fracciones de segundo) de la suma del sistema y el tiempo de CPU del usuario del subproceso actual. No incluye el tiempo transcurrido durante el sleep. Es específico del hilo por definición. El punto de referencia del valor retornado no está definido, de modo que sólo la diferencia entre los resultados de dos llamadas en el mismo hilo es válida.

source: Use :func:`thread_time_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice :func:`thread_time_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: Unix systems supporting ``CLOCK_THREAD_CPUTIME_ID``.
es: Sistemas Unix que soporten ``CLOCK_THREAD_CPUTIME_ID``.

source: Similar to :func:`thread_time` but return time as nanoseconds.
es: Similar a :func:`thread_time` pero retorna el tiempo en nanosegundos.

source: Reset the time conversion rules used by the library routines. The environment variable :envvar:`TZ` specifies how this is done. It will also set the variables ``tzname`` (from the :envvar:`TZ` environment variable), ``timezone`` (non-DST seconds West of UTC), ``altzone`` (DST seconds west of UTC) and ``daylight`` (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
es: Restablezca las reglas de conversión de tiempo utilizadas por las rutinas de la biblioteca. La variable de entorno :envvar:`TZ` especifica cómo se hace esto. También establecerá las variables ``tzname`` (de variable de entorno :envvar:`TZ`), ``timezone`` (segundos que no son DST al oeste de UTC), ``altzone`` (segundos DST al oeste de UTC ) y ``daylight`` (a 0 si esta zona horaria no tiene ninguna regla de horario de verano, o a cero si hay un horario pasado, presente o futuro cuando se aplica el horario de verano).

source: Although in many cases, changing the :envvar:`TZ` environment variable may affect the output of functions like :func:`localtime` without calling :func:`tzset`, this behavior should not be relied on.
es: Aunque en muchos casos, cambiar la variable de entorno :envvar:`TZ` puede afectar la salida de funciones como :func:`localtime` sin llamar a :func:`tzset`, no se debe confiar en este comportamiento.

source: The :envvar:`TZ` environment variable should contain no whitespace.
es: La variable de entorno :envvar:`TZ` no debe contener espacios en blanco.

source: The standard format of the :envvar:`TZ` environment variable is (whitespace added for clarity)::
es: El formato estándar de la variable de entorno :envvar:`TZ` es (espacio en blanco agregado para mayor claridad)::

source: Where the components are:
es: Donde están los componentes:

source: ``std`` and ``dst``
es: ``std`` y ``dst``

source: Three or more alphanumerics giving the timezone abbreviations. These will be propagated into time.tzname
es: Tres o más caracteres alfanuméricos que dan las abreviaturas de zona horaria. Estos se propagarán en time.tzname

source: The offset has the form: ``± hh[:mm[:ss]]``. This indicates the value added the local time to arrive at UTC. If preceded by a '-', the timezone is east of the Prime Meridian; otherwise, it is west. If no offset follows dst, summer time is assumed to be one hour ahead of standard time.
es: El desplazamiento tiene la forma: ``± hh[:mm[:ss]]``. Esto indica el valor agregado de la hora local para llegar a UTC. Si está precedido por un '-', la zona horaria está al este del primer meridiano; de lo contrario, es oeste. Si no hay desplazamiento después de dst, se supone que el horario de verano es una hora antes del horario estándar.

source: Indicates when to change to and back from DST. The format of the start and end dates are one of the following:
es: Indica cuándo cambiar hacia y desde DST. El formato de las fechas de inicio y finalización es uno de los siguientes:

source: The Julian day *n* (1 <= *n* <= 365). Leap days are not counted, so in all years February 28 is day 59 and March 1 is day 60.
es: El día juliano * n * (1 <= * n * <= 365). Los días bisiestos no se cuentan, por lo que en todos los años el 28 de febrero es el día 59 y el 1 de marzo es el día 60.

source: The zero-based Julian day (0 <= *n* <= 365). Leap days are counted, and it is possible to refer to February 29.
es: El día juliano basado en cero (0 <= * n * <= 365). Los días bisiestos se cuentan y es posible referirse al 29 de febrero.

source: The *d*'th day (0 <= *d* <= 6) of week *n* of month *m* of the year (1 <= *n* <= 5, 1 <= *m* <= 12, where week 5 means "the last *d* day in month *m*" which may occur in either the fourth or the fifth week). Week 1 is the first week in which the *d*'th day occurs. Day zero is a Sunday.
es: El día d (0 <= *d* <= 6) de la semana *n* del mes *m* del año (1 <= *n* <= 5, 1 <= *m* <= 12, donde la semana 5 significa "el último *d* día del mes *m*", que puede ocurrir en la cuarta o quinta semana). La semana 1 es la primera semana en la que ocurre el día *d*. El día cero es un domingo.

source: ``time`` has the same format as ``offset`` except that no leading sign ('-' or '+') is allowed. The default, if time is not given, is 02:00:00.
es: ``time`` tiene el mismo formato que ``offset``, excepto que no se permite ningún signo inicial ('-' o '+'). El valor predeterminado, si no se da el tiempo, es 02:00:00.

source: On many Unix systems (including \*BSD, Linux, Solaris, and Darwin), it is more convenient to use the system's zoneinfo (:manpage:`tzfile(5)`) database to specify the timezone rules. To do this, set the :envvar:`TZ` environment variable to the path of the required timezone datafile, relative to the root of the systems 'zoneinfo' timezone database, usually located at :file:`/usr/share/zoneinfo`. For example, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` or ``'Europe/Amsterdam'``. ::
es: En muchos sistemas Unix (incluidos \*BSD, Linux, Solaris y Darwin), es más conveniente utilizar la base de datos *zoneinfo* (:manpage:`tzfile(5)`) del sistema para especificar las reglas de zona horaria. Para hacer esto, configure la variable de entorno :envvar:`TZ` en la ruta del archivo de datos de zona horaria requerida, en relación con la raíz de la base de datos de zona horaria 'zoneinfo' de los sistemas, generalmente ubicada en :file:`/usr/share/zoneinfo` . Por ejemplo, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` o ``'Europe/Amsterdam'``. ::

source: Clock ID Constants
es: Constantes de ID de reloj

source: These constants are used as parameters for :func:`clock_getres` and :func:`clock_gettime`.
es: Estas constantes se utilizan como parámetros para :func:`clock_getres` y :func:`clock_gettime`.

source: Identical to :data:`CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
es: Idéntico a :data:`CLOCK_MONOTONIC`, excepto que también incluye cualquier momento en que el sistema esté suspendido.

source: This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of :data:`CLOCK_REALTIME`, which may have discontinuities if the time is changed using ``settimeofday()`` or similar.
es: Esto permite que las aplicaciones obtengan un reloj monótono con suspensión sin tener que lidiar con las complicaciones de :data:`CLOCK_REALTIME`, que puede tener discontinuidades si se cambia la hora usando ``settimeofday()`` o similar.

source: The Solaris OS has a ``CLOCK_HIGHRES`` timer that attempts to use an optimal hardware source, and may give close to nanosecond resolution. ``CLOCK_HIGHRES`` is the nonadjustable, high-resolution clock.
es: El sistema operativo Solaris tiene un temporizador ``CLOCK_HIGHRES`` que intenta utilizar una fuente de hardware óptima y puede brindar una resolución cercana a los nanosegundos. ``CLOCK_HIGHRES`` es el reloj de alta resolución no ajustable.

source: :ref:`Availability <availability>`: Solaris.
es: :ref:`Disponibilidad <availability>`: Solaris.

source: Clock that cannot be set and represents monotonic time since some unspecified starting point.
es: Reloj que no se puede configurar y representa el tiempo monótono desde algún punto de partida no especificado.

source: Similar to :data:`CLOCK_MONOTONIC`, but provides access to a raw hardware-based time that is not subject to NTP adjustments.
es: Similar a :data:`CLOCK_MONOTONIC`, pero proporciona acceso a un tiempo sin procesar basado en hardware que no está sujeto a ajustes NTP.

source: High-resolution per-process timer from the CPU.
es: Temporizador por proceso de alta resolución desde la CPU.

source: `International Atomic Time <https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq#tai>`_
es: `Tiempo Atómico Internacional <https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq#tai>`_

source: The system must have a current leap second table in order for this to give the correct answer. PTP or NTP software can maintain a leap second table.
es: El sistema debe contar con una tabla de segundos intercalares para que éste dé la respuesta correcta. Software PTP o NTP puede mantener una tabla de segundos intercalares.

source: :ref:`Availability <availability>`: Linux.
es: :ref:`Disponibilidad <availability>`: Linux.

source: Thread-specific CPU-time clock.
es: Reloj de tiempo de CPU específico de subproceso.

source: Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement, both absolute and interval.
es: Tiempo cuyo valor absoluto es el tiempo que el sistema ha estado funcionando y no suspendido, proporcionando una medición precisa del tiempo de actividad, tanto absoluta como de intervalo.

source: Clock that increments monotonically, tracking the time since an arbitrary point, unaffected by frequency or time adjustments and not incremented while the system is asleep.
es: Reloj que se incrementa monótonamente, rastreando el tiempo desde un punto arbitrario, no afectado por los ajustes de frecuencia o tiempo y no incrementado mientras el sistema está dormido.

source: The following constant is the only parameter that can be sent to :func:`clock_settime`.
es: La siguiente constante es el único parámetro que se puede enviar a :func:`clock_settime`.

source: System-wide real-time clock. Setting this clock requires appropriate privileges.
es: Reloj en tiempo real de todo el sistema. Configurar este reloj requiere los privilegios apropiados.

source: Timezone Constants
es: Constantes de zona horaria

source: The offset of the local DST timezone, in seconds west of UTC, if one is defined. This is negative if the local DST timezone is east of UTC (as in Western Europe, including the UK). Only use this if ``daylight`` is nonzero. See note below.
es: El desplazamiento de la zona horaria de horario de verano local, en segundos al oeste de UTC, si se define uno. Esto es negativo si la zona horaria local del horario de verano está al este de UTC (como en Europa occidental, incluido el Reino Unido). Solo use esto si la ``daylight`` no es cero. Vea la nota abajo.

source: Nonzero if a DST timezone is defined. See note below.
es: No es cero si se define una zona horaria DST. Vea la nota abajo.

source: The offset of the local (non-DST) timezone, in seconds west of UTC (negative in most of Western Europe, positive in the US, zero in the UK). See note below.
es: El desplazamiento de la zona horaria local (no DST), en segundos al oeste de UTC (negativo en la mayoría de Europa occidental, positivo en los EE. UU., Cero en el Reino Unido). Vea la nota abajo.

source: A tuple of two strings: the first is the name of the local non-DST timezone, the second is the name of the local DST timezone. If no DST timezone is defined, the second string should not be used. See note below.
es: Una tupla de dos cadenas: la primera es el nombre de la zona horaria local no DST, la segunda es el nombre de la zona horaria local DST. Si no se define la zona horaria DST, la segunda cadena no debe usarse. Vea la nota abajo.

source: For the above Timezone constants (:data:`altzone`, :data:`daylight`, :data:`timezone`, and :data:`tzname`), the value is determined by the timezone rules in effect at module load time or the last time :func:`tzset` is called and may be incorrect for times in the past. It is recommended to use the :attr:`tm_gmtoff` and :attr:`tm_zone` results from :func:`localtime` to obtain timezone information.
es: Para las constantes de zona horaria anteriores (:data:`altzone`, :data:`daylight`, :data:`timezone`, y :data:`tzname`), el valor está determinado por las reglas de zona horaria vigentes en el momento de carga del módulo o la última vez se llama a :func:`tzset` y puede ser incorrecto en el pasado. Se recomienda utilizar :attr:`tm_gmtoff` y :attr:`tm_zone` resulta de :func:`localtime` para obtener información sobre la zona horaria.

source: Module :mod:`datetime`
es: Modulo :mod:`datetime`

source: More object-oriented interface to dates and times.
es: Más interfaz orientada a objetos para fechas y horas.

source: Module :mod:`locale`
es: Modulo :mod:`locale`
