Repository: python/python-docs-es
Catalog: library/time.po
Languages: es

source: Internationalization services. The locale setting affects the interpretation of many format specifiers in :func:`strftime` and :func:`strptime`.
es: Servicios de internacionalización. La configuración regional afecta la interpretación de muchos especificadores de formato en :func:`strftime` y :func:`strptime`.

source: Module :mod:`calendar`
es: Modulo :mod:`calendar`

source: General calendar-related functions. :func:`~calendar.timegm` is the inverse of :func:`gmtime` from this module.
es: Funciones generales relacionadas con el calendario. :func:`~calendar.timegm` es el inverso de :func:`gmtime` de este módulo.

source: Footnotes
es: Notas al pie
