Repository: python/python-docs-es
Catalog: library/timeit.po
Languages: es

source: :mod:`timeit` --- Measure execution time of small code snippets
es: :mod:`timeit` --- Mide el tiempo de ejecución de pequeños fragmentos de código

source: **Source code:** :source:`Lib/timeit.py`
es: **Código fuente:** :source:`Lib/timeit.py`

source: This module provides a simple way to time small bits of Python code. It has both a :ref:`timeit-command-line-interface` as well as a :ref:`callable <python-interface>` one. It avoids a number of common traps for measuring execution times. See also Tim Peters' introduction to the "Algorithms" chapter in the second edition of *Python Cookbook*, published by O'Reilly.
es: Este módulo proporciona una forma sencilla de cronometrar pequeños fragmentos de código Python. Tiene tanto una :ref:`timeit-command-line-interface` como una :ref:`invocable <python-interface>`. Evita una serie de trampas comunes para medir los tiempos de ejecución. Véase también la introducción de Tim Peters al capítulo "Algoritmos" en la segunda edición de *Python Cookbook*, publicado por O'Reilly.

source: Basic Examples
es: Ejemplos básicos

source: The following example shows how the :ref:`timeit-command-line-interface` can be used to compare three different expressions:
es: En el ejemplo siguiente se muestra cómo se puede utilizar :ref:`timeit-command-line-interface` para comparar tres expresiones diferentes:

source: This can be achieved from the :ref:`python-interface` with::
es: Esto se puede lograr desde :ref:`python-interface` con::

source: A callable can also be passed from the :ref:`python-interface`::
es: Un invocable también se puede pasar desde el :ref:`python-interface`::

source: Note however that :func:`.timeit` will automatically determine the number of repetitions only when the command-line interface is used. In the :ref:`timeit-examples` section you can find more advanced examples.
es: Sin embargo, tenga en cuenta que :func:`.timeit` determinará automáticamente el número de repeticiones solo cuando se utiliza la interfaz de línea de comandos. En la sección :ref:`timeit-examples` puede encontrar ejemplos más avanzados.

source: Python Interface
es: Interfaz de Python

source: The module defines three convenience functions and a public class:
es: El módulo define tres funciones de conveniencia y una clase pública:

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.timeit` method with *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
es: Cree una instancia de :class:`Timer` con la instrucción dada, el código *setup* y la función *timer* y ejecute su método :meth:`.timeit` con las ejecuciones *number*. El argumento *globals* opcional especifica un espacio de nombres en el que se ejecutará el código.

source: The optional *globals* parameter was added.
es: El parámetro opcional *globals* fue añadido.

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.repeat` method with the given *repeat* count and *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
es: Crea una instancia de :class:`Timer` con la instrucción dada, el código *setup* y la función *timer* y ejecuta su método :meth:`.repeat` con las ejecuciones *repeat* y *number* dadas. El argumento *globals* opcional especifica un espacio de nombres en el que se ejecutará el código.

source: Default value of *repeat* changed from 3 to 5.
es: El valor por defecto para *repeat* cambió de 3 a 5.

source: The default timer, which is always time.perf_counter(), returns float seconds. An alternative, time.perf_counter_ns, returns integer nanoseconds.
es: El temporizador por defecto, que es siempre time.perf_counter(), retorna segundos como un número de punto flotante. Como alternativa, time.perf_counter_ns retorna un número entero de nanosegundos.

source: :func:`time.perf_counter` is now the default timer.
es: :func:`time.perf_counter` es ahora el temporizador por defecto.

source: Class for timing execution speed of small code snippets.
es: Clase para la velocidad de tiempo de ejecución de pequeños fragmentos de código.

source: The constructor takes a statement to be timed, an additional statement used for setup, and a timer function. Both statements default to ``'pass'``; the timer function is platform-dependent (see the module doc string). *stmt* and *setup* may also contain multiple statements separated by ``;`` or newlines, as long as they don't contain multi-line string literals. The statement will by default be executed within timeit's namespace; this behavior can be controlled by passing a namespace to *globals*.
es: El constructor toma una instrucción que se cronometra, una instrucción adicional utilizada para la instalación, y una función de temporizador. Ambas instrucciones tienen como valor predeterminado ``'pass'``; la función del temporizador depende de la plataforma (consulte la cadena *doc* del módulo). *stmt* y *setup* también pueden contener varias instrucciones separadas por ``;`` o líneas nuevas, siempre y cuando no contengan literales de cadena de varias líneas. La instrucción se ejecutará de forma predeterminada dentro del espacio de nombres timeit; este comportamiento se puede controlar pasando un espacio de nombres a *globals*.

source: To measure the execution time of the first statement, use the :meth:`.timeit` method. The :meth:`.repeat` and :meth:`.autorange` methods are convenience methods to call :meth:`.timeit` multiple times.
es: Para medir el tiempo de ejecución de la primera instrucción, utilice el método :meth:`.timeit`. Los métodos :meth:`.repeat` y :meth:`.autorange` son métodos de conveniencia para llamar al método :meth:`.timeit` varias veces.

source: The execution time of *setup* is excluded from the overall timed execution run.
es: El tiempo de ejecución de *setup* se excluye de la ejecución de tiempo total.

source: The *stmt* and *setup* parameters can also take objects that are callable without arguments. This will embed calls to them in a timer function that will then be executed by :meth:`.timeit`. Note that the timing overhead is a little larger in this case because of the extra function calls.
es: Los parámetros *stmt* y *setup* también pueden tomar objetos a los que se puede llamar sin argumentos. Esto embebe llamadas a ellos en una función de temporizador que luego será ejecutada por :meth:`.timeit`. Tenga en cuenta que la sobrecarga de tiempo es un poco mayor en este caso debido a las llamadas de función adicionales.

source: Time *number* executions of the main statement. This executes the setup statement once, and then returns the time it takes to execute the main statement a number of times. The default timer returns seconds as a float. The argument is the number of times through the loop, defaulting to one million. The main statement, the setup statement and the timer function to be used are passed to the constructor.
es: Registra la duración de *number* ejecuciones de la sentencia principal. Esto ejecuta la sentencia *setup* una vez y, a continuación, retorna el tiempo que se tarda en ejecutar la sentencia principal varias veces. El temporizador por defecto retorna segundos como un número de punto flotante. El argumento es el número de veces que se ejecuta el bucle, tomando por defecto un millón. La sentencia principal, la instrucción *setup* y la función *timer* que se va a utilizar se pasan al constructor.

source: By default, :meth:`.timeit` temporarily turns off :term:`garbage collection` during the timing. The advantage of this approach is that it makes independent timings more comparable. The disadvantage is that GC may be an important component of the performance of the function being measured. If so, GC can be re-enabled as the first statement in the *setup* string. For example::
es: De forma predeterminada, :meth:`.timeit` desactiva temporalmente :term:`garbage collection` durante la medición. La ventaja de este enfoque es que hace que los tiempos independientes sean más comparables. La desventaja es que GC puede ser un componente importante del rendimiento de la función que se está midiendo. Si es así, GC se puede volver a habilitar como la primera instrucción en la cadena *setup*. Por ejemplo::

source: Automatically determine how many times to call :meth:`.timeit`.
es: Determina automáticamente cuántas veces llamar a :meth:`.timeit`.

source: This is a convenience function that calls :meth:`.timeit` repeatedly so that the total time >= 0.2 second, returning the eventual (number of loops, time taken for that number of loops). It calls :meth:`.timeit` with increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the time taken is at least 0.2 second.
es: Esta es una función de conveniencia que llama a :meth:`.timeit` repetidamente para que el tiempo total >= 0,2 segundos, retornando el eventual (número de bucles, tiempo tomado para ese número de bucles). Este método llama a :meth:`.timeit` con números crecientes de la secuencia 1, 2, 5, 10, 20, 50, ... hasta que el tiempo necesario sea de al menos 0.2 segundos.

source: If *callback* is given and is not ``None``, it will be called after each trial with two arguments: ``callback(number, time_taken)``.
es: Si *callback* se da y no es ``None``, se llamará después de cada prueba con dos argumentos: ``callback(number, time_taken)``.

source: Call :meth:`.timeit` a few times.
es: Llama a :meth:`.timeit` algunas veces.

source: This is a convenience function that calls the :meth:`.timeit` repeatedly, returning a list of results. The first argument specifies how many times to call :meth:`.timeit`. The second argument specifies the *number* argument for :meth:`.timeit`.
es: Esta es una función de conveniencia que llama a :meth:`.timeit` repetidamente, retornando una lista de resultados. El primer argumento especifica cuántas veces se debe llamar a :meth:`.timeit`. El segundo argumento especifica el argumento *number* para :meth:`.timeit`.

source: It's tempting to calculate mean and standard deviation from the result vector and report these. However, this is not very useful. In a typical case, the lowest value gives a lower bound for how fast your machine can run the given code snippet; higher values in the result vector are typically not caused by variability in Python's speed, but by other processes interfering with your timing accuracy. So the :func:`min` of the result is probably the only number you should be interested in. After that, you should look at the entire vector and apply common sense rather than statistics.
es: Es tentador calcular la media y la desviación estándar del vector de resultados e informar de estos. Sin embargo, esto no es muy útil. En un caso típico, el valor más bajo proporciona un límite inferior para la rapidez con la que el equipo puede ejecutar el fragmento de código especificado; valores más altos en el vector de resultado normalmente no son causados por la variabilidad en la velocidad de Python, sino por otros procesos que interfieren con su precisión de sincronización. Así que el :func:`min` del resultado es probablemente el único número que debería estar interesado en. Después de eso, usted debe mirar todo el vector y aplicar el sentido común en lugar de las estadísticas.

source: Helper to print a traceback from the timed code.
es: Ayudante para imprimir un seguimiento desde el código cronometrado.

source: Typical use::
es: Uso típico::

source: The advantage over the standard traceback is that source lines in the compiled template will be displayed. The optional *file* argument directs where the traceback is sent; it defaults to :data:`sys.stderr`.
es: La ventaja sobre el seguimiento estándar es que se mostrarán las líneas de origen de la plantilla compilada. El argumento opcional *file* dirige dónde se envía el seguimiento; por defecto a :data:`sys.stderr`.

source: Command-Line Interface
es: Interfaz de línea de comandos

source: When called as a program from the command line, the following form is used::
es: Cuando se llama como un programa desde la línea de comandos, se utiliza el siguiente formulario:

source: Where the following options are understood:
es: Cuando las siguientes opciones son entendidas:

source: how many times to execute 'statement'
es: cuantas veces para ejecutar '*statement*'

source: how many times to repeat the timer (default 5)
es: cuantas veces se va a repetir el temporizador (predeterminado 5)

source: statement to be executed once initially (default ``pass``)
es: instrucción a ser ejecutada una vez inicialmente (por defecto ``pass``)

source: measure process time, not wallclock time, using :func:`time.process_time` instead of :func:`time.perf_counter`, which is the default
es: mide el tiempo de proceso, no el tiempo total de ejecución, utilizando :func:`time.process_time` en lugar de :func:`time.perf_counter`, que es el valor predeterminado

source: specify a time unit for timer output; can select ``nsec``, ``usec``, ``msec``, or ``sec``
es: especifica una unidad de tiempo para la salida del temporizador; puede seleccionar ``nsec``, ``usec``, ``msec`` o ``sec``

source: print raw timing results; repeat for more digits precision
es: imprime los resultados de tiempo en bruto; repetir para más dígitos de precisión

source: print a short usage message and exit
es: imprime un mensaje de uso corto y sale

source: A multi-line statement may be given by specifying each line as a separate statement argument; indented lines are possible by enclosing an argument in quotes and using leading spaces. Multiple :option:`-s` options are treated similarly.
es: Se puede dar una instrucción de varias líneas especificando cada línea como un argumento de instrucción independiente; Las líneas con sangría son posibles entrecomillando un argumento y utilizando espacios iniciales. Múltiples opciones :option:`-s` se tratan de forma similar.

source: If :option:`-n` is not given, a suitable number of loops is calculated by trying increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the total time is at least 0.2 seconds.
es: Si no se da :option:`-n`, se calcula un número adecuado de bucles intentando aumentar los números de la secuencia 1, 2, 5, 10, 20, 50, ... hasta que el tiempo total sea de al menos 0.2 segundos.

source: :func:`default_timer` measurements can be affected by other programs running on the same machine, so the best thing to do when accurate timing is necessary is to repeat the timing a few times and use the best time. The :option:`-r` option is good for this; the default of 5 repetitions is probably enough in most cases. You can use :func:`time.process_time` to measure CPU time.
es: Las mediciones de :func:`default_timer` pueden verse afectadas por otros programas que se ejecutan en la misma máquina, por lo que lo mejor que se puede hacer cuando es necesario una medición de tiempo precisa es repetir la medición un par de veces y utilizar el mejor tiempo. La opción :option:`-r` es buena para esto; el valor predeterminado de 5 repeticiones es probablemente suficiente en la mayoría de los casos. Puede usar :func:`time.process_time` para medir el tiempo de CPU.

source: There is a certain baseline overhead associated with executing a pass statement. The code here doesn't try to hide it, but you should be aware of it. The baseline overhead can be measured by invoking the program without arguments, and it might differ between Python versions.
es: Hay una cierta sobrecarga de línea base asociada con la ejecución de una instrucción pass. El código aquí no intenta ocultarlo, pero debe ser consciente de ello. La sobrecarga de línea base se puede medir invocando el programa sin argumentos y puede diferir entre versiones de Python.

source: Examples
es: Ejemplos

source: It is possible to provide a setup statement that is executed only once at the beginning:
es: Es posible proporcionar una instrucción *setup* que se ejecuta solo una vez al inicio:

source: In the output, there are three fields. The loop count, which tells you how many times the statement body was run per timing loop repetition. The repetition count ('best of 5') which tells you how many times the timing loop was repeated, and finally the time the statement body took on average within the best repetition of the timing loop. That is, the time the fastest repetition took divided by the loop count.
es: En la salida, hay tres campos. El conteo del bucle, que indica cuántas veces se ejecutó el cuerpo de la declaración por tiempo de repetición del bucle. El conteo de repeticiones ("el mejor de 5") el cual indica cuántas veces se repitió el ciclo de tiempo y, finalmente, el tiempo promedio que tomó el cuerpo de la declaración dentro de la mejor repetición del ciclo de tiempo. Es decir, el tiempo que tomó la repetición más rápida dividido por el número de bucles.

source: The same can be done using the :class:`Timer` class and its methods::
es: Se puede hacer lo mismo usando la clase :class:`Timer` y sus métodos::

source: The following examples show how to time expressions that contain multiple lines. Here we compare the cost of using :func:`hasattr` vs. :keyword:`try`/:keyword:`except` to test for missing and present object attributes:
es: En los ejemplos siguientes se muestra cómo cronometrar expresiones que contienen varias líneas. Aquí comparamos el coste de usar :func:`hasattr` frente a :keyword:`try`/:keyword:`except` para probar los atributos de objeto faltantes y presentes:

source: To give the :mod:`timeit` module access to functions you define, you can pass a *setup* parameter which contains an import statement::
es: Para dar al módulo :mod:`timeit` acceso a las funciones que defina, puede pasar un parámetro *setup* que contenga una instrucción import::

source: Another option is to pass :func:`globals` to the *globals* parameter, which will cause the code to be executed within your current global namespace. This can be more convenient than individually specifying imports::
es: Otra opción es pasar :func:`globals` al parámetro *globals*, lo que hará que el código se ejecute dentro del espacio de nombres global actual. Esto puede ser más conveniente que especificar individualmente las importaciones::
