Repository: python/python-docs-es
Catalog: library/time.po
Languages: es

source: :mod:`time` --- Time access and conversions
es: :mod:`time` --- Acceso a tiempo y conversiones

source: This module provides various time-related functions. For related functionality, see also the :mod:`datetime` and :mod:`calendar` modules.
es: Este módulo proporciona varias funciones relacionadas con el tiempo. Para la funcionalidad relacionada, consulte también los módulos :mod:`datetime` y :mod:`calendar`.

source: Although this module is always available, not all functions are available on all platforms. Most of the functions defined in this module call platform C library functions with the same name. It may sometimes be helpful to consult the platform documentation, because the semantics of these functions varies among platforms.
es: Aunque este módulo siempre está disponible, no todas las funciones están disponibles en todas las plataformas. La mayoría de las funciones definidas en este módulo llaman a funciones C de la biblioteca de la plataforma con el mismo nombre. A veces puede ser útil consultar la documentación de la plataforma, ya que la semántica de estas funciones varía entre plataformas.

source: An explanation of some terminology and conventions is in order.
es: Una explicación de algunas terminologías y convenciones está en orden.

source: The :dfn:`epoch` is the point where the time starts, the return value of ``time.gmtime(0)``. It is January 1, 1970, 00:00:00 (UTC) on all platforms.
es: Una :dfn:`epoch` es el punto en el cual el tiempo empieza, el valor retorno de la función ``time.gmtime(0)``. El cual es Enero, 1, 1970, 00:00:00(UTC) en todas las plataformas.

source: The term :dfn:`seconds since the epoch` refers to the total number of elapsed seconds since the epoch, typically excluding `leap seconds`_. Leap seconds are excluded from this total on all POSIX-compliant platforms.
es: El término :dfn:`seconds since the epoch` se refiere al número total de segundos transcurridos desde la época, excluyendo típicamente `leap seconds`_ . Los segundos intercalares se excluyen de este total en todas las plataformas compatibles con POSIX.

source: Function :func:`strptime` can parse 2-digit years when given ``%y`` format code. When 2-digit years are parsed, they are converted according to the POSIX and ISO C standards: values 69--99 are mapped to 1969--1999, and values 0--68 are mapped to 2000--2068.
es: La función :func:`strptime` puede analizar años de 2 dígitos cuando se le da el código de formato ``%y``. Cuando se analizan los años de 2 dígitos, se convierten de acuerdo con los estándares POSIX e ISO C: los valores 69--99 se asignan a 1969--1999, y los valores 0--68 se asignan a 2000--2068.

source: UTC is Coordinated Universal Time (formerly known as Greenwich Mean Time, or GMT). The acronym UTC is not a mistake but a compromise between English and French.
es: UTC es la hora universal coordinada (anteriormente conocida como hora media de Greenwich, o GMT). El acrónimo UTC no es un error, sino un compromiso entre inglés y francés.

source: DST is Daylight Saving Time, an adjustment of the timezone by (usually) one hour during part of the year. DST rules are magic (determined by local law) and can change from year to year. The C library has a table containing the local rules (often it is read from a system file for flexibility) and is the only source of True Wisdom in this respect.
es: El horario de verano es el horario de verano, un ajuste de la zona horaria por (generalmente) una hora durante parte del año. Las reglas DST son mágicas (determinadas por la ley local) y pueden cambiar de un año a otro. La biblioteca C tiene una tabla que contiene las reglas locales (a menudo se lee desde un archivo del sistema para flexibilidad) y es la única fuente de verdadera sabiduría en este sentido.

source: The precision of the various real-time functions may be less than suggested by the units in which their value or argument is expressed. E.g. on most Unix systems, the clock "ticks" only 50 or 100 times a second.
es: La precisión de las diversas funciones en tiempo real puede ser inferior a la sugerida por las unidades en las que se expresa su valor o argumento. P.ej. En la mayoría de los sistemas Unix, el reloj "funciona" solo 50 o 100 veces por segundo.

source: On the other hand, the precision of :func:`.time` and :func:`sleep` is better than their Unix equivalents: times are expressed as floating point numbers, :func:`.time` returns the most accurate time available (using Unix :c:func:`gettimeofday` where available), and :func:`sleep` will accept a time with a nonzero fraction (Unix :c:func:`select` is used to implement this, where available).
es: Por otro lado, la precisión de :func:`.time` y :func:`sleep` es mejor que sus equivalentes Unix: los tiempos se expresan como números de coma flotante, :func:`.time` retorna el tiempo más preciso disponible (usando Unix :c:func:`gettimeofday` donde esté disponible) y :func:`sleep` aceptará un tiempo con una fracción distinta de cero (Unix :c:func:`select` se usa para implementar esto, donde esté disponible).

source: The time value as returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`, and accepted by :func:`asctime`, :func:`mktime` and :func:`strftime`, is a sequence of 9 integers. The return values of :func:`gmtime`, :func:`localtime`, and :func:`strptime` also offer attribute names for individual fields.
es: El valor de tiempo retornado por :func:`gmtime`, :func:`localtime`, y :func:`strptime`, y aceptado por :func:`asctime`, :func:`mktime` y :func:`strftime`, es una secuencia de 9 enteros. Los valores de retorno de :func:`gmtime`, :func:`localtime`, y :func:`strptime` también ofrecen nombres de atributos para campos individuales.

source: See :class:`struct_time` for a description of these objects.
es: Ver :class:`struct_time` para una descripción de estos objetos.

source: The :class:`struct_time` type was extended to provide the :attr:`tm_gmtoff` and :attr:`tm_zone` attributes when platform supports corresponding ``struct tm`` members.
es: El tipo :class:`struct_time` se extendió para proporcionar los atributos :attr:`tm_gmtoff` y :attr:`tm_zone` cuando la plataforma admite los miembros correspondientes de ``struct tm``.

source: The :class:`struct_time` attributes :attr:`tm_gmtoff` and :attr:`tm_zone` are now available on all platforms.
es: Los atributos :class:`struct_time` :attr:`tm_gmtoff` y :attr:`tm_zone` ahora están disponibles en todas las plataformas.

source: Use the following functions to convert between time representations:
es: Use las siguientes funciones para convertir entre representaciones de tiempo:

source: From
es: Desde

source: To
es: A

source: Use
es: Usar

source: seconds since the epoch
es: segundos desde la época

source: :class:`struct_time` in UTC
es: :class:`struct_time` en UTC

source: :class:`struct_time` in local time
es: :class:`struct_time` en hora local

source: Functions
es: Las Funciones

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string of the following form: ``'Sun Jun 20 23:21:05 1993'``. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
es: Convierta una tupla o :class:`struct_time` que represente una hora retornada por :func:`gmtime` o :func:`localtime` en una cadena de la siguiente forma: ``'Dom 20 de junio 23:21:05 1993'``. El campo del día tiene dos caracteres de largo y se rellena con espacio si el día es un solo dígito, por ejemplo: ``'Miercoles 9 de Julio 04:26:40 1993'``.

source: If *t* is not provided, the current time as returned by :func:`localtime` is used. Locale information is not used by :func:`asctime`.
es: Si no se proporciona *t*, se utiliza la hora actual retornada por :func:`localtime`. La información regional no es utilizada por :func:`asctime`.

source: Unlike the C function of the same name, :func:`asctime` does not add a trailing newline.
es: A diferencia de la función C del mismo nombre, :func:`asctime` no agrega una nueva línea final.

source: Return the *clk_id* of the thread-specific CPU-time clock for the specified *thread_id*.
es: Retorna el *clk_id* del reloj de tiempo de CPU específico del subproceso para el *thread_id* especificado.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
es: Utilice :func:`threading.get_ident` o el atributo :attr:`~threading.Thread.ident` de objetos :class:`threading.Thread` para obtener un valor adecuado para * thread_id*.

source: Passing an invalid or expired *thread_id* may result in undefined behavior, such as segmentation fault.
es: Pasar un * thread_id * no válido o caducado puede provocar un comportamiento indefinido, como un error de segmentación.

source: Return the resolution (precision) of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
es: Retorna la resolución (precisión) del reloj especificado *clk_id*. Consulte :ref:`time-clock-id-constants` para obtener una lista de los valores aceptados para *clk_id*.

source: :ref:`Availability <availability>`: Unix.
es: :ref:`Disponibilidad <availability>`: Unix.

source: Return the time of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
es: Retorna la hora del reloj especificado *clk_id*. Consulte :ref:`time-clock-id-constants` para obtener una lista de los valores aceptados para *clk_id*.

source: Use :func:`clock_gettime_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice :func:`clock_gettime_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: Similar to :func:`clock_gettime` but return time as nanoseconds.
es: Similar a :func:`clock_gettime` pero retorna el tiempo en nanosegundos.

source: Set the time of the specified clock *clk_id*. Currently, :data:`CLOCK_REALTIME` is the only accepted value for *clk_id*.
es: Establece la hora del reloj especificado *clk_id*. Actualmente, :data:`CLOCK_REALTIME` es el único valor aceptado para *clk_id*.

source: Use :func:`clock_settime_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice :func:`clock_settime_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: Similar to :func:`clock_settime` but set time with nanoseconds.
es: Similar a :func:`clock_settime` pero establece el tiempo con nanosegundos.

source: If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. ``ctime(secs)`` is equivalent to ``asctime(localtime(secs))``. Locale information is not used by :func:`ctime`.
es: Si no se proporciona *secs* o :const:`None`, se utiliza la hora actual retornada por :func:`.time`. ``ctime(secs)`` es equivalente a ``asctime(localtime(secs))``. La información de configuración regional no la utiliza :func:`ctime`.

source: Get information on the specified clock as a namespace object. Supported clock names and the corresponding functions to read their value are:
es: Obtenga información sobre el reloj especificado como un objeto de espacio de nombres. Los nombres de reloj admitidos y las funciones correspondientes para leer su valor son:

source: The result has the following attributes:
es: El resultado tiene los siguientes atributos:

source: *adjustable*: ``True`` if the clock can be changed automatically (e.g. by a NTP daemon) or manually by the system administrator, ``False`` otherwise
es: *afjustable*: ``True`` si el reloj se puede cambiar automáticamente (por ejemplo, por un demonio NTP) o manualmente por el administrador del sistema, ``False`` de lo contrario

source: *implementation*: The name of the underlying C function used to get the clock value. Refer to :ref:`time-clock-id-constants` for possible values.
es: *implementation*: el nombre de la función C subyacente utilizada para obtener el valor del reloj. Consulte :ref:`time-clock-id-constants` para conocer los posibles valores.

source: *monotonic*: ``True`` if the clock cannot go backward, ``False`` otherwise
es: *monotonic*: ``True`` si el reloj no puede retroceder, ``False`` de lo contrario

source: *resolution*: The resolution of the clock in seconds (:class:`float`)
es: *resolution*: La resolución del reloj en segundos (:class:`float`)

source: Like :func:`gmtime` but converts to local time. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. The dst flag is set to ``1`` when DST applies to the given time.
es: Como :func:`gmtime` pero se convierte a la hora local. Si no se proporciona *secs* o :const:`None`, se utiliza la hora actual retornada por :func:`.time`. El indicador *dst* se establece en ``1`` cuando DST se aplica al tiempo dado.

source: :func:`localtime` may raise :exc:`OverflowError`, if the timestamp is outside the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years between 1970 and 2038.
es: :func:`localtime` podría lanzar un :exc:`OverflowError`, si los valores de la marca de tiempo están fuera del rango soportado por las funciones :c:func:`localtime` o :c:func:`gmtime` de la plataforma C, y el :exc:`OSError` en las funciones :c:func:`localtime` o :c:func:`gmtime`. Es común que este esté restringido para los años entre 1970 y 2038.

source: This is the inverse function of :func:`localtime`. Its argument is the :class:`struct_time` or full 9-tuple (since the dst flag is needed; use ``-1`` as the dst flag if it is unknown) which expresses the time in *local* time, not UTC. It returns a floating point number, for compatibility with :func:`.time`. If the input value cannot be represented as a valid time, either :exc:`OverflowError` or :exc:`ValueError` will be raised (which depends on whether the invalid value is caught by Python or the underlying C libraries). The earliest date for which it can generate a time is platform-dependent.
es: Esta es la función inversa de :func:`localtime`. Su argumento es :class:`struct_time` o una 9-tupla completa (ya que se necesita la bandera dst; use ``-1`` como la bandera *dst* si es desconocida) que expresa la hora en hora *local*, no UTC. Retorna un número de coma flotante, por compatibilidad con :func:`.time`. Si el valor de entrada no se puede representar como un tiempo válido, se lanzará :exc:`OverflowError` o :exc:`ValueError` (que depende de si Python o las bibliotecas C subyacentes capturan el valor no válido). La fecha más temprana para la que puede generar una hora depende de la plataforma.

source: Return the value (in fractional seconds) of a monotonic clock, i.e. a clock that cannot go backwards. The clock is not affected by system clock updates. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
es: Retorna el valor (en segundos fraccionarios) de un reloj monótono, es decir, un reloj que no puede retroceder. El reloj no se ve afectado por las actualizaciones del reloj del sistema. El punto de referencia del valor retornado no está definido, de modo que sólo la diferencia entre los resultados de dos llamadas es válida.

source: Use :func:`monotonic_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice :func:`monotonic_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: The function is now always available and always system-wide.
es: La función ahora está siempre disponible y siempre en todo el sistema.

source: On macOS, the function is now system-wide.
es: En macOS, la función ahora es para todo el sistema.

source: Similar to :func:`monotonic`, but return time as nanoseconds.
es: Similar a :func:`monotonic`, pero el tiempo de retorno es en nanosegundos.

source: Return the value (in fractional seconds) of a performance counter, i.e. a clock with the highest available resolution to measure a short duration. It does include time elapsed during sleep and is system-wide. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
es: Retorna el valor (en fracciones de segundo) de un contador de rendimiento, es decir, un reloj con la resolución más alta disponible para medir una corta duración. Incluye el tiempo transcurrido durante el sleep y abarca todo el sistema. El punto de referencia del valor retornado no está definido, de modo que sólo la diferencia entre los resultados de dos llamadas es válida.

source: Use :func:`perf_counter_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice la función :func:`perf_counter_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: On Windows, the function is now system-wide.
es: En Windows, la función ahora es para todo el sistema.

source: Similar to :func:`perf_counter`, but return time as nanoseconds.
es: Similar a :func:`perf_counter`, pero el tiempo de retorno es en nanosegundos.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current process. It does not include time elapsed during sleep. It is process-wide by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
es: Retorna el valor (en fracciones de segundo) de la suma del sistema y el tiempo de CPU del usuario del proceso actual. No incluye el tiempo transcurrido durante el sleep. Es todo el proceso por definición. El punto de referencia del valor retornado no está definido, de modo que sólo la diferencia entre los resultados de dos llamadas es válida.

source: Use :func:`process_time_ns` to avoid the precision loss caused by the :class:`float` type.
es: Utilice :func:`process_time_ns` para evitar la pérdida de precisión que causa el tipo :class:`float`.

source: Similar to :func:`process_time` but return time as nanoseconds.
es: Similar a :func:`process_time` pero retorna el tiempo en nanosegundos.

source: Suspend execution of the calling thread for the given number of seconds. The argument may be a floating point number to indicate a more precise sleep time.
es: Suspende la ejecución del hilo que invoca por el número de segundos especificado. El argumento puede ser un número de coma flotante para indicar de forma más precisa el tiempo a dormir.

source: If the sleep is interrupted by a signal and no exception is raised by the signal handler, the sleep is restarted with a recomputed timeout.
es: Si el sleep es interrumpido por una señal y ninguna excepción fue lanzada por el gestor de señales, este sleep es reiniciado con un tiempo límite recalculado.

source: The suspension time may be longer than requested by an arbitrary amount, because of the scheduling of other activity in the system.
es: El tiempo de suspensión podría ser mayor al requerido por un monto arbitrario, a raíz de la programación de otra actividad del sistema.

source: On Windows, if *secs* is zero, the thread relinquishes the remainder of its time slice to any other thread that is ready to run. If there are no other threads ready to run, the function returns immediately, and the thread continues execution. On Windows 8.1 and newer the implementation uses a `high-resolution timer <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ which provides resolution of 100 nanoseconds. If *secs* is zero, ``Sleep(0)`` is used.
es: En Windows, si *secs* es cero, el hilo entrega el sobrante de su tiempo a cualquier otro hilo que este listo para ejecución. Si no hay ningún otro hilo listo para ejecución, la función inmediatamente se retorna, y el hilo continúa con su ejecución. En Windows 8.1 y versiones más recientes la implementación usa un `cronómetro de alta resolución <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ que provee una resolución de 100 nanosegundos. Si *secs* es cero, ``Sleep(0)`` es empleado.

source: Unix implementation:
es: Implementación en Unix:

source: Use ``clock_nanosleep()`` if available (resolution: 1 nanosecond);
es: Si está disponible, use ``clock_nanosleep()`` (resolución: 1 nanosegundo);

source: Or use ``nanosleep()`` if available (resolution: 1 nanosecond);
es: O use ``nanosleep()`` si está disponible (resolución: 1 nanosegundo);

source: Or use ``select()`` (resolution: 1 microsecond).
es: O use ``select()`` (resolución: 1 microsegundo).

source: The function now sleeps at least *secs* even if the sleep is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale).
es: La función ahora duerme al menos * segundos * incluso si el sleep es interrumpido por una señal, excepto si el manejador de la señal genera una excepción (ver :pep:`475` para la justificación).

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string as specified by the *format* argument. If *t* is not provided, the current time as returned by :func:`localtime` is used. *format* must be a string. :exc:`ValueError` is raised if any field in *t* is outside of the allowed range.
es: Convierta una tupla o :class:`struct_time` que represente un tiempo retornado por :func:`gmtime` o :func:`localtime` en una cadena como se especifica mediante el argumento *format*. Si no se proporciona *t*, se utiliza la hora actual retornada por :func:`localtime`. *format* debe ser una cadena. Se lanza un :exc:`ValueError` si algún campo en *t* está fuera del rango permitido.

source: 0 is a legal argument for any position in the time tuple; if it is normally illegal the value is forced to a correct one.
es: 0 es un argumento legal para cualquier posición en la tupla de tiempo; si normalmente es ilegal, el valor se fuerza a uno correcto.

source: The following directives can be embedded in the *format* string. They are shown without the optional field width and precision specification, and are replaced by the indicated characters in the :func:`strftime` result:
es: Las siguientes directivas se pueden incrustar en la cadena *format*. Se muestran sin el ancho de campo opcional y la especificación de precisión, y se reemplazan por los caracteres indicados en el resultado :func:`strftime`:

source: Directive
es: Directiva

source: Meaning
es: Significado

source: Notes
es: Notas

source: Locale's abbreviated weekday name.
es: Nombre abreviado del día local de la localidad.

source: Locale's full weekday name.
es: Nombre completo del día laborable de Localidad.

source: Locale's abbreviated month name.
es: Nombre abreviado del mes de la localidad.

source: Locale's full month name.
es: Nombre completo del mes de la localidad.

source: Locale's appropriate date and time representation.
es: Representación apropiada de fecha y hora de la localidad.

source: Day of the month as a decimal number [01,31].
es: Día del mes como número decimal [01,31].

source: Hour (24-hour clock) as a decimal number [00,23].
es: Hora (reloj de 24 horas) como un número decimal [00,23].

source: Hour (12-hour clock) as a decimal number [01,12].
es: Hora (reloj de 12 horas) como un número decimal [01,12].

source: Day of the year as a decimal number [001,366].
es: Día del año como número decimal [001,366].

source: Month as a decimal number [01,12].
es: Mes como un número decimal [01,12].

source: Minute as a decimal number [00,59].
es: Minuto como un número decimal [00,59].

source: Locale's equivalent of either AM or PM.
es: El equivalente de la configuración regional de AM o PM.
