Repository: python/python-docs-es
Catalog: library/tkinter.po
Languages: es

source: :mod:`tkinter` --- Python interface to Tcl/Tk
es: :mod:`tkinter` --- Interface de Python para Tcl/Tk

source: **Source code:** :source:`Lib/tkinter/__init__.py`
es: **Código fuente:** :source:`Lib/tkinter/__init__.py`

source: The :mod:`tkinter` package ("Tk interface") is the standard Python interface to the Tcl/Tk GUI toolkit. Both Tk and :mod:`tkinter` are available on most Unix platforms, including macOS, as well as on Windows systems.
es: El paquete :mod:`tkinter` ("interfaz Tk") es la interfaz por defecto de Python para el kit de herramientas de GUI Tk. Tanto Tk como :mod:`tkinter` están disponibles en la mayoría de las plataformas Unix, así como en sistemas Windows (Tk en sí no es parte de Python, es mantenido por ActiveState).

source: Running ``python -m tkinter`` from the command line should open a window demonstrating a simple Tk interface, letting you know that :mod:`tkinter` is properly installed on your system, and also showing what version of Tcl/Tk is installed, so you can read the Tcl/Tk documentation specific to that version.
es: Ejecutar ``python -m tkinter`` desde la línea de comandos debería abrir una ventana que demuestre una interfaz Tk simple para saber si :mod:`tkinter` está instalado correctamente en su sistema. También muestra qué versión de Tcl/Tk está instalada para que pueda leer la documentación de Tcl/Tk específica de esa versión.

source: Tkinter supports a range of Tcl/Tk versions, built either with or without thread support. The official Python binary release bundles Tcl/Tk 8.6 threaded. See the source code for the :mod:`_tkinter` module for more information about supported versions.
es: Tkinter soporta un amplio rango de versiones TCL/TK, construidos con o sin soporte de hilo. La versión oficial del binario de python incluye Tcl/Tk 8.6 con subprocesos. Vea el código fuente para el módulo :mod:`_tkinter` para mayor información acerca de las versiones soportadas.

source: Tkinter is not a thin wrapper, but adds a fair amount of its own logic to make the experience more pythonic. This documentation will concentrate on these additions and changes, and refer to the official Tcl/Tk documentation for details that are unchanged.
es: Tkinter no es un subproceso liviano pero agrega una buena cantidad de su propia lógica para hacer la experiencia mas pythónico. Esta documentación se concentrará en estas adiciones y cambios, refiriéndose sobre la documentación oficial de Tcl-Tk para los detalles que no han sido cambiados.

source: Tcl/Tk 8.5 (2007) introduced a modern set of themed user interface components along with a new API to use them. Both old and new APIs are still available. Most documentation you will find online still uses the old API and can be woefully outdated.
es: Tcl/Tk 8.5 (2007) introdujo un moderno conjunto de componentes temáticos de interfaz de usuario en conjunto con una nueva API para ser usada. Ambas API tanto la antigua como la nueva están disponibles. La mayor parte de la documentación que podrá encontrar en línea aún usa la antigua versión de la API y por lo tanto podría estar desactualizada.

source: `TkDocs <http://tkdocs.com/>`_
es: `TKDocs <http://www.tkdocs.com/>`_

source: Extensive tutorial on creating user interfaces with Tkinter. Explains key concepts, and illustrates recommended approaches using the modern API.
es: Es un extenso tutorial sobre como crear interfaces de usuario con Tkinter. Explica conceptos clave y muestra enfoques recomendados para usar la API moderna.

source: Reference documentation for Tkinter 8.5 detailing available classes, methods, and options.
es: Documentación de referencia sobre Tkinter 8.5 donde se detallan clases disponibles, métodos y opciones.

source: Tcl/Tk Resources:
es: Recursos de Tcl/Tk:

source: `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_
es: `Comandos Tk <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_

source: Comprehensive reference to each of the underlying Tcl/Tk commands used by Tkinter.
es: Referencia exhaustiva para cada uno de los comandos subyacentes utilizados por Tkinter.

source: Additional documentation, and links to Tcl/Tk core development.
es: Documentación adicional y enlaces al núcleo de desarrollo de Tcl/Tk.

source: Books:
es: Libros:

source: `Modern Tkinter for Busy Python Developers <https://tkdocs.com/book.html>`_
es: `Modern Tkinter for Busy Python Developers <https://www.amazon.com/Modern-Tkinter-Python-Developers-ebook/dp/B0071QDNLO/>`_

source: By Mark Roseman. (ISBN 978-1999149567)
es: Escrito por Mark Roseman (ISBN 978-1999149567)

source: `Python and Tkinter Programming <https://www.packtpub.com/product/python-gui-programming-with-tkinter/9781788835886>`_
es: `Python y la programación de Tkinter <https://www.manning.com/books/python-and-tkinter-programming>`_

source: By Alan Moore. (ISBN 978-1788835886)
es: Escrito por Alan Moore (ISBN 978-1788835886)

source: By Mark Lutz; has excellent coverage of Tkinter. (ISBN 978-0596158101)
es: Escrito por Mark Lutz, que cubre los tópicos de Tkinter de forma excelente. (ISBN 978-0596158101)

source: `Tcl and the Tk Toolkit (2nd edition) <https://www.amazon.com/exec/obidos/ASIN/032133633X>`_
es: `Tcl and the Tk Toolkit <https://www.amazon.com/exec/obidos/ASIN/020163337X>`_

source: By John Ousterhout, inventor of Tcl/Tk, and Ken Jones; does not cover Tkinter. (ISBN 978-0321336330)
es: Escrito por John Ousterhout, creador de Tcl/Tk y Kevin Jones, el cual no cubre Tkinter. (ISBN 978-0321336330)

source: Architecture
es: Arquitectura

source: Tcl/Tk is not a single library but rather consists of a few distinct modules, each with separate functionality and its own official documentation. Python's binary releases also ship an add-on module together with it.
es: Tcl/Tk no es una biblioteca única mas bien consiste en unos pocos módulos distintivos entre si. cada uno separados por funcionalidades y que poseen su documentación oficial. Las versiones del binario de Python también incluyen un módulo adicional con esto.

source: Tcl is a dynamic interpreted programming language, just like Python. Though it can be used on its own as a general-purpose programming language, it is most commonly embedded into C applications as a scripting engine or an interface to the Tk toolkit. The Tcl library has a C interface to create and manage one or more instances of a Tcl interpreter, run Tcl commands and scripts in those instances, and add custom commands implemented in either Tcl or C. Each interpreter has an event queue, and there are facilities to send events to it and process them. Unlike Python, Tcl's execution model is designed around cooperative multitasking, and Tkinter bridges this difference (see `Threading model`_ for details).
es: Tcl es un lenguaje de programación interpretado y dinámico, tal como Python. Aunque puede ser usado en si mismo como un lenguaje de programación de uso general, lo más común es que se utilice en aplicaciones del lenguaje C como un motor de secuencias de comandos o como una interfaz hacia el kit de herramientas de Tk. La librería TCL contiene una interfaz con C que crea y gestiona una o más instancias del intérprete de TCL, corre los comandos en TCL en esas instancias y agrega comandos personalizados tanto en Tcl o C. Cada intérprete tiene su cola de eventos y entrega facilidades para enviar procesos a la cola y procesarlos. A diferencia de Python, el modelo de ejecución en Tcl es diseñado alrededor de cooperar en múltiples asignaciones y Tkinter ayuda a salvar estas diferencias (ver `Threading model`_ for details).

source: Tk is a `Tcl package <http://wiki.tcl.tk/37432>`_ implemented in C that adds custom commands to create and manipulate GUI widgets. Each :class:`Tk` object embeds its own Tcl interpreter instance with Tk loaded into it. Tk's widgets are very customizable, though at the cost of a dated appearance. Tk uses Tcl's event queue to generate and process GUI events.
es: Tk es un paquete de `Tcl package <http://wiki.tcl.tk/37432>` implementado en C el cual agrega comandos personalizados donde se pueden manipular *widgets* en la GUI. Cada objeto de la clase :class:`Tk` agrega su instancia de interprete Tcl con Tk cargado en el. Los *widgets* de Tk son muy personalizables, aunque a costa de una apariencia anticuada. Tk usa eventos de la cola de Tcl para generar y procesar eventos de la GUI.

source: Themed Tk (Ttk) is a newer family of Tk widgets that provide a much better appearance on different platforms than many of the classic Tk widgets. Ttk is distributed as part of Tk, starting with Tk version 8.5. Python bindings are provided in a separate module, :mod:`tkinter.ttk`.
es: El nuevo tema Tk (Ttk) es una nueva familia de widgets de Tk que proveen una mejor apariencia en diferentes plataformas mas que varios de los widgets clásicos de Tk. Ttk es distribuido como parte de Tk estando disponible a partir de la versión 8.5. Enlaces para Python son entregados en un módulo aparte, :mod:`tkinter.ttk`.

source: Internally, Tk and Ttk use facilities of the underlying operating system, i.e., Xlib on Unix/X11, Cocoa on macOS, GDI on Windows.
es: Internamente, Tk y Ttk usan funcionalidades del sistema operativo subyacente, en otras palabras, Xlib en Unix/X11, Cocoa en macOS o GDI en Windows.

source: When your Python application uses a class in Tkinter, e.g., to create a widget, the :mod:`tkinter` module first assembles a Tcl/Tk command string. It passes that Tcl command string to an internal :mod:`_tkinter` binary module, which then calls the Tcl interpreter to evaluate it. The Tcl interpreter will then call into the Tk and/or Ttk packages, which will in turn make calls to Xlib, Cocoa, or GDI.
es: Cuando su aplicación de Python una una clase en Tkinter, p.ej, para crear un widget, el módulo :mod:`tkinter` emsambla una cadena de comando Tcl/Tk. Entonces se pasa esa cadena de comando Tcl a un módulo binario interno: mod: `_tkinter`, que luego llama al intérprete Tcl para evaluarlo. El intérprete de Tcl llamará a los paquetes Tk y o Ttk, que a su vez realizarán llamadas a Xlib, Cocoa o GDI.

source: Tkinter Modules
es: Módulos Tkinter

source: Support for Tkinter is spread across several modules. Most applications will need the main :mod:`tkinter` module, as well as the :mod:`tkinter.ttk` module, which provides the modern themed widget set and API::
es: El soporte para Tkinter se distribuye para varios módulos. la mayor parte de las aplicaciones necesitaran el módulo base :mod:`tkinter`, así como también el módulo :mod:`tkinter.ttk`, el cual entrega el conjunto de widgets temáticos y la API correspondiente:

source: The :class:`Tk` class is instantiated without arguments. This creates a toplevel widget of Tk which usually is the main window of an application. Each instance has its own associated Tcl interpreter.
es: La clase :class:`Tk` se instancia sin argumentos. Esto crea un widget de nivel superior de Tk que generalmente es la ventana principal de una aplicación. Cada instancia tiene su propio intérprete Tcl asociado.

source: The :func:`Tcl` function is a factory function which creates an object much like that created by the :class:`Tk` class, except that it does not initialize the Tk subsystem. This is most often useful when driving the Tcl interpreter in an environment where one doesn't want to create extraneous toplevel windows, or where one cannot (such as Unix/Linux systems without an X server). An object created by the :func:`Tcl` object can have a Toplevel window created (and the Tk subsystem initialized) by calling its :meth:`loadtk` method.
es: La función :func:`Tcl` es una función de fábrica que crea un objeto muy similar al creado por la clase :class:`Tk`, excepto que no inicializa el subsistema Tk. Esto suele ser útil cuando se maneja el intérprete de Tcl en un entorno en el que no se desean crear ventanas de nivel superior extrañas o donde no se puede (como los sistemas Unix/Linux sin un servidor X). Un objeto creado por el objeto :func:`Tcl` puede tener una ventana *Toplevel* creada (y el subsistema Tk inicializado) llamando a su método :meth:`loadtk`.

source: The modules that provide Tk support include:
es: Otros módulos que proporcionan soporte a Tk incluyen:

source: Main Tkinter module.
es: Módulos de Tkinter.

source: Dialog to let the user choose a color.
es: Cuadro de diálogo que permite al usuario elegir un color.

source: Base class for the dialogs defined in the other modules listed here.
es: Clase base para cuadros de diálogo definidos en los otros módulos listados aquí.

source: Common dialogs to allow the user to specify a file to open or save.
es: Cuadros de diálogo por defecto que permiten al usuario especificar un archivo para abrir o guardar.

source: Utilities to help work with fonts.
es: Utilidades para ayudar a trabajar con fuentes.

source: Access to standard Tk dialog boxes.
es: Acceso a cuadros de diálogo estándar de Tk.

source: Text widget with a vertical scroll bar built in.
es: Widget de texto con una barra de desplazamiento vertical integrada.

source: Basic dialogs and convenience functions.
es: Cuadros de diálogo simples y funciones útiles.

source: Themed widget set introduced in Tk 8.5, providing modern alternatives for many of the classic widgets in the main :mod:`tkinter` module.
es: Un set de widgets temáticos fueron añadidos en Tk 8.5, entregando alternativas modernas para muchos de los widgets clásicos en el módulo principal de :mod:`tkinter`.

source: Additional modules:
es: Móduloss adicionales:

source: A binary module that contains the low-level interface to Tcl/Tk. It is automatically imported by the main :mod:`tkinter` module, and should never be used directly by application programmers. It is usually a shared library (or DLL), but might in some cases be statically linked with the Python interpreter.
es: Un módulo binario que contiene una interfaz de bajo nivel con Tcl/Tk. . Esto es automáticamente importado al módulo principal y nunca debe ser usado directamente por los p programadores de apliocaciones. Esto es usualmente una librería compartida (or DLL), pero podría en ciertos casos ser añadidos de forma estática por el interprete de Python.

source: Python's Integrated Development and Learning Environment (IDLE). Based on :mod:`tkinter`.
es: Entorno de aprendizaje y desarrollo integrado de Python (IDLE). Basado en :mod:`tkinter`.

source: Symbolic constants that can be used in place of strings when passing various parameters to Tkinter calls. Automatically imported by the main :mod:`tkinter` module.
es: Constantes simbólicas que pueden ser utilizadas en en lugar de cadenas de texto cuando se pasan varios parámetros a las llamadas de Tkinter. Automáticamente son importadas por el módulo principal :mod:`tkinter`.

source: (experimental) Drag-and-drop support for :mod:`tkinter`. This will become deprecated when it is replaced with the Tk DND.
es: De forma experimental está el soporte de arrastrar y soltar (*drag-and-drop*) para :mod:`tkinter`. Esto no se mantendrá cuando sea reemplazado por Tk DND.

source: (deprecated) An older third-party Tcl/Tk package that adds several new widgets. Better alternatives for most can be found in :mod:`tkinter.ttk`.
es: (Obsoleto) Un antiguo paquete de terceros para utilizar en Tcl/Tk que agrega un importante número de nuevos widgets. Se pueden encontrar mejores alternativas en el módulo :mod:`tkinter.ttk`.

source: Turtle graphics in a Tk window.
es: Gráficos de tortuga en una ventana Tk.

source: Tkinter Life Preserver
es: Guía de supervivencia de Tkinter

source: This section is not designed to be an exhaustive tutorial on either Tk or Tkinter. For that, refer to one of the external resources noted earlier. Instead, this section provides a very quick orientation to what a Tkinter application looks like, identifies foundational Tk concepts, and explains how the Tkinter wrapper is structured.
es: Esta seccion no fue pensada en ser un tutorial exhaustivo sobre cada tópico de Tk o Tkinter. Para esto, puede consultar en alguno de los recursos externos que fueron presentados anteriormente. En vez de eso, esta apartado entrega una orientación breve sobre como es ve una aplicación en Tkinter, identifica conceptos claves de Tk y explica como el empaquetador de Tkinter está estructurado.

source: The remainder of this section will help you to identify the classes, methods, and options you'll need in your Tkinter application, and where to find more detailed documentation on them, including in the official Tcl/Tk reference manual.
es: Es resto de esta sección lo ayudará a identificar las clases, métodos y opciones que necesitará en una aplicación de Tkinter y donde se puede encontrar documentación más detallada sobre esto, incluida en la guía de referencia oficial de Tcl/Tk.

source: A Hello World Program
es: Un programa simple de Hola Mundo

source: We'll start by walking through a "Hello World" application in Tkinter. This isn't the smallest one we could write, but has enough to illustrate some key concepts you'll need to know.
es: Comenzaremos a explorar Tkinter a través de una simple aplicación "Hola Mundo". Esta no es la aplicación mas pequeña que podríamos escribir, pero es suficiente para ilustrar algunos conceptos claves que necesitará saber.

source: After the imports, the next line creates an instance of the :class:`Tk` class, which initializes Tk and creates its associated Tcl interpreter. It also creates a toplevel window, known as the root window, which serves as the main window of the application.
es: Después de las declaraciones de import, la línea siguiente será la de crear la instancia de la clase :class:`Tk` la cual iniciativa Tk y crea el interprete asociado a Tcl. Esto también crea una ventana de nivel superior, conocida como la ventana raíz la cual sirve como la ventana principal de la aplicación.

source: The following line creates a frame widget, which in this case will contain a label and a button we'll create next. The frame is fit inside the root window.
es: En la siguiente línea se crea el marco del widget, el cual en este caso contendrá la etiqueta y el botón que crearemos después. El marco encaja dentro de la ventana raíz.

source: The next line creates a label widget holding a static text string. The :meth:`grid` method is used to specify the relative layout (position) of the label within its containing frame widget, similar to how tables in HTML work.
es: La próxima línea crea una etiqueta para el widget que contiene una cadena de texto estática. El método :meth:`grid` es usado para especificar la posición del diseño de la etiqueta que está dentro del marco del widget, similar a como trabajan las tablas en HTML.

source: A button widget is then created, and placed to the right of the label. When pressed, it will call the :meth:`destroy` method of the root window.
es: Es entonces cuando el botón del widget es creado y dejado a la derecha de la etiqueta. Una vez pulsado llamará al método :meth:`destroy` de la ventana raíz.

source: Finally, the :meth:`mainloop` method puts everything on the display, and responds to user input until the program terminates.
es: Finalmente el método :meth:`mainloop` muestra todo en pantalla y responde a la entrada del usuario hasta que el programa termina.

source: Important Tk Concepts
es: Conceptos importantes de Tk

source: Even this simple program illustrates the following key Tk concepts:
es: Incluso con este sencillo programa se pueden mostrar conceptos claves de Tk:

source: A Tkinter user interface is made up of individual *widgets*. Each widget is represented as a Python object, instantiated from classes like :class:`ttk.Frame`, :class:`ttk.Label`, and :class:`ttk.Button`.
es: Una interfaz de usuario de Tkinter está compuesta de varios widgets individuales. Cada widget es representado como un objeto de Python, instanciado desde clases tales como :class:`ttk.Frame`, :class:`ttk.Label` y :class:`ttk.Button`.

source: widget hierarchy
es: jerarquía de los widgets

source: Widgets are arranged in a *hierarchy*. The label and button were contained within a frame, which in turn was contained within the root window. When creating each *child* widget, its *parent* widget is passed as the first argument to the widget constructor.
es: Los widgets se organizan en jerarquías. La etiqueta y el botón estaban dentro del marco el que a su vez estaba contenido dentro del marco raíz. Cuando se crea cada *child* del widget su *parent* es pasado como el primer argumento del constructor del widget.

source: configuration options
es: opciones de configuración

source: Widgets have *configuration options*, which modify their appearance and behavior, such as the text to display in a label or button. Different classes of widgets will have different sets of options.
es: Los widgets tienen *configuration options* los cuales modifican su apariencia y comportamiento, como el texto que se despliega en la etiqueta o el botón. Diferentes clases de widgets tendrán diferentes conjuntos de opciones.

source: geometry management
es: gestión del diseño de formularios

source: Widgets aren't automatically added to the user interface when they are created. A *geometry manager* like ``grid`` controls where in the user interface they are placed.
es: Los widgets no son añadidos automáticamente a la interfaz de usuario una vez que han sido creados. Un *geometry manager* como controles de ``grid`` donde la interfaz de usuario es colocada.

source: event loop
es: ejecución del evento

source: Tkinter reacts to user input, changes from your program, and even refreshes the display only when actively running an *event loop*. If your program isn't running the event loop, your user interface won't update.
es: Tkinter reacciona a la entrada del usuario, realiza los cambios del programa e incluso actualiza lo que se muestra en pantalla solo cuando se ejecuta activamente un *event loop*. Si el programa no esta ejecutando el evento, su interfaz de usuario no se actualizará.

source: Understanding How Tkinter Wraps Tcl/Tk
es: Entendiendo como funcionan los empaquetadores de Tcl/Tk

source: When your application uses Tkinter's classes and methods, internally Tkinter is assembling strings representing Tcl/Tk commands, and executing those commands in the Tcl interpreter attached to your applicaton's :class:`Tk` instance.
es: Cuando su aplicación usa las clases y métodos de Tkinter este de forma interna ensambla cadenas de texto representadas como comandos de Tcl/Tk y ejecuta esos comandos en el intérprete de Tcl que esta adjunto a la instancia de su aplicación :class:`Tk`.

source: Whether it's trying to navigate reference documentation, trying to find the right method or option, adapting some existing code, or debugging your Tkinter application, there are times that it will be useful to understand what those underlying Tcl/Tk commands look like.
es: Tanto si se está intentando navegar en la documentación de referencia o intentando encontrar el método u opción correcta o adaptando algún código ya existente o depurando su aplicación en Tkinter, hay veces que es útil entender como son esos comandos subyacentes de Tcl/Tk.

source: To illustrate, here is the Tcl/Tk equivalent of the main part of the Tkinter script above.
es: Para ilustrar, aquí se tiene un equivalente en Tcl/Tk de la parte principal del script Tkinter anterior.

source: Tcl's syntax is similar to many shell languages, where the first word is the command to be executed, with arguments to that command following it, separated by spaces. Without getting into too many details, notice the following:
es: La sintaxis es similar a varios lenguajes de línea de comandos, donde la primera palabra es el comando que debe ser ejecutado con los argumentos que le siguen al comando, separados por espacios, Sin entrar en demasiados detalles, note lo siguiente:
