Repository: python/python-docs-es
Catalog: library/tkinter.ttk.po
Languages: es_es

source: :mod:`tkinter.ttk` --- Tk themed widgets
es_es: :mod:`tkinter.ttk` --- Tk widgets temáticos

source: **Source code:** :source:`Lib/tkinter/ttk.py`
es_es: **Código fuente:** :source:`Lib/tkinter/ttk.py`

source: The :mod:`tkinter.ttk` module provides access to the Tk themed widget set, introduced in Tk 8.5. If Python has not been compiled against Tk 8.5, this module can still be accessed if *Tile* has been installed. The former method using Tk 8.5 provides additional benefits including anti-aliased font rendering under X11 and window transparency (requiring a composition window manager on X11).
es_es: El módulo :mod:`tkinter.ttk` proporciona acceso al conjunto de widgets temáticos Tk, introducido en Tk 8.5. Si Python no se ha compilado con Tk 8.5, todavía se puede acceder a este módulo si se ha instalado *Tile*. El método anterior que utiliza Tk 8.5 proporciona ventajas adicionales, incluida la representación de fuentes suavizada en X11 y la transparencia de ventanas (requiere un administrador de ventanas de composición en X11).

source: The basic idea for :mod:`tkinter.ttk` is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
es_es: La idea básica de :mod:`tkinter.ttk` es separar, en la medida de lo posible, el comportamiento de un widget del código que implementa su apariencia.

source: `Tk Widget Styling Support <https://core.tcl.tk/tips/doc/trunk/tip/48.md>`_
es_es: `Soporte para estilos de Widgets Tk <https://core.tcl.tk/tips/doc/trunk/tip/48.md>`_

source: A document introducing theming support for Tk
es_es: Un documento que presenta apoyo temático para Tk

source: Using Ttk
es_es: Uso de Ttk

source: To start using Ttk, import its module::
es_es: Para empezar a utilizar Ttk, hay que importar su módulo::

source: To override the basic Tk widgets, the import should follow the Tk import::
es_es: Para anular los widgets Tk básicos, la importación debe seguir la importación de Tk::

source: That code causes several :mod:`tkinter.ttk` widgets (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` and :class:`Scrollbar`) to automatically replace the Tk widgets.
es_es: Ese código hace que varios widgets :mod:`tkinter.ttk` (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` y :class:`Scrollbar`) reemplacen automáticamente los widgets Tk.

source: This has the direct benefit of using the new widgets which gives a better look and feel across platforms; however, the replacement widgets are not completely compatible. The main difference is that widget options such as "fg", "bg" and others related to widget styling are no longer present in Ttk widgets. Instead, use the :class:`ttk.Style` class for improved styling effects.
es_es: Esto tiene el beneficio de usar los nuevos widgets que dan una mejor apariencia en todas las plataformas; sin embargo, el reemplazo de widgets no es completamente compatible. La principal diferencia es que las opciones de widgets como "fg", "bg" y otras relacionadas con el estilo del widget ya no están presentes en los widgets de Ttk. En su lugar, utiliza la clase :class:`ttk.Style` para mejorar los efectos de estilo.

source: `Converting existing applications to use Tile widgets <http://tktable.sourceforge.net/tile/doc/converting.txt>`_
es_es: `Conversión de aplicaciones existentes para usar widgets Tile <http://tktable.sourceforge.net/tile/doc/converting.txt>`_

source: A monograph (using Tcl terminology) about differences typically encountered when moving applications to use the new widgets.
es_es: Una monografía (utilizando la terminología Tcl) sobre las diferencias que normalmente se encuentran al modificar aplicaciones para usar los nuevos widgets.

source: Ttk comes with 18 widgets, twelve of which already existed in tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar`, and :class:`Spinbox`. The other six are new: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` and :class:`Treeview`. And all them are subclasses of :class:`Widget`.
es_es: Ttk viene con 18 widgets, doce de los cuales ya existían en tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar` y :class:`Spinbox`. Los otros seis son nuevos: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` y :class:`Treeview`. Y todas ellas son subclases de :class:`Widget`.

source: Using the Ttk widgets gives the application an improved look and feel. As discussed above, there are differences in how the styling is coded.
es_es: El uso de los widgets Ttk le da a la aplicación un aspecto mejorado. Como se ha mencionado anteriormente, hay diferencias en cómo se codifica el estilo.

source: Tk code::
es_es: Código Tk::

source: Ttk code::
es_es: Código Ttk::

source: For more information about TtkStyling_, see the :class:`Style` class documentation.
es_es: Para obtener más información acerca de TtkStyling_, consulta la documentación de la clase :class:`Style`.

source: :class:`ttk.Widget` defines standard options and methods supported by Tk themed widgets and is not supposed to be directly instantiated.
es_es: :class:`ttk.Widget` define las opciones y métodos estándar compatibles con los widgets temáticos de Tk y no se crea una instancia directamente.

source: Standard Options
es_es: Opciones estándar

source: All the :mod:`ttk` Widgets accepts the following options:
es_es: Todos los widgets :mod:`ttk` aceptan las siguientes opciones:

source: Option
es_es: Opción

source: Description
es_es: Descripción

source: Specifies the window class. The class is used when querying the option database for the window's other options, to determine the default bindtags for the window, and to select the widget's default layout and style. This option is read-only, and may only be specified when the window is created.
es_es: Especifica la clase de ventana. La clase se usa cuando se consulta la base de datos de opciones para las otras opciones de la ventana, para determinar las etiquetas de enlace (*bindtags*) predeterminadas para la ventana y para seleccionar el diseño y estilo predeterminados del widget. Esta opción es de solo lectura y solo se puede especificar cuando se crea la ventana.

source: Specifies the mouse cursor to be used for the widget. If set to the empty string (the default), the cursor is inherited for the parent widget.
es_es: Especifica el cursor del mouse que se utilizará para el widget. Si se establece en la cadena vacía (el valor predeterminado), el cursor se hereda para el widget principal.

source: Determines whether the window accepts the focus during keyboard traversal. 0, 1 or an empty string is returned. If 0 is returned, it means that the window should be skipped entirely during keyboard traversal. If 1, it means that the window should receive the input focus as long as it is viewable. And an empty string means that the traversal scripts make the decision about whether or not to focus on the window.
es_es: Determina si la ventana acepta el foco durante el recorrido del teclado. Se devuelve 0, 1 o una cadena vacía. Si se devuelve 0, significa que la ventana debe omitirse por completo durante el recorrido del teclado. Si es 1, significa que la ventana debe recibir el foco de entrada siempre que sea visible. Y una cadena vacía significa que los scripts transversales toman la decisión sobre si enfocarse o no en la ventana.

source: May be used to specify a custom widget style.
es_es: Se puede usar para especificar un estilo personalizado para el widget.

source: Scrollable Widget Options
es_es: Opciones de widgets desplegables

source: The following options are supported by widgets that are controlled by a scrollbar.
es_es: Los widgets controlados por una barra deslizante presentan las siguientes opciones.

source: Used to communicate with horizontal scrollbars.
es_es: Se usa para interactuar con las barras deslizantes horizontales.

source: When the view in the widget's window change, the widget will generate a Tcl command based on the scrollcommand.
es_es: Cuando la vista en la ventana del widget cambia, el widget generará un comando Tcl basado en el scrollcommand.

source: Usually this option consists of the method :meth:`Scrollbar.set` of some scrollbar. This will cause the scrollbar to be updated whenever the view in the window changes.
es_es: Por lo general, esta opción consiste en el método :meth:`Scrollbar.set` de barras deslizantes. Esto hará que la barra deslizante se actualice cada vez que cambie la vista de la ventana.

source: Used to communicate with vertical scrollbars. For some more information, see above.
es_es: Se utiliza para comunicarse con las barras deslizantes verticales. Para obtener más información, consulta más arriba.

source: Label Options
es_es: Opciones de etiqueta

source: The following options are supported by labels, buttons and other button-like widgets.
es_es: Las siguientes opciones son compatibles con etiquetas, botones y otros widgets similares a botones.

source: Specifies a text string to be displayed inside the widget.
es_es: Especifica una cadena de texto que se mostrará dentro del widget.

source: Specifies a name whose value will be used in place of the text option resource.
es_es: Especifica un nombre cuyo valor se utilizará en lugar del recurso de opción de texto.

source: If set, specifies the index (0-based) of a character to underline in the text string. The underline character is used for mnemonic activation.
es_es: Si se activa, especifica el índice (empezando por 0) de un carácter que se va a subrayar en la cadena de texto. El carácter subrayado se utiliza para la activación mnemotécnica.

source: Specifies an image to display. This is a list of 1 or more elements. The first element is the default image name. The rest of the list if a sequence of statespec/value pairs as defined by :meth:`Style.map`, specifying different images to use when the widget is in a particular state or a combination of states. All images in the list should have the same size.
es_es: Especifica una imagen que se va a mostrar. Es una lista de 1 o más elementos. El primer elemento es el nombre de imagen predeterminado. El resto de la lista es una secuencia de pares statespec/value según lo definido por :meth:`Style.map`, especificando diferentes imágenes para usar cuando el widget está en un estado determinado o una combinación de estados. Todas las imágenes de la lista deben tener el mismo tamaño.

source: Specifies how to display the image relative to the text, in the case both text and images options are present. Valid values are:
es_es: Especifica cómo mostrar la imagen en relación con el texto, en el caso de que estén presentes las opciones de texto e imágenes. Los valores válidos son:

source: text: display text only
es_es: text: mostrar solo texto

source: image: display image only
es_es: image: mostrar solo la imagen

source: top, bottom, left, right: display image above, below, left of, or right of the text, respectively.
es_es: top, bottom, left, right: muestra la imagen por encima, por debajo, a la izquierda o a la derecha del texto, respectivamente.

source: none: the default. display the image if present, otherwise the text.
es_es: none: valor predeterminado. Mostrar la imagen si está presente, de lo contrario el texto.

source: If greater than zero, specifies how much space, in character widths, to allocate for the text label, if less than zero, specifies a minimum width. If zero or unspecified, the natural width of the text label is used.
es_es: Si es mayor que cero, especifica cuánto espacio, en ancho de caracteres, se debe asignar para la etiqueta de texto; si es menor que cero, especifica un ancho mínimo. Si es cero o no se especifica, se utiliza el ancho natural de la etiqueta de texto.

source: Compatibility Options
es_es: Opciones de compatibilidad

source: May be set to "normal" or "disabled" to control the "disabled" state bit. This is a write-only option: setting it changes the widget state, but the :meth:`Widget.state` method does not affect this option.
es_es: Se puede establecer en "normal" o "deshabilitado" para controlar el bit de estado "deshabilitado". Esta es una opción de solo escritura: establecerlo cambia el estado del widget, pero el método :meth:`Widget.state` no afecta a esta opción.

source: Widget States
es_es: Estados del widget

source: The widget state is a bitmap of independent state flags.
es_es: El estado del widget es un mapa de bits de indicadores de estado independientes.

source: Flag
es_es: Indicador de estado

source: The mouse cursor is over the widget and pressing a mouse button will cause some action to occur
es_es: El puntero está sobre el widget y clickeando sobre él producirá alguna acción

source: Widget is disabled under program control
es_es: El widget está desactivado bajo el control del programa

source: Widget has keyboard focus
es_es: El widget tiene el enfoque del teclado

source: Widget is being pressed
es_es: El widget está siendo pulsado

source: "On", "true", or "current" for things like Checkbuttons and radiobuttons
es_es: "On", "true" o "current" para aspectos como Checkbuttons y radiobuttons

source: Windows and Mac have a notion of an "active" or foreground window. The *background* state is set for widgets in a background window, and cleared for those in the foreground window
es_es: Windows y Mac tienen el concepto de ventana "activa" o en primer plano. El estado *background* se establece para los widgets en una ventana de fondo y se borra para los que están en la ventana en primer plano

source: Widget should not allow user modification
es_es: El widget no debe permitir la modificación del usuario

source: A widget-specific alternate display format
es_es: Un formato de visualización alternativo específico del widget

source: The widget's value is invalid
es_es: El valor del widget no es válido

source: A state specification is a sequence of state names, optionally prefixed with an exclamation point indicating that the bit is off.
es_es: Una especificación de estado es una secuencia de nombres de estado, opcionalmente prefijados con un signo de exclamación que indica que el bit está desactivado.

source: Besides the methods described below, the :class:`ttk.Widget` supports the methods :meth:`tkinter.Widget.cget` and :meth:`tkinter.Widget.configure`.
es_es: Además de los métodos descritos a continuación, el :class:`ttk.Widget` soporta los métodos :meth:`tkinter.Widget.cget` y :meth:`tkinter.Widget.configure`.

source: Returns the name of the element at position *x* *y*, or the empty string if the point does not lie within any element.
es_es: Retorna el nombre del elemento en la posición *x* *y* o la cadena vacía si el punto no se encuentra dentro de ningún elemento.

source: *x* and *y* are pixel coordinates relative to the widget.
es_es: *x* e *y* son coordenadas en píxeles relativas al widget.

source: Test the widget's state. If a callback is not specified, returns ``True`` if the widget state matches *statespec* and ``False`` otherwise. If callback is specified then it is called with args if widget state matches *statespec*.
es_es: Prueba el estado del widget. Si no se especifica una retrollamada, retorna ``True`` si el estado del widget coincide con *statespec* y ``False`` en caso contrario. Si se especifica la retrollamada, se llama con argumentos (*args*) si el estado del widget coincide con *statespec*.

source: Modify or inquire widget state. If *statespec* is specified, sets the widget state according to it and return a new *statespec* indicating which flags were changed. If *statespec* is not specified, returns the currently-enabled state flags.
es_es: Modifica o pregunta el estado del widget. Si se especifica *statespec*, establece el estado del widget según éste y retorna un nuevo *statespec* que indica qué indicadores se han cambiado. Si no se especifica *statespec*, retorna los indicadores de estado habilitados actualmente.

source: *statespec* will usually be a list or a tuple.
es_es: *statespec* es generalmente una lista o una tupla.

source: The :class:`ttk.Combobox` widget combines a text field with a pop-down list of values. This widget is a subclass of :class:`Entry`.
es_es: El widget :class:`ttk.Combobox` combina un campo de texto con una lista desplegable de valores. Este widget es una subclase de :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Combobox`.
es_es: Además de los métodos heredados de :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` y :meth:`Widget.state`, y los siguientes heredados de :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, tiene algunos otros métodos, descritos en :class:`ttk.Combobox`.

source: Options
es_es: Opciones

source: This widget accepts the following specific options:
es_es: Este widget acepta las siguientes opciones específicas:

source: Boolean value. If set, the widget selection is linked to the Window Manager selection (which can be returned by invoking Misc.selection_get, for example).
es_es: Valor booleano. Si se establece, la selección del widget está vinculada a la selección del Administrador de ventanas (que se puede retornar invocando Misc.selection_get, por ejemplo).

source: Specifies how the text is aligned within the widget. One of "left", "center", or "right".
es_es: Especifica cómo el texto se alinea en el widget. Uno de "left", "center" o "right".

source: Specifies the height of the pop-down listbox, in rows.
es_es: Especifica el largo/altura del cuadro de la lista desplegable, en filas.

source: A script (possibly registered with Misc.register) that is called immediately before displaying the values. It may specify which values to display.
es_es: Un script (posiblemente registrado con Misc.register) que se llama inmediatamente antes de mostrar los valores. Puede especificar qué valores mostrar.

source: One of "normal", "readonly", or "disabled". In the "readonly" state, the value may not be edited directly, and the user can only selection of the values from the dropdown list. In the "normal" state, the text field is directly editable. In the "disabled" state, no interaction is possible.
es_es: Uno de "normal", "readonly" o "disabled". En el estado "readonly" el valor no se puede editar directamente y el usuario solo puede seleccionar los valores de la lista desplegable. En el estado "normal" el campo de texto se puede editar directamente. En el estado "deshabilitado" no es posible ninguna interacción.

source: Specifies a name whose value is linked to the widget value. Whenever the value associated with that name changes, the widget value is updated, and vice versa. See :class:`tkinter.StringVar`.
es_es: Especifica un nombre cuyo valor está vinculado al valor del widget. Cada vez que cambia el valor asociado a ese nombre, se actualiza el valor del widget y viceversa. Véase :class:`tkinter.StringVar`.

source: Specifies the list of values to display in the drop-down listbox.
es_es: Especifica la lista de valores que se mostrarán en el cuadro de lista desplegable.

source: Specifies an integer value indicating the desired width of the entry window, in average-size characters of the widget's font.
es_es: Especifica un valor entero que indica el ancho deseado de la ventana de entrada, en caracteres de tamaño medio de la fuente del widget.

source: Virtual events
es_es: Eventos virtuales

source: The combobox widgets generates a **<<ComboboxSelected>>** virtual event when the user selects an element from the list of values.
es_es: Los widgets de cuadro combinado generan un evento virtual **<<ComboboxSelected>>** cuando el usuario selecciona un elemento de la lista de valores.

source: If *newindex* is specified, sets the combobox value to the element position *newindex*. Otherwise, returns the index of the current value or -1 if the current value is not in the values list.
es_es: Si se especifica *newindex*, establece el valor del cuadro combinado en la posición del elemento *newindex*. De lo contrario, retorna el índice del valor actual o -1 si el valor actual no está en la lista de valores.

source: Returns the current value of the combobox.
es_es: Retorna el valor actual del cuadro combinado.

source: Sets the value of the combobox to *value*.
es_es: Establece el valor del cuadro combinado a *value*.

source: The :class:`ttk.Spinbox` widget is a :class:`ttk.Entry` enhanced with increment and decrement arrows. It can be used for numbers or lists of string values. This widget is a subclass of :class:`Entry`.
es_es: El widget :class:`ttk.Spinbox` es un :class:`ttk.Entry` mejorado con flechas de incremento y decremento. Se puede utilizar para números o listas de valores de cadena. Este widget es una subclase de :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Spinbox`.
es_es: Además de los métodos heredados de :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` y :meth:`Widget.state`, y los siguientes heredados de :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, tiene algunos otros métodos, descritos en :class:`ttk.Spinbox`.

source: Float value. If set, this is the minimum value to which the decrement button will decrement. Must be spelled as ``from_`` when used as an argument, since ``from`` is a Python keyword.
es_es: Valor flotante. Si se establece, este es el valor mínimo al que se reducirá el botón de disminución. Debe escribirse como ``from_`` cuando se usa como argumento, ya que ``from`` es una palabra clave de Python.

source: Float value. If set, this is the maximum value to which the increment button will increment.
es_es: Valor flotante. Si se establece, este es el valor máximo al que se incrementará el botón de incremento.

source: Float value. Specifies the amount which the increment/decrement buttons change the value. Defaults to 1.0.
es_es: Valor flotante. Especifica la cantidad por la cual los botones de incremento/disminución cambian el valor. Por defecto la cantidad es de 1.0.
