Repository: python/python-docs-es
Catalog: library/tkinter.ttk.po
Languages: es_es

source: *layoutspec*, if specified, is expected to be a list or some other sequence type (excluding strings), where each item should be a tuple and the first item is the layout name and the second item should have the format described in `Layouts`_.
es_es: *layoutspec*, si se especifica, se espera que sea una lista o algún otro tipo de secuencia (excluyendo cadenas), donde cada elemento debe ser una tupla y el primer elemento es el nombre de diseño y el segundo elemento debe tener el formato descrito en `Layouts`_.

source: To understand the format, see the following example (it is not intended to do anything useful)::
es_es: Para entender el formato, consulta el siguiente ejemplo (no está pensado para hacer nada útil)::

source: Create a new element in the current theme, of the given *etype* which is expected to be either "image", "from" or "vsapi". The latter is only available in Tk 8.6a for Windows XP and Vista and is not described here.
es_es: Crea un nuevo elemento en el tema actual, del *etype* dado, que se espera que sea "image", "from" o "vsapi". Este último solo está disponible en Tk 8.6a para Windows XP y Vista y no se describe aquí.

source: If "image" is used, *args* should contain the default image name followed by statespec/value pairs (this is the imagespec), and *kw* may have the following options:
es_es: Si se utiliza "image", *args* debe contener el nombre de imagen predeterminado seguido de pares statespec/value (esta es imagespec), y *kw* puede tener las siguientes opciones:

source: padding is a list of up to four integers, specifying the left, top, right, and bottom borders, respectively.
es_es: el relleno interno es una lista de hasta cuatro enteros, especificando los bordes izquierdo, superior, derecho e inferior, respectivamente.

source: Specifies a minimum height for the element. If less than zero, the base image's height is used as a default.
es_es: Especifica una altura mínima para el elemento. Si es menor que cero, la altura de la imagen base se utiliza como valor predeterminado.

source: Specifies the element's interior padding. Defaults to border's value if not specified.
es_es: Especifica el relleno interior del elemento. El valor predeterminado es el valor del borde si no se especifica.

source: Specifies how the image is placed within the final parcel. spec contains zero or more characters "n", "s", "w", or "e".
es_es: Especifica cómo se coloca la imagen dentro de la sección. *spec* contiene cero o más caracteres "n", "s", "w" o "e".

source: Specifies a minimum width for the element. If less than zero, the base image's width is used as a default.
es_es: Especifica un ancho mínimo para el elemento. Si es menor que cero, el ancho de la imagen base se utiliza como valor predeterminado.

source: If "from" is used as the value of *etype*, :meth:`element_create` will clone an existing element. *args* is expected to contain a themename, from which the element will be cloned, and optionally an element to clone from. If this element to clone from is not specified, an empty element will be used. *kw* is discarded.
es_es: Si se utiliza "from" como valor de *etype*, :meth:`element_create` clonará un elemento existente. *args* contiene un themename, desde el que se clonará el elemento y, opcionalmente, un elemento desde el que clonar. Si no se especifica este elemento para clonar, se usará un elemento vacío. *kw* se descarta.

source: Returns the list of elements defined in the current theme.
es_es: Retorna la lista de elementos definidos en le tema actual.

source: Returns the list of *elementname*'s options.
es_es: Retorna la lista de opciones de *elementname*.

source: Create a new theme.
es_es: Crea un tema nuevo.

source: It is an error if *themename* already exists. If *parent* is specified, the new theme will inherit styles, elements and layouts from the parent theme. If *settings* are present they are expected to have the same syntax used for :meth:`theme_settings`.
es_es: Es un error si *themename* ya existe. Si se especifica *parent*, el nuevo tema heredará estilos, elementos y diseños del tema primario. Si se especifica *settings*, se espera que tengan la misma sintaxis utilizada para :meth:`theme_settings`.

source: Temporarily sets the current theme to *themename*, apply specified *settings* and then restore the previous theme.
es_es: Establece temporalmente el tema actual en *themename*, aplica los *settings* especificados y, a continuación, restaura el tema anterior.

source: Each key in *settings* is a style and each value may contain the keys 'configure', 'map', 'layout' and 'element create' and they are expected to have the same format as specified by the methods :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` and :meth:`Style.element_create` respectively.
es_es: Cada clave en *settings* es un estilo y cada valor puede contener las teclas 'configure', 'map', 'layout' y 'element create' y se espera que tengan el mismo formato especificado por los métodos :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` y :meth:`Style.element_create` respectivamente.

source: As an example, let's change the Combobox for the default theme a bit::
es_es: Como ejemplo, vamos a cambiar un poco el Combobox por el tema predeterminado::

source: Returns a list of all known themes.
es_es: Retorna una lista de temas conocidos.

source: If *themename* is not given, returns the theme in use. Otherwise, sets the current theme to *themename*, refreshes all widgets and emits a <<ThemeChanged>> event.
es_es: Si no se proporciona *themename*, retorna el tema en uso. De lo contrario, establece el tema actual en *themename*, actualiza todos los widgets y emite un evento <<ThemeChanged>>.

source: Layouts
es_es: Diseños

source: A layout can be just ``None``, if it takes no options, or a dict of options specifying how to arrange the element. The layout mechanism uses a simplified version of the pack geometry manager: given an initial cavity, each element is allocated a parcel. Valid options/values are:
es_es: Un diseño puede ser simplemente ``None``, si no tiene opciones, o un diccionario de opciones que especifica cómo organizar el elemento. El mecanismo de diseño utiliza una versión simplificada del paquete de gestión de geometría: dada una cavidad inicial, a cada elemento se le asigna una sección. Las opciones/valores válidos son:

source: Specifies which side of the cavity to place the element; one of top, right, bottom or left. If omitted, the element occupies the entire cavity.
es_es: Especifica en qué lado de la cavidad colocar el elemento; sea arriba, derecha, abajo o izquierda. Si se omite, el elemento ocupa toda la cavidad.

source: Specifies where the element is placed inside its allocated parcel.
es_es: Especifica dónde se coloca el elemento dentro de su sección asignada.

source: If set to 1, causes the element and all of its descendants to be treated as a single element for the purposes of :meth:`Widget.identify` et al. It's used for things like scrollbar thumbs with grips.
es_es: Si se establece en 1, hace que el elemento y todos sus descendientes sean tratados como un único elemento en métodos como :meth:`Widget.identify` y otros. Se utiliza para cosas como los *thumbs* de la barra de desplazamiento.

source: Specifies a list of elements to place inside the element. Each element is a tuple (or other sequence type) where the first item is the layout name, and the other is a `Layout`_.
es_es: Especifica una lista de elementos para colocar dentro del elemento. Cada elemento es una tupla (u otro tipo de secuencia) donde el primer elemento es el nombre de diseño y el otro es un `Layout`_.
