Repository: python/python-docs-es
Catalog: library/tkinter.ttk.po
Languages: es_es

source: The textual label to display for the item.
es_es: La etiqueta textual que se va a mostrar para el elemento.

source: A Tk Image, displayed to the left of the label.
es_es: Una imagen Tk, que se muestra a la izquierda de la etiqueta.

source: The list of values associated with the item.
es_es: La lista de valores asociados al elemento.

source: Each item should have the same number of values as the widget option columns. If there are fewer values than columns, the remaining values are assumed empty. If there are more values than columns, the extra values are ignored.
es_es: Cada elemento debe tener el mismo número de valores que las columnas de opciones del widget. Si hay menos valores que columnas, los valores restantes se asumen vacíos. Si hay más valores que columnas, se omiten los valores adicionales.

source: ``True``/``False`` value indicating whether the item's children should be displayed or hidden.
es_es: Valor ``True``/``False`` que indica si los elementos secundarios deben mostrarse u ocultarse.

source: A list of tags associated with this item.
es_es: La lista de etiquetas asociadas al elemento.

source: Tag Options
es_es: Opciones de etiqueta

source: The following options may be specified on tags:
es_es: Se pueden especificar las opciones siguientes para etiquetas:

source: Specifies the text foreground color.
es_es: Especifica el color de primer plano del texto.

source: Specifies the cell or item background color.
es_es: Especifica el color de fondo de la celda o elemento.

source: Specifies the font to use when drawing text.
es_es: Especifica la fuente que se utilizará al añadir texto.

source: Specifies the item image, in case the item's image option is empty.
es_es: Especifica la imagen del elemento, en caso de que la opción de imagen del elemento esté vacía.

source: Column Identifiers
es_es: Identificadores de columna

source: Column identifiers take any of the following forms:
es_es: Los identificadores de columna toman cualquiera de los siguientes formas:

source: A symbolic name from the list of columns option.
es_es: Un nombre simbólico de la lista de opciones de columna.

source: An integer n, specifying the nth data column.
es_es: Un entero n, especificando la n-ésima columna de datos.

source: A string of the form #n, where n is an integer, specifying the nth display column.
es_es: Una cadena de la forma #n, donde n es un entero, especificando la n-ésima columna mostrada.

source: Notes:
es_es: Notas:

source: Item's option values may be displayed in a different order than the order in which they are stored.
es_es: Los valores de opciones del elemento se pueden mostrar en un orden diferente al orden en el que se almacenan.

source: Column #0 always refers to the tree column, even if show="tree" is not specified.
es_es: La columna #0 siempre hace referencia a la columna del árbol, incluso si no se especifica show="tree".

source: A data column number is an index into an item's option values list; a display column number is the column number in the tree where the values are displayed. Tree labels are displayed in column #0. If option displaycolumns is not set, then data column n is displayed in column #n+1. Again, **column #0 always refers to the tree column**.
es_es: Un número de columna de datos es un índice en la lista de valores de opciones de un elemento; el número de columna se visualiza en el árbol donde se muestran los valores. Las etiquetas de árbol se muestran en la columna #0. Si no se establece la opción displaycolumns, la columna de datos n se muestra en la columna #n+1. Una vez más, **la columna #0 siempre hace referencia a la columna del árbol**.

source: The Treeview widget generates the following virtual events.
es_es: El widget Treeview genera los siguientes eventos virtuales.

source: Event
es_es: Evento

source: Generated whenever the selection changes.
es_es: Se genera cada vez que cambia la selección.

source: Generated just before settings the focus item to open=True.
es_es: Generado justo antes configurar el elemento de resalto a open=True.

source: Generated just after setting the focus item to open=False.
es_es: Generado justo después de establecer el elemento de resalto a open=False.

source: The :meth:`Treeview.focus` and :meth:`Treeview.selection` methods can be used to determine the affected item or items.
es_es: Los métodos :meth:`Treeview.focus` y :meth:`Treeview.selection` se pueden utilizar para determinar el elemento o elementos afectados.

source: Returns the bounding box (relative to the treeview widget's window) of the specified *item* in the form (x, y, width, height).
es_es: Retorna el cuadro delimitador (en relación con la ventana del widget de Treeview) del *item* especificado con el formato (x, y, ancho, alto).

source: If *column* is specified, returns the bounding box of that cell. If the *item* is not visible (i.e., if it is a descendant of a closed item or is scrolled offscreen), returns an empty string.
es_es: Si se especifica *column*, retorna el cuadro delimitador de esa celda. Si el *item* no está visible (es decir, si es descendiente de un elemento cerrado o se desplaza fuera de la pantalla), retorna una cadena vacía.

source: Returns the list of children belonging to *item*.
es_es: Retorna la lista de elementos secundarios que pertenecen a *item*.

source: If *item* is not specified, returns root children.
es_es: Si no se especifica *item*, retorna la raíz.

source: Replaces *item*'s child with *newchildren*.
es_es: Reemplaza el elemento secundario de *item* por *newchildren*.

source: Children present in *item* that are not present in *newchildren* are detached from the tree. No items in *newchildren* may be an ancestor of *item*. Note that not specifying *newchildren* results in detaching *item*'s children.
es_es: Los elementos secundarios presentes en *item* que no están presentes en *newchildren* se separan del árbol. Ningún elemento de *newchildren* puede ser un antecesor de *item*. Tenga en cuenta que si no se especifica *newchildren* se desasocian los elementos secundarios de *item*.

source: Query or modify the options for the specified *column*.
es_es: Consultar o modificar las opciones para la *columna* especificada.

source: If *kw* is not given, returns a dict of the column option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
es_es: Si no se proporciona *kw*, retorna un diccionario de los valores de opciones de columna. Si se especifica *option*, se retorna el valor de esa *option*. De lo contrario, establece las opciones en los valores correspondientes.

source: The valid options/values are:
es_es: Las opciones/valores válidos son:

source: Returns the column name. This is a read-only option.
es_es: Retorna el nombre de la columna. Esta es una opción de solo lectura.

source: anchor: One of the standard Tk anchor values.
es_es: ancla: Uno de los valores de ancla Tk estándar.

source: Specifies how the text in this column should be aligned with respect to the cell.
es_es: Especifica cómo se debe alinear el texto de esta columna con respecto a la celda.

source: The minimum width of the column in pixels. The treeview widget will not make the column any smaller than specified by this option when the widget is resized or the user drags a column.
es_es: El ancho mínimo de la columna en píxeles. El widget Treeview no hará que la columna sea más pequeña de lo especificado por esta opción cuando se cambie el tamaño del widget o el usuario arrastre una columna.

source: Specifies whether the column's width should be adjusted when the widget is resized.
es_es: Especifica si el ancho de la columna debe ajustarse cuando se cambia el tamaño del widget.

source: width: width
es_es: width: ancho

source: The width of the column in pixels.
es_es: El ancho de la columna en píxeles.

source: To configure the tree column, call this with column = "#0"
es_es: Se puede establecer *column = "#0"* para configurar el árbol de la columna.

source: Delete all specified *items* and all their descendants.
es_es: Elimina todos los *items* especificados y todos sus descendientes.

source: The root item may not be deleted.
es_es: El elemento raíz no se elimina.

source: Unlinks all of the specified *items* from the tree.
es_es: Desvincula todos los *items* especificados del árbol.

source: The items and all of their descendants are still present, and may be reinserted at another point in the tree, but will not be displayed.
es_es: Los objetos y todos sus descendientes todavía existen, y pueden ser reinsertados en otro punto del árbol, pero no se mostrarán.

source: The root item may not be detached.
es_es: El elemento raíz no se desvincula.

source: Returns ``True`` if the specified *item* is present in the tree.
es_es: Retorna ``True`` si el *item* especificado está presente en el árbol.

source: If *item* is specified, sets the focus item to *item*. Otherwise, returns the current focus item, or '' if there is none.
es_es: Si se especifica *item*, establece el elemento de foco en *item*. De lo contrario, retorna el elemento de foco actual o '' si no hay ninguno.

source: Query or modify the heading options for the specified *column*.
es_es: Consulta o modifica las opciones de encabezado para la *column* especificada.

source: If *kw* is not given, returns a dict of the heading option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
es_es: Si no se proporciona *kw*, retorna un diccionario de los valores de opciones de encabezado. Si se especifica *option*, se retorna el valor de esa *option*. De lo contrario, establece las opciones en los valores correspondientes.

source: text: text
es_es: text: texto

source: The text to display in the column heading.
es_es: El texto se muestra en el encabezado de la columna.

source: Specifies an image to display to the right of the column heading.
es_es: Especifica una imagen para mostrar en la parte derecha del encabezado de la columna.

source: anchor: anchor
es_es: anchor: ancla

source: Specifies how the heading text should be aligned. One of the standard Tk anchor values.
es_es: Especifica el alineamiento del texto del encabezado. Es uno de los valores estándar de Tk anchor.

source: A callback to be invoked when the heading label is pressed.
es_es: Una retrollamada que se ejecutará cuando se presione la etiqueta de encabezado.

source: To configure the tree column heading, call this with column = "#0".
es_es: Se especifica *column ="#0"* para configurar el encabezado de la columna de árbol.

source: Returns a description of the specified *component* under the point given by *x* and *y*, or the empty string if no such *component* is present at that position.
es_es: Retorna una descripción del *component* especificado bajo el punto dado por *x* e *y*, o la cadena vacía si no existe dicho *component* en esa posición.

source: Returns the item ID of the item at position *y*.
es_es: Retorna el identificador del elemento en la posición *y*.

source: Returns the data column identifier of the cell at position *x*.
es_es: Retorna el identificador de los datos de columna de la celda en la posición *x*.

source: The tree column has ID #0.
es_es: La columna del árbol tiene ID #0.

source: Returns one of:
es_es: Retorna uno de:

source: region
es_es: zona

source: meaning
es_es: significado

source: Tree heading area.
es_es: Zona de encabezado del árbol.

source: Space between two columns headings.
es_es: Espacio entre dos encabezados de columna.

source: The tree area.
es_es: La zona del árbol.

source: A data cell.
es_es: Datos de celda.

source: Availability: Tk 8.6.
es_es: Disponibilidad: Tk 8.6.

source: Returns the element at position *x*, *y*.
es_es: Retorna el elemento en la posición *x*, *y*.

source: Returns the integer index of *item* within its parent's list of children.
es_es: Retorna el índice entero de *item* dentro de la lista de elementos secundarios de su elemento primario.

source: Creates a new item and returns the item identifier of the newly created item.
es_es: Crea un nuevo elemento y retorna el identificador del elemento recién creado.

source: *parent* is the item ID of the parent item, or the empty string to create a new top-level item. *index* is an integer, or the value "end", specifying where in the list of parent's children to insert the new item. If *index* is less than or equal to zero, the new node is inserted at the beginning; if *index* is greater than or equal to the current number of children, it is inserted at the end. If *iid* is specified, it is used as the item identifier; *iid* must not already exist in the tree. Otherwise, a new unique identifier is generated.
es_es: *parent* es el identificador del elemento primario o la cadena vacía para crear un nuevo elemento de nivel superior. *index* es un entero, o el valor "end", especificando dónde insertar el nuevo elemento en la lista de elementos secundarios del elemento primario. Si *index* es menor o igual que cero, el nuevo nodo se inserta al principio; si *index* es mayor o igual que el número actual de elementos secundarios, se inserta al final. Si se especifica *iid*, se utiliza como identificador de elemento; *iid* no debe existir en el árbol previamente. De lo contrario, se genera un nuevo identificador único.

source: See `Item Options`_ for the list of available points.
es_es: Consulte `Item Options`_ para obtener la lista de puntos disponibles.

source: Query or modify the options for the specified *item*.
es_es: Consulta o modifica las opciones para el *item* especificado.

source: If no options are given, a dict with options/values for the item is returned. If *option* is specified then the value for that option is returned. Otherwise, sets the options to the corresponding values as given by *kw*.
es_es: Si no se proporciona ninguna opción, se retorna un diccionario con opciones/valores para el elemento. Si se especifica *option*, se retorna el valor de esa opción. De lo contrario, establece las opciones en los valores correspondientes según *kw*.

source: Moves *item* to position *index* in *parent*'s list of children.
es_es: Mueve *item* a la posición *index* en la lista de elementos secundarios de *parent*.

source: It is illegal to move an item under one of its descendants. If *index* is less than or equal to zero, *item* is moved to the beginning; if greater than or equal to the number of children, it is moved to the end. If *item* was detached it is reattached.
es_es: No se permite mover un elemento bajo uno de sus descendientes. Si *index* es menor o igual que cero, *item* se mueve al principio; si es mayor o igual que el número de hijos, se mueve hasta el final. Si *item* se desvincula, se vuelve a conectar.

source: Returns the identifier of *item*'s next sibling, or '' if *item* is the last child of its parent.
es_es: Retorna el identificador del siguiente elemento de *item*, o '' si *item* es el último elemento secundario de su elemento primario.

source: Returns the ID of the parent of *item*, or '' if *item* is at the top level of the hierarchy.
es_es: Retorna el identificador del elemento primario de *item* o '' si *item* está en el nivel superior de la jerarquía.

source: Returns the identifier of *item*'s previous sibling, or '' if *item* is the first child of its parent.
es_es: Retorna el identificador del elemento anterior de *item*, o '' si *item* es el primer elemento secundario de su elemento primario.

source: An alias for :meth:`Treeview.move`.
es_es: Un alias para :meth:`Treeview.move`.

source: Ensure that *item* is visible.
es_es: Garantiza que *item* está visible.

source: Sets all of *item*'s ancestors open option to ``True``, and scrolls the widget if necessary so that *item* is within the visible portion of the tree.
es_es: Establece todas las opciones modificables de los antecesores de *item* a ``True`` y desplaza el widget si es necesario para que *item* esté dentro de la parte visible del árbol.

source: Returns a tuple of selected items.
es_es: Retorna una tupla de los elementos seleccionados.

source: ``selection()`` no longer takes arguments. For changing the selection state use the following selection methods.
es_es: ``selection()`` ya no toma argumentos. Para cambiar el estado de selección, utiliza los siguientes métodos de selección.

source: *items* becomes the new selection.
es_es: *items* se convierte en la nueva selección.

source: *items* can be passed as separate arguments, not just as a single tuple.
es_es: *items* se pueden pasar como argumentos separados, no solo como una sola tupla.

source: Add *items* to the selection.
es_es: Añade *items* a la selección.

source: Remove *items* from the selection.
es_es: Elimina *elementos* de la selección.

source: Toggle the selection state of each item in *items*.
es_es: Alterna el estado de selección de cada elemento en *items*.

source: With one argument, returns a dictionary of column/value pairs for the specified *item*. With two arguments, returns the current value of the specified *column*. With three arguments, sets the value of given *column* in given *item* to the specified *value*.
es_es: Con un argumento, retorna un diccionario de pares columna/valor para el *item* especificado. Con dos argumentos, retorna el valor actual de la *columna* especificada. Con tres argumentos, establece el valor de determinado *column* en un *item* determinado en el *value* especificado.

source: Bind a callback for the given event *sequence* to the tag *tagname*. When an event is delivered to an item, the callbacks for each of the item's tags option are called.
es_es: Enlaza una retrollamada para el evento *sequence* a la etiqueta *tagname*. Cuando se entrega un evento a un elemento, se llama a las retrollamadas de cada una de las etiquetas del elemento.

source: Query or modify the options for the specified *tagname*.
es_es: Consulta o modifica las opciones para el *tagname* especificado.

source: If *kw* is not given, returns a dict of the option settings for *tagname*. If *option* is specified, returns the value for that *option* for the specified *tagname*. Otherwise, sets the options to the corresponding values for the given *tagname*.
es_es: Si no se proporciona *kw*, retorna un diccionario de la configuración de opciones para *tagname*. Si se especifica *option*, retorna el valor de esa *option* para el *tagname* especificado. De lo contrario, establece las opciones en los valores correspondientes para el *tagname* dado.

source: If *item* is specified, returns 1 or 0 depending on whether the specified *item* has the given *tagname*. Otherwise, returns a list of all items that have the specified tag.
es_es: Si se especifica *item*, retorna 1 o 0 dependiendo de si el *item* tiene el *tagname* especificado. De lo contrario, retorna una lista de todos los elementos que tienen la etiqueta especificada.

source: Availability: Tk 8.6
es_es: Disponibilidad: Tk 8.6

source: Query or modify horizontal position of the treeview.
es_es: Consulta o modifica la posición horizontal de la vista de árbol.

source: Query or modify vertical position of the treeview.
es_es: Consulta o modifica la posición vertical de la vista de árbol.

source: Each widget in :mod:`ttk` is assigned a style, which specifies the set of elements making up the widget and how they are arranged, along with dynamic and default settings for element options. By default the style name is the same as the widget's class name, but it may be overridden by the widget's style option. If you don't know the class name of a widget, use the method :meth:`Misc.winfo_class` (somewidget.winfo_class()).
es_es: A cada widget en :mod:`ttk` se le asigna un estilo, que especifica el conjunto de elementos que componen el widget y cómo se organizan, junto con la configuración dinámica y predeterminada para las opciones de elemento. De forma predeterminada, el nombre del estilo es el mismo que el nombre de clase del widget, pero puede ser reemplazado por la opción de estilo del widget. Si no conoces el nombre de clase de un widget, utiliza el método :meth:`Misc.winfo_class` (somewidget.winfo_class()).

source: `Tcl'2004 conference presentation <http://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_
es_es: `Presentación de la conferencia Tcl'2004 <http://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_

source: This document explains how the theme engine works
es_es: Este documento explica cómo funciona el motor de temas

source: This class is used to manipulate the style database.
es_es: Esta clase se utiliza para manipular la base de datos de estilos.

source: Query or set the default value of the specified option(s) in *style*.
es_es: Consulta o establece el valor predeterminado de las opciones especificadas en *style*.

source: Each key in *kw* is an option and each value is a string identifying the value for that option.
es_es: Cada clave en *kw* es una opción y cada valor es una cadena que identifica el valor de esa opción.

source: For example, to change every default button to be a flat button with some padding and a different background color::
es_es: Por ejemplo, para cambiar cualquier botón por defecto a un botón plano con borde interno y un color de fondo distinto::

source: Query or sets dynamic values of the specified option(s) in *style*.
es_es: Consulta o establece valores dinámicos de opciones específicas en *style*.

source: Each key in *kw* is an option and each value should be a list or a tuple (usually) containing statespecs grouped in tuples, lists, or some other preference. A statespec is a compound of one or more states and then a value.
es_es: Cada clave en *kw* es una opción y cada valor es una lista o tupla (generalmente) que contiene *statespecs* agrupados en tuplas, listas o alguna otra preferencia. Una *statespec* es un compuesto de uno o más estados y un valor.

source: An example may make it more understandable::
es_es: Un ejemplo puede hacerlo más comprensible::

source: Note that the order of the (states, value) sequences for an option does matter, if the order is changed to ``[('active', 'blue'), ('pressed', 'red')]`` in the foreground option, for example, the result would be a blue foreground when the widget were in active or pressed states.
es_es: Ten en cuenta que el orden de las secuencias (estado, valor) para una opción es importante, si se cambia el orden a ``[('active', 'blue'), ('pressed', 'red')]`` en la opción en primer plano, por ejemplo, el resultado sería un primer plano azul cuando el widget se encuentre en los estados *active* o *pressed*.

source: Returns the value specified for *option* in *style*.
es_es: Retorna el valor especificado para *option* en *style*.

source: If *state* is specified, it is expected to be a sequence of one or more states. If the *default* argument is set, it is used as a fallback value in case no specification for option is found.
es_es: Si *state* se especifica, se espera que sea una secuencia de uno o más estados. Si se establece el argumento *default*, se usa como valor de reserva en caso de que no se especifique una opción.

source: To check what font a Button uses by default::
es_es: Para verificar qué fuente usa un Button por defecto::

source: Define the widget layout for given *style*. If *layoutspec* is omitted, return the layout specification for given style.
es_es: Define el diseño del widget para un *estilo* dado. Si se omite *layoutspec*, retorna la especificación de diseño para un estilo determinado.
