Repository: python/python-docs-es
Catalog: library/tkinter.tix.po
Languages: es_pe

source: The `tix commands <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tix.htm>`_ provide access to miscellaneous elements of :mod:`Tix`'s internal state and the :mod:`Tix` application context. Most of the information manipulated by these methods pertains to the application as a whole, or to a screen or display, rather than to a particular window.
es_pe: Los `comandos tix <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tix.htm>`_ proporcionan acceso a elementos misceláneos del estado interno de :mod:`Tix` y del contexto de la aplicación de :mod:`Tix`. La mayoría de la información manipulada por estos métodos le pertenece a la aplicación en conjunto, o a una pantalla o monitor, en vez de una ventana en particular.

source: To view the current settings, the common usage is::
es_pe: Para ver las configuraciones actuales, el uso común es::

source: Query or modify the configuration options of the Tix application context. If no option is specified, returns a dictionary all of the available options. If option is specified with no value, then the method returns a list describing the one named option (this list will be identical to the corresponding sublist of the value returned if no option is specified). If one or more option-value pairs are specified, then the method modifies the given option(s) to have the given value(s); in this case the method returns an empty string. Option may be any of the configuration options.
es_pe: Consulta o modifica las opciones de configuración del contexto de la aplicación Tix. Si no se especifica ninguna opción, retorna un diccionario con todas las opciones disponibles. Si la opción es especificada sin ningún valor, entonces el método retorna una lista describiendo la opción nombrada (esta lista será idéntica a la sublista correspondiente de los valores retornados si no se especifica ninguna opción). Si uno o más pares opción-valor son especificados, entonces el método modifica las opciones dadas para tener los valores dados; en este caso el método retorna una cadena de caracteres vacía. La opción puede ser cualquiera de las opciones de configuración.

source: Returns the current value of the configuration option given by *option*. Option may be any of the configuration options.
es_pe: Retorna el valor actual de la opción de configuración dada por *option*. La opción puede ser cualquiera de las opciones configurables.

source: Locates a bitmap file of the name ``name.xpm`` or ``name`` in one of the bitmap directories (see the :meth:`tix_addbitmapdir` method). By using :meth:`tix_getbitmap`, you can avoid hard coding the pathnames of the bitmap files in your application. When successful, it returns the complete pathname of the bitmap file, prefixed with the character ``@``. The returned value can be used to configure the ``bitmap`` option of the Tk and Tix widgets.
es_pe: Localiza un archivo bitmap con el nombre ``name.xpm`` o ``name`` en uno de los directorios bitmap (véase el método :meth:`tix_addbitmapdir`). Al usar :meth:`tix_getbitmap`, puedes evitar codificar directamente los nombres de ruta de los archivos bitmap en tu aplicación. Cuando tiene éxito, retorna el nombre de ruta completo del archivo bitmap, prefijado con el carácter ``@``. El valor retornado puede ser usado para configurar la opción ``bitmap`` de los widgets de Tk y Tix.

source: Tix maintains a list of directories under which the :meth:`tix_getimage` and :meth:`tix_getbitmap` methods will search for image files. The standard bitmap directory is :file:`$TIX_LIBRARY/bitmaps`. The :meth:`tix_addbitmapdir` method adds *directory* into this list. By using this method, the image files of an applications can also be located using the :meth:`tix_getimage` or :meth:`tix_getbitmap` method.
es_pe: Tix mantiene una lista de directorios bajo los cuales los métodos :meth:`tix_getimage` y :meth:`tix_getbitmap` buscarán archivos de imágenes. El directorio de bitmap estándar es :file:`$TIX_LIBRARY/bitmaps`. El método :meth:`tix_addbitmapdir` añade *directory* a la lista. Al usar este método, los archivos de imagen de una aplicación pueden ser localizados usando el método :meth:`tix_getimage` o :meth:`tix_getbitmap`.

source: Returns the file selection dialog that may be shared among different calls from this application. This method will create a file selection dialog widget when it is called the first time. This dialog will be returned by all subsequent calls to :meth:`tix_filedialog`. An optional dlgclass parameter can be passed as a string to specified what type of file selection dialog widget is desired. Possible options are ``tix``, ``FileSelectDialog`` or ``tixExFileSelectDialog``.
es_pe: Retorna el diálogo de selección de archivo que puede ser compartido entre diferentes invocaciones de esta aplicación. Este método creará una widget de diálogo de selección de archivos cuando es invocado la primera vez. Este diálogo será retornado por las subsiguientes invocaciones de :meth:`tix_filedialog`. Un parámetro *dlgclass* opcional puede ser pasado como cadena para especificar qué tipo de widget de selección de diálogo es deseado. Las opciones posibles son ``tix``, ``FileSelectDialog``, o ``tixExFileSelectDialog``.

source: Locates an image file of the name :file:`name.xpm`, :file:`name.xbm` or :file:`name.ppm` in one of the bitmap directories (see the :meth:`tix_addbitmapdir` method above). If more than one file with the same name (but different extensions) exist, then the image type is chosen according to the depth of the X display: xbm images are chosen on monochrome displays and color images are chosen on color displays. By using :meth:`tix_getimage`, you can avoid hard coding the pathnames of the image files in your application. When successful, this method returns the name of the newly created image, which can be used to configure the ``image`` option of the Tk and Tix widgets.
es_pe: Localiza un archivo de imagen con el nombre :file:`name.xpm`, :file:`name.xbm` o :file:`name.ppm` en uno de los directorios de bitmap (véase el método :meth:`tix_addbitmapdir` arriba). Si existe más de un archivo con el mismo nombre (pero con diferentes extensiones), entonces el tipo de imagen es escogido de acuerdo a la profundidad del monitor X: las imágenes xbm son escogidas en monitores monocromos e imágenes de color son escogidas en monitores de color. Al usar :meth:`tex_getimage`, puedes evitar codificar de forma directa los nombres de ruta de los archivos de imagen en tu aplicación. Cuando tiene éxito, este método retorna el nombre de la imagen recién creada, que puede ser usada para configurar la opción ``image`` de los widgets Tk y Tix.

source: Gets the options maintained by the Tix scheme mechanism.
es_pe: Obtiene las opciones mantenidas por el mecanismo de esquema de Tix.

source: Resets the scheme and fontset of the Tix application to *newScheme* and *newFontSet*, respectively. This affects only those widgets created after this call. Therefore, it is best to call the resetoptions method before the creation of any widgets in a Tix application.
es_pe: Reinicia el esquema y conjunto de fuentes de la aplicación Tix a *newScheme* y *newFontSet*, respectivamente. Afecta sólo a los widgets creados después de esta invocación. Por lo tanto, es mejor invocar al método *resetoptions* antes de la creación de cualquier widget en una aplicación Tix.

source: The optional parameter *newScmPrio* can be given to reset the priority level of the Tk options set by the Tix schemes.
es_pe: Se le puede dar el parámetro opcional *newScmPrio* para reiniciar el nivel de prioridad de las opciones de Tk definidas por los esquemas de Tix.

source: Because of the way Tk handles the X option database, after Tix has been has imported and inited, it is not possible to reset the color schemes and font sets using the :meth:`tix_config` method. Instead, the :meth:`tix_resetoptions` method must be used.
es_pe: Debido a la manera en que Tk gestiona la opción de la base de datos X, después de que Tix se haya importado e inicializado, no es posible reiniciar el esquema de colores y conjunto de fuentes usando el método :meth:`tix_config` método. En vez de eso, se debe usar el método :meth:`tix_resetoptions`.
