Repository: python/python-docs-es
Catalog: library/tkinter.tix.po
Languages: es_pe

source: :mod:`tkinter.tix` --- Extension widgets for Tk
es_pe: :mod:`tkinter.tix` --- Ampliación de widgets para Tk

source: **Source code:** :source:`Lib/tkinter/tix.py`
es_pe: **Código fuente:** :source:`Lib/tkinter/tix.py`

source: This Tk extension is unmaintained and should not be used in new code. Use :mod:`tkinter.ttk` instead.
es_pe: Esta ampliación de Tk no está mantenida y no debe ser usada en nuevo código. Use :mod:`tkinter.ttk` en su lugar.

source: The :mod:`tkinter.tix` (Tk Interface Extension) module provides an additional rich set of widgets. Although the standard Tk library has many useful widgets, they are far from complete. The :mod:`tkinter.tix` library provides most of the commonly needed widgets that are missing from standard Tk: :class:`HList`, :class:`ComboBox`, :class:`Control` (a.k.a. SpinBox) and an assortment of scrollable widgets. :mod:`tkinter.tix` also includes many more widgets that are generally useful in a wide range of applications: :class:`NoteBook`, :class:`FileEntry`, :class:`PanedWindow`, etc; there are more than 40 of them.
es_pe: El módulo :mod:`tkinter.tix` (*Tk Interface Extension* en inglés) proporciona un conjunto abundante de widgets adicionales. Aunque la biblioteca estándar Tk tiene muchos widgets útiles, están lejos de ser completos. La biblioteca :mod:`tkinter.tix` proporciona la mayoría de los widgets comúnmente necesarios que no están en el estándar Tk: :class:`HList`, :class:`ComboBox`, :class:`Control` (alias SpinBox) y una selección de widgets desplazables. :mod:`tkinter.tix` también incluye muchos más widgets que son generalmente útiles en un rango amplio de aplicaciones: :class:`NoteBook`, :class:`FileEntry`, :class:`PanedWindow`, etc; hay más de 40 de ellos.

source: With all these new widgets, you can introduce new interaction techniques into applications, creating more useful and more intuitive user interfaces. You can design your application by choosing the most appropriate widgets to match the special needs of your application and users.
es_pe: Con todos estos nuevos widgets, puedes introducir nuevas técnicas de interacción en aplicaciones, creando interfaces de usuario más útiles y más intuitivas. Puedes diseñar tu aplicación al escoger los widgets más apropiados que combinen con las necesidades especiales de tu aplicación y usuarios.

source: The home page for :mod:`Tix`. This includes links to additional documentation and downloads.
es_pe: La página de inicio de :mod:`Tix`. Incluye enlaces a documentación adicional y descargas.

source: On-line version of the man pages and reference material.
es_pe: Versión en línea de las páginas del manual y material de referencia.

source: On-line version of the programmer's reference material.
es_pe: Versión en línea del material de referencia del programador.

source: Tix applications for development of Tix and Tkinter programs. Tide applications work under Tk or Tkinter, and include :program:`TixInspect`, an inspector to remotely modify and debug Tix/Tk/Tkinter applications.
es_pe: Aplicaciones de Tix para el desarrollo de programas de Tix y Tkinter. Las aplicaciones de *Tide* (por *Tix Integrated Development Environment* en sus siglas de inglés) trabajan bajo Tk o Tkinter, e incluyen :program:`TixInspect`, un inspector para modificar y depurar aplicaciones Tix/Tk/Tkinter remotamente.

source: Using Tix
es_pe: Usando Tix

source: Toplevel widget of Tix which represents mostly the main window of an application. It has an associated Tcl interpreter.
es_pe: Un widget de alto nivel de Tix que representa generalmente la ventana principal de una aplicación. Tiene un intérprete *Tcl* asociado.

source: Classes in the :mod:`tkinter.tix` module subclasses the classes in the :mod:`tkinter`. The former imports the latter, so to use :mod:`tkinter.tix` with Tkinter, all you need to do is to import one module. In general, you can just import :mod:`tkinter.tix`, and replace the toplevel call to :class:`tkinter.Tk` with :class:`tix.Tk`::
es_pe: Las clases en el módulo :mod:`tkinter.tix` heredan de la clases en :mod:`tkinter`. El primero importa el segundo, por lo que para usar :mod:`tkinter.tix` con Tkinter, todo lo que necesitas hacer es importar un módulo. En general, puedes importar :mod:`tkinter.tix`, y reemplazar las invocaciones de alto nivel a :class:`tkinter.Tk` con :class:`tix.Tk`::

source: To use :mod:`tkinter.tix`, you must have the Tix widgets installed, usually alongside your installation of the Tk widgets. To test your installation, try the following::
es_pe: Para usar :mod:`tkinter.tix`, debes tener los widgets Tix instalados, usualmente junto a tu instalación de los widgets Tk. Para probar tu instalación, intenta lo siguiente::

source: Tix Widgets
es_pe: Widgets de Tix

source: `Tix <https://tix.sourceforge.net/dist/current/man/html/TixCmd/TixIntro.htm>`_ introduces over 40 widget classes to the :mod:`tkinter` repertoire.
es_pe: `Tix <https://tix.sourceforge.net/dist/current/man/html/TixCmd/TixIntro.htm>`_ introduce más de 40 clases de widget al repertorio de :mod:`tkinter`.

source: Basic Widgets
es_pe: Widgets Básicos

source: A `Balloon <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixBalloon.htm>`_ that pops up over a widget to provide help. When the user moves the cursor inside a widget to which a Balloon widget has been bound, a small pop-up window with a descriptive message will be shown on the screen.
es_pe: Un `Globo <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixBalloon.htm>`_ que aparece sobre un widget para proporcionar ayuda. Cuando el usuario mueve el cursor dentro de un widget al cual el widget Globo está ligado, una pequeña ventana emergente con un mensaje descriptivo se mostrará en la pantalla.

source: The `ButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixButtonBox.htm>`_ widget creates a box of buttons, such as is commonly used for ``Ok Cancel``.
es_pe: El widget `ButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixButtonBox.htm>`_ crea una caja de botones, tal como es comúnmente usado para ``Ok Cancelar``.

source: The `ComboBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixComboBox.htm>`_ widget is similar to the combo box control in MS Windows. The user can select a choice by either typing in the entry subwidget or selecting from the listbox subwidget.
es_pe: El widget `ComboBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixComboBox.htm>`_ es similar al control de caja de selección combinada en MS Windows. El usuario puede seleccionar una opción escribiendo en el *subwidget* de entrada o seleccionando de la caja de lista del subwidget.

source: The `Control <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixControl.htm>`_ widget is also known as the :class:`SpinBox` widget. The user can adjust the value by pressing the two arrow buttons or by entering the value directly into the entry. The new value will be checked against the user-defined upper and lower limits.
es_pe: El widget `Control <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixControl.htm>`_ es también conocido como el widget :class:`SpinBox`. El usuario puede ajustar el valor al presionar los dos botones de flecha o al ingresar el valor directamente en la entrada. El nuevo valor será comparado con los límites superiores e inferiores definidos por el usuario.

source: The `LabelEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelEntry.htm>`_ widget packages an entry widget and a label into one mega widget. It can be used to simplify the creation of "entry-form" type of interface.
es_pe: El widget `LabelEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelEntry.htm>`_ empaqueta un widget de entrada y una etiqueta en un mega widget. Puede ser usado para simplificar la creación de los tipos de interfaz de "formularios de entrada".

source: The `LabelFrame <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelFrame.htm>`_ widget packages a frame widget and a label into one mega widget. To create widgets inside a LabelFrame widget, one creates the new widgets relative to the :attr:`frame` subwidget and manage them inside the :attr:`frame` subwidget.
es_pe: El widget `LabelFrame <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelFrame.htm>`_ empaqueta un widget *frame* y una etiqueta en un mega widget. Para crear widgets dentro de un widget *LabelFrame*, uno crea los nuevos widgets relativos al *subwidget* :attr:`frame` y los gestiona dentro del subwidget :attr:`frame`.

source: The `Meter <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixMeter.htm>`_ widget can be used to show the progress of a background job which may take a long time to execute.
es_pe: El widget `Meter <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixMeter.htm>`_ puede ser usado para mostrar el progreso de un trabajo en segundo plano que puede tomar un largo tiempo de ejecución.

source: The `OptionMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixOptionMenu.htm>`_ creates a menu button of options.
es_pe: El widget `OptionMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixOptionMenu.htm>`_ crea un botón de menú de opciones.

source: The `PopupMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPopupMenu.htm>`_ widget can be used as a replacement of the ``tk_popup`` command. The advantage of the :mod:`Tix` :class:`PopupMenu` widget is it requires less application code to manipulate.
es_pe: El widget `PopupMenu <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPopupMenu.htm>`_ puede ser usado como un reemplazo del comando ``tk_popup``. La ventaja del widget :class:`PopupMenu` de :mod:`Tix` es que requiere menos código de aplicación para manipular.

source: The `Select <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixSelect.htm>`_ widget is a container of button subwidgets. It can be used to provide radio-box or check-box style of selection options for the user.
es_pe: El widget `Select <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixSelect.htm>`_ es un contenedor de *subwidgets* botón. Puede ser usado para proporcionar opciones de selección de estilos radio-box o check-box para el usuario.

source: The `StdButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixStdButtonBox.htm>`_ widget is a group of standard buttons for Motif-like dialog boxes.
es_pe: El widget `StdButtonBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixStdButtonBox.htm>`_ es un grupo de botones estándares para cajas de diálogo similares a *Motif*.

source: File Selectors
es_pe: Selectores de Archivos

source: The `DirList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirList.htm>`_ widget displays a list view of a directory, its previous directories and its sub-directories. The user can choose one of the directories displayed in the list or change to another directory.
es_pe: El widget `DirList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirList.htm>`_ muestra una vista de lista de un directorio, sus directorios previos, y sus sub-directorios. El usuario puede mostrar uno de los directorios mostrados en la lista o cambiar a otro directorio.

source: The `DirTree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirTree.htm>`_ widget displays a tree view of a directory, its previous directories and its sub-directories. The user can choose one of the directories displayed in the list or change to another directory.
es_pe: El widget `DirTree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirTree.htm>`_ muestra una vista de árbol de un directorio, sus directorios previos y sus sub-directorios. El usuario puede escoger uno de los directorios mostrados en la lista o cambiar a otro directorio.

source: The `DirSelectDialog <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirSelectDialog.htm>`_ widget presents the directories in the file system in a dialog window. The user can use this dialog window to navigate through the file system to select the desired directory.
es_pe: El widget `DirSelectDialog <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirSelectDialog.htm>`_ presenta los directorios en el sistema de archivos en una ventana de diálogo. El usuario puede usar esta ventana de diálogo para navegar a través del sistema de archivos para seleccionar el directorio deseado.

source: The :class:`DirSelectBox` is similar to the standard Motif(TM) directory-selection box. It is generally used for the user to choose a directory. DirSelectBox stores the directories mostly recently selected into a ComboBox widget so that they can be quickly selected again.
es_pe: El widget :class:`DirSelectBox` es similar al cuadro de selección de directorio estándar de Motif(TM). Es generalmente usado para que el usuario escoja un directorio. *DirSelectBox* guarda los directorios seleccionados recientemente en un widget de cuadro combinado para que puedan ser seleccionados rápidamente de nuevo.

source: The `ExFileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixExFileSelectBox.htm>`_ widget is usually embedded in a tixExFileSelectDialog widget. It provides a convenient method for the user to select files. The style of the :class:`ExFileSelectBox` widget is very similar to the standard file dialog on MS Windows 3.1.
es_pe: El widget `ExFileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixExFileSelectBox.htm>`_ es usualmente embebido en un widget *tixExFileSelectDialog*. Proporciona un método conveniente para que el usuario seleccione archivos. El estilo del widget :class:`ExFileSelectBox` es muy similar al diálogo de archivo estándar en MS Windows 3.1.

source: The `FileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileSelectBox.htm>`_ is similar to the standard Motif(TM) file-selection box. It is generally used for the user to choose a file. FileSelectBox stores the files mostly recently selected into a :class:`ComboBox` widget so that they can be quickly selected again.
es_pe: El widget `FileSelectBox <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileSelectBox.htm>`_ es similar al cuadro de selección de archivo estándar de Motif(TM). Es generalmente usado para que el usuario escoja un archivo. *FileSelectBox* guarda los archivos recientemente seleccionados en un widget :class:`ComboBox` para que puedan ser rápidamente seleccionados de nuevo.

source: The `FileEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileEntry.htm>`_ widget can be used to input a filename. The user can type in the filename manually. Alternatively, the user can press the button widget that sits next to the entry, which will bring up a file selection dialog.
es_pe: El widget `FileEntry <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileEntry.htm>`_ puede ser usado para ingresar un nombre de archivo. El usuario puede tipear el nombre de archivo manualmente. Alternativamente, el usuario puede presionar el widget de botón que está al lado de la entrada, que mostrará un diálogo de selección de archivo.

source: Hierarchical ListBox
es_pe: *ListBox* jerárquico

source: The `HList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixHList.htm>`_ widget can be used to display any data that have a hierarchical structure, for example, file system directory trees. The list entries are indented and connected by branch lines according to their places in the hierarchy.
es_pe: El widget `HList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixHList.htm>`_ puede ser usado para mostrar cualquier dato que tenga una estructura jerárquica, por ejemplo, árboles del directorio del sistema de archivos. Las entradas de las líneas son sangradas y conectadas por líneas de ramas de acuerdo a sus lugares en la jerarquía.

source: The `CheckList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixCheckList.htm>`_ widget displays a list of items to be selected by the user. CheckList acts similarly to the Tk checkbutton or radiobutton widgets, except it is capable of handling many more items than checkbuttons or radiobuttons.
es_pe: El widget `CheckList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixCheckList.htm>`_ muestra una lista de objetos a ser seleccionados por el usuario. *CheckList* actúa de forma similar a los widget Tk *checkbutton* o *radiobutton*, excepto que es capaz de manejar muchos más objetos que los widgets *checkbutton* o *radiobutton*.

source: The `Tree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTree.htm>`_ widget can be used to display hierarchical data in a tree form. The user can adjust the view of the tree by opening or closing parts of the tree.
es_pe: Se puede usar el widget `Tree <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTree.htm>`_ para mostrar datos jerárquicos en una forma de árbol. El usuario puede ajustar la vista del árbol al abrir o cerrar partes del árbol.

source: Tabular ListBox
es_pe: *ListBox* Tabular

source: The `TList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTList.htm>`_ widget can be used to display data in a tabular format. The list entries of a :class:`TList` widget are similar to the entries in the Tk listbox widget. The main differences are (1) the :class:`TList` widget can display the list entries in a two dimensional format and (2) you can use graphical images as well as multiple colors and fonts for the list entries.
es_pe: Se puede usar el widget `TList <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTList.htm>`_ para mostrar datos en un formato tabular. Las entradas de lista de un widget :class:`TList` son similares a las entradas del widget *listbox*. Las principales diferencias son (1) el widget :class:`TList` puede mostrar las entradas de la lista en un formato de dos dimensiones y (2) puedes usar imágenes gráficas así como también como múltiples colores y fuentes para las entradas de lista.

source: Manager Widgets
es_pe: Gestores de Widgets

source: The `PanedWindow <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPanedWindow.htm>`_ widget allows the user to interactively manipulate the sizes of several panes. The panes can be arranged either vertically or horizontally. The user changes the sizes of the panes by dragging the resize handle between two panes.
es_pe: El widget `PanedWindow <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPanedWindow.htm>`_ permite que el usuario manipule interactivamente los tamaños de varios paneles. Los paneles pueden ser ordenados o verticalmente u horizontalmente. El usuario cambia los tamaños de los paneles al arrastrar el asa de redimensionamiento entre dos paneles.

source: The `ListNoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixListNoteBook.htm>`_ widget is very similar to the :class:`TixNoteBook` widget: it can be used to display many windows in a limited space using a notebook metaphor. The notebook is divided into a stack of pages (windows). At one time only one of these pages can be shown. The user can navigate through these pages by choosing the name of the desired page in the :attr:`hlist` subwidget.
es_pe: El widget `ListNoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixListNoteBook.htm>`_ es muy similar al widget :class:`TixNoteBook`: puede ser usado para mostrar muchas ventanas en un espacio limitado usando la metáfora del cuaderno (*notebook*). El cuaderno es dividido en una pila de páginas (ventanas). Sólo una de estas páginas se muestra a la vez. El usuario puede navegar a través de estas páginas al escoger el nombre de la página deseada en el *subwidget* :attr:`hlist`.

source: The `NoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixNoteBook.htm>`_ widget can be used to display many windows in a limited space using a notebook metaphor. The notebook is divided into a stack of pages. At one time only one of these pages can be shown. The user can navigate through these pages by choosing the visual "tabs" at the top of the NoteBook widget.
es_pe: Se puede usar el widget `NoteBook <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixNoteBook.htm>`_ para mostrar muchas ventanas en un espacio limitado usando la metáfora del cuaderno (*notebook*). El *notebook* es dividido en una pila de páginas. Sólo una de estas páginas se puede mostrar a la vez. El usuario puede navegar a través de estas páginas al escoger las "pestañas" visuales arriba del widget *NoteBook*.

source: Image Types
es_pe: Tipos de Imágenes

source: The :mod:`tkinter.tix` module adds:
es_pe: El módulo :mod:`tkinter.tix` añade:

source: `pixmap <https://tix.sourceforge.net/dist/current/man/html/TixCmd/pixmap.htm>`_ capabilities to all :mod:`tkinter.tix` and :mod:`tkinter` widgets to create color images from XPM files.
es_pe: capacidades de `pixmap <https://tix.sourceforge.net/dist/current/man/html/TixCmd/pixmap.htm>`_ a todos los widgets de :mod:`tkinter.tix` y :mod:`tkinter` para crear imágenes de color a partir de archivos XPM.

source: `Compound <https://tix.sourceforge.net/dist/current/man/html/TixCmd/compound.htm>`_ image types can be used to create images that consists of multiple horizontal lines; each line is composed of a series of items (texts, bitmaps, images or spaces) arranged from left to right. For example, a compound image can be used to display a bitmap and a text string simultaneously in a Tk :class:`Button` widget.
es_pe: se pueden usar los tipos de imágenes `Compound <https://tix.sourceforge.net/dist/current/man/html/TixCmd/compound.htm>`_ para crear imágenes que consisten en múltiples líneas horizontales; cada línea es compuesta de una serie de objetos (texto, bitmaps, imágenes, o espacios) ordenados de izquierda a derecha. Por ejemplo, una imagen compuesta puede ser usada para mostrar un bitmap y una cadena de texto simultáneamente en un widget Tk :class:`Button`.

source: Miscellaneous Widgets
es_pe: Widgets Varios

source: The `InputOnly <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixInputOnly.htm>`_ widgets are to accept inputs from the user, which can be done with the ``bind`` command (Unix only).
es_pe: Los widgets `InputOnly <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixInputOnly.htm>`_ van a aceptar entradas del usuario, que pueden ser realizadas con el comando ``bind`` (sólo para Unix).

source: Form Geometry Manager
es_pe: Gestor de Geometría de Formulario

source: In addition, :mod:`tkinter.tix` augments :mod:`tkinter` by providing:
es_pe: Además, :mod:`tkinter.tix` mejora a :mod:`tkinter` al proporcionar:

source: The `Form <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixForm.htm>`_ geometry manager based on attachment rules for all Tk widgets.
es_pe: El gestor de geometría de `Formulario <https://tix.sourceforge.net/dist/current/man/html/TixCmd/tixForm.htm>`_ basado en reglas de anexo para todos los widgets Tk.

source: Tix Commands
es_pe: Comandos Tix
