Repository: python/python-docs-es
Catalog: library/tkinter.dnd.po
Languages: es

source: :mod:`tkinter.dnd` --- Drag and drop support
es: :mod:`tkinter.dnd` --- Soporte de arrastrar y soltar

source: **Source code:** :source:`Lib/tkinter/dnd.py`
es: **Código fuente:** :source:`Lib/tkinter/dnd.py`

source: This is experimental and due to be deprecated when it is replaced with the Tk DND.
es: Esto es experimental y quedará obsoleto cuando se sustituya por el Tk DND.

source: The :mod:`tkinter.dnd` module provides drag-and-drop support for objects within a single application, within the same window or between windows. To enable an object to be dragged, you must create an event binding for it that starts the drag-and-drop process. Typically, you bind a ButtonPress event to a callback function that you write (see :ref:`Bindings-and-Events`). The function should call :func:`dnd_start`, where 'source' is the object to be dragged, and 'event' is the event that invoked the call (the argument to your callback function).
es: El módulo :mod:`tkinter.dnd` proporciona soporte para arrastrar y soltar objetos dentro de una sola aplicación, dentro de la misma ventana o entre ventanas. Para permitir que se arrastre un objeto, debe crear un enlace de evento para él que inicie el proceso de arrastrar y soltar. Por lo general, vincula un evento ButtonPress a una función de devolución de llamada que escribe (consulte :ref:`Bindings-and-Events`). La función debe llamar a :func:`dnd_start`, donde 'fuente' es el objeto que se va a arrastrar y 'evento' es el evento que invoca la llamada (el argumento de la función de devolución de llamada).

source: Selection of a target object occurs as follows:
es: La selección de un objeto de destino ocurre de la siguiente manera:

source: Top-down search of area under mouse for target widget
es: Búsqueda de arriba hacia abajo del área debajo del mouse para el widget de destino

source: Target widget should have a callable *dnd_accept* attribute
es: El widget de destino debe tener un atributo *dnd_accept* invocable

source: If *dnd_accept* is not present or returns None, search moves to parent widget
es: Si *dnd_accept* no está presente o devuelve None, la búsqueda se mueve al widget principal

source: If no target widget is found, then the target object is None
es: Si no se encuentra ningún widget de destino, el objeto de destino es None

source: Call to *<old_target>.dnd_leave(source, event)*
es: Llama a *<old_target>.dnd_leave(source, event)*

source: Call to *<new_target>.dnd_enter(source, event)*
es: Llama a *<new_target>.dnd_enter(source, event)*

source: Call to *<target>.dnd_commit(source, event)* to notify of drop
es: Llama a *<target>.dnd_commit(source, event)* para notificar la caída

source: Call to *<source>.dnd_end(target, event)* to signal end of drag-and-drop
es: Llama a *<source>.dnd_end(target, event)* para señalar el final de arrastrar y soltar

source: The *DndHandler* class handles drag-and-drop events tracking Motion and ButtonRelease events on the root of the event widget.
es: La clase *DndHandler* maneja los eventos de arrastrar y soltar que rastrean los eventos Motion y ButtonRelease en la raíz del widget de eventos.

source: Cancel the drag-and-drop process.
es: Cancela el proceso de arrastrar y soltar.

source: Execute end of drag-and-drop functions.
es: Ejecuta el fin de las funciones de arrastrar y soltar.

source: Inspect area below mouse for target objects while drag is performed.
es: Inspecciona el área debajo del mouse en busca de objetos de destino mientras se realiza el arrastre.

source: Signal end of drag when the release pattern is triggered.
es: Señal de fin de arrastre cuando se activa el patrón de liberación.

source: Factory function for drag-and-drop process.
es: Función de fábrica para el proceso de arrastrar y soltar.
