Repository: python/python-docs-es
Catalog: library/tkinter.ttk.po
Languages: es_es

source: Sequence of string or float values. If specified, the increment/decrement buttons will cycle through the items in this sequence rather than incrementing or decrementing numbers.
es_es: Secuencia de valores de cadena o flotantes. Si se especifica, los botones de incremento/disminución recorrerán los elementos de esta secuencia en lugar de incrementar o disminuir los números.

source: Boolean value. If ``True``, increment and decrement buttons will cycle from the ``to`` value to the ``from`` value or the ``from`` value to the ``to`` value, respectively.
es_es: Valor booleano. Si es ``True``, los botones de incremento y disminución pasarán del valor ``to`` al valor ``from`` o del valor ``from`` al valor ``to``, respectivamente.

source: String value. This specifies the format of numbers set by the increment/decrement buttons. It must be in the form "%W.Pf", where W is the padded width of the value, P is the precision, and '%' and 'f' are literal.
es_es: Valor de cadena. Especifica el formato de los números establecidos por los botones de incremento/disminución. Debe tener la forma "%W.Pf", donde W es el ancho de relleno del valor, P es la precisión, y '%' y 'f' son literales.

source: Python callable. Will be called with no arguments whenever either of the increment or decrement buttons are pressed.
es_es: Python invocable. Se llamará sin argumentos cada vez que se presione alguno de los botones de incremento o disminución.

source: The spinbox widget generates an **<<Increment>>** virtual event when the user presses <Up>, and a **<<Decrement>>** virtual event when the user presses <Down>.
es_es: El widget spinbox genera un evento virtual **<<Increment>>** cuando el usuario presiona <Up>, y un evento virtual **<<Decrement>>** cuando el usuario presiona <Down>.

source: Returns the current value of the spinbox.
es_es: Retorna el valor actual del spinbox.

source: Sets the value of the spinbox to *value*.
es_es: Establece el valor del spinbox a *value*.

source: Ttk Notebook widget manages a collection of windows and displays a single one at a time. Each child window is associated with a tab, which the user may select to change the currently-displayed window.
es_es: El widget Ttk Notebook administra una colección de ventanas y muestra una sola a la vez. Cada ventana secundaria está asociada a una pestaña, que el usuario puede seleccionar para cambiar la ventana que se muestra actualmente.

source: If present and greater than zero, specifies the desired height of the pane area (not including internal padding or tabs). Otherwise, the maximum height of all panes is used.
es_es: Si está presente y es mayor que cero, especifica la altura deseada del área del panel (sin incluir el relleno interno o las pestañas). De lo contrario, se utiliza la altura máxima de todos los paneles.

source: Specifies the amount of extra space to add around the outside of the notebook. The padding is a list up to four length specifications left top right bottom. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left.
es_es: Especifica la cantidad de espacio adicional que se va a agregar alrededor del exterior del bloc de notas. El relleno es una lista de hasta cuatro especificaciones de longitud izquierda superior derecha inferior. Si se especifican menos de cuatro elementos, el valor predeterminado inferior es el superior, el valor predeterminado de la derecha es el de la izquierda y el valor predeterminado superior es el de la izquierda.

source: If present and greater than zero, specified the desired width of the pane area (not including internal padding). Otherwise, the maximum width of all panes is used.
es_es: Si está presente y es mayor que cero, especifica el ancho deseado del área del panel (sin incluir el relleno interno). De lo contrario, se utiliza el ancho máximo de todos los paneles.

source: Tab Options
es_es: Opciones de pestañas

source: There are also specific options for tabs:
es_es: Las opciones específicas para pestañas son:

source: Either "normal", "disabled" or "hidden". If "disabled", then the tab is not selectable. If "hidden", then the tab is not shown.
es_es: O bien "normal", "disabled" o "hidden". Si es "disabled", la pestaña no se puede seleccionar. Si es "hidden", la pestaña no se muestra.

source: Specifies how the child window is positioned within the pane area. Value is a string containing zero or more of the characters "n", "s", "e" or "w". Each letter refers to a side (north, south, east or west) that the child window will stick to, as per the :meth:`grid` geometry manager.
es_es: Especifica cómo se coloca la ventana secundaria dentro del área del panel. *Value* es una cadena que contiene cero o más de los caracteres "n", "s", "e" o "w". Cada letra se refiere a un lado (norte, sur, este u oeste) al que se pegará la ventana secundaria, según el administrador de geometría :meth:`grid`.

source: Specifies the amount of extra space to add between the notebook and this pane. Syntax is the same as for the option padding used by this widget.
es_es: Especifica la cantidad de espacio adicional que se va a agregar entre el notebook y este panel. La sintaxis es la misma que para el relleno de opciones utilizado por Notebook.

source: Specifies a text to be displayed in the tab.
es_es: Especifica un texto que se muestra en la pestaña.

source: Specifies an image to display in the tab. See the option image described in :class:`Widget`.
es_es: Especifica una imagen que se muestra en la pestaña. Consulta la opción de imagen descrita en :class:`Widget`.

source: Specifies how to display the image relative to the text, in the case both options text and image are present. See `Label Options`_ for legal values.
es_es: Especifica cómo mostrar la imagen en relación con el texto, en el caso de que tanto el texto como la imagen estén presentes. Consulta `Label Options`_ para obtener valores válidos.

source: Specifies the index (0-based) of a character to underline in the text string. The underlined character is used for mnemonic activation if :meth:`Notebook.enable_traversal` is called.
es_es: Especifica el índice (basado en 0) de un carácter que se va a subrayar en la cadena de texto. El carácter subrayado se utiliza para la activación mnemotécnica si se llama a :meth:`Notebook.enable_traversal`.

source: Tab Identifiers
es_es: Identificadores de pestañas

source: The tab_id present in several methods of :class:`ttk.Notebook` may take any of the following forms:
es_es: El tab_id presente en varios métodos de :class:`ttk.Notebook` puede tener cualquiera de las siguientes formas:

source: An integer between zero and the number of tabs
es_es: Un entero entre cero y el número de pestañas

source: The name of a child window
es_es: El nombre de una ventana secundaria

source: A positional specification of the form "@x,y", which identifies the tab
es_es: Un especificación de posición de la forma "@x,y" que identifique la pestaña

source: The literal string "current", which identifies the currently-selected tab
es_es: El valor "current" que identifica la pestaña seleccionada actualmente

source: The literal string "end", which returns the number of tabs (only valid for :meth:`Notebook.index`)
es_es: El valor "end" que retorna el número de pestañas (válido solo para :meth:`Notebook.index`)

source: Virtual Events
es_es: Eventos virtuales

source: This widget generates a **<<NotebookTabChanged>>** virtual event after a new tab is selected.
es_es: Este widget genera un evento virtual **<<NotebookTabChanged>>** después de seleccionar una nueva pestaña.

source: Adds a new tab to the notebook.
es_es: Añade una nueva pestaña al notebook.

source: If window is currently managed by the notebook but hidden, it is restored to its previous position.
es_es: Si la ventana está actualmente administrada por el notebook pero oculta, se restaura a su posición anterior.

source: See `Tab Options`_ for the list of available options.
es_es: Consulta `Tab Options`_ para la lista de opciones disponibles.

source: Removes the tab specified by *tab_id*, unmaps and unmanages the associated window.
es_es: Quita la pestaña especificada por *tab_id*, desasigna y quita la ventana asociada.

source: Hides the tab specified by *tab_id*.
es_es: Oculta la pestaña especificada por *tab_id*.

source: The tab will not be displayed, but the associated window remains managed by the notebook and its configuration remembered. Hidden tabs may be restored with the :meth:`add` command.
es_es: La pestaña no se mostrará, pero la ventana asociada permanece administrada por el notebook y se recordará su configuración. Las pestañas ocultas se pueden restaurar con el comando :meth:`add`.

source: Returns the name of the tab element at position *x*, *y*, or the empty string if none.
es_es: Retorna el nombre del elemento de la pestaña en la posición *x*, *y* o cadena vacía si no hay ninguno.

source: Returns the numeric index of the tab specified by *tab_id*, or the total number of tabs if *tab_id* is the string "end".
es_es: Retorna el índice numérico de la pestaña especificada por *tab_id*, o el número total de pestañas si *tab_id* es la cadena "end".

source: Inserts a pane at the specified position.
es_es: Añade un panel en la posición especificada.

source: *pos* is either the string "end", an integer index, or the name of a managed child. If *child* is already managed by the notebook, moves it to the specified position.
es_es: *pos* es la cadena "end", un índice entero o el nombre de un elemento secundario administrado. Si el bloc de notas ya administra *child*, lo mueve a la posición especificada.

source: Selects the specified *tab_id*.
es_es: Selecciona el *tab_id* especificado.

source: The associated child window will be displayed, and the previously-selected window (if different) is unmapped. If *tab_id* is omitted, returns the widget name of the currently selected pane.
es_es: Se mostrará la ventana secundaria asociada y la ventana previamente seleccionada (si es diferente) no se debe asignar. Si se omite *tab_id*, retorna el nombre del widget del panel seleccionado actualmente.

source: Query or modify the options of the specific *tab_id*.
es_es: Consultar o modificar las opciones del *tab_id* específico.

source: If *kw* is not given, returns a dictionary of the tab option values. If *option* is specified, returns the value of that *option*. Otherwise, sets the options to the corresponding values.
es_es: Si no se proporciona *kw*, retorna un diccionario de los valores de las opciones de pestañas. Si se especifica *option*, retorna el valor de esa *option*. De lo contrario, establece las opciones en los valores correspondientes.

source: Returns a list of windows managed by the notebook.
es_es: Retorna una lista de ventanas administradas por el notebook.

source: Enable keyboard traversal for a toplevel window containing this notebook.
es_es: Habilita la tabulación para una ventana de nivel superior que contenga este notebook.

source: This will extend the bindings for the toplevel window containing the notebook as follows:
es_es: Esto extenderá los enlaces para la ventana de nivel superior que contiene el notebook del siguiente modo:

source: :kbd:`Control-Tab`: selects the tab following the currently selected one.
es_es: :kbd:`Control-Tab`: selecciona la pestaña siguiente a la seleccionada actualmente.

source: :kbd:`Shift-Control-Tab`: selects the tab preceding the currently selected one.
es_es: :kbd:`Shift-Control-Tab`: selecciona la pestaña precedente a la seleccionada actualmente.

source: :kbd:`Alt-K`: where *K* is the mnemonic (underlined) character of any tab, will select that tab.
es_es: :kbd:`Alt-K`: donde *K* es el carácter mnemotécnico (subrayado) de cualquier pestaña, seleccionará esa pestaña.

source: Multiple notebooks in a single toplevel may be enabled for traversal, including nested notebooks. However, notebook traversal only works properly if all panes have the notebook they are in as master.
es_es: Se pueden habilitar varios notebooks en un único nivel superior para la tabulación, incluidos los notebooks anidados. Sin embargo, la tabulación entre notebooks solo funciona correctamente si todos los paneles tienen el notebook en el que se encuentran como maestro.

source: The :class:`ttk.Progressbar` widget shows the status of a long-running operation. It can operate in two modes: 1) the determinate mode which shows the amount completed relative to the total amount of work to be done and 2) the indeterminate mode which provides an animated display to let the user know that work is progressing.
es_es: El widget :class:`ttk.Progressbar` muestra el estado de una operación de larga duración. Puede funcionar en dos modos: 1) el modo determinado que muestra la cantidad completada en función de la cantidad total de trabajo a realizar y 2) el modo indeterminado que proporciona una pantalla animada para que el usuario sepa que la operación está en curso.

source: One of "horizontal" or "vertical". Specifies the orientation of the progress bar.
es_es: Puede ser "horizontal" o "vertical". Especifica la orientación de la barra de progreso.

source: Specifies the length of the long axis of the progress bar (width if horizontal, height if vertical).
es_es: Especifica la longitud del eje largo de la barra de progreso (ancho si horizontal, alto si es vertical).

source: One of "determinate" or "indeterminate".
es_es: Puede ser "determinate" o "indeterminate".

source: A number specifying the maximum value. Defaults to 100.
es_es: Número que especifica el valor máximo. Por defecto el valor es 100.

source: The current value of the progress bar. In "determinate" mode, this represents the amount of work completed. In "indeterminate" mode, it is interpreted as modulo *maximum*; that is, the progress bar completes one "cycle" when its value increases by *maximum*.
es_es: El valor actual de la barra de progreso. En el modo "determinado", representa la cantidad de trabajo completado. En el modo "indeterminado", se interpreta como módulo *maximum*, es decir, la barra de progreso completa un "ciclo" cuando su valor aumenta en *maximum*.

source: A name which is linked to the option value. If specified, the value of the progress bar is automatically set to the value of this name whenever the latter is modified.
es_es: Nombre vinculado al valor de la opción. Si se especifica, el valor de la barra de progreso se establece automáticamente en el valor de este nombre cada vez que se modifica dicho valor.

source: Read-only option. The widget periodically increments the value of this option whenever its value is greater than 0 and, in determinate mode, less than maximum. This option may be used by the current theme to provide additional animation effects.
es_es: Variable de solo lectura. El widget incrementa periódicamente el valor de esta opción siempre que su valor sea mayor que 0 y, en modo determinado, menor que el máximo. Esta opción puede ser utilizada por el tema actual para proporcionar efectos de animación adicionales.

source: Begin autoincrement mode: schedules a recurring timer event that calls :meth:`Progressbar.step` every *interval* milliseconds. If omitted, *interval* defaults to 50 milliseconds.
es_es: Inicia el modo de incremento automático: programa un evento *timer* periódico que llama a :meth:`Progressbar.step` cada *interval* milisegundos. Si se omite, *interval* tiene como valor predeterminado 50 milisegundos.

source: Increments the progress bar's value by *amount*.
es_es: Incrementa el valor de la barra de progreso en *amount*.

source: *amount* defaults to 1.0 if omitted.
es_es: *amount* vale 1.0 por defecto si se omite.

source: Stop autoincrement mode: cancels any recurring timer event initiated by :meth:`Progressbar.start` for this progress bar.
es_es: Para el modo de incremento automático: cancela cualquier evento *timer* periódico iniciado por :meth:`Progressbar.start` para la barra de progreso en cuestión.

source: The :class:`ttk.Separator` widget displays a horizontal or vertical separator bar.
es_es: El widget :class:`ttk.Separator` muestra una barra de separación horizontal o vertical.

source: It has no other methods besides the ones inherited from :class:`ttk.Widget`.
es_es: No tiene otros métodos aparte de aquellos heredados de :class:`ttk.Widget`.

source: This widget accepts the following specific option:
es_es: Este widget acepta las opción específica siguiente:

source: One of "horizontal" or "vertical". Specifies the orientation of the separator.
es_es: Puede ser "horizontal" o "vertical". Especifica la orientación del separador.

source: The :class:`ttk.Sizegrip` widget (also known as a grow box) allows the user to resize the containing toplevel window by pressing and dragging the grip.
es_es: El widget :class:`ttk.Sizegrip` (también conocido como *grow box*) permite al usuario cambiar el tamaño de la ventana de nivel superior que lo contiene presionando y arrastrando la esquina.

source: This widget has neither specific options nor specific methods, besides the ones inherited from :class:`ttk.Widget`.
es_es: Este widget no tiene ni opciones ni métodos específicos, aparte de aquellos heredados de :class:`ttk.Widget`.

source: Platform-specific notes
es_es: Notas específicas por plataforma

source: On MacOS X, toplevel windows automatically include a built-in size grip by default. Adding a :class:`Sizegrip` is harmless, since the built-in grip will just mask the widget.
es_es: En MacOS X, las ventanas de nivel superior incluyen automáticamente un cambio de tamaño integrado de forma predeterminada. Agregar un :class:`Sizegrip` es poco útil, ya que el cambio de tamaño integrado quedará encima del widget.

source: Bugs
es_es: Errores detectados

source: If the containing toplevel's position was specified relative to the right or bottom of the screen (e.g. ....), the :class:`Sizegrip` widget will not resize the window.
es_es: Si la posición del nivel superior que lo contiene se especifica en relación con la parte derecha o inferior de la pantalla (por ejemplo,...), el widget :class:`Sizegrip` no cambiará el tamaño de la ventana.

source: This widget supports only "southeast" resizing.
es_es: El widget solo soporta el cambio de tamaño desde la esquina inferior derecha.

source: The :class:`ttk.Treeview` widget displays a hierarchical collection of items. Each item has a textual label, an optional image, and an optional list of data values. The data values are displayed in successive columns after the tree label.
es_es: El widget :class:`ttk.Treeview` muestra una colección en árbol de elementos. Cada elemento tiene una etiqueta textual, una imagen opcional y una lista opcional de valores de datos. Los valores de datos se muestran en columnas sucesivas después de la etiqueta de árbol.

source: The order in which data values are displayed may be controlled by setting the widget option ``displaycolumns``. The tree widget can also display column headings. Columns may be accessed by number or symbolic names listed in the widget option columns. See `Column Identifiers`_.
es_es: El orden en que se muestran los valores de datos se puede controlar estableciendo la opción de widget ``displaycolumns``. El Treeview también puede mostrar encabezados. Se puede acceder a las columnas por número o nombres simbólicos enumerados en las columnas de opciones del widget. Consulte `Column Identifiers`_.

source: Each item is identified by a unique name. The widget will generate item IDs if they are not supplied by the caller. There is a distinguished root item, named ``{}``. The root item itself is not displayed; its children appear at the top level of the hierarchy.
es_es: Cada elemento se identifica con un nombre único. El widget genera IDs para los elementos si no se proporcionan en la declaración. Hay un elemento raíz distinguido, denominado ``{}``. El elemento raíz en sí no se muestra; sus hijos aparecen en el nivel superior de la jerarquía.

source: Each item also has a list of tags, which can be used to associate event bindings with individual items and control the appearance of the item.
es_es: Cada elemento también tiene una lista de etiquetas que se pueden usar para asociar enlaces de eventos con elementos individuales y controlar la apariencia del elemento.

source: The Treeview widget supports horizontal and vertical scrolling, according to the options described in `Scrollable Widget Options`_ and the methods :meth:`Treeview.xview` and :meth:`Treeview.yview`.
es_es: El widget Treeview admite el deslizamiento horizontal y vertical, según las opciones descritas en `Scrollable Widget Options`_ y los métodos :meth:`Treeview.xview` y :meth:`Treeview.yview`.

source: A list of column identifiers, specifying the number of columns and their names.
es_es: Una lista de identificadores de columna, que especifican el número de columnas y sus nombres.

source: A list of column identifiers (either symbolic or integer indices) specifying which data columns are displayed and the order in which they appear, or the string "#all".
es_es: Una lista de identificadores de columna (índices simbólicos o enteros) que especifican qué columnas de datos se muestran y el orden en que aparecen, o la cadena "#all".

source: Specifies the number of rows which should be visible. Note: the requested width is determined from the sum of the column widths.
es_es: Especifica el número de filas que deben estar visibles. Nota: el ancho solicitado se determina a partir de la suma de los anchos de columna.

source: Specifies the internal padding for the widget. The padding is a list of up to four length specifications.
es_es: Especifica el relleno interno del widget. El relleno es una lista de hasta cuatro especificaciones de longitud.

source: Controls how the built-in class bindings manage the selection. One of "extended", "browse" or "none". If set to "extended" (the default), multiple items may be selected. If "browse", only a single item will be selected at a time. If "none", the selection will not be changed.
es_es: Controla cómo los enlaces de clase integrados administran la selección. Puede ser "extended", "browse" o "none". Si se establece en "extended" (valor predeterminado), se pueden seleccionar varios elementos. Si se elige "browse", se seleccionará un solo elemento a la vez. Si se elige "none", la selección no se cambiará.

source: Note that the application code and tag bindings can set the selection however they wish, regardless of the value of this option.
es_es: Tenga en cuenta que el código de la aplicación y los enlaces de etiqueta pueden establecer la selección como deseen, independientemente del valor de esta opción.

source: A list containing zero or more of the following values, specifying which elements of the tree to display.
es_es: Una lista que contiene cero o más de los siguientes valores, especificando qué elementos del árbol se van a mostrar.

source: tree: display tree labels in column #0.
es_es: tree: muestra las etiquetas del árbol en la columna #0.

source: headings: display the heading row.
es_es: headings: muestra la fila de encabezado.

source: The default is "tree headings", i.e., show all elements.
es_es: El valor predeterminado es "tree headings", es decir, mostrar todos los elementos.

source: **Note**: Column #0 always refers to the tree column, even if show="tree" is not specified.
es_es: **Nota**: la columna #0 siempre hace referencia a la columna del árbol, incluso si no se especifica show="tree".

source: Item Options
es_es: Opciones de elementos

source: The following item options may be specified for items in the insert and item widget commands.
es_es: Las siguientes opciones de elemento se pueden especificar para los elementos de los comandos de inserción y de elementos del widget.
