Repository: python/python-docs-es
Catalog: library/tkinter.po
Languages: es

source: The pack() method can be called with keyword-option/value pairs that control where the widget is to appear within its container, and how it is to behave when the main application window is resized. Here are some examples::
es: Se puede llamar al método *pack()* con pares palabra-clave/valor que controlan dónde debe aparecer el widget dentro de su contenedor y cómo se comportará cuando se cambie el tamaño de la ventana principal de la aplicación. Aquí hay unos ejemplos::

source: Packer Options
es: Opciones del empaquetador

source: For more extensive information on the packer and the options that it can take, see the man pages and page 183 of John Ousterhout's book.
es: Para obtener más información sobre el empaquetador y las opciones que puede tomar, consulte el manual y la página 183 del libro de John Ousterhout.

source: Anchor type. Denotes where the packer is to place each slave in its parcel.
es: Tipo de anclaje. Indica dónde debe colocar el empaquetador a cada esclavo en su espacio.

source: Boolean, ``0`` or ``1``.
es: Un valor booleano, ``0`` o ``1``.

source: Legal values: ``'x'``, ``'y'``, ``'both'``, ``'none'``.
es: Los valores legales son: ``'x'``, ``'y'``, ``'both'``, ``'none'``.

source: ipadx and ipady
es: *ipadx* y *ipady*

source: A distance - designating internal padding on each side of the slave widget.
es: Una distancia que designa el relleno interno a cada lado del widget esclavo.

source: padx and pady
es: *padx* y *pady*

source: A distance - designating external padding on each side of the slave widget.
es: Una distancia que designa el relleno externo a cada lado del widget esclavo.

source: Legal values are: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.
es: Los valores legales son: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.

source: Coupling Widget Variables
es: Asociación de variables de widget

source: The current-value setting of some widgets (like text entry widgets) can be connected directly to application variables by using special options. These options are ``variable``, ``textvariable``, ``onvalue``, ``offvalue``, and ``value``. This connection works both ways: if the variable changes for any reason, the widget it's connected to will be updated to reflect the new value.
es: La asignación de un valor a ciertos objetos gráficos (como los widgets de entrada de texto) se puede vincular directamente a variables en su aplicación utilizando opciones especiales. Estas opciones son ``variable``, ``textvariable``, ``onvalue``, ``offvalue``, y ``value``. Esta conexión funciona en ambos sentidos: si la variable cambia por algún motivo, el widget al que está conectado se actualizará para reflejar el nuevo valor.

source: Unfortunately, in the current implementation of :mod:`tkinter` it is not possible to hand over an arbitrary Python variable to a widget through a ``variable`` or ``textvariable`` option. The only kinds of variables for which this works are variables that are subclassed from a class called Variable, defined in :mod:`tkinter`.
es: Desafortunadamente, en la implementación actual de :mod:`tkinter` no es posible entregar una variable arbitraria de Python a un widget a través de una opción ``variable`` o ``textvariable`` . Los únicos tipos de variables para las cuales esto funciona son variables que son subclases de la clase Variable, definida en :mod:`tkinter`.

source: There are many useful subclasses of Variable already defined: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar`, and :class:`BooleanVar`. To read the current value of such a variable, call the :meth:`get` method on it, and to change its value you call the :meth:`!set` method. If you follow this protocol, the widget will always track the value of the variable, with no further intervention on your part.
es: Hay muchas subclases útiles de Variable ya definidas: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar`, and :class:`BooleanVar`. Para leer el valor actual de dicha variable, es necesario llamar al método :meth:`get`, y para cambiar su valor, al método :meth:`!set`. Si se sigue este protocolo, el widget siempre rastreará el valor de la variable, sin ser necesaria ninguna otra intervención.

source: For example::
es: Por ejemplo::

source: The Window Manager
es: El gestor de ventanas

source: In Tk, there is a utility command, ``wm``, for interacting with the window manager. Options to the ``wm`` command allow you to control things like titles, placement, icon bitmaps, and the like. In :mod:`tkinter`, these commands have been implemented as methods on the :class:`Wm` class. Toplevel widgets are subclassed from the :class:`Wm` class, and so can call the :class:`Wm` methods directly.
es: En Tk hay un comando útil, ``wm``, para interactuar con el gestor de ventanas. Las opciones del comando ``wm`` le permiten controlar cosas como títulos, ubicación, iconos de ventana y similares. En :mod:`tkinter`, estos comandos se han implementado como métodos de la clase :class:`Wm`. Los widgets de *Toplevel* son subclases de :class:`Wm`, por lo que se puede llamar directamente a los métodos de :class:`Wm`.

source: To get at the toplevel window that contains a given widget, you can often just refer to the widget's master. Of course if the widget has been packed inside of a frame, the master won't represent a toplevel window. To get at the toplevel window that contains an arbitrary widget, you can call the :meth:`_root` method. This method begins with an underscore to denote the fact that this function is part of the implementation, and not an interface to Tk functionality.
es: Para acceder a la ventana *Toplevel* que contiene un objeto gráfico dado, a menudo puede simplemente referirse al padre de este objeto gráfico. Por supuesto, si el objeto gráfico fue empaquetado dentro de un marco, el padre no representará la ventana de nivel superior. Para acceder a la ventana de nivel superior que contiene un objeto gráfico arbitrario, puede llamar al método :meth:`_root` . Este método comienza con un subrayado para indicar que esta función es parte de la implementación y no de una interfaz a la funcionalidad Tk.

source: Here are some examples of typical usage::
es: Aquí hay algunos ejemplos típicos::

source: Tk Option Data Types
es: Tipos de datos de opciones Tk

source: Legal values are points of the compass: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, and also ``"center"``.
es: Los valores legales son los puntos de la brújula: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, y también ``"center"``.

source: There are eight built-in, named bitmaps: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'question'``, ``'warning'``. To specify an X bitmap filename, give the full path to the file, preceded with an ``@``, as in ``"@/usr/contrib/bitmap/gumby.bit"``.
es: Hay ocho nombres de *bitmaps* integrados: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'question'``, ``'warning'``. Para especificar un nombre de archivo de mapa de bits de X, indique la ruta completa del archivo, precedida por una ``@``, como en ``"@/usr/contrib/bitmap/gumby.bit"``.

source: You can pass integers 0 or 1 or the strings ``"yes"`` or ``"no"``.
es: Se puede pasar enteros 0 o 1 o las cadenas ``"yes"`` or ``"no"``.

source: This is any Python function that takes no arguments. For example::
es: Esto es cualquier función de Python que no toma argumentos. Por ejemplo::

source: Colors can be given as the names of X colors in the rgb.txt file, or as strings representing RGB values in 4 bit: ``"#RGB"``, 8 bit: ``"#RRGGBB"``, 12 bit" ``"#RRRGGGBBB"``, or 16 bit ``"#RRRRGGGGBBBB"`` ranges, where R,G,B here represent any legal hex digit. See page 160 of Ousterhout's book for details.
es: Los colores se pueden dar como nombres de colores de X en el archivo rgb.txt, o como cadenas que representan valores RGB. La cadena que representa el valor RGB que toma un rango de 4 bits:``"#RGB"``, 8 bits: ``"#RRGGBB"``, 12 bits" ``"#RRRGGGBBB"``, or 16 bits ``"#RRRRGGGGBBBB"``, donde R, G, B aquí representan cualquier dígito hexadecimal legal. Consulte la página 160 del libro de Ousterhout para más detalles.

source: The standard X cursor names from :file:`cursorfont.h` can be used, without the ``XC_`` prefix. For example to get a hand cursor (:const:`XC_hand2`), use the string ``"hand2"``. You can also specify a bitmap and mask file of your own. See page 179 of Ousterhout's book.
es: Los nombres estándar del cursor X de :file:`cursorfont.h` se pueden usar sin el prefijo ``XC_``. Por ejemplo, para obtener un cursor de mano (:const:`XC_hand2`), use la cadena ``"hand2"``. También se puede especificar su propio mapa de bits y archivo de máscara. Ver página 179 del libro de Ousterhout.

source: Screen distances can be specified in either pixels or absolute distances. Pixels are given as numbers and absolute distances as strings, with the trailing character denoting units: ``c`` for centimetres, ``i`` for inches, ``m`` for millimetres, ``p`` for printer's points. For example, 3.5 inches is expressed as ``"3.5i"``.
es: Las distancias de pantalla se pueden especificar tanto en píxeles como en distancias absolutas. Los píxeles se dan como números y las distancias absolutas como cadenas con el carácter final que indica unidades: ``c`` para centímetros, ``i`` para pulgadas, ``m`` para milímetros, ``p`` para puntos de impresora. Por ejemplo, 3.5 pulgadas se expresa como ``"3.5i"``.

source: Tk uses a list font name format, such as ``{courier 10 bold}``. Font sizes with positive numbers are measured in points; sizes with negative numbers are measured in pixels.
es: Tk usa un formato de lista para los nombres de fuentes, como ``{courier 10 bold}``. Los tamaños de fuente expresados en números positivos se miden en puntos, mientras que los tamaños con números negativos se miden en píxeles.

source: This is a string of the form ``widthxheight``, where width and height are measured in pixels for most widgets (in characters for widgets displaying text). For example: ``fred["geometry"] = "200x100"``.
es: Es una cadena de caracteres del estilo ``widthxheight``, donde el ancho y la altura se miden en píxeles para la mayoría de los widgets (en caracteres para widgets que muestran texto). Por ejemplo: ``fred["geometry"] = "200x100"``.

source: Legal values are the strings: ``"left"``, ``"center"``, ``"right"``, and ``"fill"``.
es: Los valores legales son las cadenas de caracteres: ``"left"``, ``"center"``, ``"right"``, y ``"fill"``.

source: This is a string with four space-delimited elements, each of which is a legal distance (see above). For example: ``"2 3 4 5"`` and ``"3i 2i 4.5i 2i"`` and ``"3c 2c 4c 10.43c"`` are all legal regions.
es: Es una cadena de caracteres con cuatro elementos delimitados por espacios, cada uno de ellos es una distancia legal (ver arriba). Por ejemplo: ``"2 3 4 5"`` , ``"3i 2i 4.5i 2i"`` y ``"3c 2c 4c 10.43c"`` son todas regiones legales.

source: Determines what the border style of a widget will be. Legal values are: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, and ``"ridge"``.
es: Determina cuál será el estilo de borde de un widget. Los valores legales son: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, y ``"ridge"``.

source: This is almost always the :meth:`!set` method of some scrollbar widget, but can be any widget method that takes a single argument.
es: Este es casi siempre el método :meth:`!set` de algún widget de barra de desplazamiento, pero puede ser cualquier método de un widget que tome un solo argumento.

source: Must be one of: ``"none"``, ``"char"``, or ``"word"``.
es: Debe ser uno de estos: ``"none"``, ``"char"``, o ``"word"``.

source: Bindings and Events
es: Enlaces y eventos

source: The bind method from the widget command allows you to watch for certain events and to have a callback function trigger when that event type occurs. The form of the bind method is::
es: El método de enlace (*binding*) del comando del widget le permite observar ciertos eventos y hacer que la función de devolución de llamada se active cuando se produce ese tipo de evento. La forma del método de enlace es::

source: where:
es: donde:

source: is a string that denotes the target kind of event. (See the bind man page and page 201 of John Ousterhout's book for details).
es: es una cadena que denota el tipo de evento objetivo. Para obtener más información, consulte la página del manual de Bind y la página 201 del libro de John Ousterhout.

source: is a Python function, taking one argument, to be invoked when the event occurs. An Event instance will be passed as the argument. (Functions deployed this way are commonly known as *callbacks*.)
es: es una función de Python que toma un argumento y se llama cuando ocurre el evento. La instancia del evento se pasa como el argumento mencionado. (Las funciones implementadas de esta manera a menudo se llaman *callbacks*.)

source: is optional, either ``''`` or ``'+'``. Passing an empty string denotes that this binding is to replace any other bindings that this event is associated with. Passing a ``'+'`` means that this function is to be added to the list of functions bound to this event type.
es: es opcional, ya sea ``''`` o ``'+'``. Pasar una cadena de caracteres vacía indica que este enlace anulará cualquier otro enlace asociado con este evento. Pasar ``'+'`` agrega esta función a la lista de funciones vinculadas a este tipo de evento.

source: Notice how the widget field of the event is being accessed in the ``turn_red()`` callback. This field contains the widget that caught the X event. The following table lists the other event fields you can access, and how they are denoted in Tk, which can be useful when referring to the Tk man pages.
es: Observe cómo se accede al campo del widget del evento en la devolución de llamada ``turn_red()``. Este campo contiene el widget que capturó el evento de X. La siguiente tabla enumera los otros campos de eventos a los que puede acceder y cómo se indican en Tk, lo que puede ser útil cuando se hace referencia a las páginas del manual de Tk.

source: Tkinter Event Field
es: Campo evento de Tkinter

source: The index Parameter
es: El parámetro índice

source: A number of widgets require "index" parameters to be passed. These are used to point at a specific place in a Text widget, or to particular characters in an Entry widget, or to particular menu items in a Menu widget.
es: Muchos widgets requieren que se pase un parámetro de tipo índice. Esto se utiliza para señalar ubicaciones específicas en el widget de texto, caracteres específicos en el widget de entrada, o elementos particulares en el widget de menú.

source: Entry widget indexes (index, view index, etc.)
es: Índice de widget de entrada (índice, índice de vista, etc.)

source: Entry widgets have options that refer to character positions in the text being displayed. You can use these :mod:`tkinter` functions to access these special points in text widgets:
es: El widget entrada tiene una opción para referirse a la posición de los caracteres del texto que se muestra. Puede acceder a estos puntos especiales en un widget de texto utilizando la siguiente función de :mod:`tkinter`:

source: Text widget indexes
es: Índice de widget de texto

source: The index notation for Text widgets is very rich and is best described in the Tk man pages.
es: La notación de índice del widget de texto es muy rica y se detalla mejor en las páginas del manual de Tk.

source: Menu indexes (menu.invoke(), menu.entryconfig(), etc.)
es: Índices de menú (*menu.invoke()*, *menu.entryconfig()*, etc.)

source: Some options and methods for menus manipulate specific menu entries. Anytime a menu index is needed for an option or a parameter, you may pass in:
es: Algunas opciones y métodos para menús manipulan entradas de menú específicas. Cada vez que se necesita un índice de menú para una opción o un parámetro, se puede pasar:

source: an integer which refers to the numeric position of the entry in the widget, counted from the top, starting with 0;
es: un número entero que se refiere a la posición numérica de la entrada en el widget, contada desde arriba, comenzando con 0;

source: the string ``"active"``, which refers to the menu position that is currently under the cursor;
es: la cadena ``"active"``, que se refiere a la posición del menú que está actualmente debajo del cursor;

source: the string ``"last"`` which refers to the last menu item;
es: la cadena de caracteres ``"last"`` que se refiere al último elemento del menú;

source: An integer preceded by ``@``, as in ``@6``, where the integer is interpreted as a y pixel coordinate in the menu's coordinate system;
es: Un número entero precedido por ``@``, como en ``@6``, donde el entero es interpretado como una coordenada *y* de píxeles en el sistema de coordenadas del menú;

source: the string ``"none"``, which indicates no menu entry at all, most often used with menu.activate() to deactivate all entries, and finally,
es: la cadena de caracteres ``"none"``, que indica que no hay entrada de menú, usado frecuentemente con *menu.activate()* para desactivar todas las entradas; y, finalmente,

source: a text string that is pattern matched against the label of the menu entry, as scanned from the top of the menu to the bottom. Note that this index type is considered after all the others, which means that matches for menu items labelled ``last``, ``active``, or ``none`` may be interpreted as the above literals, instead.
es: una cadena de texto cuyo patrón coincide con la etiqueta de la entrada del menú, tal como se explora desde la parte superior del menú hasta la parte inferior. Tenga en cuenta que este tipo de índice se considera después de todos los demás, lo que significa que las coincidencias para los elementos del menú etiquetados ``last``, ``active``, o ``none`` pueden interpretarse de hecho como los literales anteriores.

source: Images
es: Imágenes

source: Images of different formats can be created through the corresponding subclass of :class:`tkinter.Image`:
es: Se pueden crear imágenes de diferentes formatos a través de la correspondiente subclase de :class:`tkinter.Image`:

source: :class:`BitmapImage` for images in XBM format.
es: :class:`BitmapImage` para imágenes en formato XBM.

source: :class:`PhotoImage` for images in PGM, PPM, GIF and PNG formats. The latter is supported starting with Tk 8.6.
es: :class:`PhotoImage` para imágenes en formatos PGM, PPM, GIF y PNG. Este último es compatible a partir de Tk 8.6.

source: Either type of image is created through either the ``file`` or the ``data`` option (other options are available as well).
es: Cualquier tipo de imagen se crea a través de la opción ``file`` o ``data`` (también hay otras opciones disponibles).

source: The image object can then be used wherever an ``image`` option is supported by some widget (e.g. labels, buttons, menus). In these cases, Tk will not keep a reference to the image. When the last Python reference to the image object is deleted, the image data is deleted as well, and Tk will display an empty box wherever the image was used.
es: El objeto imagen se puede usar siempre que algún widget admita una opción de ``image`` (por ejemplo, etiquetas, botones, menús). En estos casos, Tk no mantendrá una referencia a la imagen. Cuando se elimina la última referencia de Python al objeto de imagen, los datos de la imagen también se eliminan, y Tk mostrará un cuadro vacío donde se utilizó la imagen.

source: The `Pillow <http://python-pillow.org/>`_ package adds support for formats such as BMP, JPEG, TIFF, and WebP, among others.
es: El paquete `Pillow <http://python-pillow.org/>`_ añade soporte para los formatos del tipo BMP, JPEG, TIFF, y WebP, entre otros.

source: File Handlers
es: Gestor de archivos

source: Tk allows you to register and unregister a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. Only one handler may be registered per file descriptor. Example code::
es: Tk permite registrar y anular el registro de una función de devolución de llamada que se llamará desde el mainloop de Tk cuando la E/S sea posible en un descriptor de archivo. Solo se puede registrar un controlador por descriptor de archivo. Código de ejemplo:

source: This feature is not available on Windows.
es: Esta función no está disponible en Windows.

source: Since you don't know how many bytes are available for reading, you may not want to use the :class:`~io.BufferedIOBase` or :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` or :meth:`~io.IOBase.readline` methods, since these will insist on reading a predefined number of bytes. For sockets, the :meth:`~socket.socket.recv` or :meth:`~socket.socket.recvfrom` methods will work fine; for other files, use raw reads or ``os.read(file.fileno(), maxbytecount)``.
es: Dado que no se sabe cuántos bytes están disponibles para su lectura, no use métodos de :class:`~io.BufferedIOBase` o :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` o :meth:`~io.IOBase.readline`, ya que estos requieren leer un número predefinido de bytes. Para *sockets*, los métodos :meth:`~socket.socket.recv` o :meth:`~socket.socket.recvfrom` trabajan bien; para otros archivos, use lectura sin formato o ``os.read(file.fileno(), maxbytecount)``.

source: Registers the file handler callback function *func*. The *file* argument may either be an object with a :meth:`~io.IOBase.fileno` method (such as a file or socket object), or an integer file descriptor. The *mask* argument is an ORed combination of any of the three constants below. The callback is called as follows::
es: Registra la función *callback* gestor de archivos *func*. El argumento *file* puede ser un objeto con un método :meth:`~ io.IOBase.fileno` (como un archivo u objeto de socket), o un descriptor de archivo entero. El argumento *mask* es una combinación ORed de cualquiera de las tres constantes que siguen. La retrollamada se llama de la siguiente manera::

source: Unregisters a file handler.
es: Anula el registro de un gestor de archivos.

source: Constants used in the *mask* arguments.
es: Constantes utilizadas en los argumentos *mask*.
