Repository: python/python-docs-es
Catalog: library/tkinter.po
Languages: es

source: The commands used to create widgets (like ``ttk::frame``) correspond to widget classes in Tkinter.
es: Los comandos usados para crear widgets (tales como ``ttk::frame``) corresponden a las clases de widgets en Tkinter.

source: Tcl widget options (like ``-text``) correspond to keyword arguments in Tkinter.
es: Opciones de widget en Tcl (por ejemplo ``-text``) corresponden a argumentos clave en Tkinter.

source: Widgets are referred to by a *pathname* in Tcl (like ``.frm.btn``), whereas Tkinter doesn't use names but object references.
es: Los widgets son reverenciados con un *pathname* in Tcl (por ejemplo ``.frm.btn``) mientras que Tkinter no usa nombres sino que referencia a objetos.

source: A widget's place in the widget hierarchy is encoded in its (hierarchical) pathname, which uses a ``.`` (dot) as a path separator. The pathname for the root window is just ``.`` (dot). In Tkinter, the hierarchy is defined not by pathname but by specifying the parent widget when creating each child widget.
es: El lugar del widget en la jerarquía es codificada (jerárquicamente) en nombre de archivo, usando un ``.`` (punto) como separador de búsqueda. El nombre de ruta del archivo para la ventana raíz es un ``.`` (punto), la jerarquía no es definida por la ruta del archivo pero si por la especificación del widget padre cuando se crea cada widget hijo.

source: Operations which are implemented as separate *commands* in Tcl (like ``grid`` or ``destroy``) are represented as *methods* on Tkinter widget objects. As you'll see shortly, at other times Tcl uses what appear to be method calls on widget objects, which more closely mirror what would is used in Tkinter.
es: Las operaciones que se implementan como *commands* separados en Tcl (por ejemplo ``grid`` or ``destroy``) son representados como *methods* en objetos de widget de Tkinter. Como se verá en breve, en otras ocasiones, Tcl usa lo que parecen ser llamadas a métodos en objetos de widget, que reflejan más de cerca lo que se usa en Tkinter.

source: How do I...? What option does...?
es: ¿Cómo lo hago?, ¿Cómo funciona?

source: If you're not sure how to do something in Tkinter, and you can't immediately find it in the tutorial or reference documentation you're using, there are a few strategies that can be helpful.
es: Si no esta seguro sobre como realizar ciertas acciones en Tkinter y no se puede encontrar información de forma rápida en el tutorial o en la documentación de referencias que estas usando, aquí hay varias estrategias que pueden ser de mucha ayuda.

source: First, remember that the details of how individual widgets work may vary across different versions of both Tkinter and Tcl/Tk. If you're searching documentation, make sure it corresponds to the Python and Tcl/Tk versions installed on your system.
es: Primero, recordar que los detalles sobre como cada widget trabaja en las diferentes versiones de Tcl/Tk pueden variar según la versión. Si está buscando información, asegúrese de que corresponde a la versión tanto de Python como de Tcl/Tk instaladas en su sistema.

source: When searching for how to use an API, it helps to know the exact name of the class, option, or method that you're using. Introspection, either in an interactive Python shell or with :func:`print`, can help you identify what you need.
es: Cuando se busca sobre como usar una API, puede ser muy útil el saber exactamente el nombre de la clase, opción o método que está utilizando. Tener esto en cuenta de antemano, ya sea en un shell de Python interactivo o con: func: `print`, puede ayudar a identificar lo que necesitas.

source: To find out what configuration options are available on any widget, call its :meth:`configure` method, which returns a dictionary containing a variety of information about each object, including its default and current values. Use :meth:`keys` to get just the names of each option.
es: Para encontrar que opciones de configuración están disponibles en cada widget, se utiliza la llamada al método :meth:`configure`, el cual retorna un diccionario que contiene una gran variedad de información sobre cada objeto, incluyendo valores por defecto y actuales. Utilice el :meth:`keys` para saber los nombres de cada opción.

source: As most widgets have many configuration options in common, it can be useful to find out which are specific to a particular widget class. Comparing the list of options to that of a simpler widget, like a frame, is one way to do that.
es: La mayoría de los widgets tienen varias opciones de configuraciones en común, puede ser útil averiguar cuales son específicos de una clase de widget en particular. Comparando la lista de opciones de un widget sencillo como por ejemplo un *frame* es una de las formas de hacerlo.

source: Similarly, you can find the available methods for a widget object using the standard :func:`dir` function. If you try it, you'll see there are over 200 common widget methods, so again identifying those specific to a widget class is helpful.
es: De manera similar se pueden encontrar los métodos disponibles para un objeto de un widget utilizando la función standard :func:`dir`. Si lo intentas podrás ver alrededor de 200 métodos comunes para los widgets por lo que de nuevo, es muy importante identificar las especificaciones de un widget.

source: Navigating the Tcl/Tk Reference Manual
es: Navegando en el manual de referencia de Tcl/Tk

source: As noted, the official `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_ reference manual (man pages) is often the most accurate description of what specific operations on widgets do. Even when you know the name of the option or method that you need, you may still have a few places to look.
es: Como se ha señalado, el manual oficial de referencia de `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_ (en las páginas del manual) es a menudo la descripción mas precisa sobre que hacen las operaciones especificas de los widgets. Incluso sabiendo el nombre de la opción o método que necesitas, es posible que puedas encontrar información adicional.

source: While all operations in Tkinter are implemented as method calls on widget objects, you've seen that many Tcl/Tk operations appear as commands that take a widget pathname as its first parameter, followed by optional parameters, e.g.
es: Mientras todas las operaciones en Tkinter son implementadas como llamadas de método sobre objetos del widget, se puede ver cuantas operaciones de Tcl/Tk aparecen como comandos que toman el nombre de ruta del widget como el primer parámetro, seguido de parámetros opcionales, por ejemplo.

source: Others, however, look more like methods called on a widget object (in fact, when you create a widget in Tcl/Tk, it creates a Tcl command with the name of the widget pathname, with the first parameter to that command being the name of a method to call).
es: Otros, sin embargo, se parecen más a métodos llamados en un objeto del widget (de hecho, cuando se crea un widget en Tcl / Tk, este a su vez crea un comando Tcl con el nombre de la ruta del widget, siendo el primer parámetro de ese comando el nombre de un método para llamar).

source: In the official Tcl/Tk reference documentation, you'll find most operations that look like method calls on the man page for a specific widget (e.g., you'll find the :meth:`invoke` method on the `ttk::button <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_button.htm>`_ man page), while functions that take a widget as a parameter often have their own man page (e.g., `grid <https://www.tcl.tk/man/tcl8.6/TkCmd/grid.htm>`_).
es: En la documentación oficial de referencia para Tcl/Tk, se podrán encontrar mas operaciones que son similares a las llamadas a métodos de la pagina principal de un widget en especifico ( p.ej., se podrá encontrar el método :meth:`invoke` en la página principal de `ttk::button <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_button.htm>`_ ) mientras que las funciones que toman un widget como un parámetro a menudo tienen su propia página principal (p.ej., `grid <https://www.tcl.tk/man/tcl8.6/TkCmd/grid.htm>`_).

source: You'll find many common options and methods in the `options <https://www.tcl.tk/man/tcl8.6/TkCmd/options.htm>`_ or `ttk::widget <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_widget.htm>`_ man pages, while others are found in the man page for a specific widget class.
es: Se podrán encontrar varias opciones en común y metidos en las páginas del manual `options <https://www.tcl.tk/man/tcl8.6/TkCmd/options.htm>`_ o `ttk::widget <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_widget.htm>`_, mientras que otras opciones se encuentran en las páginas del manual de una clase de widget específica.

source: You'll also find that many Tkinter methods have compound names, e.g., :func:`winfo_x`, :func:`winfo_height`, :func:`winfo_viewable`. You'd find documentation for all of these in the `winfo <https://www.tcl.tk/man/tcl8.6/TkCmd/winfo.htm>`_ man page.
es: También se puede encontrar cuantos métodos de Tkinter poseen nombres compuestos, p.ej, :func:`winfo_x`, :func:`winfo_height`, :func:`winfo_viewable`. Usted también encuentra información para todo esto en las páginas del manual en winfo <https://www.tcl.tk/man/tcl8.6/TkCmd/winfo.htm>`_.

source: Somewhat confusingly, there are also methods on all Tkinter widgets that don't actually operate on the widget, but operate at a global scope, independent of any widget. Examples are methods for accessing the clipboard or the system bell. (They happen to be implemented as methods in the base :class:`Widget` class that all Tkinter widgets inherit from).
es: Puede ser algo confuso, pero también hay métodos en todos los widgets de Tkinter los cuales no operan directamente en el widget pero operan a nivel global, independiente del widget. Ejemplos de esto son los métodos para acceder al portapapeles o a llamados del sistema. (Ellos aparecen al ser implementados como métodos en la clase base :class:`Widget` clase que todos los widgets en Tkinter heredan).

source: Threading model
es: Modelo de subprocesamiento

source: Python and Tcl/Tk have very different threading models, which :mod:`tkinter` tries to bridge. If you use threads, you may need to be aware of this.
es: Python y Tcl/Tk tienen modelos de subprocesamiento muy diferentes, con lo cual el módulo :mod:`tkinter` intenta ser un puente entre ambos. Si usted usa hilos, es muy posible que deba ser consciente de esto.

source: A Python interpreter may have many threads associated with it. In Tcl, multiple threads can be created, but each thread has a separate Tcl interpreter instance associated with it. Threads can also create more than one interpreter instance, though each interpreter instance can be used only by the one thread that created it.
es: Un interprete de Python puede tener varios hilos asociados. En Tcl, diferentes hilos pueden ser creados, pero cada hilo tiene una instancia del interprete de Tcl asociada por separado. Los hilos también pueden crear mas de una instancia del interprete, aunque cada instancia del intérprete puede ser usada solo por el hilo que ha sido creado.

source: Each :class:`Tk` object created by :mod:`tkinter` contains a Tcl interpreter. It also keeps track of which thread created that interpreter. Calls to :mod:`tkinter` can be made from any Python thread. Internally, if a call comes from a thread other than the one that created the :class:`Tk` object, an event is posted to the interpreter's event queue, and when executed, the result is returned to the calling Python thread.
es: Cada objeto de la clase :class:`Tk`creado por :mod:`tkinter` contiene un interprete para TCL. Esto también mantiene un seguimiento de cada hilo creado por el interprete. Las llamadas al módulo :mod:`tkinter` se pueden realizar desde cualquier módulo de Python. De forma interna si una llamada proviene desde un hilo diferente al creado por objeto :class:`Tk`, un evento es publicado por la cola de eventos del interprete y cuando es ejecutado, el resultado es retornado al hilo de llamadas de Python.

source: Tcl/Tk applications are normally event-driven, meaning that after initialization, the interpreter runs an event loop (i.e. :func:`Tk.mainloop`) and responds to events. Because it is single-threaded, event handlers must respond quickly, otherwise they will block other events from being processed. To avoid this, any long-running computations should not run in an event handler, but are either broken into smaller pieces using timers, or run in another thread. This is different from many GUI toolkits where the GUI runs in a completely separate thread from all application code including event handlers.
es: Las aplicaciones de Tcl/Tk son normalmente basados en eventos, lo que significa que despues de la inicialización, el interprete corre un bucle de eventos (p.ej.:func:`Tk.mainloop`) que responde a los eventos. Al ser un evento de un solo proceso, los controladores responden rápidamente, en caso contrario ellos bloquearán el procesamiento de otros eventos. Para evitar esto, cualquier procesamiento de larga duración no deben ser procesados en el controlador de eventos, o en caso contrario ser separados en pequeñas piezas usando temporizadores o correr el proceso en otro hilo. Esto es diferente a muchos kits de herramientas de GUI donde GUI se ejecuta en un hilo completamente separado del código de la aplicación, incluido el controlador de eventos.

source: If the Tcl interpreter is not running the event loop and processing events, any :mod:`tkinter` calls made from threads other than the one running the Tcl interpreter will fail.
es: Si el intérprete de Tcl no se está ejecutando el bucle del evento o procesando eventos, cualquier llamada a :mod:`tkinter` realizada desde hilos distintos al que ejecuta el intérprete de Tcl, fallará.

source: A number of special cases exist:
es: Existen varios casos especiales:

source: Tcl/Tk libraries can be built so they are not thread-aware. In this case, :mod:`tkinter` calls the library from the originating Python thread, even if this is different than the thread that created the Tcl interpreter. A global lock ensures only one call occurs at a time.
es: Las librerías de Tcl/Tk pueden ser construidas para que no sean conscientes de los subprocesos. En este caso, el :mod:`tkinter` llama a la librería a partir del hilo originado desde Python, incluso si este es diferente al hilo creado en el intérprete de Tcl. Un cierre global asegura que solo ocurra una llamada a la vez.

source: While :mod:`tkinter` allows you to create more than one instance of a :class:`Tk` object (with its own interpreter), all interpreters that are part of the same thread share a common event queue, which gets ugly fast. In practice, don't create more than one instance of :class:`Tk` at a time. Otherwise, it's best to create them in separate threads and ensure you're running a thread-aware Tcl/Tk build.
es: Mientras el :mod:`tkinter` permite crear una o mas instancias del objeto de :class:`Tk` (con su propio intérprete), todos los interpretes son parte del mismo hilo compartido en la cola de eventos, lo cual se torna complicado rápidamente. En la practica, no se debe crear mas de una instancia de la clase :class:`Tk` a la vez. De lo contrario, es lo mejor crearlos en hilos separados y asegurarse de que se esta ejecutando un hilo compatible con los subprocesos.

source: Blocking event handlers are not the only way to prevent the Tcl interpreter from reentering the event loop. It is even possible to run multiple nested event loops or abandon the event loop entirely. If you're doing anything tricky when it comes to events or threads, be aware of these possibilities.
es: Bloquear los controladores de eventos no son la única manera de prevenir que el intérprete de Tcl reingrese al bucle de eventos. Es incluso posible ejecutar una cantidad de bucles de eventos anidados o abandonar el bucle de forma completa, Si está realizando alguna tarea complicada cuando se trata de eventos o hilos hay que tener en cuenta estas posibilidades.

source: There are a few select :mod:`tkinter` functions that presently work only when called from the thread that created the Tcl interpreter.
es: Hay algunas funciones select: mod: `tkinter` que ahora solo funcionan cuando se les llama desde el hilo que creó el intérprete Tcl.

source: Handy Reference
es: Guía práctica

source: Setting Options
es: Configuración de opciones

source: Options control things like the color and border width of a widget. Options can be set in three ways:
es: Las opciones controlan parámetros como el color y el ancho del borde de un widget. Las opciones se pueden configurar de tres maneras:

source: At object creation time, using keyword arguments
es: En el momento de la creación del objeto, utilizando argumentos de palabras clave

source: After object creation, treating the option name like a dictionary index
es: Después de la creación del objeto, tratando el nombre de la opción como un índice de diccionario

source: Use the config() method to update multiple attrs subsequent to object creation
es: Usando el método *config()* para actualizar múltiples atributos después de la creación del objeto

source: For a complete explanation of a given option and its behavior, see the Tk man pages for the widget in question.
es: Para obtener una explicación completa de las opciones y su comportamiento, consulte las páginas de manual de Tk para el widget en cuestión.

source: Note that the man pages list "STANDARD OPTIONS" and "WIDGET SPECIFIC OPTIONS" for each widget. The former is a list of options that are common to many widgets, the latter are the options that are idiosyncratic to that particular widget. The Standard Options are documented on the :manpage:`options(3)` man page.
es: Tenga en cuenta que las páginas del manual enumeran "OPCIONES ESTÁNDAR" y "OPCIONES ESPECÍFICAS DE WIDGET" para cada widget. La primera es una lista de opciones que son comunes a muchos widgets, la segunda son las opciones que son específicas para ese widget en particular. Las opciones estándar están documentadas en la página del manual :manpage:`options(3)`.

source: No distinction between standard and widget-specific options is made in this document. Some options don't apply to some kinds of widgets. Whether a given widget responds to a particular option depends on the class of the widget; buttons have a ``command`` option, labels do not.
es: No se hace distinción entre las opciones estándar y las opciones específicas del widget en este documento. Algunas opciones no se aplican a algunos tipos de widgets. Si un determinado widget responde a una opción particular depende de la clase del widget. Los botones tienen la opción ``command``, las etiquetas no.

source: The options supported by a given widget are listed in that widget's man page, or can be queried at runtime by calling the :meth:`config` method without arguments, or by calling the :meth:`keys` method on that widget. The return value of these calls is a dictionary whose key is the name of the option as a string (for example, ``'relief'``) and whose values are 5-tuples.
es: Las opciones admitidas por un widget dado se enumeran en la página de manual de ese widget, o se pueden consultar en tiempo de ejecución llamando al método :meth:`config` sin argumentos, o llamando al método :meth:`keys` en ese widget. El valor retornado en esas llamadas es un diccionario cuya clave es el nombre de la opción como una cadena (por ejemplo, ``'relief'``) y cuyo valor es una tupla de 5 elementos.

source: Some options, like ``bg`` are synonyms for common options with long names (``bg`` is shorthand for "background"). Passing the ``config()`` method the name of a shorthand option will return a 2-tuple, not 5-tuple. The 2-tuple passed back will contain the name of the synonym and the "real" option (such as ``('bg', 'background')``).
es: Algunas opciones, como ``bg``, son sinónimos de opciones comunes con nombres largos (``bg`` es la abreviatura de *"background"*). Al pasar el método ``config()``, el nombre de una opción abreviada retornará una tupla de 2 elementos (en lugar de 5). Esta tupla contiene nombres de sinónimos y nombres de opciones "reales" (como ``('bg', 'background')``).

source: Index
es: Índice

source: Meaning
es: Significado

source: Example
es: Ejemplo

source: option name
es: nombre de la opción

source: option name for database lookup
es: nombre de la opción para la búsqueda en la base de datos

source: option class for database lookup
es: clase de la opción para la consulta de base de datos

source: default value
es: valor por defecto

source: current value
es: valor actual

source: Example::
es: Ejemplo::

source: Of course, the dictionary printed will include all the options available and their values. This is meant only as an example.
es: Por supuesto, el diccionario impreso incluirá todas las opciones disponibles y sus valores. Esto es solo un ejemplo.

source: The Packer
es: El empaquetador

source: The packer is one of Tk's geometry-management mechanisms. Geometry managers are used to specify the relative positioning of widgets within their container - their mutual *master*. In contrast to the more cumbersome *placer* (which is used less commonly, and we do not cover here), the packer takes qualitative relationship specification - *above*, *to the left of*, *filling*, etc - and works everything out to determine the exact placement coordinates for you.
es: El empaquetador es uno de los mecanismos de gestión de geometría de Tk. Los administradores de geometría se utilizan para especificar la posición relativa de los widgets dentro de su contenedor: su *master* mutuo. En contraste con el *placer* más engorroso (que se usa con menos frecuencia, y no cubrimos aquí), el empaquetador toma la especificación de relación cualitativa - *above*, *to the left of*, *filling*, etc - y funciona todo para determinar las coordenadas de ubicación exactas para usted.

source: The size of any *master* widget is determined by the size of the "slave widgets" inside. The packer is used to control where slave widgets appear inside the master into which they are packed. You can pack widgets into frames, and frames into other frames, in order to achieve the kind of layout you desire. Additionally, the arrangement is dynamically adjusted to accommodate incremental changes to the configuration, once it is packed.
es: El tamaño de cualquier widget *master* está determinado por el tamaño del "widget esclavo" interno. El empaquetador se usa para controlar dónde se colocará el widget esclavo en el widget *maestro* de destino. Para lograr el diseño deseado, puede empaquetar el widget en un marco y luego empaquetar ese marco en otro. Además, una vez empaquetado, la disposición se ajusta dinámicamente de acuerdo con los cambios de configuración posteriores.

source: Note that widgets do not appear until they have had their geometry specified with a geometry manager. It's a common early mistake to leave out the geometry specification, and then be surprised when the widget is created but nothing appears. A widget will appear only after it has had, for example, the packer's :meth:`pack` method applied to it.
es: Tenga en cuenta que los widgets no aparecen hasta que su geometría no se haya especificado con un administrador de diseño de pantalla. Es un error común de principiante ignorar la especificación de la geometría, y luego sorprenderse cuando se crea el widget pero no aparece nada. Un objeto gráfico solo aparece después que, por ejemplo, se le haya aplicado el método :meth:`pack` del empaquetador.
