Repository: python/python-docs-es
Catalog: library/tkinter.font.po
Languages: es

source: :mod:`tkinter.font` --- Tkinter font wrapper
es: :mod:`tkinter.font` --- Envoltorio de fuente Tkinter

source: **Source code:** :source:`Lib/tkinter/font.py`
es: **Código fuente:** :source:`Lib/tkinter/font.py`

source: The :mod:`tkinter.font` module provides the :class:`Font` class for creating and using named fonts.
es: El módulo :mod:`tkinter.font` proporciona la clase :class:`Font` para crear y usar fuentes con nombre.

source: The different font weights and slants are:
es: Los diferentes pesos e inclinaciones de la fuente son:

source: The :class:`Font` class represents a named font. *Font* instances are given unique names and can be specified by their family, size, and style configuration. Named fonts are Tk's method of creating and identifying fonts as a single object, rather than specifying a font by its attributes with each occurrence.
es: La clase :class:`Font` representa una fuente con nombre. Las instancias *Font* reciben nombres únicos y se pueden especificar por su configuración de familia, tamaño y estilo. Las fuentes con nombre son el método de Tk para crear e identificar fuentes como un solo objeto, en lugar de especificar una fuente por sus atributos con cada aparición.

source: arguments:
es: argumentos:

source: *font* - font specifier tuple (family, size, options)
es: *font* - tupla de especificador de fuente (familia, tamaño, opciones)

source: *name* - unique font name
es: *name* - nombre de fuente único

source: *exists* - self points to existing named font if true
es: *exists* - self apunta a la fuente con nombre existente si es verdadera

source: additional keyword options (ignored if *font* is specified):
es: opciones de palabras clave adicionales (ignoradas si se especifica *font*):

source: *family* - font family i.e. Courier, Times
es: *family* - familia de la fuente, es decir, Courier, Times

source: *size* - font size
es: *size* - tamaño de fuente

source: If *size* is positive it is interpreted as size in points.
es: Si *size* es positivo, se interpreta como tamaño en puntos.

source: If *size* is a negative number its absolute value is treated
es: Si *size* es un número negativo, se trata su valor absoluto

source: as size in pixels.
es: como tamaño en píxeles.

source: *weight* - font emphasis (NORMAL, BOLD)
es: *weight* - énfasis de fuente (NORMAL, BOLD)

source: *underline* - font underlining (0 - none, 1 - underline)
es: *underline* - subrayado de fuente (0 - ninguno, 1 - subrayado)

source: *overstrike* - font strikeout (0 - none, 1 - strikeout)
es: *overstrike* - tachado de fuente (0 - ninguno, 1 - tachado)

source: Return the attributes of the font.
es: Retorna los atributos de la fuente.

source: Retrieve an attribute of the font.
es: Recupera un atributo de la fuente.

source: Modify attributes of the font.
es: Modifica los atributos de la fuente.

source: Return new instance of the current font.
es: Retorna una nueva instancia de la fuente actual.

source: Return amount of space the text would occupy on the specified display when formatted in the current font. If no display is specified then the main application window is assumed.
es: Retorna la cantidad de espacio que ocuparía el texto en la pantalla especificada cuando se formatee en la fuente actual. Si no se especifica ninguna pantalla, se asume la ventana principal de la aplicación.

source: Return font-specific data. Options include:
es: Retorna datos específicos de la fuente. Las opciones incluyen:

source: *ascent* - distance between baseline and highest point that a
es: *ascent* - distancia entre la línea de base y el punto más alto que un

source: character of the font can occupy
es: el carácter de la fuente puede ocupar

source: *descent* - distance between baseline and lowest point that a
es: *descent* - distancia entre la línea de base y el punto más bajo que un

source: *linespace* - minimum vertical separation necessary between any two
es: *linespace* - separación vertical mínima necesaria entre dos

source: characters of the font that ensures no vertical overlap between lines.
es: caracteres de la fuente que aseguran que no haya superposición vertical entre líneas.

source: *fixed* - 1 if font is fixed-width else 0
es: *fixed* - 1 si la fuente es de ancho fijo en caso contrario 0

source: Return the different font families.
es: Retorna las diferentes familias de fuentes.

source: Return the names of defined fonts.
es: Retorna los nombres de las fuentes definidas.

source: Return a :class:`Font` representation of a tk named font.
es: Retorna una representación :class:`Font` de una fuente con nombre tk.

source: The *root* parameter was added.
es: Se agregó el parámetro *root*.
