Repository: python/python-docs-es
Catalog: library/traceback.po
Languages: es_es

source: :mod:`traceback` --- Print or retrieve a stack traceback
es_es: :mod:`traceback` --- Imprimir o recuperar un seguimiento de pila

source: **Source code:** :source:`Lib/traceback.py`
es_es: **Código fuente:** :source:`Lib/traceback.py`

source: This module provides a standard interface to extract, format and print stack traces of Python programs. It exactly mimics the behavior of the Python interpreter when it prints a stack trace. This is useful when you want to print stack traces under program control, such as in a "wrapper" around the interpreter.
es_es: Este módulo brinda una interfaz estándar para extraer, formatear y mostrar trazas de pilas de programas de Python. Dicho módulo copia el comportamiento del intérprete de Python cuando muestra una traza de pila. Es útil a la hora de querer mostrar trazas de pilas bajo el control del programa, como si de un *wrapper* alrededor del intérprete se tratara.

source: The module uses traceback objects --- these are objects of type :class:`types.TracebackType`, which are assigned to the ``__traceback__`` field of :class:`BaseException` instances.
es_es: El módulo usa objetos *traceback* -- estos son objetos de tipo :class:`types.TracebackType`, que se asignan al campo ``__traceback__`` de las instancias de :class:`BaseException`.

source: Module :mod:`faulthandler`
es_es: Módulo :mod:`faulthandler`

source: Used to dump Python tracebacks explicitly, on a fault, after a timeout, or on a user signal.
es_es: Usado para volcar explícitamente los rastreos Python, en un error, después de un tiempo de espera (*timeout*), o en una señal de usuario.

source: Module :mod:`pdb`
es_es: Módulo :mod:`pdb`

source: Interactive source code debugger for Python programs.
es_es: Depurador interactivo de código fuente para programas Python.

source: The module defines the following functions:
es_es: El módulo define las siguientes funciones:

source: Print up to *limit* stack trace entries from traceback object *tb* (starting from the caller's frame) if *limit* is positive. Otherwise, print the last ``abs(limit)`` entries. If *limit* is omitted or ``None``, all entries are printed. If *file* is omitted or ``None``, the output goes to ``sys.stderr``; otherwise it should be an open file or file-like object to receive the output.
es_es: Muestra hasta *limit* entradas de trazas de pila desde el objeto *traceback* *tb* (empezando desde el marco de la llamada) si *limit* es positivo. De lo contrario, muestra las últimas ``abs(limit)`` entradas. Si *limit* es omitido o ``None``, todas las entradas se muestran. Si *file* es omitido o ``None``, la salida va a ``sys.stderr``; de lo contrario, debería ser un archivo o un objeto de tipo similar a un archivo para recibir la salida.

source: Added negative *limit* support.
es_es: Soporte para *limit* negativo añadido.

source: Print exception information and stack trace entries from traceback object *tb* to *file*. This differs from :func:`print_tb` in the following ways:
es_es: Muestra información de excepciones y entradas de trazas de pila desde el objeto *traceback* *tb* a *file*. Esto difiere de :func:`print_tb` de las siguientes maneras:

source: if *tb* is not ``None``, it prints a header ``Traceback (most recent call last):``
es_es: si *tb* no es ``None``, muestra una cabecera ``Traceback (most recent call last):``

source: it prints the exception type and *value* after the stack trace
es_es: imprime el tipo de excepción y *value* después del seguimiento de la pila

source: if *type(value)* is :exc:`SyntaxError` and *value* has the appropriate format, it prints the line where the syntax error occurred with a caret indicating the approximate position of the error.
es_es: si *type(value)* es :exc:`SyntaxError` y *value* tiene el formato apropiado, muestra la línea donde el error sintáctico ha ocurrido con un cursor indicando la posición aproximada del error.

source: Since Python 3.10, instead of passing *value* and *tb*, an exception object can be passed as the first argument. If *value* and *tb* are provided, the first argument is ignored in order to provide backwards compatibility.
es_es: Desde Python 3.10, en lugar de pasar *value* y *tb*, se puede pasar un objeto de excepción como primer argumento. Si se proporcionan *value* y *tb*, el primer argumento se ignora para proporcionar compatibilidad con versiones anteriores.

source: The optional *limit* argument has the same meaning as for :func:`print_tb`. If *chain* is true (the default), then chained exceptions (the :attr:`__cause__` or :attr:`__context__` attributes of the exception) will be printed as well, like the interpreter itself does when printing an unhandled exception.
es_es: El argumento opcional *limit* tiene el mismo significado que para :func:`print_tb`. Si *chain* es verdad (por defecto), entonces excepciones encadenadas (:attr:`__cause__` o :attr:`__context__` atributos de la excepción) también se imprimirán, como lo hace el propio intérprete al imprimir una excepción no controlada.

source: The *etype* argument is ignored and inferred from the type of *value*.
es_es: El argumento *etype* es ignorado e infiere desde el tipo de *value*.

source: The *etype* parameter has been renamed to *exc* and is now positional-only.
es_es: El parámetro *etype* ha cambiado de nombre a *exc* y ahora es solo posicional.

source: This is a shorthand for ``print_exception(sys.exception(), limit, file, chain)``.
es_es: Esto es un atajo para ``print_exception(sys.exception(), limit, file, chain)``.

source: This is a shorthand for ``print_exception(sys.last_exc, limit, file, chain)``. In general it will work only after an exception has reached an interactive prompt (see :data:`sys.last_exc`).
es_es: Esto es un atajo para ``print_exception(sys.last_exc, limit, file, chain)``. En general, solo funciona después de que una excepción ha alcanzado un prompt interactivo (ver :data:`sys.last_exc`).

source: Print up to *limit* stack trace entries (starting from the invocation point) if *limit* is positive. Otherwise, print the last ``abs(limit)`` entries. If *limit* is omitted or ``None``, all entries are printed. The optional *f* argument can be used to specify an alternate stack frame to start. The optional *file* argument has the same meaning as for :func:`print_tb`.
es_es: Muestra hasta *limit* entradas de trazas de pila (empezando desde el punto de invocación) si *limit* es positivo. De lo contrario, muestra las últimas ``abs(limit)`` entradas. Si *limit* es omitido o ``None``, todas las entradas se muestran. El argumento opcional *f* puede ser usado para especificar un marco de pila alternativo para empezar. El argumento opcional *file* tiene el mismo significado que para :func:`print_tb`.

source: Return a :class:`StackSummary` object representing a list of "pre-processed" stack trace entries extracted from the traceback object *tb*. It is useful for alternate formatting of stack traces. The optional *limit* argument has the same meaning as for :func:`print_tb`. A "pre-processed" stack trace entry is a :class:`FrameSummary` object containing attributes :attr:`~FrameSummary.filename`, :attr:`~FrameSummary.lineno`, :attr:`~FrameSummary.name`, and :attr:`~FrameSummary.line` representing the information that is usually printed for a stack trace. The :attr:`~FrameSummary.line` is a string with leading and trailing whitespace stripped; if the source is not available it is ``None``.
es_es: Retorna un objeto :class:`StackSummary` representando una lista de entradas de trazas de pila "pre-procesadas" extraídas del objeto *traceback* *tb*. Esto es útil para el formateo alternativo de trazas de pila. El argumento opcional *limit* tiene el mismo significado que para :func:`print_tb`. Una entrada de traza de pila "pre-procesada" es un objeto :class:`FrameSummary` que contiene los atributos :attr:`~FrameSummary.filename`, :attr:`~FrameSummary.lineno`, :attr:`~FrameSummary.name`, y :attr:`~FrameSummary.line` representando la información que normalmente es mostrada por una traza de pila. El atributo :attr:`~FrameSummary.line` es una cadena con espacios en blanco iniciales y finales *stripped*; si la fuente no está disponible, es ``None``.

source: Extract the raw traceback from the current stack frame. The return value has the same format as for :func:`extract_tb`. The optional *f* and *limit* arguments have the same meaning as for :func:`print_stack`.
es_es: Extrae el seguimiento de pila crudo desde el marco de pila actual. El valor retornado tiene el mismo formato que para :func:`extract_tb`. Los argumentos opcionales *f* y *limit* tienen el mismo significado que para :func:`print_stack`.

source: Given a list of tuples or :class:`FrameSummary` objects as returned by :func:`extract_tb` or :func:`extract_stack`, return a list of strings ready for printing. Each string in the resulting list corresponds to the item with the same index in the argument list. Each string ends in a newline; the strings may contain internal newlines as well, for those items whose source text line is not ``None``.
es_es: Dada una lista de tuplas u objetos :class:`FrameSummary` según lo retornado por :func:`extract_tb` o :func:`extract_stack`, retorna una lista de cadenas preparadas para ser mostradas. Cada cadena en la lista resultante corresponde con el elemento con el mismo índice en la lista de argumentos. Cada cadena finaliza en una nueva línea; las cadenas pueden contener nuevas líneas internas también, para aquellos elementos cuya línea de texto de origen no es ``None``.

source: Format the exception part of a traceback using an exception value such as given by ``sys.last_value``. The return value is a list of strings, each ending in a newline. The list contains the exception's message, which is normally a single string; however, for :exc:`SyntaxError` exceptions, it contains several lines that (when printed) display detailed information about where the syntax error occurred. Following the message, the list contains the exception's :attr:`notes <BaseException.__notes__>`.
es_es: Formatee la parte de excepción de un rastreo utilizando un valor de excepción como el proporcionado por ``sys.last_value``. El valor de retorno es una lista de cadenas, cada una termina en una nueva línea. Normalmente, la lista contiene una sola cadena; sin embargo, para las excepciones :exc:`SyntaxError`, contiene varias líneas que (cuando se imprimen) muestran información detallada sobre dónde ocurrió el error de sintaxis. Después del mensaje, la lista contiene las :attr:`notas <BaseException.__notes__>` de las excepciones.

source: Since Python 3.10, instead of passing *value*, an exception object can be passed as the first argument. If *value* is provided, the first argument is ignored in order to provide backwards compatibility.
es_es: Desde Python 3,10, en lugar de pasar *value*, un objeto de excepción se puede pasar como primer argumento. Si se proporciona *value*, el primer argumento se ignora el fin de proporcionar compatibilidad hacia atrás.

source: The returned list now includes any notes attached to the exception.
es_es: La lista retornada ahora incluye algunas notas adjuntadas a la excepción.

source: Format a stack trace and the exception information. The arguments have the same meaning as the corresponding arguments to :func:`print_exception`. The return value is a list of strings, each ending in a newline and some containing internal newlines. When these lines are concatenated and printed, exactly the same text is printed as does :func:`print_exception`.
es_es: Formatea una traza de pila y la información de la excepción. Los argumentos tienen el mismo significado que los argumentos correspondientes a :func:`print_exception`. El valor retornado es una lista de cadenas, acabando cada una en una nueva línea y algunas contienen nuevas líneas internas. Cuando estas líneas son concatenadas y mostradas, exactamente el mismo texto es mostrado como hace :func:`print_exception`.

source: This function's behavior and signature were modified to match :func:`print_exception`.
es_es: El comportamiento y la firma de esta función se modificaron para coincidir con :func:`print_exception`.

source: This is like ``print_exc(limit)`` but returns a string instead of printing to a file.
es_es: Esto es como ``print_exc(limit)`` pero retorna una cadena en lugar de imprimirlo en un archivo.

source: A shorthand for ``format_list(extract_tb(tb, limit))``.
es_es: Un atajo para ``format_list(extract_tb(tb, limit))``.

source: A shorthand for ``format_list(extract_stack(f, limit))``.
es_es: Un atajo para ``format_list(extract_stack(f, limit))``.

source: Clears the local variables of all the stack frames in a traceback *tb* by calling the :meth:`clear` method of each frame object.
es_es: Limpia las variables locales de todos los marcos de pila en un seguimiento de pila *tb* llamando al método :meth:`clear` de cada objeto de marco.

source: Walk a stack following ``f.f_back`` from the given frame, yielding the frame and line number for each frame. If *f* is ``None``, the current stack is used. This helper is used with :meth:`StackSummary.extract`.
es_es: Recorre una pila siguiendo ``f.f_back`` desde el marco dado, produciendo el marco y el número de línea de cada marco. Si *f* es ``None``, la pila actual es usada. Este auxiliar es usado con :meth:`StackSummary.extract`.

source: Walk a traceback following ``tb_next`` yielding the frame and line number for each frame. This helper is used with :meth:`StackSummary.extract`.
es_es: Recorre un seguimiento de pila siguiendo ``tb_next`` produciendo el marco y el número de línea de cada marco. Este auxiliar es usado con :meth:`StackSummary.extract`.

source: The module also defines the following classes:
es_es: El módulo también define las siguientes clases:

source: :class:`TracebackException` Objects
es_es: Objetos :class:`TracebackException`

source: :class:`TracebackException` objects are created from actual exceptions to capture data for later printing in a lightweight fashion.
es_es: Los objetos :class:`TracebackException` son creados a partir de excepciones reales para capturar datos para su posterior impresión de una manera ligera.

source: Capture an exception for later rendering. *limit*, *lookup_lines* and *capture_locals* are as for the :class:`StackSummary` class.
es_es: Captura una excepción para su posterior procesado. *limit*, *lookup_lines* y *capture_locals* son como para la clase :class:`StackSummary`.

source: If *compact* is true, only data that is required by :class:`TracebackException`'s ``format`` method is saved in the class attributes. In particular, the ``__context__`` field is calculated only if ``__cause__`` is ``None`` and ``__suppress_context__`` is false.
es_es: Si *compact* es verdadero, solo los datos requeridos por el método ``format`` de :class:`TracebackException` se guardan en los atributos de clase. En particular, el campo ``__context__`` se calcula solo si ``__cause__`` es ``None`` y ``__suppress_context__`` es falso.

source: Note that when locals are captured, they are also shown in the traceback.
es_es: Tenga en cuenta que cuando se capturan locales, también se muestran en el rastreo.

source: *max_group_width* and *max_group_depth* control the formatting of exception groups (see :exc:`BaseExceptionGroup`). The depth refers to the nesting level of the group, and the width refers to the size of a single exception group's exceptions array. The formatted output is truncated when either limit is exceeded.
es_es: *max_group_width* (*anchura máxima del grupo*) y *max_group_depth* (*profundidad máxima del grupo*) controlan el formato del grupo de excepciones (ver :exc:`BaseExceptionGroup`). La profundidad (*depth*) se refiere al nivel de anidamiento del grupo, y la anchura (*width*) se refiere al tamaño de una excepción simple perteneciente al arreglo del grupo de excepciones. El formato de salida se trunca cuando se excede el límite.

source: Added the *compact* parameter.
es_es: Se agregó el parámetro *compact*.

source: Added the *max_group_width* and *max_group_depth* parameters.
es_es: Se agregaron los parámetros *max_group_width* y *max_group_depth*

source: A :class:`TracebackException` of the original ``__cause__``.
es_es: Una clase :class:`TracebackException` del original ``__cause__``.

source: A :class:`TracebackException` of the original ``__context__``.
es_es: Una clase :class:`TracebackException` del original ``__context__``.

source: If ``self`` represents an :exc:`ExceptionGroup`, this field holds a list of :class:`TracebackException` instances representing the nested exceptions. Otherwise it is ``None``.
es_es: Si ``self`` representa a una :exc:`ExceptionGroup`, este campo mantiene una lista de instancias de :class:`TracebackException` representando las excepciones anidadas. En otro caso será ``None``.

source: The ``__suppress_context__`` value from the original exception.
es_es: El valor ``__suppress_context__`` de la excepción original.

source: The ``__notes__`` value from the original exception, or ``None`` if the exception does not have any notes. If it is not ``None`` is it formatted in the traceback after the exception string.
es_es: Los valores de las ``__notes__`` de la excepción original, o ``None`` si la excepción no tiene ninguna nota. Si no es ``None`` se formatea en el rastreo después de la cadena de texto de la excepción.

source: A :class:`StackSummary` representing the traceback.
es_es: Una clase :class:`StackSummary` representando el seguimiento de pila.

source: The class of the original traceback.
es_es: La clase del seguimiento de pila original.

source: For syntax errors - the file name where the error occurred.
es_es: Para errores sintácticos - el nombre del archivo donde el error ha ocurrido.

source: For syntax errors - the line number where the error occurred.
es_es: Para errores sintácticos - el número de línea donde el error ha ocurrido.

source: For syntax errors - the end line number where the error occurred. Can be ``None`` if not present.
es_es: Para errores sintácticos - el número de línea donde el error ha ocurrido. Puede ser ``None`` si no está presente.

source: For syntax errors - the text where the error occurred.
es_es: Para errores sintácticos - el texto donde el error ha ocurrido.

source: For syntax errors - the offset into the text where the error occurred.
es_es: Para errores sintácticos - el *offset* en el texto donde el error ha ocurrido.

source: For syntax errors - the end offset into the text where the error occurred. Can be ``None`` if not present.
es_es: Para errores sintácticos - el *offset* en el texto donde el error ha ocurrido. Puede ser ``None`` si no está presente.

source: For syntax errors - the compiler error message.
es_es: Para errores sintácticos - el mensaje de error del compilador.

source: Print to *file* (default ``sys.stderr``) the exception information returned by :meth:`format`.
es_es: Imprime en *file* (``sys.stderr`` por defecto) la información de la excepción retornada por :meth:`format`.

source: Format the exception.
es_es: Formatea la excepción.

source: If *chain* is not ``True``, ``__cause__`` and ``__context__`` will not be formatted.
es_es: Si *chain* no es ``True``, ``__cause__`` y ``__context__`` no serán formateados.

source: The return value is a generator of strings, each ending in a newline and some containing internal newlines. :func:`~traceback.print_exception` is a wrapper around this method which just prints the lines to a file.
es_es: El valor retornado es un generador de cadenas, donde cada una acaba en una nueva línea y algunas contienen nuevas líneas internas. :func:`~traceback.print_exception` es un contenedor alrededor de este método que simplemente muestra las líneas de un archivo.

source: Format the exception part of the traceback.
es_es: Formatea la parte de la excepción de un seguimiento de pila.

source: The return value is a generator of strings, each ending in a newline.
es_es: El valor retornado es un generador de cadenas, donde cada una acaba en una nueva línea.

source: The generator emits the exception's message followed by its notes (if it has any). The exception message is normally a single string; however, for :exc:`SyntaxError` exceptions, it consists of several lines that (when printed) display detailed information about where the syntax error occurred.
es_es: El generador emite el mensaje de la excepción seguida por sus notas (si tiene alguna). El mensaje de excepción es normalmente una sola cadena; , sin embargo, para excepciones :exc:`SyntaxError`, este emite múltiples líneas que (cuando son mostradas) imprimen información detallada sobre dónde ha ocurrido el error sintáctico.

source: The exception's notes are now included in the output.
es_es: Las notas de las excepciones son incluidas ahora en la salida.

source: :class:`StackSummary` Objects
es_es: Objetos :class:`StackSummary`

source: :class:`StackSummary` objects represent a call stack ready for formatting.
es_es: Los objetos :class:`StackSummary` representan una pila de llamadas lista para formatear.

source: Construct a :class:`StackSummary` object from a frame generator (such as is returned by :func:`~traceback.walk_stack` or :func:`~traceback.walk_tb`).
es_es: Construye un objeto :class:`StackSummary` desde un generador de marcos (tal como es retornado por :func:`~traceback.walk_stack` o :func:`~traceback.walk_tb`).

source: If *limit* is supplied, only this many frames are taken from *frame_gen*. If *lookup_lines* is ``False``, the returned :class:`FrameSummary` objects will not have read their lines in yet, making the cost of creating the :class:`StackSummary` cheaper (which may be valuable if it may not actually get formatted). If *capture_locals* is ``True`` the local variables in each :class:`FrameSummary` are captured as object representations.
es_es: Si *limit* es suministrado, solo esta cantidad de cuadros son tomados de *frame_gen*. Si *lookup_lines* es ``False``, los objeto :class:`FrameSummary` retornados aún no han leído sus líneas, lo que hace que el costo de crear :class:`StackSummary` será más barato (lo que puede ser valioso si no se formatea). Si *capture_locals* es ``True``, las variables locales en cada :class:`FrameSummary` son capturadas como representaciones de objetos.

source: Exceptions raised from :func:`repr` on a local variable (when *capture_locals* is ``True``) are no longer propagated to the caller.
es_es: Las excepciones lanzadas desde :func:`repr` en una variable local (cuando *capture_locals* es ``True``) no son propagadas al invocador.

source: Construct a :class:`StackSummary` object from a supplied list of :class:`FrameSummary` objects or old-style list of tuples. Each tuple should be a 4-tuple with filename, lineno, name, line as the elements.
es_es: Construye un objeto :class:`StackSummary` desde una lista suministrada de objetos :class:`FrameSummary` o una lista antigua de tuplas. Cada tupa debe ser una 4-tupla con nombre de archivo, número de líneas, nombre, línea como los elementos.

source: Returns a list of strings ready for printing. Each string in the resulting list corresponds to a single frame from the stack. Each string ends in a newline; the strings may contain internal newlines as well, for those items with source text lines.
es_es: Retorna una lista de cadenas lista para mostrarse. Cada cadena en la lista resultante corresponde a un único marco de la pila. Cada cadena termina en una nueva línea;las cadenas también pueden contener nuevas líneas internas, para aquellos elementos con líneas de texto fuente.
