Repository: python/python-docs-es
Catalog: library/traceback.po
Languages: es_es

source: For long sequences of the same frame and line, the first few repetitions are shown, followed by a summary line stating the exact number of further repetitions.
es_es: Para secuencias largas del mismo marco y línea, se muestran las primeras repeticiones, seguidas de una línea de resumen que indica el número exacto de repeticiones adicionales.

source: Long sequences of repeated frames are now abbreviated.
es_es: Las secuencias largas de cuadros repetidos ahora se abrevian.

source: Returns a string for printing one of the frames involved in the stack. This method is called for each :class:`FrameSummary` object to be printed by :meth:`StackSummary.format`. If it returns ``None``, the frame is omitted from the output.
es_es: Retorna una cadena de texto para imprimir uno de los marcos implicados en la pila. Este método lo llama cada objeto :class:`FrameSummary` para ser imprimido por :meth:`StackSummary.format`. Si retorna ``None``, se omite el marco del resultado.

source: :class:`FrameSummary` Objects
es_es: Objetos :class:`FrameSummary`

source: A :class:`FrameSummary` object represents a single frame in a traceback.
es_es: Los objetos :class:`FrameSummary` representan un único marco en el seguimiento de pila.

source: Represent a single frame in the traceback or stack that is being formatted or printed. It may optionally have a stringified version of the frames locals included in it. If *lookup_line* is ``False``, the source code is not looked up until the :class:`FrameSummary` has the :attr:`~FrameSummary.line` attribute accessed (which also happens when casting it to a tuple). :attr:`~FrameSummary.line` may be directly provided, and will prevent line lookups happening at all. *locals* is an optional local variable dictionary, and if supplied the variable representations are stored in the summary for later display.
es_es: Representa un único marco en el seguimiento de pila o pila que es formateado o mostrado. Opcionalmente, puede tener una versión en cadena de los marcos locales incluidos en él. Si *lookup_line* es ``False``, el código fuente no se busca hasta que :class:`FrameSummary` tenga el atributo :attr:`~FrameSummary.line` accedido (lo que también sucede cuando lo conviertes en una tupla). :attr:`~FrameSummary.line` puede proporcionarse directamente y evitará que se realicen búsquedas de línea. *locals* es un diccionario de variables locales opcional y, si se proporciona, las representaciones de variables se almacenan en el resumen para su posterior visualización.

source: Traceback Examples
es_es: Ejemplos de seguimiento de pila

source: This simple example implements a basic read-eval-print loop, similar to (but less useful than) the standard Python interactive interpreter loop. For a more complete implementation of the interpreter loop, refer to the :mod:`code` module. ::
es_es: Este ejemplo sencillo implementa un bucle de lectura, evaluación e impresión básico, similar a (pero menos útil) el bucle del intérprete interactivo estándar de Python. Para una implementación más completa del bucle del intérprete, ir al módulo :mod:`code` ::

source: The following example demonstrates the different ways to print and format the exception and traceback:
es_es: El siguiente ejemplo demuestra las diferentes manera para mostrar y formatear la excepción y el seguimiento de pila:

source: The output for the example would look similar to this:
es_es: La salida para el ejemplo podría ser similar a esto:

source: The following example shows the different ways to print and format the stack::
es_es: El siguiente ejemplo muestra las diferentes maneras de imprimir y formatear la pila::

source: This last example demonstrates the final few formatting functions:
es_es: Este último ejemplo demuestra las últimas funciones de formateo:
