Repository: python/python-docs-es
Catalog: library/trace.po
Languages: es

source: :mod:`trace` --- Trace or track Python statement execution
es: :mod:`trace` --- Rastrear la ejecución de la declaración de Python

source: **Source code:** :source:`Lib/trace.py`
es: **Código fuente:** :source:`Lib/trace.py`

source: The :mod:`trace` module allows you to trace program execution, generate annotated statement coverage listings, print caller/callee relationships and list functions executed during a program run. It can be used in another program or from the command line.
es: El módulo :mod:`trace` le permite rastrear la ejecución del programa, generar listas de cobertura de declaraciones anotadas, imprimir relaciones entre llamador/destinatario y listar funciones ejecutadas durante la ejecución de un programa. Se puede utilizar en otro programa o desde la línea de comandos.

source: A popular third-party coverage tool that provides HTML output along with advanced features such as branch coverage.
es: Una herramienta popular de terceros de cobertura que proporciona salida HTML junto con funciones avanzadas como cobertura de sucursales.

source: Command-Line Usage
es: Uso de la línea de comandos

source: The :mod:`trace` module can be invoked from the command line. It can be as simple as ::
es: El módulo :mod:`trace` se puede invocar desde la línea de comandos. Puede ser tan simple como ::

source: The above will execute :file:`somefile.py` and generate annotated listings of all Python modules imported during the execution into the current directory.
es: Lo anterior ejecutará :file:`somefile.py` y generará listados anotados de todos los módulos de Python importados durante la ejecución en el directorio actual.

source: Display usage and exit.
es: Muestra uso y sale.

source: Display the version of the module and exit.
es: Muestra la versión del módulo y sale.

source: Added ``--module`` option that allows to run an executable module.
es: Se agregó la opción ``--module`` que permite ejecutar un módulo ejecutable.

source: Main options
es: Opciones principales

source: At least one of the following options must be specified when invoking :mod:`trace`. The :option:`--listfuncs <-l>` option is mutually exclusive with the :option:`--trace <-t>` and :option:`--count <-c>` options. When :option:`--listfuncs <-l>` is provided, neither :option:`--count <-c>` nor :option:`--trace <-t>` are accepted, and vice versa.
es: Se debe especificar al menos una de las siguientes opciones al invocar :mod:`trace`. La opción :option:`--listfuncs <-l>` es mutuamente excluyente con las opciones :option:`--trace <-t>` y :option:`--count <-c>`. Cuando se proporciona :option:`--listfuncs <-l>`, no se aceptan :option:`--count <-c>` ni :option:`--trace <-t>`, y viceversa.

source: Produce a set of annotated listing files upon program completion that shows how many times each statement was executed. See also :option:`--coverdir <-C>`, :option:`--file <-f>` and :option:`--no-report <-R>` below.
es: Genera un conjunto de archivos de lista anotados al finalizar el programa que muestra cuántas veces se ejecutó cada instrucción. Vea también :option:`--coverdir <-C>`, :option:`--file <-f>` y :option:`--no-report <-R>` a continuación.

source: Display lines as they are executed.
es: Muestra las líneas a medida que se ejecutan.

source: Display the functions executed by running the program.
es: Muestra las funciones ejecutadas al ejecutar el programa.

source: Produce an annotated list from an earlier program run that used the :option:`--count <-c>` and :option:`--file <-f>` option. This does not execute any code.
es: Genera una lista anotada de una ejecución del programa anterior que utilizó la opción :option:`--count <-c>` y :option:`--file <-f>`. Esto no ejecuta ningún código.

source: Display the calling relationships exposed by running the program.
es: Muestra las relaciones de llamada expuestas al ejecutar el programa.

source: Modifiers
es: Modificadores

source: Name of a file to accumulate counts over several tracing runs. Should be used with the :option:`--count <-c>` option.
es: Nombre de un archivo para acumular recuentos durante varias ejecuciones de seguimiento. Debe usarse con la opción :option:`--count <-c>`.

source: Directory where the report files go. The coverage report for ``package.module`` is written to file :file:`{dir}/{package}/{module}.cover`.
es: Directorio donde van los archivos del informe. El informe de cobertura para ``paquete.modulo`` se escribe en el archivo :file:`{directorio}/{paquete}/{modulo}.cobertura`.

source: When generating annotated listings, mark lines which were not executed with ``>>>>>>``.
es: Al generar listados anotados, marque las líneas que no se ejecutaron con ``>>>>>>``.

source: When using :option:`--count <-c>` or :option:`--report <-r>`, write a brief summary to stdout for each file processed.
es: Cuando use :option:`--count <-c>` o :option:`--report <-r>`, escriba un breve resumen en stdout para cada archivo procesado.

source: Do not generate annotated listings. This is useful if you intend to make several runs with :option:`--count <-c>`, and then produce a single set of annotated listings at the end.
es: No genera listados anotados. Esto es útil si tiene la intención de realizar varias ejecuciones con :option:`--count <-c>`, y luego producir un solo conjunto de listados anotados al final.

source: Prefix each line with the time since the program started. Only used while tracing.
es: Prefija cada línea con la hora desde que se inició el programa. Solo se usa durante el rastreo.

source: Filters
es: Filtros

source: These options may be repeated multiple times.
es: Estas opciones pueden repetirse varias veces.

source: Ignore each of the given module names and its submodules (if it is a package). The argument can be a list of names separated by a comma.
es: Ignora cada uno de los nombres de módulo dados y sus submódulos (si es un paquete). El argumento puede ser una lista de nombres separados por una coma.

source: Ignore all modules and packages in the named directory and subdirectories. The argument can be a list of directories separated by :data:`os.pathsep`.
es: Ignora todos los módulos y paquetes en el directorio y subdirectorios nombrados. El argumento puede ser una lista de directorios separados por :data:`os.pathsep`.

source: Programmatic Interface
es: Interfaz programática

source: Create an object to trace execution of a single statement or expression. All parameters are optional. *count* enables counting of line numbers. *trace* enables line execution tracing. *countfuncs* enables listing of the functions called during the run. *countcallers* enables call relationship tracking. *ignoremods* is a list of modules or packages to ignore. *ignoredirs* is a list of directories whose modules or packages should be ignored. *infile* is the name of the file from which to read stored count information. *outfile* is the name of the file in which to write updated count information. *timing* enables a timestamp relative to when tracing was started to be displayed.
es: Crea un objeto para rastrear la ejecución de una sola declaración o expresión. Todos los parámetros son opcionales. *count* habilita el conteo de números de línea. *trace* habilita el seguimiento de ejecución de línea. *countfuncs* habilita la lista de las funciones llamadas durante la ejecución. *countcallers* habilita el seguimiento de la relación de llamadas. *ignoremods* es una lista de módulos o paquetes para ignorar. *ignoredirs* es una lista de directorios cuyos módulos o paquetes deben ignorarse. *infile* es el nombre del archivo desde el cual leer la información de conteo almacenada. *outfile* es el nombre del archivo en el que se escribe la información de conteo actualizada. *timing* permite mostrar una marca de tiempo relativa al momento en que se inició el seguimiento.

source: Execute the command and gather statistics from the execution with the current tracing parameters. *cmd* must be a string or code object, suitable for passing into :func:`exec`.
es: Ejecuta el comando y recopile estadísticas de la ejecución con los parámetros de seguimiento actuales. *cmd* debe ser una cadena o un objeto de código, adecuado para pasar a :func:`exec`.

source: Execute the command and gather statistics from the execution with the current tracing parameters, in the defined global and local environments. If not defined, *globals* and *locals* default to empty dictionaries.
es: Ejecuta el comando y recopile estadísticas de la ejecución con los parámetros de seguimiento actuales, en los entornos globales y locales definidos. Si no está definido, *globals* y *locals* por defecto son diccionarios vacíos.

source: Call *func* with the given arguments under control of the :class:`Trace` object with the current tracing parameters.
es: Llama a *func* con los argumentos dados bajo el control del objeto :class:`Trace` con los parámetros de rastreo actuales.

source: Return a :class:`CoverageResults` object that contains the cumulative results of all previous calls to ``run``, ``runctx`` and ``runfunc`` for the given :class:`Trace` instance. Does not reset the accumulated trace results.
es: Devuelve un objeto :class:`CoverageResults` que contiene los resultados acumulativos de todas las llamadas anteriores a ``run``, ``runctx`` y ``runfunc`` para la instancia dada :class:`Trace`. No restablece los resultados de seguimiento acumulados.

source: A container for coverage results, created by :meth:`Trace.results`. Should not be created directly by the user.
es: Un contenedor para los resultados de la cobertura, creado por :meth:`Trace.results`. No debe ser creado directamente por el usuario.

source: Merge in data from another :class:`CoverageResults` object.
es: Fusiona datos de otro objeto :class:`CoverageResults`.

source: Write coverage results. Set *show_missing* to show lines that had no hits. Set *summary* to include in the output the coverage summary per module. *coverdir* specifies the directory into which the coverage result files will be output. If ``None``, the results for each source file are placed in its directory.
es: Escribe los resultados de la cobertura. Configure * show_missing * para mostrar las líneas que no tuvieron coincidencias. Configurar *summary* para incluir en la salida el resumen de cobertura por módulo. *coverdir* especifica el directorio en el que se enviarán los archivos de resultado de cobertura. Si es ``None``, los resultados de cada archivo fuente se colocan en su directorio.

source: A simple example demonstrating the use of the programmatic interface::
es: Un ejemplo simple que demuestra el uso de la interfaz programática::
