Repository: python/python-docs-es
Catalog: library/tracemalloc.po
Languages: es

source: :mod:`tracemalloc` --- Trace memory allocations
es: :mod:`tracemalloc`--- Rastrea la asignación de memoria

source: **Source code:** :source:`Lib/tracemalloc.py`
es: **Código fuente:** :source:`Lib/tracemalloc.py`

source: The tracemalloc module is a debug tool to trace memory blocks allocated by Python. It provides the following information:
es: El módulo tracemalloc es una herramienta de depuración para rastrear los espacios de memoria asignados por Python. Este proporciona la siguiente información:

source: Traceback where an object was allocated
es: El rastreo al lugar de origen del objeto asignado

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
es: Las estadísticas en los espacios de memoria asignados por nombre de archivo y por número de línea: tamaño total, número y tamaño promedio de los espacios de memoria asignados

source: Compute the differences between two snapshots to detect memory leaks
es: Calcula las diferencias entre dos informes instantáneos para detectar alguna filtración en la memoria

source: To trace most memory blocks allocated by Python, the module should be started as early as possible by setting the :envvar:`PYTHONTRACEMALLOC` environment variable to ``1``, or by using :option:`-X` ``tracemalloc`` command line option. The :func:`tracemalloc.start` function can be called at runtime to start tracing Python memory allocations.
es: Para rastrear la mayoría de los espacios de memoria asignados por Python; el módulo debe empezar tan pronto como sea posible configurando la variable del entorno :envvar:`PYTHONTRACEMALLOC` a ``1``, o usando la opción del comando de línea :option:`-X` ``tracemalloc``. La función :func:`tracemalloc.start` puede ser llamada en tiempo de ejecución para empezar a rastrear las asignaciones de memoria de Python.

source: By default, a trace of an allocated memory block only stores the most recent frame (1 frame). To store 25 frames at startup: set the :envvar:`PYTHONTRACEMALLOC` environment variable to ``25``, or use the :option:`-X` ``tracemalloc=25`` command line option.
es: Por defecto, el rastreo de un espacio de memoria asignado solo guarda el cuadro mas reciente (1 cuadro). Para guardar 25 cuadros desde el :envvar:`PYTHONTRACEMALLOC`comienzo, configura la variable del entorno a ``25``, o usa :option:`-X` ``tracemalloc=25`` en la opción de línea de comando.

source: Examples
es: Ejemplos

source: Display the top 10
es: Mostrar los 10 principales

source: Display the 10 files allocating the most memory::
es: Mostrar los 10 archivos asignando la mayor cantidad de memoria::

source: Example of output of the Python test suite::
es: Ejemplo de la salida del conjunto de pruebas de Python:

source: We can see that Python loaded ``4855 KiB`` data (bytecode and constants) from modules and that the :mod:`collections` module allocated ``244 KiB`` to build :class:`~collections.namedtuple` types.
es: Se puede ver que Python ha cargado ``4855 KiB`` de data (código de bytes y constantes) desde los módulos y que el modulo :mod:`collections` asigno ``24KiB`` para crear tipos :class:`~collections.namedtuple`.

source: See :meth:`Snapshot.statistics` for more options.
es: Mira :meth:`Snapshot.statistics` para más opciones.

source: Compute differences
es: Calcula las diferencias

source: Take two snapshots and display the differences::
es: Toma dos capturas instantáneas y muestra las diferencias::

source: Example of output before/after running some tests of the Python test suite::
es: Ejemplo de la salida antes y después de probar el conjunto de pruebas de Python::

source: We can see that Python has loaded ``8173 KiB`` of module data (bytecode and constants), and that this is ``4428 KiB`` more than had been loaded before the tests, when the previous snapshot was taken. Similarly, the :mod:`linecache` module has cached ``940 KiB`` of Python source code to format tracebacks, all of it since the previous snapshot.
es: Se puede ver que Python cargó ``8173 KiB`` de información del modulo (código de bytes y constantes), y que eso es ```4428KiB`` más de lo que ha sido cargado antes de los test, cuando la anterior captura de pantalla fue tomada. De manera similar, el modulo :mod:`linecache` ha almacenado en caché``940 KiB`` del código fuente de Python para formatear los seguimientos, todo desde la captura instántanea.

source: If the system has little free memory, snapshots can be written on disk using the :meth:`Snapshot.dump` method to analyze the snapshot offline. Then use the :meth:`Snapshot.load` method reload the snapshot.
es: Si el sistema tiene poca memoria libre, los informes instantáneos pueden ser escritos en el disco usando el método :meth:`Snapshot.dump` para analizar el informe instantáneo offline. Después usa el método :meth:`Snapshot.load` para actualizar el informe.

source: Get the traceback of a memory block
es: Consigue el seguimiento del bloque de memoria

source: Code to display the traceback of the biggest memory block::
es: Código para configurar el seguimiento del bloque de memoria más grande::

source: Example of output of the Python test suite (traceback limited to 25 frames)::
es: Ejemplo de la salida del conjunto de pruebas de Python (rastreo limitado a 25 cuadros)::

source: We can see that the most memory was allocated in the :mod:`importlib` module to load data (bytecode and constants) from modules: ``870.1 KiB``. The traceback is where the :mod:`importlib` loaded data most recently: on the ``import pdb`` line of the :mod:`doctest` module. The traceback may change if a new module is loaded.
es: Se puede ver que la mayor parte de la memoria fue asignada en el módulo :mod:`importlib` para cargar datos (códigos de bytes y constantes) desde módulos ``870.1 KiB``. El rastreo esta donde el módulo :mod:`importlib` cargó datos más recientemente: en la linea ``import pdb`` el módulo :mod:`doctest`.

source: Pretty top
es: ``Los 10 más bonitos``

source: Code to display the 10 lines allocating the most memory with a pretty output, ignoring ``<frozen importlib._bootstrap>`` and ``<unknown>`` files::
es: Codifica para configurar las 10 líneas que asignan gran parte de la memoria con una salida ``bonita``, ignorando los archivos``<frozen importlib._bootstap>`` y ``<unkownn>``:

source: Functions
es: Funciones

source: Clear traces of memory blocks allocated by Python.
es: Limpia los rastros de los bloques de memoria asignados por Python.

source: See also :func:`stop`.
es: Mira también la función :func:`stop`.

source: Get the traceback where the Python object *obj* was allocated. Return a :class:`Traceback` instance, or ``None`` if the :mod:`tracemalloc` module is not tracing memory allocations or did not trace the allocation of the object.
es: Obtén el rastreo de donde el objeto de Python fue asignado. Retorna una instancia :class:`Traceback` o ``None`` si el módulo :mod:`tracemalloc` no esta rastreando ninguna asignación de memoria o no rastreó la asignación del objeto.

source: See also :func:`gc.get_referrers` and :func:`sys.getsizeof` functions.
es: Mira también las funciones :func:`gc.get_referrers` y :func:`sys.getsizeof`.

source: Get the maximum number of frames stored in the traceback of a trace.
es: Obtén el número máximo de cuadros guardados en el seguimiento de un rastro.

source: The :mod:`tracemalloc` module must be tracing memory allocations to get the limit, otherwise an exception is raised.
es: El módulo :mod:`tracemalloc` debe rastrear las asignaciones de memoria para obtener el límite, de otra manera se inicia una excepción.

source: The limit is set by the :func:`start` function.
es: El limite es establecido por la función :func:`start`.

source: Get the current size and peak size of memory blocks traced by the :mod:`tracemalloc` module as a tuple: ``(current: int, peak: int)``.
es: Obtén el tamaño actual y tamaño pico de los bloques de memorias rastreados por el módulo :mod:`tracemalloc` como una tupla: ``(current: int, peak: int)``.

source: Get the memory usage in bytes of the :mod:`tracemalloc` module used to store traces of memory blocks. Return an :class:`int`.
es: Obtén el uso de la memoria en bytes desde el modulo :mod:`tracemalloc` usado para guardar rastreos de bloques de memoria. Retorna una clase :class:`int`.

source: ``True`` if the :mod:`tracemalloc` module is tracing Python memory allocations, ``False`` otherwise.
es: Si el módulo :mod:`tracemalloc` esta rastreando asignaciones de memoria de Python retorna ``True`` sino retorna ``False``.

source: See also :func:`start` and :func:`stop` functions.
es: También mira las funciones :func:`start` y :func:`stop`.

source: Start tracing Python memory allocations: install hooks on Python memory allocators. Collected tracebacks of traces will be limited to *nframe* frames. By default, a trace of a memory block only stores the most recent frame: the limit is ``1``. *nframe* must be greater or equal to ``1``.
es: Empieza a rastrear las asignaciones de memoria de Python: instala *hooks* en las asignaciones de memoria de Python. Los rastreos coleccionados van a estar limitados a *nframe*. Por defecto, un rastro de un bloque de memoria solo guarda el cuadro mas reciente: el limite es ``1``. *nframe* debe ser mayor o igual a `1`.

source: Storing more than ``1`` frame is only useful to compute statistics grouped by ``'traceback'`` or to compute cumulative statistics: see the :meth:`Snapshot.compare_to` and :meth:`Snapshot.statistics` methods.
es: Guardar mas de ``1`` cuadro es solo útil para calcular estadísticas agrupadas por seguimiento o para calcular estadísticas acumulativa: mira las funciones :meth:`Snapshot.compare_to` y :meth:`Snapshot.statistics`.

source: Storing more frames increases the memory and CPU overhead of the :mod:`tracemalloc` module. Use the :func:`get_tracemalloc_memory` function to measure how much memory is used by the :mod:`tracemalloc` module.
es: Guardar mas cuadros aumenta la memoria y la sobrecargar de la CPU del modulo :mod:`tracemalloc`. Usa la función :func:`get_tracemalloc_memory` para medir cuanta memoria se usa por el módulo :mod:`tracemalloc`.

source: The :envvar:`PYTHONTRACEMALLOC` environment variable (``PYTHONTRACEMALLOC=NFRAME``) and the :option:`-X` ``tracemalloc=NFRAME`` command line option can be used to start tracing at startup.
es: La variable del entorno :envvar:`PYTHONTRACEMALLOC` (``PYTHONTRACEMALLOC=NFRAME``) y la opción de comando de linea :option:`-X` ``tracemalloc=NFRAME`` se puede usar para empezar a rastrear desde el inicio.

source: See also :func:`stop`, :func:`is_tracing` and :func:`get_traceback_limit` functions.
es: También mira las funciones :func:`stop`, :func:`is_tracing` y :func:`get_traceback_limit`.

source: Stop tracing Python memory allocations: uninstall *hooks* on Python memory allocators. Also clears all previously collected traces of memory blocks allocated by Python.
es: Detén el rastreo de las asignaciones de memoria de Python: desinstala los *hooks*. También limpia todos los rastros de memoria recolectados por los bloques de memoria asignados por Python.

source: Call :func:`take_snapshot` function to take a snapshot of traces before clearing them.
es: Llama a la función :func:`take_snapshot` para tomar una captura instantánea de los rastreos, antes de limpiarlos.

source: See also :func:`start`, :func:`is_tracing` and :func:`clear_traces` functions.
es: También mira las funciones :func:`start`, :func:`is_tracing` y :func:`clear_traces`.

source: Take a snapshot of traces of memory blocks allocated by Python. Return a new :class:`Snapshot` instance.
es: Toma una captura instantánea de los bloques de memoria asignados por Python. Retorna una nueva instancia de la clase :class:`Snapshot`.

source: The snapshot does not include memory blocks allocated before the :mod:`tracemalloc` module started to trace memory allocations.
es: La captura instantánea no incluye ningún bloque de memoria asignado antes de que el módulo :mod:`tracemalloc` haya empezado a rastrear asignaciones de memoria.

source: Tracebacks of traces are limited to :func:`get_traceback_limit` frames. Use the *nframe* parameter of the :func:`start` function to store more frames.
es: Los seguimientos de los rastros son limitados por la función :func:`get_traceback_limit`. Usa el parámetro *nframe* de la función :func:`start` para guardar mas cuadros.

source: The :mod:`tracemalloc` module must be tracing memory allocations to take a snapshot, see the :func:`start` function.
es: El módulo :mod:`tracemalloc` debe empezar a rastrear las asignaciones de memoria para tomar una captura instantánea. Mira la función :func:`start`.

source: See also the :func:`get_object_traceback` function.
es: También mira la función :func:`get_object_traceback`.

source: DomainFilter
es: Filtro de dominio

source: Filter traces of memory blocks by their address space (domain).
es: Filtra los rastros de los bloques de memoria por su espacio de dirección (dominio)

source: If *inclusive* is ``True`` (include), match memory blocks allocated in the address space :attr:`domain`.
es: Si *inclusive* es ``True`` (incluye), relaciona los bloques de memoria asignados en el espacio de dirección :attr:`domain`.

source: If *inclusive* is ``False`` (exclude), match memory blocks not allocated in the address space :attr:`domain`.
es: Si *inclusive* es ``False`` (excluye), relaciona los bloques de memoria no asignados en el espacio de dirección :attr:`domain`.

source: Address space of a memory block (``int``). Read-only property.
es: Espacio de dirección de un bloque de memoria (``int``). Propiedad solo-lectura.

source: Filter
es: Filtro

source: Filter on traces of memory blocks.
es: Filtra los rastros de los bloques de memoria.

source: See the :func:`fnmatch.fnmatch` function for the syntax of *filename_pattern*. The ``'.pyc'`` file extension is replaced with ``'.py'``.
es: También mira la función :func:`fnmatch.fnmatch` para la sintaxis de *filename_pattern*. La extensión ``'.pyc'`` es remplazada por ``'.py'``.

source: Examples:
es: Ejemplos:

source: ``Filter(True, subprocess.__file__)`` only includes traces of the :mod:`subprocess` module
es: ``Filter(True, subprocess.__file__)`` solo incluye los rastros de el módulo :mod:`subprocess`

source: ``Filter(False, tracemalloc.__file__)`` excludes traces of the :mod:`tracemalloc` module
es: ``Filter(False, tracemalloc.__file__)`` excluye los rastros de memoria del módulo :mod:`tracemalloc`

source: ``Filter(False, "<unknown>")`` excludes empty tracebacks
es: ``Filter(False, "<unknown>")`` excluye los seguimientos vacíos

source: The ``'.pyo'`` file extension is no longer replaced with ``'.py'``.
es: La extensión ``'.pyo'`` ya no se remplaza con ``'.py'``.

source: Added the :attr:`domain` attribute.
es: Agregado el atributo :attr:`domain` .

source: Address space of a memory block (``int`` or ``None``).
es: El espacio de dirección de un bloque de memoria (``int`` o ``None``).

source: tracemalloc uses the domain ``0`` to trace memory allocations made by Python. C extensions can use other domains to trace other resources.
es: tracemalloc usa el dominio ``0`` para rastrear las asignaciones de memoria hechas por Python. Las extensiones C pueden usar otros dominios para rastrear otros recursos.

source: If *inclusive* is ``True`` (include), only match memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
es: Si *inclusive* es ``True`` (incluye), solo relaciona los bloques de memoria asignados en un archivo con el nombre coincidiendo con el atributo :attr:`filename_pattern` en el número de línea del atributo :attr:`lineno`.

source: If *inclusive* is ``False`` (exclude), ignore memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
es: Si *inclusive* es ``False`` (excluye), ignora los bloques de memoria asignados en un archivo con el nombre coincidiendo con el atributo :attr:`filename_pattern` en el número de línea del atributo :attr:`lineno`.

source: Line number (``int``) of the filter. If *lineno* is ``None``, the filter matches any line number.
es: El número de linea (``int``) del filtro. Si *lineno* es ``None``, el filtro se relaciona con cualquier número de linea.

source: Filename pattern of the filter (``str``). Read-only property.
es: El patrón del nombre de archivo del filtro (``str``). Propiedad solo-lectura.

source: If *all_frames* is ``True``, all frames of the traceback are checked. If *all_frames* is ``False``, only the most recent frame is checked.
es: Si *all_frames* es ``True``, todos los cuadros de los rastreos son chequeados. Si *all_frames* es ``False``, solo el cuadro mas reciente es chequeado.

source: This attribute has no effect if the traceback limit is ``1``. See the :func:`get_traceback_limit` function and :attr:`Snapshot.traceback_limit` attribute.
es: El atributo no tiene efecto si el limite de rastreo es ``1``. Mira la función :func:`get_traceback_limit` y el atributo :attr:`Snapshot.traceback_limit`.

source: Frame
es: Cuadro

source: Frame of a traceback.
es: Cuadro de un rastreo.

source: The :class:`Traceback` class is a sequence of :class:`Frame` instances.
es: La clase :class:`Traceback` es una secuencia de las instancias de la clase :class:`Frame`.

source: Filename (``str``).
es: Nombre de archivo (``str``).

source: Line number (``int``).
es: Número de línea (``int``).

source: Snapshot
es: Captura instantánea

source: Snapshot of traces of memory blocks allocated by Python.
es: Captura instantánea de los rastros de los bloques de memoria asignados por Python.

source: The :func:`take_snapshot` function creates a snapshot instance.
es: La función :func:`take_snapshot` crea una instancia de captura instantánea.

source: Compute the differences with an old snapshot. Get statistics as a sorted list of :class:`StatisticDiff` instances grouped by *key_type*.
es: Calcula las diferencias con una vieja captura instantánea. Obtiene las estadísticas en una lista ordenada de instancias de la clase :class:`StatisticDiff` agrupadas por *key_type*.

source: See the :meth:`Snapshot.statistics` method for *key_type* and *cumulative* parameters.
es: Mira el método :meth:`Snapshot.statistics` para los parámetros *key_type* y *cumulative*.

source: The result is sorted from the biggest to the smallest by: absolute value of :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, absolute value of :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` and then by :attr:`StatisticDiff.traceback`.
es: El resultado esta guardado desde el más grande al más pequeño por los valores absolutos de :meth:`StatisticDiff.size_diff`, :meth:`StatisticDiff.size`, el valor absoluto de :meth:`StatisticDiff.count_diff`, :meth:`Statistic.count` y después por el atributo :meth:`StatisticDiff.traceback`.

source: Write the snapshot into a file.
es: Escribe la captura instantánea en un archivo.

source: Use :meth:`load` to reload the snapshot.
es: Usa el método :meth:`load` para recargar la captura instantánea.

source: Create a new :class:`Snapshot` instance with a filtered :attr:`traces` sequence, *filters* is a list of :class:`DomainFilter` and :class:`Filter` instances. If *filters* is an empty list, return a new :class:`Snapshot` instance with a copy of the traces.
es: Crea una nueva instancia de clase :class:`Snapshot` con una secuencia de :attr:`traces` filtrados, *filters* es una lista de las instancias de :class:`DomainFilter` y :class:`Filter`. Si *filters* es una lista vacia, retorna una nueva instancia de clase :class:`Snapshot` con una copia de los rastreos.

source: All inclusive filters are applied at once, a trace is ignored if no inclusive filters match it. A trace is ignored if at least one exclusive filter matches it.
es: Los filtros ``todo incluido`` se aplican de a uno, si los filtros no incluidos coinciden. Si al menos un filtro exclusivo coincide, se ignora un rastro.

source: :class:`DomainFilter` instances are now also accepted in *filters*.
es: Las instancias de clase :class:`DomainFilter` ahora también son aceptadas en *filters*.

source: Load a snapshot from a file.
es: Carga la captura instantánea desde un archivo.

source: See also :meth:`dump`.
es: También mira el método :meth:`dump`.

source: Get statistics as a sorted list of :class:`Statistic` instances grouped by *key_type*:
es: Obtiene estadísticas como una lista ordenada, de instancias de :class:`Statistic` agrupadas por *key_type*:

source: description
es: descripción

source: filename
es: nombre del archivo

source: filename and line number
es: nombre del archivo y número de línea

source: traceback
es: seguimiento

source: If *cumulative* is ``True``, cumulate size and count of memory blocks of all frames of the traceback of a trace, not only the most recent frame. The cumulative mode can only be used with *key_type* equals to ``'filename'`` and ``'lineno'``.
es: Si *cumulative* es ``True``, acumula el tamaño y cuenta los bloques de memoria de todos los cuadros del seguimiento de un rastro, no solo el cuadro mas reciente. El modo acumulativo solo puede ser usado cuando *key_type* se iguala a ``'filename'`` y ``'lineno'``.

source: The result is sorted from the biggest to the smallest by: :attr:`Statistic.size`, :attr:`Statistic.count` and then by :attr:`Statistic.traceback`.
es: El resultado se organiza desde el más grande hasta el más pequeño por el atributo :attr:`Statistic.size`, :attr:`Statistic.count` y después por :attr:`Statistic.traceback`.

source: Maximum number of frames stored in the traceback of :attr:`traces`: result of the :func:`get_traceback_limit` when the snapshot was taken.
es: El número máximo de cuadros organizados en el rastreo del atributo :attr:`traces`: resulta de la función :attr:`get_traceback_limit` cuando la captura instantánea fue tomada.

source: Traces of all memory blocks allocated by Python: sequence of :class:`Trace` instances.
es: Rastros de todos los bloques de memoria asignados por Python: secuencia de instancias de :class:`Trace`.

source: The sequence has an undefined order. Use the :meth:`Snapshot.statistics` method to get a sorted list of statistics.
es: La secuencia tiene un orden que no esta definido. Usa el método :meth:`Snapshot.statistics` para obtener una lista ordenada de estadísticas.

source: Statistic
es: Estadística

source: Statistic on memory allocations.
es: Estadística de las asignaciones de memoria.

source: :func:`Snapshot.statistics` returns a list of :class:`Statistic` instances.
es: :func:`Snapshot.statistics` retorna una lista de instancias de la clase :class:`Statistic`.

source: See also the :class:`StatisticDiff` class.
es: También mira la clase :class:`StatisticDiff`.

source: Number of memory blocks (``int``).
es: Número de bloques de memoria (``int``).

source: Total size of memory blocks in bytes (``int``).
es: El tamaño total de los bloques de memoria en bytes (``int``).

source: Traceback where the memory block was allocated, :class:`Traceback` instance.
es: Rastrea donde un bloque de memoria fue asignado, la instancia de la clase :class:`Traceback`.

source: Statistic difference on memory allocations between an old and a new :class:`Snapshot` instance.
es: La diferencia de estadística en las asignaciones de memoria entre una vieja y una nueva instancia de clase :class:`Snapshot`.

source: :func:`Snapshot.compare_to` returns a list of :class:`StatisticDiff` instances. See also the :class:`Statistic` class.
es: :func:`Snapshot.compare_to` retorna una lista de instancias de la clase :class:`StatisticDiff`. Mira también la clase :class:`Statistic`.
