Repository: python/python-docs-es
Catalog: library/tracemalloc.po
Languages: es

source: Number of memory blocks in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
es: El número de bloques de memoria en la nueva captura de pantalla (``int``): ``0`` si los bloques de memoria han sido liberados en la nueva captura instantánea.

source: Difference of number of memory blocks between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
es: La diferencia de los números de los bloques de memoria entre las capturas viejas y nuevas (``int``): ``0`` si el bloque de memoria ha sido asignado en la nueva captura instantánea.

source: Total size of memory blocks in bytes in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
es: El tamaño total de los bloques de memoria en bytes en la nueva captura instantánea (``int``): ``0`` si el bloque de memoria ha sido liberado en la nueva captura instantánea.

source: Difference of total size of memory blocks in bytes between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
es: La diferencia de el tamaño total de un bloque de memoria en bytes entre las capturas instantáneas viejas y nuevas (``int``): ``0`` si el bloque de memoria ha sido asignado en la nueva captura instantánea.

source: Traceback where the memory blocks were allocated, :class:`Traceback` instance.
es: Rastrea donde los bloques de memoria han sido asignados, instancia de la clase :class:`Traceback`.

source: Trace
es: Rastro

source: Trace of a memory block.
es: Rastro de un bloque de memoria.

source: The :attr:`Snapshot.traces` attribute is a sequence of :class:`Trace` instances.
es: El atributo :attr:`Snapshot.traces` es una secuencia de las instancias de la clase :class:`Trace`.

source: Size of the memory block in bytes (``int``).
es: Tamaño de un bloque de memoria en bytes (``int``).

source: Traceback
es: Seguimiento

source: Sequence of :class:`Frame` instances sorted from the oldest frame to the most recent frame.
es: La secuencia de las instancias de la clase :class:`Frame` organizadas desde el cuadro mas antiguo al más reciente.

source: A traceback contains at least ``1`` frame. If the ``tracemalloc`` module failed to get a frame, the filename ``"<unknown>"`` at line number ``0`` is used.
es: Un seguimiento contiene por lo menos ``1`` cuadro. Si el módulo ``tracemalloc`` falla al traer un cuadro, se usa el nombre del archivo ``"<unknown>"`` en el número de linea ``0``.

source: When a snapshot is taken, tracebacks of traces are limited to :func:`get_traceback_limit` frames. See the :func:`take_snapshot` function.
es: Cuando se toma una captura instantánea, los seguimientos de los rastros son limitados a :func:`get_traceback_limit` cuadros. Mira la función :func:`take_snapshot`.

source: The :attr:`Trace.traceback` attribute is an instance of :class:`Traceback` instance.
es: El atributo :attr:`Trace.traceback` es una instancia de la clase :class:`Traceback`.

source: Frames are now sorted from the oldest to the most recent, instead of most recent to oldest.
es: Los cuadros están organizados desde el mas antiguo hasta el más reciente, en vez de el más reciente al más antiguo.

source: Format the traceback as a list of lines with newlines. Use the :mod:`linecache` module to retrieve lines from the source code. If *limit* is set, format the *limit* most recent frames if *limit* is positive. Otherwise, format the ``abs(limit)`` oldest frames. If *most_recent_first* is ``True``, the order of the formatted frames is reversed, returning the most recent frame first instead of last.
es: Formatea el seguimiento como una lista de líneas con nuevas líneas. Usa el módulo :mod:`linecache` para obtener líneas del código fuente. Si se establece *limit*, si *limit* es positivo: formatea el cuadro mas reciente. Si no, formatea los ``abs(limit)`` cuadros más antiguos. Si *most_recent_first* es ``True``, el orden de los cuadros formateados es invertido, retornando primero el cuadro más reciente en vez del último.

source: Similar to the :func:`traceback.format_tb` function, except that :meth:`.format` does not include newlines.
es: Similar a la función :func:`traceback.format_tb`, excepto por el método :meth:`.format` que no incluye nuevas líneas.

source: Example::
es: Ejemplo::

source: Output::
es: Salida::
