Repository: python/python-docs-es
Catalog: library/turtle.po
Languages: es_ar

source: :mod:`turtle` --- Turtle graphics
es_ar: :mod:`turtle` --- Gráficos con *Turtle*

source: **Source code:** :source:`Lib/turtle.py`
es_ar: **Código fuente:** :source:`Lib/turtle.py`

source: Introduction
es_ar: Introducción

source: Turtle can draw intricate shapes using programs that repeat simple moves.
es_ar: Turtle puede dibujar figuras intrincadas usando programas que repiten movimientos simples.

source: Pen control
es_ar: Control del lápiz

source: In the following documentation the argument list for functions is given. Methods, of course, have the additional first argument *self* which is omitted here.
es_ar: En la siguiente documentación se proporciona la listas de argumentos para las funciones. Los métodos, por su puesto, tienen el argumento principal adicional *self* que se omite aquí.

source: Turtle methods
es_ar: Métodos Turtle

source: Turtle motion
es_ar: Movimiento de Turtle

source: Move and draw
es_ar: Mover y dibujar

source: Tell Turtle's state
es_ar: Mostrar el estado de la tortuga

source: Setting and measurement
es_ar: Ajuste y unidades de medida

source: Drawing state
es_ar: Estado de dibujo

source: Color control
es_ar: Control del color

source: Filling
es_ar: Relleno

source: More drawing control
es_ar: Más controles de dibujo

source: Turtle state
es_ar: Estado de la Tortuga

source: Visibility
es_ar: Visibilidad

source: Appearance
es_ar: Apariencia

source: Using events
es_ar: Usando eventos

source: Special Turtle methods
es_ar: Métodos especiales de *Turtle*

source: Methods of TurtleScreen/Screen
es_ar: Métodos de TurtleScreen/Screen

source: Window control
es_ar: Control de ventana

source: Animation control
es_ar: Control de animación

source: Using screen events
es_ar: Usando eventos de pantalla

source: Settings and special methods
es_ar: Configuración y métodos especiales

source: Input methods
es_ar: Métodos de entrada

source: Methods specific to Screen
es_ar: Métodos específicos para *Screen*

source: Methods of RawTurtle/Turtle and corresponding functions
es_ar: Métodos de *RawTurtle/Turtle* Y sus correspondientes funciones

source: Most of the examples in this section refer to a Turtle instance called ``turtle``.
es_ar: Casi todos los ejemplos de esta sección se refieren a una instancia Turtle llamada ``turtle``.

source: Parameters
es_ar: Parámetros

source: a number (integer or float)
es_ar: un número (entero o flotante)

source: Move the turtle forward by the specified *distance*, in the direction the turtle is headed.
es_ar: Mover hacia adelante la tortuga la *ditance* especificada, en la dirección en la que la tortuga apunta.

source: a number
es_ar: un número

source: Move the turtle backward by *distance*, opposite to the direction the turtle is headed. Do not change the turtle's heading.
es_ar: Mover hacia atrás la tortuga la *distance* especificada, opuesta a la dirección en que la tortuga apunta. No cambia la dirección de la tortuga.

source: Turn turtle right by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
es_ar: Gira la tortuga a la derecha tomando los *angle* como unidad de medida. (La unidad de medida por defecto son los grado, pero se puede configurar a través de las funciones :func:`degrees` y :func:`radians`.) La orientación de los ángulos depende del modo en que está la tortuga, ver :func:`mode`.

source: Turn turtle left by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
es_ar: Gira la tortuga a la izquierda tomando los *ángulos* como unidad de medida. (La unidad de medida por defecto son los grado, pero se puede configurar a través de las funciones :func:`degrees` y :func:`radians`.) La orientación de los ángulos depende del modo en que está la tortuga, ver :func:`mode`.

source: a number or a pair/vector of numbers
es_ar: un número o un par/vector de números

source: a number or ``None``
es_ar: un número o ``None``

source: If *y* is ``None``, *x* must be a pair of coordinates or a :class:`Vec2D` (e.g. as returned by :func:`pos`).
es_ar: Si *y* es ``None``, *x* debe ser un par de coordenadas o un :class:`Vec2D` (ejemplo: según lo devuelto por :func:`pos`).

source: Move turtle to an absolute position. If the pen is down, draw line. Do not change the turtle's orientation.
es_ar: Mueve la tortuga a una posición absoluta. Si el lápiz está bajo, traza una linea. No cambia la orientación de la tortuga.

source: Set the turtle's first coordinate to *x*, leave second coordinate unchanged.
es_ar: Establece la primera coordenada de la tortuga a *x*, deja la segunda coordenada sin cambios.

source: Set the turtle's second coordinate to *y*, leave first coordinate unchanged.
es_ar: Establece la segunda coordenada de la tortuga a *y*, deja la primera coordenada sin cambios.

source: Set the orientation of the turtle to *to_angle*. Here are some common directions in degrees:
es_ar: Establece la orientación de la tortuga a *to_angle*. Aquí hay algunas direcciones comunes en grados:

source: standard mode
es_ar: modo estándar

source: logo mode
es_ar: modo logo

source: 0 - east
es_ar: 0 - este

source: 0 - north
es_ar: 0 - norte

source: 90 - north
es_ar: 90 - norte

source: 90 - east
es_ar: 90 - este

source: 180 - west
es_ar: 180 - oeste

source: 180 - south
es_ar: 180 - sur

source: 270 - south
es_ar: 270 - sur

source: 270 - west
es_ar: 270 - oeste

source: Move turtle to the origin -- coordinates (0,0) -- and set its heading to its start-orientation (which depends on the mode, see :func:`mode`).
es_ar: Mueve la tortuga al origen -- coordenadas (0,0) -- y establece la orientación a la orientación original (que depende del modo, ver :func:`mode`).

source: a number (or ``None``)
es_ar: un número (o ``None``)

source: an integer (or ``None``)
es_ar: un entero (o ``None``)

source: Draw a circle with given *radius*. The center is *radius* units left of the turtle; *extent* -- an angle -- determines which part of the circle is drawn. If *extent* is not given, draw the entire circle. If *extent* is not a full circle, one endpoint of the arc is the current pen position. Draw the arc in counterclockwise direction if *radius* is positive, otherwise in clockwise direction. Finally the direction of the turtle is changed by the amount of *extent*.
es_ar: Dibuja un círculo con el *radius* (radio) dado. El centro es *radius* unidades a la izquierda de la tortuga; *extent* -- un ángulo -- determina que parte del círculo se dibuja. Si no se pasa *extent*, dibuja el círculo entero. Si *extent* no es un círculo completo, un punto final del arco es la posición actual de lápiz. Dibuja el arco en dirección antihorario si *radius* es positivo, si no en dirección horaria. Finalmente la dirección de la tortuga es modificada por el aumento de *extent*.

source: As the circle is approximated by an inscribed regular polygon, *steps* determines the number of steps to use. If not given, it will be calculated automatically. May be used to draw regular polygons.
es_ar: Como el círculo se aproxima a un polígono regular inscripto, *steps* determina el número de pasos a usar. Si no se da, será calculado automáticamente. Puede ser usado para dibujar polígonos regulares.

source: an integer >= 1 (if given)
es_ar: un entero >= 1 (si se da)

source: a colorstring or a numeric color tuple
es_ar: un *colorstring* o una tupla numérica de color

source: Draw a circular dot with diameter *size*, using *color*. If *size* is not given, the maximum of pensize+4 and 2*pensize is used.
es_ar: Dibuja un punto circular con diámetro *size*, usando *color*. Si *size* no se da, el máximo de pensize+4 y 2*pensize es usado.

source: Stamp a copy of the turtle shape onto the canvas at the current turtle position. Return a stamp_id for that stamp, which can be used to delete it by calling ``clearstamp(stamp_id)``.
es_ar: Estampa una copia de la forma de la tortuga en el lienzo en la posición actual. Devuelve un stamp_id por cada estampa, que puede ser usado para borrarlo al llamar ``clearstamp(stamp_id)``.

source: an integer, must be return value of previous :func:`stamp` call
es_ar: un entero, debe devolver el valor de la llamada previa de la función :func:`stamp` call

source: Delete stamp with given *stampid*.
es_ar: Borra la estampa con el *stampid* dado.

source: Delete all or first/last *n* of turtle's stamps. If *n* is ``None``, delete all stamps, if *n* > 0 delete first *n* stamps, else if *n* < 0 delete last *n* stamps.
es_ar: Borra todas o las primeros/últimos *n* estampas de la tortuga. Si *n* es ``None`` , borra todas las estampas, Si *n* *> 0* borra la primera estampa *n*, sino y *n* *< 0* borra la última estampa *n*.

source: Undo (repeatedly) the last turtle action(s). Number of available undo actions is determined by the size of the undobuffer.
es_ar: Deshace (repetidamente) la(s) última(s) acción(es) de la tortuga. El número de acciones a deshacer es determinado por el tamaño del *undobuffer*.

source: an integer in the range 0..10 or a speedstring (see below)
es_ar: un entero en el rango 0..10 o un *speedstring* (ver abajo)

source: Set the turtle's speed to an integer value in the range 0..10. If no argument is given, return current speed.
es_ar: Establecer la velocidad de la tortuga a un valor entero en el rango 0..10. Si no se pasa ningún argumento, vuelve a la velocidad actual.

source: If input is a number greater than 10 or smaller than 0.5, speed is set to 0. Speedstrings are mapped to speedvalues as follows:
es_ar: Si el parámetro de entrada es un número mayor que 10 o menor que 0.5, la velocidad se establece a 0. La frase acerca de la velocidad es mapeada a valores de velocidad de la siguiente manera:

source: Speeds from 1 to 10 enforce increasingly faster animation of line drawing and turtle turning.
es_ar: Velocidades de 1 a 10 generan una animación cada vez más rápida al dibujar las líneas y en el giro de la tortuga.

source: Attention: *speed* = 0 means that *no* animation takes place. forward/back makes turtle jump and likewise left/right make the turtle turn instantly.
es_ar: Atención: *speed* = 0 implica que *no* habrá ninguna animación. Los métodos *fordward/back* harán que la tortuga salte, de la misma manera que *left/right* hará que la tortuga gire instantáneamente.

source: Return the turtle's current location (x,y) (as a :class:`Vec2D` vector).
es_ar: Devuelve la posición actual de la tortuga (x,y) (como un vector :class:`Vec2D`)

source: a number or a pair/vector of numbers or a turtle instance
es_ar: un número o par de vectores numéricos o una instancia de la tortuga

source: a number if *x* is a number, else ``None``
es_ar: un número si *x* es un número, si no ``None``

source: Return the angle between the line from turtle position to position specified by (x,y), the vector or the other turtle. This depends on the turtle's start orientation which depends on the mode - "standard"/"world" or "logo".
es_ar: Retorna el ángulo entre la línea en la posición de la tortuga a la posición especificada en (x, y), el vector o la otra tortuga. Esto depende de la posición inicial de la tortuga, que depende del modo - "standard"/"world" o "logo".

source: Return the turtle's x coordinate.
es_ar: Devuelve la coordinada *x* de la tortuga.

source: Return the turtle's y coordinate.
es_ar: Devuelve la coordenada *y* de la tortuga.

source: Return the turtle's current heading (value depends on the turtle mode, see :func:`mode`).
es_ar: Devuelve la orientación actual de la tortuga (el valor depende del modo de la tortuga, ver :func:`mode`).

source: Return the distance from the turtle to (x,y), the given vector, or the given other turtle, in turtle step units.
es_ar: Devuelve la distancia desde la tortuga al vector (x,y) dado, otra instancia de la tortuga, el valor es unidad pasos de tortuga.

source: Settings for measurement
es_ar: Configuración de las medidas

source: Set angle measurement units, i.e. set number of "degrees" for a full circle. Default value is 360 degrees.
es_ar: Establece la unidad de medida del ángulo, por ejemplo establece el número de "grados" para un círculo completo. El valor por defecto es 36 grados.

source: Set the angle measurement units to radians. Equivalent to ``degrees(2*math.pi)``.
es_ar: Establece la unidad de medida del ángulo a radianes. Equivalente a ``degrees(2*math.pi)``.

source: Pull the pen down -- drawing when moving.
es_ar: Baja el lápiz -- dibuja mientras se mueve.

source: Pull the pen up -- no drawing when moving.
es_ar: Levanta el lápiz -- no dibuja mientras se mueve.

source: a positive number
es_ar: un número positivo

source: Set the line thickness to *width* or return it. If resizemode is set to "auto" and turtleshape is a polygon, that polygon is drawn with the same line thickness. If no argument is given, the current pensize is returned.
es_ar: Establece el grosos de la línea a *width* o lo devuelve. Si *resizemode* se establece a "auto" y turtleshape es un polígono, ese polígono es dibujado con el mismo grosor de línea. Si no se dan argumentos, devuelve el grosor del lápiz actual.

source: a dictionary with some or all of the below listed keys
es_ar: un diccionario con algunos o todos las claves listadas debajo

source: one or more keyword-arguments with the below listed keys as keywords
es_ar: uno o más argumentos-palabras claves con las claves listadas debajo como palabras claves

source: Return or set the pen's attributes in a "pen-dictionary" with the following key/value pairs:
es_ar: Devuelve o establece los atributos del lápiz en un "diccionario-lápiz" con el siguiente para de valores/claves:

source: "pensize": positive number
es_ar: "pensize": número positivo

source: "speed": number in range 0..10
es_ar: "speed": número en el rango 0..10

source: "stretchfactor": (positive number, positive number)
es_ar: "stretchfactor": (número positivo, número positivo)

source: "outline": positive number
es_ar: "outline": número positivo

source: "tilt": number
es_ar: "tilt": número

source: This dictionary can be used as argument for a subsequent call to :func:`pen` to restore the former pen-state. Moreover one or more of these attributes can be provided as keyword-arguments. This can be used to set several pen attributes in one statement.
es_ar: Este diccionario puede usarse como argumento de una llamada subsecuente a la función :func:`pen` para restaurar el estado anterior del lápiz. Más aún, uno o más de estos atributos pueden darse como argumentos claves. Esto puede usarse para establecer diferentes atributos del lápiz en una sola definición.

source: Return ``True`` if pen is down, ``False`` if it's up.
es_ar: Devuelve ``True`` si el lápiz está abajo, si está arriba ``False``.

source: Return or set the pencolor.
es_ar: Devuelve o establece el color del lápiz.

source: Four input formats are allowed:
es_ar: Se permiten cuatro formatos de entrada:

source: Return the current pencolor as color specification string or as a tuple (see example). May be used as input to another color/pencolor/fillcolor call.
es_ar: Devuelve el color del lápiz actual como una palabra específica de algún color o como una tupla (ver ejemplo). Puede ser usado como una entrada para otra llamada de *color/pencolor/fillcolor*.

source: Set pencolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
es_ar: Establece el color del lápiz a *colorstring*, que es una palabra que especifica un color *Tk*, tales como ``"red"``, ``"yellow"``, o ``"#33cc8c"``.

source: Set pencolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
es_ar: Establece el color del lápiz representado como una tupla de *r*, *g*, y *b*. Cada valor *r*, *g*, y *b* debe ser un valor entero en el rango 0..colormode, donde colormode es 1.0 o 255 (ver :func:`colormode`).

source: Set pencolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
es_ar: Establece el color del lápiz al color RGB representado por *r*, *g*, y *b*. Cada valor *r*, *g*, y *b* debe estar en el rango 0..colormode.

source: If turtleshape is a polygon, the outline of that polygon is drawn with the newly set pencolor.
es_ar: Si *turtleshape* es un polígono, la línea del polígono es dibujado con el muevo color de lápiz elegido.

source: Return the current fillcolor as color specification string, possibly in tuple format (see example). May be used as input to another color/pencolor/fillcolor call.
es_ar: Devuelve el valor actual de *fillcolor* como una palabra, posiblemente en formato de tupla (ver ejemplo). Puede ser usado como entrada de otra llamada *color/pencolor/fillcolor*.

source: Set fillcolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
es_ar: Establece *fillcolor* a *colorstring*, que es un color TK especificado como una palabra (en inglés), tales como *"red"*, *"yellow"*, o ``"#33cc8c"``.

source: Set fillcolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
es_ar: Establece *fillcolor* al color RGB representado por la tupla *r*, *g*, y *b*. Cada uno de los valores *r*, *g*, y *b* debe estar en el rango 0..colormode, donde *colormode* es 1.0 o 255 (ver :func:`colormode`).

source: Set fillcolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
es_ar: Establece *fillcolor* al color RGB representado por *r*, *g*, y *b*. Cada uno de los valores *r*, *g* y *b* debe ser un valor en el rango 0..colormode.

source: If turtleshape is a polygon, the interior of that polygon is drawn with the newly set fillcolor.
es_ar: Si *turtleshape* es un polígono, el interior de ese polígono es dibujado con el color establecido en *fillcolor*.

source: Return or set pencolor and fillcolor.
es_ar: Retorna o establece *pencolor* (el color del lápiz) y *fillcolor* (el color de relleno).

source: Several input formats are allowed. They use 0 to 3 arguments as follows:
es_ar: Se permiten varios formatos de entrada. Usan de 0 a 3 argumentos como se muestra a continuación:

source: Return the current pencolor and the current fillcolor as a pair of color specification strings or tuples as returned by :func:`pencolor` and :func:`fillcolor`.
es_ar: Devuelve el valor actual de *pencolor* y el valor actual de *fillcolor* como un par de colores especificados como palabras o tuplas, como devuelven las funciones :func:`pencolor` y :func:`fillcolor`.

source: Inputs as in :func:`pencolor`, set both, fillcolor and pencolor, to the given value.
es_ar: Entradas como en :func:`pencolor`, establece al valor dado tanto, *fillcolor* como *pencolor*.

source: Equivalent to ``pencolor(colorstring1)`` and ``fillcolor(colorstring2)`` and analogously if the other input format is used.
es_ar: Equivalente a ``pencolor(colorstring1)`` y ``fillcolor(colorstring2)`` y análogamente si se usa el otro formato de entrada.

source: If turtleshape is a polygon, outline and interior of that polygon is drawn with the newly set colors.
es_ar: Si *turtleshape* es un polígono, la línea y el interior de ese polígono e dibujado con los nuevos colores que se establecieron.

source: See also: Screen method :func:`colormode`.
es_ar: Ver también: Método *Screeen* :func:`colormode`.

source: Return fillstate (``True`` if filling, ``False`` else).
es_ar: Devuelve *fillstate* (``True`` si está lleno, sino ``False``).

source: To be called just before drawing a shape to be filled.
es_ar: Para ser llamada justo antes de dibujar una forma a rellenar.

source: Fill the shape drawn after the last call to :func:`begin_fill`.
es_ar: Rellena la forma dibujada después de última llamada a la función :func:`begin_fill`.

source: Whether or not overlap regions for self-intersecting polygons or multiple shapes are filled depends on the operating system graphics, type of overlap, and number of overlaps. For example, the Turtle star above may be either all yellow or have some white regions.
es_ar: Superponer o no, regiones de polígonos auto-intersectados o múltiples formas, estas son rellenadas dependiendo de los gráficos del sistema operativo, tipo de superposición y número de superposiciones. Por ejemplo, la flecha de la tortuga de arriba, puede ser toda amarilla o tener algunas regiones blancas.

source: Delete the turtle's drawings from the screen, re-center the turtle and set variables to the default values.
es_ar: Borra el dibujo de la tortuga de la pantalla, centra la tortuga y establece las variables a los valores por defecto.

source: Delete the turtle's drawings from the screen. Do not move turtle. State and position of the turtle as well as drawings of other turtles are not affected.
es_ar: Borra el dibujo de la tortuga de la pantalla. No mueve la tortuga. El estado y posición de la tortuga así como los todos los dibujos de las otras tortugas no son afectados.

source: object to be written to the TurtleScreen
es_ar: objeto que se escribirá en *TurtleScreen*

source: one of the strings "left", "center" or right"
es_ar: una de las frases "*left*", "*center*" o "*right*"

source: a triple (fontname, fontsize, fonttype)
es_ar: un trio (nombre de fuente, tamaño de fuente, tipo de fuente)

source: Write text - the string representation of *arg* - at the current turtle position according to *align* ("left", "center" or "right") and with the given font. If *move* is true, the pen is moved to the bottom-right corner of the text. By default, *move* is ``False``.
es_ar: Escribe texto - la representación de cadena de caracteres de *arg* - en la posición actual de la tortuga de acuerdo con *align* ("izquierda", "centro" o "derecha") y con la fuente dada. Si *mov* es verdadero, el lápiz se mueve a la esquina inferior derecha del texto. De forma predeterminada, *move* es ``False``.

source: Make the turtle invisible. It's a good idea to do this while you're in the middle of doing some complex drawing, because hiding the turtle speeds up the drawing observably.
es_ar: Hace invisible a la tortuga, Es una buena idea hacer eso mientras está haciendo dibujos complejos, ya que esconder a la tortuga acelera dibujo de manera observable.

source: Make the turtle visible.
es_ar: Hace visible la tortuga.

source: Return ``True`` if the Turtle is shown, ``False`` if it's hidden.
es_ar: Devuelve ``True`` si la tortuga se muestra, ``False`` si está oculta.

source: a string which is a valid shapename
es_ar: una cadena de caracteres que es un nombre de forma válido

source: Set turtle shape to shape with given *name* or, if name is not given, return name of current shape. Shape with *name* must exist in the TurtleScreen's shape dictionary. Initially there are the following polygon shapes: "arrow", "turtle", "circle", "square", "triangle", "classic". To learn about how to deal with shapes see Screen method :func:`register_shape`.
es_ar: Establece la forma de la tortuga al *name* que se establece o, si no se establece un nombre, devuelve el nombre actual de su forma. La forma *name* debe existir en el diccionario de formas de *TurtleScreen*. Inicialmente están las siguientes formas poligonales: "*arrow*", "*turtle*", "*circle*", "*square*", "*triangle*", "*classic*". Para aprender como trabajar con estas formas ver los métodos de Screen :func:`register_shape`.

source: one of the strings "auto", "user", "noresize"
es_ar: una de las cadenas "*auto*", "*user*", "*noresize*"
