Repository: python/python-docs-es
Catalog: library/turtle.po
Languages: es_ar

source: Set resizemode to one of the values: "auto", "user", "noresize". If *rmode* is not given, return current resizemode. Different resizemodes have the following effects:
es_ar: Establece *resizemode* a alguno de los valores: "*auto*", "*user*", "*noresize*". Si *mode* no se aporta, devuelve el actual *resizemode*. Distintos *resizemode* tienen los siguientes efectos:

source: "auto": adapts the appearance of the turtle corresponding to the value of pensize.
es_ar: "*auto*": adapta la apariencia de la tortuga al correspondiente valor del lápiz.

source: "user": adapts the appearance of the turtle according to the values of stretchfactor and outlinewidth (outline), which are set by :func:`shapesize`.
es_ar: "*user*": adapta la apariencia de la tortuga de acuerdo a los valores de *sretchfactor* y *outlinewidth* (contorno), que se establece con la función :func:`shapesize`.

source: "noresize": no adaption of the turtle's appearance takes place.
es_ar: "*noresize*": no se adapta la apariencia de la tortuga.

source: ``resizemode("user")`` is called by :func:`shapesize` when used with arguments.
es_ar: ``resizemode("user")`` es llamado por la función :func:`shapesize` cuando se usa con argumentos.

source: positive number
es_ar: número positivo

source: number (optional)
es_ar: número (opcional)

source: Set or return the current shearfactor. Shear the turtleshape according to the given shearfactor shear, which is the tangent of the shear angle. Do *not* change the turtle's heading (direction of movement). If shear is not given: return the current shearfactor, i. e. the tangent of the shear angle, by which lines parallel to the heading of the turtle are sheared.
es_ar: Establece o devuelve el valor actual del estiramiento. Estira la forma de la tortuga de acuerdo a la inclinación del factor de corte, que es la tangente del ángulo de corte. No cambia el rumbo de la tortuga (dirección del movimiento). Si no de da un valor de inclinación: devuelve el factor actual, por ejemplo la tangente del ángulo de inclinación, por el cual se cortan la líneas paralelas al rumbo de la tortuga.

source: Rotate the turtleshape by *angle* from its current tilt-angle, but do *not* change the turtle's heading (direction of movement).
es_ar: Rota la forma de la tortuga en *ángulo* desde su ángulo de inclinación actual, pero no cambia el rumbo de la tortuga (dirección del movimiento).

source: Rotate the turtleshape to point in the direction specified by *angle*, regardless of its current tilt-angle. *Do not* change the turtle's heading (direction of movement).
es_ar: Rota la forma de la tortuga apuntando en la dirección especificada por el *ángulo*, independientemente de su ángulo de dirección actual. No cambia el rumbo de la tortuga (dirección de movimiento).

source: a number (optional)
es_ar: un número (opcional)

source: Set or return the current tilt-angle. If angle is given, rotate the turtleshape to point in the direction specified by angle, regardless of its current tilt-angle. Do *not* change the turtle's heading (direction of movement). If angle is not given: return the current tilt-angle, i. e. the angle between the orientation of the turtleshape and the heading of the turtle (its direction of movement).
es_ar: Establece o devuelve el ángulo de inclinación actual. Si se otorga un ángulo, rota la forma de la tortuga para apuntar en la dirección del ángulo especificado, independientemente de su actual ángulo de inclinación. No cambia el rumbo de la tortuga (dirección del movimiento). Si no se da el ángulo: devuelve el ángulo de inclinación actual, por ejemplo: el ángulo entre la orientación de la forma de la tortuga y el rumbo de la tortuga (su dirección de movimiento).

source: Set or return the current transformation matrix of the turtle shape.
es_ar: Establece o devuelve la matriz de transformación actual de la forma de la tortuga.

source: If none of the matrix elements are given, return the transformation matrix as a tuple of 4 elements. Otherwise set the given elements and transform the turtleshape according to the matrix consisting of first row t11, t12 and second row t21, t22. The determinant t11 * t22 - t12 * t21 must not be zero, otherwise an error is raised. Modify stretchfactor, shearfactor and tiltangle according to the given matrix.
es_ar: Si no se proporciona ninguno de los elementos de la matriz, retorna la matriz de transformación como una tupla de 4 elementos. De lo contrario, establezca los elementos dados y transforme la forma de tortuga de acuerdo con la matriz que consta de la primera fila t11, t12 y la segunda fila t21, t22. El determinante t11 * t22 - t12 * t21 no debe ser cero, de lo contrario se genera un error. Modifique el factor de estiramiento, el factor de corte y el ángulo de inclinación de acuerdo con la matriz dada.

source: Return the current shape polygon as tuple of coordinate pairs. This can be used to define a new shape or components of a compound shape.
es_ar: Devuelve el polígono de la forma actual como tupla de pares de coordenadas. Esto puede ser usado para definir una nueva forma o componentes de una forma compuesta.

source: a function with two arguments which will be called with the coordinates of the clicked point on the canvas
es_ar: una función con dos argumentos que se invocará con las coordenadas del punto en el que se hizo clic en el lienzo

source: number of the mouse-button, defaults to 1 (left mouse button)
es_ar: número del botón del mouse, el valor predeterminado es 1 (botón izquierdo del mouse)

source: ``True`` or ``False`` -- if ``True``, a new binding will be added, otherwise it will replace a former binding
es_ar: ``True`` o ``False`` -- si es ``True``, se agrega un nuevo enlace, de lo contrario reemplazará el enlace anterior

source: Bind *fun* to mouse-click events on this turtle. If *fun* is ``None``, existing bindings are removed. Example for the anonymous turtle, i.e. the procedural way:
es_ar: Enlaza *acciones divertidas* a eventos de click en la tortuga. Si la *accion* es ``None``, las acciones asociadas son borradas. Ejemplo para la tortuga anónima, en la forma procedimental:

source: Bind *fun* to mouse-button-release events on this turtle. If *fun* is ``None``, existing bindings are removed.
es_ar: Enlaza *acciones divertidas* a eventos del tipo soltar botón del mouse en la tortuga. SI la *acción* es ``None``, las acciones asociadas son borradas.

source: Bind *fun* to mouse-move events on this turtle. If *fun* is ``None``, existing bindings are removed.
es_ar: Enlaza *acciones divertidas* a eventos en los movimientos del mouse. Si la *acción* es ``None``, las acciones asociadas son borradas.

source: Remark: Every sequence of mouse-move-events on a turtle is preceded by a mouse-click event on that turtle.
es_ar: Observación: cada secuencia de los eventos de movimiento del mouse en una tortuga es precedida por un evento de click del mouse en esa tortuga.

source: Subsequently, clicking and dragging the Turtle will move it across the screen thereby producing handdrawings (if pen is down).
es_ar: Subsecuentemente, clickear y arrastrar la Tortuga la moverá a través de la pantalla produciendo dibujos a mano alzada (si el lápiz está abajo).

source: Start recording the vertices of a polygon. Current turtle position is first vertex of polygon.
es_ar: Comienza a grabar los vértices de un polígono. La posición actual de la tortuga es el primer vértice del polígono.

source: Stop recording the vertices of a polygon. Current turtle position is last vertex of polygon. This will be connected with the first vertex.
es_ar: Deja de grabar los vértices de un polígono. La posición actual de la tortuga es el último vértice del polígono. Esto se conectará con el primer vértice.

source: Return the last recorded polygon.
es_ar: Devuelve el último polígono grabado.

source: Create and return a clone of the turtle with same position, heading and turtle properties.
es_ar: Crea y devuelve un clon de la tortuga con la misma posición, dirección y propiedades de la tortuga.

source: Return the Turtle object itself. Only reasonable use: as a function to return the "anonymous turtle":
es_ar: Devuelve el objeto Tortuga en si. El único uso razonable: es como una función para devolver la "tortuga anónima":

source: Return the :class:`TurtleScreen` object the turtle is drawing on. TurtleScreen methods can then be called for that object.
es_ar: Devuelve el objeto :class:`TurtleScreen` sobre el cual la tortuga está dibujando. Los métodos *TurtleScreen* luego pueden ser llamados para ese objeto.

source: an integer or ``None``
es_ar: un entero o ``None``

source: Set or disable undobuffer. If *size* is an integer, an empty undobuffer of given size is installed. *size* gives the maximum number of turtle actions that can be undone by the :func:`undo` method/function. If *size* is ``None``, the undobuffer is disabled.
es_ar: Establecer o deshabilitar deshacer búfer. Si *size* es un número entero, se instala un búfer de deshacer vacío de un tamaño determinado. *size* da el número máximo de acciones de tortuga que se pueden deshacer mediante el método/función :func:`undo`. Si *size* es ``None``, el búfer para deshacer está deshabilitado.

source: Return number of entries in the undobuffer.
es_ar: Devuelve el número de entradas en el buffer para deshacer acciones.

source: Compound shapes
es_ar: Formas compuestas

source: To use compound turtle shapes, which consist of several polygons of different color, you must use the helper class :class:`Shape` explicitly as described below:
es_ar: Para usar formas complejas con la tortuga, que consiste en varios polígonos de diferentes colores, deberá usar la clase de ayuda :class:`Shape` explícitamente como se describe debajo:

source: Create an empty Shape object of type "compound".
es_ar: Crear una objeto de forma vacía del tipo *compound*.

source: For example:
es_ar: Por ejemplo:

source: Now add the Shape to the Screen's shapelist and use it:
es_ar: Ahora agregar la forma a la lista de formas de la pantalla y úsela:

source: The :class:`Shape` class is used internally by the :func:`register_shape` method in different ways. The application programmer has to deal with the Shape class *only* when using compound shapes like shown above!
es_ar: La clase :class:`Shape` es usada internamente por el método :func:`register_shape` en maneras diferentes. El programador deberá lidiar con la clase *Shape* ¡solo cuando use formas compuestas como las que se mostraron arriba!

source: Methods of TurtleScreen/Screen and corresponding functions
es_ar: Métodos de *TurtleScreen/Screen* y sus correspondientes funciones

source: Most of the examples in this section refer to a TurtleScreen instance called ``screen``.
es_ar: La mayoría de los ejemplos en esta sección se refieren a la instancia de *TurtleScreen* llamada ``screen``.

source: a color string or three numbers in the range 0..colormode or a 3-tuple of such numbers
es_ar: una cadena de color o tres números en el rango 0..*colormode* o una tupla de 3 de esos números

source: Set or return background color of the TurtleScreen.
es_ar: Establece o devuelve el color de fondo de *TurtleScreen*.

source: a string, name of a gif-file or ``"nopic"``, or ``None``
es_ar: una cadena, nombre o archivo gif o ``"nopic"``, o ``None``

source: Set background image or return name of current backgroundimage. If *picname* is a filename, set the corresponding image as background. If *picname* is ``"nopic"``, delete background image, if present. If *picname* is ``None``, return the filename of the current backgroundimage. ::
es_ar: Establece la imagen de fondo o devuelve el nombre de la imagen de fondo actual. Si *picname* es un nombre de archivo, establece la imagen correspondiente como fondo. Si *picname* es ``"nopic"``, borra la imagen de fondo, si hay alguna presente. Si *picname* es ``None``, devuelve el nombre de archivo de la imagen de fondo actual. ::

source: This TurtleScreen method is available as a global function only under the name ``clearscreen``. The global function ``clear`` is a different one derived from the Turtle method ``clear``.
es_ar: Este método de *TurtleScreen* está disponible como una función global solo bajo el nombre ``clearscreen``. La función global ``clear`` es otra, derivada del método de *Turtle* ``clear``.

source: Delete all drawings and all turtles from the TurtleScreen. Reset the now empty TurtleScreen to its initial state: white background, no background image, no event bindings and tracing on.
es_ar: Borra todos los dibujos y todas las tortugas del la pantalla de la tortuga. Reinicia la ahora vacía pantalla de la tortuga a su estado inicial: fondo blanco, sin imagen de fondo, sin enlaces a eventos o seguimientos.

source: This TurtleScreen method is available as a global function only under the name ``resetscreen``. The global function ``reset`` is another one derived from the Turtle method ``reset``.
es_ar: Este método *TurtleScreen* esta disponible como una función global solo bajo el nombre ``resetscreen``. La función global ``reset`` es otra, derivada del método *Turtle* ``reset``.

source: Reset all Turtles on the Screen to their initial state.
es_ar: Reinicia todas las tortugas de la pantalla a su estado inicial.

source: positive integer, new width of canvas in pixels
es_ar: entero positivo, nueva anchura del lienzo en pixeles

source: positive integer, new height of canvas in pixels
es_ar: entero positivo, nueva altura del lienzo en pixeles

source: colorstring or color-tuple, new background color
es_ar: *colorstrng* o tupla de color, muevo color de fondo

source: If no arguments are given, return current (canvaswidth, canvasheight). Else resize the canvas the turtles are drawing on. Do not alter the drawing window. To observe hidden parts of the canvas, use the scrollbars. With this method, one can make visible those parts of a drawing which were outside the canvas before.
es_ar: Si no se dan argumentos, devuelve el actual (ancho y alto del lienzo). Sino redimensiona el lienzo en el que la tortuga está dibujando. No altera la ventana de dibujo. Para ver las partes ocultas del lienzo, use la barra de desplazamiento. Con este método, se pueden hacer visibles aquellas partes de un dibujo que antes estaban fuera del lienzo.

source: e.g. to search for an erroneously escaped turtle ;-)
es_ar: ej. buscar una tortuga que se escapó por error ;-)

source: a number, x-coordinate of lower left corner of canvas
es_ar: un número, coordenada x de la esquina inferior izquierda del lienzo

source: a number, y-coordinate of lower left corner of canvas
es_ar: un número, coordenada y de la esquina inferior izquierda del lienzo

source: a number, x-coordinate of upper right corner of canvas
es_ar: un número, coordenada x de la esquina superior derecha del lienzo

source: a number, y-coordinate of upper right corner of canvas
es_ar: un número, coordenada z de la esquina superior derecha del lienzo

source: Set up user-defined coordinate system and switch to mode "world" if necessary. This performs a ``screen.reset()``. If mode "world" is already active, all drawings are redrawn according to the new coordinates.
es_ar: Configura coordenadas definidas por el usuario y cambia al modo *world* si es necesario. Esto realiza un ``screen.reset()``. Si el modo *world* ya está activo, todos los dibujos se re dibujan de acuerdo a las nuevas coordenadas.

source: **ATTENTION**: in user-defined coordinate systems angles may appear distorted.
es_ar: **ATENCIÓN**: en los sistemas de coordenadas definidos por el usuario, los ángulos pueden aparecer distorsionados.

source: positive integer
es_ar: entero positivo

source: Set or return the drawing *delay* in milliseconds. (This is approximately the time interval between two consecutive canvas updates.) The longer the drawing delay, the slower the animation.
es_ar: Establece o retorna el *retraso* del dibujo en mili segundos. ( Este es aproximadamente, el tiempo de intervalo entre dos actualizaciones consecutivas del lienzo). Mientras más largo sea el retraso, más lenta la animación.

source: Optional argument:
es_ar: Argumento opcional:

source: nonnegative integer
es_ar: entero no negativo

source: Turn turtle animation on/off and set delay for update drawings. If *n* is given, only each n-th regular screen update is really performed. (Can be used to accelerate the drawing of complex graphics.) When called without arguments, returns the currently stored value of n. Second argument sets delay value (see :func:`delay`).
es_ar: Activa o desactiva la animación de la tortuga y establece el retraso para la actualización de los dibujos. Si se da *n*, solo cada enésima actualización regular de pantalla se realiza realmente. (Puede usarse para acelerar los dibujos de gráficos complejos). Cuando es llamada sin argumentos, devuelve el valor de *n* guardado actualmente. El segundo argumento establece el valor de retraso (ver :func:`delay`).

source: Perform a TurtleScreen update. To be used when tracer is turned off.
es_ar: Realiza una actualización de la pantalla de la tortuga. Para ser usada cuando *tracer* está deshabilitada.

source: See also the RawTurtle/Turtle method :func:`speed`.
es_ar: Ver también el método *RawTurtle/Turtle* :func:`speed`.

source: Set focus on TurtleScreen (in order to collect key-events). Dummy arguments are provided in order to be able to pass :func:`listen` to the onclick method.
es_ar: Establece el foco en la pantalla de la tortuga (para recoger eventos de teclado). Los argumentos *dummy* se proveen en orden de ser capaces de pasar :func:`listen` a los métodos *onclick*.

source: a function with no arguments or ``None``
es_ar: una función sin argumentos o ``None``

source: a string: key (e.g. "a") or key-symbol (e.g. "space")
es_ar: una cadena de caracteres: tecla (por ejemplo, "a") o una acción del teclado (por ejemplo, "space")

source: Bind *fun* to key-release event of key. If *fun* is ``None``, event bindings are removed. Remark: in order to be able to register key-events, TurtleScreen must have the focus. (See method :func:`listen`.)
es_ar: Vincula *fun* a un evento de liberación de una tecla. Si *fun* es ``None``, los eventos vinculados son removidos. Aclaración: para poder registrar eventos de teclado, *TurtleScreen* tiene que tener el foco. (ver el método :func:`listen`.)

source: Bind *fun* to key-press event of key if key is given, or to any key-press-event if no key is given. Remark: in order to be able to register key-events, TurtleScreen must have focus. (See method :func:`listen`.)
es_ar: Vincula *fun* a un evento de pulsado de una tecla, o a cualquier evento de pulsado de tecla si no se da una. Aclaración: para poder registrar eventos de teclado, *TurtleScreen* tiene que tener el foco. (ver el método :func:`listen`.)

source: Bind *fun* to mouse-click events on this screen. If *fun* is ``None``, existing bindings are removed.
es_ar: Vincula *fun* a eventos de click del mouse en esta pantalla. Si *fun* es ``None``, los vínculos existentes son removidos.

source: Example for a TurtleScreen instance named ``screen`` and a Turtle instance named ``turtle``:
es_ar: Ejemplo de una instancia TurtleScreen llamada ``screen`` y una instancia Turtle llamada ``turtle``:

source: This TurtleScreen method is available as a global function only under the name ``onscreenclick``. The global function ``onclick`` is another one derived from the Turtle method ``onclick``.
es_ar: Este método *TurtleScreen* está disponible como una función global solo bajo el nombre ``onscreenclick``. La función global ``onclick`` es otra derivada del método Turtle ``onclick``.

source: a function with no arguments
es_ar: una función sin argumentos

source: a number >= 0
es_ar: un número >= 0

source: Install a timer that calls *fun* after *t* milliseconds.
es_ar: Instala un temporizador que llama a *fun* cada *t* milisegundos.

source: Starts event loop - calling Tkinter's mainloop function. Must be the last statement in a turtle graphics program. Must *not* be used if a script is run from within IDLE in -n mode (No subprocess) - for interactive use of turtle graphics. ::
es_ar: Comienza un bucle de evento - llamando a la función *mainloop* del *Tkinter*. Debe ser la última declaración en un programa gráfico de turtle. *No* debe ser usado si algún script es corrido dentro del IDLE en modo -n (Sin subproceso) - para uso interactivo de gráficos turtle.::

source: string
es_ar: cadena de caracteres

source: Pop up a dialog window for input of a string. Parameter title is the title of the dialog window, prompt is a text mostly describing what information to input. Return the string input. If the dialog is canceled, return ``None``. ::
es_ar: Abre una ventana de diálogo para ingresar una cadena de caracteres. El parámetro *title* es el título de la ventana de diálogo, *prompt* es un texto que usualmente describe que información se debe ingresar. Devuelve la cadena ingresada. Si el diálogo es cancelado, devuelve ``None``. ::

source: one of the strings "standard", "logo" or "world"
es_ar: una de las cadenas *"standard"*, *"logo*" o *"world*"

source: Set turtle mode ("standard", "logo" or "world") and perform reset. If mode is not given, current mode is returned.
es_ar: Establece el mode de la tortuga (*"standard"*, *"logo"* o *"world"*) y realiza un reinicio. Si no se da "*mode*", retorna el modo actual.

source: Mode "standard" is compatible with old :mod:`turtle`. Mode "logo" is compatible with most Logo turtle graphics. Mode "world" uses user-defined "world coordinates". **Attention**: in this mode angles appear distorted if ``x/y`` unit-ratio doesn't equal 1.
es_ar: El modo *"standard"* es compatible con el antiguo :mod:`turtle`. El modo *"logo"* es compatible con la mayoría de los gráficos de tortuga Logo. El modo *"world"* usa coordenadas de mundo definidas por el usuario. **Atención**: en este modo los ángulos aparecen distorsionados si la relación de unidad ``x/y`` no es igual a 1.

source: Mode
es_ar: Modo

source: Initial turtle heading
es_ar: Rumbo inicial de la tortuga

source: positive angles
es_ar: ángulos positivos

source: to the right (east)
es_ar: hacia la derecha (este)

source: counterclockwise
es_ar: sentido antihorario

source: upward (north)
es_ar: hacia arriba (norte)

source: clockwise
es_ar: sentido horario

source: one of the values 1.0 or 255
es_ar: uno de los valores 1.0 o 255

source: Return the Canvas of this TurtleScreen. Useful for insiders who know what to do with a Tkinter Canvas.
es_ar: Devuelve el lienzo de este *TurtleScreen*. Útil para conocedores que saben que hace con un *TKinter* *Canvas*.

source: Return a list of names of all currently available turtle shapes.
es_ar: Devuelve la lista de nombres de todas las formas de la tortuga actualmente disponibles.

source: There are three different ways to call this function:
es_ar: Hay tres formas distintas de llamar a esta función:

source: *name* is the name of a gif-file and *shape* is ``None``: Install the corresponding image shape. ::
es_ar: *name* es el nombre de un archivo gif y *shape* es ``None``: instala la imagen correspondiente. ::

source: Image shapes *do not* rotate when turning the turtle, so they do not display the heading of the turtle!
es_ar: Las imágenes de tipo *shapes* no rotan cuando la tortuga gira, así que ellas ¡no muestran el rumbo de la tortuga!

source: *name* is an arbitrary string and *shape* is a tuple of pairs of coordinates: Install the corresponding polygon shape.
es_ar: *name* es una cadena de caracteres arbitraria y *shape* es una tupla de pares de coordenadas: Instala la forma poligonal correspondiente.
