Repository: python/python-docs-es
Catalog: library/turtle.po
Languages: es_ar

source: Add a turtle shape to TurtleScreen's shapelist. Only thusly registered shapes can be used by issuing the command ``shape(shapename)``.
es_ar: Agregar una forma de tortuga a la lista de formas de *TurtleScreen*. Solo las formas registradas de esta manera pueden ser usadas invocando el comando ``shape(shapename)``.

source: Return the list of turtles on the screen.
es_ar: Devuelve la lista de tortugas en la pantalla.

source: Return the height of the turtle window. ::
es_ar: Devuelve la altura de la ventana de la tortuga. ::

source: Return the width of the turtle window. ::
es_ar: Devuelve el ancho de la ventana de la tortuga. ::

source: Methods specific to Screen, not inherited from TurtleScreen
es_ar: Métodos específicos de *Screen*, no heredados de *TurtleScreen*

source: Shut the turtlegraphics window.
es_ar: Apaga la ventana gráfica de la tortuga.

source: Bind ``bye()`` method to mouse clicks on the Screen.
es_ar: Ata el método ``bye()`` al click del ratón sobre la pantalla.

source: If the value "using_IDLE" in the configuration dictionary is ``False`` (default value), also enter mainloop. Remark: If IDLE with the ``-n`` switch (no subprocess) is used, this value should be set to ``True`` in :file:`turtle.cfg`. In this case IDLE's own mainloop is active also for the client script.
es_ar: Si el valor *"using_IDLE"* en la configuración del diccionario es ``False`` (valor por defecto), también ingresa *mainloop*. Observaciones: si se usa la *IDLE* con el modificador (no subproceso) ``-n``, este valor debe establecerse a ``True`` en :file:`turtle.cfg`. En este caso el propio *mainloop* de la *IDLE* está activa también para script cliente.

source: Set the size and position of the main window. Default values of arguments are stored in the configuration dictionary and can be changed via a :file:`turtle.cfg` file.
es_ar: Establece el tamaño y la posición de la ventana principal. Los valores por defecto de los argumentos son guardados en el diccionario de configuración y puede ser cambiado a través del archivo :file:`turtle.cfg`.

source: if an integer, a size in pixels, if a float, a fraction of the screen; default is 50% of screen
es_ar: si es un entero, el tamaño en pixeles, si es un número flotante, una fracción de la pantalla; el valor por defecto es 50% de la pantalla

source: if an integer, the height in pixels, if a float, a fraction of the screen; default is 75% of screen
es_ar: si es un entero, la altura en pixeles, si es un número flotante, una fracción de la pantalla; el valor por defecto es 75% de la pantalla

source: if positive, starting position in pixels from the left edge of the screen, if negative from the right edge, if ``None``, center window horizontally
es_ar: si es positivo, punto de inicio en pixeles desde la esquina izquierda de la pantalla, si es negativo desde la esquina derecha de la pantalla, si es ``None``, centra la ventana horizontalmente

source: if positive, starting position in pixels from the top edge of the screen, if negative from the bottom edge, if ``None``, center window vertically
es_ar: si es positivo, punto de inicio en pixeles desde la parte superior de la pantalla, si es negativo desde la parte inferior de la pantalla, si es ``None``, centra la ventana verticalmente

source: a string that is shown in the titlebar of the turtle graphics window
es_ar: una cadena de caracteres que se muestra en la barra de título de la ventana gráfica de la tortuga

source: Set title of turtle window to *titlestring*.
es_ar: Establece el título de la ventana de la tortuga a *titlestring*.

source: Public classes
es_ar: Clases públicas

source: Create a turtle. The turtle has all methods described above as "methods of Turtle/RawTurtle".
es_ar: Crea una tortuga. La tortuga tiene todos los métodos descriptos anteriormente como "métodos de *"Turtle/RawTurtle"*.

source: Subclass of RawTurtle, has the same interface but draws on a default :class:`Screen` object created automatically when needed for the first time.
es_ar: Subclase de *RawTurtle*, tiene la misma interface pero dibuja sobre una objeto por defecto :class:`Screen` creado automáticamente cuando es necesario por primera vez.

source: Subclass of TurtleScreen, with :ref:`four methods added <screenspecific>`.
es_ar: Subclase de *TurtleScreen*, con :ref:`cuatro métodos agregados <screenspecific>`.

source: some Tkinter widget to contain the ScrolledCanvas, i.e. a Tkinter-canvas with scrollbars added
es_ar: algunos *widgets* *TKinter* para contener el *ScrollCanvas*, por ejemplo un lienzo *Tkinter* con barras de desplazamiento agregadas

source: Used by class Screen, which thus automatically provides a ScrolledCanvas as playground for the turtles.
es_ar: Usado por la clase *Screen*, que proporciona automáticamente un *ScrolledCanvas* como espacio de trabajo para las tortugas.

source: one of the strings "polygon", "image", "compound"
es_ar: una de las cadenas de caracteres *"polygon"*, *"image"*, *"compound"*

source: Data structure modeling shapes. The pair ``(type_, data)`` must follow this specification:
es_ar: Estructura de datos que modela las formas. El par ``(type_, data)`` debe seguir estas especificaciones:

source: a polygon-tuple, i.e. a tuple of pairs of coordinates
es_ar: una tupla para el polígono, por ejemplo: una tupla de par de coordenadas

source: an image (in this form only used internally!)
es_ar: una imagen (en esta forma solo se usa ¡internamente!)

source: ``None`` (a compound shape has to be constructed using the :meth:`addcomponent` method)
es_ar: ``None`` (una forma compuesta tiene que ser construida usando el método :meth:`addcomponent`)

source: a polygon, i.e. a tuple of pairs of numbers
es_ar: un polígono, por ejemplo una tupla de pares de números

source: a color the *poly* will be filled with
es_ar: un color con el que el polígono será llenado

source: a color for the poly's outline (if given)
es_ar: un color con el que se delineará el polígono (se de ingresa)

source: Example:
es_ar: Ejemplo:

source: See :ref:`compoundshapes`.
es_ar: Ver :ref:`compoundshapes`.

source: A two-dimensional vector class, used as a helper class for implementing turtle graphics. May be useful for turtle graphics programs too. Derived from tuple, so a vector is a tuple!
es_ar: Una clase de vectores bidimensionales, usado como clase de ayuda para implementar gráficos de tortuga. Puede ser útil para los programas de gráficos de tortugas también. Derivado de la tupla, ¡por lo que un vector es una tupla!

source: Provides (for *a*, *b* vectors, *k* number):
es_ar: Proporciona (para *a*, *b* vectores, *k* números)

source: ``a + b`` vector addition
es_ar: ``a + b`` suma de vectores

source: ``a - b`` vector subtraction
es_ar: ``a - b`` resta de vectores

source: ``a * b`` inner product
es_ar: ``a * b`` producto interno

source: ``k * a`` and ``a * k`` multiplication with scalar
es_ar: ``k * a`` y ``a * k`` multiplicación con escalar

source: ``abs(a)`` absolute value of a
es_ar: ``abs(a)`` valor absoluto de a

source: ``a.rotate(angle)`` rotation
es_ar: ``a.rotate(angle)`` rotación

source: Help and configuration
es_ar: Ayuda y configuración

source: How to use help
es_ar: Cómo usar la ayuda

source: The public methods of the Screen and Turtle classes are documented extensively via docstrings. So these can be used as online-help via the Python help facilities:
es_ar: Los métodos públicos de las clases Screen y Turtle están ampliamente documentados a través de cadenas de documentación. Por lo tanto, estos se pueden usar como ayuda en línea a través de las instalaciones de ayuda de Python:

source: When using IDLE, tooltips show the signatures and first lines of the docstrings of typed in function-/method calls.
es_ar: Cuando se usa IDLE, la información sobre herramientas muestra las firmas y las primeras líneas de las cadenas de documentos de las llamadas de función/método escritas.

source: Calling :func:`help` on methods or functions displays the docstrings::
es_ar: Llamar a :func:`help` en métodos o funciones muestra los docstrings::

source: The docstrings of the functions which are derived from methods have a modified form::
es_ar: Los docstrings de las funciones que se derivan de los métodos tienen una forma modificada::

source: These modified docstrings are created automatically together with the function definitions that are derived from the methods at import time.
es_ar: Estos docstrings modificados se crean automáticamente junto con las definiciones de función que se derivan de los métodos en el momento de la importación.

source: Translation of docstrings into different languages
es_ar: Traducción de cadenas de documentos a diferentes idiomas

source: There is a utility to create a dictionary the keys of which are the method names and the values of which are the docstrings of the public methods of the classes Screen and Turtle.
es_ar: Existe una utilidad para crear un diccionario cuyas claves son los nombres de los métodos y cuyos valores son los docstrings de los métodos públicos de las clases Screen y Turtle.

source: a string, used as filename
es_ar: una cadena de caracteres, utilizada como nombre de archivo

source: Create and write docstring-dictionary to a Python script with the given filename. This function has to be called explicitly (it is not used by the turtle graphics classes). The docstring dictionary will be written to the Python script :file:`{filename}.py`. It is intended to serve as a template for translation of the docstrings into different languages.
es_ar: Crea y escribe un diccionario-docstring en un script de Python con el nombre de archivo dado. Esta función tiene que ser llamada explícitamente (no es utilizada por las clases de gráficos de tortugas). El diccionario de docstrings se escribirá en el script de Python :file:`{filename}.py`. Está destinado a servir como plantilla para la traducción de las cadenas de documentos a diferentes idiomas.

source: If you (or your students) want to use :mod:`turtle` with online help in your native language, you have to translate the docstrings and save the resulting file as e.g. :file:`turtle_docstringdict_german.py`.
es_ar: Si usted (o sus estudiantes) desea utilizar :mod:`turtle` con ayuda en línea en su idioma nativo, debe traducir los docstrings y guardar el archivo resultante como, por ejemplo, :file:`turtle_docstringdict_german.py`.

source: If you have an appropriate entry in your :file:`turtle.cfg` file this dictionary will be read in at import time and will replace the original English docstrings.
es_ar: Si tiene una entrada adecuada en su archivo :file:`turtle.cfg`, este diccionario se leerá en el momento de la importación y reemplazará los docstrings originales en inglés.

source: At the time of this writing there are docstring dictionaries in German and in Italian. (Requests please to glingl@aon.at.)
es_ar: En el momento de escribir este artículo, existen diccionarios de docstrings en alemán e italiano. (Solicitudes por favor a glingl@aon.at.)

source: How to configure Screen and Turtles
es_ar: Cómo configurar Screen and Turtles

source: The built-in default configuration mimics the appearance and behaviour of the old turtle module in order to retain best possible compatibility with it.
es_ar: La configuración predeterminada incorporada imita la apariencia y el comportamiento del antiguo módulo de tortuga para mantener la mejor compatibilidad posible con él.

source: If you want to use a different configuration which better reflects the features of this module or which better fits to your needs, e.g. for use in a classroom, you can prepare a configuration file ``turtle.cfg`` which will be read at import time and modify the configuration according to its settings.
es_ar: Si desea utilizar una configuración diferente que refleje mejor las características de este módulo o que se adapte mejor a sus necesidades, por ejemplo, para su uso en un aula, puede preparar un archivo de configuración ``turtle.cfg`` que se leerá en el momento de la importación y modificará la configuración de acuerdo con su configuración.

source: Short explanation of selected entries:
es_ar: Breve explicación de las entradas seleccionadas:

source: *shape* can be any of the built-in shapes, e.g: arrow, turtle, etc. For more info try ``help(shape)``.
es_ar: *shape* puede ser cualquiera de las formas integradas, por ejemplo: arrow, turtle, etc. Para obtener más información, pruebe con ``help(shape)``.

source: If you want to reflect the turtle its state, you have to use ``resizemode = auto``.
es_ar: Si desea reflejar el estado de la tortuga, debe usar ``resizemode = auto``.

source: The entries *exampleturtle* and *examplescreen* define the names of these objects as they occur in the docstrings. The transformation of method-docstrings to function-docstrings will delete these names from the docstrings.
es_ar: Las entradas *exampleturtle* y *examplescreen* definen los nombres de estos objetos a medida que aparecen en las cadenas de documentos. La transformación de método-docstrings en función-docstrings eliminará estos nombres de las docstrings.

source: There can be a :file:`turtle.cfg` file in the directory where :mod:`turtle` is stored and an additional one in the current working directory. The latter will override the settings of the first one.
es_ar: Puede haber un archivo :file:`turtle.cfg` en el directorio donde se almacena :mod:`turtle` y uno adicional en el directorio de trabajo actual. Este último anulará la configuración del primero.

source: The :file:`Lib/turtledemo` directory contains a :file:`turtle.cfg` file. You can study it as an example and see its effects when running the demos (preferably not from within the demo-viewer).
es_ar: El directorio :file:`Lib/turtledemo` contiene un archivo :file:`turtle.cfg`. Puede estudiarlo como un ejemplo y ver sus efectos al ejecutar las demostraciones (preferiblemente no desde el visor de demostraciones).

source: :mod:`turtledemo` --- Demo scripts
es_ar: :mod:`turtledemo` --- Scripts de demostración

source: The :mod:`turtledemo` package includes a set of demo scripts. These scripts can be run and viewed using the supplied demo viewer as follows::
es_ar: El paquete :mod:`turtledemo` incluye un conjunto de scripts de demostración. Estos scripts se pueden ejecutar y visualizar utilizando el visor de demostración suministrado de la siguiente manera::

source: Alternatively, you can run the demo scripts individually. For example, ::
es_ar: Alternativamente, puede ejecutar los scripts de demostración individualmente. Por ejemplo, ::

source: The :mod:`turtledemo` package directory contains:
es_ar: El directorio del paquete :mod:`turtledemo` contiene:

source: A demo viewer :file:`__main__.py` which can be used to view the sourcecode of the scripts and run them at the same time.
es_ar: Un visor de demostración :file:`__main__.py` que se puede utilizar para ver el código fuente de los scripts y ejecutarlos al mismo tiempo.

source: Multiple scripts demonstrating different features of the :mod:`turtle` module. Examples can be accessed via the Examples menu. They can also be run standalone.
es_ar: Múltiples scripts que demuestran diferentes características del módulo :mod:`turtle`. Se puede acceder a los ejemplos a través del menú de ejemplos. También se pueden ejecutar de forma independiente.

source: A :file:`turtle.cfg` file which serves as an example of how to write and use such files.
es_ar: Un archivo :file:`turtle.cfg` que sirve como ejemplo de cómo escribir y usar dichos archivos.

source: The demo scripts are:
es_ar: Los scripts de demostración son:

source: Name
es_ar: Nombre

source: Description
es_ar: Descripción

source: Features
es_ar: Características

source: complex classical turtle graphics pattern
es_ar: patrón de gráficos de tortuga clásica compleja

source: :func:`tracer`, delay, :func:`update`
es_ar: :func:`tracer`, retrasar (*delay*), :func:`update`

source: chaos
es_ar: caos

source: graphs Verhulst dynamics, shows that computer's computations can generate results sometimes against the common sense expectations
es_ar: gráficos dinámicos de Verhulst, muestra que los cálculos de la computadora pueden generar resultados a veces contra las expectativas del sentido común

source: world coordinates
es_ar: coordenadas mundiales

source: clock
es_ar: reloj

source: analog clock showing time of your computer
es_ar: reloj analógico que muestra la hora de su computadora

source: turtles as clock's hands, ontimer
es_ar: tortugas como manecillas de reloj, temporizador

source: experiment with r, g, b
es_ar: experimento con r, g, b

source: forest
es_ar: bosque

source: 3 breadth-first trees
es_ar: 3 árboles de ancho primero

source: randomization
es_ar: aleatorización

source: Hilbert & Koch curves
es_ar: Curvas Hilbert & Koch

source: recursion
es_ar: recursión

source: ethnomathematics (indian kolams)
es_ar: etnomatemáticas (kolams indios)

source: L-System
es_ar: Sistema-L

source: Towers of Hanoi
es_ar: Torres de Hanoi

source: Rectangular Turtles as Hanoi discs (shape, shapesize)
es_ar: Tortugas rectangulares como discos de Hanoi (shape, tamaño de forma)

source: play the classical nim game with three heaps of sticks against the computer.
es_ar: juega el clásico juego de nim con tres montones de palos contra la computadora.

source: turtles as nimsticks, event driven (mouse, keyboard)
es_ar: tortugas como nimsticks, impulsado por eventos (mouse, teclado)

source: paint
es_ar: pintar

source: super minimalistic drawing program
es_ar: programa de dibujo super minimalista

source: peace
es_ar: paz

source: elementary
es_ar: elemental

source: turtle: appearance and animation
es_ar: turtle: apariencia y animación

source: aperiodic tiling with kites and darts
es_ar: embaldosado aperiódico con cometas y dardos

source: simulation of gravitational system
es_ar: simulación de sistema gravitacional

source: compound shapes, :class:`Vec2D`
es_ar: formas compuestas, :class:`Vec2D`

source: a pattern from the wikipedia article on turtle graphics
es_ar: un patrón del artículo de wikipedia sobre gráficos de tortuga (*turtle*)

source: dancing turtles rotating pairwise in opposite direction
es_ar: tortugas bailarinas que giran por parejas en dirección opuesta

source: compound shapes, clone shapesize, tilt, get_shapepoly, update
es_ar: formas compuestas, clonar tamaño de forma, tilt, get_shapepoly, update

source: visual demonstration of different sorting methods
es_ar: demostración visual de diferentes métodos de ordenamiento

source: simple alignment, randomization
es_ar: alineación simple, aleatorización

source: tree
es_ar: árbol

source: a (graphical) breadth first tree (using generators)
es_ar: un primer árbol de amplitud (gráfico, usando generadores)

source: simple design
es_ar: diseño simple

source: turtles on two canvases
es_ar: tortugas en dos lienzos (*two_canvases*)

source: another elementary example
es_ar: otro ejemplo elemental

source: Have fun!
es_ar: ¡Diviértete!

source: Changes since Python 2.6
es_ar: Cambios desde Python 2.6

source: Changes since Python 3.0
es_ar: Cambios desde Python 3.0

source: Two example scripts :file:`tdemo_nim.py` and :file:`tdemo_round_dance.py` have been added to the :file:`Lib/turtledemo` directory.
es_ar: Se han agregado dos scripts de ejemplo :file:`tdemo_nim.py` y :file:`tdemo_round_dance.py` al directorio :file:`Lib/turtledemo`.
