Repository: python/python-docs-es
Catalog: library/unicodedata.po
Languages: es

source: :mod:`unicodedata` --- Unicode Database
es: :mod:`unicodedata` --- Base de datos Unicode

source: This module provides access to the Unicode Character Database (UCD) which defines character properties for all Unicode characters. The data contained in this database is compiled from the `UCD version 12.1.0 <http://www.unicode.org/Public/12.1.0/ucd>`_.
es: Este módulo proporciona acceso a la base de datos de caracteres Unicode (UCD), que define las propiedades de todos los caracteres Unicode. Los datos contenidos en esta base de datos se compilan a partir de `UCD versión 12.1.0 <http://www.unicode.org/Public/12.1.0/ucd>`_.

source: The module uses the same names and symbols as defined by Unicode Standard Annex #44, `"Unicode Character Database" <https://www.unicode.org/reports/tr44/>`_. It defines the following functions:
es: El módulo utiliza los mismos nombres y símbolos definidos por el Anexo #44 del estándar Unicode de la `"Base de datos de caracteres Unicode" <https://www.unicode.org/reports/tr44/>`_. Define las siguientes funciones:

source: Look up character by name. If a character with the given name is found, return the corresponding character. If not found, :exc:`KeyError` is raised.
es: Busca el carácter por su nombre. Si se encuentra un carácter con el nombre proporcionado, retornará el carácter correspondiente. Si no se encuentra, se lanza una excepción :exc:`KeyError`.

source: Support for name aliases [#]_ and named sequences [#]_ has been added.
es: Se ha agregado soporte para alias de nombre [#]_ y secuencias con nombre [#]_.

source: Returns the name assigned to the character *chr* as a string. If no name is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
es: Retorna el nombre asignado al carácter *chr* como una cadena de caracteres. Si no se define ningún nombre, se retorna *default* o, si no se proporciona, se lanza una excepción :exc:`ValueError`.

source: Returns the decimal value assigned to the character *chr* as integer. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
es: Retorna el valor decimal asignado al carácter *chr* como un entero. Si no se define dicho valor, se retorna *default* o, si no se proporciona, se lanza una excepción :exc:`ValueError`.

source: Returns the digit value assigned to the character *chr* as integer. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
es: Retorna el valor del dígito asignado al carácter *chr* como un entero. Si no se define dicho valor, se retorna *default* o, si no se proporciona, se genera una excepción :exc:`ValueError`.

source: Returns the numeric value assigned to the character *chr* as float. If no such value is defined, *default* is returned, or, if not given, :exc:`ValueError` is raised.
es: Retorna el valor numérico asignado al carácter *chr* como un flotante. Si no se define dicho valor, se retorna *default* o, si no se proporciona, se lanza una excepción :exc:`ValueError`.

source: Returns the general category assigned to the character *chr* as string.
es: Retorna la categoría general asignada al carácter *chr* como una cadena de caracteres.

source: Returns the bidirectional class assigned to the character *chr* as string. If no such value is defined, an empty string is returned.
es: Retorna la clase bidireccional asignada al carácter *chr* como una cadena de caracteres. Si no se define tal valor, se retorna una cadena de caracteres vacía.

source: Returns the canonical combining class assigned to the character *chr* as integer. Returns ``0`` if no combining class is defined.
es: Retorna la clase de combinación canónica asignada al carácter *chr* como un entero. Retorna ``0`` si no se define ninguna clase de combinación.

source: Returns the east asian width assigned to the character *chr* as string.
es: Retorna el ancho asignado al carácter *chr* para el este asiático como una cadena de caracteres.

source: Returns the mirrored property assigned to the character *chr* as integer. Returns ``1`` if the character has been identified as a "mirrored" character in bidirectional text, ``0`` otherwise.
es: Retorna la propiedad reflejada asignada al carácter *chr* como un entero. Retorna ``1`` si el carácter se ha identificado como un carácter "reflejado" en texto bidireccional y ``0`` en caso contrario.

source: Returns the character decomposition mapping assigned to the character *chr* as string. An empty string is returned in case no such mapping is defined.
es: Retorna el mapeo de descomposición de caracteres asignado al carácter *chr* como una cadena de caracteres. Se retorna una cadena de caracteres vacía en caso de que no se defina tal mapeo.

source: Return the normal form *form* for the Unicode string *unistr*. Valid values for *form* are 'NFC', 'NFKC', 'NFD', and 'NFKD'.
es: Retorna la forma normalizada *form* para la cadena Unicode *unistr*. Los valores válidos para *form* son 'NFC', 'NFKC', 'NFD' y 'NFKD'.

source: The Unicode standard defines various normalization forms of a Unicode string, based on the definition of canonical equivalence and compatibility equivalence. In Unicode, several characters can be expressed in various way. For example, the character U+00C7 (LATIN CAPITAL LETTER C WITH CEDILLA) can also be expressed as the sequence U+0043 (LATIN CAPITAL LETTER C) U+0327 (COMBINING CEDILLA).
es: El estándar Unicode define varias formas de normalización de una cadena Unicode, basándose en la definición de equivalencia canónica y equivalencia de compatibilidad. En Unicode, varios caracteres se pueden expresar de diversas formas. Por ejemplo, el carácter U+00C7 (LETRA C LATINA MAYÚSCULA CON CEDILLA) también se puede expresar con la secuencia U+0043 (LETRA C LATINA MAYÚSCULA) U+0327 (CEDILLA COMBINABLE).

source: For each character, there are two normal forms: normal form C and normal form D. Normal form D (NFD) is also known as canonical decomposition, and translates each character into its decomposed form. Normal form C (NFC) first applies a canonical decomposition, then composes pre-combined characters again.
es: Para cada carácter, hay dos formas normalizadas: la forma normal C y la forma normal D. La forma normal D (NFD) también se conoce como descomposición canónica y traduce cada carácter a su forma descompuesta. La forma normal C (NFC) primero aplica una descomposición canónica y luego vuelve a componer los caracteres combinados previamente.

source: In addition to these two forms, there are two additional normal forms based on compatibility equivalence. In Unicode, certain characters are supported which normally would be unified with other characters. For example, U+2160 (ROMAN NUMERAL ONE) is really the same thing as U+0049 (LATIN CAPITAL LETTER I). However, it is supported in Unicode for compatibility with existing character sets (e.g. gb2312).
es: Además de las dos anteriores, hay dos formas normalizadas adicionales basadas en la equivalencia de compatibilidad. En Unicode, se admiten ciertos caracteres que normalmente se unificarán con otros caracteres. Por ejemplo, U+2160 (NUMERAL ROMANO UNO) es realmente lo mismo que U+0049 (LETRA LATINA MAYÚSCULA I). Sin embargo, esta característica está soportada por Unicode para ser compatible con los conjuntos de caracteres existentes (por ejemplo, gb2312).

source: The normal form KD (NFKD) will apply the compatibility decomposition, i.e. replace all compatibility characters with their equivalents. The normal form KC (NFKC) first applies the compatibility decomposition, followed by the canonical composition.
es: La forma normalizada KD (NFKD) aplicará la descomposición de compatibilidad, es decir, reemplazará todos los caracteres de compatibilidad con sus equivalentes. La forma normalizada KC (NFKC) primero aplica la descomposición de compatibilidad, seguida de la composición canónica.

source: Even if two unicode strings are normalized and look the same to a human reader, if one has combining characters and the other doesn't, they may not compare equal.
es: Incluso si dos cadenas Unicode están normalizadas y parecen iguales para un lector humano, si una tiene caracteres combinados y la otra no, es posible que no se comparen como iguales.

source: Return whether the Unicode string *unistr* is in the normal form *form*. Valid values for *form* are 'NFC', 'NFKC', 'NFD', and 'NFKD'.
es: Retorna si la cadena Unicode *unistr* está en la forma normalizada *form*. Los valores válidos para *form* son 'NFC', 'NFKC', 'NFD' y 'NFKD'.

source: In addition, the module exposes the following constant:
es: Además, el módulo expone las siguientes constantes:

source: The version of the Unicode database used in this module.
es: La versión de la base de datos Unicode usada en este módulo.

source: This is an object that has the same methods as the entire module, but uses the Unicode database version 3.2 instead, for applications that require this specific version of the Unicode database (such as IDNA).
es: Este es un objeto que tiene los mismos métodos que el módulo completo, pero usa la versión 3.2 de la base de datos Unicode en su lugar. Es útil para aplicaciones que requieren esta versión específica de la base de datos Unicode (como IDNA).

source: Examples:
es: Ejemplos:

source: Footnotes
es: Notas al pie
