Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: Added *durations* keyword argument.
es: Se agregó el argumento *durations* de palabra clave.

source: Instance of the :class:`TestLoader` class intended to be shared. If no customization of the :class:`TestLoader` is needed, this instance can be used instead of repeatedly creating new instances.
es: Instancia de la clase :class:`TestLoader` destinada a ser compartida. Si no es necesario personalizar la clase :class:`TestLoader`, esta instancia puede utilizarse en lugar de crear repetidamente nuevas instancias.

source: A basic test runner implementation that outputs results to a stream. If *stream* is ``None``, the default, :data:`sys.stderr` is used as the output stream. This class has a few configurable parameters, but is essentially very simple. Graphical applications which run test suites should provide alternate implementations. Such implementations should accept ``**kwargs`` as the interface to construct runners changes when features are added to unittest.
es: Una implementación básica del test runner que produce resultados en una corriente. Si *stream* es ``None``, el valor por defecto, :data:`sys.stderr` se utiliza como flujo de salida. Esta clase tiene unos pocos parámetros configurables, pero es esencialmente muy simple. Las aplicaciones gráficas que ejecutan las suites de prueba deben proporcionar implementaciones alternativas. Tales implementaciones deberían aceptar ``**kwargs`` como interfaz para construir los cambios de los corredores cuando se añaden características a unittest.

source: By default this runner shows :exc:`DeprecationWarning`, :exc:`PendingDeprecationWarning`, :exc:`ResourceWarning` and :exc:`ImportWarning` even if they are :ref:`ignored by default <warning-ignored>`. This behavior can be overridden using Python's :option:`!-Wd` or :option:`!-Wa` options (see :ref:`Warning control <using-on-warnings>`) and leaving *warnings* to ``None``.
es: Por defecto este runner muestra :exc:`DeprecationWarning`, :exc:`PendingDeprecationWarning`, :exc:`ResourceWarning` y :exc:`ImportWarning` incluso si están :ref:`ignorados por defecto <warning-ignored>`. Este comportamiento se puede anular utilizando las opciones :option:`!-Wd` o :option:`!-Wa` de Python (consulte :ref:`Control de advertencias <using-on-warnings>`) y dejando *warnings* en ``None``.

source: Added the *warnings* parameter.
es: Se añadió el argumento *warnings*.

source: The default stream is set to :data:`sys.stderr` at instantiation time rather than import time.
es: El flujo por defecto está configurado como :data:`sys.stderr` en tiempo de instanciación en lugar de tiempo de importación.

source: Added the *tb_locals* parameter.
es: Se añadió el parámetro *tb_locals*.

source: Added the *durations* parameter.
es: Se añadió el parámetro *durations*.

source: This method returns the instance of ``TestResult`` used by :meth:`run`. It is not intended to be called directly, but can be overridden in subclasses to provide a custom ``TestResult``.
es: Este método devuelve la instancia de ``TestResult`` usada por :meth:`run`. No está destinado a ser llamado directamente, pero puede ser anulado en subclases para proporcionar un ``TestResult`` personalizado.

source: ``_makeResult()`` instantiates the class or callable passed in the ``TextTestRunner`` constructor as the ``resultclass`` argument. It defaults to :class:`TextTestResult` if no ``resultclass`` is provided. The result class is instantiated with the following arguments::
es: ``_makeResult()`` instanciando la clase o el pasaje llamado en el constructor ``TextTestRunner`` como el argumento de ``resultclass``. Por defecto es :class:`TextTestResult` si no se proporciona ninguna ``resultclass``. La clase de resultado se instanciará con los siguientes argumentos::

source: This method is the main public interface to the ``TextTestRunner``. This method takes a :class:`TestSuite` or :class:`TestCase` instance. A :class:`TestResult` is created by calling :func:`_makeResult` and the test(s) are run and the results printed to stdout.
es: Este método es la principal interfaz pública del ``TextTestRunner``. Este método toma una instancia :class:`TestSuite` o :class:`TestCase`. Se crea una :class:`TestResult` llamando a :func:`_makeResult` y se ejecuta(n) la(s) prueba(s) y se imprimen los resultados a stdout.

source: A command-line program that loads a set of tests from *module* and runs them; this is primarily for making test modules conveniently executable. The simplest use for this function is to include the following line at the end of a test script::
es: Un programa de línea de comandos que carga un conjunto de pruebas de *módulo* y las ejecuta; esto es principalmente para hacer los módulos de prueba convenientemente ejecutables. El uso más simple de esta función es incluir la siguiente línea al final de un guión de prueba::

source: You can run tests with more detailed information by passing in the verbosity argument::
es: Puedes hacer pruebas con información más detallada pasando el argumento de la verbosity::

source: The *defaultTest* argument is either the name of a single test or an iterable of test names to run if no test names are specified via *argv*. If not specified or ``None`` and no test names are provided via *argv*, all tests found in *module* are run.
es: El argumento *defaultTest* es el nombre de una prueba única o un iterable de nombres de pruebas a ejecutar si no se especifican nombres de pruebas a través de *argv*. Si no se especifica o ``Ninguno`` y no se proporcionan nombres de pruebas vía *argv*, se ejecutan todas las pruebas encontradas en *modulo*.

source: The *argv* argument can be a list of options passed to the program, with the first element being the program name. If not specified or ``None``, the values of :data:`sys.argv` are used.
es: El argumento *argv* puede ser una lista de opciones pasadas al programa, siendo el primer elemento el nombre del programa. Si no se especifica o ``Ninguno``, se utilizan los valores de :data:`sys.argv`.

source: The *testRunner* argument can either be a test runner class or an already created instance of it. By default ``main`` calls :func:`sys.exit` with an exit code indicating success (0) or failure (1) of the tests run. An exit code of 5 indicates that no tests were run.
es: El argumento *testRunner* puede ser una clase de corredor de prueba o una instancia ya creada de él. Por defecto ``main`` llama :func:`sys.exit` con un código de salida que indica el éxito (0) o el fracaso (1) de la ejecución de las pruebas. Un código de salida de 5 indica que no se ejecutaron pruebas.

source: The *testLoader* argument has to be a :class:`TestLoader` instance, and defaults to :data:`defaultTestLoader`.
es: El argumento *testLoader* tiene que ser una instancia :class:`TestLoader`, y por defecto :data:`defaultTestLoader`.

source: ``main`` supports being used from the interactive interpreter by passing in the argument ``exit=False``. This displays the result on standard output without calling :func:`sys.exit`::
es: ``main`` apoya el uso del intérprete interactivo pasando el argumento ``exit=False``. Esto muestra el resultado en la salida estándar sin llamar a :func:`sys.exit`::

source: The *failfast*, *catchbreak* and *buffer* parameters have the same effect as the same-name `command-line options`_.
es: Los parámetros *failfast*, *catchbreak* y *buffer* tienen el mismo efecto que las `command-line options`_ del mismo nombre.

source: The *warnings* argument specifies the :ref:`warning filter <warning-filter>` that should be used while running the tests. If it's not specified, it will remain ``None`` if a :option:`!-W` option is passed to :program:`python` (see :ref:`Warning control <using-on-warnings>`), otherwise it will be set to ``'default'``.
es: El argumento *warnings* especifica el :ref:`filtro de aviso <warning-filter>` que debe ser usado mientras se realizan los tests. Si no se especifica, permanecerá como ``None`` si se pasa una opción :option:`!-W` a :program:`python` (ver :ref:`Warning control <using-on-warnings>`), de lo contrario se establecerá como ``’default’``.

source: Calling ``main`` actually returns an instance of the ``TestProgram`` class. This stores the result of the tests run as the ``result`` attribute.
es: Invocar ``main`` en realidad devuelve una instancia de la clase ``TestProgram``. Esto almacena el resultado de las pruebas ejecutadas en el atributo ``result``.

source: The *exit* parameter was added.
es: El parámetro *exit* fue añadido.

source: The *verbosity*, *failfast*, *catchbreak*, *buffer* and *warnings* parameters were added.
es: Los parámetros *verbosity*, *failfast*, *catchbreak*, *buffer* y *warnings* fueron añadidos.

source: The *defaultTest* parameter was changed to also accept an iterable of test names.
es: El parámetro *defaultTest* fue cambiado para aceptar también un iterable de nombres de pruebas.

source: load_tests Protocol
es: load_tests protocolo

source: Modules or packages can customize how tests are loaded from them during normal test runs or test discovery by implementing a function called ``load_tests``.
es: Los módulos o paquetes pueden personalizar la forma en que se cargan las pruebas a partir de ellos durante las ejecuciones de prueba normales o el descubrimiento de pruebas mediante la implementación de una función llamada ``load_tests``.

source: If a test module defines ``load_tests`` it will be called by :meth:`TestLoader.loadTestsFromModule` with the following arguments::
es: Si un módulo de tests define ``load_tests`` será llamado por :meth:`TestLoader.loadTestsFromModule` con los siguientes argumentos::

source: where *pattern* is passed straight through from ``loadTestsFromModule``. It defaults to ``None``.
es: donde *pattern* se pasa directamente desde ``loadTestsFromModule``. Por defecto es ``None``.

source: It should return a :class:`TestSuite`.
es: Debe retornar una :class:`TestSuite`.

source: *loader* is the instance of :class:`TestLoader` doing the loading. *standard_tests* are the tests that would be loaded by default from the module. It is common for test modules to only want to add or remove tests from the standard set of tests. The third argument is used when loading packages as part of test discovery.
es: *loader* es la instancia de :class:`TestLoader` haciendo la carga. *standard_tests* son los tests que se cargarían por defecto desde el módulo. Es común que los módulos de test sólo quieran añadir o quitar tests del conjunto de tests estándar. El tercer argumento se usa cuando se cargan paquetes como parte del descubrimiento de tests.

source: A typical ``load_tests`` function that loads tests from a specific set of :class:`TestCase` classes may look like::
es: Una típica función de ``load_tests`` que carga pruebas de un conjunto específico de :class:`TestCase`class:`TestCase` puede ser como::

source: If discovery is started in a directory containing a package, either from the command line or by calling :meth:`TestLoader.discover`, then the package :file:`__init__.py` will be checked for ``load_tests``. If that function does not exist, discovery will recurse into the package as though it were just another directory. Otherwise, discovery of the package's tests will be left up to ``load_tests`` which is called with the following arguments::
es: Si discovery se inicia en un directorio que contiene un paquete, ya sea desde la línea de comandos o llamando a :meth:`TestLoader.discover`, entonces el paquete :file:`__init__.py` se comprobará por ``load_tests``. Si esa función no existe, discover se reincorporará al paquete como si fuera un directorio más. De lo contrario, el descubrimiento de los tests del paquete se dejará en ``load_tests`` que se llama con los siguientes argumentos::

source: This should return a :class:`TestSuite` representing all the tests from the package. (``standard_tests`` will only contain tests collected from :file:`__init__.py`.)
es: Esto debería devolver un :class:`TestSuite` que represente todas las pruebas del paquete. (``test_estándar`` sólo contendrá las pruebas recogidas de :file:`__init__.py`.)

source: Because the pattern is passed into ``load_tests`` the package is free to continue (and potentially modify) test discovery. A 'do nothing' ``load_tests`` function for a test package would look like::
es: Debido a que el patrón se pasa a ``load_tests`` el paquete es libre de continuar (y potencialmente modificar) el descubrimiento de pruebas. Una función de 'no hace nada' ``load_test`` para un paquete de pruebas se vería como::

source: Discovery no longer checks package names for matching *pattern* due to the impossibility of package names matching the default pattern.
es: Discovery ya no comprueba si los nombres de los paquetes coinciden con el *patrón* debido a la imposibilidad de que los nombres de los paquetes coincidan con el patrón por defecto.

source: Class and Module Fixtures
es: Instalaciones para clases y módulos

source: Class and module level fixtures are implemented in :class:`TestSuite`. When the test suite encounters a test from a new class then :meth:`tearDownClass` from the previous class (if there is one) is called, followed by :meth:`setUpClass` from the new class.
es: Los accesorios de nivel de clase y módulo se implementan en :class:`TestSuite`. Cuando el conjunto de pruebas se encuentra con una prueba de una nueva clase entonces se llama :meth:`tearDownClass` de la clase anterior (si existe), seguido de :meth:`setUpClass` de la nueva clase.

source: Similarly if a test is from a different module from the previous test then ``tearDownModule`` from the previous module is run, followed by ``setUpModule`` from the new module.
es: Del mismo modo, si una prueba es de un módulo diferente de la prueba anterior, entonces se ejecuta ``DesmontarMódulo`` del módulo anterior, seguido de ``DesmontarMódulo`` del nuevo módulo.

source: After all the tests have run the final ``tearDownClass`` and ``tearDownModule`` are run.
es: Después de todas las pruebas, se ejecutan los últimos ``tearDownClass`` y ``tearDownModule``.

source: Note that shared fixtures do not play well with [potential] features like test parallelization and they break test isolation. They should be used with care.
es: Tenga en cuenta que los accesorios compartidos no juegan bien con las características [potenciales] como la paralelización de la prueba y rompen el aislamiento de la prueba. Deben ser usados con cuidado.

source: The default ordering of tests created by the unittest test loaders is to group all tests from the same modules and classes together. This will lead to ``setUpClass`` / ``setUpModule`` (etc) being called exactly once per class and module. If you randomize the order, so that tests from different modules and classes are adjacent to each other, then these shared fixture functions may be called multiple times in a single test run.
es: El orden por defecto de las pruebas creadas por los cargadores de pruebas unitarias es agrupar todas las pruebas de los mismos módulos y clases. Esto llevará a que ``setUpClass`` / ``setUpModule`` (etc) sea llamado exactamente una vez por clase y módulo. Si se aleatoriza el orden, de manera que las pruebas de diferentes módulos y clases sean adyacentes entre sí, entonces estas funciones compartidas de fixture pueden ser llamadas varias veces en una sola ejecución de prueba.

source: Shared fixtures are not intended to work with suites with non-standard ordering. A ``BaseTestSuite`` still exists for frameworks that don't want to support shared fixtures.
es: Los accesorios compartidos no están pensados para trabajar con suites con pedidos no estándar. Todavía existe una ``BaseTestSuite`` para los marcos de trabajo que no quieren soportar accesorios compartidos.

source: If there are any exceptions raised during one of the shared fixture functions the test is reported as an error. Because there is no corresponding test instance an ``_ErrorHolder`` object (that has the same interface as a :class:`TestCase`) is created to represent the error. If you are just using the standard unittest test runner then this detail doesn't matter, but if you are a framework author it may be relevant.
es: Si hay alguna excepción planteada durante una de las funciones compartidas del aparato, la prueba se notifica como un error. Debido a que no hay una instancia de prueba correspondiente, se crea un objeto ``_ErrorHolder`` (que tiene la misma interfaz que un :class:`TestCase`) para representar el error. Si sólo estás usando el standard unittest test runner entonces este detalle no importa, pero si eres un autor de marcos de trabajo puede ser relevante.

source: setUpClass and tearDownClass
es: setUpClass y tearDownClass

source: These must be implemented as class methods::
es: Estos deben ser implementados como métodos de clase::

source: If you want the ``setUpClass`` and ``tearDownClass`` on base classes called then you must call up to them yourself. The implementations in :class:`TestCase` are empty.
es: Si quieres que se invoque a ``SetUpClass`` y ``BreakdownClass`` en clases base, debes llamarlos tú mismo. Las implementaciones en :class:`TestCase` están vacías.

source: If an exception is raised during a ``setUpClass`` then the tests in the class are not run and the ``tearDownClass`` is not run. Skipped classes will not have ``setUpClass`` or ``tearDownClass`` run. If the exception is a :exc:`SkipTest` exception then the class will be reported as having been skipped instead of as an error.
es: Si se lanza una excepción durante una ``setUpClass``, entonces los tests de la clase no se ejecutan y la ``tearDownClass`` no se ejecuta. Las clases que se salten no tendrán ``setUpClass`` o ``tearDownClass``. Si la excepción es una :exc:`SkipTest` entonces la clase será reportada como salteada en lugar de como un error.

source: setUpModule and tearDownModule
es: setUpModule y tearDownModule

source: These should be implemented as functions::
es: Estos deben ser implementados como funciones::

source: If an exception is raised in a ``setUpModule`` then none of the tests in the module will be run and the ``tearDownModule`` will not be run. If the exception is a :exc:`SkipTest` exception then the module will be reported as having been skipped instead of as an error.
es: Si se lanza una excepción en un ``setUpModule``, entonces no se ejecutará ninguna de las pruebas del módulo y no se ejecutará el ``tearDownModule``. Si la excepción es una :exc:`SkipTest` entonces el módulo será reportado como saltado en lugar de como un error.

source: To add cleanup code that must be run even in the case of an exception, use ``addModuleCleanup``:
es: Para agregar código de limpieza que se debe ejecutar incluso en el caso de una excepción, utilice ``addModuleCleanup``::

source: Add a function to be called after :func:`tearDownModule` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addModuleCleanup` when they are added.
es: Añade una función que se llamará después de :func:`tearDownModule` para limpiar los recursos utilizados durante la clase de test. Las funciones se llamarán en orden inverso al orden en que se agregan (:abbr:`LIFO (last-in, first-out)`). Se llaman con cualquier argumento y palabra clave que se pase a :meth:`addModuleCleanup` cuando se añadan.

source: If :meth:`setUpModule` fails, meaning that :func:`tearDownModule` is not called, then any cleanup functions added will still be called.
es: Si :meth:`setUpModule` falla, lo que significa que :func:`tearDownModule` no se invoca, entonces cualquier función de limpieza añadida seguirá siendo invocada.

source: Enter the supplied :term:`context manager`. If successful, also add its :meth:`~object.__exit__` method as a cleanup function by :func:`addModuleCleanup` and return the result of the :meth:`~object.__enter__` method.
es: Introduce el :term:`context manager` suministrado. Si es exitoso, añade también su método :meth:`~object.__exit__` como función de limpieza mediante :func:`addModuleCleanup` y retorna el resultado del método :meth:`~object.__enter__`.

source: This function is called unconditionally after :func:`tearDownModule`, or after :func:`setUpModule` if :func:`setUpModule` raises an exception.
es: Esta función se llama incondicionalmente después de :func:`tearDownModule`, o después de :func:`setUpModule` si :func:`setUpModule` lanza una excepción.

source: It is responsible for calling all the cleanup functions added by :func:`addModuleCleanup`. If you need cleanup functions to be called *prior* to :func:`tearDownModule` then you can call :func:`doModuleCleanups` yourself.
es: Es responsable de invocar a todas las funciones de limpieza añadidas por :func:`addCleanupModule`. Si necesitas que las funciones de limpieza se llamen *previamente* a :func:`tearDownModule` entonces puedes invocar a :func:`doModuleCleanups` tú mismo.

source: :func:`doModuleCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
es: :func:`doModuleCleanups` saca los métodos de la pila de funciones de limpieza uno a uno, así que se puede llamar en cualquier momento.

source: Signal Handling
es: Manejo de señales

source: The :option:`-c/--catch <unittest -c>` command-line option to unittest, along with the ``catchbreak`` parameter to :func:`unittest.main()`, provide more friendly handling of control-C during a test run. With catch break behavior enabled control-C will allow the currently running test to complete, and the test run will then end and report all the results so far. A second control-c will raise a :exc:`KeyboardInterrupt` in the usual way.
es: La opción :option:`-c/--catch <unittest -c>` línea de comando para unittest, junto con el parámetro ``catchbreak`` de :func:`unittest.main()`, proporcionan un manejo más amigable del control-C durante una prueba. Con el comportamiento catch break habilitado, control-C permitirá que se complete la prueba que se está ejecutando actualmente, y la ejecución de la prueba terminará y reportará todos los resultados hasta ahora. Un segundo control-C lanzará una :exc:`KeyboardInterrupt` de la manera habitual.

source: The control-c handling signal handler attempts to remain compatible with code or tests that install their own :const:`signal.SIGINT` handler. If the ``unittest`` handler is called but *isn't* the installed :const:`signal.SIGINT` handler, i.e. it has been replaced by the system under test and delegated to, then it calls the default handler. This will normally be the expected behavior by code that replaces an installed handler and delegates to it. For individual tests that need ``unittest`` control-c handling disabled the :func:`removeHandler` decorator can be used.
es: El manejador de señales de manejo de control-c intenta permanecer compatible con el código o las pruebas que instalan su propio manejador :const:`signal.SIGINT` . Si se llama al manejador ``unittest`` pero *no es* el manejador :const:`signal.SIGINT` instalado, es decir, ha sido reemplazado por el sistema bajo test y delegado, entonces llama al manejador por defecto. Este será normalmente el comportamiento esperado por el código que reemplaza un manejador instalado y delega en él. Para las pruebas individuales que necesiten el manejo de control-c de ``unittest`` deshabilitado se puede usar el decorador :func:`removeHandler`.

source: There are a few utility functions for framework authors to enable control-c handling functionality within test frameworks.
es: Hay algunas funciones de utilidad para que los autores de marcos de trabajo habiliten la funcionalidad de control de control-c dentro de los marcos de prueba.
