Repository: python/python-docs-es
Catalog: library/unittest.mock.po
Languages: es

source: You can see that :class:`request.Request` has a spec. :class:`request.Request` takes two arguments in the constructor (one of which is *self*). Here's what happens if we try to call it incorrectly::
es: Se puede ver que :class:`request.Request` tiene una especificación. :class:`request.Request` toma dos argumentos en el constructor (uno de los cuales es *self*). Esto es lo que sucede si tratamos de llamarlo de forma incorrecta:

source: The spec also applies to instantiated classes (i.e. the return value of specced mocks)::
es: La especificación también se aplica a las clases instanciadas (es decir, el valor de retorno de los objetos simulados especificados):

source: :class:`Request` objects are not callable, so the return value of instantiating our mocked out :class:`request.Request` is a non-callable mock. With the spec in place any typos in our asserts will raise the correct error::
es: Los objetos de la clase :class:`Request` no son invocables, por lo que el valor de retorno de una instancia de nuestro objeto simulado de :class:`request.Request` no es invocable. Con la especificación, en cambio, cualquier error tipográfico en nuestras aserciones generará el error correcto:

source: In many cases you will just be able to add ``autospec=True`` to your existing :func:`patch` calls and then be protected against bugs due to typos and api changes.
es: En muchos casos, podrás simplemente añadir ``autospec=True`` a tus llamadas :func:`patch` existentes y así estar protegido contra errores tipográficos y cambios de la API.

source: As well as using *autospec* through :func:`patch` there is a :func:`create_autospec` for creating autospecced mocks directly:
es: Además de poder usar *autospec* a través de :func:`patch`, existe la función :func:`create_autospec` para crear directamente objetos simulados autoespecificados:

source: This isn't without caveats and limitations however, which is why it is not the default behaviour. In order to know what attributes are available on the spec object, autospec has to introspect (access attributes) the spec. As you traverse attributes on the mock a corresponding traversal of the original object is happening under the hood. If any of your specced objects have properties or descriptors that can trigger code execution then you may not be able to use autospec. On the other hand it is much better to design your objects so that introspection is safe [#]_.
es: Sin embargo, este no es el comportamiento predeterminado, ya que no está exento de advertencias y restricciones. Con el fin de conocer qué atributos están disponibles en el objeto especificado, autospec tiene que hacer uso de introspección sobre la especificación (acceder a los atributos). A medida que recorres los atributos en el objeto simulado, se produce paralelamente y de forma soterrada un recorrido del objeto original. Si alguno de tus objetos especificados tienen propiedades o descriptores que puedan desencadenar la ejecución de código, quizás no deberías utilizar la autoespecificación. De todas formas, es siempre mucho mejor diseñar tus objetos de modo que la introspección sea segura [#]_.

source: A more serious problem is that it is common for instance attributes to be created in the :meth:`__init__` method and not to exist on the class at all. *autospec* can't know about any dynamically created attributes and restricts the api to visible attributes. ::
es: Un problema más serio es que es común que los atributos de instancia sean creados en el método :meth:`__init__` y que no existan a nivel de clase. *autospec* no puede tener conocimiento de ningún atributo creado dinámicamente, por lo que restringe la API a atributos visibles:

source: There are a few different ways of resolving this problem. The easiest, but not necessarily the least annoying, way is to simply set the required attributes on the mock after creation. Just because *autospec* doesn't allow you to fetch attributes that don't exist on the spec it doesn't prevent you setting them::
es: Hay diferentes formas de resolver este problema. La forma más sencilla, pero no necesariamente la menos molesta, es simplemente establecer los atributos necesarios en el objeto simulado después de la creación del mismo. El hecho de que *autospec* no te permita buscar atributos que no existen en la especificación no impide que los establezcas manualmente después:

source: There is a more aggressive version of both *spec* and *autospec* that *does* prevent you setting non-existent attributes. This is useful if you want to ensure your code only *sets* valid attributes too, but obviously it prevents this particular scenario:
es: Existe una versión más agresiva de *spec* y *autospec* que impide establecer atributos inexistentes. Esto es útil si deseas asegurarte de que tu código solo *establece* atributos válidos, pero obviamente evitando este escenario en particular:

source: Probably the best way of solving the problem is to add class attributes as default values for instance members initialised in :meth:`__init__`. Note that if you are only setting default attributes in :meth:`__init__` then providing them via class attributes (shared between instances of course) is faster too. e.g.
es: Probablemente la mejor manera de resolver el problema es añadir atributos de clase como valores por defecto para los miembros de instancia inicializados en el método :meth:`__init__`. Ten en cuenta que, si sólo estás estableciendo atributos predeterminados en :meth:`__init__`, proporcionarlos a través de atributos de clase (que , por supuesto, son compartidos entre instancias) también es más rápido.

source: This brings up another issue. It is relatively common to provide a default value of ``None`` for members that will later be an object of a different type. ``None`` would be useless as a spec because it wouldn't let you access *any* attributes or methods on it. As ``None`` is *never* going to be useful as a spec, and probably indicates a member that will normally of some other type, autospec doesn't use a spec for members that are set to ``None``. These will just be ordinary mocks (well - MagicMocks):
es: Esto nos plantea otro problema. Es relativamente común proporcionar un valor predeterminado de ``None`` para los miembros que posteriormente se convertirán en objetos de un tipo diferente. ``None`` es inútil como especificación dado que no permite acceder a *ningún* atributo o método. Como ``None`` *nunca* será útil como especificación, y probablemente indica un miembro que normalmente será de algún otro tipo en el futuro, la autoespecificación no usa una especificación para aquellos miembros configurados con ``None`` como valor. Estos serán simplemente objetos simulados ordinarios (MagicMocks en realidad):

source: If modifying your production classes to add defaults isn't to your liking then there are more options. One of these is simply to use an instance as the spec rather than the class. The other is to create a subclass of the production class and add the defaults to the subclass without affecting the production class. Both of these require you to use an alternative object as the spec. Thankfully :func:`patch` supports this - you can simply pass the alternative object as the *autospec* argument::
es: Si modificar tus clases en producción para agregar valores predeterminados no es de tu agrado, dispones de otras opciones. Una de ellas es simplemente usar una instancia como especificación en lugar de la clase. La otra es crear una subclase de la clase en producción y agregar los valores predeterminados a la subclase, sin afectar a la clase en producción. Ambas alternativas requieren que uses un objeto alternativo como especificación. Afortunadamente :func:`patch` admite esto, simplemente tienes que pasar el objeto alternativo mediante el argumento *autospec*:

source: This only applies to classes or already instantiated objects. Calling a mocked class to create a mock instance *does not* create a real instance. It is only attribute lookups - along with calls to :func:`dir` - that are done.
es: Esto sólo se aplica a las clases u objetos ya instanciados. Llamar a una clase simulada para crear una instancia simulada *no* crea una instancia real. Solo se llevan a cabo las búsqueda de atributos (mediante llamadas a :func:`dir`).

source: Sealing mocks
es: Sellar objetos simulados

source: Seal will disable the automatic creation of mocks when accessing an attribute of the mock being sealed or any of its attributes that are already mocks recursively.
es: Seal desactivará la creación automática de objetos simulados al acceder a un atributo del objeto simulado que está siendo sellado, o a cualquiera de sus atributos que ya sean objetos simulados de forma recursiva.

source: If a mock instance with a name or a spec is assigned to an attribute it won't be considered in the sealing chain. This allows one to prevent seal from fixing part of the mock object. ::
es: Si una instancia simulada con un nombre o una especificación es asignada a un atributo no será considerada en la cadena de sellado. Esto permite evitar que seal fije partes del objeto simulado. ::
