Repository: python/python-docs-es
Catalog: library/unittest.mock.po
Languages: es

source: A boolean representing whether or not the mock object has been called:
es: Un booleano que representa si el objeto simulado ha sido invocado o no:

source: An integer telling you how many times the mock object has been called:
es: Un entero que le indica cuántas veces el objeto simulado ha sido invocado:

source: Set this to configure the value returned by calling the mock:
es: Establece este atributo para configurar el valor a retornar cuando se llama al objeto simulado:

source: The default return value is a mock object and you can configure it in the normal way:
es: El valor de retorno por defecto es otro objeto simulado y se puede configurar de forma habitual:

source: :attr:`return_value` can also be set in the constructor:
es: :attr:`return_value` también se puede establecer directamente en el constructor:

source: This can either be a function to be called when the mock is called, an iterable or an exception (class or instance) to be raised.
es: Este atributo puede ser una función a ser llamada cuando se llame al objeto simulado, un iterable o una excepción (clase o instancia) para ser lanzada.

source: If you pass in a function it will be called with same arguments as the mock and unless the function returns the :data:`DEFAULT` singleton the call to the mock will then return whatever the function returns. If the function returns :data:`DEFAULT` then the mock will return its normal value (from the :attr:`return_value`).
es: Si pasas una función, será llamada con los mismos argumentos que el objeto simulado y, a menos que la función retorne el singleton :data:`DEFAULT`, la llamada al objeto simulado retornará lo mismo que retorna la función. En cambio, si la función retorna :data:`DEFAULT`, entonces el objeto simulado retornará su valor normal (el del atributo :attr:`return_value`).

source: If you pass in an iterable, it is used to retrieve an iterator which must yield a value on every call. This value can either be an exception instance to be raised, or a value to be returned from the call to the mock (:data:`DEFAULT` handling is identical to the function case).
es: Si pasas un iterable, se utiliza para obtener un iterador a partir del mismo que debe producir un valor en cada llamada. Este valor puede ser una instancia de la excepción a ser lanzada o un valor a retornar al llamar al objeto simulado (el manejo de :data:`DEFAULT` es igual que en el caso en el que se pasa una función).

source: An example of a mock that raises an exception (to test exception handling of an API):
es: Un ejemplo de un objeto simulado que genera una excepción (para probar el manejo de excepciones de una API):

source: Using :attr:`side_effect` to return a sequence of values:
es: Usando :attr:`side_effect` para retornar una secuencia de valores:

source: Using a callable:
es: Usando un objeto invocable:

source: :attr:`side_effect` can be set in the constructor. Here's an example that adds one to the value the mock is called with and returns it:
es: :attr:`side_effect` se puede establecer en el constructor. Aquí hay un ejemplo que suma uno al valor del objeto simulado invocado y lo retorna:

source: Setting :attr:`side_effect` to ``None`` clears it:
es: Establecer :attr:`side_effect` en ``None`` lo desactiva:

source: This is either ``None`` (if the mock hasn't been called), or the arguments that the mock was last called with. This will be in the form of a tuple: the first member, which can also be accessed through the ``args`` property, is any ordered arguments the mock was called with (or an empty tuple) and the second member, which can also be accessed through the ``kwargs`` property, is any keyword arguments (or an empty dictionary).
es: Este atributo es ``None`` (si el objeto simulado no ha sido invocado) o los argumentos con los que se llamó por última vez. En este último caso, será una tupla con dos elementos: el primer miembro, que también es accesible a través de la propiedad ``args``, son los argumentos posicionales con los que el objeto simulado se llamó (o una tupla vacía si no se pasó ninguno) y el segundo miembro, que también es accesible mediante la propiedad ``kwargs``, son los argumento por palabra clave pasados (o un diccionario vacío si no se pasó ninguno).

source: :attr:`call_args`, along with members of the lists :attr:`call_args_list`, :attr:`method_calls` and :attr:`mock_calls` are :data:`call` objects. These are tuples, so they can be unpacked to get at the individual arguments and make more complex assertions. See :ref:`calls as tuples <calls-as-tuples>`.
es: El atributo :attr:`call_args`, junto con los miembros de las listas :attr:`call_args_list`, :attr:`method_calls` y :attr:`mock_calls` son objetos :data:`call`. Estos objetos son tuplas, con la finalidad de que puedan ser desempaquetadas para acceder a los argumentos individuales y hacer aserciones más complejas. Consultar :ref:`objetos call como tuplas <calls-as-tuples>` para más información.

source: This is a list of all the calls made to the mock object in sequence (so the length of the list is the number of times it has been called). Before any calls have been made it is an empty list. The :data:`call` object can be used for conveniently constructing lists of calls to compare with :attr:`call_args_list`.
es: Este argumento es una lista de todas las llamadas consecutivas realizadas al objeto simulado (por lo que la longitud de la lista es el número de veces que se ha invocado). Previamente a que se hayan realizado llamadas es una lista vacía. El objeto :data:`call` se puede utilizar para construir convenientemente las listas de llamadas a comparar con :attr:`call_args_list`.

source: Members of :attr:`call_args_list` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
es: Los miembros de :attr:`call_args_list` son objetos :data:`call`. Estos pueden ser desempaquetados como tuplas para acceder a los argumentos individuales. Consultar :ref:`objetos call como tuplas <calls-as-tuples>` para más información.

source: As well as tracking calls to themselves, mocks also track calls to methods and attributes, and *their* methods and attributes:
es: Igual que realizan un seguimiento de las llamadas hechas a sí mismos, los objetos simulados también realizan un seguimiento a *sus* métodos y atributos, así como de las llamadas hechas a los mismos:

source: Members of :attr:`method_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
es: Los miembros de :attr:`method_calls` son objetos :data:`call`. Estos pueden ser desempaquetados como tuplas para acceder a los atributos individuales. Consultar :ref:`objetos call como tuplas <calls-as-tuples>` para más información.

source: :attr:`mock_calls` records *all* calls to the mock object, its methods, magic methods *and* return value mocks.
es: :attr:`mock_calls` registra *todas* las llamadas al objeto simulado, sus métodos, métodos mágicos *y* objetos simulados del valor de retorno.

source: Members of :attr:`mock_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
es: Los miembros de :attr:`mock_calls` son objetos :data:`call`. Estos pueden ser desempaquetados como tuplas para acceder a los argumentos individuales. Consultar :ref:`objetos call como tuplas <calls-as-tuples>` para más información.

source: The way :attr:`mock_calls` are recorded means that where nested calls are made, the parameters of ancestor calls are not recorded and so will always compare equal:
es: La forma como se registra el atributo :attr:`mock_calls` implica que cuando se realizan llamadas anidadas, los parámetros de las llamadas previas no se registran, por lo que siempre resultan iguales al comparar:

source: Normally the :attr:`__class__` attribute of an object will return its type. For a mock object with a :attr:`spec`, ``__class__`` returns the spec class instead. This allows mock objects to pass :func:`isinstance` tests for the object they are replacing / masquerading as:
es: Normalmente, el atributo de un objeto :attr:`__class__` retornará su tipo. Para un objeto simulado con un :attr:`spec`, ``__class__`` retorna la clase especificada en su lugar. Esto permite a los objetos simulados pasar los test de :func:`isinstance` para el objeto que están reemplazando / enmascarando:

source: :attr:`__class__` is assignable to, this allows a mock to pass an :func:`isinstance` check without forcing you to use a spec:
es: El atributo :attr:`__class__` es asignable, esto permite al objeto simulado pasar una verificación de :func:`isinstance` sin verse forzado a utilizar una especificación:

source: A non-callable version of :class:`Mock`. The constructor parameters have the same meaning of :class:`Mock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
es: Una versión no invocable de :class:`Mock`. Los parámetros del constructor tienen el mismo significado que en :class:`Mock`, con la excepción de *return_value* y *side_effect* que no tienen sentido en un objeto simulado no invocable.

source: Mock objects that use a class or an instance as a :attr:`spec` or :attr:`spec_set` are able to pass :func:`isinstance` tests:
es: Los objetos simulados que usan una clase o una instancia como :attr:`spec` o :attr:`spec_set` son capaces de pasar los test de :func:`isinstance`:

source: The :class:`Mock` classes have support for mocking magic methods. See :ref:`magic methods <magic-methods>` for the full details.
es: Las clases :class:`Mock` tienen soporte para simular los métodos mágicos. Consultar la sección dedicada a los :ref:`métodos mágicos <magic-methods>` para ver los detalles.

source: The mock classes and the :func:`patch` decorators all take arbitrary keyword arguments for configuration. For the :func:`patch` decorators the keywords are passed to the constructor of the mock being created. The keyword arguments are for configuring attributes of the mock:
es: Las clases simuladas y los decoradores :func:`patch` aceptan todas argumentos por palabra clave arbitrarios para la configuración. En los decoradores :func:`patch` los argumentos por palabra clave se pasan al constructor del objeto simulado creado. Estos argumentos se usan para configurar los atributos del propio objeto simulado:

source: The return value and side effect of child mocks can be set in the same way, using dotted notation. As you can't use dotted names directly in a call you have to create a dictionary and unpack it using ``**``:
es: Tanto el valor de retorno como el efecto colateral del objeto simulado pueden ser establecidos de la misma manera, mediante notación de punto. En cambio, si se quieren establecer mediante el constructor, dado que no se puede utilizar notación de punto directamente en una llamada, se tiene que crear un diccionario y desempaquetarlo usando ``**``:

source: A callable mock which was created with a *spec* (or a *spec_set*) will introspect the specification object's signature when matching calls to the mock. Therefore, it can match the actual call's arguments regardless of whether they were passed positionally or by name::
es: Un objeto simulado invocable que fue creado con un *spec* (o un *spec_set*) introspeccionará la firma del objeto de la especificación en el momento de emparejar las llamadas al objeto simulado. Esto le permite hacer coincidir sus argumentos con los argumentos de la llamada real, independientemente de si se pasaron por posición o por nombre:

source: This applies to :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` and :meth:`~Mock.assert_any_call`. When :ref:`auto-speccing`, it will also apply to method calls on the mock object.
es: Esto se aplica a :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` y :meth:`~Mock.assert_any_call`. Cuando se hace uso de :ref:`auto-speccing`, también se aplicará a las llamadas a los métodos del objeto simulado.

source: Added signature introspection on specced and autospecced mock objects.
es: Se añadió introspección de firma en objetos simulados especificados y autoespecificados.

source: A mock intended to be used as a property, or other descriptor, on a class. :class:`PropertyMock` provides :meth:`__get__` and :meth:`__set__` methods so you can specify a return value when it is fetched.
es: Un objeto simulado destinado a ser utilizado en una clase como una propiedad, u otro descriptor. La clase :class:`PropertyMock` proporciona los métodos :meth:`__get__` y :meth:`__set__`, por lo que puedes especificar un valor de retorno para cuando su valor es requerido.

source: Fetching a :class:`PropertyMock` instance from an object calls the mock, with no args. Setting it calls the mock with the value being set. ::
es: La obtención de una instancia :class:`PropertyMock` desde un objeto ocasiona una llamada al objeto simulado, sin argumentos. Establecer su valor también llama al objeto simulado, con el valor a establecer como argumento.

source: Because of the way mock attributes are stored you can't directly attach a :class:`PropertyMock` to a mock object. Instead you can attach it to the mock type object::
es: Debido a la forma en que se almacenan los atributos simulados, no es posible conectar directamente un :class:`PropertyMock` a un objeto simulado. En su lugar se puede conectar al tipo (type) del objeto simulado:

source: The result of ``mock()`` is an async function which will have the outcome of ``side_effect`` or ``return_value`` after it has been awaited:
es: El resultado de ``mock()`` es una función asíncrona que proporcionará el resultado de ``side_effect`` o de ``return_value`` después de haber sido aguardada:

source: if ``side_effect`` is a function, the async function will return the result of that function,
es: si ``side_effect`` es una función, la función asíncrona retornará el resultado de esa función,

source: if ``side_effect`` is an exception, the async function will raise the exception,
es: si ``side_effect`` es una excepción, la función asíncrona lanzará la excepción,

source: if ``side_effect`` is an iterable, the async function will return the next value of the iterable, however, if the sequence of result is exhausted, ``StopAsyncIteration`` is raised immediately,
es: si ``side_effect`` es un iterable, la función asíncrona retornará el siguiente valor del iterable, sin embargo, si se agota la secuencia de resultados, se lanza una excepción ``StopAsyncIteration`` inmediatamente,

source: if ``side_effect`` is not defined, the async function will return the value defined by ``return_value``, hence, by default, the async function returns a new :class:`AsyncMock` object.
es: si ``side_effect`` no está definido, la función asíncrona retornará el valor definido por ``return_value``, por lo tanto, la función asíncrona retorna un nuevo objeto :class:`AsyncMock` por defecto.

source: Setting the *spec* of a :class:`Mock` or :class:`MagicMock` to an async function will result in a coroutine object being returned after calling.
es: Establecer el argumento *spec* de un objeto :class:`Mock` o :class:`MagicMock` en una función asíncrona resultará en que un objeto corrutina será retornado después de la llamada al objeto.

source: Setting the *spec* of a :class:`Mock`, :class:`MagicMock`, or :class:`AsyncMock` to a class with asynchronous and synchronous functions will automatically detect the synchronous functions and set them as :class:`MagicMock` (if the parent mock is :class:`AsyncMock` or :class:`MagicMock`) or :class:`Mock` (if the parent mock is :class:`Mock`). All asynchronous functions will be :class:`AsyncMock`.
es: Establecer el argumento *spec* de un objeto :class:`Mock`, :class:`MagicMock` o :class:`AsyncMock` en una clase que tiene simultáneamente funciones asíncronas y síncronas hará que se detecten automáticamente las funciones sincrónicas y las establecerá como :class:`MagicMock` (si el objeto simulado padre es :class:`AsyncMock` o :class:`MagicMock`) o :class:`Mock` (si el objeto simulado padre es :class:`Mock`) . Todas las funciones asíncronas serán :class:`AsyncMock`.

source: Assert that the mock was awaited at least once. Note that this is separate from the object having been called, the ``await`` keyword must be used:
es: Aserta si el objeto simulado fue aguardado al menos una vez. Ten en cuenta que, independientemente del objeto que ha sido invocado, la palabra clave ``await`` debe ser utilizada:

source: Assert that the mock was awaited exactly once.
es: Aserta si el objeto simulado fue aguardado exactamente una vez.

source: Assert that the last await was with the specified arguments.
es: Aserta si el último aguardo (await) fue con los argumentos especificados.

source: Assert that the mock was awaited exactly once and with the specified arguments.
es: Aserta si que el objeto simulado se ha aguardado exactamente una vez y con los argumentos especificados.

source: Assert the mock has ever been awaited with the specified arguments.
es: Aserta si el objeto simulado nunca se ha aguardado con los argumentos especificados.

source: Assert the mock has been awaited with the specified calls. The :attr:`await_args_list` list is checked for the awaits.
es: Aserta si el objeto simulado ha sido aguardado con las llamadas especificadas. Para comprobar los aguardos (awaits) se utiliza la lista :attr:`await_args_list`.

source: If *any_order* is false then the awaits must be sequential. There can be extra calls before or after the specified awaits.
es: Si *any_order* es falso, los aguardos (awaits) deben ser secuenciales. No puede haber llamadas adicionales antes o después de los aguardos especificados.

source: If *any_order* is true then the awaits can be in any order, but they must all appear in :attr:`await_args_list`.
es: Si *any_order* es verdadero, entonces los aguardos (awaits) pueden estar en cualquier orden, pero deben aparecer todos en :attr:`await_args_list`.

source: Assert that the mock was never awaited.
es: Aserta si el objeto simulado nunca ha sido aguardado.

source: See :func:`Mock.reset_mock`. Also sets :attr:`await_count` to 0, :attr:`await_args` to None, and clears the :attr:`await_args_list`.
es: Consultar :func:`Mock.reset_mock`. Además, también establece :attr:`await_count` a 0, :attr:`await_args` a None y borra :attr:`await_args_list`.

source: An integer keeping track of how many times the mock object has been awaited.
es: Un registro entero de cuántas veces se ha aguardado el objeto simulado.

source: This is either ``None`` (if the mock hasn’t been awaited), or the arguments that the mock was last awaited with. Functions the same as :attr:`Mock.call_args`.
es: Este atributo es ``None`` (si el objeto simulado no se ha aguardado) o los argumentos con los que fue aguardado la última vez. Su funcionamiento es idéntico al de :attr:`Mock.call_args`.

source: This is a list of all the awaits made to the mock object in sequence (so the length of the list is the number of times it has been awaited). Before any awaits have been made it is an empty list.
es: Es una lista de todas los aguardos (awaits) realizados en el objeto simulado de forma secuencial (por lo que la longitud de la lista es el número de veces que se ha aguardado el objeto). Si no se han realizado aguardos previos, es una lista vacía.

source: Calling
es: Llamar a los objetos simulados

source: Mock objects are callable. The call will return the value set as the :attr:`~Mock.return_value` attribute. The default return value is a new Mock object; it is created the first time the return value is accessed (either explicitly or by calling the Mock) - but it is stored and the same one returned each time.
es: Los objetos Mock son invocables. La llamada a uno retornará el valor establecido en el atributo :attr:`~Mock.return_value`. El valor de retorno por defecto es un nuevo objeto Mock, el cual se crea la primera vez que se accede al valor de retorno (ya sea explícitamente o llamando al objeto Mock). Una vez creado, se almacena y el mismo objeto es retornado cada vez que se solicita.

source: Calls made to the object will be recorded in the attributes like :attr:`~Mock.call_args` and :attr:`~Mock.call_args_list`.
es: Las llamadas realizadas al objeto serán registradas en los atributos :attr:`~Mock.call_args` y :attr:`~Mock.call_args_list`.

source: If :attr:`~Mock.side_effect` is set then it will be called after the call has been recorded, so if :attr:`side_effect` raises an exception the call is still recorded.
es: Si :attr:`~Mock.side_effect` se establece, será invocado después de que la llamada haya sido registrada, por lo que la llamada se registra aunque :attr:`side_effect` lance una excepción.

source: The simplest way to make a mock raise an exception when called is to make :attr:`~Mock.side_effect` an exception class or instance:
es: La forma más sencilla de hacer que un objeto simulado lance de una excepción cuando sea invocado es establecer su atributo :attr:`~Mock.side_effect` como una clase o instancia de excepción:

source: If :attr:`side_effect` is a function then whatever that function returns is what calls to the mock return. The :attr:`side_effect` function is called with the same arguments as the mock. This allows you to vary the return value of the call dynamically, based on the input:
es: Si :attr:`side_effect` es una función, la llamada al objeto simulado retornará lo que sea que esta función retorne. La función establecida en :attr:`side_effect` se llama con los mismos argumentos con los que el objeto simulado ha sido invocado. Esto te permite variar el valor de retorno de la llamada dinámicamente, en función de la entrada:

source: If you want the mock to still return the default return value (a new mock), or any set return value, then there are two ways of doing this. Either return :attr:`mock.return_value` from inside :attr:`side_effect`, or return :data:`DEFAULT`:
es: Si se desea que el objeto simulado aún retorne el valor por defecto (un nuevo objeto simulado), o cualquier valor de retorno establecido, entonces existen dos maneras de proceder. Se puede retornar tanto el atributo :attr:`mock.return_value` como :data:`DEFAULT` desde :attr:`side_effect`:

source: To remove a :attr:`side_effect`, and return to the default behaviour, set the :attr:`side_effect` to ``None``:
es: Para eliminar un :attr:`side_effect`, volviendo al comportamiento predeterminado, establece el atributo :attr:`side_effect` en ``None``:

source: The :attr:`side_effect` can also be any iterable object. Repeated calls to the mock will return values from the iterable (until the iterable is exhausted and a :exc:`StopIteration` is raised):
es: El atributo :attr:`side_effect` también puede ser cualquier objeto iterable. En este caso, las llamadas repetidas al objeto simulado irán retornando valores del iterable (hasta que el iterable se agote, momento en el que se lanza una excepción :exc:`StopIteration`):

source: If any members of the iterable are exceptions they will be raised instead of returned::
es: Si cualquier miembro del iterable es una excepción, se lanzará en lugar de retornarse:

source: Deleting Attributes
es: Eliminar atributos

source: Mock objects create attributes on demand. This allows them to pretend to be objects of any type.
es: Los objetos simulados crean atributos en demanda. Esto les permite hacerse pasar por objetos de cualquier tipo.
