Repository: python/python-docs-es
Catalog: library/unittest.mock.po
Languages: es

source: ``__get__``, ``__set__`` and ``__delete__``
es: ``__get__``, ``__set__`` y ``__delete__``

source: ``__reversed__`` and ``__missing__``
es: ``__reversed__`` y ``__missing__``

source: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
es: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` y ``__setstate__``

source: ``__getformat__`` and ``__setformat__``
es: ``__getformat__`` y ``__setformat__``

source: Magic methods *should* be looked up on the class rather than the instance. Different versions of Python are inconsistent about applying this rule. The supported protocol methods should work with all supported versions of Python.
es: Los métodos mágicos *deben* ser buscados en la clase en lugar de en la instancia. Diferentes versiones de Python son inconsistentes sobre la aplicación de esta regla. Los métodos de protocolo soportados deben trabajar con todas las versiones de Python.

source: The function is basically hooked up to the class, but each ``Mock`` instance is kept isolated from the others.
es: La función está básicamente conectada a la clase, pero cada instancia ``Mock`` se mantiene aislada de las demás.

source: Helpers
es: Ayudantes

source: The ``sentinel`` object provides a convenient way of providing unique objects for your tests.
es: El objeto ``sentinel`` proporciona una manera conveniente de proporcionar objetos únicos para tus pruebas.

source: Attributes are created on demand when you access them by name. Accessing the same attribute will always return the same object. The objects returned have a sensible repr so that test failure messages are readable.
es: Los atributos se crean a demanda, en el instante en el que se accede a ellos por su nombre por primera vez. El acceso al mismo atributo siempre retornará el mismo objeto. Los objetos retornados tienen una reproducción (repr) apropiada para que los mensajes de error de la prueba sean legibles.

source: The ``sentinel`` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`.
es: Los atributos ``sentinel`` ahora preservan su identidad cuando son :mod:`copiados <copy>` o :mod:`serializados con pickle <pickle>`.

source: Sometimes when testing you need to test that a specific object is passed as an argument to another method, or returned. It can be common to create named sentinel objects to test this. :data:`sentinel` provides a convenient way of creating and testing the identity of objects like this.
es: A veces, cuando implementas pruebas, necesitas probar que un determinado objeto se pasa como argumento a otro método, o se retorna. Crear objetos centinela con un nombre para probar esto puede ser una práctica común. :data:`sentinel` proporciona una manera conveniente de crear y probar la identidad de este tipo de objetos.

source: In this example we monkey patch ``method`` to return ``sentinel.some_object``:
es: En el siguiente ejemplo, parcheamos ``method`` para retornar ``sentinel.some_object``:

source: The :data:`DEFAULT` object is a pre-created sentinel (actually ``sentinel.DEFAULT``). It can be used by :attr:`~Mock.side_effect` functions to indicate that the normal return value should be used.
es: El objeto :data:`DEFAULT` es un centinela pre-creado (actualmente ``sentinel.DEFAULT``). Puede ser usado por las funciones :attr:`~Mock.side_effect` para indicar que el valor de retorno normal debe ser utilizado.

source: :func:`call` is a helper object for making simpler assertions, for comparing with :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` and :attr:`~Mock.method_calls`. :func:`call` can also be used with :meth:`~Mock.assert_has_calls`.
es: :func:`call` es un objeto ayudante que puede usarse para hacer aserciones simples, para comparar con :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` y :attr:`~Mock.method_calls`. :func:`call` y también se puede utilizar con :meth:`~Mock.assert_has_calls`.

source: For a call object that represents multiple calls, :meth:`call_list` returns a list of all the intermediate calls as well as the final call.
es: Para un objeto call que representa múltiples llamadas, el método :meth:`call_list` retorna una lista con todas las llamadas intermedias, así como la llamada final.

source: ``call_list`` is particularly useful for making assertions on "chained calls". A chained call is multiple calls on a single line of code. This results in multiple entries in :attr:`~Mock.mock_calls` on a mock. Manually constructing the sequence of calls can be tedious.
es: ``call_list`` es particularmente útil para hacer aserciones sobre "llamadas encadenadas". Una llamada encadenada es varias llamadas en una sola línea de código. Esto resulta en múltiples entradas en el atributo :attr:`~Mock.mock_calls` de un objeto simulado. Construir manualmente la secuencia de llamadas puede ser tedioso.

source: :meth:`~call.call_list` can construct the sequence of calls from the same chained call:
es: :meth:`~call.call_list` puede construir la secuencia de llamadas desde la misma llamada encadenada:

source: A ``call`` object is either a tuple of (positional args, keyword args) or (name, positional args, keyword args) depending on how it was constructed. When you construct them yourself this isn't particularly interesting, but the ``call`` objects that are in the :attr:`Mock.call_args`, :attr:`Mock.call_args_list` and :attr:`Mock.mock_calls` attributes can be introspected to get at the individual arguments they contain.
es: Un objeto ``call``, dependiendo de cómo fuera construido, puede ser una tupla de la forma (argumentos posicionales, argumentos por palabras clave) o bien de la forma (nombre, argumentos posicionales, argumentos por palabras clave). Esto no es particularmente interesante cuando los construyes por ti mismo, pero la introspección de los objetos ``call`` que conforman los atributos :attr:`Mock.call_args`, :attr:`Mock.call_args_list` y :attr:`Mock.mock_calls` si pueden ser de utilidad para para acceder a los argumentos individuales que contienen.

source: The ``call`` objects in :attr:`Mock.call_args` and :attr:`Mock.call_args_list` are two-tuples of (positional args, keyword args) whereas the ``call`` objects in :attr:`Mock.mock_calls`, along with ones you construct yourself, are three-tuples of (name, positional args, keyword args).
es: Los objetos ``call`` en :attr:`Mock.call_args` y :attr:`Mock.call_args_list` están conformados por dos tuplas (argumentos posicionales, argumentos por palabra clave) mientras que los objetos ``call`` en :attr:`Mock.mock_calls`, junto con los que construyas por ti mismo, constan de tres tuplas (nombre, argumentos posicionales, argumentos por palabra clave).

source: You can use their "tupleness" to pull out the individual arguments for more complex introspection and assertions. The positional arguments are a tuple (an empty tuple if there are no positional arguments) and the keyword arguments are a dictionary:
es: Puedes utilizar esta presentación en forma de tuplas para obtener los argumentos individuales, con la finalidad de llevar a cabo introspección y aserciones más complejas. Los argumentos posicionales son una tupla (vacía si no hay ninguno) y los argumentos por palabra clave son un diccionario:

source: Create a mock object using another object as a spec. Attributes on the mock will use the corresponding attribute on the *spec* object as their spec.
es: Crea un nuevo objeto simulado utilizando otro objeto (*spec*) como especificación. Los atributos del objeto simulado utilizarán el atributo correspondiente del objeto *spec* como su especificación.

source: Functions or methods being mocked will have their arguments checked to ensure that they are called with the correct signature.
es: Los argumentos de las funciones o métodos simulados se validarán para asegurarse de que son invocados con la firma correcta.

source: If *spec_set* is ``True`` then attempting to set attributes that don't exist on the spec object will raise an :exc:`AttributeError`.
es: Si *spec_set* es ``True``, tratar de establecer atributos que no existen en el objeto especificado lanzará una excepción :exc:`AttributeError`.

source: If a class is used as a spec then the return value of the mock (the instance of the class) will have the same spec. You can use a class as the spec for an instance object by passing ``instance=True``. The returned mock will only be callable if instances of the mock are callable.
es: Si se utiliza una clase como especificación, el valor de retorno del objeto simulado (la instancia de la clase) tendrá la misma especificación. Se puede utilizar una clase como especificación de una instancia pasando ``instance=True``. El objeto simulado retornado sólo será invocable si las instancias del objeto simulado son también invocables.

source: :func:`create_autospec` also takes arbitrary keyword arguments that are passed to the constructor of the created mock.
es: :func:`create_autospec` también acepta argumentos por palabra clave arbitrarios, que son pasados al constructor del objeto simulado creado.

source: See :ref:`auto-speccing` for examples of how to use auto-speccing with :func:`create_autospec` and the *autospec* argument to :func:`patch`.
es: Consultar :ref:`auto-speccing` para ver ejemplos de cómo utilizar la autoespecificación mediante :func:`create_autospec` y el argumento *autospec* de :func:`patch`.

source: :func:`create_autospec` now returns an :class:`AsyncMock` if the target is an async function.
es: :func:`create_autospec` ahora retorna un objeto :class:`AsyncMock` si el objetivo a simular es una función asíncrona.

source: Sometimes you may need to make assertions about *some* of the arguments in a call to mock, but either not care about some of the arguments or want to pull them individually out of :attr:`~Mock.call_args` and make more complex assertions on them.
es: A veces puede que necesites hacer aserciones sobre *algunos* de los argumentos de una llamada al objeto simulado, pero sin preocuparte por el resto, o puede que quieras hacer uso de ellos de forma individual fuera de :attr:`~Mock.call_args` y hacer aserciones más complejas con ellos.

source: To ignore certain arguments you can pass in objects that compare equal to *everything*. Calls to :meth:`~Mock.assert_called_with` and :meth:`~Mock.assert_called_once_with` will then succeed no matter what was passed in.
es: Para ignorar ciertos argumentos puedes pasar objetos que se comparan como iguales con *cualquier cosa*. En este caso, las llamadas a :meth:`~Mock.assert_called_with` y :meth:`~Mock.assert_called_once_with` tendrán éxito sin importar lo que se haya pasado realmente.

source: :data:`ANY` can also be used in comparisons with call lists like :attr:`~Mock.mock_calls`:
es: :data:`ANY` también se puede utilizar en las comparaciones con las listas de llamadas, como :attr:`~Mock.mock_calls`:

source: :data:`FILTER_DIR` is a module level variable that controls the way mock objects respond to :func:`dir` (only for Python 2.6 or more recent). The default is ``True``, which uses the filtering described below, to only show useful members. If you dislike this filtering, or need to switch it off for diagnostic purposes, then set ``mock.FILTER_DIR = False``.
es: :data:`FILTER_DIR` es una variable definida a nivel de módulo que controla la forma en la que los objetos simulados responden a :func:`dir` (sólo para Python 2.6 y en adelante). El valor predeterminado es ``True``, que utiliza el filtrado descrito a continuación, con la finalidad de mostrar solo los miembros considerados como útiles. Si no te gusta este filtrado, o necesitas desactivarlo con fines de diagnóstico, simplemente establece ``mock.FILTER_DIR = False``.

source: With filtering on, ``dir(some_mock)`` shows only useful attributes and will include any dynamically created attributes that wouldn't normally be shown. If the mock was created with a *spec* (or *autospec* of course) then all the attributes from the original are shown, even if they haven't been accessed yet:
es: Con el filtrado activado, ``dir(some_mock)`` mostrará solo atributos útiles y además incluirá cualquier atributo creado dinámicamente, que normalmente no se mostraría. Si el objeto simulado fue creado con un *spec* (o *autospec*) se muestran todos los atributos del objeto original, incluso si no se ha accedido a ellos todavía:

source: Many of the not-very-useful (private to :class:`Mock` rather than the thing being mocked) underscore and double underscore prefixed attributes have been filtered from the result of calling :func:`dir` on a :class:`Mock`. If you dislike this behaviour you can switch it off by setting the module level switch :data:`FILTER_DIR`:
es: Muchos de los atributos con subrayado y doble subrayado no muy útiles (atributos privados de :class:`Mock` y no del objeto real que se está simulando) se han filtrado del resultado de llamar a :func:`dir` en un objeto :class:`Mock`. Si no te gusta este comportamiento, puedes desactivarlo estableciendo el modificador a nivel de módulo :data:`FILTER_DIR`:

source: Alternatively you can just use ``vars(my_mock)`` (instance members) and ``dir(type(my_mock))`` (type members) to bypass the filtering irrespective of :data:`mock.FILTER_DIR`.
es: Como alternativa, puedes usar ``vars(my_mock)`` (miembros de instancia) y ``dir(type(my_mock))`` (miembros de tipo) para omitir el filtrado con independencia del valor de :data:`mock.FILTER_DIR`.

source: A helper function to create a mock to replace the use of :func:`open`. It works for :func:`open` called directly or used as a context manager.
es: Una función auxiliar que permite crear un objeto simulado con la finalidad de reemplazar el uso de :func:`open`. Funciona para simular llamadas directas a :func:`open` y para aquellos casos en los que es utilizada como gestor de contexto.

source: The *mock* argument is the mock object to configure. If ``None`` (the default) then a :class:`MagicMock` will be created for you, with the API limited to methods or attributes available on standard file handles.
es: El argumento *mock* es el objeto simulado a configurar. Si es ``None`` (por defecto) un objeto :class:`MagicMock` se creará para ti, con la API limitada a métodos o atributos disponibles en los gestores de fichero estándares.

source: *read_data* is a string for the :meth:`~io.IOBase.read`, :meth:`~io.IOBase.readline`, and :meth:`~io.IOBase.readlines` methods of the file handle to return. Calls to those methods will take data from *read_data* until it is depleted. The mock of these methods is pretty simplistic: every time the *mock* is called, the *read_data* is rewound to the start. If you need more control over the data that you are feeding to the tested code you will need to customize this mock for yourself. When that is insufficient, one of the in-memory filesystem packages on `PyPI <https://pypi.org>`_ can offer a realistic filesystem for testing.
es: *read_data* es una cadena de caracteres para los métodos :meth:`~io.IOBase.read`, :meth:`~io.IOBase.readline` y :meth:`~io.IOBase.readlines` del gestor de fichero a retornar. Las llamadas a los métodos tomarán datos de *read_data* hasta que se agote. El objeto simulado de estos métodos es bastante simple: cada vez que el *mock* se llama, *read_data* se rebobina hasta el principio. Si necesitas más control sobre los datos que estás proporcionando al código de prueba tendrás que personalizar el objeto simulado. Cuando eso no sea suficiente, alguno de los paquetes que implementan sistemas de archivos en memoria disponible en `PyPI <https://pypi.org>`_ puede ofrecer un sistema de archivos realista para usar en las pruebas.

source: Added :meth:`~io.IOBase.readline` and :meth:`~io.IOBase.readlines` support. The mock of :meth:`~io.IOBase.read` changed to consume *read_data* rather than returning it on each call.
es: Se añadió soporte para :meth:`~io.IOBase.readline` y :meth:`~io.IOBase.readlines`. El objeto simulado de :meth:`~io.IOBase.read` ahora consume datos de *read_data*, en lugar de retornarlo en cada llamada.

source: *read_data* is now reset on each call to the *mock*.
es: *read_data* ahora es restablecido en cada llamada al *mock*.

source: Added :meth:`__iter__` to implementation so that iteration (such as in for loops) correctly consumes *read_data*.
es: Se añadió el método :meth:`__iter__` a la implementación, de manera que la iteración (como ocurre en los bucles) consume apropiadamente *read_data*.

source: Using :func:`open` as a context manager is a great way to ensure your file handles are closed properly and is becoming common::
es: Usar :func:`open` como gestor de contexto es una buena manera de asegurarse de que los gestores de archivos se cierren correctamente al terminar y se está convirtiendo en una práctica común:

source: The issue is that even if you mock out the call to :func:`open` it is the *returned object* that is used as a context manager (and has :meth:`__enter__` and :meth:`__exit__` called).
es: El problema es que, incluso si simulas la llamada a :func:`open`, es el *objeto retornado* el que se utiliza como gestor de contexto (lo que conlleva que sus métodos :meth:`__enter__` y :meth:`__exit__` son invocados).

source: Mocking context managers with a :class:`MagicMock` is common enough and fiddly enough that a helper function is useful. ::
es: Simular gestores de contexto con un :class:`MagicMock` es lo suficientemente común y complicado como para que una función auxiliar sea útil:

source: And for reading files::
es: Y para la lectura de archivos:

source: Autospeccing
es: Autoespecificación

source: Autospeccing is based on the existing :attr:`spec` feature of mock. It limits the api of mocks to the api of an original object (the spec), but it is recursive (implemented lazily) so that attributes of mocks only have the same api as the attributes of the spec. In addition mocked functions / methods have the same call signature as the original so they raise a :exc:`TypeError` if they are called incorrectly.
es: La autoespecificación se basa en la característica :attr:`spec` ya existente en el objeto simulado. Limita la API de los objetos simulados a la API del objeto original (la especificación), pero es recursiva (implementada de forma perezosa), de modo que los atributos del objeto simulado sólo tienen la misma API que los atributos de la especificación. Además, las funciones / métodos simuladas tienen la misma firma de llamada que la original y lanzan una excepción :exc:`TypeError` si se les llama incorrectamente.

source: Before I explain how auto-speccing works, here's why it is needed.
es: Antes de explicar cómo funciona la autoespecificación, he aquí por qué se necesita.

source: :class:`Mock` is a very powerful and flexible object, but it suffers from two flaws when used to mock out objects from a system under test. One of these flaws is specific to the :class:`Mock` api and the other is a more general problem with using mock objects.
es: :class:`Mock` es un objeto muy potente y flexible, pero adolece de dos defectos cuando se utiliza para simular objetos de un sistema bajo prueba. Uno de estos defectos es específico de la API de :class:`Mock` y el otro es un problema más genérico referente al uso de objetos simulados.

source: First the problem specific to :class:`Mock`. :class:`Mock` has two assert methods that are extremely handy: :meth:`~Mock.assert_called_with` and :meth:`~Mock.assert_called_once_with`.
es: En primer lugar, el problema específico a :class:`Mock`. :class:`Mock` tiene dos métodos de aserción que son extremadamente útiles: :meth:`~Mock.assert_called_with` y :meth:`~Mock.assert_called_once_with`.

source: Because mocks auto-create attributes on demand, and allow you to call them with arbitrary arguments, if you misspell one of these assert methods then your assertion is gone:
es: Debido a que los objetos simulados crean automáticamente atributos según demanda y además permiten que se les llame con argumentos arbitrarios, si escribes mal uno de estos métodos de aserción, la utilidad de esa aserción desaparece:

source: Your tests can pass silently and incorrectly because of the typo.
es: Tus pruebas pueden pasar silenciosamente y de forma incorrecta debido al error tipográfico.

source: The second issue is more general to mocking. If you refactor some of your code, rename members and so on, any tests for code that is still using the *old api* but uses mocks instead of the real objects will still pass. This means your tests can all pass even though your code is broken.
es: El segundo problema es algo más general en las simulaciones. Si refactorizas parte de tu código, cambias el nombre de los miembros, etc., las pruebas para el código que siguen utilizando la *antigua API*, pero utilizan objetos simulados en lugar de los objetos reales, todavía pasarán las pruebas. Esto significa que tus pruebas pueden validarlo todo sin problemas, a pesar de que el código esté roto.

source: Note that this is another reason why you need integration tests as well as unit tests. Testing everything in isolation is all fine and dandy, but if you don't test how your units are "wired together" there is still lots of room for bugs that tests might have caught.
es: Ten en cuenta que esta es otra razón por la que necesitas pruebas de integración además de pruebas unitarias. Probar todo de forma aislada está muy bien, pero si no pruebas cómo están "conectadas entre sí" tus unidades, todavía hay mucho espacio para errores que las pruebas deberían haber detectado.

source: :mod:`mock` already provides a feature to help with this, called speccing. If you use a class or instance as the :attr:`spec` for a mock then you can only access attributes on the mock that exist on the real class:
es: :mod:`mock` ya proporciona una característica para ayudar con esto, llamada especificación. Si se utiliza una clase o instancia como atributo :attr:`spec` de un objeto simulado, entonces solo puedes acceder a los atributos del mismo que existe en la clase real:

source: The spec only applies to the mock itself, so we still have the same issue with any methods on the mock:
es: La especificación sólo se aplica al propio objeto simulado, por lo que aún tenemos el mismo problema con cualquiera de los métodos del mismo:

source: Auto-speccing solves this problem. You can either pass ``autospec=True`` to :func:`patch` / :func:`patch.object` or use the :func:`create_autospec` function to create a mock with a spec. If you use the ``autospec=True`` argument to :func:`patch` then the object that is being replaced will be used as the spec object. Because the speccing is done "lazily" (the spec is created as attributes on the mock are accessed) you can use it with very complex or deeply nested objects (like modules that import modules that import modules) without a big performance hit.
es: La autoespecificación resuelve este problema. Puedes pasar ``autospec=True`` a :func:`patch` / :func:`patch.object` o utilizar la función :func:`create_autospec` para crear un objeto simulado con una especificación. Si utilizas el argumento ``autospec=True`` de :func:`patch`, el objeto que se va a reemplazar se utiliza como objeto de especificación. Debido a que la especificación se hace "perezosamente" (la especificación se crea en el instante en el que se accede a los atributos del objeto simulado, no antes), se puede utilizar con objetos muy complejos o anidadas (como módulos que importan módulos que, a su vez, importan otros módulos) sin un gran impacto en el rendimiento.

source: Here's an example of it in use::
es: He aquí un ejemplo de ello en acción:
