Repository: python/python-docs-es
Catalog: library/unittest.mock.po
Languages: es

source: :mod:`unittest.mock` --- mock object library
es: :mod:`unittest.mock` --- Biblioteca de objetos simulados

source: :mod:`unittest.mock` is a library for testing in Python. It allows you to replace parts of your system under test with mock objects and make assertions about how they have been used.
es: :mod:`unittest.mock` es una biblioteca para pruebas de software en Python. Te permite reemplazar partes del sistema bajo prueba con objetos simulados y hacer aserciones sobre cómo se han utilizado.

source: :mod:`unittest.mock` provides a core :class:`Mock` class removing the need to create a host of stubs throughout your test suite. After performing an action, you can make assertions about which methods / attributes were used and arguments they were called with. You can also specify return values and set needed attributes in the normal way.
es: El módulo :mod:`unittest.mock` proporciona una clase principal :class:`Mock` eliminando la necesidad de crear una gran cantidad de stubs en todo el conjunto de pruebas. Después de realizar una determinada acción, puedes hacer aserciones sobre qué métodos/atributos se usaron y los argumentos con los que se llamaron. También puedes especificar valores de retorno y establecer los atributos necesarios de la forma habitual.

source: Additionally, mock provides a :func:`patch` decorator that handles patching module and class level attributes within the scope of a test, along with :const:`sentinel` for creating unique objects. See the `quick guide`_ for some examples of how to use :class:`Mock`, :class:`MagicMock` and :func:`patch`.
es: Además, mock proporciona un decorador :func:`patch` que puede manejar el parcheo de atributos a nivel de clase y de módulo dentro del ámbito de una prueba, junto con :const:`sentinel` para crear objetos únicos. Consulta `quick guide`_ para ver algunos ejemplos de cómo utilizar :class:`Mock`, :class:`MagicMock` y :func:`patch`.

source: There is a backport of :mod:`unittest.mock` for earlier versions of Python, available as `mock on PyPI <https://pypi.org/project/mock>`_.
es: Hay un backport del módulo :mod:`unittest.mock` para versiones anteriores de Python `disponible en PyPI <https://pypi.org/project/mock>`_.

source: Quick Guide
es: Guía rápida

source: :class:`Mock` and :class:`MagicMock` objects create all attributes and methods as you access them and store details of how they have been used. You can configure them, to specify return values or limit what attributes are available, and then make assertions about how they have been used:
es: Los objetos de las clases :class:`Mock` y :class:`MagicMock` van creando todos los atributos y métodos a medida que se accede a ellos y almacenan detalles de cómo se han utilizado. Puedes configurarlos para especificar valores de retorno o limitar qué atributos están disponibles y posteriormente hacer aserciones sobre cómo han sido utilizados:

source: :attr:`side_effect` allows you to perform side effects, including raising an exception when a mock is called:
es: :attr:`side_effect` te permite implementar efectos colaterales, lo que incluye lanzar una excepción cuando se llama a un objeto simulado:

source: Mock has many other ways you can configure it and control its behaviour. For example the *spec* argument configures the mock to take its specification from another object. Attempting to access attributes or methods on the mock that don't exist on the spec will fail with an :exc:`AttributeError`.
es: Existen muchas otras formas de configurar y controlar el comportamiento de Mock. Por ejemplo, el argumento *spec* configura el objeto simulado para que tome su especificación de otro objeto. Cualquier intento de acceder a atributos o métodos en el objeto simulado que no existan en la especificación fallará lanzando una excepción :exc:`AttributeError`.

source: The :func:`patch` decorator / context manager makes it easy to mock classes or objects in a module under test. The object you specify will be replaced with a mock (or other object) during the test and restored when the test ends::
es: El decorador / gestor de contexto :func:`patch` facilita la simulación de clases u objetos en un módulo bajo prueba. El objeto que especifiques será reemplazado por un objeto simulado (u otro objeto) durante la prueba y será restaurado cuando esta finalice:

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``module.ClassName1`` is passed in first.
es: Cuando anidas decoradores patch, los objetos simulados se pasan a la función decorada en el mismo orden en el que fueron aplicados (el orden normal en el que se aplican los decoradores en *Python*). Esto significa de abajo hacia arriba, por lo que en el ejemplo anterior se pasa primero el objeto simulado para ``module.ClassName1``.

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
es: Al usar :func:`patch` es importante que parchees los objetos en el espacio de nombres donde son buscados. Esto normalmente es sencillo, pero para una guía rápida, lee :ref:`dónde parchear <where-to-patch>`.

source: As well as a decorator :func:`patch` can be used as a context manager in a with statement:
es: Además de decorador, la función :func:`patch` se puede usar como gestor de contexto en una declaración with:

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
es: También existe la función :func:`patch.dict` que permite establecer valores en un diccionario dentro de un ámbito y restaurar el diccionario a su estado original cuando finaliza la prueba:

source: Mock supports the mocking of Python :ref:`magic methods <magic-methods>`. The easiest way of using magic methods is with the :class:`MagicMock` class. It allows you to do things like:
es: Mock admite la simulación de los :ref:`métodos mágicos <magic-methods>` de Python. La forma más sencilla de utilizar métodos mágicos es mediante la clase :class:`MagicMock`. Te permite hacer cosas como:

source: Mock allows you to assign functions (or other Mock instances) to magic methods and they will be called appropriately. The :class:`MagicMock` class is just a Mock variant that has all of the magic methods pre-created for you (well, all the useful ones anyway).
es: Mock también permite asignar funciones (u otras instancias de Mock) a métodos mágicos y se asegura de que serán llamadas de forma apropiada. La clase :class:`MagicMock` es solo una variante de Mock con la diferencia de que tiene todos los métodos mágicos previamente creados para ti (bueno, todos los que son útiles).

source: The following is an example of using magic methods with the ordinary Mock class:
es: El siguiente es un ejemplo de uso de métodos mágicos utilizando la clase Mock ordinaria:

source: For ensuring that the mock objects in your tests have the same api as the objects they are replacing, you can use :ref:`auto-speccing <auto-speccing>`. Auto-speccing can be done through the *autospec* argument to patch, or the :func:`create_autospec` function. Auto-speccing creates mock objects that have the same attributes and methods as the objects they are replacing, and any functions and methods (including constructors) have the same call signature as the real object.
es: Para asegurarte de que los objetos simulados en tus pruebas tienen exactamente la misma API que los objetos que están reemplazando, puedes usar :ref:`autoespecificación <auto-speccing>`. La autoespecificación se puede realizar a través del argumento *autospec* de patch, o mediante la función :func:`create_autospec`. La autoespecificación crea objetos simulados que tienen los mismos atributos y métodos que los objetos que están reemplazando, y todas las función y métodos (incluidos los constructores) tienen la misma firma de llamada que los objetos reales.

source: This ensures that your mocks will fail in the same way as your production code if they are used incorrectly:
es: Esto asegura que tus simulaciones fallarán, si se utilizan incorrectamente, de la misma manera que lo haría tu código en producción:

source: :func:`create_autospec` can also be used on classes, where it copies the signature of the ``__init__`` method, and on callable objects where it copies the signature of the ``__call__`` method.
es: :func:`create_autospec` también se puede usar en clases, donde copia la firma del método ``__init__``, y en objetos invocables, donde copia la firma del método ``__call__``.

source: The Mock Class
es: La clase Mock

source: :class:`Mock` is a flexible mock object intended to replace the use of stubs and test doubles throughout your code. Mocks are callable and create attributes as new mocks when you access them [#]_. Accessing the same attribute will always return the same mock. Mocks record how you use them, allowing you to make assertions about what your code has done to them.
es: :class:`Mock` es un objeto simulado flexible, destinado a reemplazar el uso de stubs y dobles de prueba en todo tu código. Los objetos Mock son invocables y crean atributos en el mismo momento que se accede a ellos como nuevos objetos Mock [#]_. Acceder al mismo atributo siempre retornará el mismo objeto Mock. Además, registran cómo los usas, lo que te permite hacer aserciones sobre cómo tu código ha interaccionado con ellos.

source: :class:`MagicMock` is a subclass of :class:`Mock` with all the magic methods pre-created and ready to use. There are also non-callable variants, useful when you are mocking out objects that aren't callable: :class:`NonCallableMock` and :class:`NonCallableMagicMock`
es: :class:`MagicMock` es una subclase de :class:`Mock` con todos los métodos mágicos creados previamente y listos para ser usados. También hay variantes no invocables, útiles cuando se están simulando objetos que no se pueden llamar: :class:`NonCallableMock` y :class:`NonCallableMagicMock`

source: The :func:`patch` decorators makes it easy to temporarily replace classes in a particular module with a :class:`Mock` object. By default :func:`patch` will create a :class:`MagicMock` for you. You can specify an alternative class of :class:`Mock` using the *new_callable* argument to :func:`patch`.
es: Los decoradores :func:`patch` facilitan la sustitución temporal de clases en un módulo en particular con un objeto :class:`Mock`. Por defecto, :func:`patch` creará un objeto :class:`MagicMock` automáticamente. Se puede especificar una clase alternativa a :class:`Mock` usando el argumento *new_callable* de :func:`patch`.

source: Create a new :class:`Mock` object. :class:`Mock` takes several optional arguments that specify the behaviour of the Mock object:
es: Crea un nuevo objeto :class:`Mock`. :class:`Mock` toma varios argumentos opcionales que especifican el comportamiento del objeto Mock:

source: *spec*: This can be either a list of strings or an existing object (a class or instance) that acts as the specification for the mock object. If you pass in an object then a list of strings is formed by calling dir on the object (excluding unsupported magic attributes and methods). Accessing any attribute not in this list will raise an :exc:`AttributeError`.
es: *spec*: Puede ser una lista de cadenas de caracteres o un objeto existente previamente (una clase o una instancia) que actúa como la especificación del objeto simulado. Si pasas un objeto, se forma una lista de cadenas llamando a la función *dir* en el objeto (excluyendo los métodos y atributos mágicos no admitidos). Acceder a cualquier atributo que no esté en esta lista generará una excepción :exc:`AttributeError`.

source: If *spec* is an object (rather than a list of strings) then :attr:`~instance.__class__` returns the class of the spec object. This allows mocks to pass :func:`isinstance` tests.
es: Si *spec* es un objeto (en lugar de una lista de cadenas de caracteres), :attr:`~instance.__class__` retorna la clase del objeto especificado. Esto permite que los objetos simulados pasen las pruebas de :func:`isinstance`.

source: *spec_set*: A stricter variant of *spec*. If used, attempting to *set* or get an attribute on the mock that isn't on the object passed as *spec_set* will raise an :exc:`AttributeError`.
es: *spec_set*: Una variante más estricta de *spec*. Si se utiliza, cualquier intento de *establecer* u obtener un atributo del objeto simulado que no esté en el objeto pasado como *spec_set* lanzará una excepción :exc:`AttributeError`.

source: *side_effect*: A function to be called whenever the Mock is called. See the :attr:`~Mock.side_effect` attribute. Useful for raising exceptions or dynamically changing return values. The function is called with the same arguments as the mock, and unless it returns :data:`DEFAULT`, the return value of this function is used as the return value.
es: *side_effect*: Una función que se llamará cada vez que el objeto simulado sea invocado. Consultar el atributo :attr:`~Mock.side_effect` para más información. Es útil para lanzar excepciones o para cambiar dinámicamente valores de retorno. La función se llama con los mismos argumentos que el objeto simulado, y a menos que retorne :data:`DEFAULT`, su valor de retorno se utiliza como valor de retorno del propio objeto simulado.

source: Alternatively *side_effect* can be an exception class or instance. In this case the exception will be raised when the mock is called.
es: Alternativamente *side_effect* puede ser una clase o instancia de excepción. En este caso, se lanza la excepción cuando se llama al objeto simulado.

source: If *side_effect* is an iterable then each call to the mock will return the next value from the iterable.
es: Si *side_effect* es un iterable, cada llamada al objeto simulado retornará el siguiente valor del iterable.

source: A *side_effect* can be cleared by setting it to ``None``.
es: Un *side_effect* se puede desactivar estableciéndolo en ``None``.

source: *return_value*: The value returned when the mock is called. By default this is a new Mock (created on first access). See the :attr:`return_value` attribute.
es: *return_value*: El valor retornado cuando se llama al objeto simulado. Por defecto, este es una nueva instancia de la clase Mock (creada en el primer acceso). Consultar el atributo :attr:`return_value` para más detalles.

source: *unsafe*: By default if any attribute starts with *assert* or *assret* will raise an :exc:`AttributeError`. Passing ``unsafe=True`` will allow access to these attributes.
es: *unsafe*: Por defecto, si cualquier atributo comienza con *assert* o *assret* y se intenta acceder a él, se lanza una excepción :exc:`AttributeError`. Pasar ``unsafe=True`` permitirá el acceso a estos atributos.

source: *wraps*: Item for the mock object to wrap. If *wraps* is not ``None`` then calling the Mock will pass the call through to the wrapped object (returning the real result). Attribute access on the mock will return a Mock object that wraps the corresponding attribute of the wrapped object (so attempting to access an attribute that doesn't exist will raise an :exc:`AttributeError`).
es: *wraps*: objeto a envolver (simular) por la instancia de Mock. Si *wraps* no es ``None``, al llamar al objeto Mock se pasa la llamada a través del objeto envuelto (retornando el resultado real). Acceder a un atributo del objeto simulado retornará otro objeto Mock que envuelve al atributo correspondiente del objeto real envuelto (de modo que intentar acceder a un atributo que no existe lanzará una excepción :exc:`AttributeError`).

source: If the mock has an explicit *return_value* set then calls are not passed to the wrapped object and the *return_value* is returned instead.
es: Si el objeto simulado tiene un *return_value* explícito establecido, las llamadas no se pasan al objeto envuelto y *return_value* se retorna en su lugar.

source: *name*: If the mock has a name then it will be used in the repr of the mock. This can be useful for debugging. The name is propagated to child mocks.
es: *name*: Si el objeto simulado tiene un nombre, será utilizado en la representación imprimible del mismo. Esto puede ser útil para la depuración. El nombre se propaga a los objetos simulados hijos.

source: Mocks can also be called with arbitrary keyword arguments. These will be used to set attributes on the mock after it is created. See the :meth:`configure_mock` method for details.
es: Los objetos simulados también pueden ser invocados con argumentos por palabra clave arbitrarios. Estos serán utilizados para establecer atributos en el objeto simulado una vez creado. Consultar el método :meth:`configure_mock` para más detalles.

source: Assert that the mock was called at least once.
es: Aserta si el objeto simulado se ha invocado al menos una vez.

source: Assert that the mock was called exactly once.
es: Aserta si el objeto simulado se ha invocado exactamente una vez.

source: This method is a convenient way of asserting that the last call has been made in a particular way:
es: Este método es una manera apropiada de asertar si la última llamada se ha realizado de una manera particular:

source: Assert that the mock was called exactly once and that that call was with the specified arguments.
es: Aserta si el objeto simulado se ha invocado exactamente una vez y si esa llamada se realizó con los argumentos especificados.

source: assert the mock has been called with the specified arguments.
es: Aserta si el objeto simulado se ha invocado con los argumentos especificados.

source: The assert passes if the mock has *ever* been called, unlike :meth:`assert_called_with` and :meth:`assert_called_once_with` that only pass if the call is the most recent one, and in the case of :meth:`assert_called_once_with` it must also be the only call.
es: La aserción pasa si el objeto simulado se ha invocado *en algún momento*, a diferencia de :meth:`assert_called_with` y :meth:`assert_called_once_with`, con los que sólo pasa la aserción si la llamada es la más reciente, y en el caso de :meth:`assert_called_once_with` también debe ser la única llamada realizada.

source: assert the mock has been called with the specified calls. The :attr:`mock_calls` list is checked for the calls.
es: Aserta si el objeto simulado se ha invocado con las llamadas especificadas. La lista :attr:`mock_calls` se compara con la lista de llamadas.

source: If *any_order* is false then the calls must be sequential. There can be extra calls before or after the specified calls.
es: Si *any_order* es falso entonces las llamadas deben ser secuenciales. No puede haber llamadas adicionales antes o después de las llamadas especificadas.

source: If *any_order* is true then the calls can be in any order, but they must all appear in :attr:`mock_calls`.
es: Si *any_order* es verdadero, las llamadas pueden estar en cualquier orden, pero deben aparecer todas en :attr:`mock_calls`.

source: Assert the mock was never called.
es: Aserta si el objeto simulado nunca fue invocado.

source: The reset_mock method resets all the call attributes on a mock object:
es: El método *reset_mock* restablece todos los atributos de llamada en un objeto simulado:

source: Added two keyword only argument to the reset_mock function.
es: Se añadieron dos argumentos por palabra clave a la función *reset_mock*.

source: This can be useful where you want to make a series of assertions that reuse the same object. Note that :meth:`reset_mock` *doesn't* clear the return value, :attr:`side_effect` or any child attributes you have set using normal assignment by default. In case you want to reset *return_value* or :attr:`side_effect`, then pass the corresponding parameter as ``True``. Child mocks and the return value mock (if any) are reset as well.
es: Esto puede ser útil cuando se quiere hacer una serie de aserciones que reutilizan el mismo objeto. Ten en cuenta que por defecto :meth:`reset_mock` *no* borra el valor de retorno, :attr:`side_effect`, ni cualquier atributo hijo que hayas establecido mediante asignación normal. En caso de que quieras restablecer *return_value* o :attr:`side_effect`, debes pasar el parámetro correspondiente como ``True``. Los objetos simulados hijos y el objeto simulado que conforma el valor de retorno (si los hay) se restablecen también.

source: *return_value*, and :attr:`side_effect` are keyword only argument.
es: *return_value* y :attr:`side_effect` son argumentos por palabra clave exclusivamente.

source: Add a spec to a mock. *spec* can either be an object or a list of strings. Only attributes on the *spec* can be fetched as attributes from the mock.
es: Agrega una especificación a un objeto simulado. *spec* puede ser un objeto o una lista de cadenas de caracteres. Sólo los atributos presentes en *spec* pueden ser obtenidos desde el objeto simulado.

source: If *spec_set* is true then only attributes on the spec can be set.
es: Si *spec_set* es verdadero, solo los atributos de la especificación pueden ser establecidos.

source: Attach a mock as an attribute of this one, replacing its name and parent. Calls to the attached mock will be recorded in the :attr:`method_calls` and :attr:`mock_calls` attributes of this one.
es: Adjunta otro objeto simulado como un atributo de la instancia actual, substituyendo su nombre y su padre. Las llamadas al objeto simulado adjuntado se registrarán en los atributos :attr:`method_calls` y :attr:`mock_calls` del padre.

source: Set attributes on the mock through keyword arguments.
es: Establece los atributos del objeto simulado por medio de argumentos por palabra clave.

source: Attributes plus return values and side effects can be set on child mocks using standard dot notation and unpacking a dictionary in the method call:
es: Los atributos, los valores de retorno y los efectos de colaterales se pueden configurar en los objetos simulados hijos usando la notación de punto estándar y desempaquetando un diccionario en la llamada al método:

source: The same thing can be achieved in the constructor call to mocks:
es: Lo mismo se puede lograr en la llamada al constructor de los objetos simulados:

source: :meth:`configure_mock` exists to make it easier to do configuration after the mock has been created.
es: :meth:`configure_mock` existe con el fin de facilitar la configuración después de que el objeto simulado haya sido creado.

source: :class:`Mock` objects limit the results of ``dir(some_mock)`` to useful results. For mocks with a *spec* this includes all the permitted attributes for the mock.
es: Los objetos :class:`Mock` limitan los resultados de ``dir(some_mock)`` a resultados útiles. Para los objetos simulados con una especificación (*spec*), esto incluye todos los atributos permitidos para el mismo.

source: See :data:`FILTER_DIR` for what this filtering does, and how to switch it off.
es: Consultar :data:`FILTER_DIR` para conocer que hace este filtrado y la forma de desactivarlo.

source: Create the child mocks for attributes and return value. By default child mocks will be the same type as the parent. Subclasses of Mock may want to override this to customize the way child mocks are made.
es: Crea los objetos simulados hijos para los atributos y el valor de retorno. Por defecto los objetos simulados hijos serán del mismo tipo que el padre. Las subclases de Mock pueden redefinir este método para personalizar la forma en la que se construye el objeto simulado hijo.

source: For non-callable mocks the callable variant will be used (rather than any custom subclass).
es: Para objetos simulados no invocables la variante invocable será utilizada (en lugar de cualquier subclase personalizada).
