Repository: python/python-docs-es
Catalog: library/unittest.mock-examples.po
Languages: es

source: As this chain of calls is made from an instance attribute we can monkey patch the ``backend`` attribute on a ``Something`` instance. In this particular case we are only interested in the return value from the final call to ``start_call`` so we don't have much configuration to do. Let's assume the object it returns is 'file-like', so we'll ensure that our response object uses the builtin :func:`open` as its ``spec``.
es: A medida que esta cadena de llamadas se realiza a partir de un atributo de instancia, podemos parchear el atributo ``backend`` en una instancia de ``Something``. En este caso en particular sólo estamos interesados en el valor devuelto de la llamada final a ``start_call`` por lo que no tenemos mucha configuración que hacer. Supongamos que el objeto que devuelve es 'similar a un archivo', por lo que nos aseguraremos de que nuestro objeto de respuesta utilice el compilado :func:`open` as its ``spec``.

source: To do this we create a mock instance as our mock backend and create a mock response object for it. To set the response as the return value for that final ``start_call`` we could do this::
es: Para ello creamos una instancia mock como nuestro back-end simulado y creamos un objeto de respuesta mock para ella. Para establecer la respuesta como el valor devuelto de ese ``start_call`` final podríamos hacer lo siguiente::

source: We can do that in a slightly nicer way using the :meth:`~Mock.configure_mock` method to directly set the return value for us::
es: Podemos hacerlo de una manera un poco mejor usando el método :meth:`~Mock.configure_mock` para establecer directamente el valor devuelto para nosotros::

source: With these we monkey patch the "mock backend" in place and can make the real call::
es: Con estos monkey patch el "backend simulado" en su lugar y puede hacer la llamada real::

source: Using :attr:`~Mock.mock_calls` we can check the chained call with a single assert. A chained call is several calls in one line of code, so there will be several entries in ``mock_calls``. We can use :meth:`call.call_list` to create this list of calls for us::
es: Usando :attr:`~Mock.mock_calls` podemos comprobar la llamada encadenada con una sola afirmación. Una llamada encadenada es varias llamadas en una línea de código, por lo que habrá varias entradas en ``mock_calls``. Podemos usar :meth:`call.call_list` para crear esta lista de llamadas para nosotros::

source: Partial mocking
es: Mocking parcial

source: In some tests I wanted to mock out a call to :meth:`datetime.date.today` to return a known date, but I didn't want to prevent the code under test from creating new date objects. Unfortunately :class:`datetime.date` is written in C, and so I couldn't just monkey-patch out the static :meth:`datetime.date.today` method.
es: En algunas pruebas quería un mock de una llamada a :meth:`datetime.date.today` para devolver una fecha conocida, pero no quería evitar que el código sometido a prueba creara nuevos objetos de fecha. Desafortunadamente :class:`datetime.date` está escrito en C, por lo que no podía simplemente hacer un *monkey-patch* del método estático :meth:`datetime.date.today`.

source: I found a simple way of doing this that involved effectively wrapping the date class with a mock, but passing through calls to the constructor to the real class (and returning real instances).
es: Encontré una forma sencilla de hacer esto que implicaba ajustar eficazmente la clase date con un mock, pero pasar llamadas al constructor a la clase real (y devolver instancias reales).

source: The :func:`patch decorator <patch>` is used here to mock out the ``date`` class in the module under test. The :attr:`~Mock.side_effect` attribute on the mock date class is then set to a lambda function that returns a real date. When the mock date class is called a real date will be constructed and returned by ``side_effect``. ::
es: El :func:`patch decorator <patch>` se utiliza aquí como un mock de la clase ``date`` en el módulo en pruebas. Entonces, el atributo :attr:`~Mock.side_effect` de la clase de fecha simulada se establece en una función lambda que devuelve una fecha real. Cuando la clase de fecha simulada es llamada, una fecha real se construirá y devolverá por ``side_effect``. ::

source: Note that we don't patch :class:`datetime.date` globally, we patch ``date`` in the module that *uses* it. See :ref:`where to patch <where-to-patch>`.
es: Tenga en cuenta que no parcheamos :class:`datetime.date` globalmente, parcheamos ``date`` en el módulo que *uses*. Consulte :ref:`where to patch <where-to-patch>`.

source: When ``date.today()`` is called a known date is returned, but calls to the ``date(...)`` constructor still return normal dates. Without this you can find yourself having to calculate an expected result using exactly the same algorithm as the code under test, which is a classic testing anti-pattern.
es: Cuando ``date.today()`` es llamada se retorna una fecha conocida, pero llama al constructor ``date(...)`` este constructor todavía devuelve fechas normales. Sin esto, puede encontrarse teniendo que calcular un resultado esperado utilizando exactamente el mismo algoritmo que el código en prueba, que es un anti-patrón de prueba clásico.

source: Calls to the date constructor are recorded in the ``mock_date`` attributes (``call_count`` and friends) which may also be useful for your tests.
es: Las llamadas al constructor de fecha se registran en los atributos ``mock_date`` (``call_count`` y amigos) que también pueden ser útiles para las pruebas.

source: An alternative way of dealing with mocking dates, or other builtin classes, is discussed in `this blog entry <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.
es: Una forma alternativa de tratar con fechas de mock, u otras clases integradas, se discute en `esta entrada de blog <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.

source: Mocking a Generator Method
es: Mocking de un método generador

source: A Python generator is a function or method that uses the :keyword:`yield` statement to return a series of values when iterated over [#]_.
es: Un generador de Python es una función o método que utiliza la instrucción :keyword:`yield` para devolver una serie de valores cuando se itera sobre [#]_.

source: A generator method / function is called to return the generator object. It is the generator object that is then iterated over. The protocol method for iteration is :meth:`~container.__iter__`, so we can mock this using a :class:`MagicMock`.
es: Se llama a un método / función del generador para devolver el objeto generador. Es el objeto generador que luego se itera. El método de protocolo para la iteración es :meth:`~container.__iter__`, por lo que podemos hacer mock de esto usando una :class:`MagicMock`.

source: Here's an example class with an "iter" method implemented as a generator:
es: Aquí hay una clase de ejemplo con un método "iter" implementado como generador:

source: How would we mock this class, and in particular its "iter" method?
es: ¿Cómo haríamos un mock de esta clase y, en particular, de su método "iter"?

source: To configure the values returned from the iteration (implicit in the call to :class:`list`), we need to configure the object returned by the call to ``foo.iter()``.
es: Para configurar los valores devueltos desde la iteración (implícita en la llamada a :class:`list`), necesitamos configurar el objeto devuelto por la llamada a ``foo.iter()``.

source: There are also generator expressions and more `advanced uses <http://www.dabeaz.com/coroutines/index.html>`_ of generators, but we aren't concerned about them here. A very good introduction to generators and how powerful they are is: `Generator Tricks for Systems Programmers <http://www.dabeaz.com/generators/>`_.
es: También hay expresiones generadoras y más usos avanzados <http://www.dabeaz.com/coroutines/index.html>'_ de generadores, pero no nos preocupan los que están aquí. Una muy buena introducción a los generadores y lo potentes que son es: `Generator Tricks for Systems Programmers <http://www.dabeaz.com/generators/>`_.

source: Applying the same patch to every test method
es: Aplicar el mismo parche a cada método de prueba

source: If you want several patches in place for multiple test methods the obvious way is to apply the patch decorators to every method. This can feel like unnecessary repetition. Instead, you can use :func:`patch` (in all its various forms) as a class decorator. This applies the patches to all test methods on the class. A test method is identified by methods whose names start with ``test``::
es: Si desea que se coloquen varias revisiones para varios métodos de prueba, la forma obvia es aplicar los decoradores de parches a cada método. Esto puede parecer una repetición innecesaria. En cambio, puede utilizar :func:`patch` (en todas sus diversas formas) como decorador de clases. Esto aplica las revisiones a todos los métodos de prueba de la clase. Un método de prueba se identifica mediante métodos cuyos nombres comienzan con ``test``::

source: An alternative way of managing patches is to use the :ref:`start-and-stop`. These allow you to move the patching into your ``setUp`` and ``tearDown`` methods. ::
es: Una forma alternativa de administrar parches es usar :ref:`start-and-stop`. Estos le permiten mover el parche en sus métodos ``setUp`` y ``tearDown``. ::

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the setUp then tearDown is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
es: Si utiliza esta técnica, debe asegurarse de que la aplicación de parches se "undone" llamando a ``stop``. Esto puede ser más complicado de lo que podría pensar, porque si se produce una excepción en el setUp, no se llama a tearDown. :meth:`unittest.TestCase.addCleanup` hace que esto sea más fácil::

source: Mocking Unbound Methods
es: Mocking de métodos sin enlazar

source: Whilst writing tests today I needed to patch an *unbound method* (patching the method on the class rather than on the instance). I needed self to be passed in as the first argument because I want to make asserts about which objects were calling this particular method. The issue is that you can't patch with a mock for this, because if you replace an unbound method with a mock it doesn't become a bound method when fetched from the instance, and so it doesn't get self passed in. The workaround is to patch the unbound method with a real function instead. The :func:`patch` decorator makes it so simple to patch out methods with a mock that having to create a real function becomes a nuisance.
es: Mientras escribía pruebas hoy en día, necesitaba parchear un método *unbound method* (parchear el método en la clase en lugar de en la instancia). Necesitaba que se pasara a sí mismo como primer argumento porque quiero hacer aserciones sobre qué objetos estaban llamando a este método en particular. El problema es que no se puede parchear con un mock para esto, porque si reemplaza un método independiente con un mock, no se convierte en un método enlazado cuando se obtiene de la instancia, por lo que no se pasa por sí mismo. La solución es revisar el método independiente con una función real en su lugar. El decorador :func:`patch` hace que sea tan simple parchear métodos con un mock que tener que crear una función real se convierte en una molestia.

source: If you pass ``autospec=True`` to patch then it does the patching with a *real* function object. This function object has the same signature as the one it is replacing, but delegates to a mock under the hood. You still get your mock auto-created in exactly the same way as before. What it means though, is that if you use it to patch out an unbound method on a class the mocked function will be turned into a bound method if it is fetched from an instance. It will have ``self`` passed in as the first argument, which is exactly what I wanted:
es: Si pasa ``autospec=True`` al parche, entonces hace el parche con un objeto de función *real*. Este objeto de función tiene la misma firma que el que está reemplazando, pero delega en un mock bajo el capó. Usted todavía consigue su mock de auto-creado exactamente de la misma manera que antes. Lo que significa, sin embargo, es que si lo usa para parchear un método independiente en una clase, la función simulada se convertirá en un método enlazado si se obtiene de una instancia. Tendrá ``self`` pasado como el primer argumento, que es exactamente lo que quería:

source: If we don't use ``autospec=True`` then the unbound method is patched out with a Mock instance instead, and isn't called with ``self``.
es: Si no usamos ``autospec=True`` entonces el método independiente se parchea con una instancia de Mock en su lugar, y no se llama con ``self``.

source: Checking multiple calls with mock
es: Comprobación de varias llamadas con mock

source: mock has a nice API for making assertions about how your mock objects are used.
es: mock tiene una buena API para hacer aserciones sobre cómo se usan sus objetos ficticios.

source: If your mock is only being called once you can use the :meth:`~Mock.assert_called_once_with` method that also asserts that the :attr:`~Mock.call_count` is one.
es: Si su mock solo se llama una vez, puede usar el método :meth:`~Mock.assert_called_once_with` que también afirma que :attr:`~Mock.call_count` es uno.

source: Both ``assert_called_with`` and ``assert_called_once_with`` make assertions about the *most recent* call. If your mock is going to be called several times, and you want to make assertions about *all* those calls you can use :attr:`~Mock.call_args_list`:
es: Tanto ``assert_called_with`` como ``assert_called_once_with`` hacen afirmaciones sobre la llamada *más reciente*. Si su mock va a ser llamado varias veces, y desea hacer aserciones sobre *todas* esas llamadas que puede utilizar :attr:`~Mock.call_args_list`:

source: The :data:`call` helper makes it easy to make assertions about these calls. You can build up a list of expected calls and compare it to ``call_args_list``. This looks remarkably similar to the repr of the ``call_args_list``:
es: El helper :data:`call` facilita la toma de aserciones sobre estas llamadas. Puede crear una lista de llamadas esperadas y compararla con ``call_args_list``. Esto se ve notablemente similar al repr de la ``call_args_list``:

source: Coping with mutable arguments
es: Copiando con argumentos mutables

source: Another situation is rare, but can bite you, is when your mock is called with mutable arguments. ``call_args`` and ``call_args_list`` store *references* to the arguments. If the arguments are mutated by the code under test then you can no longer make assertions about what the values were when the mock was called.
es: Otra situación es rara, pero puede morderte, es cuando se llama a tu mock con argumentos mutables. ``call_args`` y ``call_args_list`` almacenan *referencias* a los argumentos. Si el código sometido a prueba muta los argumentos ya no puede realizar aserciones sobre cuáles eran los valores cuando se llamó al mock.

source: Here's some example code that shows the problem. Imagine the following functions defined in 'mymodule'::
es: Este es un código de ejemplo que muestra el problema. Imagine las siguientes funciones definidas en 'mymodule'::

source: When we try to test that ``grob`` calls ``frob`` with the correct argument look what happens::
es: Cuando tratamos de probar que ``grob`` llama ``frob`` con el argumento correcto mira lo que sucede::

source: One possibility would be for mock to copy the arguments you pass in. This could then cause problems if you do assertions that rely on object identity for equality.
es: Una posibilidad sería que el mock copiara los argumentos que pasa. Esto podría causar problemas si realiza aserciones que se basan en la identidad del objeto para la igualdad.

source: Here's one solution that uses the :attr:`~Mock.side_effect` functionality. If you provide a ``side_effect`` function for a mock then ``side_effect`` will be called with the same args as the mock. This gives us an opportunity to copy the arguments and store them for later assertions. In this example I'm using *another* mock to store the arguments so that I can use the mock methods for doing the assertion. Again a helper function sets this up for me. ::
es: Aquí hay una solución que utiliza la funcionalidad :attr:`~Mock.side_effect`. Si proporciona una función ``side_effect`` para un mock, se llamará a ``side_effect`` con los mismos argumentos que el mock. Esto nos da la oportunidad de copiar los argumentos y almacenarlos para aserciones posteriores. En este ejemplo estoy usando *otro* mock para almacenar los argumentos de modo que pueda usar los métodos ficticios para hacer la aserción. Una vez más, una función auxiliar configura esto para mí. ::

source: ``copy_call_args`` is called with the mock that will be called. It returns a new mock that we do the assertion on. The ``side_effect`` function makes a copy of the args and calls our ``new_mock`` with the copy.
es: ``copy_call_args`` se llama con el mock que se llamará. Devuelve un nuevo mock en el que hacemos la aserción. La función ``side_effect`` hace una copia de los args y llama a nuestro ``new_mock`` con la copia.

source: If your mock is only going to be used once there is an easier way of checking arguments at the point they are called. You can simply do the checking inside a ``side_effect`` function.
es: Si su simulacro solo se va a usar una vez, hay una forma más fácil de verificar los argumentos en el punto en que se llaman. Simplemente puede hacer la comprobación dentro de una función ``side_effect``.

source: An alternative approach is to create a subclass of :class:`Mock` or :class:`MagicMock` that copies (using :func:`copy.deepcopy`) the arguments. Here's an example implementation:
es: Un enfoque alternativo es crear una subclase de :class:`Mock` o :class:`MagicMock` que copie (usando :func:`copy.deepcopy`) los argumentos. A continuación se muestra un ejemplo de implementación:

source: When you subclass ``Mock`` or ``MagicMock`` all dynamically created attributes, and the ``return_value`` will use your subclass automatically. That means all children of a ``CopyingMock`` will also have the type ``CopyingMock``.
es: Cuando subclases ``Mock`` o ``MagicMock`` todos los atributos creados dinámicamente, y el ``return_value`` usará tu subclase automáticamente. Eso significa que todos los elementos secundarios de un ``CopyingMock`` también tendrán el tipo ``CopyingMock``.

source: Nesting Patches
es: Anidando parches

source: Using patch as a context manager is nice, but if you do multiple patches you can end up with nested with statements indenting further and further to the right::
es: Usar parches como administradores de contexto es bueno, pero si haces varios parches, puedes terminar con instrucciones anidadas que se sangran cada vez más a la derecha::

source: With unittest ``cleanup`` functions and the :ref:`start-and-stop` we can achieve the same effect without the nested indentation. A simple helper method, ``create_patch``, puts the patch in place and returns the created mock for us::
es: Con las funciones unittest ``cleanup`` y :ref:`start-and-stop` podemos lograr el mismo efecto sin la sangría anidada. Un método auxiliar simple, ``create_patch``, pone el parche en su lugar y devuelve el mock creado para nosotros::

source: Mocking a dictionary with MagicMock
es: Mocking a un diccionario usando MagickMock

source: You may want to mock a dictionary, or other container object, recording all access to it whilst having it still behave like a dictionary.
es: Es posible que desee simular un diccionario u otro objeto contenedor, registrando todo el acceso a él mientras todavía se comporta como un diccionario.

source: We can do this with :class:`MagicMock`, which will behave like a dictionary, and using :data:`~Mock.side_effect` to delegate dictionary access to a real underlying dictionary that is under our control.
es: Podemos hacer esto con :class:`MagicMock`, que se comportará como un diccionario, y usando :data:`~Mock.side_effect` para delegar el acceso del diccionario a un diccionario subyacente real que está bajo nuestro control.

source: When the :meth:`~object.__getitem__` and :meth:`~object.__setitem__` methods of our ``MagicMock`` are called (normal dictionary access) then ``side_effect`` is called with the key (and in the case of ``__setitem__`` the value too). We can also control what is returned.
es: Cuando se llama a los métodos :meth:`~object.__getitem__` y :meth:`~object.__setitem__` de nuestro ``MagicMock`` (acceso normal al diccionario), entonces se llama a ``side_effect`` con la clave (y el valor también en el caso de ``__setitem__``). También podemos controlar lo que se devuelve.

source: After the ``MagicMock`` has been used we can use attributes like :data:`~Mock.call_args_list` to assert about how the dictionary was used:
es: Después de que se haya utilizado el ``MagicMock`` podemos usar atributos como :data:`~Mock.call_args_list` para afirmar cómo se usó el diccionario:

source: An alternative to using ``MagicMock`` is to use ``Mock`` and *only* provide the magic methods you specifically want:
es: Una alternativa al uso de ``MagicMock`` es usar ``Mock`` y *solo* proporcionar los métodos mágicos que desea específicamente:

source: A *third* option is to use ``MagicMock`` but passing in ``dict`` as the *spec* (or *spec_set*) argument so that the ``MagicMock`` created only has dictionary magic methods available:
es: Una *tercera* opción es usar ``MagicMock`` pero pasando ``dict`` como el argumento *spec* (o *spec_set*) para que el ``MagicMock`` creado solo tenga métodos mágicos de diccionario disponibles:

source: With these side effect functions in place, the ``mock`` will behave like a normal dictionary but recording the access. It even raises a :exc:`KeyError` if you try to access a key that doesn't exist.
es: Con estas funciones de efectos secundarios en su lugar, el ``mock`` se comportará como un diccionario normal pero registrando el acceso. Incluso genera un :exc:`KeyError` si intenta acceder a una clave que no existe.

source: After it has been used you can make assertions about the access using the normal mock methods and attributes:
es: Una vez utilizado, puede realizar aserciones sobre el acceso utilizando los métodos y atributos mock normales:

source: Mock subclasses and their attributes
es: Mock de subclases y sus atributos

source: There are various reasons why you might want to subclass :class:`Mock`. One reason might be to add helper methods. Here's a silly example:
es: Hay varias razones por las que es posible que desee crear subclases :class:`Mock` Una razón podría ser agregar métodos auxiliares. Aquí hay un ejemplo simple:
