Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: Note that in order to test something, we use one of the :meth:`assert\*` methods provided by the :class:`TestCase` base class. If the test fails, an exception will be raised with an explanatory message, and :mod:`unittest` will identify the test case as a :dfn:`failure`. Any other exceptions will be treated as :dfn:`errors`.
es: Adviértase que para probar algo, usamos uno de los métodos :meth:`assert\*` proporcionados por la clase base :class:`TestCase`. Si la prueba no tiene éxito, se lanzará una excepción con un mensaje explicativo y :mod:`unittest` identificará el caso como :dfn:`failure`. Cualquier otra excepción se considerará un :dfn:`errors`.

source: Tests can be numerous, and their set-up can be repetitive. Luckily, we can factor out set-up code by implementing a method called :meth:`~TestCase.setUp`, which the testing framework will automatically call for every single test we run::
es: Las pruebas pueden ser muchas y su preparación puede ser repetitiva. Por suerte, se puede "sacar factor común" a la preparación implementando un método :meth:`~TestCase.setUp`, al que la infraestructura de prueba llamará para cada prueba que se ejecute::

source: The order in which the various tests will be run is determined by sorting the test method names with respect to the built-in ordering for strings.
es: El orden en que se ejecutan las diversas pruebas se determina por orden alfabético de los nombres de métodos de prueba.

source: If the :meth:`~TestCase.setUp` method raises an exception while the test is running, the framework will consider the test to have suffered an error, and the test method will not be executed.
es: Si el método :meth:`~TestCase.setUp` lanza una excepción mientras se ejecuta la prueba, la infraestructura considerará que la prueba ha sufrido un error y no se ejecutará el método de prueba propiamente dicho.

source: Similarly, we can provide a :meth:`~TestCase.tearDown` method that tidies up after the test method has been run::
es: Análogamente, se puede proporcionar un método :meth:`~TestCase.tearDown` que haga limpieza después de que se ejecute el método de prueba::

source: If :meth:`~TestCase.setUp` succeeded, :meth:`~TestCase.tearDown` will be run whether the test method succeeded or not.
es: Si :meth:`~TestCase.setUp` se ejecuta sin errores, :meth:`~TestCase.tearDown` se ejecutará tanto si el método de prueba tuvo éxito como si no.

source: Such a working environment for the testing code is called a :dfn:`test fixture`. A new TestCase instance is created as a unique test fixture used to execute each individual test method. Thus :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown`, and :meth:`~TestCase.__init__` will be called once per test.
es: Un entorno de trabajo así para el código de pruebas se llama :dfn:`test fixture` . Se crea una nueva instancia de TestCase como juego de datos de prueba que se utiliza para cada método de prueba. De este modo, :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown` y :meth:`~TestCase.__init__` se llamarán una vez por prueba.

source: It is recommended that you use TestCase implementations to group tests together according to the features they test. :mod:`unittest` provides a mechanism for this: the :dfn:`test suite`, represented by :mod:`unittest`'s :class:`TestSuite` class. In most cases, calling :func:`unittest.main` will do the right thing and collect all the module's test cases for you and execute them.
es: Se recomienda usar implementaciones de `TestCase` para agrupar las pruebas de acuerdo con las características probadas. :mod:`unittest` proporciona una mecanismo para esto: el :dfn:`test suite`, representado por la clase :class:`TestSuite` de :mod:`unittest`. En la mayor parte de los casos, llamar a :func:`unittest.main` hará lo correcto y recolectará todos los casos de prueba del módulo para su ejecución.

source: However, should you want to customize the building of your test suite, you can do it yourself::
es: Sin embargo, si se desea personalizar la construcción del paquete de pruebas, se puede hacer::

source: You can place the definitions of test cases and test suites in the same modules as the code they are to test (such as :file:`widget.py`), but there are several advantages to placing the test code in a separate module, such as :file:`test_widget.py`:
es: Se puede poner las definiciones de los casos de prueba y de los paquetes de prueba en los mismos módulos que el código que prueban.(tal como :file:`widget.py`), pero sacarlos a un módulo aparte como :file:`test_widget.py` tiene diversas ventajas:

source: The test module can be run standalone from the command line.
es: El módulo de pruebas se puede ejecutar aisladamente desde la línea de órdenes.

source: The test code can more easily be separated from shipped code.
es: El código de pruebas se puede separar con más facilidad del código de producción.

source: There is less temptation to change test code to fit the code it tests without a good reason.
es: Disminuye la tentación de cambiar el código de prueba para ajustarse al código bajo prueba.

source: Test code should be modified much less frequently than the code it tests.
es: El código de pruebas debería modificarse con mucha menor frecuencia que el código bajo prueba.

source: Tested code can be refactored more easily.
es: Es más sencillo refactorizar el código bajo prueba.

source: Tests for modules written in C must be in separate modules anyway, so why not be consistent?
es: El código para probar módulos escritos en C ha de estar en módulos aparte, así que ¿por qué no mantener la consistencia?

source: If the testing strategy changes, there is no need to change the source code.
es: Si cambia la estrategia de prueba, no hay razón para cambiar el código fuente principal.

source: Re-using old test code
es: Reutilización de código de prueba anterior

source: Some users will find that they have existing test code that they would like to run from :mod:`unittest`, without converting every old test function to a :class:`TestCase` subclass.
es: Habrá personas que tengan código de prueba previo que deseen ejecutar desde :mod:`unittest`, sin conversión previa de cada antigua función de prueba a una subclase de :class:`TestCase`.

source: For this reason, :mod:`unittest` provides a :class:`FunctionTestCase` class. This subclass of :class:`TestCase` can be used to wrap an existing test function. Set-up and tear-down functions can also be provided.
es: Por esto, :mod:`unittest` proporciona una clase :class:`FunctionTestCase`. Se puede utilizar esta subclase de :class:`TestCase` para envolver una función de prueba existente. Se pueden proporcionar también funciones de preparación y desmontaje.

source: Given the following test function::
es: Dada la siguiente función de prueba::

source: one can create an equivalent test case instance as follows, with optional set-up and tear-down methods::
es: se puede crear una instancia de caso de prueba de la siguiente manera, con métodos opcionales de preparación y desmontaje::

source: Even though :class:`FunctionTestCase` can be used to quickly convert an existing test base over to a :mod:`unittest`\ -based system, this approach is not recommended. Taking the time to set up proper :class:`TestCase` subclasses will make future test refactorings infinitely easier.
es: Aunque se puede usar :class:`FunctionTestCase` para convertir rápidamente unas pruebas existentes a un sistema basado en :mod:`unittest`, no es una vía recomendada. Tomarse el tiempo de construir subclases bien construidas de :class:`TestCase` hará las futuras refactorizaciones de pruebas futura considerablemente más fácil.

source: In some cases, the existing tests may have been written using the :mod:`doctest` module. If so, :mod:`doctest` provides a :class:`DocTestSuite` class that can automatically build :class:`unittest.TestSuite` instances from the existing :mod:`doctest`\ -based tests.
es: En algunos casos, los tests existentes pueden haber sido escritos usando el módulo :mod:`doctest`. En ese caso, :mod:`doctest` tiene una clase :class:`DocTestSuite` que puede construir automáticamente instancias de :class:`unittest.TestSuite` partiendo de los test basados en :mod:`doctest`.

source: Skipping tests and expected failures
es: Omitir tests y fallos esperados

source: Unittest supports skipping individual test methods and even whole classes of tests. In addition, it supports marking a test as an "expected failure," a test that is broken and will fail, but shouldn't be counted as a failure on a :class:`TestResult`.
es: Unittest soporta omitir métodos individuales de tests e incluso clases completas de tests. Además, soporta marcar un test como un "fallo esperado", un test que está roto y va a fallar, pero no debería ser contado como fallo en :class:`TestResult`.

source: Skipping a test is simply a matter of using the :func:`skip` :term:`decorator` or one of its conditional variants, calling :meth:`TestCase.skipTest` within a :meth:`~TestCase.setUp` or test method, or raising :exc:`SkipTest` directly.
es: Omitir un test es solo cuestión de emplear el :term:`decorator` :func:`skip` o una de sus variantes condicionales, llamando a :meth:`TestCase.skipTest` dentro de :meth:`~TestCase.setUp` o en un método de test, o lanzando :exc:`SkipTest` directamente.

source: Basic skipping looks like this::
es: La omisión más básica tiene la siguiente forma:

source: This is the output of running the example above in verbose mode::
es: Esta es la salida de ejecutar el ejemplo superior en modo verboso::

source: Classes can be skipped just like methods::
es: Las clases pueden ser omitidas igual que los métodos::

source: :meth:`TestCase.setUp` can also skip the test. This is useful when a resource that needs to be set up is not available.
es: :meth:`TestCase.setUp` puede omitir también el test. Esto es útil cuando un recurso que necesita ser puesto a punto no está disponible.

source: Expected failures use the :func:`expectedFailure` decorator. ::
es: Los fallos esperados emplean el decorador :func:`expectedFailure`. ::

source: It's easy to roll your own skipping decorators by making a decorator that calls :func:`skip` on the test when it wants it to be skipped. This decorator skips the test unless the passed object has a certain attribute::
es: Es fácil lanzar tus propios decoradores que omitan haciendo un decorador que llame a :func:`skip` en el test cuando quiere ser omitido. Este decorador omite el test a menos que el objeto pasado tenga un cierto atributo::

source: The following decorators and exception implement test skipping and expected failures:
es: Los siguientes decoradores y la excepción implementan la omisión de tests y los fallos esperados:

source: Unconditionally skip the decorated test. *reason* should describe why the test is being skipped.
es: Omitir incondicionalmente el test decorado. *reason* debe describir porqué el test está siendo omitido.

source: Skip the decorated test if *condition* is true.
es: Omitir el test decorado si *condition* es verdadero.

source: Skip the decorated test unless *condition* is true.
es: Omitir el test decorado a menos que *condition* sea verdadero.

source: Mark the test as an expected failure or error. If the test fails or errors in the test function itself (rather than in one of the :dfn:`test fixture` methods) then it will be considered a success. If the test passes, it will be considered a failure.
es: Marca el test como un fallo esperado. Si falla el test o hay errores en la función de test misma (en lugar de en alguno de los métodos :dfn:`test fixture`) será considerado un éxito. Si el test pasa, será considerado un fallo.

source: This exception is raised to skip a test.
es: Esta excepción es lanzada para omitir un test.

source: Usually you can use :meth:`TestCase.skipTest` or one of the skipping decorators instead of raising this directly.
es: Normalmente puedes usar directamente :meth:`TestCase.skipTest` o uno de los decoradores de omisión en vez de lanzar esta excepción.

source: Skipped tests will not have :meth:`~TestCase.setUp` or :meth:`~TestCase.tearDown` run around them. Skipped classes will not have :meth:`~TestCase.setUpClass` or :meth:`~TestCase.tearDownClass` run. Skipped modules will not have :func:`setUpModule` or :func:`tearDownModule` run.
es: Los tests omitidos no ejecutarán :meth:`~TestCase.setUp` o :meth:`~TestCase.tearDown`. Las clases omitidas no ejecutarán :meth:`~TestCase.setUpClass` o :meth:`~TestCase.tearDownClass`. Los módulos omitidos no ejecutarán :func:`setUpModule` o :func:`tearDownModule`.

source: Distinguishing test iterations using subtests
es: Distinguiendo iteraciones de tests empleando subtests

source: When there are very small differences among your tests, for instance some parameters, unittest allows you to distinguish them inside the body of a test method using the :meth:`~TestCase.subTest` context manager.
es: Cuando hay diferencias muy pequeñas entre tus tests, por ejemplo algunos parámetros, unittest te permite distinguirlos dentro del cuerpo de un método de test empleando el administrador de contexto :meth:`~TestCase.subTest` .

source: For example, the following test::
es: Por ejemplo, el siguiente test::

source: will produce the following output::
es: producirá la siguiente salida:

source: Without using a subtest, execution would stop after the first failure, and the error would be less easy to diagnose because the value of ``i`` wouldn't be displayed::
es: Sin usar un subtest, la ejecución se pararía después del primer fallo, y el error sería más difícil de diagnosticar porque el valor de ``i`` no se mostraría::

source: Classes and functions
es: Clases y funciones

source: This section describes in depth the API of :mod:`unittest`.
es: Esta sección describe en detalle la API de :mod:`unittest`.

source: Test cases
es: Casos de test

source: Instances of the :class:`TestCase` class represent the logical test units in the :mod:`unittest` universe. This class is intended to be used as a base class, with specific tests being implemented by concrete subclasses. This class implements the interface needed by the test runner to allow it to drive the tests, and methods that the test code can use to check for and report various kinds of failure.
es: Las instancias de la clase :class:`TestCase` representan las unidades lógicas de test en el universo de :mod:`unittest`. Esta clase está pensada para ser utilizada como clase base, con los test específicos siendo implementados por subclases concretas. Esta clase implementa la interfaz que necesita el ejecutor de tests para permitirle llevar a cabo los tests, y métodos que el código de test puede utilizar para chequear y reportar distintos tipos de fallo.

source: Each instance of :class:`TestCase` will run a single base method: the method named *methodName*. In most uses of :class:`TestCase`, you will neither change the *methodName* nor reimplement the default ``runTest()`` method.
es: Cada instancia de :class:`TestCase` ejecutará un solo método base: el método llamado *methodName*. En la mayoría de usos de :class:`TestCase`, no tendrás que cambiar el *methodName* ni reimplementar el método por defecto ``runTest()``.

source: :class:`TestCase` can be instantiated successfully without providing a *methodName*. This makes it easier to experiment with :class:`TestCase` from the interactive interpreter.
es: :class:`TestCase` puede instancias con éxito sin dar un *methodName*. Esto permite experimentar de manera sencilla con :class:`TestCase` en el intérprete interactivo.

source: :class:`TestCase` instances provide three groups of methods: one group used to run the test, another used by the test implementation to check conditions and report failures, and some inquiry methods allowing information about the test itself to be gathered.
es: Las instancias de :class:`TestCase` proveen tres grupos de métodos: un grupo empleado para ejecutar el test, otro usado para que la implementación del test chequee condiciones y reporte fallos, y algunos métodos de indagación que permiten recopilar información sobre el test en si mismo.

source: Methods in the first group (running the test) are:
es: Los métodos en el primer grupo (ejecutando el test) son:

source: Method called to prepare the test fixture. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
es: Método llamado para preparar el banco de test. Es invocado inmediatamente antes de llamar al método de test; cualquier excepción lanzada por este método que no sea :exc:`AssertionError` o :exc:`SkipTest` será considerada un error en vez de un fallo del test. La implementación por defecto no hace nada.

source: Method called immediately after the test method has been called and the result recorded. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`setUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
es: Método llamado inmediatamente después de que se haya llamado el método de prueba y se haya registrado el resultado. Se llama así aunque el método de ensayo haya planteado una excepción, por lo que la aplicación en las subclases puede tener que ser especialmente cuidadosa en cuanto a la comprobación del estado interno. Cualquier excepción, que no sea :exc:`AssertionError` o :exc:`SkipTest`, planteada por este método se considerará un error adicional en lugar de un fallo de la prueba (aumentando así el número total de errores reportados). Este método sólo se llamará si :meth:`setUp` tiene éxito, independientemente del resultado del método de prueba. La implementación por defecto no hace nada.

source: A class method called before tests in an individual class are run. ``setUpClass`` is called with the class as the only argument and must be decorated as a :func:`classmethod`::
es: Un método de clase llamado antes de que los tests en una clase individual sean ejecutados. ``setUpClass`` es llamado con la clase como el único argumento y debe ser decorada como :func:`classmethod`::

source: See `Class and Module Fixtures`_ for more details.
es: Vea `Class and Module Fixtures`_ para más detalles.

source: A class method called after tests in an individual class have run. ``tearDownClass`` is called with the class as the only argument and must be decorated as a :meth:`classmethod`::
es: Un método de clase llamado después de que se hayan realizado tests en una clase individual. ``tearDownClass`` se llama con la clase como único argumento y debe ser decorado como un :meth:`classmethod`::

source: Run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller.
es: Ejecutar la prueba, recogiendo el resultado en el objeto :class:`TestResult` pasado como *result*. Si se omite *result* o ``None``, se crea un objeto resultado temporal (llamando al método :meth:`defaultTestResult`) y se emplea ese. El objeto resultante se devuelve al invocador de :meth:`run`.

source: The same effect may be had by simply calling the :class:`TestCase` instance.
es: El mismo efecto puede conseguirse simplemente llamando a la instancia :class:`TestCase`.

source: Previous versions of ``run`` did not return the result. Neither did calling an instance.
es: Las versiones previas de ``run`` no retornaban el resultado. Tampoco lo hacía la llamada a una instancia.

source: Calling this during a test method or :meth:`setUp` skips the current test. See :ref:`unittest-skipping` for more information.
es: Llamar a esto durante un método de prueba o :meth:`setUp` se salta el test actual. Ver :ref:`unittest-skipping` para más información.

source: Return a context manager which executes the enclosed code block as a subtest. *msg* and *params* are optional, arbitrary values which are displayed whenever a subtest fails, allowing you to identify them clearly.
es: Retorna un gestor de contexto que ejecuta el bloque de código adjunto como un subtest. *msg* y *params* son valores opcionales y arbitrarios que se muestran cuando falla un subtest, permitiéndole identificarlos claramente.

source: A test case can contain any number of subtest declarations, and they can be arbitrarily nested.
es: Un caso de test puede contener cualquier número de declaraciones de subtest, y pueden anidarse arbitrariamente.

source: See :ref:`subtests` for more information.
es: Ver :ref:`subtests` para más información.

source: Run the test without collecting the result. This allows exceptions raised by the test to be propagated to the caller, and can be used to support running tests under a debugger.
es: Realice el test sin recoger el resultado. Esto permite que las excepciones planteadas por el test se propaguen al invocado, y puede utilizarse para apoyar la ejecución de tests bajo un depurador.

source: The :class:`TestCase` class provides several assert methods to check for and report failures. The following table lists the most commonly used methods (see the tables below for more assert methods):
es: La clase :class:`TestCase` proporciona varios métodos de afirmación para comprobar y reportar fallos. En la siguiente tabla se enumeran los métodos más utilizados (consulte las tablas siguientes para ver más métodos de afirmación):

source: Method
es: Método

source: Checks that
es: Comprueba que

source: New in
es: Nuevo en

source: All the assert methods accept a *msg* argument that, if specified, is used as the error message on failure (see also :data:`longMessage`). Note that the *msg* keyword argument can be passed to :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` only when they are used as a context manager.
es: Todos los métodos de aserción aceptan un argumento *msg* que, si se especifica, se utiliza como mensaje de error en caso de fallo (véase también :data:`longMessage`). Tenga en cuenta que el argumento de la palabra clave *msg* puede pasarse a :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` sólo cuando se utilizan como gestor de contexto.

source: Test that *first* and *second* are equal. If the values do not compare equal, the test will fail.
es: Testea que *first* y *second* son iguales. Si los valores no comparan como iguales, el test fallará.

source: In addition, if *first* and *second* are the exact same type and one of list, tuple, dict, set, frozenset or str or any type that a subclass registers with :meth:`addTypeEqualityFunc` the type-specific equality function will be called in order to generate a more useful default error message (see also the :ref:`list of type-specific methods <type-specific-methods>`).
es: Además, si *first* y *second* son exactamente del mismo tipo y uno de lista, tuple, dict, set, frozenset o str o cualquier tipo que una subclase registre con :meth:`addTypeEqualityFunc` se llamará a la función de igualdad específica del tipo para generar un mensaje de error por defecto más útil (véase también la :ref:`lista de métodos específicos del tipo <type-specific-methods>`).

source: Added the automatic calling of type-specific equality function.
es: Añadida la llamada automática de la función de igualdad de tipo específico.
