Repository: python/python-docs-es
Catalog: library/unittest.mock-examples.po
Languages: es

source: :mod:`unittest.mock` --- getting started
es: :mod:`unittest.mock` --- primeros pasos

source: Using Mock
es: Usando mock

source: Mock Patching Methods
es: Métodos de parcheo mock

source: Common uses for :class:`Mock` objects include:
es: Usos comunes para objetos :class:`Mock` incluye:

source: Patching methods
es: Métodos de parcheo

source: Recording method calls on objects
es: Métodos de grabación de llamadas sobre objetos

source: You might want to replace a method on an object to check that it is called with the correct arguments by another part of the system:
es: Es posible que desee reemplazar un método en un objeto para comprobar que se llama con los argumentos correctos por otra parte del sistema:

source: Once our mock has been used (``real.method`` in this example) it has methods and attributes that allow you to make assertions about how it has been used.
es: Una vez que se ha utilizado nuestro mock (``real.method`` en este ejemplo) tiene métodos y atributos que le permiten hacer afirmaciones sobre cómo se ha utilizado.

source: In most of these examples the :class:`Mock` and :class:`MagicMock` classes are interchangeable. As the ``MagicMock`` is the more capable class it makes a sensible one to use by default.
es: En la mayoría de estos ejemplos, las clases :class:`Mock` y :class:`MagicMock` son intercambiables. Como el ``MagicMock`` es la clase más capaz, hace que sea sensato usarlo por defecto.

source: Once the mock has been called its :attr:`~Mock.called` attribute is set to ``True``. More importantly we can use the :meth:`~Mock.assert_called_with` or :meth:`~Mock.assert_called_once_with` method to check that it was called with the correct arguments.
es: Una vez que el mock ha sido llamado su atributo :attr:`~Mock.called` se establece en ``True``. Lo que es más importante, podemos usar el método :meth:`~Mock.assert_called_with` o :meth:`~Mock.assert_called_once_with` para comprobar que se llamó con los argumentos correctos.

source: This example tests that calling ``ProductionClass().method`` results in a call to the ``something`` method:
es: En este ejemplo se prueba que llamar a ``ProductionClass().method`` da como resultado una llamada al método ``something``:

source: Mock for Method Calls on an Object
es: Mock de llamadas a métodos sobre un objeto

source: In the last example we patched a method directly on an object to check that it was called correctly. Another common use case is to pass an object into a method (or some part of the system under test) and then check that it is used in the correct way.
es: En el último ejemplo, parcheamos un método directamente en un objeto para comprobar que se llamó correctamente. Otro caso de uso común es pasar un objeto a un método (o a alguna parte del sistema sometido a prueba) y, a continuación, comprobar que se utiliza de la manera correcta.

source: The simple ``ProductionClass`` below has a ``closer`` method. If it is called with an object then it calls ``close`` on it.
es: La sencilla ``ProductionClass`` a continuación tiene un método ``closer``. Si se llama con un objeto, entonces llama a ``close`` en él.

source: So to test it we need to pass in an object with a ``close`` method and check that it was called correctly.
es: Así que para probarlo necesitamos pasar un objeto con un método ``close`` y comprobar que se llamó correctamente.

source: We don't have to do any work to provide the 'close' method on our mock. Accessing close creates it. So, if 'close' hasn't already been called then accessing it in the test will create it, but :meth:`~Mock.assert_called_with` will raise a failure exception.
es: No tenemos que hacer ningún trabajo para proporcionar el método de 'close' en nuestro mock. El acceso al cierre lo crea. Por lo tanto, si 'close' aún no se ha llamado, entonces acceder a él en la prueba lo creará, pero :meth:`~Mock.assert_called_with` lanzará una excepción de error.

source: Mocking Classes
es: Clases de Mock

source: A common use case is to mock out classes instantiated by your code under test. When you patch a class, then that class is replaced with a mock. Instances are created by *calling the class*. This means you access the "mock instance" by looking at the return value of the mocked class.
es: Un caso de uso común es simular las clases que crea la instancia del código que se está probando. Cuando se aplica un parche a una clase, esa clase se reemplaza por un mock. Las instancias se crean *llamando a la clase*. Esto significa que tiene acceso a la "instancia mock" examinando el valor devuelto de la clase simulada.

source: In the example below we have a function ``some_function`` that instantiates ``Foo`` and calls a method on it. The call to :func:`patch` replaces the class ``Foo`` with a mock. The ``Foo`` instance is the result of calling the mock, so it is configured by modifying the mock :attr:`~Mock.return_value`. ::
es: En el ejemplo siguiente tenemos una función ``some_function`` que crea una instancia de ``Foo`` y llama a un método en él. La llamada a :func:`patch` reemplaza la clase ``Foo`` con un mock. La instancia ``Foo`` es el resultado de llamar al mock, por lo que se configura modificando el mock :attr:`-Mock.return_value`. ::

source: Naming your mocks
es: Nombrando tus mocks

source: It can be useful to give your mocks a name. The name is shown in the repr of the mock and can be helpful when the mock appears in test failure messages. The name is also propagated to attributes or methods of the mock:
es: Puede ser útil poner un nombre a tus mocks. El nombre se muestra en la reproducción del mock y puede ser útil cuando el mock aparece en los mensajes de error de la prueba. El nombre también se propaga a los atributos o métodos del mock:

source: Tracking all Calls
es: Siguiendo todas las llamadas

source: Often you want to track more than a single call to a method. The :attr:`~Mock.mock_calls` attribute records all calls to child attributes of the mock - and also to their children.
es: A menudo, desea realizar un seguimiento de más de una llamada a un método. El atributo :attr:`~ Mock.mock_calls` registra todas las llamadas a los atributos secundarios del mock, y también a sus hijos.

source: If you make an assertion about ``mock_calls`` and any unexpected methods have been called, then the assertion will fail. This is useful because as well as asserting that the calls you expected have been made, you are also checking that they were made in the right order and with no additional calls:
es: Si realiza una afirmación sobre ``mock_calls`` y se ha llamado a cualquier método inesperado, la aserción fallará. Esto es útil porque además de afirmar que se han realizado las llamadas que esperaba, también está comprobando que se hicieron en el orden correcto y sin llamadas adicionales:

source: You use the :data:`call` object to construct lists for comparing with ``mock_calls``:
es: Utiliza el objeto :data:`call` para construir listas y compararlas con ``mock_calls``:

source: However, parameters to calls that return mocks are not recorded, which means it is not possible to track nested calls where the parameters used to create ancestors are important:
es: Sin embargo, los parámetros de las llamadas que devuelven mocks no se registran, lo que significa que no es posible realizar un seguimiento de las llamadas anidadas donde los parámetros utilizados para crear ancestros son importantes:

source: Setting Return Values and Attributes
es: Establecer valores de retorno y atributos

source: Setting the return values on a mock object is trivially easy:
es: Establecer los valores de retorno en un objeto mock es sumamente fácil:

source: Of course you can do the same for methods on the mock:
es: Por supuesto, puede hacer lo mismo con los métodos en el mock:

source: The return value can also be set in the constructor:
es: El valor devuelto también se puede establecer en el constructor:

source: If you need an attribute setting on your mock, just do it:
es: Si necesitas una configuración de atributo en su mock, simplemente haga:

source: Sometimes you want to mock up a more complex situation, like for example ``mock.connection.cursor().execute("SELECT 1")``. If we wanted this call to return a list, then we have to configure the result of the nested call.
es: A veces desea simular una situación más compleja, como por ejemplo ``mock.connection.cursor().execute("SELECT 1")``. Si esperamos que esta llamada devuelva una lista, entonces tenemos que configurar el resultado de la llamada anidada.

source: We can use :data:`call` to construct the set of calls in a "chained call" like this for easy assertion afterwards:
es: Podemos usar :data:`call` para construir el conjunto de llamadas en una "llamada encadenada" como esta para una fácil afirmación después:

source: It is the call to ``.call_list()`` that turns our call object into a list of calls representing the chained calls.
es: Es la llamada a ``.call_list()`` la que convierte nuestro objeto de llamada en una lista de llamadas que representan las llamadas encadenadas.

source: Raising exceptions with mocks
es: Generar excepciones con mocks

source: A useful attribute is :attr:`~Mock.side_effect`. If you set this to an exception class or instance then the exception will be raised when the mock is called.
es: Un atributo útil es :attr:`~Mock.side_effect`. Si establece esto en una clase o instancia de excepción, se producirá la excepción cuando se llame al mock.

source: Side effect functions and iterables
es: Funciones de efectos secundarios e iterables

source: ``side_effect`` can also be set to a function or an iterable. The use case for ``side_effect`` as an iterable is where your mock is going to be called several times, and you want each call to return a different value. When you set ``side_effect`` to an iterable every call to the mock returns the next value from the iterable:
es: ``side_effect`` también se puede asignar en una función o en una iterable. El caso de uso para ``side_effect`` como un iterable es donde se va a llamar a su mock varias veces, y desea que cada llamada devuelva un valor diferente. Cuando se asigna ``side_effect`` en un iterable cada llamada al mock devuelve el siguiente valor de lo iterable:

source: For more advanced use cases, like dynamically varying the return values depending on what the mock is called with, ``side_effect`` can be a function. The function will be called with the same arguments as the mock. Whatever the function returns is what the call returns:
es: Para casos de uso más avanzados, como variar dinámicamente los valores devueltos en función de cómo se llame al mock, ``side_effect`` puede ser una función. Se llamará a la función con los mismos argumentos que el mock. Lo que sea que la función devuelve es lo que devuelve la llamada:

source: Mocking asynchronous iterators
es: Iteradores asincrónicos de Mocking

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-iterators` through ``__aiter__``. The :attr:`~Mock.return_value` attribute of ``__aiter__`` can be used to set the return values to be used for iteration.
es: Desde Python 3.8, ``AsyncMock`` y ``MagicMock`` tienen soporte para mock :ref:`async-iterators` through ``__aiter__``. El :attr:`~Mock.return_value` atributo de ``__aiter__`` puede ser usado para asignar los valores de retorno que podrían ser usados por iteración.

source: Mocking asynchronous context manager
es: El gestor de contexto asincrónico de Mocking

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-context-managers` through ``__aenter__`` and ``__aexit__``. By default, ``__aenter__`` and ``__aexit__`` are ``AsyncMock`` instances that return an async function.
es: Desde Python 3.8, ``AsyncMock`` y ``MagicMock`` tienen soporte para mock :ref:`async-context-managers` a través de ``__aenter__`` y ``__aexit__``. De forma predeterminada, las instancias ``__aenter__`` y ``__aexit__`` son instancias de ``AsyncMock`` que devuelven una función asincrónica.

source: Creating a Mock from an Existing Object
es: Creando un mock desde un objeto existente

source: One problem with over use of mocking is that it couples your tests to the implementation of your mocks rather than your real code. Suppose you have a class that implements ``some_method``. In a test for another class, you provide a mock of this object that *also* provides ``some_method``. If later you refactor the first class, so that it no longer has ``some_method`` - then your tests will continue to pass even though your code is now broken!
es: Un problema con el uso excesivo de mocking es que combina sus pruebas a la implementación de sus mocks en lugar de su código real. Supongamos que tiene una clase que implementa ``some_method``. En una prueba para otra clase, se proporciona un mock de este objeto que *also* proporciona ``some_method``. Si más tarde refactoriza la primera clase, para que ya no tenga ``some_method`` - entonces sus pruebas seguirán pasando a pesar de que su código está ahora roto!

source: :class:`Mock` allows you to provide an object as a specification for the mock, using the *spec* keyword argument. Accessing methods / attributes on the mock that don't exist on your specification object will immediately raise an attribute error. If you change the implementation of your specification, then tests that use that class will start failing immediately without you having to instantiate the class in those tests.
es: :class:`Mock` le permite proporcionar un objeto como especificación para el mock, utilizando el argumento de palabra clave *spec*. El acceso a métodos / atributos en el mock que no existen en el objeto de especificación lanzará inmediatamente un error de atributo. Si cambia la implementación de la especificación, las pruebas que usan esa clase comenzarán a fallar inmediatamente sin tener que crear instancias de la clase en esas pruebas.

source: Using a specification also enables a smarter matching of calls made to the mock, regardless of whether some parameters were passed as positional or named arguments::
es: El uso de una especificación también permite una coincidencia más inteligente de las llamadas realizadas al mock, independientemente de si algunos parámetros se pasaron como argumentos posicionales o con nombre::

source: If you want this smarter matching to also work with method calls on the mock, you can use :ref:`auto-speccing <auto-speccing>`.
es: Si desea que esta coincidencia más inteligente también funcione con llamadas de método en el mock, puede usar :ref:`auto-speccing <auto-speccing>`.

source: If you want a stronger form of specification that prevents the setting of arbitrary attributes as well as the getting of them then you can use *spec_set* instead of *spec*.
es: Si desea una forma más fuerte de especificación que impida la configuración de atributos arbitrarios, así como la obtención de ellos, entonces puede usar *spec_set* en lugar de *spec*.

source: Using side_effect to return per file content
es: Uso de side_effect para devolver el contenido por archivo

source: :func:`mock_open` is used to patch :func:`open` method. :attr:`~Mock.side_effect` can be used to return a new Mock object per call. This can be used to return different contents per file stored in a dictionary::
es: :func:`mock_open` se utiliza para parchear el método :func:`open`. :attr:`~Mock.side_effect` se puede utilizar para devolver un nuevo objeto Mock por llamada. Esto puede usarse para devolver diferentes contenidos por fichero almacenado en un diccionario::

source: Patch Decorators
es: Decoradores de Parches

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
es: Con :func:`patch` importa que parchee objetos en el espacio de nombres donde se buscan. Esto es normalmente sencillo, pero para una guía rápida lea :ref:`where to patch <where-to-patch>`.

source: A common need in tests is to patch a class attribute or a module attribute, for example patching a builtin or patching a class in a module to test that it is instantiated. Modules and classes are effectively global, so patching on them has to be undone after the test or the patch will persist into other tests and cause hard to diagnose problems.
es: Una necesidad común en las pruebas es aplicar revisiones a un atributo de clase o a un atributo de módulo, por ejemplo, aplicar revisiones a una clase integrada o parchear una clase en un módulo para probar que se crea una instancia. Los módulos y las clases son efectivamente globales, por lo que el parcheo en ellos tiene que deshacerse después de la prueba o el parche persistirá en otras pruebas y causará problemas difíciles de diagnosticar.

source: mock provides three convenient decorators for this: :func:`patch`, :func:`patch.object` and :func:`patch.dict`. ``patch`` takes a single string, of the form ``package.module.Class.attribute`` to specify the attribute you are patching. It also optionally takes a value that you want the attribute (or class or whatever) to be replaced with. 'patch.object' takes an object and the name of the attribute you would like patched, plus optionally the value to patch it with.
es: mock proporciona tres decoradores convenientes para esto: :func:`patch`, :func:`patch.object` y :func:`patch.dict`. ``patch`` toma una sola cadena del formulario ``package.module.Class.attribute`` para especificar el atributo que está parcheando. También, opcionalmente, toma un valor con el que desea que se reemplace el atributo (o clase o lo que sea). 'patch.object' toma un objeto y el nombre del atributo con el que desea parchear, además, opcionalmente, del valor con el que parcharlo.

source: If you are patching a module (including :mod:`builtins`) then use :func:`patch` instead of :func:`patch.object`:
es: Si está parcheando un módulo (incluyendo :mod:`builtins`) entonces use :func:`patch` en lugar de :func:`patch.object`:

source: The module name can be 'dotted', in the form ``package.module`` if needed::
es: EL nombre del módulo puede ser 'dotted', en el formulario ``package.module`` si es necesario::

source: A nice pattern is to actually decorate test methods themselves:
es: Un buen patrón en realidad es decorar los métodos de pruebas propios:

source: If you want to patch with a Mock, you can use :func:`patch` with only one argument (or :func:`patch.object` with two arguments). The mock will be created for you and passed into the test function / method:
es: Si desea parchear con un Mock, puede usar :func:`patch` con un solo argumento (o :func:`patch.object` con dos argumentos). El mock se creará para usted y se pasará a la función de prueba / método:

source: You can stack up multiple patch decorators using this pattern::
es: Puede apilar varios decoradores de parches utilizando este patrón::

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``test_module.ClassName2`` is passed in first.
es: Al anidar decoradores de parches, los mocks se pasan a la función decorada en el mismo orden en que se aplicaron (el orden normal *Python* que se aplican los decoradores). Esto significa de abajo hacia arriba, así que en el ejemplo anterior el simulacro de ``test_module.ClassName2`` se pasa primero.

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
es: También está :func:`patch.dict` para establecer valores en un diccionario solo durante un ámbito y restaurar el diccionario a su estado original cuando finaliza la prueba:

source: ``patch``, ``patch.object`` and ``patch.dict`` can all be used as context managers.
es: ``patch``, ``patch.object`` and ``patch.dict`` se pueden utilizar como gestores de contexto.

source: Where you use :func:`patch` to create a mock for you, you can get a reference to the mock using the "as" form of the with statement:
es: Donde utilice :func:`patch` para crear un simulacro para usted, puede obtener una referencia al simulacro utilizando la forma "as" de la instrucción with:

source: As an alternative ``patch``, ``patch.object`` and ``patch.dict`` can be used as class decorators. When used in this way it is the same as applying the decorator individually to every method whose name starts with "test".
es: Como alternativa ``patch``, ``patch.object`` and ``patch.dict`` se pueden utilizar como decoradores de clase. Cuando se utiliza de esta manera es lo mismo que aplicar el decorador individualmente a cada método cuyo nombre comienza con "test".

source: Further Examples
es: Otros ejemplos

source: Here are some more examples for some slightly more advanced scenarios.
es: Estos son algunos ejemplos más para algunos escenarios ligeramente más avanzados.

source: Mocking chained calls
es: Mocking de llamadas encadenadas

source: Mocking chained calls is actually straightforward with mock once you understand the :attr:`~Mock.return_value` attribute. When a mock is called for the first time, or you fetch its ``return_value`` before it has been called, a new :class:`Mock` is created.
es: Mocking de las llamadas encadenadas es en realidad sencillo con mock una vez que entiende el atributo :attr:`~Mock.return_value` . Cuando se llama a un mock por primera vez, o se obtiene su ``return_value`` antes de que se llame, se crea un nuevo :class:`Mock`.

source: This means that you can see how the object returned from a call to a mocked object has been used by interrogating the ``return_value`` mock:
es: Esto significa que puede ver cómo se ha utilizado el objeto devuelto de una llamada a un objeto simulado interrogando el simulado ``return_value``:

source: From here it is a simple step to configure and then make assertions about chained calls. Of course another alternative is writing your code in a more testable way in the first place...
es: Desde aquí es un paso simple para configurar y luego hacer aserciones sobre llamadas encadenadas. Por supuesto, otra alternativa es escribir su código de una manera más comprobable en primer lugar...

source: So, suppose we have some code that looks a little bit like this:
es: Por lo tanto, supongamos que tenemos algún código que se ve un poco como este:

source: Assuming that ``BackendProvider`` is already well tested, how do we test ``method()``? Specifically, we want to test that the code section ``# more code`` uses the response object in the correct way.
es: Suponiendo que ``BackendProvider`` ya está bien probado, ¿cómo probamos ``method()``? En concreto, queremos probar que la sección de código ``# more code`` usa el objeto de respuesta de la manera correcta.
