Repository: python/python-docs-es
Catalog: library/unittest.mock.po
Languages: es

source: You may want a mock object to return ``False`` to a :func:`hasattr` call, or raise an :exc:`AttributeError` when an attribute is fetched. You can do this by providing an object as a :attr:`spec` for a mock, but that isn't always convenient.
es: Es posible que desees que un objeto simulado retorne ``False`` al llamar a :func:`hasattr`, o que lance una excepción :exc:`AttributeError` cuando se intenta obtener un atributo. Puedes hacer todo esto proporcionando un objeto adecuado al atributo :attr:`spec` del objeto simulado, pero no siempre es conveniente.

source: You "block" attributes by deleting them. Once deleted, accessing an attribute will raise an :exc:`AttributeError`.
es: Puedes "bloquear" atributos eliminándolos. Una vez eliminado, el acceso a un atributo lanzará una excepción :exc:`AttributeError`.

source: Mock names and the name attribute
es: Los nombres de los objetos simulados y el atributo *name*

source: Since "name" is an argument to the :class:`Mock` constructor, if you want your mock object to have a "name" attribute you can't just pass it in at creation time. There are two alternatives. One option is to use :meth:`~Mock.configure_mock`::
es: Dado que "name" es un argumento para el constructor de la clase :class:`Mock`, si quieres que tu objeto simulado tenga un atributo "name", no puedes simplemente pasarlo al constructor en tiempo de creación. Hay dos alternativas. Una opción es usar el método :meth:`~Mock.configure_mock`:

source: A simpler option is to simply set the "name" attribute after mock creation::
es: Una opción más sencilla es simplemente establecer el atributo "name" después de la creación del objeto simulado:

source: Attaching Mocks as Attributes
es: Adjuntar objetos simulados como atributos

source: When you attach a mock as an attribute of another mock (or as the return value) it becomes a "child" of that mock. Calls to the child are recorded in the :attr:`~Mock.method_calls` and :attr:`~Mock.mock_calls` attributes of the parent. This is useful for configuring child mocks and then attaching them to the parent, or for attaching mocks to a parent that records all calls to the children and allows you to make assertions about the order of calls between mocks:
es: Cuando se adjunta un objeto simulado como un atributo de otro objeto simulado (o como su valor de retorno) se convierte en un "hijo" del mismo. Las llamadas a los hijos se registran en los atributos :attr:`~Mock.method_calls` y :attr:`~Mock.mock_calls` del padre. Esto es útil para configurar objetos simulados hijos para después adjuntarlos al padre, o para adjuntar objetos simulados a un padre que se encargará de registrar todas las llamadas a los hijos, permitiéndote hacer aserciones sobre el orden de las llamadas entre objetos simulados:

source: The exception to this is if the mock has a name. This allows you to prevent the "parenting" if for some reason you don't want it to happen.
es: La excepción a lo anterior es si el objeto simulado tiene un nombre. Esto te permite evitar el comportamiento de "parentesco" explicado previamente, si por alguna razón no deseas que suceda.

source: Mocks created for you by :func:`patch` are automatically given names. To attach mocks that have names to a parent you use the :meth:`~Mock.attach_mock` method::
es: Los objetos simulados creados automáticamente por la función :func:`patch` también reciben nombres automáticamente. Para adjuntar un objeto simulado con nombre a un padre debes utilizar el método :meth:`~Mock.attach_mock`:

source: The only exceptions are magic methods and attributes (those that have leading and trailing double underscores). Mock doesn't create these but instead raises an :exc:`AttributeError`. This is because the interpreter will often implicitly request these methods, and gets *very* confused to get a new Mock object when it expects a magic method. If you need magic method support see :ref:`magic methods <magic-methods>`.
es: Las únicas excepciones son los métodos y atributos mágicos (aquellos que tienen doble subrayado al principio y al final). Mock no los crea automáticamente, sino que lanza una excepción :exc:`AttributeError`. Esto se debe a que el intérprete a menudo solicitará implícitamente estos métodos y terminaría *muy* confundido si obtiene un nuevo objeto Mock cuando espera un método mágico. Si necesitas soporte para métodos mágicos, consulta :ref:`métodos mágicos <magic-methods>`.

source: The patchers
es: Parcheadores

source: The patch decorators are used for patching objects only within the scope of the function they decorate. They automatically handle the unpatching for you, even if exceptions are raised. All of these functions can also be used in with statements or as class decorators.
es: Los decoradores patch se utilizan para parchear los objetos sólo dentro del ámbito de la función que decoran. Se encargan automáticamente de desparchear una vez terminada la prueba, incluso si se lanzan excepciones. Todas estas funciones también se pueden utilizar con declaraciones o como decoradores de clase.

source: :func:`patch` acts as a function decorator, class decorator or a context manager. Inside the body of the function or with statement, the *target* is patched with a *new* object. When the function/with statement exits the patch is undone.
es: :func:`patch` actúa como decorador de función, decorador de clase o como gestor de contexto. Ya sea en el interior del cuerpo de una función o dentro de una declaración with, *target* es parcheado con un objeto *new*. Cuando la función / declaración with termina su ejecución el parche se deshace automáticamente.

source: If *new* is omitted, then the target is replaced with an :class:`AsyncMock` if the patched object is an async function or a :class:`MagicMock` otherwise. If :func:`patch` is used as a decorator and *new* is omitted, the created mock is passed in as an extra argument to the decorated function. If :func:`patch` is used as a context manager the created mock is returned by the context manager.
es: Si se omite *new*, entonces el objetivo se reemplaza por un objeto :class:`AsyncMock` si el objeto parcheado es una función asíncrona, o con un objeto :class:`MagicMock` en caso contrario. Si se utiliza :func:`patch` como decorador y se omite *new*, el objeto simulado creado se pasa como un argumento adicional a la función decorada. Si se utiliza :func:`patch` como un gestor de contexto, el objeto simulado creado es retornado por el gestor de contexto.

source: *target* should be a string in the form ``'package.module.ClassName'``. The *target* is imported and the specified object replaced with the *new* object, so the *target* must be importable from the environment you are calling :func:`patch` from. The target is imported when the decorated function is executed, not at decoration time.
es: *target* debe ser una cadena de la forma ``'paquete.modulo.NombreDeLaClase'``. *target* es importado y el objeto especificado reemplazado por el objeto *new*, por lo que *target* debe ser importable desde el entorno desde el cual estás llamando a :func:`patch`. Hay que tener presente que *target* es importado cuando se ejecuta la función decorada, no en tiempo de decoración.

source: The *spec* and *spec_set* keyword arguments are passed to the :class:`MagicMock` if patch is creating one for you.
es: Los argumentos *spec* y *spec_set* se pasan a :class:`MagicMock` si patch está creando automáticamente uno para ti.

source: In addition you can pass ``spec=True`` or ``spec_set=True``, which causes patch to pass in the object being mocked as the spec/spec_set object.
es: Además, puedes pasar ``spec=True`` o ``spec_set=True``, lo que causa que patch pase el objeto que está siendo simulado como el objeto spec/spec_set.

source: *new_callable* allows you to specify a different class, or callable object, that will be called to create the *new* object. By default :class:`AsyncMock` is used for async functions and :class:`MagicMock` for the rest.
es: *new_callable* te permite especificar una clase diferente, o un objeto invocable, que será invocada para crear el objeto *new*. Por defecto se utiliza :class:`AsyncMock` para las funciones asíncronas y :class:`MagicMock` para el resto.

source: A more powerful form of *spec* is *autospec*. If you set ``autospec=True`` then the mock will be created with a spec from the object being replaced. All attributes of the mock will also have the spec of the corresponding attribute of the object being replaced. Methods and functions being mocked will have their arguments checked and will raise a :exc:`TypeError` if they are called with the wrong signature. For mocks replacing a class, their return value (the 'instance') will have the same spec as the class. See the :func:`create_autospec` function and :ref:`auto-speccing`.
es: Una variante más poderosa de *spec* es *autospec*. Si estableces ``autospec=True`` el objeto simulado se creará con una especificación del objeto que está siendo reemplazado. Todos los atributos del objeto simulado también tendrán la especificación del atributo correspondiente del objeto que está siendo reemplazado. Los argumentos de los métodos y funciones simulados son comprobados y se lanzará una excepción :exc:`TypeError` si se les llama con la firma incorrecta. Para los objetos simulados que sustituyen a una clase, su valor de retorno (la 'instancia') tendrá la misma especificación que la clase. Consultar la función :func:`create_autospec` y :ref:`auto-speccing` para más detalles.

source: Instead of ``autospec=True`` you can pass ``autospec=some_object`` to use an arbitrary object as the spec instead of the one being replaced.
es: En lugar de ``autospec=True``, puedes pasar ``autospec=some_object`` para utilizar un objeto arbitrario como especificación en lugar del objeto reemplazado.

source: By default :func:`patch` will fail to replace attributes that don't exist. If you pass in ``create=True``, and the attribute doesn't exist, patch will create the attribute for you when the patched function is called, and delete it again after the patched function has exited. This is useful for writing tests against attributes that your production code creates at runtime. It is off by default because it can be dangerous. With it switched on you can write passing tests against APIs that don't actually exist!
es: Por defecto, :func:`patch` fallará al intentar reemplazar atributos que no existen. Si pasas ``create=True`` y no existe el atributo, patch crea el atributo cuando la función se llama y lo elimina de nuevo en cuanto termina de ejecutarse . Esto es útil para implementar pruebas para atributos que tu código de producción crea en tiempo de ejecución. Está desactivado por defecto, ya que puede ser peligroso. ¡Al activarlo se pueden implementar pruebas que validen APIs que en realidad no existen!

source: If you are patching builtins in a module then you don't need to pass ``create=True``, it will be added by default.
es: Si estás parcheando objetos incorporados (builtins) en un módulo, no es necesario pasar ``create=True``, ya que en este caso se agrega de forma predeterminada.

source: Patch can be used as a :class:`TestCase` class decorator. It works by decorating each test method in the class. This reduces the boilerplate code when your test methods share a common patchings set. :func:`patch` finds tests by looking for method names that start with ``patch.TEST_PREFIX``. By default this is ``'test'``, which matches the way :mod:`unittest` finds tests. You can specify an alternative prefix by setting ``patch.TEST_PREFIX``.
es: Patch puede ser usado como un decorador de la clase :class:`TestCase`. Funciona decorando cada uno de los métodos de prueba presentes en la clase. Esto reduce el código repetitivo cuando tus métodos de prueba comparten un conjunto de parcheo común. :func:`patch` encuentra las pruebas mediante la búsqueda de métodos cuyos nombres comienzan con ``patch.TEST_PREFIX``. Por defecto es ``'test'``, que coincide con la forma en que :mod:`unittest` busca las pruebas. Se puede especificar un prefijo alternativo estableciendo un nuevo valor para el atributo ``patch.TEST_PREFIX``.

source: Patch can be used as a context manager, with the with statement. Here the patching applies to the indented block after the with statement. If you use "as" then the patched object will be bound to the name after the "as"; very useful if :func:`patch` is creating a mock object for you.
es: Patch puede ser usado como un gestor de contexto, con la declaración with. En este caso el parcheo se aplica al bloque sangrado inmediatamente después de la declaración with. Si utilizas "as", el objeto parcheado será enlazado al nombre especificado después de "as"; muy útil si :func:`patch` está creando un objeto simulado automáticamente.

source: ``patch.dict(...)``, ``patch.multiple(...)`` and ``patch.object(...)`` are available for alternate use-cases.
es: ``patch.dict(...)``, ``patch.multiple(...)`` y ``patch.object(...)`` están disponibles para casos de uso alternativos.

source: :func:`patch` as function decorator, creating the mock for you and passing it into the decorated function::
es: :func:`patch` como decorador de función, crea el objeto simulado por ti y lo pasa a la función decorada:

source: Patching a class replaces the class with a :class:`MagicMock` *instance*. If the class is instantiated in the code under test then it will be the :attr:`~Mock.return_value` of the mock that will be used.
es: Parchear una clase sustituye a la clase por una *instancia* de :class:`MagicMock`. Si la clase se instancia en el código bajo prueba, el atributo :attr:`~Mock.return_value` del objeto simulado será el utilizado.

source: If the class is instantiated multiple times you could use :attr:`~Mock.side_effect` to return a new mock each time. Alternatively you can set the *return_value* to be anything you want.
es: Si la clase se instancia en múltiples ocasiones, puedes utilizar el atributo :attr:`~Mock.side_effect` para retornar un nuevo objeto simulado cada vez. O también puedes establecer *return_value* para que sea lo que tu quieras.

source: To configure return values on methods of *instances* on the patched class you must do this on the :attr:`return_value`. For example::
es: Para configurar valores de retorno de métodos en *instancias* de la clase parcheada debes hacer uso del atributo :attr:`return_value`. Por ejemplo:

source: If you use *spec* or *spec_set* and :func:`patch` is replacing a *class*, then the return value of the created mock will have the same spec. ::
es: Si utilizas *spec* o *spec_set* y :func:`patch` está reemplazando una *clase*, el valor de retorno del objeto simulado creado tendrá las mismas especificaciones:

source: The *new_callable* argument is useful where you want to use an alternative class to the default :class:`MagicMock` for the created mock. For example, if you wanted a :class:`NonCallableMock` to be used::
es: El argumento *new_callable* es útil cuando deseas utilizar una clase por defecto alternativa a :class:`MagicMock` para el objeto simulado creado. Por ejemplo, si quieres que se use una clase :class:`NonCallableMock` por defecto:

source: Another use case might be to replace an object with an :class:`io.StringIO` instance::
es: Otro caso de uso podría ser la sustitución de un objeto por una instancia de :class:`io.StringIO`:

source: When :func:`patch` is creating a mock for you, it is common that the first thing you need to do is to configure the mock. Some of that configuration can be done in the call to patch. Any arbitrary keywords you pass into the call will be used to set attributes on the created mock::
es: Cuando :func:`patch` crea un objeto simulado para ti, a menudo lo primero que tienes que hacer es configurar el objeto simulado recién creado. Parte de la configuración se puede hacer en la propia llamada a patch. Cualquier palabra clave arbitraria que pases a la llamada será utilizada para establecer los atributos del objeto simulado creado:

source: As well as attributes on the created mock attributes, like the :attr:`~Mock.return_value` and :attr:`~Mock.side_effect`, of child mocks can also be configured. These aren't syntactically valid to pass in directly as keyword arguments, but a dictionary with these as keys can still be expanded into a :func:`patch` call using ``**``::
es: Los atributos de los objetos simulados hijos, como :attr:`~Mock.return_value` y :attr:`~Mock.side_effect`, también puede ser configurados en la llamada, dado que los objetos simulados hijos son atributos en si mismos del objeto simulado padre creado. Eso si, estos no son sintácticamente válidos para ser pasados directamente como argumentos por palabras clave a la función patch, pero un diccionario con ellos como claves si que puede ser expandido en una llama a :func:`patch` usando ``**``:

source: By default, attempting to patch a function in a module (or a method or an attribute in a class) that does not exist will fail with :exc:`AttributeError`::
es: Por defecto, el intento de parchear una función en un módulo (o un método o atributo en una clase) que no existe fallará lanzando una excepción :exc:`AttributeError`:

source: but adding ``create=True`` in the call to :func:`patch` will make the previous example work as expected::
es: pero añadir ``create=True`` en la llamada a :func:`patch` hará que el ejemplo previo funcione como se esperaba:

source: :func:`patch` now returns an :class:`AsyncMock` if the target is an async function.
es: :func:`patch` ahora retorna una instancia de :class:`AsyncMock` si el objetivo es una función asíncrona.

source: patch the named member (*attribute*) on an object (*target*) with a mock object.
es: parchea el miembro *attribute* invocado de un objeto *target* con un objeto simulado.

source: :func:`patch.object` can be used as a decorator, class decorator or a context manager. Arguments *new*, *spec*, *create*, *spec_set*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. Like :func:`patch`, :func:`patch.object` takes arbitrary keyword arguments for configuring the mock object it creates.
es: :func:`patch.object` se puede utilizar como un decorador, decorador de clase o un gestor de contexto. Los argumentos *new*, *spec*, *create*, *spec_set*, *autospec* y *new_callable* tienen el mismo significado que en la función :func:`patch`. Al igual que :func:`patch`, :func:`patch.object` toma argumentos por palabras clave arbitrarios para la configuración del objeto simulado que crea.

source: When used as a class decorator :func:`patch.object` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
es: Cuando se utiliza como un decorador de clase :func:`patch.object` se rige por ``patch.TEST_PREFIX`` a la hora de elegir los métodos a envolver.

source: You can either call :func:`patch.object` with three arguments or two arguments. The three argument form takes the object to be patched, the attribute name and the object to replace the attribute with.
es: Puedes llamar a :func:`patch.object` con tres argumentos o con dos argumentos. La forma de tres argumento toma el objeto a parchear, el nombre del atributo y el objeto con el que reemplazar el atributo.

source: When calling with the two argument form you omit the replacement object, and a mock is created for you and passed in as an extra argument to the decorated function:
es: Al llamar usando la variante de dos argumento se omite el objeto de sustitución, por lo tanto se crea un objeto simulado automáticamente y se pasa como argumento adicional a la función decorada:

source: *spec*, *create* and the other arguments to :func:`patch.object` have the same meaning as they do for :func:`patch`.
es: *spec*, *create* y el resto de argumentos de :func:`patch.object` tienen el mismo significado que en la función :func:`patch`.

source: Patch a dictionary, or dictionary like object, and restore the dictionary to its original state after the test.
es: Parchea un diccionario o un objeto similar a un diccionario y posteriormente lo restaura a su estado original una vez terminada la prueba.

source: *in_dict* can be a dictionary or a mapping like container. If it is a mapping then it must at least support getting, setting and deleting items plus iterating over keys.
es: *in_dict* puede ser un diccionario o un contenedor similar a uno. Si se trata de un objeto similar a un diccionario, debe soportar como mínimo el establecimiento, la obtención y la eliminación de elementos, además de permitir la iteración sobre las claves.

source: *in_dict* can also be a string specifying the name of the dictionary, which will then be fetched by importing it.
es: *in_dict* también puede ser una cadena que especifique el nombre del diccionario a parchear, el nombre es usado para obtener el diccionario mediante importación.

source: *values* can be a dictionary of values to set in the dictionary. *values* can also be an iterable of ``(key, value)`` pairs.
es: *values* puede ser otro diccionario con valores para ser añadidos al diccionario. *values* también puede ser un iterable de parejas ``(clave, valor)``.

source: If *clear* is true then the dictionary will be cleared before the new values are set.
es: Si *clear* es verdadero, el contenido del diccionario se borrará antes de establecer los nuevos valores.

source: :func:`patch.dict` can also be called with arbitrary keyword arguments to set values in the dictionary.
es: La función :func:`patch.dict` también puede ser invocada con argumentos por palabra clave arbitrarios para establecer los valores en el diccionario.

source: :func:`patch.dict` now returns the patched dictionary when used as a context manager.
es: La función :func:`patch.dict` ahora retorna el diccionario parcheado cuando se utiliza como gestor de contexto.

source: :func:`patch.dict` can be used as a context manager, decorator or class decorator:
es: :func:`patch.dict` se puede utilizar como gestor de contexto, decorador o decorador de clase:

source: When used as a class decorator :func:`patch.dict` honours ``patch.TEST_PREFIX`` (default to ``'test'``) for choosing which methods to wrap:
es: Cuando se utiliza :func:`patch.dict` como decorador de clase, se rige por ``patch.TEST_PREFIX`` (por defecto ``'test'``) a la hora de elegir qué métodos envolver:

source: If you want to use a different prefix for your test, you can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``. For more details about how to change the value of see :ref:`test-prefix`.
es: Si deseas utilizar un prefijo diferente para tu prueba, puede informar a los parcheadores del nuevo prefijo a usar estableciendo ``patch.TEST_PREFIX``. Para más detalles sobre cómo cambiar el valor del atributo consultar :ref:`test-prefix`.

source: :func:`patch.dict` can be used to add members to a dictionary, or simply let a test change a dictionary, and ensure the dictionary is restored when the test ends.
es: :func:`patch.dict` puede utilizarse para agregar miembros a un diccionario, o simplemente para dejar que una prueba modifique un diccionario y asegurarte de que el diccionario será restablecido cuando finalice la misma.

source: Keywords can be used in the :func:`patch.dict` call to set values in the dictionary:
es: Se pueden utilizar argumentos por palabra clave en la llamada a :func:`patch.dict` para establecer valores en el diccionario:
