Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: This attribute controls the maximum length of diffs output by assert methods that report diffs on failure. It defaults to 80*8 characters. Assert methods affected by this attribute are :meth:`assertSequenceEqual` (including all the sequence comparison methods that delegate to it), :meth:`assertDictEqual` and :meth:`assertMultiLineEqual`.
es: Este atributo controla la longitud máxima de las diferencias de salida de métodos assert que reportan diferencias en caso de fallo. El valor predeterminado es de 80*8 caracteres. Los métodos assert afectados por este atributo son :meth:`assertSequenceEqual` (incluyendo todos los métodos de comparación de secuencias que le delegan), :meth:`assertDictEqual` y :meth:`assertMultiLineEqual`.

source: Setting ``maxDiff`` to ``None`` means that there is no maximum length of diffs.
es: Poner ``maxDiff`` en ``None`` significa que no hay una longitud máxima de diferencias.

source: Testing frameworks can use the following methods to collect information on the test:
es: Los marcos de test pueden utilizar los siguientes métodos para reunir información sobre el test:

source: Return the number of tests represented by this test object. For :class:`TestCase` instances, this will always be ``1``.
es: Retorna el número de tests representados por este objeto de test. Para las instancias de :class:`TestCase`, este siempre será ``1``.

source: Return an instance of the test result class that should be used for this test case class (if no other result instance is provided to the :meth:`run` method).
es: Retorna una instancia de la clase de resultado de test que debería utilizarse para esta clase de caso de test (si no se proporciona otra instancia de resultado al método :meth:`run`).

source: For :class:`TestCase` instances, this will always be an instance of :class:`TestResult`; subclasses of :class:`TestCase` should override this as necessary.
es: Para las instancias de :class:`TestCase`, ésta siempre será una instancia de :class:`TestResult`; las subclases de :class:`TestCase` deben anular esto según sea necesario.

source: Return a string identifying the specific test case. This is usually the full name of the test method, including the module and class name.
es: Devuelva una cadena que identifique el caso de test específico. Normalmente es el nombre completo del método de test, incluyendo el nombre del módulo y de la clase.

source: Returns a description of the test, or ``None`` if no description has been provided. The default implementation of this method returns the first line of the test method's docstring, if available, or ``None``.
es: Devuelve una descripción de la prueba, o ``None`` si no se ha proporcionado ninguna descripción. La implementación por defecto de este método devuelve la primera línea de la docstring del método de test, si está disponible, o ``None`` .

source: In 3.1 this was changed to add the test name to the short description even in the presence of a docstring. This caused compatibility issues with unittest extensions and adding the test name was moved to the :class:`TextTestResult` in Python 3.2.
es: En 3.1 esto se cambió para añadir el nombre del test a la descripción corta incluso en presencia de una docstring. Esto causó problemas de compatibilidad con las extensiones de unittest y la adición del nombre de test fue movida a la :class:`TextTestResult` en Python 3.2.

source: Add a function to be called after :meth:`tearDown` to cleanup resources used during the test. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addCleanup` when they are added.
es: Añade una función que se llamará después de :meth:`tearDown` a los recursos de limpieza utilizados durante el test. Las funciones se llamarán en orden inverso al orden en que se agregan (:abbr:`LIFO (last-in, first-out)`). Se llaman con cualquier argumento y argumentos de palabra clave que se pase a :meth:`addCleanup` cuando se agregan.

source: If :meth:`setUp` fails, meaning that :meth:`tearDown` is not called, then any cleanup functions added will still be called.
es: Si :meth:`setUp` falla, lo que significa que :meth:`tearDown` no se llama, entonces cualquier función de limpieza añadida seguirá siendo llamada.

source: Enter the supplied :term:`context manager`. If successful, also add its :meth:`~object.__exit__` method as a cleanup function by :meth:`addCleanup` and return the result of the :meth:`~object.__enter__` method.
es: Introduce el gestor de contexto :meth:`context` suministrado. Si es exitoso, añade también su método :meth:`~object.__exit__` como función de limpieza mediante :meth:`addCleanup` y retorna el resultado del método :meth:`~object.__enter__`.

source: This method is called unconditionally after :meth:`tearDown`, or after :meth:`setUp` if :meth:`setUp` raises an exception.
es: Este método se llama incondicionalmente después de :meth:`tearDown`, o después de :meth:`setUp` si :meth:`setUp` lanza una excepción.

source: It is responsible for calling all the cleanup functions added by :meth:`addCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDown` then you can call :meth:`doCleanups` yourself.
es: Es responsable de llamar a todas las funciones de limpieza añadidas por :meth:`addCleanup`. Si necesitas que las funciones de limpieza se llamen *con anterioridad* a :meth:`tearDown` entonces puedes llamar a :meth:`doCleanups` tú mismo.

source: :meth:`doCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
es: :meth:`doCleanups` saca los métodos de la pila de funciones de limpieza uno a uno, así que se puede llamar en cualquier momento.

source: Add a function to be called after :meth:`tearDownClass` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addClassCleanup` when they are added.
es: Añade una función que se llamará después de :meth:`tearDownClass` para limpiar recursos utilizados durante la clase de test. Las funciones se llamarán en orden inverso al orden en que se agregan (:abbr:`LIFO (last-in, first-out)`). Se llaman con cualquier argumento y argumento de palabra clave que se pase a :meth:`addClassCleanup` cuando se añadan.

source: If :meth:`setUpClass` fails, meaning that :meth:`tearDownClass` is not called, then any cleanup functions added will still be called.
es: Si :meth:`setUpClass` falla, lo que significa que :meth:`tearDownClass` no se invoca, entonces cualquier función de limpieza añadida seguirá siendo llamada.

source: Enter the supplied :term:`context manager`. If successful, also add its :meth:`~object.__exit__` method as a cleanup function by :meth:`addClassCleanup` and return the result of the :meth:`~object.__enter__` method.
es: Introduce el :term:`context manager` suministrado. Si es exitoso, añade también su método :meth:`~object.__exit__` como función de limpieza mediante :meth:`addClassCleanup` y retorna el resultado del método :meth:`~object.__enter__`.

source: This method is called unconditionally after :meth:`tearDownClass`, or after :meth:`setUpClass` if :meth:`setUpClass` raises an exception.
es: Este método se llama incondicionalmente después de :meth:`tearDownClass`, o después de :meth:`setUpClass` si :meth:`setUpClass` lanza una excepción.

source: It is responsible for calling all the cleanup functions added by :meth:`addClassCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDownClass` then you can call :meth:`doClassCleanups` yourself.
es: Es responsable de llamar a todas las funciones de limpieza añadidas por :meth:`addCleanupClass`. Si necesitas que las funciones de limpieza se llamen *con anterioridad* a :meth:`tearDownClass` entonces puedes llamar a :meth:`doCleanupsClass` tú mismo.

source: :meth:`doClassCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
es: :meth:`doCleanupsClass` saca los métodos de la pila de funciones de limpieza de uno en uno, así que se puede llamar en cualquier momento.

source: This class provides an API similar to :class:`TestCase` and also accepts coroutines as test functions.
es: Esta clase proporciona una API similar a :class:`TestCase` y también acepta corutinas como funciones de test.

source: Method called to prepare the test fixture. This is called after :meth:`setUp`. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
es: Método llamado para preparar la configuración de test. Esto se llama después de :meth:`setUp`. Se llama inmediatamente antes de llamar al método de test; aparte de :exc:`AssertionError` o :exc:`SkipTest`, cualquier excepción lanzada por este método se considerará un error más que un fallo del test. La implementación por defecto no hace nada.

source: Method called immediately after the test method has been called and the result recorded. This is called before :meth:`tearDown`. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`asyncSetUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
es: Método llamado inmediatamente después de que se haya llamado el método de test y se haya registrado el resultado. Esto se llama antes de :meth:`tearDown`. Se llama así aunque el método de test haya lanzado una excepción, por lo que la implementación en las subclases puede necesitar ser particularmente cuidadosa en la comprobación del estado interno. Cualquier excepción, que no sea :exc:`AssertionError` o :exc:`SkipTest`, lanzada por este método se considerará un error adicional en lugar de un fallo del test (aumentando así el número total de errores reportados). Este método sólo se llamará si :meth:`asyncSetUp` tiene éxito, independientemente del resultado del método de test. La implementación por defecto no hace nada.

source: This method accepts a coroutine that can be used as a cleanup function.
es: Este método acepta una corutina que puede ser utilizada como función de limpieza.

source: Enter the supplied :term:`asynchronous context manager`. If successful, also add its :meth:`~object.__aexit__` method as a cleanup function by :meth:`addAsyncCleanup` and return the result of the :meth:`~object.__aenter__` method.
es: Introduce el :term:`asynchronous context manager` suministrado. Si es exitoso, añade también su método :meth:`~object.__aexit__` como función de limpieza mediante :meth:`addAsyncCleanup` y retorna el resultado del método :meth:`~object.__aenter__`.

source: Sets up a new event loop to run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller. At the end of the test all the tasks in the event loop are cancelled.
es: Establece un nuevo bucle de eventos para ejecutar el test, recogiendo el resultado en el objeto :class:`TestResult` pasado como *result*. Si se omite *result* o ``None``, se crea un objeto resultado temporal (llamando al método :meth:`defaultTestResult`) y se utiliza. El objeto resultante se devuelve al invocado de :meth:`run`. Al final del test se cancelan todas las tareas del bucle de eventos.

source: An example illustrating the order::
es: Un ejemplo ilustrando el orden::

source: After running the test, ``events`` would contain ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.
es: Después de ejecutar el test, ``events`` contendría ``[“setUp”, “asyncSetUp”, “test_response”, “asyncTearDown”, “tearDown”, “cleanup”]``.

source: This class implements the portion of the :class:`TestCase` interface which allows the test runner to drive the test, but does not provide the methods which test code can use to check and report errors. This is used to create test cases using legacy test code, allowing it to be integrated into a :mod:`unittest`-based test framework.
es: Esta clase implementa la porción de la interfaz :class:`TestCase` que permite al corredor de tests conducir los tests, pero no proporciona los métodos que el código de test puede utilizar para comprobar e informar de los errores. Se utiliza para crear casos de test utilizando código de prueba heredado, lo que permite que se integre en un marco de tests basado en :mod:`unittest`.

source: Grouping tests
es: Agrupando tests

source: This class represents an aggregation of individual test cases and test suites. The class presents the interface needed by the test runner to allow it to be run as any other test case. Running a :class:`TestSuite` instance is the same as iterating over the suite, running each test individually.
es: Esta clase representa una agregación de casos de test individuales y conjuntos de tests. La clase presenta la interfaz que necesita el corredor de tests para poder ser ejecutado como cualquier otro caso de test. Ejecutar una instancia :class:`TestSuite` es lo mismo que iterar sobre el conjunto, ejecutando cada test individualmente.

source: If *tests* is given, it must be an iterable of individual test cases or other test suites that will be used to build the suite initially. Additional methods are provided to add test cases and suites to the collection later on.
es: Si se indican *tests*, debe ser un iterable de casos de test individuales u otros conjuntos de tests que se usarán para construir el conjunto inicialmente. Se proporcionan métodos adicionales para añadir casos de test y conjuntos a la colección más adelante.

source: :class:`TestSuite` objects behave much like :class:`TestCase` objects, except they do not actually implement a test. Instead, they are used to aggregate tests into groups of tests that should be run together. Some additional methods are available to add tests to :class:`TestSuite` instances:
es: Los objetos de :class:`TestSuite` se comportan de manera muy parecida a los objetos de :class:`TestCase`, excepto que no implementan un test. En cambio, se usan para agregar tests en grupos de tests que deben ser ejecutados juntos. Existen algunos métodos adicionales para agregar tests a las instancias de :class:`TestSuite`:

source: Add a :class:`TestCase` or :class:`TestSuite` to the suite.
es: Añade un :class:`TestCase` o :class:`TestSuite` al conjunto.

source: Add all the tests from an iterable of :class:`TestCase` and :class:`TestSuite` instances to this test suite.
es: Añade todos los tests de un iterable de :class:`TestCase` y :class:`TestSuite` a este conjunto de tests.

source: This is equivalent to iterating over *tests*, calling :meth:`addTest` for each element.
es: Esto equivale a iterar sobre *tests*, llamando a :meth:`addTest` para cada elemento.

source: :class:`TestSuite` shares the following methods with :class:`TestCase`:
es: :class:`TestSuite` comparte los siguientes métodos con :class:`TestCase`:

source: Run the tests associated with this suite, collecting the result into the test result object passed as *result*. Note that unlike :meth:`TestCase.run`, :meth:`TestSuite.run` requires the result object to be passed in.
es: Ejecuta los tests asociados a este conjunto, recogiendo el resultado en el objeto de resultado del test pasado como *result*. Tenga en cuenta que a diferencia de :meth:`TestCase.run`, :meth:`TestSuite.run` requiere que se pase el objeto resultado.

source: Run the tests associated with this suite without collecting the result. This allows exceptions raised by the test to be propagated to the caller and can be used to support running tests under a debugger.
es: Ejecuta los tests asociados con este conjunto sin recoger los resultados. Esto permite que las excepciones lanzadas por este test sean propagadas al invocador y puedes ser usadas para apoyar tests que están ejecutándose con un debugger.

source: Return the number of tests represented by this test object, including all individual tests and sub-suites.
es: Retorna el numero de tests representados por este objeto de test, incluidos todos los test individuales y los sub-conjuntos.

source: Tests grouped by a :class:`TestSuite` are always accessed by iteration. Subclasses can lazily provide tests by overriding :meth:`__iter__`. Note that this method may be called several times on a single suite (for example when counting tests or comparing for equality) so the tests returned by repeated iterations before :meth:`TestSuite.run` must be the same for each call iteration. After :meth:`TestSuite.run`, callers should not rely on the tests returned by this method unless the caller uses a subclass that overrides :meth:`TestSuite._removeTestAtIndex` to preserve test references.
es: Los tests agrupados por una :class:`TestSuite` se acceden siempre por iteración. Las subclases pueden proporcionar tests anulando :meth:`__iter__`. Tenga en cuenta que este método puede ser invocado varias veces en un mismo conjunto (por ejemplo, cuando se cuentan los tests o se comparan por igualdad), por lo que los tests retornados por iteraciones repetidas antes de :meth:`TestSuite.run` deben ser los mismos para cada iteración de invocación. Después de :meth:`TestSuite.run`, los invocados no deben confiar en los tests retornados por este método a menos que el invocado utilice una subclase que anule :meth:`TestSuite._removeTestAtIndex` para preservar las referencias de los tests.

source: In earlier versions the :class:`TestSuite` accessed tests directly rather than through iteration, so overriding :meth:`__iter__` wasn't sufficient for providing tests.
es: En versiones anteriores la :class:`TestSuite` accedía a los test directamente en lugar de a través de la iteración, por lo que anular :meth:`__iter__` no era suficiente para proporcionar los tests.

source: In earlier versions the :class:`TestSuite` held references to each :class:`TestCase` after :meth:`TestSuite.run`. Subclasses can restore that behavior by overriding :meth:`TestSuite._removeTestAtIndex`.
es: En versiones anteriores, la :class:`TestSuite` tenía referencias a cada :class:`TestCase` después de :meth:`TestSuite.run`. Las subclases pueden restaurar ese comportamiento anulando :meth:`TestSuite._removeTestAtIndex`.

source: In the typical usage of a :class:`TestSuite` object, the :meth:`run` method is invoked by a :class:`TestRunner` rather than by the end-user test harness.
es: En el uso típico de un objeto :class:`TestSuite`, el método :meth:`run` es invocado por un :class:`TestRunner` en lugar de por el marco de test de pruebas automático del usuario final.

source: Loading and running tests
es: Cargando y ejecutando tests

source: The :class:`TestLoader` class is used to create test suites from classes and modules. Normally, there is no need to create an instance of this class; the :mod:`unittest` module provides an instance that can be shared as :data:`unittest.defaultTestLoader`. Using a subclass or instance, however, allows customization of some configurable properties.
es: La clase :class:`TestLoader` se utiliza para crear conjuntos de tests a partir de clases y módulos. Normalmente, no es necesario crear una instancia de esta clase; el módulo :mod:`unittest` proporciona una instancia que puede ser compartida como :data:`unittest.defaultTestLoader`. Sin embargo, el uso de una subclase o instancia permite la personalización de algunas propiedades configurables.

source: :class:`TestLoader` objects have the following attributes:
es: Los objetos :class:`TestLoader` tienen los siguientes atributos:

source: A list of the non-fatal errors encountered while loading tests. Not reset by the loader at any point. Fatal errors are signalled by the relevant method raising an exception to the caller. Non-fatal errors are also indicated by a synthetic test that will raise the original error when run.
es: Una lista de los errores no fatales encontrados durante la carga de tests. No reseteados por el cargador en ningún momento. Los errores fatales son señalados por el método relevante que lanza una excepción al invocador. Los errores no fatales también son indicados por una prueba sintética que lanzará el error original cuando se ejecute.

source: :class:`TestLoader` objects have the following methods:
es: Los objetos :class:`TestLoader` tienen los siguientes métodos:

source: Return a suite of all test cases contained in the :class:`TestCase`\ -derived :class:`testCaseClass`.
es: Devuelve un conjunto de todos los casos de test contenidos en la :class:`TestCase`\ derivada de :class:`testCaseClass`.

source: A test case instance is created for each method named by :meth:`getTestCaseNames`. By default these are the method names beginning with ``test``. If :meth:`getTestCaseNames` returns no methods, but the :meth:`runTest` method is implemented, a single test case is created for that method instead.
es: Se crea una instancia de caso de test para cada método nombrado por :meth:`getTestCaseNames`. Por defecto, estos son los nombres de los métodos que comienzan con ``test``. Si :meth:`getTestCaseNames` no retorna ningún método, pero se implementa el método :meth:`runTest`, se crea un único caso de test para ese método.

source: Return a suite of all test cases contained in the given module. This method searches *module* for classes derived from :class:`TestCase` and creates an instance of the class for each test method defined for the class.
es: Devuelva un conjunto de todos los casos de test contenidos en el módulo dado. Este método busca en *module* clases derivadas de :class:`TestCase` y crea una instancia de la clase para cada método de test definido para la clase.

source: While using a hierarchy of :class:`TestCase`\ -derived classes can be convenient in sharing fixtures and helper functions, defining test methods on base classes that are not intended to be instantiated directly does not play well with this method. Doing so, however, can be useful when the fixtures are different and defined in subclasses.
es: Aunque el uso de una jerarquía de clases derivadas de :class:`TestCase` puede ser conveniente para compartir configuraciones y funciones de ayuda, la definición de métodos de test en clases base que no están destinadas a ser instanciadas directamente no complementa bien con este método. Hacerlo, sin embargo, puede ser útil cuando las configuraciones son diferentes y están definidas en subclases.

source: If a module provides a ``load_tests`` function it will be called to load the tests. This allows modules to customize test loading. This is the `load_tests protocol`_. The *pattern* argument is passed as the third argument to ``load_tests``.
es: Si un módulo proporciona una función ``load_tests`` será llamado para cargar los tests. Esto permite a los módulos personalizar la carga de los tests. Este es el `load_tests protocol`_. El argumento *pattern* se pasa como tercer argumento a ``load_tests``.

source: Support for ``load_tests`` added.
es: Se ha añadido soporte para ``load_tests``.

source: Support for a keyword-only argument *pattern* has been added.
es: Se ha agregado soporte para un argumento *pattern* de solo palabra clave.
