Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: :mod:`unittest` --- Unit testing framework
es: :mod:`unittest` --- Framework de tests unitarios

source: **Source code:** :source:`Lib/unittest/__init__.py`
es: **Código fuente:** :source:`Lib/unittest/__init__.py`

source: (If you are already familiar with the basic concepts of testing, you might want to skip to :ref:`the list of assert methods <assert-methods>`.)
es: (Si ya estás familiarizado con los conceptos básicos de realización de tests, puedes saltar a :ref:`la lista de métodos de aserción <assert-methods>`.)

source: The :mod:`unittest` unit testing framework was originally inspired by JUnit and has a similar flavor as major unit testing frameworks in other languages. It supports test automation, sharing of setup and shutdown code for tests, aggregation of tests into collections, and independence of the tests from the reporting framework.
es: La infraestructura de tests unitarios :mod:`unittest` se inspiró en primera instancia en JUnit y ofrece aspectos similares a las principales estructuras de tests unitarios más importantes de otros lenguajes. Da soporte a automatización de tests, inicialización compartida, código de cierre de los tests, agregación de los tests en colecciones e independencia de los tests de la infraestructura que los reporta.

source: To achieve this, :mod:`unittest` supports some important concepts in an object-oriented way:
es: Para conseguir esto, :mod:`unittest` da soporte a ciertos conceptos importantes de una forma orientada a objetos:

source: test fixture
es: configuración de prueba (*fixture*)

source: A :dfn:`test fixture` represents the preparation needed to perform one or more tests, and any associated cleanup actions. This may involve, for example, creating temporary or proxy databases, directories, or starting a server process.
es: Un :dfn:`test fixture` representa los preparativos para realizar una o más pruebas y las acciones de limpieza asociadas. Esto puede incluir, por ejemplo, la creación de bases de datos temporales, directorios o el arranque de procesos del servidor.

source: test case
es: caso de prueba

source: A :dfn:`test case` is the individual unit of testing. It checks for a specific response to a particular set of inputs. :mod:`unittest` provides a base class, :class:`TestCase`, which may be used to create new test cases.
es: Un :dfn:`test case` es la unidad mínima de prueba. Verifica la respuesta específica a un juego particular de entradas. :mod:`unittest` proporciona una clase base, :class:`TestCase`, que se puede utilizar para crear nuevos casos de uso.

source: test suite
es: conjunto de pruebas

source: A :dfn:`test suite` is a collection of test cases, test suites, or both. It is used to aggregate tests that should be executed together.
es: Un :dfn:`test suite` es una colección de casos de prueba, juegos de prueba o ambos. Se usa para agrupar pruebas que se han de ejecutar juntas.

source: test runner
es: ejecutor de pruebas

source: A :dfn:`test runner` is a component which orchestrates the execution of tests and provides the outcome to the user. The runner may use a graphical interface, a textual interface, or return a special value to indicate the results of executing the tests.
es: Un :dfn:`test runner` es un componente que dirige la ejecución de las pruebas y proporciona un resultado. El ejecutor puede disponer de una interfaz gráfica, de texto o devolver un valor especial que indique el resultado de la ejecución de las pruebas.

source: Module :mod:`doctest`
es: Módulo :mod:`doctest`

source: Another test-support module with a very different flavor.
es: Otro módulo de soporte a pruebas con una solución muy diferente.

source: Kent Beck's original paper on testing frameworks using the pattern shared by :mod:`unittest`.
es: El documento original de Kent Beck sobre infraestructuras de prueba mediante el patrón que utiliza :mod:`unittest`.

source: Third-party unittest framework with a lighter-weight syntax for writing tests. For example, ``assert func(10) == 42``.
es: Una infraestructura de pruebas unitarias de otro proveedor con una sintaxis más ligera de escritura de pruebas, por ejemplo: ``assert func(10) == 42``.

source: An extensive list of Python testing tools including functional testing frameworks and mock object libraries.
es: Una lista extensa de herramientas de prueba para Python incluyendo infraestructuras de pruebas funcionales y librerías de objetos sucedáneos.

source: A special-interest-group for discussion of testing, and testing tools, in Python.
es: Grupo especializado en debate sobre las pruebas y las herramientas de prueba de Python.

source: The script :file:`Tools/unittestgui/unittestgui.py` in the Python source distribution is a GUI tool for test discovery and execution. This is intended largely for ease of use for those new to unit testing. For production environments it is recommended that tests be driven by a continuous integration system such as `Buildbot <https://buildbot.net/>`_, `Jenkins <https://www.jenkins.io/>`_, `GitHub Actions <https://github.com/features/actions>`_, or `AppVeyor <https://www.appveyor.com/>`_.
es: El script :file:`Tools/unittestgui/unittestgui.py` en la distribución de código fuente de Python es una herramienta gráfica para el descubrimiento y ejecución de pruebas. Está orientado principalmente a facilitar su uso para aquellos que son nuevos en las pruebas unitarias. Para entornos de producción, se recomienda que las pruebas sean ejecutadas por un sistema de integración continua como `Buildbot <https://buildbot.net/>`_, `Jenkins <https://www.jenkins.io/>`_, `GitHub Actions <https://github.com/features/actions>`_, o `AppVeyor <https://www.appveyor.com/>`_.

source: Basic example
es: Ejemplo sencillo

source: The :mod:`unittest` module provides a rich set of tools for constructing and running tests. This section demonstrates that a small subset of the tools suffice to meet the needs of most users.
es: El módulo :mod:`unittest` proporciona un conjunto de herramientas para construir y ejecutar pruebas. Esta sección demuestra que un pequeño subconjunto de las herramientas es suficiente para satisfacer las necesidades de la mayoría.

source: Here is a short script to test three string methods::
es: He aquí un breve script para probar estros tres métodos de cadena::

source: A testcase is created by subclassing :class:`unittest.TestCase`. The three individual tests are defined with methods whose names start with the letters ``test``. This naming convention informs the test runner about which methods represent tests.
es: Para crear un caso de prueba se genera una subclase de :class:`unittest.TestCase`. Las tres pruebas se definen con métodos cuyos nombres comienzan por las letras ``test``. Esta convención sobre nombres indica al ejecutor de pruebas qué métodos representan pruebas.

source: The crux of each test is a call to :meth:`~TestCase.assertEqual` to check for an expected result; :meth:`~TestCase.assertTrue` or :meth:`~TestCase.assertFalse` to verify a condition; or :meth:`~TestCase.assertRaises` to verify that a specific exception gets raised. These methods are used instead of the :keyword:`assert` statement so the test runner can accumulate all test results and produce a report.
es: El quid de cada test es la llamada a :meth:`~TestCase.assertEqual` para verificar un resultado esperado; :meth:`~TestCase.assertTrue` o :meth:`~TestCase.assertFalse` para verificar una condición; o :meth:`~TestCase.assertRaises` para asegurar que se lanza una excepción específica. Se utilizan estos métodos en lugar de la sentencia :keyword:`assert` para que el ejecutor de pruebas pueda acumular todos los resultados de la prueba de cara a realizar un informe.

source: The :meth:`~TestCase.setUp` and :meth:`~TestCase.tearDown` methods allow you to define instructions that will be executed before and after each test method. They are covered in more detail in the section :ref:`organizing-tests`.
es: Los métodos :meth:`~TestCase.setUp` y :meth:`~TestCase.tearDown` permiten definir instrucciones que han de ser ejecutadas antes y después, respectivamente, de cada método de prueba. Se describen con mas detalle en la sección :ref:`organizing-tests`.

source: The final block shows a simple way to run the tests. :func:`unittest.main` provides a command-line interface to the test script. When run from the command line, the above script produces an output that looks like this::
es: El bloque final muestra un modo sencillo de ejecutar las pruebas. :func:`unittest.main` proporciona una interfaz de línea de órdenes para el script de prueba. Cuando se ejecuta desde la línea de órdenes, el script anterior produce una salida como::

source: Passing the ``-v`` option to your test script will instruct :func:`unittest.main` to enable a higher level of verbosity, and produce the following output::
es: Si se le pasa una opción ``-v`` al script de prueba, se establecerá un nivel mayor de detalle del proceso de :func:`unittest.main` y se obtendrá la siguiente salida::

source: The above examples show the most commonly used :mod:`unittest` features which are sufficient to meet many everyday testing needs. The remainder of the documentation explores the full feature set from first principles.
es: Los ejemplos anteriores muestra las características más usuales de :mod:`unittest`, que son suficientes para solventar las necesidades cotidianas de pruebas. El resto de la documentación explora el juego completo de características, que abundan en los mismos principios.

source: The behavior of returning a value from a test method (other than the default ``None`` value), is now deprecated.
es: El comportamiento de retornar un valor de un método de prueba (que no sea el valor por defecto ``None``), ahora está obsoleto.

source: Command-Line Interface
es: Interfaz de línea de comandos

source: The unittest module can be used from the command line to run tests from modules, classes or even individual test methods::
es: Se puede usar el módulo `unittest` desde la línea de órdenes para ejecutar pruebas de módulos, clases o hasta métodos de prueba individuales::

source: You can pass in a list with any combination of module names, and fully qualified class or method names.
es: Se puede pasar una lista con cualquier combinación de nombres de módulo, así como clases o métodos completamente cualificados.

source: Test modules can be specified by file path as well::
es: Se puede especificar los módulos de prueba por ruta de fichero también::

source: This allows you to use the shell filename completion to specify the test module. The file specified must still be importable as a module. The path is converted to a module name by removing the '.py' and converting path separators into '.'. If you want to execute a test file that isn't importable as a module you should execute the file directly instead.
es: Esto permite usar el completado automático de nombre de fichero de la shell para especificar el módulo de pruebas. El fichero especificado aún debe ser susceptible de importarse como módulo. La ruta se convierte en nombre de módulo eliminando '.py' y convirtiendo el separador de directorios por '.'. Si se desea ejecutar un fichero de prueba que no se puede importar como módulo, se ha de ejecutar el fichero directamente.

source: You can run tests with more detail (higher verbosity) by passing in the -v flag::
es: Se pueden ejecutar las pruebas con más nivel de detalle (mayor verbosidad) pasando el parámetro `-v`::

source: When executed without arguments :ref:`unittest-test-discovery` is started::
es: Cuando se ejecuta sin argumentos, se inicia :ref:`unittest-test-discovery`::

source: For a list of all the command-line options::
es: Para obtener una lista de todas las opciones de línea de órdenes::

source: In earlier versions it was only possible to run individual test methods and not modules or classes.
es: En versiones anteriores sólo era posible ejecutar métodos de prueba individuales, pero no módulos ni clases.

source: Command-line options
es: Opciones de la línea de órdenes

source: :program:`unittest` supports these command-line options:
es: :program:`unittest` da soporte a las siguientes opciones de línea de órdenes:

source: The standard output and standard error streams are buffered during the test run. Output during a passing test is discarded. Output is echoed normally on test fail or error and is added to the failure messages.
es: Los flujos de datos de salida estándar y error estándar se acumulan en un búfer durante la ejecución de pruebas. La salida de las pruebas correctas se descarta. La salida de las pruebas que fallan o devuelven un error se añade a los mensajes de fallo.

source: :kbd:`Control-C` during the test run waits for the current test to end and then reports all the results so far. A second :kbd:`Control-C` raises the normal :exc:`KeyboardInterrupt` exception.
es: La pulsación de :kbd:`Control-C` durante la ejecución de pruebas espera a que termine la prueba en curso y da un informe de los resultados hasta ese momento. Una segunda pulsación de :kbd:`Control-C` lanza la excepción :exc:`KeyboardInterrupt` usual.

source: See `Signal Handling`_ for the functions that provide this functionality.
es: Consultar en `Gestión de señales`_ las funciones que proporcionan esta funcionalidad.

source: Stop the test run on the first error or failure.
es: Finaliza la ejecución tras el primer error o fallo.

source: Only run test methods and classes that match the pattern or substring. This option may be used multiple times, in which case all test cases that match any of the given patterns are included.
es: Ejecutar solamente los métodos y clases de prueba que coincidan con el patrón o subcadena de caracteres. Esta opción se puede usar más de una vez, en cuyo caso se incluirán todos los casos de prueba que coincidan con cualquiera de los patrones dados.

source: Patterns that contain a wildcard character (``*``) are matched against the test name using :meth:`fnmatch.fnmatchcase`; otherwise simple case-sensitive substring matching is used.
es: Los patrones que contengan un comodín (``*``) se comprueban contra el nombre de la prueba usando :meth:`fnmatch.fnmatchcase`; si no lo contienen, se usa una comprobación de contenido simple sensible a mayúsculas.

source: Patterns are matched against the fully qualified test method name as imported by the test loader.
es: Los patrones se comprueban contra el nombre del método completamente cualificado como lo importa el cargador de pruebas.

source: For example, ``-k foo`` matches ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``.
es: Por ejemplo, ``-k foo`` coincide con ``foo_tests.SomeTest.test_something`` y con ``bar_tests.SomeTest.test_foo``, pero no con ``bar_tests.FooTest.test_something``.

source: Show local variables in tracebacks.
es: Muestra las variables locales en las trazas.

source: Show the N slowest test cases (N=0 for all).
es: Muestra los N casos de prueba más lentos (N=0 para todos).

source: The command-line options ``-b``, ``-c`` and ``-f`` were added.
es: Se añadieron las opciones de línea de órdenes ``-b``, ``-c`` y ``-f``.

source: The command-line option ``--locals``.
es: La opción de línea de órdenes ``--locals``.

source: The command-line option ``-k``.
es: La opción de línea de órdenes ``-k``.

source: The command-line option ``--durations``.
es: La opción de línea de órdenes ``--durations``.

source: The command line can also be used for test discovery, for running all of the tests in a project or just a subset.
es: La línea de órdenes también se puede usar para descubrimiento de pruebas, para ejecutar todas las pruebas de un proyecto o un subconjunto de éstas.

source: Test Discovery
es: Descubrimiento de pruebas

source: Unittest supports simple test discovery. In order to be compatible with test discovery, all of the test files must be :ref:`modules <tut-modules>` or :ref:`packages <tut-packages>` importable from the top-level directory of the project (this means that their filenames must be valid :ref:`identifiers <identifiers>`).
es: Unittest da soporte al descubrimiento de pruebas simples. Para ser compatible con el descubrimiento de pruebas, todos los ficheros de prueba deben ser :ref:`módulos <tut-modules>` o :ref:`paquetes <tut-packages>` importables desde el directorio superior del proyecto (por lo que sus nombres han de ser :ref:`identificadores <identifiers>` válidos).

source: Test discovery is implemented in :meth:`TestLoader.discover`, but can also be used from the command line. The basic command-line usage is::
es: El descubrimiento de pruebas está implementado en :meth:`TestLoader.discover`, pero también se puede usar desde la línea de órdenes. La línea de órdenes básica es::

source: As a shortcut, ``python -m unittest`` is the equivalent of ``python -m unittest discover``. If you want to pass arguments to test discovery the ``discover`` sub-command must be used explicitly.
es: Como atajo, ``python -m unittest`` es el equivalente de ``python -m unittest discover``. Si se desea pasar argumentos al descubrimiento de pruebas, hay que pasar la sub-orden ``discover`` explícitamente.

source: The ``discover`` sub-command has the following options:
es: La sub-orden ``discover`` cuenta con las siguientes opciones:

source: Verbose output
es: Salida verbosa

source: Directory to start discovery (``.`` default)
es: Directorio de inicio para el descubrimiento (``.`` si se omite)

source: Pattern to match test files (``test*.py`` default)
es: Patrón para la búsqueda de ficheros de prueba (``test*.py`` si se omite)

source: Top level directory of project (defaults to start directory)
es: Directorio superior del proyecto (el directorio inicial si se omite)

source: The :option:`-s`, :option:`-p`, and :option:`-t` options can be passed in as positional arguments in that order. The following two command lines are equivalent::
es: Las opciones :option:`-s`, :option:`-p`, y :option:`-t` se pueden pasar por posición en el orden mostrado. Las siguientes líneas de órdenes son equivalentes::

source: As well as being a path it is possible to pass a package name, for example ``myproject.subpackage.test``, as the start directory. The package name you supply will then be imported and its location on the filesystem will be used as the start directory.
es: Además de pasar una ruta, es posible pasar el nombre de un paquete, por ejemplo ``myproject.subpackage.test``, como directorio de inicio. El nombre de paquete proporcionado será importado y su ubicación en el sistema de archivos será utilizada como directorio de inicio.

source: Test discovery loads tests by importing them. Once test discovery has found all the test files from the start directory you specify it turns the paths into package names to import. For example :file:`foo/bar/baz.py` will be imported as ``foo.bar.baz``.
es: El descubrimiento de pruebas carga las pruebas importándolas. Una vez que el descubrimiento ha encontrado todos los ficheros de prueba a partir del directorio inicial, especificado, convierte las rutas en nombres de paquetes a importar. Por ejemplo, :file:`foo/bar/baz.py` será importado como ``foo.bar.baz``.

source: If you have a package installed globally and attempt test discovery on a different copy of the package then the import *could* happen from the wrong place. If this happens test discovery will warn you and exit.
es: Si hay un paquete instalado globalmente y se intenta hacer un descubrimiento sobre una copia diferente a la instalada del paquete, *podría* ocurrir que se importe la versión incorrecta. Si ocurre esto, el descubrimiento lanza una advertencia y abandona.

source: If you supply the start directory as a package name rather than a path to a directory then discover assumes that whichever location it imports from is the location you intended, so you will not get the warning.
es: Si se proporciona el directorio de inicio como nombre de paquete en lugar de ruta a un directorio, el descubrimiento asume que la ubicación importada es la deseada, así que no se da la advertencia descrita.

source: Test modules and packages can customize test loading and discovery by through the `load_tests protocol`_.
es: Los módulos y paquetes de prueba pueden personalizar la carta y descubrimiento de pruebas mediante el `protocolo load_tests`_.

source: Test discovery supports :term:`namespace packages <namespace package>` for the start directory. Note that you need to specify the top level directory too (e.g. ``python -m unittest discover -s root/namespace -t root``).
es: El descubrimiento de pruebas admite :term:`paquetes nominales <namespace package>` para el directorio de inicio. Tenga en cuenta que también se necesita el directorio de nivel superior. (por ejemplo, ``python -m unittest discover -s root/namespace -t root``).

source: Python 3.11 dropped the :term:`namespace packages <namespace package>` support. It has been broken since Python 3.7. Start directory and subdirectories containing tests must be regular package that have ``__init__.py`` file.
es: Python 3.11 eliminó el soporte de los :term:`paquetes namespace <namespace package>`. Ha estado roto desde Python 3.7. El directorio de inicio y los subdirectorios que contengan pruebas deben ser paquetes regulares que tengan el archivo ``__init__.py``.

source: Directories containing start directory still can be a namespace package. In this case, you need to specify start directory as dotted package name, and target directory explicitly. For example::
es: Los directorios que contienen el directorio de inicio aún pueden ser un paquete de espacio de nombres. En este caso, es necesario especificar el directorio de inicio como nombre de paquete con puntos, y el directorio de destino explícitamente. Por ejemplo::

source: Organizing test code
es: Organización del código de pruebas

source: The basic building blocks of unit testing are :dfn:`test cases` --- single scenarios that must be set up and checked for correctness. In :mod:`unittest`, test cases are represented by :class:`unittest.TestCase` instances. To make your own test cases you must write subclasses of :class:`TestCase` or use :class:`FunctionTestCase`.
es: Los bloques de construcción básicos de las pruebas unitarias son los :dfn:`test cases`, escenarios simples que se han de configurar y cuya corrección hay que comprobar. En :mod:`unittest`, los casos de prueba están representados por instancias de :class:`unittest.TestCase`. Para crear nuevos casos de prueba, hay que escribir subclases de :class:`TestCase` o usar :class:`FunctionTestCase`.

source: The testing code of a :class:`TestCase` instance should be entirely self contained, such that it can be run either in isolation or in arbitrary combination with any number of other test cases.
es: El código de pruebas de una instancia de :class:`TestCase` debería ser completamente autónomo, de tal modo que se pueda ejecutar aisladamente o en una combinación arbitraria con otras clases de prueba.

source: The simplest :class:`TestCase` subclass will simply implement a test method (i.e. a method whose name starts with ``test``) in order to perform specific testing code::
es: La subclase más simple de :class:`TestCase` se limita a implementar un método test (o un método que empiece por ``test``) para realizar código de prueba específico::
