Repository: python/python-docs-es
Catalog: library/unittest.mock-examples.po
Languages: es

source: The standard behaviour for ``Mock`` instances is that attributes and the return value mocks are of the same type as the mock they are accessed on. This ensures that ``Mock`` attributes are ``Mocks`` and ``MagicMock`` attributes are ``MagicMocks`` [#]_. So if you're subclassing to add helper methods then they'll also be available on the attributes and return value mock of instances of your subclass.
es: El comportamiento estándar para las instancias ``Mock`` es que los atributos y los simulacros de valor devuelto son del mismo tipo que el simulacro en el que se accede a ellos. Esto garantiza que los atributos ``Mock`` son ``Mocks`` y los atributos ``MagicMock`` son ``MagicMocks`` [#]_. Por lo tanto, si está creando subclases para agregar métodos auxiliares, también estarán disponibles en los atributos y el valor devuelto mock de las instancias de su subclase.

source: Sometimes this is inconvenient. For example, `one user <https://code.google.com/archive/p/mock/issues/105>`_ is subclassing mock to created a `Twisted adaptor <https://twisted.org/documents/11.0.0/api/twisted.python.components.html>`_. Having this applied to attributes too actually causes errors.
es: A veces esto es inconveniente. Por ejemplo, `un usuario <https://code.google.com/archive/p/mock/issues/105>`_ está creando subclases de mock para crear un `Twisted adaptor <https://twisted.org/documents/11.0.0/api/twisted.python.components.html>`_. Tener esto aplicado a los atributos también puede causar errores en realidad.

source: ``Mock`` (in all its flavours) uses a method called ``_get_child_mock`` to create these "sub-mocks" for attributes and return values. You can prevent your subclass being used for attributes by overriding this method. The signature is that it takes arbitrary keyword arguments (``**kwargs``) which are then passed onto the mock constructor:
es: ``Mock`` (en todos sus sabores) utiliza un método llamado ``_get_child_mock`` para crear estos "sub-mocks" para atributos y valores devueltos. Puede evitar que la subclase se utilice para los atributos invalidando este método. La firma es que toma argumentos de palabra clave arbitrarios (``**kwargs``) que luego se pasan al constructor ficticio:

source: An exception to this rule are the non-callable mocks. Attributes use the callable variant because otherwise non-callable mocks couldn't have callable methods.
es: Una excepción a esta regla son los mock no invocables. Los atributos usan la variante a la que se puede llamar porque, de lo contrario, los simulacros a los que no se puede llamar no podrían tener métodos a los que se puede llamar.

source: Mocking imports with patch.dict
es: Importaciones de Mocking con patch.dict

source: One situation where mocking can be hard is where you have a local import inside a function. These are harder to mock because they aren't using an object from the module namespace that we can patch out.
es: Una situación en la que un mocking puede ser difícil es cuando tiene una importación local dentro de una función. Estos son más difíciles de simular porque no están usando un objeto del espacio de nombres del módulo que podemos revisar.

source: Generally local imports are to be avoided. They are sometimes done to prevent circular dependencies, for which there is *usually* a much better way to solve the problem (refactor the code) or to prevent "up front costs" by delaying the import. This can also be solved in better ways than an unconditional local import (store the module as a class or module attribute and only do the import on first use).
es: Por lo general, deben evitarse las importaciones locales. A veces se hacen para evitar dependencias circulares, para las que hay *generalmente* una manera mucho mejor de resolver el problema (refactorizar el código) o para evitar "costos iniciales" retrasando la importación. Esto también se puede resolver de mejores maneras que una importación local incondicional (almacenar el módulo como una clase o atributo de módulo y solo hacer la importación en el primer uso).

source: That aside there is a way to use ``mock`` to affect the results of an import. Importing fetches an *object* from the :data:`sys.modules` dictionary. Note that it fetches an *object*, which need not be a module. Importing a module for the first time results in a module object being put in ``sys.modules``, so usually when you import something you get a module back. This need not be the case however.
es: Aparte de eso, hay una manera de usar ``mock`` para afectar los resultados de una importación. La importación obtiene un *objeto* del diccionario :data:`sys.modules`. Tenga en cuenta que obtiene un *objeto*, que no tiene por qué ser un módulo. La importación de un módulo por primera vez da como resultado que un objeto de módulo se coloque en ``sys.modules``, por lo que normalmente cuando importe algo devuelve un modulo. Sin embargo, este no tiene por qué ser el caso.

source: This means you can use :func:`patch.dict` to *temporarily* put a mock in place in :data:`sys.modules`. Any imports whilst this patch is active will fetch the mock. When the patch is complete (the decorated function exits, the with statement body is complete or ``patcher.stop()`` is called) then whatever was there previously will be restored safely.
es: Esto significa que puede usar :func:`patch.dict` para *temporalmente* poner un mock en su lugar sobre :data:`sys.modules`. Cualquier importación mientras este parche está activo recuperará el mock. Cuando el parche está completo (la función decorada sale, el cuerpo de la instrucción with está completo o se llama a ``patcher.stop()``) entonces lo que había anteriormente se restaurará de forma segura.

source: Here's an example that mocks out the 'fooble' module.
es: Aquí hay un ejemplo de mock del módulo 'fooble'.

source: As you can see the ``import fooble`` succeeds, but on exit there is no 'fooble' left in :data:`sys.modules`.
es: Como puede ver, el ``import fooble`` tiene éxito, pero al salir no queda ningún 'fooble' en :data:`sys.modules`.

source: This also works for the ``from module import name`` form:
es: Esto también funciona para el formulario ``from module import name``:

source: With slightly more work you can also mock package imports:
es: Con un poco más de trabajo también puede simular las importaciones de paquetes:

source: Tracking order of calls and less verbose call assertions
es: Seguimiento del orden de las llamadas y de las aserciones de llamadas menos detalladas

source: The :class:`Mock` class allows you to track the *order* of method calls on your mock objects through the :attr:`~Mock.method_calls` attribute. This doesn't allow you to track the order of calls between separate mock objects, however we can use :attr:`~Mock.mock_calls` to achieve the same effect.
es: La clase :class:`Mock` le permite realizar un seguimiento del *orden* de las llamadas a métodos en sus objetos mock a través del atributo :attr:`~Mock.method_calls`. Esto no le permite rastrear el orden de las llamadas entre objetos simulados separados, sin embargo, podemos usar :attr:`~Mock.mock_calls` para lograr el mismo efecto.

source: Because mocks track calls to child mocks in ``mock_calls``, and accessing an arbitrary attribute of a mock creates a child mock, we can create our separate mocks from a parent one. Calls to those child mock will then all be recorded, in order, in the ``mock_calls`` of the parent:
es: Debido a que los mocks rastrean las llamadas a mocks secundarios en ``mock_calls``, y el acceso a un atributo arbitrario de un mock crea un mock secundario, podemos crear nuestros mocks separados de uno primario. Las llamadas a esos mocks hijos se grabarán, en orden, en el ``mock_calls`` del padre:

source: We can then assert about the calls, including the order, by comparing with the ``mock_calls`` attribute on the manager mock:
es: A continuación, podemos realizar afirmaciones sobre las llamadas, incluido el orden, comparando con el atributo ``mock_calls`` en el mock administrador:

source: If ``patch`` is creating, and putting in place, your mocks then you can attach them to a manager mock using the :meth:`~Mock.attach_mock` method. After attaching calls will be recorded in ``mock_calls`` of the manager. ::
es: Si ``patch`` está creando y poniendo en su lugar, sus mocks, puede adjuntarlos a un mock administrador usando el método :meth:`~Mock.attach_mock` . Después de adjuntar las llamadas se registrarán en ``mock_calls`` del administrador. ::

source: If many calls have been made, but you're only interested in a particular sequence of them then an alternative is to use the :meth:`~Mock.assert_has_calls` method. This takes a list of calls (constructed with the :data:`call` object). If that sequence of calls are in :attr:`~Mock.mock_calls` then the assert succeeds.
es: Si se han realizado muchas llamadas, pero solo está interesado en una secuencia particular de ellas, entonces una alternativa es usar el método :meth:`~Mock.assert_has_calls` . Esto toma una lista de llamadas (construidas con el objeto :data:`call`). Si esa secuencia de llamadas sobre :attr:`~Mock.mock_calls`, la aserción se realiza correctamente.

source: Even though the chained call ``m.one().two().three()`` aren't the only calls that have been made to the mock, the assert still succeeds.
es: Aunque la llamada encadenada ``m.one().two().three()`` no son las únicas llamadas que se han realizado al mock, la aserción aún tiene éxito.

source: Sometimes a mock may have several calls made to it, and you are only interested in asserting about *some* of those calls. You may not even care about the order. In this case you can pass ``any_order=True`` to ``assert_has_calls``:
es: A veces, un mock puede tener varias llamadas, y solo le interesa afirmar sobre *algunas* de esas llamadas. Puede que ni siquiera importe el pedido. En este caso, puede pasar ``any_order=True`` a ``assert_has_calls``:

source: More complex argument matching
es: Coincidencia de argumentos más compleja

source: Using the same basic concept as :data:`ANY` we can implement matchers to do more complex assertions on objects used as arguments to mocks.
es: Usando el mismo concepto básico que :data:`ANY` podemos implementar comparadores para hacer afirmaciones más complejas en objetos usados como argumentos para mocks.

source: Suppose we expect some object to be passed to a mock that by default compares equal based on object identity (which is the Python default for user defined classes). To use :meth:`~Mock.assert_called_with` we would need to pass in the exact same object. If we are only interested in some of the attributes of this object then we can create a matcher that will check these attributes for us.
es: Supongamos que esperamos que algún objeto se pase a un mock que, por defecto, se compara igual en función de la identidad del objeto (que es el valor predeterminado de Python para las clases definidas por el usuario). Para usar :meth:`~Mock.assert_called_with` tendríamos que pasar exactamente el mismo objeto. Si solo estamos interesados en algunos de los atributos de este objeto, podemos crear un comparador que verifique estos atributos por nosotros.

source: You can see in this example how a 'standard' call to ``assert_called_with`` isn't sufficient:
es: Puede ver en este ejemplo cómo una llamada 'estándar' a ``assert_called_with`` no es suficiente:

source: A comparison function for our ``Foo`` class might look something like this:
es: Una función de comparación para nuestra clase ``Foo`` podría verse así:

source: And a matcher object that can use comparison functions like this for its equality operation would look something like this:
es: Y un objeto comparador que puede usar funciones de comparación como esta para su operación de igualdad se vería así:

source: Putting all this together:
es: Poniendo todo esto junto:

source: The ``Matcher`` is instantiated with our compare function and the ``Foo`` object we want to compare against. In ``assert_called_with`` the ``Matcher`` equality method will be called, which compares the object the mock was called with against the one we created our matcher with. If they match then ``assert_called_with`` passes, and if they don't an :exc:`AssertionError` is raised:
es: El ``Matcher`` es instanciado con nuestra función de comparación y el objeto ``Foo`` con el que queremos comparar. En ``assert_called_with`` se llamará al método de igualdad ``Matcher``, que compara el objeto con el que se llamó al mock con el que creamos nuestro matcher. Si coinciden, entonces pasa ``assert_called_with``, y si no lo hacen, se lanzará un :exc:`AssertionError`:

source: With a bit of tweaking you could have the comparison function raise the :exc:`AssertionError` directly and provide a more useful failure message.
es: Con un poco de ajuste, podría hacer que la función de comparación genere el :exc:`AssertionError` directamente y proporcione un mensaje de falla más útil.

source: As of version 1.5, the Python testing library `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ provides similar functionality, that may be useful here, in the form of its equality matcher (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
es: A partir de la versión 1.5, la biblioteca de pruebas de Python `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ proporciona una funcionalidad similar, que puede ser útil aquí, en la forma de su comparador de igualdad (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
