Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: :meth:`assertMultiLineEqual` added as the default type equality function for comparing strings.
es: :meth:`assertMultiLineEqual` añadido como la función por defecto para igualdad de tipos cuando se comparan cadenas.

source: Test that *first* and *second* are not equal. If the values do compare equal, the test will fail.
es: Testea que *first* y *second* no son iguales. Si los valores son iguales, el test fallará.

source: Test that *expr* is true (or false).
es: Testea que *expr* es verdadero (o falso).

source: Note that this is equivalent to ``bool(expr) is True`` and not to ``expr is True`` (use ``assertIs(expr, True)`` for the latter). This method should also be avoided when more specific methods are available (e.g. ``assertEqual(a, b)`` instead of ``assertTrue(a == b)``), because they provide a better error message in case of failure.
es: Note que esto es equivalente a ``bool(expr) is True`` y no a ``expr is True`` (use ``assertIs(expr, True)`` para lo último). Este método también debe evitarse cuando se disponga de métodos más específicos (por ejemplo, ``assertEqual(a, b)`` en lugar de ``assertTrue(a == b)``), porque proporcionan un mejor mensaje de error en caso de fallo.

source: Test that *first* and *second* are (or are not) the same object.
es: Testea si *first* y *second* son (o no) el mismo objeto.

source: Test that *expr* is (or is not) ``None``.
es: Testea que *expr* es (o no es) ``None``.

source: Test that *member* is (or is not) in *container*.
es: Testea que *member* está (o no está) en *container*.

source: Test that *obj* is (or is not) an instance of *cls* (which can be a class or a tuple of classes, as supported by :func:`isinstance`). To check for the exact type, use :func:`assertIs(type(obj), cls) <assertIs>`.
es: Testea que *obj* es (o no es) una instancia de *cls* (que puede ser una clase o una tupla de clases, de la misma forma que soporta :func:`isinstance`). Para chequear por el tipo exacto, use :func:`assertIs(type(obj), cls) <assertIs>`.

source: It is also possible to check the production of exceptions, warnings, and log messages using the following methods:
es: Es también posible chequear la producción de excepciones, advertencias y mensajes de log usando los siguientes métodos:

source: ``fun(*args, **kwds)`` raises *exc*
es: ``fun(*args, **kwds)`` lanza *exc*

source: ``fun(*args, **kwds)`` raises *exc* and the message matches regex *r*
es: ``fun(*args, **kwds)`` lanza *exc* y el mensaje coincide con regex *r*

source: ``fun(*args, **kwds)`` raises *warn*
es: ``fun(*args, **kwds)`` lanza *warn*

source: ``fun(*args, **kwds)`` raises *warn* and the message matches regex *r*
es: ``fun(*args, **kwds)`` lanza *warn* y el mensaje coincide con regex *r*

source: The ``with`` block logs on *logger* with minimum *level*
es: El bloque ``with`` vuelca sus logs a *logger* con el *level* mínimo

source: :meth:`assertNoLogs(logger, level) <TestCase.assertNoLogs>`
es: :meth:`assertLogs(logger, level) <TestCase.assertLogs>`

source: The ``with`` block does not log on
es: El bloque ``with`` no ingresa

source: *logger* with minimum *level*
es: El bloque ``with`` vuelca sus logs a *logger* con el *level* mínimo

source: Test that an exception is raised when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertRaises`. The test passes if *exception* is raised, is an error if another exception is raised, or fails if no exception is raised. To catch any of a group of exceptions, a tuple containing the exception classes may be passed as *exception*.
es: Testea que se lanza una excepción cuando se llama a *callable* con cualquier argumento posicional o de palabra clave que también se pasa a :meth:`assertRaises`. El test pasa si se lanza *exception*, es un error si se lanza otra excepción, o falla si no se lanza ninguna excepción. Para tener en cuenta cualquiera de un grupo de excepciones, una tupla que contenga las clases de excepción puede ser pasada como *exception*.

source: If only the *exception* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
es: Si sólo se dan los argumentos de *exception* y posiblemente *msg*, retorna un administrador de contexto para que el código testado pueda ser escrito en línea en lugar de como una función::

source: When used as a context manager, :meth:`assertRaises` accepts the additional keyword argument *msg*.
es: Cuando se emplea como un administrador de contexto, :meth:`assertRaises` acepta el argumento por palabra clave adicional *msg*.

source: The context manager will store the caught exception object in its :attr:`exception` attribute. This can be useful if the intention is to perform additional checks on the exception raised::
es: El gestor de contexto almacenará el objeto de excepción capturado en su atributo :attr:`exception` . Esto puede ser útil si la intención es realizar comprobaciones adicionales sobre la excepción planteada::

source: Added the ability to use :meth:`assertRaises` as a context manager.
es: Añadió la capacidad de usar :meth:`assertRaises` como gestor de contexto.

source: Added the :attr:`exception` attribute.
es: Añadido el atributo :attr:`exception` .

source: Added the *msg* keyword argument when used as a context manager.
es: Añadido el argumento por palabra clave *msg* cuando se emplea un gestor de contexto.

source: Like :meth:`assertRaises` but also tests that *regex* matches on the string representation of the raised exception. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Examples::
es: Como :meth:`assertRaises` pero también testea que *regex* coincide en la representación de la cadena de la excepción planteada. *regex* puede ser un objeto de expresión regular o una cadena que contiene una expresión regular adecuada para ser usada por :func:`re.search`. Ejemplos::

source: or::
es: o::

source: Added under the name ``assertRaisesRegexp``.
es: Añadido bajo el nombre de ``assertRaisesRegexp``.

source: Renamed to :meth:`assertRaisesRegex`.
es: Renombrado a :meth:`assertRaisesRegex`.

source: Test that a warning is triggered when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertWarns`. The test passes if *warning* is triggered and fails if it isn't. Any exception is an error. To catch any of a group of warnings, a tuple containing the warning classes may be passed as *warnings*.
es: Testea que una advertencia se activa cuando se llama a *callable* con cualquier argumento posicional o de palabra clave que también se pasa a :meth:`assertWarns`. El test pasa si se activa el *warning* y falla si no lo hace. Cualquier excepción es un error. Para considerar cualquiera de un grupo de advertencias, una tupla que contenga las clases de advertencia puede ser pasada como *warnings*.

source: If only the *warning* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
es: Si sólo se dan los argumentos de *advertencia* y *msg*, retorna un gestor de contexto para que el código testado pueda ser escrito en línea en lugar de como una función::

source: When used as a context manager, :meth:`assertWarns` accepts the additional keyword argument *msg*.
es: Cuando se usa como gestor de contexto, :meth:`assertWarns` acepta el argumento de palabra clave adicional *msg*.

source: The context manager will store the caught warning object in its :attr:`warning` attribute, and the source line which triggered the warnings in the :attr:`filename` and :attr:`lineno` attributes. This can be useful if the intention is to perform additional checks on the warning caught::
es: El gestor de contexto almacenará el objeto de advertencia capturado en su atributo :attr:`warning`, y la línea del código que disparó las advertencias en los atributos :attr:`filename` y :attr:`lineno` . Esto puede ser útil si la intención es realizar comprobaciones adicionales sobre la advertencia capturada::

source: This method works regardless of the warning filters in place when it is called.
es: Este método funciona independientemente de los filtros de aviso que estén en su lugar cuando se llame.

source: Like :meth:`assertWarns` but also tests that *regex* matches on the message of the triggered warning. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Example::
es: Como :meth:`assertWarns` pero también testea que *regex* coincide en el mensaje del aviso disparado. *regex* puede ser un objeto de expresión regular o una cadena que contiene una expresión regular adecuada para ser usada por :func:`re.search`. Ejemplo::

source: A context manager to test that at least one message is logged on the *logger* or one of its children, with at least the given *level*.
es: Un gestor de contexto para comprobar que al menos un mensaje está registrado en el *logger* o en uno de sus hijos, con al menos el *level* dado.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages that were not blocked by a non-propagating descendent logger.
es: Si se da, *logger* debería ser un objeto :class:`logging.Logger` o un :class:`str` dando el nombre de un logger. El valor por defecto es el root logger, que captará todos los mensajes.

source: If given, *level* should be either a numeric logging level or its string equivalent (for example either ``"ERROR"`` or :const:`logging.ERROR`). The default is :const:`logging.INFO`.
es: Si se da, *level* debería ser un nivel de registro numérico o su equivalente en cadena de caracteres (por ejemplo, ya sea ``"ERROR"`` o :const:`logging.ERROR`). El valor predeterminado es :const:`logging.INFO`.

source: The test passes if at least one message emitted inside the ``with`` block matches the *logger* and *level* conditions, otherwise it fails.
es: El test pasa si al menos un mensaje emitido dentro del bloque ``with`` coincide con las condiciones de *logger* y *level*, de lo contrario falla.

source: The object returned by the context manager is a recording helper which keeps tracks of the matching log messages. It has two attributes:
es: El objeto devuelto por el gestor de contexto es un ayudante de grabación que lleva un registro de los mensajes de registro que coinciden. Tiene dos atributos:

source: A list of :class:`logging.LogRecord` objects of the matching log messages.
es: Una lista de objetos :class:`logging.LogRecord` de los mensajes de log coincidentes.

source: A list of :class:`str` objects with the formatted output of matching messages.
es: Una lista de objetos :class:`str` con la salida forrajeada en los mensajes coincidentes.

source: Example::
es: Ejemplo::

source: A context manager to test that no messages are logged on the *logger* or one of its children, with at least the given *level*.
es: Un gestor de contexto para comprobar que al menos un mensaje está registrado en el *logger* o en uno de sus hijos, con al menos el *level* dado.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages.
es: Si se da, *logger* debería ser un objeto :class:`logging.Logger` o un :class:`str` dándole el nombre de un logger. El valor por defecto es el root logger, que captará todos los mensajes.

source: Unlike :meth:`assertLogs`, nothing will be returned by the context manager.
es: A diferencia de :meth:`assertLogs`, el gestor de contexto no devolverá nada.

source: There are also other methods used to perform more specific checks, such as:
es: Hay también otros métodos empleados para realizar comprobaciones más específicas, tales como:

source: *a* and *b* have the same elements in the same number, regardless of their order.
es: *a* y *b* tienen los mismos elementos y en el mismo número, sin importar su orden.

source: Test that *first* and *second* are approximately (or not approximately) equal by computing the difference, rounding to the given number of decimal *places* (default 7), and comparing to zero. Note that these methods round the values to the given number of *decimal places* (i.e. like the :func:`round` function) and not *significant digits*.
es: Testea que *first* y *second* son aproximadamente (o no aproximadamente) iguales calculando su diferencia, redondeando al número dado de puntos *places* decimales (por defecto 7), y comparado a cero. Nótese que estos métodos redondean los valores al número dado de *puntos decimales* (por ejemplo como la función :func:`round`) y no *cifras significativas*.

source: If *delta* is supplied instead of *places* then the difference between *first* and *second* must be less or equal to (or greater than) *delta*.
es: Si se suministra *delta* en vez de *places* que entonces la diferencia entre *first* y *second* deba ser menor o igual a (o mayor que) *delta*.

source: Supplying both *delta* and *places* raises a :exc:`TypeError`.
es: Suministrar tanto *delta* como *places* lanza un :exc:`TypeError`.

source: :meth:`assertAlmostEqual` automatically considers almost equal objects that compare equal. :meth:`assertNotAlmostEqual` automatically fails if the objects compare equal. Added the *delta* keyword argument.
es: :meth:`assertAlmostEqual` considera automáticamente casi iguales a los objetos que se comparan igual. :meth:`assertNotAlmostEqual` falla automáticamente si los objetos comparan iguales. Añadido el argumento de palabra clave *delta*.

source: Test that *first* is respectively >, >=, < or <= than *second* depending on the method name. If not, the test will fail::
es: Prueba que *first* es respectivamente >, >=, < o <= que *second* dependiendo del nombre del método. Si no, el test fallará::

source: Test that a *regex* search matches (or does not match) *text*. In case of failure, the error message will include the pattern and the *text* (or the pattern and the part of *text* that unexpectedly matched). *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`.
es: Testea que una búsqueda *regex* coincide (o no coincide) con el *text*. En caso de fallo, el mensaje de error incluirá el patrón y el *text* (o el patrón y la parte de *text* que coincida inesperadamente). *regex* puede ser un objeto de expresión regular o una cadena que contiene una expresión regular adecuada para ser utilizada por :func:`re.search`.

source: Added under the name ``assertRegexpMatches``.
es: Añadido bajo el nombre de ``assertRegexpMatches``.

source: The method ``assertRegexpMatches()`` has been renamed to :meth:`.assertRegex`.
es: El método ``assertRegexpMatches()`` ha sido renombrado a :meth:`.assertRegex`.

source: Test that sequence *first* contains the same elements as *second*, regardless of their order. When they don't, an error message listing the differences between the sequences will be generated.
es: Testea que la secuencia *first* contiene los mismos elementos que *second*, independientemente de su orden. Cuando no lo hagan, se generará un mensaje de error con las diferencias entre las secuencias.

source: Duplicate elements are *not* ignored when comparing *first* and *second*. It verifies whether each element has the same count in both sequences. Equivalent to: ``assertEqual(Counter(list(first)), Counter(list(second)))`` but works with sequences of unhashable objects as well.
es: Los elementos duplicados *no* son ignorados cuando se comparan *first* y *second*. Verifica si cada elemento tiene la misma cuenta en ambas secuencias. Equivalente a: ``assertEqual(Counter(list(first)), Counter(list(second)))`` pero funciona también con secuencias de objetos que no son hashable.

source: The :meth:`assertEqual` method dispatches the equality check for objects of the same type to different type-specific methods. These methods are already implemented for most of the built-in types, but it's also possible to register new methods using :meth:`addTypeEqualityFunc`:
es: El método :meth:`assertEqual` envía la comprobación de igualdad de los objetos del mismo tipo a diferentes métodos específicos de tipo. Estos métodos ya están implementados para la mayoría de los tipos incorporados, pero también es posible registrar nuevos métodos usando :meth:`addTypeEqualityFunc`:

source: Registers a type-specific method called by :meth:`assertEqual` to check if two objects of exactly the same *typeobj* (not subclasses) compare equal. *function* must take two positional arguments and a third msg=None keyword argument just as :meth:`assertEqual` does. It must raise :data:`self.failureException(msg) <failureException>` when inequality between the first two parameters is detected -- possibly providing useful information and explaining the inequalities in details in the error message.
es: Registra un método específico de tipo llamado por :meth:`assertEqual` para comprobar si dos objetos del mismo *typeobj* (no subclases) comparan como iguales. *function* debe tomar dos argumentos posicionales y un tercer argumento de palabra clave msg=None tal y como lo hace :meth:`assertEqual`. Debe lanzar :data:`self.failureException(msg) <failureException>` cuando se detecta una desigualdad entre los dos primeros parámetros, posiblemente proporcionando información útil y explicando las desigualdades en detalle en el mensaje de error.

source: The list of type-specific methods automatically used by :meth:`~TestCase.assertEqual` are summarized in the following table. Note that it's usually not necessary to invoke these methods directly.
es: La lista de métodos específicos de tipo utilizados automáticamente por :meth:`~TestCase.assertEqual` se resumen en la siguiente tabla. Tenga en cuenta que normalmente no es necesario invocar estos métodos directamente.

source: Used to compare
es: Usado para comparar

source: Test that the multiline string *first* is equal to the string *second*. When not equal a diff of the two strings highlighting the differences will be included in the error message. This method is used by default when comparing strings with :meth:`assertEqual`.
es: Testea que la cadena multilínea *first* es igual a la cadena *second*. Cuando no sea igual, una diferencia de las dos cadenas que resalte las diferencias se incluirá en el mensaje de error. Este método se utiliza por defecto cuando se comparan cadenas con :meth:`assertEqual`.

source: Tests that two sequences are equal. If a *seq_type* is supplied, both *first* and *second* must be instances of *seq_type* or a failure will be raised. If the sequences are different an error message is constructed that shows the difference between the two.
es: Testea que dos secuencias son iguales. Si se suministra un *seq_type*, tanto *first* como *second* deben ser instancias de *seq_type* o se lanzará un fallo. Si las secuencias son diferentes se construye un mensaje de error que muestra la diferencia entre las dos.

source: This method is not called directly by :meth:`assertEqual`, but it's used to implement :meth:`assertListEqual` and :meth:`assertTupleEqual`.
es: Este método no es llamado directamente por :meth:`assertEqual`, pero se usa para implementar :meth:`assertListEqual` y :meth:`assertTupleEqual`.

source: Tests that two lists or tuples are equal. If not, an error message is constructed that shows only the differences between the two. An error is also raised if either of the parameters are of the wrong type. These methods are used by default when comparing lists or tuples with :meth:`assertEqual`.
es: Testea que dos listas o tuplas son iguales. Si no es así, se construye un mensaje de error que muestra sólo las diferencias entre las dos. También se lanza un error si alguno de los parámetros es del tipo equivocado. Estos métodos se utilizan por defecto cuando se comparan listas o tuplas con :meth:`assertEqual`.

source: Tests that two sets are equal. If not, an error message is constructed that lists the differences between the sets. This method is used by default when comparing sets or frozensets with :meth:`assertEqual`.
es: Testea que dos conjuntos son iguales. Si no es así, se construye un mensaje de error que enumera las diferencias entre los conjuntos. Este método se utiliza por defecto cuando se comparan los conjuntos o frozensets con :meth:`assertEqual`.

source: Fails if either of *first* or *second* does not have a :meth:`set.difference` method.
es: Falla si cualquiera de *first* o *second* no tiene un método de :meth:`set.difference`.

source: Test that two dictionaries are equal. If not, an error message is constructed that shows the differences in the dictionaries. This method will be used by default to compare dictionaries in calls to :meth:`assertEqual`.
es: Testea que dos diccionarios son iguales. Si no es así, se construye un mensaje de error que muestra las diferencias en los diccionarios. Este método se usará por defecto para comparar los diccionarios en las llamadas a :meth:`assertEqual`.

source: Finally the :class:`TestCase` provides the following methods and attributes:
es: Finalmente, :class:`TestCase` proporciona los siguientes métodos y atributos:

source: Signals a test failure unconditionally, with *msg* or ``None`` for the error message.
es: Señala un fallo del test incondicionalmente, con *msg* o ``None`` para el mensaje de error.

source: This class attribute gives the exception raised by the test method. If a test framework needs to use a specialized exception, possibly to carry additional information, it must subclass this exception in order to "play fair" with the framework. The initial value of this attribute is :exc:`AssertionError`.
es: Este atributo de clase da la excepción lanzada por el método de test. Si un marco de pruebas necesita utilizar una excepción especializada, posiblemente para llevar información adicional, debe subclasificar esta excepción para "jugar limpio" con el marco. El valor inicial de este atributo es :exc:`AssertionError`.

source: This class attribute determines what happens when a custom failure message is passed as the msg argument to an assertXYY call that fails. ``True`` is the default value. In this case, the custom message is appended to the end of the standard failure message. When set to ``False``, the custom message replaces the standard message.
es: Este atributo de clase determina lo que ocurre cuando se pasa un mensaje de fallo personalizado como el argumento msg a una llamada assertXYY que falla. ``True`` es el valor por defecto. En este caso, el mensaje personalizado se añade al final del mensaje de fallo estándar. Cuando se establece en ``False``, el mensaje personalizado reemplaza al mensaje estándar.

source: The class setting can be overridden in individual test methods by assigning an instance attribute, self.longMessage, to ``True`` or ``False`` before calling the assert methods.
es: La configuración de la clase puede ser anulada en los métodos de test individuales asignando un atributo de instancia, self.longMessage, a ``True`` o ``False`` antes de llamar a los métodos assert.

source: The class setting gets reset before each test call.
es: La configuración de la clase se reajusta antes de cada llamada de test.
