Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: Install the control-c handler. When a :const:`signal.SIGINT` is received (usually in response to the user pressing control-c) all registered results have :meth:`~TestResult.stop` called.
es: Instala el controlador de control-c. Cuando se recibe una :const:`signal.SIGINT` (normalmente en respuesta a que el usuario presione control-c) todos los resultados registrados tienen :meth:`~TestResult.stop` llamado.

source: Register a :class:`TestResult` object for control-c handling. Registering a result stores a weak reference to it, so it doesn't prevent the result from being garbage collected.
es: Registrar un objeto :class:`TestResult` para el manejo de control-c. El registro de un resultado almacena una referencia débil a él, por lo que no evita que el resultado sea recogido por el recolector de basura.

source: Registering a :class:`TestResult` object has no side-effects if control-c handling is not enabled, so test frameworks can unconditionally register all results they create independently of whether or not handling is enabled.
es: El registro de un objeto :class:`TestResult` no tiene efectos secundarios si el manejo de control-c no está habilitado, por lo que los marcos de pruebas pueden registrar incondicionalmente todos los resultados que crean independientemente de si el manejo está habilitado o no.

source: Remove a registered result. Once a result has been removed then :meth:`~TestResult.stop` will no longer be called on that result object in response to a control-c.
es: Elimine un resultado registrado. Una vez que un resultado ha sido eliminado, :meth:`~TestResult.stop` ya no se llamará en ese objeto de resultado en respuesta a un control-c.

source: When called without arguments this function removes the control-c handler if it has been installed. This function can also be used as a test decorator to temporarily remove the handler while the test is being executed::
es: Cuando se llama sin argumentos, esta función quita el gestor control-c si se ha instalado. Esta función también se puede utilizar como decorador de tests para quitar temporalmente el controlador mientras se ejecuta el test::
