Repository: python/python-docs-es
Catalog: library/unittest.mock.po
Languages: es

source: :func:`patch.dict` can be used with dictionary like objects that aren't actually dictionaries. At the very minimum they must support item getting, setting, deleting and either iteration or membership test. This corresponds to the magic methods :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__` and either :meth:`__iter__` or :meth:`__contains__`.
es: :func:`patch.dict` se puede utilizar con objetos similares a un diccionario, que no son realmente diccionarios. Estos objetos como mínimo deben permitir obtener, establecer y borrar elementos, además de soportar la iteración o la prueba de pertenencia. Dichas funcionalidades se corresponden a los métodos mágicos :meth:`__getitem__`, :meth:`__setitem__`, :meth:`__delitem__` e :meth:`__iter__` o :meth:`__contains__`.

source: Perform multiple patches in a single call. It takes the object to be patched (either as an object or a string to fetch the object by importing) and keyword arguments for the patches::
es: Realiza múltiples parches en una sola llamada. Se toma el objeto a ser parcheado (ya sea como un objeto o una cadena de caracteres con el nombre del mismo para obtener el objeto mediante importación) y los argumentos por palabras clave para los parches:

source: Use :data:`DEFAULT` as the value if you want :func:`patch.multiple` to create mocks for you. In this case the created mocks are passed into a decorated function by keyword, and a dictionary is returned when :func:`patch.multiple` is used as a context manager.
es: Usa :data:`DEFAULT` como valor si deseas que la función :func:`patch.multiple` cree objetos simulados automáticamente por ti. En este caso, los objetos simulados creados son pasados ​​a la función decorada mediante palabra clave y se retorna un diccionario cuando :func:`patch.multiple` se utiliza como gestor de contexto.

source: :func:`patch.multiple` can be used as a decorator, class decorator or a context manager. The arguments *spec*, *spec_set*, *create*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. These arguments will be applied to *all* patches done by :func:`patch.multiple`.
es: La función :func:`patch.multiple` se puede utilizar como un decorador, decorador de clase o como gestor de contexto. La argumentos *spec*, *spec_set*, *create*, *autospec* y *new_callable* tienen el mismo significado que en la función :func:`patch`. Estos argumentos se aplicarán a *todos* los parches realizados por :func:`patch.multiple`.

source: When used as a class decorator :func:`patch.multiple` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
es: Cuando se utiliza como decorador de clase, :func:`patch.multiple` se rige por ``patch.TEST_PREFIX`` a la hora de elegir qué métodos envolver.

source: If you want :func:`patch.multiple` to create mocks for you, then you can use :data:`DEFAULT` as the value. If you use :func:`patch.multiple` as a decorator then the created mocks are passed into the decorated function by keyword. ::
es: Si deseas que :func:`patch.multiple` cree objetos simulados automáticamente por ti, puedes utilizar :data:`DEFAULT` como valor. Si utilizas :func:`patch.multiple` como decorador, entonces los objetos simulados creados se pasan a la función decorada por palabra clave:

source: :func:`patch.multiple` can be nested with other ``patch`` decorators, but put arguments passed by keyword *after* any of the standard arguments created by :func:`patch`::
es: :func:`patch.multiple` se puede anidar junto a otros decoradores ``patch``, pero los argumentos pasados ​​por palabra clave se deben agregar *después* de cualquier argumento estándar creado por :func:`patch`:

source: If :func:`patch.multiple` is used as a context manager, the value returned by the context manager is a dictionary where created mocks are keyed by name::
es: Si :func:`patch.multiple` se utiliza como un gestor de contexto, el valor retornado por el mismo es un diccionario en el que los objetos simulados creados son almacenados, usando sus nombres como claves:

source: patch methods: start and stop
es: Métodos start y stop de patch

source: All the patchers have :meth:`start` and :meth:`stop` methods. These make it simpler to do patching in ``setUp`` methods or where you want to do multiple patches without nesting decorators or with statements.
es: Todos los parcheadores tienen los métodos :meth:`start` y :meth:`stop`. Esto facilita parchear en los métodos ``setUp`` o cuando deseas hacer múltiples parches sin usar decoradores anidados o declaraciones with.

source: To use them call :func:`patch`, :func:`patch.object` or :func:`patch.dict` as normal and keep a reference to the returned ``patcher`` object. You can then call :meth:`start` to put the patch in place and :meth:`stop` to undo it.
es: Para utilizar estos métodos, llama a :func:`patch`, :func:`patch.object` o :func:`patch.dict` como haces normalmente y mantén una referencia al objeto ``patcher`` retornado. A continuación, puedes llamar al método :meth:`start` para aplicar el parche y a :meth:`stop` para deshacerlo.

source: If you are using :func:`patch` to create a mock for you then it will be returned by the call to ``patcher.start``. ::
es: Si estás utilizando :func:`patch` para crear un objeto simulado automáticamente, este será retornado por la llamada a ``patcher.start``:

source: A typical use case for this might be for doing multiple patches in the ``setUp`` method of a :class:`TestCase`::
es: Un uso típico de esto podría ser realizar múltiples parches en el método ``setUp`` de un :class:`TestCase`:

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the ``setUp`` then ``tearDown`` is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
es: Si se utiliza esta técnica debes asegurarte de que el parcheo está "sin aplicar" llamando a ``stop``. Esto puede ser más complicado de lo que parece, ya que si se produce una excepción en el ``setUp`` no se llama a ``tearDown`` a continuación. :meth:`unittest.TestCase.addCleanup` hace que esto sea más fácil:

source: As an added bonus you no longer need to keep a reference to the ``patcher`` object.
es: Como beneficio adicional, ya no es necesario mantener una referencia al objeto ``patcher``.

source: It is also possible to stop all patches which have been started by using :func:`patch.stopall`.
es: También es posible detener todos los parches que han sido iniciados usando :func:`patch.stopall`.

source: Stop all active patches. Only stops patches started with ``start``.
es: Detiene todos los parches activos. Sólo se detienen parches iniciados con ``start``.

source: patch builtins
es: Parchear objetos incorporados (builtins)

source: You can patch any builtins within a module. The following example patches builtin :func:`ord`::
es: Puedes parchear cualquier objeto incorporado dentro de un módulo. El siguiente ejemplo parchea la función incorporada :func:`ord`:

source: All of the patchers can be used as class decorators. When used in this way they wrap every test method on the class. The patchers recognise methods that start with ``'test'`` as being test methods. This is the same way that the :class:`unittest.TestLoader` finds test methods by default.
es: Todos los parcheadores se puede utilizar como decoradores de clase. Cuando se usan de esta forma, todos los métodos a probar en la clase son envueltos. Los parcheadores reconocen los métodos que comienzan con ``'test'`` como métodos a probar. Esta es la misma forma que la clase :class:`unittest.TestLoader` usa para encontrar métodos de prueba por defecto.

source: It is possible that you want to use a different prefix for your tests. You can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``::
es: Cabe la posibilidad de que desees utilizar un prefijo diferente para las pruebas. Puedes informar a los parcheadores del cambio de prefijo estableciendo el atributo ``patch.TEST_PREFIX``:

source: Nesting Patch Decorators
es: Anidando decoradores patch

source: If you want to perform multiple patches then you can simply stack up the decorators.
es: Si deseas aplicar múltiples parches, solo tienes que apilar los decoradores.

source: You can stack up multiple patch decorators using this pattern:
es: Puede apilar múltiples decoradores patch usando el siguiente patrón:

source: Note that the decorators are applied from the bottom upwards. This is the standard way that Python applies decorators. The order of the created mocks passed into your test function matches this order.
es: Ten en cuenta que los decoradores se aplican desde abajo hacia arriba. Esta es la manera estándar de Python para aplicar decoradores. El orden en el que los objetos simulados generados se pasan a la función de prueba coincide con este orden.

source: Where to patch
es: Dónde parchear

source: :func:`patch` works by (temporarily) changing the object that a *name* points to with another one. There can be many names pointing to any individual object, so for patching to work you must ensure that you patch the name used by the system under test.
es: :func:`patch` funciona cambiando (temporalmente) el objeto al que apunta *name* con otro. Puede haber muchos nombres apuntando a cualquier objeto individual, por lo que para que el parcheo funcione, debes asegurarte de parchear el nombre utilizado para el objeto por el sistema concreto bajo prueba.

source: The basic principle is that you patch where an object is *looked up*, which is not necessarily the same place as where it is defined. A couple of examples will help to clarify this.
es: El principio básico es parchear donde un objeto es *buscado*, que no es necesariamente el mismo lugar donde está definido. Un par de ejemplos ayudarán a aclarar esto.

source: Imagine we have a project that we want to test with the following structure::
es: Imaginemos que tenemos un proyecto, que queremos probar, con la siguiente estructura:

source: Now we want to test ``some_function`` but we want to mock out ``SomeClass`` using :func:`patch`. The problem is that when we import module b, which we will have to do then it imports ``SomeClass`` from module a. If we use :func:`patch` to mock out ``a.SomeClass`` then it will have no effect on our test; module b already has a reference to the *real* ``SomeClass`` and it looks like our patching had no effect.
es: Ahora queremos probar ``some_function``, pero queremos simular ``SomeClass`` utilizando :func:`patch`. El problema es que cuando importamos el módulo b, lo cual tenemos que hacer obligatoriamente, se importa ``SomeClass`` del módulo a. Si utilizamos :func:`patch` para simular ``a.SomeClass``, no tendrá ningún efecto en nuestra prueba; el módulo b ya tiene una referencia a la ``SomeClass`` *real*, por lo que parece que nuestro parcheo no tuvo ningún efecto.

source: The key is to patch out ``SomeClass`` where it is used (or where it is looked up). In this case ``some_function`` will actually look up ``SomeClass`` in module b, where we have imported it. The patching should look like::
es: La clave es parchear ``SomeClass`` donde se utiliza (o donde es buscado). En este caso ``some_function`` realmente va a buscar ``SomeClass`` en el módulo b, donde lo hemos importado. La aplicación de parches debe ser similar a:

source: However, consider the alternative scenario where instead of ``from a import SomeClass`` module b does ``import a`` and ``some_function`` uses ``a.SomeClass``. Both of these import forms are common. In this case the class we want to patch is being looked up in the module and so we have to patch ``a.SomeClass`` instead::
es: Sin embargo, ten en cuenta el escenario alternativo donde en el módulo b en lugar de ``from a import SomeClass`` se hace ``import a`` y ``some_function`` usa ``a.SomeClass``. Ambas formas de importación son comunes. En este caso, la clase que queremos parchear está siendo buscada en el módulo, por lo que tenemos que parchear ``a.SomeClass``:

source: Patching Descriptors and Proxy Objects
es: Parcheando descriptores y objetos proxy

source: Both patch_ and patch.object_ correctly patch and restore descriptors: class methods, static methods and properties. You should patch these on the *class* rather than an instance. They also work with *some* objects that proxy attribute access, like the `django settings object <http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_.
es: Tanto patch_ como patch.object_ parchean descriptores correctamente y los restauran posteriormente: métodos de clase, métodos estáticos y propiedades. Los descriptores deben ser parcheados en la *clase* y no en una instancia. También funcionan con *algunos* objetos que actúan como proxy en el acceso a atributos, como el objeto de configuraciones de django (`django settings object <http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_).

source: MagicMock and magic method support
es: MagicMock y el soporte de métodos mágicos

source: Mocking Magic Methods
es: Simular métodos mágicos

source: :class:`Mock` supports mocking the Python protocol methods, also known as "magic methods". This allows mock objects to replace containers or other objects that implement Python protocols.
es: :class:`Mock` soporta la simulación de los métodos de protocolo de Python, también conocidos como "métodos mágicos". Esto permite a los objetos simulados reemplazar contenedores u otros objetos que implementan protocolos de Python.

source: Because magic methods are looked up differently from normal methods [#]_, this support has been specially implemented. This means that only specific magic methods are supported. The supported list includes *almost* all of them. If there are any missing that you need please let us know.
es: Dado que los métodos mágicos se buscan de manera diferente a los métodos normales [#]_, este soporte ha sido especialmente implementado. Esto significa que sólo es compatible con métodos mágicos específicos. La lista de métodos soportados incluye *casi* todos los existentes. Si hay alguno que falta y que consideras necesario, por favor háznoslo saber.

source: You mock magic methods by setting the method you are interested in to a function or a mock instance. If you are using a function then it *must* take ``self`` as the first argument [#]_.
es: Puedes simular métodos mágicos estableciendo el método que te interesa en una función o en una instancia simulada. Si utilizas una función, *debe* aceptar ``self`` como primer argumento [#]_.

source: One use case for this is for mocking objects used as context managers in a :keyword:`with` statement:
es: Un caso de uso para esto es simular objetos usados ​​como gestores de contexto en una declaración :keyword:`with`:

source: Calls to magic methods do not appear in :attr:`~Mock.method_calls`, but they are recorded in :attr:`~Mock.mock_calls`.
es: Las llamadas a métodos mágicos no aparecen registradas en :attr:`~Mock.method_calls`, aunque si se registran en :attr:`~Mock.mock_calls`.

source: If you use the *spec* keyword argument to create a mock then attempting to set a magic method that isn't in the spec will raise an :exc:`AttributeError`.
es: Si se utiliza el argumento por palabra clave *spec* para crear un objeto simulado, intentar después establecer un método mágico que no está en la especificación lanzará una excepción :exc:`AttributeError`.

source: The full list of supported magic methods is:
es: La lista completa de los métodos mágicos soportados es la siguiente:

source: ``__hash__``, ``__sizeof__``, ``__repr__`` and ``__str__``
es: ``__hash__``, ``__sizeof__``, ``__repr__`` y ``__str__``

source: ``__dir__``, ``__format__`` and ``__subclasses__``
es: ``__dir__``, ``__format__`` y ``__subclasses__``

source: ``__round__``, ``__floor__``, ``__trunc__`` and ``__ceil__``
es: ``__round__``, ``__floor__``, ``__trunc__`` y ``__ceil__``

source: Comparisons: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` and ``__ne__``
es: Comparaciones: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` y ``__ne__``

source: Container methods: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` and ``__missing__``
es: Métodos de contenedores: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` y ``__missing__``

source: Context manager: ``__enter__``, ``__exit__``, ``__aenter__`` and ``__aexit__``
es: Administrador de contexto: ``__enter__``, ``__exit__``, ``__aenter__`` y ``__aexit__``

source: Unary numeric methods: ``__neg__``, ``__pos__`` and ``__invert__``
es: Métodos numéricos unarios: ``__neg__``, ``__pos__`` y ``__invert__``

source: The numeric methods (including right hand and in-place variants): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__div__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__``, and ``__pow__``
es: Los métodos numéricos (incluyendo los métodos estándar y las variantes in-place): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__div__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__``, y ``__pow__``

source: Numeric conversion methods: ``__complex__``, ``__int__``, ``__float__`` and ``__index__``
es: Métodos de conversión numérica: ``__complex__``, ``__int__``, ``__float__`` y ``__index__``

source: Descriptor methods: ``__get__``, ``__set__`` and ``__delete__``
es: Métodos de descriptores: ``__get__``, ``__set__`` y ``__delete__``

source: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
es: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` y ``__setstate__``

source: File system path representation: ``__fspath__``
es: Representación de rutas del sistema de archivos: ``__fspath__``

source: Asynchronous iteration methods: ``__aiter__`` and ``__anext__``
es: Métodos de iteración asíncronos: ``__aiter__`` y ``__anext__``

source: Added support for :func:`os.PathLike.__fspath__`.
es: Se añadió soporte para :func:`os.PathLike.__fspath__`.

source: Added support for ``__aenter__``, ``__aexit__``, ``__aiter__`` and ``__anext__``.
es: Se añadió soporte para ``__aenter__``, ``__aexit__``, ``__aiter__`` y ``__anext__``.

source: The following methods exist but are *not* supported as they are either in use by mock, can't be set dynamically, or can cause problems:
es: Los siguientes métodos existen pero *no* están soportados, ya sea porque son usados por el propio objeto simulado, porque no se pueden establecer dinámicamente o porque pueden causar problemas:

source: ``__getattr__``, ``__setattr__``, ``__init__`` and ``__new__``
es: ``__getattr__``, ``__setattr__``, ``__init__`` y ``__new__``

source: ``__prepare__``, ``__instancecheck__``, ``__subclasscheck__``, ``__del__``
es: ``__prepare__``, ``__instancecheck__``, ``__subclasscheck__`` y ``__del__``

source: There are two ``MagicMock`` variants: :class:`MagicMock` and :class:`NonCallableMagicMock`.
es: Hay dos variantes de ``MagicMock``: :class:`MagicMock` y :class:`NonCallableMagicMock`.

source: ``MagicMock`` is a subclass of :class:`Mock` with default implementations of most of the magic methods. You can use ``MagicMock`` without having to configure the magic methods yourself.
es: ``MagicMock`` es una subclase de :class:`Mock` con implementaciones por defecto de la mayoría de los métodos mágicos. Puedes utilizar ``MagicMock`` para crear objetos simulados sin tener que establecer los métodos mágicos por ti mismo.

source: The constructor parameters have the same meaning as for :class:`Mock`.
es: Los parámetros del constructor tienen el mismo significado que en :class:`Mock`.

source: If you use the *spec* or *spec_set* arguments then *only* magic methods that exist in the spec will be created.
es: Si utilizas los argumentos *spec* o *spec_set* entonces *solo* los métodos mágicos que existan en la especificación serán creados.

source: A non-callable version of :class:`MagicMock`.
es: Una versión no invocable de :class:`MagicMock`.

source: The constructor parameters have the same meaning as for :class:`MagicMock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
es: Los parámetros del constructor tienen el mismo significado que en :class:`MagicMock`, con la excepción de *return_value* y *side_effect* que no tienen significado en un objeto simulado no invocable.

source: The magic methods are setup with :class:`MagicMock` objects, so you can configure them and use them in the usual way:
es: Los métodos mágicos están implementados mediante objetos :class:`MagicMock`, por lo que puedes configurarlos y utilizarlos de la forma habitual:

source: By default many of the protocol methods are required to return objects of a specific type. These methods are preconfigured with a default return value, so that they can be used without you having to do anything if you aren't interested in the return value. You can still *set* the return value manually if you want to change the default.
es: Por defecto, muchos de los métodos de protocolo están obligados a retornar objetos de un tipo específico. Estos métodos están preconfigurados con un valor de retorno por defecto, de manera que puedan ser utilizados sin tener que hacer nada más, siempre que no estés interesado en el valor de retorno. En todo caso, puedes *establecer* el valor de retorno de forma manual si deseas cambiar el valor predeterminado.

source: Methods and their defaults:
es: Métodos y sus valores por defecto:

source: ``__hash__``: default hash for the mock
es: ``__hash__``: hash predeterminado del objeto simulado

source: ``__str__``: default str for the mock
es: ``__str__``: str predeterminado del objeto simulado

source: ``__sizeof__``: default sizeof for the mock
es: ``__sizeof__``: sizeof predeterminado del objeto simulado

source: For example:
es: Por ejemplo:

source: The two equality methods, :meth:`__eq__` and :meth:`__ne__`, are special. They do the default equality comparison on identity, using the :attr:`~Mock.side_effect` attribute, unless you change their return value to return something else::
es: Los dos métodos de igualdad, :meth:`__eq__` y :meth:`__ne__`, son especiales. Realizan la comparación de igualdad predeterminada basada en la identidad, utilizando el atributo :attr:`~Mock.side_effect`, a menos que cambies su valor de retorno para que retorne alguna otra cosa:

source: The return value of :meth:`MagicMock.__iter__` can be any iterable object and isn't required to be an iterator:
es: El valor de retorno de :meth:`MagicMock.__iter__` puede ser cualquier objeto iterable, no se requiere que sea un iterador:

source: If the return value *is* an iterator, then iterating over it once will consume it and subsequent iterations will result in an empty list:
es: Si el valor de retorno *es* un iterador, iterar sobre él una vez que se consume, y cualquier iteración posterior, resultará en una lista vacía:

source: ``MagicMock`` has all of the supported magic methods configured except for some of the obscure and obsolete ones. You can still set these up if you want.
es: ``MagicMock`` tiene todos los métodos mágicos soportados configurados a excepción de algunos de los más oscuros y obsoletos. De todas formas, puedes configurar estos también si lo deseas.

source: Magic methods that are supported but not setup by default in ``MagicMock`` are:
es: Los métodos mágicos que son compatibles, pero que no están configurados por defecto en ``MagicMock`` son:
