Repository: python/python-docs-es
Catalog: library/unittest.po
Languages: es

source: The undocumented and unofficial *use_load_tests* parameter has been removed.
es: El parámetro no documentado y no oficial *use_load_tests* ha sido eliminado.

source: Return a suite of all test cases given a string specifier.
es: Retorna un conjunto de todos los casos de test dado un especificador de cadena.

source: The specifier *name* is a "dotted name" that may resolve either to a module, a test case class, a test method within a test case class, a :class:`TestSuite` instance, or a callable object which returns a :class:`TestCase` or :class:`TestSuite` instance. These checks are applied in the order listed here; that is, a method on a possible test case class will be picked up as "a test method within a test case class", rather than "a callable object".
es: El especificador *name* es un "nombre punteado" que puede resolverse ya sea a un módulo, una clase de caso de test, un método de test dentro de una clase de caso de test, una instancia :class:`TestSuite`, o un objeto invocable que devuelve una instancia :class:`TestCase` o :class:`TestSuite`. Estas comprobaciones se aplican en el orden que se indica aquí; es decir, un método en una posible clase de caso de test se recogerá como "un método de test dentro de una clase de caso de test”, en lugar de "un objeto invocable”.

source: For example, if you have a module :mod:`SampleTests` containing a :class:`TestCase`\ -derived class :class:`SampleTestCase` with three test methods (:meth:`test_one`, :meth:`test_two`, and :meth:`test_three`), the specifier ``'SampleTests.SampleTestCase'`` would cause this method to return a suite which will run all three test methods. Using the specifier ``'SampleTests.SampleTestCase.test_two'`` would cause it to return a test suite which will run only the :meth:`test_two` test method. The specifier can refer to modules and packages which have not been imported; they will be imported as a side-effect.
es: Por ejemplo, si tiene un módulo :mod:`SampleTests` que contiene una clase derivada de :class:`TestCase` :class:`SampleTestCase` con tres métodos de test (:meth:`test_one`, :meth:`test_two`, y :meth:`test_three`), el especificador ``SampleTests.SampleTestCase'`` haría que este método devolviera una suite que ejecutara los tres métodos de prueba. El uso del especificador ``SampleTests.SampleTestCase.test_two'`` provocaría que este método devolviera una suite de tests que ejecutaría sólo el método de test :meth:`test_two`. El especificador puede referirse a los módulos y paquetes que no han sido importados; serán importados como un efecto secundario.

source: The method optionally resolves *name* relative to the given *module*.
es: El método opcionalmente resuelve *name* relativo al *module* dado.

source: If an :exc:`ImportError` or :exc:`AttributeError` occurs while traversing *name* then a synthetic test that raises that error when run will be returned. These errors are included in the errors accumulated by self.errors.
es: Si un :exc:`ImportError` o :exc:`AttributeError` ocurre mientras atraviesa *name* entonces se devolverá un test sintético que lanza ese error cuando se ejecuta. Estos errores están incluidos en los errores acumulados por self.errors.

source: Similar to :meth:`loadTestsFromName`, but takes a sequence of names rather than a single name. The return value is a test suite which supports all the tests defined for each name.
es: Similar a :meth:`loadTestsFromName`, pero toma una secuencia de nombres en lugar de un solo nombre. El valor de retorno es una suite de tests que soporta todos los test definidos para cada nombre.

source: Return a sorted sequence of method names found within *testCaseClass*; this should be a subclass of :class:`TestCase`.
es: Devuelve una secuencia ordenada de nombres de métodos encontrados dentro de *testCaseClass*; esta debería ser una subclase de :class:`TestCase`.

source: Find all the test modules by recursing into subdirectories from the specified start directory, and return a TestSuite object containing them. Only test files that match *pattern* will be loaded. (Using shell style pattern matching.) Only module names that are importable (i.e. are valid Python identifiers) will be loaded.
es: Encuentra todos los módulos de prueba recurriendo a subdirectorios del directorio de inicio especificado, y retorna un objeto de TestSuite que los contenga. Sólo se cargarán los archivos de test que coincidan con el *pattern*. (Utilizando la coincidencia de patrones de estilo de shell.) Sólo se cargarán los nombres de los módulos que sean importables (es decir, que sean identificadores Python válidos).

source: All test modules must be importable from the top level of the project. If the start directory is not the top level directory then the top level directory must be specified separately.
es: Todos los módulos de test deben ser importables desde el nivel superior del proyecto. Si el directorio de inicio no es el directorio de nivel superior, entonces el directorio de nivel superior debe ser especificado por separado.

source: If importing a module fails, for example due to a syntax error, then this will be recorded as a single error and discovery will continue. If the import failure is due to :exc:`SkipTest` being raised, it will be recorded as a skip instead of an error.
es: Si la importación de un módulo falla, por ejemplo debido a un error de sintaxis, entonces esto se registrará como un error único y el descubrimiento continuará. Si el fallo en la importación se debe a que :exc:`SkipTest` se ha lanzado, se registrará como un salto en lugar de un error.

source: If a package (a directory containing a file named :file:`__init__.py`) is found, the package will be checked for a ``load_tests`` function. If this exists then it will be called ``package.load_tests(loader, tests, pattern)``. Test discovery takes care to ensure that a package is only checked for tests once during an invocation, even if the load_tests function itself calls ``loader.discover``.
es: Si se encuentra un paquete (un directorio que contiene un archivo llamado :file:`__init__.py`), se comprobará si el paquete tiene una función ``load_tests``. Si existe, entonces se invocará ``package.load_tests(loader, tests, pattern)``. Test discovery se encarga de asegurar que un paquete sólo se comprueba una vez durante una invocación, incluso si la propia función load_tests llama a ``loader.discover``.

source: If ``load_tests`` exists then discovery does *not* recurse into the package, ``load_tests`` is responsible for loading all tests in the package.
es: Si ``load_tests`` existe, entonces el descubrimiento *no* recurre en el paquete, ``load_tests`` es responsable de cargar todos los tests en el paquete.

source: The pattern is deliberately not stored as a loader attribute so that packages can continue discovery themselves. *top_level_dir* is stored so ``load_tests`` does not need to pass this argument in to ``loader.discover()``.
es: El patrón no se almacena deliberadamente como atributo cargador para que los paquetes puedan continuar descubriéndose a sí mismos. *top_level_dir* se almacena de forma que ``load_tests`` no necesita pasar este argumento a ``loader.discover()``.

source: *start_dir* can be a dotted module name as well as a directory.
es: *start_dir* puede ser un nombre de módulo punteado así como un directorio.

source: Modules that raise :exc:`SkipTest` on import are recorded as skips, not errors.
es: Los módulos que lanzan :exc:`SkipTest` en la importación se registran como saltos, no como errores.

source: *start_dir* can be a :term:`namespace packages <namespace package>`.
es: *start_dir* puede ser un :term:`paquete de espacios de nombres <namespace package>`.

source: Paths are sorted before being imported so that execution order is the same even if the underlying file system's ordering is not dependent on file name.
es: Las rutas se ordenan antes de ser importadas para que el orden de ejecución sea el mismo, incluso si el orden del sistema de archivos subyacente no depende del nombre del archivo.

source: Found packages are now checked for ``load_tests`` regardless of whether their path matches *pattern*, because it is impossible for a package name to match the default pattern.
es: Los paquetes encontrados son ahora comprobados para ``load_tests`` sin importar si su ruta coincide con el *pattern*, porque es imposible que el nombre de un paquete coincida con el patrón por defecto.

source: *start_dir* can not be a :term:`namespace packages <namespace package>`. It has been broken since Python 3.7 and Python 3.11 officially remove it.
es: *start_dir* no puede ser un :term:`paquete de espacios de nombres <namespace package>`. Ha estado roto desde Python 3.7 y Python 3.11 lo elimina oficialmente.

source: The following attributes of a :class:`TestLoader` can be configured either by subclassing or assignment on an instance:
es: Los siguientes atributos de un :class:`TestLoader` pueden ser configurados ya sea por subclasificación o asignación en una instancia:

source: String giving the prefix of method names which will be interpreted as test methods. The default value is ``'test'``.
es: Cadena que da el prefijo de los nombres de métodos que serán interpretados como métodos de test. El valor por defecto es ``'test'``.

source: This affects :meth:`getTestCaseNames` and all the :meth:`loadTestsFrom\*` methods.
es: Esto afecta a :meth:`getTestCaseNames` y a todos los métodos :meth:`loadTestsFrom\*` .

source: Function to be used to compare method names when sorting them in :meth:`getTestCaseNames` and all the :meth:`loadTestsFrom\*` methods.
es: Función que se utiliza para comparar los nombres de los métodos al clasificarlos en :meth:`getTestCaseNames` y todos los métodos :meth:`loadTestsFrom\*`.

source: Callable object that constructs a test suite from a list of tests. No methods on the resulting object are needed. The default value is the :class:`TestSuite` class.
es: Objeto invocable que construye un conjunto de pruebas a partir de una lista de pruebas. No se necesitan métodos en el objeto resultante. El valor por defecto es la clase :class:`TestSuite`.

source: This affects all the :meth:`loadTestsFrom\*` methods.
es: Esto afecta a todos los métodos :meth:`loadTestsFrom\*`.

source: List of Unix shell-style wildcard test name patterns that test methods have to match to be included in test suites (see ``-k`` option).
es: Lista de patrones de nombres de test de comodines al estilo del shell de Unix que los métodos de test tienen que coincidir con para ser incluidos en las suites de test (ver opción ``-k``).

source: If this attribute is not ``None`` (the default), all test methods to be included in test suites must match one of the patterns in this list. Note that matches are always performed using :meth:`fnmatch.fnmatchcase`, so unlike patterns passed to the ``-k`` option, simple substring patterns will have to be converted using ``*`` wildcards.
es: Si este atributo no es ``None`` (el predeterminado), todos los métodos de test que se incluyan en los paquetes de test deben coincidir con uno de los patrones de esta lista. Tenga en cuenta que las coincidencias se realizan siempre utilizando :meth:`fnmatch.fnmatchcase`, por lo que a diferencia de los patrones pasados a la opción ``-k``, los patrones de subcadena simple tendrán que ser convertidos utilizando comodines ``*``.

source: This class is used to compile information about which tests have succeeded and which have failed.
es: Esta clase se utiliza para recopilar información sobre qué tests han tenido éxito y cuáles han fracasado.

source: A :class:`TestResult` object stores the results of a set of tests. The :class:`TestCase` and :class:`TestSuite` classes ensure that results are properly recorded; test authors do not need to worry about recording the outcome of tests.
es: Un objeto :class:`TestResult` almacena los resultados de una serie de pruebas. Las clases :class:`TestCase` y :class:`TestSuite` aseguran que los resultados se registren correctamente; los autores de los tests no tienen que preocuparse de registrar el resultado de las mismas.

source: Testing frameworks built on top of :mod:`unittest` may want access to the :class:`TestResult` object generated by running a set of tests for reporting purposes; a :class:`TestResult` instance is returned by the :meth:`TestRunner.run` method for this purpose.
es: Los marcos de pruebas construidos sobre :mod:`unittest` pueden querer acceder al objeto :class:`TestResult` generado por la ejecución de un conjunto de tests con fines de reporte; una instancia :class:`TestResult` es devuelta por el método :meth:`TestRunner.run` para este propósito.

source: :class:`TestResult` instances have the following attributes that will be of interest when inspecting the results of running a set of tests:
es: Las instancias de :class:`TestResult` tienen los siguientes atributos que serán de interés cuando se inspeccionen los resultados de la ejecución de un conjunto de tests:

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test which raised an unexpected exception.
es: Una lista que contiene tuplas de 2 elementos de instancias :class:`TestCase` y cadenas con formato de tracebacks. Cada tupla representa una prueba que lanzó una excepción inesperada.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test where a failure was explicitly signalled using the :meth:`TestCase.assert\*` methods.
es: Una lista que contiene tuplas de 2 elementos de instancias :class:`TestCase` y cadenas con formato de traceback. Cada tupla representa un test en el que un fallo fue explícitamente señalado usando los métodos :meth:`TestCase.assert\*`.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding the reason for skipping the test.
es: Una lista que contiene tuplas de 2 elementos de instancias de :class:`TestCase` y cadenas que contienen la razón para saltarse el test.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents an expected failure or error of the test case.
es: Una lista que contiene tuplas de 2 elementos de instancias :class:`TestCase` y cadenas con formato de traceback. Cada tupla representa un fallo esperado del caso de test.

source: A list containing :class:`TestCase` instances that were marked as expected failures, but succeeded.
es: Una lista que contiene instancias de :class:`TestCase` que fueron marcadas como fracasos esperados, pero tuvieron éxito.

source: A list containing 2-tuples of test case names and floats representing the elapsed time of each test which was run.
es: Una lista que contiene tuplas de 2 elementos con nombres de casos de prueba y números flotantes que representan el tiempo transcurrido de cada prueba que se ejecutó.

source: Set to ``True`` when the execution of tests should stop by :meth:`stop`.
es: Puesto en ``True`` cuando la ejecución de los tests se detenga por :meth:`stop`.

source: The total number of tests run so far.
es: El número total de tests realizados hasta ahora.

source: If set to true, ``sys.stdout`` and ``sys.stderr`` will be buffered in between :meth:`startTest` and :meth:`stopTest` being called. Collected output will only be echoed onto the real ``sys.stdout`` and ``sys.stderr`` if the test fails or errors. Any output is also attached to the failure / error message.
es: Si se ajusta a true, ``sys.stdout`` y ``sys.stderr`` serán almacenados entre :meth:`startTest` y :meth:`stopTest` siendo llamados. La salida recolectada sólo tendrá eco en el verdadero ``sys.stdout`` y ``sys.stderr`` si la prueba falla o se equivoca. Cualquier salida también se adjunta al mensaje de fallo / error.

source: If set to true :meth:`stop` will be called on the first failure or error, halting the test run.
es: Si se ajusta a true :meth:`stop` se llamará al primer fallo o error, deteniendo la ejecución de la prueba.

source: If set to true then local variables will be shown in tracebacks.
es: Si se ajusta a true entonces las variables locales se mostrarán en los tracebacks.

source: Return ``True`` if all tests run so far have passed, otherwise returns ``False``.
es: Devuelve ``True`` si todas las pruebas realizadas hasta ahora han pasado, de lo contrario devuelve ``False``.

source: Returns ``False`` if there were any :attr:`unexpectedSuccesses` from tests marked with the :func:`expectedFailure` decorator.
es: Devuelve ``False`` si hubo algún :attr:`unexpectedSuccesses` de las pruebas marcadas con el decorador :func:`expectedFailure`.

source: This method can be called to signal that the set of tests being run should be aborted by setting the :attr:`shouldStop` attribute to ``True``. :class:`TestRunner` objects should respect this flag and return without running any additional tests.
es: Este método puede ser llamado para señalar que el conjunto de pruebas que se están ejecutando debe ser abortado poniendo el atributo :attr:`shouldStop` en ``True``. :class:`TestRunner` los objetos deben respetar esta bandera y regresar sin ejecutar ninguna prueba adicional.

source: For example, this feature is used by the :class:`TextTestRunner` class to stop the test framework when the user signals an interrupt from the keyboard. Interactive tools which provide :class:`TestRunner` implementations can use this in a similar manner.
es: Por ejemplo, esta característica es utilizada por la clase :class:`TextTestRunner` para detener el marco de pruebas cuando el usuario señala una interrupción desde el teclado. Las herramientas interactivas que proporcionan implementaciones de :class:`TestRunner` pueden usar esto de manera similar.

source: The following methods of the :class:`TestResult` class are used to maintain the internal data structures, and may be extended in subclasses to support additional reporting requirements. This is particularly useful in building tools which support interactive reporting while tests are being run.
es: Los siguientes métodos de la clase :class:`TestResult` se utilizan para mantener las estructuras de datos internos, y pueden ampliarse en subclases para apoyar los requisitos de información adicionales. Esto es particularmente útil para construir herramientas que apoyen la presentación de informes interactivos mientras se ejecutan las pruebas.

source: Called when the test case *test* is about to be run.
es: Llamado cuando el caso de prueba *test* está a punto de ser ejecutado.

source: Called after the test case *test* has been executed, regardless of the outcome.
es: Llamado después de que el caso de prueba *prueba* haya sido ejecutado, independientemente del resultado.

source: Called once before any tests are executed.
es: Llamado una vez antes de que se ejecute cualquier prueba.

source: Called once after all tests are executed.
es: Llamado una vez después de que se ejecuten todas las pruebas.

source: Called when the test case *test* raises an unexpected exception. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
es: Llamado cuando el caso de prueba *test* plantea una excepción inesperada. *err* es una tupla de la forma devuelta por :func:`sys.exc_info`: ``(type, value, traceback)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`errors` attribute, where *formatted_err* is a formatted traceback derived from *err*.
es: La implementación por defecto añade una tupla ``(test, formatted_err)`` al atributo :attr:`errors` de la instancia, donde *formatted_err* es una traza formateada derivada de *err*.

source: Called when the test case *test* signals a failure. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
es: Llamado cuando el caso de prueba *test* señala un fallo. *err* es una tupla de la forma devuelta por :func:`sys.exc_info`: ``(type, value, traceback)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`failures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
es: La implementación por defecto añade una tupla ``(test, formatted_err)`` al atributo :attr:`failures` de la instancia, donde *formatted_err* es una traza formateada derivada de *err*.

source: Called when the test case *test* succeeds.
es: Llamado cuando el caso de prueba *test* tenga éxito.

source: The default implementation does nothing.
es: La implementación por defecto no hace nada.

source: Called when the test case *test* is skipped. *reason* is the reason the test gave for skipping.
es: Llamado cuando se salta el caso de prueba *test*. *reason* es la razón que la prueba dio para saltarse.

source: The default implementation appends a tuple ``(test, reason)`` to the instance's :attr:`skipped` attribute.
es: La implementación por defecto añade una tupla ``(test, reason)`` al atributo :attr:`skipped` de la instancia.

source: Called when the test case *test* fails or errors, but was marked with the :func:`expectedFailure` decorator.
es: Llamó cuando el caso de prueba *test* falla, pero fue marcado con el decorador :func:`expectedFailure`.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`expectedFailures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
es: La implementación por defecto añade una tupla ``(test, formatted_err)`` al atributo :attr:`expectedFailures` de la instancia, donde *formatted_err* es una traza formateada derivada de *err*.

source: Called when the test case *test* was marked with the :func:`expectedFailure` decorator, but succeeded.
es: Llamó cuando el caso de prueba *test* se marcó con el decorador :func:`expectedFailure`, pero tuvo éxito.

source: The default implementation appends the test to the instance's :attr:`unexpectedSuccesses` attribute.
es: La implementación por defecto añade la prueba al atributo :attr:`unexpectedSuccesses` de la instancia.

source: Called when a subtest finishes. *test* is the test case corresponding to the test method. *subtest* is a custom :class:`TestCase` instance describing the subtest.
es: Llamado cuando termina una subtest. *test* es el caso de prueba correspondiente al método de test. *subtest* es una instancia personalizada :class:`TestCase` que describe el test.

source: If *outcome* is :const:`None`, the subtest succeeded. Otherwise, it failed with an exception where *outcome* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
es: Si *outcome* es :const:`None`, el subtest tuvo éxito. De lo contrario, falló con una excepción en la que *outcome* es una tupla de la forma devuelta por :func:`sys.exc_info`: ``(type, value, traceback)``.

source: The default implementation does nothing when the outcome is a success, and records subtest failures as normal failures.
es: La implementación por defecto no hace nada cuando el resultado es un éxito, y registra los fallos del subtest como fallos normales.

source: Called when the test case finishes. *elapsed* is the time represented in seconds, and it includes the execution of cleanup functions.
es: Llamado cuando el caso de prueba finaliza. *elapsed* es el tiempo representado en segundos e incluye la ejecución de funciones de limpieza.

source: A concrete implementation of :class:`TestResult` used by the :class:`TextTestRunner`. Subclasses should accept ``**kwargs`` to ensure compatibility as the interface changes.
es: Una implementación concreta de :class:`TestResult` utilizada por el :class:`TextTestRunner`. Las subclases deberían aceptar ``**kwargs`` para garantizar la compatibilidad a medida que cambia la interfaz.
