Repository: python/python-docs-es
Catalog: library/urllib.request.po
Languages: es

source: The data returned by :func:`urlopen` or :func:`urlretrieve` is the raw data returned by the server. This may be binary data (such as an image), plain text or (for example) HTML. The HTTP protocol provides type information in the reply header, which can be inspected by looking at the :mailheader:`Content-Type` header. If the returned data is HTML, you can use the module :mod:`html.parser` to parse it.
es: Los datos retornados por :func:`urlopen` o :func:`urlretrieve` son los datos en crudo retornados por el servidor. Estos pueden ser datos binarios (como una imagen), texto plano o (por ejemplo) HTML. El protocolo HTTP provee información de tipo en el encabezado de respuesta, el cual puede ser inspeccionado mirando el encabezado :mailheader:`Content-Type`. Si los datos retornados son HTML, puedes usar el módulo :mod:`html.parser` para analizarlos.

source: The code handling the FTP protocol cannot differentiate between a file and a directory. This can lead to unexpected behavior when attempting to read a URL that points to a file that is not accessible. If the URL ends in a ``/``, it is assumed to refer to a directory and will be handled accordingly. But if an attempt to read a file leads to a 550 error (meaning the URL cannot be found or is not accessible, often for permission reasons), then the path is treated as a directory in order to handle the case when a directory is specified by a URL but the trailing ``/`` has been left off. This can cause misleading results when you try to fetch a file whose read permissions make it inaccessible; the FTP code will try to read it, fail with a 550 error, and then perform a directory listing for the unreadable file. If fine-grained control is needed, consider using the :mod:`ftplib` module, subclassing :class:`FancyURLopener`, or changing *_urlopener* to meet your needs.
es: El código que maneja el protocolo FTP no puede diferenciar entre un archivo y un directorio. Esto puede llevar a un comportamiento inesperado cuando se intenta leer una URL que apunta a un archivo que no es accesible. Si la URL termina en un ``/``, se asume que se refiere a un directorio y será manejada acordemente. Pero si un intento de leer un archivo lleva a un error 550 (lo que significa que la URL no puede ser encontrada o no es accesible, a menudo por razones de permisos), entonces se trata la ruta como un directorio para manejar el caso cuando un directorio es especificado por una URL pero el ``/`` trasero ha sido dejado fuera. Esto puede causar resultados erróneos cuando intenta obtener un archivo cuyos permisos de lectura lo hacen inaccesible; el código FTP intentará leerlo, fallará con un error 550 y entonces realizará un listado de directorio para el archivo ilegible. Si se necesita un control más detallado, considere usar el módulo :mod:`ftplib`, heredando :class:`FancyURLopener` o cambiando *_urlopener* para ajustarlo a tus necesidades.

source: :mod:`urllib.response` --- Response classes used by urllib
es: :mod:`urllib.response` --- Clases de respuesta usadas por urllib

source: The :mod:`urllib.response` module defines functions and classes which define a minimal file-like interface, including ``read()`` and ``readline()``. Functions defined by this module are used internally by the :mod:`urllib.request` module. The typical response object is a :class:`urllib.response.addinfourl` instance:
es: El módulo :mod:`urllib.response` define funciones y clases que definen una interfaz mínima *file-like*, incluyendo ``read()`` y ``readline()``. Las funciones definidas en este módulo son usadas internamente por el módulo :mod:`urllib.request`. El objeto de respuesta típico es una instancia de :class:`urllib.response.addinfourl`:

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
es: :URL del recurso obtenido, comúnmente usado para determinar si se ha seguido una redirección.

source: Returns the headers of the response in the form of an :class:`~email.message.EmailMessage` instance.
es: Retorna las cabeceras de la respuesta en la forma de una instancia de :class:`~email.message.EmailMessage`.

source: Status code returned by server.
es: Código de estado retornado por el servidor.

source: Deprecated in favor of :attr:`~addinfourl.url`.
es: Obsoleto en favor de :attr:`~addinfourl.url`.

source: Deprecated in favor of :attr:`~addinfourl.headers`.
es: Obsoleto en favor de :attr:`~addinfourl.headers`.

source: Deprecated in favor of :attr:`~addinfourl.status`.
es: Obsoleto en favor de :attr:`~addinfourl.status`.
