Repository: python/python-docs-es
Catalog: library/urllib.request.po
Languages: es

source: In addition to the examples below, more examples are given in :ref:`urllib-howto`.
es: Adicionalmente a los ejemplos siguientes, se dan más ejemplos en :ref:`urllib-howto`.

source: This example gets the python.org main page and displays the first 300 bytes of it. ::
es: Este ejemplo obtiene la página principal python.org y despliega los primeros 300 bytes de ella. ::

source: Note that urlopen returns a bytes object. This is because there is no way for urlopen to automatically determine the encoding of the byte stream it receives from the HTTP server. In general, a program will decode the returned bytes object to string once it determines or guesses the appropriate encoding.
es: Tenga en cuenta que urlopen retorna un objeto de bytes. Esto es porque no hay forma para urlopen de determinar automáticamente la codificación del flujo de bytes que recibe del servidor HTTP. En general, un programa decodificará el objeto de bytes retornado a cadena de caracteres una vez que determine o adivine la codificación apropiada.

source: The following W3C document, https://www.w3.org/International/O-charset\ , lists the various ways in which an (X)HTML or an XML document could have specified its encoding information.
es: El siguiente documento W3C, https://www.w3.org/International/O-charset\ , lista las diferentes formas en la cual un documento (X)HTML o XML podría haber especificado su información de codificación.

source: As the python.org website uses *utf-8* encoding as specified in its meta tag, we will use the same for decoding the bytes object. ::
es: Ya que el sitio web python.org usa codificación *utf-8* tal y como se especifica en su etiqueta meta, usaremos la misma para decodificar el objeto de bytes. ::

source: It is also possible to achieve the same result without using the :term:`context manager` approach. ::
es: Es posible conseguir el mismo resultado sin usar la aproximación :term:`context manager`. ::

source: In the following example, we are sending a data-stream to the stdin of a CGI and reading the data it returns to us. Note that this example will only work when the Python installation supports SSL. ::
es: En el siguiente ejemplo, estamos enviando un flujo de datos a la entrada estándar de un CGI y leyendo los datos que nos retorna. Tenga en cuenta que este ejemplo sólo funcionará cuando la instalación de Python soporte SSL. ::

source: The code for the sample CGI used in the above example is::
es: El código para el CGI de muestra usado en el ejemplo anterior es::

source: Here is an example of doing a ``PUT`` request using :class:`Request`::
es: Aquí hay un ejemplo de realizar una petición ``PUT`` usando :class:`Request`::

source: Use of Basic HTTP Authentication::
es: Uso de Autenticación HTTP Básica::

source: :func:`build_opener` provides many handlers by default, including a :class:`ProxyHandler`. By default, :class:`ProxyHandler` uses the environment variables named ``<scheme>_proxy``, where ``<scheme>`` is the URL scheme involved. For example, the :envvar:`http_proxy` environment variable is read to obtain the HTTP proxy's URL.
es: :func:`build_opener` proporciona muchos manejadores por defecto, incluyendo un :class:`ProxyHandler`. De forma predeterminada, :class:`ProxyHandler` usa las variables de entorno llamadas ``<scheme>_proxy``, donde ``<scheme>`` es el esquema URL involucrado. Por ejemplo, se lee la variable de entorno :envvar:`http_proxy` para obtener la URL del proxy HTTP.

source: This example replaces the default :class:`ProxyHandler` with one that uses programmatically supplied proxy URLs, and adds proxy authorization support with :class:`ProxyBasicAuthHandler`. ::
es: Este ejemplo reemplaza el :class:`ProxyHandler` predeterminado por uno que usa URLs de proxy suministradas mediante programación y añade soporte de autorización de proxy con :class:`ProxyBasicAuthHandler`. ::

source: Adding HTTP headers:
es: Añadiendo encabezados HTTP:

source: Use the *headers* argument to the :class:`Request` constructor, or::
es: Usa el argumento *headers* en el constructor de :class:`Request`, o::

source: :class:`OpenerDirector` automatically adds a :mailheader:`User-Agent` header to every :class:`Request`. To change this::
es: :class:`OpenerDirector` añade automáticamente un encabezado :mailheader:`User-Agent` a cada :class:`Request`. Para cambiar esto::

source: Also, remember that a few standard headers (:mailheader:`Content-Length`, :mailheader:`Content-Type` and :mailheader:`Host`) are added when the :class:`Request` is passed to :func:`urlopen` (or :meth:`OpenerDirector.open`).
es: También, recuerda que algunos encabezados estándar (:mailheader:`Content-Length`, :mailheader:`Content-Type` y :mailheader:`Host`) son añadidos cuando se pasa :class:`Request` a :func:`urlopen` (o :meth:`OpenerDirector.open`).

source: Here is an example session that uses the ``GET`` method to retrieve a URL containing parameters::
es: Aquí hay un ejemplo de sesión que usa el método ``GET`` para obtener una URL que contiene los parámetros::

source: The following example uses the ``POST`` method instead. Note that params output from urlencode is encoded to bytes before it is sent to urlopen as data::
es: El siguiente ejemplo usa el método POST en su lugar. Tenga en cuenta que la salida de parámetros desde urlencode es codificada a bytes antes de ser enviados a urlopen como datos::

source: The following example uses an explicitly specified HTTP proxy, overriding environment settings::
es: El siguiente ejemplo usa un proxy HTTP especificado, sobrescribiendo las configuraciones de entorno::

source: The following example uses no proxies at all, overriding environment settings::
es: El siguiente ejemplo no usa proxies, sobrescribiendo las variables de entorno::

source: Legacy interface
es: Interfaz heredada

source: The following functions and classes are ported from the Python 2 module ``urllib`` (as opposed to ``urllib2``). They might become deprecated at some point in the future.
es: Las siguientes funciones y clases están portadas desde el módulo ``urllib`` de Python 2 (en oposición a ``urllib2``). Ellas pueden estar obsoletas en algún punto del futuro.

source: Copy a network object denoted by a URL to a local file. If the URL points to a local file, the object will not be copied unless filename is supplied. Return a tuple ``(filename, headers)`` where *filename* is the local file name under which the object can be found, and *headers* is whatever the :meth:`info` method of the object returned by :func:`urlopen` returned (for a remote object). Exceptions are the same as for :func:`urlopen`.
es: Copia un objeto de red denotado por una URL a un archivo local. Si la URL apunta a un archivo local, el objeto no será copiado a no ser que sea suministrado un nombre de archivo. Retorna una tupla ``(filename, headers)`` donde *filename* es el nombre de archivo local bajo el cual el objeto puede ser encontrado y *headers* es lo que retorna el método :meth:`info` retornado por :func:`urlopen` (para un objeto remoto). Las excepciones son las mismas que para :func:`urlopen`.

source: The second argument, if present, specifies the file location to copy to (if absent, the location will be a tempfile with a generated name). The third argument, if present, is a callable that will be called once on establishment of the network connection and once after each block read thereafter. The callable will be passed three arguments; a count of blocks transferred so far, a block size in bytes, and the total size of the file. The third argument may be ``-1`` on older FTP servers which do not return a file size in response to a retrieval request.
es: El segundo argumento, si está presente, especifica la localización a la que será copiada el objeto (si está ausente, la localización será un archivo temporal con un nombre generado). El tercer argumento, si está presente, es un objeto invocable que será invocado una vez que se establezca la conexión de red y después de eso una vez después de cada lectura de bloque. Al invocable se le pasarán tres argumentos; una cuenta de los bloques transferidos hasta el momento, un tamaño de bloque en bytes y el tamaño total del archivo. El tercer argumento puede ser ``-1`` en servidores FTP antiguos los cuales no retornan un tamaño de archivo en respuesta a una solicitud de recuperación.

source: The following example illustrates the most common usage scenario::
es: El siguiente ejemplo ilustra el escenario de uso más común::

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must be a bytes object in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
es: Si la *url* usa el esquema de identificador :file:`http:`, el argumento opcional *data* puede ser dado para especificar una petición ``POST`` (normalmente el tipo de petición es ``GET``). El argumento *data* debe ser un objeto de bytes en formato :mimetype:`application/x-www-form-urlencoded`; vea la función :func:`urllib.parse.urlencode`.

source: :func:`urlretrieve` will raise :exc:`ContentTooShortError` when it detects that the amount of data available was less than the expected amount (which is the size reported by a *Content-Length* header). This can occur, for example, when the download is interrupted.
es: :func:`urlretrieve` lanzará :exc:`ContentTooShortError` cuando detecte que la cantidad de datos disponibles sea menor que la cantidad esperada (la cual es el tamaño reportado por un encabezado *Content-Length*). Esto puede ocurrir, por ejemplo, cuando se interrumpe la descarga.

source: The *Content-Length* is treated as a lower bound: if there's more data to read, urlretrieve reads more data, but if less data is available, it raises the exception.
es: El *Content-Length* es tratado como un límite inferior: si no hay más datos a leer, urlretrieve lee más datos, pero si están disponibles menos datos, se genera la excepción.

source: You can still retrieve the downloaded data in this case, it is stored in the :attr:`content` attribute of the exception instance.
es: Puedes seguir obteniendo los datos descargados en este caso, son almacenados en el atributo :attr:`content` de la instancia de la excepción.

source: If no *Content-Length* header was supplied, urlretrieve can not check the size of the data it has downloaded, and just returns it. In this case you just have to assume that the download was successful.
es: Si no fue proporcionado el encabezado *Content-Length*, urlretrieve no puede comprobar el tamaño de los datos que han sido descargados, y sólo los retorna. En este caso sólo tienes que asumir que la descarga fue exitosa.

source: Cleans up temporary files that may have been left behind by previous calls to :func:`urlretrieve`.
es: Limpia archivos temporales que pueden haber quedado tras llamadas anteriores a :func:`urlretrieve`.

source: Base class for opening and reading URLs. Unless you need to support opening objects using schemes other than :file:`http:`, :file:`ftp:`, or :file:`file:`, you probably want to use :class:`FancyURLopener`.
es: Clase base para apertura y lectura de URLs. A no ser que necesites soporte de apertura de objetos usando esquemas diferentes a :file:`http:`, :file:`ftp:` o :file:`file:`, probablemente quieras usar :class:`FancyURLopener`.

source: By default, the :class:`URLopener` class sends a :mailheader:`User-Agent` header of ``urllib/VVV``, where *VVV* is the :mod:`urllib` version number. Applications can define their own :mailheader:`User-Agent` header by subclassing :class:`URLopener` or :class:`FancyURLopener` and setting the class attribute :attr:`version` to an appropriate string value in the subclass definition.
es: Por defecto, la clase :class:`URLopener` envía un encabezado :mailheader:`User-Agent` de ``urllib/VVV``, donde *VVV* es el número de versión :mod:`urllib`. Las aplicaciones pueden definir su propio encabezado :mailheader:`User-Agent` heredando de :class:`URLopener` o :class:`FancyURLopener` y estableciendo el atributo de clase :attr:`version` a un valor de cadena de caracteres apropiado en la definición de la subclase.

source: The optional *proxies* parameter should be a dictionary mapping scheme names to proxy URLs, where an empty dictionary turns proxies off completely. Its default value is ``None``, in which case environmental proxy settings will be used if present, as discussed in the definition of :func:`urlopen`, above.
es: El parámetro opcional *proxies* debe ser un diccionario mapeando nombres de esquemas a URLs de proxy, donde un diccionario vacío apaga los proxies completamente. Su valor predeterminado es ``None``, en cuyo caso las configuraciones de proxy del entorno serán usadas si están presentes, como ha sido discutido en la definición de :func:`urlopen`, arriba.

source: Additional keyword parameters, collected in *x509*, may be used for authentication of the client when using the :file:`https:` scheme. The keywords *key_file* and *cert_file* are supported to provide an SSL key and certificate; both are needed to support client authentication.
es: Parámetros adicionales de palabra clave, recogidos en *x509*, pueden ser usados por autenticación del cliente cuando usan el esquema :file:`https:`. Las palabras claves *key_file* y *cert_file* están soportadas para proveer una clave y certificado SSL; ambos son necesarias para soportar autenticación de cliente.

source: :class:`URLopener` objects will raise an :exc:`OSError` exception if the server returns an error code.
es: Los objetos :class:`URLopener` lanzarán una excepción :exc:`OSError` si el servidor retorna un código de error.

source: Open *fullurl* using the appropriate protocol. This method sets up cache and proxy information, then calls the appropriate open method with its input arguments. If the scheme is not recognized, :meth:`open_unknown` is called. The *data* argument has the same meaning as the *data* argument of :func:`urlopen`.
es: Abre *fullurl* usando el protocolo apropiado. Este método configura la información de caché e información de proxy, entonces invoca el método apropiado con sus argumentos de entrada. Si el esquema no está reconocido, se invoca :meth:`open_unknown`. El argumento *data* tiene el mismo significado que el argumento *data* de :func:`urlopen`.

source: This method always quotes *fullurl* using :func:`~urllib.parse.quote`.
es: Este método siempre entrecomilla *fullurl* usando :func:`~urllib.parse.quote`.

source: Overridable interface to open unknown URL types.
es: Interfaz sobrescribible para abrir tipos de URL desconocidos.

source: Retrieves the contents of *url* and places it in *filename*. The return value is a tuple consisting of a local filename and either an :class:`email.message.Message` object containing the response headers (for remote URLs) or ``None`` (for local URLs). The caller must then open and read the contents of *filename*. If *filename* is not given and the URL refers to a local file, the input filename is returned. If the URL is non-local and *filename* is not given, the filename is the output of :func:`tempfile.mktemp` with a suffix that matches the suffix of the last path component of the input URL. If *reporthook* is given, it must be a function accepting three numeric parameters: A chunk number, the maximum size chunks are read in and the total size of the download (-1 if unknown). It will be called once at the start and after each chunk of data is read from the network. *reporthook* is ignored for local URLs.
es: Obtiene el contenido de *url* y lo coloca en *filename*. El valor retornado es una tupla que consiste de un nombre de archivo local y un objeto :class:`email.message.Message` conteniendo los encabezados de respuesta (para URLs remotas) o ``None`` (para URLs locales). El invocador debe entonces abrir y leer los contenidos de *filename*. Si *filename* no está dado y la URL refiere a un archivo local, se retorna el nombre de archivo de entrada. Si la URL no es local y no se da *filename*, el nombre de archivo es la salida de la función :func:`tempfile.mktemp` con un sufijo que concuerda con el sufijo del último componente de la ruta de la URL de entrada. Si se da *reporthook*, debe ser una función que acepte tres parámetros numéricos: Un número de fragmento, se leen los fragmentos de tamaño máximo y el tamaño total de la descarga (-1 si es desconocida). Será invocada una vez al comienzo y después de que cada fragmento de datos sea leído de la red. *reporthook* es ignorado para URLs locales.

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
es: Si la *url* usa el identificador de esquema :file:`http:`, el argumento opcional *data* puede ser dado para especificar una petición ``POST`` (normalmente el tipo de petición es ``GET``). El argumento *data* debe estar en formato estándar :mimetype:`application/x-www-form-urlencoded`; vea la función :func:`urllib.parse.urlencode`.

source: Variable that specifies the user agent of the opener object. To get :mod:`urllib` to tell servers that it is a particular user agent, set this in a subclass as a class variable or in the constructor before calling the base constructor.
es: Variable que especifica el agente de usuario del objeto abridor. Para obtener :mod:`urllib` para decir a los servidores que es un agente de usuario particular, establece esto en una subclase como una variable de clase o en el constructor antes de invocar el constructor base.

source: :class:`FancyURLopener` subclasses :class:`URLopener` providing default handling for the following HTTP response codes: 301, 302, 303, 307 and 401. For the 30x response codes listed above, the :mailheader:`Location` header is used to fetch the actual URL. For 401 response codes (authentication required), basic HTTP authentication is performed. For the 30x response codes, recursion is bounded by the value of the *maxtries* attribute, which defaults to 10.
es: :class:`FancyURLopener` hereda de :class:`URLopener` proveyendo manejo predeterminado para los siguientes códigos de respuesta HTTP: 301, 302, 303, 307 y 401. Para los códigos de respuesta 30x listados anteriormente, se usa el encabezado :mailheader:`Location` para obtener la URL actual. Para códigos de respuesta 401 (autenticación requerida), se realiza autenticación HTTP. Para los códigos de respuesta 30x, la recursión está limitada por el valor del atributo *maxentries*, el cual por defecto es 10.

source: For all other response codes, the method :meth:`http_error_default` is called which you can override in subclasses to handle the error appropriately.
es: Para todos los demás códigos de respuesta, se invoca al método :meth:`http_error_default`, que puede sobrescribir en subclases para manejar el error de manera adecuada.

source: According to the letter of :rfc:`2616`, 301 and 302 responses to POST requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a GET, and :mod:`urllib` reproduces this behaviour.
es: De acuerdo a la carta de :rfc:`2616`, las respuestas a las peticiones POST 301 y 302 no debe ser redireccionadas automáticamente sin confirmación por el usuario. En realidad, los navegadores permiten redirección automática de esas respuestas, cambiando de POST a GET, y :mod:`urllib` reproduce este comportamiento.

source: The parameters to the constructor are the same as those for :class:`URLopener`.
es: Los parámetros del constructor son el mismo que aquellos para :class:`URLopener`.

source: When performing basic authentication, a :class:`FancyURLopener` instance calls its :meth:`prompt_user_passwd` method. The default implementation asks the users for the required information on the controlling terminal. A subclass may override this method to support more appropriate behavior if needed.
es: Cuando se realiza autenticación básica, una instancia :class:`FancyURLopener` invoca a su método :meth:`prompt_user_passwd`. La implementación predeterminada pregunta a los usuarios la información requerida en la terminal de control. Una subclase puede sobrescribir este método para soportar un comportamiento más apropiado si se necesita.

source: The :class:`FancyURLopener` class offers one additional method that should be overloaded to provide the appropriate behavior:
es: La clase :class:`FancyURLopener` ofrece un método adicional que debe ser sobrecargado para proveer el comportamiento apropiado:

source: Return information needed to authenticate the user at the given host in the specified security realm. The return value should be a tuple, ``(user, password)``, which can be used for basic authentication.
es: Retorna la información necesaria para autenticar el usuario en el host dado en el reino de seguridad especificado. El valor retornado debe ser una tupla ``(user, password)``, la cual puede ser usada para autenticación básica.

source: The implementation prompts for this information on the terminal; an application should override this method to use an appropriate interaction model in the local environment.
es: La implementación solicita esta información en el terminal; una aplicación debe sobrescribir este método para usar un modelo de interacción apropiado en el entorno local.

source: :mod:`urllib.request` Restrictions
es: Restricciones :mod:`urllib.request`

source: Currently, only the following protocols are supported: HTTP (versions 0.9 and 1.0), FTP, local files, and data URLs.
es: Actualmente, sólo uno de los siguientes protocolo están soportados: HTTP (versiones 0.9 y 1.0), FTP, archivos locales y URLs de datos.

source: Added support for data URLs.
es: Añadido soporte para URLs de datos.

source: The caching feature of :func:`urlretrieve` has been disabled until someone finds the time to hack proper processing of Expiration time headers.
es: La característica de caché de :func:`urlretrieve` ha sido deshabilitada hasta que alguien encuentre el tiempo para hackear el procesamiento adecuado de los encabezados de tiempo de Expiración.

source: There should be a function to query whether a particular URL is in the cache.
es: Debería haber una función para consultar si una URL en particular está en la caché.

source: For backward compatibility, if a URL appears to point to a local file but the file can't be opened, the URL is re-interpreted using the FTP protocol. This can sometimes cause confusing error messages.
es: Para compatibilidad con versiones anteriores, si una URL parece apuntar a un archivo local pero el archivo no puede ser abierto, la URL es reinterpretada usando el protocolo FTP. Esto a veces puede causar mensajes de error confusos.

source: The :func:`urlopen` and :func:`urlretrieve` functions can cause arbitrarily long delays while waiting for a network connection to be set up. This means that it is difficult to build an interactive web client using these functions without using threads.
es: Las funciones :func:`urlopen` y :func:`urlretrieve` pueden causar retrasos arbitrariamente largos mientras esperan a que se configure una conexión de red. Esto significa que es difícil construir un cliente Web interactivo usando estas funciones sin utilizar hilos.
