Repository: python/python-docs-es
Catalog: library/urllib.error.po
Languages: es

source: :mod:`urllib.error` --- Exception classes raised by urllib.request
es: :mod:`urllib.error` --- Clases de excepción lanzadas por urllib.request

source: **Source code:** :source:`Lib/urllib/error.py`
es: **Código fuente:** :source:`Lib/urllib/error.py`

source: The :mod:`urllib.error` module defines the exception classes for exceptions raised by :mod:`urllib.request`. The base exception class is :exc:`URLError`.
es: El módulo :mod:`urllib.error` define las clases de excepción para las excepciones lanzadas por :mod:`urllib.request`. La clase de excepción base es :exc:`URLError`.

source: The following exceptions are raised by :mod:`urllib.error` as appropriate:
es: Las siguientes excepciones son lanzadas por :mod:`urllib.error` según sea apropiado:

source: The handlers raise this exception (or derived exceptions) when they run into a problem. It is a subclass of :exc:`OSError`.
es: Los gestores lanzan esta excepción (o excepciones derivadas) cuando encuentran un problema. Es una subclase de :exc:`OSError`.

source: The reason for this error. It can be a message string or another exception instance.
es: El motivo de este error. Puede ser una cadena de mensaje u otra instancia de una excepción.

source: :exc:`URLError` has been made a subclass of :exc:`OSError` instead of :exc:`IOError`.
es: Se ha convertido a :exc:`URLError` en una subclase de :exc:`OSError` en lugar de :exc:`IOError`.

source: Though being an exception (a subclass of :exc:`URLError`), an :exc:`HTTPError` can also function as a non-exceptional file-like return value (the same thing that :func:`~urllib.request.urlopen` returns). This is useful when handling exotic HTTP errors, such as requests for authentication.
es: A pesar de ser una excepción (una subclase de :exc:`URLError`), un :exc:`HTTPError` también puede funcionar como un valor de retorno no excepcional de tipo archivo (lo mismo que retorna :func:`~urllib.request.urlopen`). Esto es útil para gestionar errores HTTP exóticos, como peticiones de autentificación.

source: Contains the request URL. An alias for *filename* attribute.
es: Contiene la URL de la solicitud. Un alias para el atributo *filename*.

source: An HTTP status code as defined in :rfc:`2616`. This numeric value corresponds to a value found in the dictionary of codes as found in :attr:`http.server.BaseHTTPRequestHandler.responses`.
es: Un código de estado HTTP como los definidos en :rfc:`2616`. Este valor numérico se corresponde con un valor de un diccionario de códigos como el que hay en :attr:`http.server.BaseHTTPRequestHandler.responses`.

source: This is usually a string explaining the reason for this error. An alias for *msg* attribute.
es: Normalmente esto es una cadena de caracteres que explica el motivo de este error. Un alias para el atributo *msg*.

source: The HTTP response headers for the HTTP request that caused the :exc:`HTTPError`. An alias for *hdrs* attribute.
es: Las cabeceras de la respuesta HTTP de la petición HTTP que causó el :exc:`HTTPError`. Un alias para el atributo *hdrs*.

source: A file-like object where the HTTP error body can be read from.
es: Un objeto similar a un archivo donde se puede leer el cuerpo del error HTTP.

source: This exception is raised when the :func:`~urllib.request.urlretrieve` function detects that the amount of the downloaded data is less than the expected amount (given by the *Content-Length* header).
es: Esta excepción se lanza cuando la función :func:`~urllib.request.urlretrieve` detecta que la cantidad de datos descargados es menor que la esperada (dada por la cabecera *Content-Length*).

source: The downloaded (and supposedly truncated) data.
es: Los datos descargados (y supuestamente truncados).
