Repository: python/python-docs-es
Catalog: library/urllib.request.po
Languages: es

source: :mod:`urllib.request` --- Extensible library for opening URLs
es: :mod:`urllib.request` --- Biblioteca extensible para abrir URLs

source: **Source code:** :source:`Lib/urllib/request.py`
es: **Código fuente:** :source:`Lib/urllib/request.py`

source: The :mod:`urllib.request` module defines functions and classes which help in opening URLs (mostly HTTP) in a complex world --- basic and digest authentication, redirections, cookies and more.
es: El módulo :mod:`urllib.request` define funciones y clases que ayudan en la apertura de URLs (la mayoría HTTP) en un mundo complejo --- autenticación básica y digest, redirecciones, cookies y más.

source: The `Requests package <https://requests.readthedocs.io/en/master/>`_ is recommended for a higher-level HTTP client interface.
es: Se recomienda el `paquete Requests <https://requests.readthedocs.io/en/master/>`_ para una interfaz de cliente HTTP de mayor nivel.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
es: :ref:`Disponibilidad <availability>`: no Emscripten, no WASI.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
es: Este módulo no funciona o no está disponible en las plataformas WebAssembly ``wasm32-emscripten`` y ``wasm32-wasi``. Consulte :ref:`wasm-availability` para obtener más información.

source: The :mod:`urllib.request` module defines the following functions:
es: El módulo :mod:`urllib.request` define las siguientes funciones:

source: Open *url*, which can be either a string containing a valid, properly encoded URL, or a :class:`Request` object.
es: Abre la *url*, la cual puede ser una cadena de texto que contenga una URL válida y correctamente codificada, o un objeto :class:`Request`.

source: *data* must be an object specifying additional data to be sent to the server, or ``None`` if no such data is needed. See :class:`Request` for details.
es: *data* debe ser un objeto que especifique datos adicionales a ser enviados al servidor o ``None`` si no se necesitan tales datos. Vea :class:`Request` para más detalles.

source: urllib.request module uses HTTP/1.1 and includes ``Connection:close`` header in its HTTP requests.
es: El módulo urllib.request usa HTTP/1.1 e incluye el encabezado ``Connection:close`` en sus peticiones HTTP.

source: The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). This actually only works for HTTP, HTTPS and FTP connections.
es: El parámetro opcional *timeout* especifica un tiempo de expiración en segundos para operaciones bloqueantes como el intento de conexión (si no se especifica, será usado el tiempo de expiración global predeterminado). Esto actualmente sólo funciona para conexiones HTTP, HTTPS y FTP.

source: If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options. See :class:`~http.client.HTTPSConnection` for more details.
es: Si se especifica *context*, debe ser una instancia :class:`ssl.SSLContext` describiendo las diferentes opciones SSL. Vea :class:`~http.client.HTTPSConnection` para más detalles.

source: The optional *cafile* and *capath* parameters specify a set of trusted CA certificates for HTTPS requests. *cafile* should point to a single file containing a bundle of CA certificates, whereas *capath* should point to a directory of hashed certificate files. More information can be found in :meth:`ssl.SSLContext.load_verify_locations`.
es: Los parámetros opcionales *cafile* y *capath* especifican un conjunto de certificados CA de confianza para peticiones HTTPS. *cafile* debe apuntar a un único archivo que contenga un paquete de certificados CA, mientras *capath* debe apuntar a un directorio de archivos de certificado hash. Se puede encontrar más información en :meth:`ssl.SSLContext.load_verify_locations`.

source: The *cadefault* parameter is ignored.
es: Se ignora el parámetro *cadefault*.

source: This function always returns an object which can work as a :term:`context manager` and has the properties *url*, *headers*, and *status*. See :class:`urllib.response.addinfourl` for more detail on these properties.
es: Esta función siempre retorna un objeto que puede actuar como un :term:`gestor de contexto <context manager>`, y tiene las propiedades *url*, *headers* y *status*. Véase :class:`urllib.response.addinfourl` para más detalles sobre estas propiedades.

source: For HTTP and HTTPS URLs, this function returns a :class:`http.client.HTTPResponse` object slightly modified. In addition to the three new methods above, the msg attribute contains the same information as the :attr:`~http.client.HTTPResponse.reason` attribute --- the reason phrase returned by server --- instead of the response headers as it is specified in the documentation for :class:`~http.client.HTTPResponse`.
es: Para URLs HTTP y HTTPS, esta función retorna un objeto :class:`http.client.HTTPResponse` ligeramente modificado. Adicionalmente a los tres nuevos métodos anteriores, el atributo msg contiene la misma información que el atributo :attr:`~http.client.HTTPResponse.reason` --- la frase de motivo devuelta por el servidor --- en lugar de los encabezados de la respuesta como se especifica en la documentación para :class:`~http.client.HTTPResponse`.

source: For FTP, file, and data URLs and requests explicitly handled by legacy :class:`URLopener` and :class:`FancyURLopener` classes, this function returns a :class:`urllib.response.addinfourl` object.
es: Para URLs FTP, de archivo y de datos y para peticiones manejadas explícitamente por las clases heredadas :class:`URLopener` y :class:`FancyURLopener`, esta función retorna un objeto :class:`urllib.response.addinfourl`.

source: Raises :exc:`~urllib.error.URLError` on protocol errors.
es: Genera :exc:`~urllib.error.URLError` en errores de protocolo.

source: Note that ``None`` may be returned if no handler handles the request (though the default installed global :class:`OpenerDirector` uses :class:`UnknownHandler` to ensure this never happens).
es: Tenga en cuenta que ``None`` puede ser retornado si ningún manejador gestiona la petición (aunque el :class:`OpenerDirector` global instalado de manera predeterminada usa :class:`UnknownHandler` para asegurar que esto nunca suceda).

source: In addition, if proxy settings are detected (for example, when a ``*_proxy`` environment variable like :envvar:`http_proxy` is set), :class:`ProxyHandler` is default installed and makes sure the requests are handled through the proxy.
es: Adicionalmente, si se detectan configuraciones de proxy (por ejemplo, cuando se establece una variable de entorno ``*_proxy`` como :envvar:`http_proxy`), :class:`ProxyHandler` está instalada de forma predeterminada y se asegura que las peticiones son gestionadas a través del proxy.

source: The legacy ``urllib.urlopen`` function from Python 2.6 and earlier has been discontinued; :func:`urllib.request.urlopen` corresponds to the old ``urllib2.urlopen``. Proxy handling, which was done by passing a dictionary parameter to ``urllib.urlopen``, can be obtained by using :class:`ProxyHandler` objects.
es: La función heredada de Python 2.6 y anteriores ``urllib.urlopen`` ha sido descontinuada, :func:`urllib.request.urlopen` corresponde a la antigua ``urllib2.urlopen``. La gestión de proxy, la cual se hacía pasando un parámetro diccionario a ``urllib.urlopen``, puede ser obtenida usando objetos :class:`ProxyHandler`.

source: Raises an :ref:`auditing event <auditing>` ``urllib.Request`` with arguments ``fullurl``, ``data``, ``headers``, ``method``.
es: Genera un :ref:`evento de auditoría <auditing>` ``urllib.Request`` con los argumentos ``fullurl``, ``data``, ``headers``, ``method``.

source: The default opener raises an :ref:`auditing event <auditing>` ``urllib.Request`` with arguments ``fullurl``, ``data``, ``headers``, ``method`` taken from the request object.
es: El abridor predeterminado genera un :ref:`evento de auditoría <auditing>` ``urllib.Request`` con los argumentos ``fullurl``, ``data``, ``headers``, ``method`` tomados del objeto de la petición.

source: *cafile* and *capath* were added.
es: *cafile* y *capath* fueron añadidos.

source: HTTPS virtual hosts are now supported if possible (that is, if :const:`ssl.HAS_SNI` is true).
es: Los hosts virtuales HTTPS ahora están soportados si es posible (esto es, si :const:`ssl.HAS_SNI` es verdadero).

source: *data* can be an iterable object.
es: *data* puede ser un objeto iterable.

source: *cadefault* was added.
es: *cadefault* fue añadido.

source: *context* was added.
es: *context* fue añadido.

source: HTTPS connection now send an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocol`.
es: La conexión HTTPS ahora envía una extensión ALPN con indicador de protocolo ``http/1.1`` cuando no se proporciona *context*. El *context* personalizado debe establecer protocolos ALPN con :meth:`~ssl.SSLContext.set_alpn_protocol`.

source: *cafile*, *capath* and *cadefault* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
es: *cafile*, *capath* y *cadefault* están obsoletos en favor de *context*. Por favor, use :meth:`ssl.SSLContext.load_cert_chain` en su lugar o deja a :func:`ssl.create_default_context` seleccionar el certificado de confianza CA del sistema por ti.

source: Install an :class:`OpenerDirector` instance as the default global opener. Installing an opener is only necessary if you want urlopen to use that opener; otherwise, simply call :meth:`OpenerDirector.open` instead of :func:`~urllib.request.urlopen`. The code does not check for a real :class:`OpenerDirector`, and any class with the appropriate interface will work.
es: Instala una instancia :class:`OpenerDirector` como el abridor global predeterminado. Instalar un abridor sólo es necesario si quieres que urlopen use ese abridor; si no, simplemente invoca :meth:`OpenerDirector.open` en lugar de :func:`~urllib.request.urlopen`. El código no comprueba por un :class:`OpenerDirector` real y cualquier clase con la interfaz apropiada funcionará.

source: Return an :class:`OpenerDirector` instance, which chains the handlers in the order given. *handler*\s can be either instances of :class:`BaseHandler`, or subclasses of :class:`BaseHandler` (in which case it must be possible to call the constructor without any parameters). Instances of the following classes will be in front of the *handler*\s, unless the *handler*\s contain them, instances of them or subclasses of them: :class:`ProxyHandler` (if proxy settings are detected), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.
es: Retorna una instancia :class:`OpenerDirector`, la cual encadena los manejadores en el orden dado. *handler*\s pueden ser tanto instancias de :class:`BaseHandler` o subclases de :class:`BaseHandler` (en cuyo caso debe ser posible invocar el constructor sin ningún parámetro). Instancias de las siguientes clases estarán delante del *handler*\s, a no ser que el *handler*\s las contenga, instancias o subclases de ellas: :class:`ProxyHandler` (si son detectadas configuraciones de proxy), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.

source: If the Python installation has SSL support (i.e., if the :mod:`ssl` module can be imported), :class:`HTTPSHandler` will also be added.
es: Si la instalación de Python tiene soporte SSL (ej. si se puede importar el módulo :mod:`ssl`), también será añadida :class:`HTTPSHandler`.

source: A :class:`BaseHandler` subclass may also change its :attr:`handler_order` attribute to modify its position in the handlers list.
es: Una subclase de :class:`BaseHandler` puede cambiar también su atributo :attr:`handler_order` para modificar su posición en la lista de manejadores.

source: Convert the pathname *path* from the local syntax for a path to the form used in the path component of a URL. This does not produce a complete URL. The return value will already be quoted using the :func:`~urllib.parse.quote` function.
es: Convierte el nombre de ruta *path* desde la sintaxis local para una ruta a la forma usada en el componente ruta de una URL. Esto no produce una URL completa. El valor retornado ya estará entrecomillado usando la función :func:`~urllib.parse.quote`.

source: Convert the path component *path* from a percent-encoded URL to the local syntax for a path. This does not accept a complete URL. This function uses :func:`~urllib.parse.unquote` to decode *path*.
es: Convierte el componente ruta *path* desde una URL codificada con porcentajes a la sintaxis local para una ruta. No acepta una URL completa. Esta función usa :func:`~urllib.parse.unquote` para decodificar *path*.

source: This helper function returns a dictionary of scheme to proxy server URL mappings. It scans the environment for variables named ``<scheme>_proxy``, in a case insensitive approach, for all operating systems first, and when it cannot find it, looks for proxy information from System Configuration for macOS and Windows Systems Registry for Windows. If both lowercase and uppercase environment variables exist (and disagree), lowercase is preferred.
es: Esta función auxiliar retorna un diccionario de esquema para las asignaciones de URL del servidor proxy. Escanea el entorno en busca de variables denominadas ``<scheme>_proxy``, tomando en cuenta diferencia entre mayúsculas y minúsculas, para todos los sistemas operativos primero, y cuando no pueden encontrarla, buscan información proxy desde la Configuración del Sistema de macOS y desde Registros del Sistema para Windows. Si existen variables de entorno tanto en mayúsculas como en minúsculas (y no concuerdan), las minúsculas son preferidas.

source: If the environment variable ``REQUEST_METHOD`` is set, which usually indicates your script is running in a CGI environment, the environment variable ``HTTP_PROXY`` (uppercase ``_PROXY``) will be ignored. This is because that variable can be injected by a client using the "Proxy:" HTTP header. If you need to use an HTTP proxy in a CGI environment, either use ``ProxyHandler`` explicitly, or make sure the variable name is in lowercase (or at least the ``_proxy`` suffix).
es: Si la variable del entorno ``REQUEST_METHOD`` está definida, lo cual usualmente indica que tu script está ejecutándose en un entorno CGI, la variable de entorno ``HTTP_PROXY`` (mayúsculas ``_PROXY``) será ignorada. Esto es porque esa variable puede ser inyectada por un cliente usando el encabezado HTTP "Proxy:". Si necesitas usar un proxy HTTP en un entorno CGI, usa ``ProxyHandler`` explícitamente o asegúrate de que el nombre de la variable está en minúsculas (o al menos el sufijo ``_proxy``).

source: The following classes are provided:
es: Se proveen las siguientes clases:

source: This class is an abstraction of a URL request.
es: Esta clase es un abstracción de una petición URL.

source: *url* should be a string containing a valid, properly encoded URL.
es: *url* debe ser una cadena de texto que contenga una URL válida y correctamente codificada.

source: *data* must be an object specifying additional data to send to the server, or ``None`` if no such data is needed. Currently HTTP requests are the only ones that use *data*. The supported object types include bytes, file-like objects, and iterables of bytes-like objects. If no ``Content-Length`` nor ``Transfer-Encoding`` header field has been provided, :class:`HTTPHandler` will set these headers according to the type of *data*. ``Content-Length`` will be used to send bytes objects, while ``Transfer-Encoding: chunked`` as specified in :rfc:`7230`, Section 3.3.1 will be used to send files and other iterables.
es: *data* debe ser un objeto que especifique datos adicionales a enviar al servidor o ``None`` si no se necesitan tales datos. Actualmente las peticiones HTTP son las únicas que usan *data*. Los tipos de objetos soportados incluyen bytes, objetos como archivos e iterables de objetos como bytes. Si no se ha provisto el campo de encabezado ``Content-Length`` ni ``Transfer-Encoding``, :class:`HTTPHandler` establecerá estos encabezados de acuerdo al tipo de *data*. ``Content-Length`` será usado para enviar objetos de bytes, mientras ``Transfer-Encoding: chunked`` como se especifica en :rfc:`7230`, Sección 3.3.1 será usado para enviar archivos y otros iterables.

source: For an HTTP POST request method, *data* should be a buffer in the standard :mimetype:`application/x-www-form-urlencoded` format. The :func:`urllib.parse.urlencode` function takes a mapping or sequence of 2-tuples and returns an ASCII string in this format. It should be encoded to bytes before being used as the *data* parameter.
es: Para un método de una petición HTTP POST, *data* debe ser un buffer en el formato estándar :mimetype:`application/x-www-form-urlencoded`. La función :func:`urllib.parse.urlencode` toma un mapeo o una secuencia de tuplas de dos valores y retorna una cadena de caracteres ASCII en este formato. Debe ser codificada a bytes antes de ser usada como el parámetro *data*.

source: *headers* should be a dictionary, and will be treated as if :meth:`add_header` was called with each key and value as arguments. This is often used to "spoof" the ``User-Agent`` header value, which is used by a browser to identify itself -- some HTTP servers only allow requests coming from common browsers as opposed to scripts. For example, Mozilla Firefox may identify itself as ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, while :mod:`urllib`'s default user agent string is ``"Python-urllib/2.6"`` (on Python 2.6). All header keys are sent in camel case.
es: *headers* debe ser un diccionario, y será tratado como si :meth:`add_header` fuera invocado con cada clave y valor como argumentos. Esto es usado frecuentemente para "parodiar" el valor de encabezado ``User-Agent``, el cual es usado por un navegador para identificarse a sí mismo -- algunos servidores HTTP sólo permiten peticiones que vienen de navegadores comunes a diferencia de los scripts. Por ejemplo, Mozilla Firefox puede identificarse a sí mismo como ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, mientras el agente de usuario predeterminado de :mod:`urllib` es ``"Python-urllib/2.6"`` (en Python 2.6). Todas las claves de los encabezados se envían en camel case.

source: An appropriate ``Content-Type`` header should be included if the *data* argument is present. If this header has not been provided and *data* is not None, ``Content-Type: application/x-www-form-urlencoded`` will be added as a default.
es: Un encabezado apropiado ``Content-Type`` debe ser incluido si el argumento *data* está presente. Si este encabezado no ha sido provisto y *data* no es None, será añadido ``Content-Type: application/x-www-form-urlencoded`` de forma predeterminada.

source: The next two arguments are only of interest for correct handling of third-party HTTP cookies:
es: Los siguientes dos argumentos sólo tienen interés para la gestión correcta de cookies HTTP de terceros:

source: *origin_req_host* should be the request-host of the origin transaction, as defined by :rfc:`2965`. It defaults to ``http.cookiejar.request_host(self)``. This is the host name or IP address of the original request that was initiated by the user. For example, if the request is for an image in an HTML document, this should be the request-host of the request for the page containing the image.
es: *origin_req_host* debe ser el host de la petición de la transacción origen, como define :rfc:`2965`. Por defecto es ``http.cookiejar.request_host(self)``. Este es el nombre de host o la dirección IP de la petición original que fue iniciada por el usuario. Por ejemplo, si la petición es para una imagen en un documento HTML, debe ser el host de la petición para la página que contiene la imagen.

source: *unverifiable* should indicate whether the request is unverifiable, as defined by :rfc:`2965`. It defaults to ``False``. An unverifiable request is one whose URL the user did not have the option to approve. For example, if the request is for an image in an HTML document, and the user had no option to approve the automatic fetching of the image, this should be true.
es: *unverifiable* debe indicar si la petición no es verificable, como define :rfc:`2965`. Por defecto es ``False``. Una petición no verificable es una cuya URL el usuario no tuvo opción de aprobar. Por ejemplo, si la petición es por una imagen en un documento HTML y el usuario no tuvo opción de aprobar la obtención automática de la imagen, este debe ser verdadero.

source: *method* should be a string that indicates the HTTP request method that will be used (e.g. ``'HEAD'``). If provided, its value is stored in the :attr:`~Request.method` attribute and is used by :meth:`get_method()`. The default is ``'GET'`` if *data* is ``None`` or ``'POST'`` otherwise. Subclasses may indicate a different default method by setting the :attr:`~Request.method` attribute in the class itself.
es: *method* debe ser una cadena que indica el método de la petición HTTP que será usado (ej. ``'HEAD'``). Si se provee, su valor es almacenado en el atributo :attr:`~Request.method` y usado por :meth:`get_method()`. Por defecto es ``'GET'`` si *data* es ``None``, o ``'POST'`` si no. Las subclases pueden indicar un método predeterminado diferente estableciendo el atributo :attr:`~Request.method` es la clase misma.

source: The request will not work as expected if the data object is unable to deliver its content more than once (e.g. a file or an iterable that can produce the content only once) and the request is retried for HTTP redirects or authentication. The *data* is sent to the HTTP server right away after the headers. There is no support for a 100-continue expectation in the library.
es: La petición no funcionará como se espera si el objeto de datos es incapaz de entregar su contenido más de una vez (ej. un archivo o un iterable que puede producir el contenido sólo una vez) y la petición se reintentará para redirecciones HTTP o autenticación. El *data* es enviado al servidor HTTP directamente después de los encabezados. No hay soporte para una expectativa de funcionamiento 100% continuo en la biblioteca.

source: :attr:`Request.method` argument is added to the Request class.
es: El argumento :attr:`Request.method` es añadido a la clase Request.

source: Default :attr:`Request.method` may be indicated at the class level.
es: El atributo predeterminado :attr:`Request.method` puede ser indicado a nivel de clase.

source: Do not raise an error if the ``Content-Length`` has not been provided and *data* is neither ``None`` nor a bytes object. Fall back to use chunked transfer encoding instead.
es: No se genera un error si el ``Content-Length`` no ha sido provisto y *data* no es ``None`` ni un objeto de bytes. En su lugar recurre a la codificación de transferencia fragmentada.

source: The :class:`OpenerDirector` class opens URLs via :class:`BaseHandler`\ s chained together. It manages the chaining of handlers, and recovery from errors.
es: La clase :class:`OpenerDirector` abre URLs mediante la encadenación conjunta de :class:`BaseHandler`. Este maneja el encadenamiento de manejadores y la recuperación de errores.
