Repository: python/python-docs-es
Catalog: library/urllib.request.po
Languages: es

source: This is the base class for all registered handlers --- and handles only the simple mechanics of registration.
es: Esta es la clase base para todos los manejadores registrados --- y manejan sólo las mecánicas simples del registro.

source: A class which defines a default handler for HTTP error responses; all responses are turned into :exc:`~urllib.error.HTTPError` exceptions.
es: Una clase la cual define un manejador predeterminado para los errores de respuesta HTTP; todas las respuestas son convertidas en excepciones :exc:`~urllib.error.HTTPError`.

source: A class to handle redirections.
es: Una clase para manejar redirecciones.

source: A class to handle HTTP Cookies.
es: Una clase para manejar Cookies HTTP.

source: Cause requests to go through a proxy. If *proxies* is given, it must be a dictionary mapping protocol names to URLs of proxies. The default is to read the list of proxies from the environment variables ``<protocol>_proxy``. If no proxy environment variables are set, then in a Windows environment proxy settings are obtained from the registry's Internet Settings section, and in a macOS environment proxy information is retrieved from the System Configuration Framework.
es: Causa que las peticiones vayan a través de un proxy. Si se provee *proxies*, debe ser un diccionario mapeando nombres de protocolos a URLs de proxies. Por defecto lee la lista de proxies de las variables de entorno ``<protocol>_proxy``. Si no se establecen variables de entorno de proxy, entonces se obtienen las configuraciones de proxy en un entorno Windows desde la sección del registro de Configuraciones de Internet y en un entorno macOS se obtiene la información de proxy desde el Framework de Configuración del Sistema.

source: To disable autodetected proxy pass an empty dictionary.
es: Para deshabilitar la detección automática de proxy pasa un diccionario vacío.

source: The :envvar:`no_proxy` environment variable can be used to specify hosts which shouldn't be reached via proxy; if set, it should be a comma-separated list of hostname suffixes, optionally with ``:port`` appended, for example ``cern.ch,ncsa.uiuc.edu,some.host:8080``.
es: La variable de entorno :envvar:`no_proxy` puede ser usada para especificar hosts los cuales no deben ser alcanzados mediante proxy; si se establece, debe ser una lista separada por comas de sufijos de nombres de host, con ``:port`` añadidos opcionalmente, por ejemplo ``cern.ch,ncsa.uiuc.edu,some.host:8080``.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
es: ``HTTP_PROXY`` será ignorado si se establece una variable ``REQUEST_METHOD``; vea la documentación de :func:`~urllib.request.getproxies`.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings.
es: Mantiene una base de datos de mapeos ``(realm, uri) -> (user, password)``.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings. A realm of ``None`` is considered a catch-all realm, which is searched if no other realm fits.
es: Mantiene una base de datos de mapeos ``(realm, uri) -> (user, password)``. Un reino de ``None`` se considera un reino caza todo, el cual es buscado si ningún otro reino encaja.

source: A variant of :class:`HTTPPasswordMgrWithDefaultRealm` that also has a database of ``uri -> is_authenticated`` mappings. Can be used by a BasicAuth handler to determine when to send authentication credentials immediately instead of waiting for a ``401`` response first.
es: Una variante de :class:`HTTPPasswordMgrWithDefaultRealm` que también tiene una base de datos de mapeos ``uri -> is_authenticated``. Puede ser usada por un manejador BasicAuth para determinar cuando enviar credenciales de autenticación inmediatamente en lugar de esperar primero a una respuesta ``401``.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. If *passwd_mgr* also provides ``is_authenticated`` and ``update_authenticated`` methods (see :ref:`http-password-mgr-with-prior-auth`), then the handler will use the ``is_authenticated`` result for a given URI to determine whether or not to send authentication credentials with the request. If ``is_authenticated`` returns ``True`` for the URI, credentials are sent. If ``is_authenticated`` is ``False``, credentials are not sent, and then if a ``401`` response is received the request is re-sent with the authentication credentials. If authentication succeeds, ``update_authenticated`` is called to set ``is_authenticated`` ``True`` for the URI, so that subsequent requests to the URI or any of its super-URIs will automatically include the authentication credentials.
es: Esta es una clase mixin que ayuda con la autenticación HTTP, tanto al host remoto y a un proxy. Si se proporciona *password_mgr*, debe ser algo compatible con :class:`HTTPPasswordMgr`; refiera a la sección :ref:`http-password-mgr` para información sobre la interfaz que debe ser soportada. Si *passwd_mgr* proporciona también métodos ``is_authenticated`` y ``update_authenticated`` (vea :ref:`http-password-mgr-with-prior-auth`), entonces el manejador usará el ``is_authenticated`` resultado para una URI dada para determinar el envío o no de credenciales de autenticación con la petición. Si ``is_authenticated`` retorna ``True`` para la URI, las peticiones subsecuentes a la URI o cualquiera de las super URIs incluirán automáticamente los credenciales de autenticación.

source: Added ``is_authenticated`` support.
es: Añadido soporte ``is_authenticated``.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. HTTPBasicAuthHandler will raise a :exc:`ValueError` when presented with a wrong Authentication scheme.
es: Administra autenticación con el host remoto. Si se proporciona *password_mgr*, debe ser compatible con :class:`HTTPPasswordMgr`; refiera a la sección :ref:`http-password-mgr` para información sobre la interfaz que debe ser soportada. HTTPBasicAuthHandler lanzará un :exc:`ValueError` cuando se presente con un esquema de Autenticación incorrecto.

source: Handle authentication with the proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
es: Administra autenticación con el proxy. Si se proporciona *password_mgr* debe ser compatible con :class:`HTTPPasswordMgr`; refiera a la sección :ref:`http-password-mgr` para información sobre la interfaz que debe ser soportada.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
es: Esto es una clase mixin que ayuda con la autenticación HTTP, tanto al host remoto como a un proxy. Si se proporciona *password_mgr* debe ser compatible con :class:`HTTPPasswordMgr`; refiera a la sección :ref:`http-password-mgr` para información sobre la interfaz que debe ser soportada.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. When both Digest Authentication Handler and Basic Authentication Handler are both added, Digest Authentication is always tried first. If the Digest Authentication returns a 40x response again, it is sent to Basic Authentication handler to Handle. This Handler method will raise a :exc:`ValueError` when presented with an authentication scheme other than Digest or Basic.
es: Maneja autenticación con el host remoto. Si se proporciona *password_mgr* debe ser compatible con :class:`HTTPPasswordMgr`; refiera a la sección :ref:`http-password-mgr` para información sobre la interfaz que debe ser soportada. Cuando se añaden tanto el Manejador de Autenticación Digest (*Digest Authentication Handler*) como el Manejador de Autenticación Básico (*Basic Authentication Handler*) la Autenticación Digest siempre se intenta primero. Si la Autenticación Digest retorna una respuesta 40x de nuevo, se envía al controlador de Autenticación Básica para Manejar. Este método Handler lanzará un :exc:`ValueError` cuando sea presentado con un esquema de autenticación diferente a Digest o Básico.

source: Raise :exc:`ValueError` on unsupported Authentication Scheme.
es: Genera :exc:`ValueError` en Esquema de Autenticación no soportado.

source: A class to handle opening of HTTP URLs.
es: Una clase para gestionar apertura de URLs HTTP.

source: A class to handle opening of HTTPS URLs. *context* and *check_hostname* have the same meaning as in :class:`http.client.HTTPSConnection`.
es: Una clase para gestionar apertura de URLs HTTPS. *context* y *check_hostname* tienen el mismo significado que en :class:`http.client.HTTPSConnection`.

source: *context* and *check_hostname* were added.
es: *context* y *check_hostname* fueron añadidos.

source: Open local files.
es: Abre archivos locales.

source: Open data URLs.
es: Abre URLs de datos.

source: Open FTP URLs.
es: Abre URLs FTP.

source: Open FTP URLs, keeping a cache of open FTP connections to minimize delays.
es: Abre URLs FTP, manteniendo una caché de conexiones FTP abiertas para minimizar retrasos.

source: A catch-all class to handle unknown URLs.
es: Una clase caza todo para gestionar URLs desconocidas.

source: Process HTTP error responses.
es: Procesa errores de respuestas HTTP.

source: Request Objects
es: Objetos Request

source: The following methods describe :class:`Request`'s public interface, and so all may be overridden in subclasses. It also defines several public attributes that can be used by clients to inspect the parsed request.
es: Los siguientes métodos describen la interfaz pública de :class:`Request` por lo que pueden ser sobrescritos en subclases. También define varios atributos públicos que pueden ser usado por clientes para inspeccionar la respuesta analizada.

source: The original URL passed to the constructor.
es: La URL original pasada al constructor.

source: Request.full_url is a property with setter, getter and a deleter. Getting :attr:`~Request.full_url` returns the original request URL with the fragment, if it was present.
es: Request.full_url es una propiedad con setter, getter y deleter. Obtener :attr:`~Request.full_url` retorna la petición URL original con el fragmento, si este estaba presente.

source: The URI scheme.
es: El esquema de URI.

source: The URI authority, typically a host, but may also contain a port separated by a colon.
es: La autoridad de URI, típicamente un host, pero también puede contener un puerto separado por un caracter de doble punto.

source: The original host for the request, without port.
es: El host original de la petición, sin puerto.

source: The URI path. If the :class:`Request` uses a proxy, then selector will be the full URL that is passed to the proxy.
es: La ruta de URI. Si :class:`Request` usa un proxy, entonces selector será la URL completa que se pasa al proxy.

source: The entity body for the request, or ``None`` if not specified.
es: El cuerpo de la entidad para la solicitud o ``None`` si no es especificado.

source: Changing value of :attr:`Request.data` now deletes "Content-Length" header if it was previously set or calculated.
es: Cambiar el valor de :attr:`Request.data` elimina ahora el encabezado "Content-Length" si fue establecido o calculado previamente.

source: boolean, indicates whether the request is unverifiable as defined by :rfc:`2965`.
es: booleano, indica si la petición no es verificable como se define por :rfc:`2965`.

source: The HTTP request method to use. By default its value is :const:`None`, which means that :meth:`~Request.get_method` will do its normal computation of the method to be used. Its value can be set (thus overriding the default computation in :meth:`~Request.get_method`) either by providing a default value by setting it at the class level in a :class:`Request` subclass, or by passing a value in to the :class:`Request` constructor via the *method* argument.
es: El método de petición HTTP a usar. Por defecto su valor es :const:`None`, lo que significa que :meth:`~Request.get_method` realizará su cálculo normal del método a usar. Su valor puede ser definido (sobrescribiendo así el cálculo predeterminado en :meth:`~Request.get_method`) tanto proporcionando un valor por defecto estableciéndolo a nivel de clase en una subclase de :class:`Request` o pasando un valor al constructor de :class:`Request` por medio del argumento *method*.

source: A default value can now be set in subclasses; previously it could only be set via the constructor argument.
es: Un valor predeterminado puede ser establecido ahora en subclases; previamente sólo podía ser definido mediante el argumento del constructor.

source: Return a string indicating the HTTP request method. If :attr:`Request.method` is not ``None``, return its value, otherwise return ``'GET'`` if :attr:`Request.data` is ``None``, or ``'POST'`` if it's not. This is only meaningful for HTTP requests.
es: Retorna una cadena indicando el método de petición HTTP. Si :attr:`Request.method` no es ``None``, retorna su valor, de otra forma retorna ``'GET'`` si :attr:`Request.data` es ``None`` o ``'POST'`` si no lo es. Esto sólo es significativo para peticiones HTTP.

source: get_method now looks at the value of :attr:`Request.method`.
es: get_method ahora mira el valor de :attr:`Request.method`.

source: Add another header to the request. Headers are currently ignored by all handlers except HTTP handlers, where they are added to the list of headers sent to the server. Note that there cannot be more than one header with the same name, and later calls will overwrite previous calls in case the *key* collides. Currently, this is no loss of HTTP functionality, since all headers which have meaning when used more than once have a (header-specific) way of gaining the same functionality using only one header. Note that headers added using this method are also added to redirected requests.
es: Añade otro encabezado a la petición. Los encabezados actualmente son ignorados por todos los manejadores excepto los manejadores HTTP, donde son añadidos a la lista de encabezados enviados al servidor. Tenga en cuenta que no puede haber más de un encabezado con el mismo nombre y las invocaciones posteriores sobrescribirán las invocaciones previas en caso de que *key* colisione. Actualmente, esto no es una pérdida de funcionalidad HTTP, ya que todos los encabezados que tienen sentido cuando son usados más de una vez tienen una manera (específica de encabezado) de ganar la misma funcionalidad usando sólo un encabezado. Tenga en cuenta que los encabezados agregados con este método también se agregan a las solicitudes redirigidas.

source: Add a header that will not be added to a redirected request.
es: Añade un encabezado que no será añadido a una petición redireccionada.

source: Return whether the instance has the named header (checks both regular and unredirected).
es: Retorna si la instancia tiene el encabezado nombrado (comprueba tanto regular como no redirigido).

source: Remove named header from the request instance (both from regular and unredirected headers).
es: Elimina el encabezado nombrado de la instancia de la petición (desde encabezados regulares y no redireccionados).

source: Return the URL given in the constructor.
es: Retorna la URL dada en el constructor.

source: Returns :attr:`Request.full_url`
es: Retorna :attr:`Request.full_url`

source: Prepare the request by connecting to a proxy server. The *host* and *type* will replace those of the instance, and the instance's selector will be the original URL given in the constructor.
es: Prepara la petición conectando a un servidor proxy. Los *host* y *type* reemplazarán aquellos de la instancia y el selector de la instancia será la URL original dada en el constructor.

source: Return the value of the given header. If the header is not present, return the default value.
es: Retorna el valor del encabezado dado.

source: Return a list of tuples (header_name, header_value) of the Request headers.
es: Retorna una lista de tuplas (header_name, header_value) de los encabezados de la Petición.

source: The request methods add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host and is_unverifiable that were deprecated since 3.3 have been removed.
es: Los métodos de petición add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host y is_unverifiable que quedaron obsoletos desde 3.3 han sido eliminados.

source: OpenerDirector Objects
es: Objetos OpenerDirector

source: :class:`OpenerDirector` instances have the following methods:
es: Las instancias de :class:`OpenerDirector` tienen los siguientes métodos:

source: *handler* should be an instance of :class:`BaseHandler`. The following methods are searched, and added to the possible chains (note that HTTP errors are a special case). Note that, in the following, *protocol* should be replaced with the actual protocol to handle, for example :meth:`http_response` would be the HTTP protocol response handler. Also *type* should be replaced with the actual HTTP code, for example :meth:`http_error_404` would handle HTTP 404 errors.
es: *handler* debe ser una instancia de :class:`BaseHandler`. Los siguientes métodos son buscados y añadidos a las cadenas posibles (tenga en cuenta que los errores HTTP son un caso espacial). Tenga en cuenta que, en los siguientes, *protocol* debe ser remplazado con el protocolo actual a manejar, por ejemplo :meth:`http_response` sería el protocolo HTTP del manejador de respuesta. También *type* debe ser remplazado con el código HTTP actual, por ejemplo :meth:`http_error_404` manejaría errores HTTP 404.

source: :meth:`<protocol>_open` --- signal that the handler knows how to open *protocol* URLs.
es: :meth:`<protocol>_open` --- señala que el manejador sabe como abrir URLs *protocol*.

source: See |protocol_open|_ for more information.
es: Vea |protocol_open|_ para más información.

source: :meth:`http_error_\<type\>` --- signal that the handler knows how to handle HTTP errors with HTTP error code *type*.
es: :meth:`http_error_\<type\>` --- señala que el manejador sabe como manejar errores HTTP con el código de error *type*.

source: See |http_error_nnn|_ for more information.
es: Vea |http_error_nnn|_ para más información.

source: :meth:`<protocol>_error` --- signal that the handler knows how to handle errors from (non-\ ``http``) *protocol*.
es: :meth:`<protocol>_error` --- señala que el manejador sabe como manejar errores de (no ``http``) *protocol*.

source: :meth:`<protocol>_request` --- signal that the handler knows how to pre-process *protocol* requests.
es: :meth:`<protocol>_request` --- señala que el manejador sabe como preprocesar peticiones *protocol*.

source: See |protocol_request|_ for more information.
es: Vea |protocol_request|_ para más información.

source: :meth:`<protocol>_response` --- signal that the handler knows how to post-process *protocol* responses.
es: :meth:`<protocol>_response` --- señala que el manejador sabe como postprocesar respuestas *protocol*.

source: See |protocol_response|_ for more information.
es: Vea |protocol_response|_ para más información.

source: Open the given *url* (which can be a request object or a string), optionally passing the given *data*. Arguments, return values and exceptions raised are the same as those of :func:`urlopen` (which simply calls the :meth:`open` method on the currently installed global :class:`OpenerDirector`). The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). The timeout feature actually works only for HTTP, HTTPS and FTP connections.
es: Abre la *url* dada (la cual puede ser un objeto de petición o una cadena de caracteres), pasando opcionalmente el *data* dado. Los argumentos, los valores de retorno y las excepciones generadas son las mismas que aquellas de :func:`urlopen` (las cuales simplemente invocan el método :meth:`open` en el :class:`OpenerDirector` instalado global). El parámetro opcional *timeout* especifica un tiempo de expiración en segundos para operaciones bloqueantes como el intento de conexión (si no se especifica, el tiempo de expiración global será usado). La característica de tiempo de expiración actualmente funciona sólo para conexiones HTTP, HTTPS y FTP.

source: Handle an error of the given protocol. This will call the registered error handlers for the given protocol with the given arguments (which are protocol specific). The HTTP protocol is a special case which uses the HTTP response code to determine the specific error handler; refer to the :meth:`http_error_\<type\>` methods of the handler classes.
es: Maneja un error del protocolo dado. Esto invocará los manejadores de error registrados para el protocolo dado con los argumentos dados (los cuales son específicos del protocolo). El protocolo HTTP es un caso especial el cual usa el código de respuesta HTTP para determinar el manejador de error específico; refiera a los métodos :meth:`http_error_\<type\>` de las clases del manejador.

source: Return values and exceptions raised are the same as those of :func:`urlopen`.
es: Retorna si los valores y excepciones generadas son las mismas que aquellas de :func:`urlopen`.

source: OpenerDirector objects open URLs in three stages:
es: Los objetos OpenerDirector abren URLs en tres etapas:

source: The order in which these methods are called within each stage is determined by sorting the handler instances.
es: El orden en el cual esos métodos son invocados dentro de cada etapa es determinado ordenando las instancias manejadoras.

source: Every handler with a method named like :meth:`<protocol>_request` has that method called to pre-process the request.
es: Cada manejador con un método nombrado como :meth:`<protocol>_request` tiene ese método invocador para preprocesar la petición.

source: Handlers with a method named like :meth:`<protocol>_open` are called to handle the request. This stage ends when a handler either returns a non-\ :const:`None` value (ie. a response), or raises an exception (usually :exc:`~urllib.error.URLError`). Exceptions are allowed to propagate.
es: Los manejadores con un método nombrado como :meth:`<protocol>_open` son invocados para manejar la petición. Esta etapa termina cuando un manejador retorna un valor no :const:`None` (ej. una respuesta) o genera una excepción (generalmente :exc:`~urllib.error.URLError`). Se permite que las excepciones propaguen.
