Repository: python/python-docs-es
Catalog: library/urllib.request.po
Languages: es

source: In fact, the above algorithm is first tried for methods named :meth:`default_open`. If all such methods return :const:`None`, the algorithm is repeated for methods named like :meth:`<protocol>_open`. If all such methods return :const:`None`, the algorithm is repeated for methods named :meth:`unknown_open`.
es: De hecho, el algoritmo anterior se intenta primero para métodos nombrados :meth:`default_open`. Si todos esos métodos retornan :const:`None`, el algoritmo se repite para métodos nombrados como :meth:`<protocol>_open`. Si todos esos métodos retornan :const:`None`, el algoritmo se repite para métodos nombrados como :meth:`unknown_open`.

source: Note that the implementation of these methods may involve calls of the parent :class:`OpenerDirector` instance's :meth:`~OpenerDirector.open` and :meth:`~OpenerDirector.error` methods.
es: Tenga en cuenta que la implementación de esos métodos puede involucrar invocaciones de los métodos :meth:`~OpenerDirector.open` y :meth:`~OpenerDirector.error` de la instancia :class:`OpenerDirector` padre.

source: Every handler with a method named like :meth:`<protocol>_response` has that method called to post-process the response.
es: Cada manejador con un método nombrado como :meth:`<protocol>_response` tiene ese método invocado para postprocesar la respuesta.

source: BaseHandler Objects
es: Objetos BaseHandler

source: :class:`BaseHandler` objects provide a couple of methods that are directly useful, and others that are meant to be used by derived classes. These are intended for direct use:
es: Los objetos :class:`BaseHandler` proporcionan un par de métodos que son útiles directamente y otros que están destinados a ser utilizados por clases derivadas. Estos están pensados para uso directo:

source: Add a director as parent.
es: Añade un director como padre.

source: Remove any parents.
es: Elimina cualquier padre.

source: The following attribute and methods should only be used by classes derived from :class:`BaseHandler`.
es: El siguiente atributo y los siguientes métodos sólo deben ser usados por clases derivadas de :class:`BaseHandler`.

source: The convention has been adopted that subclasses defining :meth:`<protocol>_request` or :meth:`<protocol>_response` methods are named :class:`\*Processor`; all others are named :class:`\*Handler`.
es: Se ha adoptado la convención de que las subclases que definen los métodos :meth:`<protocol>_request` o :meth:`<protocol>_response` son nombradas :class:`\*Processor`; todas las otras son nombradas :class:`\*Handler`.

source: A valid :class:`OpenerDirector`, which can be used to open using a different protocol, or handle errors.
es: Un :class:`OpenerDirector` válido, el cual puede ser utilizado para abrir usando un protocolo diferente, o para manejar errores.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs.
es: Este método no es definido en :class:`BaseHandler`, pero las subclases deben definirlo si quieren cazar todas las URLs.

source: This method, if implemented, will be called by the parent :class:`OpenerDirector`. It should return a file-like object as described in the return value of the :meth:`~OpenerDirector.open` method of :class:`OpenerDirector`, or ``None``. It should raise :exc:`~urllib.error.URLError`, unless a truly exceptional thing happens (for example, :exc:`MemoryError` should not be mapped to :exc:`URLError`).
es: Este método, si se implementa, será llamado por el :class:`OpenerDirector` padre. Debería devolver un objeto tipo archivo como se describe en el valor de retorno del método :meth:`~OpenerDirector.open` de la clase :class:`OpenerDirector`, o ``None``. Debería levantar :exc:`~urllib.error.URLError`, a menos que suceda algo verdaderamente excepcional (por ejemplo, :exc:`MemoryError` no debe asignarse a :exc:`URLError`).

source: This method will be called before any protocol-specific open method.
es: Este método será invocado antes de cualquier método de apertura específico de protocolo.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to handle URLs with the given protocol.
es: Este método no está definido en :class:`BaseHandler`, pero las subclases deben definirlo si quieren manejar URLs con el protocolo dado.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. Return values should be the same as for :meth:`default_open`.
es: Este método, si está definido, será invocado por el :class:`OpenerDirector` padre. Los valores retornados deben ser los mismos que para :meth:`default_open`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs with no specific registered handler to open it.
es: Este método *no* está definido en :class:`BaseHandler`, pero las subclases deben definirlo si quieren cazar todas las URLs sin manejador registrado para abrirlo.

source: This method, if implemented, will be called by the :attr:`parent` :class:`OpenerDirector`. Return values should be the same as for :meth:`default_open`.
es: Este método, si está implementado, será invocado por el :attr:`parent` de :class:`OpenerDirector`. Los valores retornados deben ser los mismos que para :meth:`default_open`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should override it if they intend to provide a catch-all for otherwise unhandled HTTP errors. It will be called automatically by the :class:`OpenerDirector` getting the error, and should not normally be called in other circumstances.
es: Este método *no* está definido en :class:`BaseHandler`, pero las subclases deben sobreescribirlo si pretenden proporcionar una solución general para los errores HTTP que de otro modo no se manejarían. Sería invocado automáticamente por el :class:`OpenerDirector` obteniendo el error y no debe ser invocado normalmente en otras circunstancias.

source: *req* will be a :class:`Request` object, *fp* will be a file-like object with the HTTP error body, *code* will be the three-digit code of the error, *msg* will be the user-visible explanation of the code and *hdrs* will be a mapping object with the headers of the error.
es: *req* será un objeto :class:`Request`, *fp* será un objeto como archivo con el cuerpo de error HTTP, *code* será el código de error de tres dígitos, *msg* será la explicación visible para el usuario del código y *hdrs* será un objeto de mapeo con los encabezados del error.

source: Return values and exceptions raised should be the same as those of :func:`urlopen`.
es: Los valores de retorno y las excepciones generadas deben ser los mismos que aquellos de :func:`urlopen`.

source: *nnn* should be a three-digit HTTP error code. This method is also not defined in :class:`BaseHandler`, but will be called, if it exists, on an instance of a subclass, when an HTTP error with code *nnn* occurs.
es: *nnn* debe ser un código de error HTTP de tres dígitos. Este método tampoco está definido en :class:`BaseHandler`, pero será invocado, si existe, en una instancia de una subclase, cuando ocurra un error HTTP con código *nnn*.

source: Subclasses should override this method to handle specific HTTP errors.
es: Las subclases deben sobrescribir este método para manejar errores HTTP específicos.

source: Arguments, return values and exceptions raised should be the same as for :meth:`http_error_default`.
es: Los argumentos, valores de retorno y las excepciones generadas deben ser las mismas que para :meth:`http_error_default`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to pre-process requests of the given protocol.
es: Este método *no* está definido en :class:`BaseHandler`, pero las subclases deben definirlo si pretenden preprocesar peticiones del protocolo dado.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. The return value should be a :class:`Request` object.
es: Este método, si está definido, será invocado por el :class:`OpenerDirector` padre. *req* será un objeto :class:`Request`. El valor retornado debe ser un objeto :class:`Request`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to post-process responses of the given protocol.
es: Este método *no* está definido en :class:`BaseHandler`, pero las subclases deben definirlo si quieren postprocesar respuestas del protocolo dado.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. *response* will be an object implementing the same interface as the return value of :func:`urlopen`. The return value should implement the same interface as the return value of :func:`urlopen`.
es: Este método, si está definido, será invocado por el :class:`OpenerDirector` padre. *req* será un objeto :class:`Request`. *response* será un objeto que implementa la misma interfaz que el valor retornado de :func:`urlopen`. El valor retornado debe implementar la misma interfaz que el valor retornado de :func:`urlopen`.

source: HTTPRedirectHandler Objects
es: Objetos HTTPRedirectHandler

source: Some HTTP redirections require action from this module's client code. If this is the case, :exc:`~urllib.error.HTTPError` is raised. See :rfc:`2616` for details of the precise meanings of the various redirection codes.
es: Algunas redirecciones HTTP requieren acción desde el código del módulo del cliente. Si este es el caso, se genera :exc:`~urllib.error.HTTPError`. Vea :rfc:`2616` para más detalles de los significados precisos de los diferentes códigos de redirección.

source: An :class:`HTTPError` exception raised as a security consideration if the HTTPRedirectHandler is presented with a redirected URL which is not an HTTP, HTTPS or FTP URL.
es: Una excepción :class:`HTTPError` generada como consideración de seguridad si el HTTPRedirectHandler se presenta con una URL redirigida la cual no es una URL HTTP, HTTPS o FTP.

source: Return a :class:`Request` or ``None`` in response to a redirect. This is called by the default implementations of the :meth:`http_error_30\*` methods when a redirection is received from the server. If a redirection should take place, return a new :class:`Request` to allow :meth:`http_error_30\*` to perform the redirect to *newurl*. Otherwise, raise :exc:`~urllib.error.HTTPError` if no other handler should try to handle this URL, or return ``None`` if you can't but another handler might.
es: Retorna un :class:`Request` o ``None`` en respuesta a una redirección. Esto es invocado por las implementaciones predeterminadas de los métodos :meth:`http_error_30\*` cuando se recibe una redirección del servidor. Si puede tomar lugar una redirección, retorna un nuevo :class:`Request` para permitir a :meth:`http_error_30\*` realizar la redirección a *newurl*. De otra forma, genera :exc:`~urllib.error.HTTPError` si ningún otro manejador debe intentar manejar esta URL, o retorna ``None`` si no tú pero otro manejador puede.

source: The default implementation of this method does not strictly follow :rfc:`2616`, which says that 301 and 302 responses to ``POST`` requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a ``GET``, and the default implementation reproduces this behavior.
es: La implementación predeterminada de este método no sigue estrictamente :rfc:`2616`, la cual dice que las respuestas 301 y 302 a peticiones POST no deben ser redirigidas automáticamente sin confirmación por el usuario. En realidad, los navegadores permiten redirección automática de esas respuestas, cambiando el POST a un ``GET`` y la implementación predeterminada reproduce este comportamiento.

source: Redirect to the ``Location:`` or ``URI:`` URL. This method is called by the parent :class:`OpenerDirector` when getting an HTTP 'moved permanently' response.
es: Redirecciona a la URL ``Location:`` o ``URI:``. Este método es invocado por el :class:`OpenerDirector` padre al obtener una respuesta HTTP 'moved permanently'.

source: The same as :meth:`http_error_301`, but called for the 'found' response.
es: Lo mismo que :meth:`http_error_301`, pero invocado para la respuesta 'found'.

source: The same as :meth:`http_error_301`, but called for the 'see other' response.
es: Lo mismo que :meth:`http_error_301`, pero invocado para la respuesta 'see other'.

source: The same as :meth:`http_error_301`, but called for the 'temporary redirect' response. It does not allow changing the request method from ``POST`` to ``GET``.
es: Lo mismo que :meth:`http_error_301`, pero invocado para la respuesta 'redirección temporal'. No permite cambiar el método de solicitud de ``POST`` a ``GET``.

source: The same as :meth:`http_error_301`, but called for the 'permanent redirect' response. It does not allow changing the request method from ``POST`` to ``GET``.
es: Lo mismo que :meth:`http_error_301`, pero invocado para la respuesta 'redirección permanente'. No permite cambiar el método de solicitud de ``POST`` a ``GET``.

source: HTTPCookieProcessor Objects
es: Objetos HTTPCookieProcessor

source: :class:`HTTPCookieProcessor` instances have one attribute:
es: Las instancias :class:`HTTPCookieProcessor` tienen un atributo:

source: The :class:`http.cookiejar.CookieJar` in which cookies are stored.
es: El :class:`http.cookiejar.CookieJar` en el cual las cookies están almacenadas.

source: ProxyHandler Objects
es: Objetos ProxyHandler

source: The :class:`ProxyHandler` will have a method :meth:`<protocol>_open` for every *protocol* which has a proxy in the *proxies* dictionary given in the constructor. The method will modify requests to go through the proxy, by calling ``request.set_proxy()``, and call the next handler in the chain to actually execute the protocol.
es: El :class:`ProxyHandler` tendrá un método :meth:`<protocol>_open` para cada *protocol* el cual tiene un proxy en el diccionario *proxies* dado en el constructor. El método modificará peticiones para ir a través del proxy, invocando ``request.set_proxy()``, e invoca el siguiente manejador en la cadena que ejecuta actualmente el protocolo.

source: HTTPPasswordMgr Objects
es: Objetos HTTPPasswordMgr

source: These methods are available on :class:`HTTPPasswordMgr` and :class:`HTTPPasswordMgrWithDefaultRealm` objects.
es: Estos métodos están disponibles en los objetos :class:`HTTPPasswordMgr` y :class:`HTTPPasswordMgrWithDefaultRealm`.

source: *uri* can be either a single URI, or a sequence of URIs. *realm*, *user* and *passwd* must be strings. This causes ``(user, passwd)`` to be used as authentication tokens when authentication for *realm* and a super-URI of any of the given URIs is given.
es: *uri* puede ser una única URI o una secuencia de URIs. *realm*, *user* y *passwd* deben ser cadenas. Esto causa que ``(user, passwd)`` se utilice como tokens de autenticación cuando la autenticación para *realm* y para una super URI de ninguna de las URIs dadas es provista.

source: Get user/password for given realm and URI, if any. This method will return ``(None, None)`` if there is no matching user/password.
es: Obtener usuario/contraseña para el reino y URI dados, si alguno ha sido dado. Este método retornará ``(None, None)`` si no hay usuario/contraseña concordante.

source: For :class:`HTTPPasswordMgrWithDefaultRealm` objects, the realm ``None`` will be searched if the given *realm* has no matching user/password.
es: Para objetos :class:`HTTPPasswordMgrWithDefaultRealm`, el reino ``None`` será buscado si el *realm* dado no tiene usuario/contraseña concordante.

source: HTTPPasswordMgrWithPriorAuth Objects
es: Objetos HTTPPasswordMgrWithPriorAuth

source: This password manager extends :class:`HTTPPasswordMgrWithDefaultRealm` to support tracking URIs for which authentication credentials should always be sent.
es: Esta manejador de contraseña extiende :class:`HTTPPasswordMgrWithDefaultRealm` para soportar el seguimiento de URIs para las cuales deben ser enviadas siempre credenciales de autenticación.

source: *realm*, *uri*, *user*, *passwd* are as for :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* sets the initial value of the ``is_authenticated`` flag for the given URI or list of URIs. If *is_authenticated* is specified as ``True``, *realm* is ignored.
es: *realm*, *uri*, *user*, *passwd* son como para :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* establece el valor inicial del indicador ``is_authenticated`` para la URI o lista de URIs dadas. Si se especifica *is_authenticated* como ``True``, *realm* se ignora.

source: Same as for :class:`HTTPPasswordMgrWithDefaultRealm` objects
es: Lo mismo que para objetos :class:`HTTPPasswordMgrWithDefaultRealm`

source: Update the ``is_authenticated`` flag for the given *uri* or list of URIs.
es: Actualiza el indicador ``is_authenticated`` para la *uri* o lista de URIs dadas.

source: Returns the current state of the ``is_authenticated`` flag for the given URI.
es: Retorna el estado actual del indicador ``is_authenticated`` para la URI dada.

source: AbstractBasicAuthHandler Objects
es: Objetos AbstractBasicAuthHandler

source: Handle an authentication request by getting a user/password pair, and re-trying the request. *authreq* should be the name of the header where the information about the realm is included in the request, *host* specifies the URL and path to authenticate for, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
es: Maneja una autenticación de petición obteniendo un par usuario/contraseña y reintentando la petición. *authreq* debe ser el nombre del encabezado donde la información sobre el reino se incluye en la petición, *host* especifica la URL y ruta para la cual autenticar, *req* debe ser el objeto :class:`Request` (fallido) y *headers* deben ser los encabezados de error.

source: *host* is either an authority (e.g. ``"python.org"``) or a URL containing an authority component (e.g. ``"http://python.org/"``). In either case, the authority must not contain a userinfo component (so, ``"python.org"`` and ``"python.org:80"`` are fine, ``"joe:password@python.org"`` is not).
es: *host* es una autoridad (ej. ``"python.org"``) o una URL conteniendo un componente de autoridad (ej. ``"http://python.org/"``). En cualquier caso, la autoridad no debe contener un componente userinfo (por lo que ``"python.org"`` y ``"python.org:80"`` están bien, ``"joe:password@python.org"`` no).

source: HTTPBasicAuthHandler Objects
es: Objetos HTTPBasicAuthHandler

source: Retry the request with authentication information, if available.
es: Reintenta la petición con la información de autenticación, si está disponible.

source: ProxyBasicAuthHandler Objects
es: Objetos ProxyBasicAuthHandler

source: AbstractDigestAuthHandler Objects
es: Objetos AbstractDigestAuthHandler

source: *authreq* should be the name of the header where the information about the realm is included in the request, *host* should be the host to authenticate to, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
es: *authreq* debe ser el nombre del encabezado donde la información sobre el reino está incluida en la petición, *host* debe ser el host al que autenticar, *req* debe ser el objeto :class:`Request` (fallido) y *headers* deben ser los encabezados de error.

source: HTTPDigestAuthHandler Objects
es: Objetos HTTPDigestAuthHandler

source: ProxyDigestAuthHandler Objects
es: Objetos ProxyDigestAuthHandler

source: HTTPHandler Objects
es: Objetos HTTPHandler

source: Send an HTTP request, which can be either GET or POST, depending on ``req.has_data()``.
es: Envía una petición HTTP, que puede ser GET o POST, dependiendo de ``req.has_data()``.

source: HTTPSHandler Objects
es: Objetos HTTPSHandler

source: Send an HTTPS request, which can be either GET or POST, depending on ``req.has_data()``.
es: Envía una petición HTTPS, que puede ser GET o POST, dependiendo de ``req.has_data()``.

source: FileHandler Objects
es: Objetos FileHandler

source: Open the file locally, if there is no host name, or the host name is ``'localhost'``.
es: Abre el archivo localmente, si no hay nombre de host, o el nombre de host es ``'localhost'``.

source: This method is applicable only for local hostnames. When a remote hostname is given, an :exc:`~urllib.error.URLError` is raised.
es: Este método es aplicable sólo para nombres de host locales. Cuando un nombre de host remoto es dado, se genera una excepción :exc:`~urllib.error.URLError`.

source: DataHandler Objects
es: Objetos DataHandler

source: Read a data URL. This kind of URL contains the content encoded in the URL itself. The data URL syntax is specified in :rfc:`2397`. This implementation ignores white spaces in base64 encoded data URLs so the URL may be wrapped in whatever source file it comes from. But even though some browsers don't mind about a missing padding at the end of a base64 encoded data URL, this implementation will raise an :exc:`ValueError` in that case.
es: Lee una URL de datos. Este tipo de URL contiene el contenido codificado en la URL misma. La sintaxis de la URL de datos se especifica en :rfc:`2397`. Esta implementación ignora los espacios en blanco en datos codificados como base64 así que la URL puede ser envuelta en cualquier archivo fuente del que proviene. Pero a pesar de que a algunos navegadores no les importa si falta relleno al final de una URL codificada como base64, esta implementación lanzará un :exc:`ValueError` en este caso.

source: FTPHandler Objects
es: Objetos FTPHandler

source: Open the FTP file indicated by *req*. The login is always done with empty username and password.
es: Abre el archivo FTP indicado por *req*. El inicio de sesión siempre se realiza con un usuario y contraseña vacíos.

source: CacheFTPHandler Objects
es: Objetos CacheFTPHandler

source: :class:`CacheFTPHandler` objects are :class:`FTPHandler` objects with the following additional methods:
es: Los objetos :class:`CacheFTPHandler` son objetos :class:`FTPHandler` con los siguientes métodos adicionales:

source: Set timeout of connections to *t* seconds.
es: Establece el tiempo de expiración de conexiones a *t* segundos.

source: Set maximum number of cached connections to *m*.
es: Establece el número máximo de conexiones cacheadas a *m*.

source: UnknownHandler Objects
es: Objetos UnknownHandler

source: Raise a :exc:`~urllib.error.URLError` exception.
es: Genera una excepción :exc:`~urllib.error.URLError`.

source: HTTPErrorProcessor Objects
es: Objetos HTTPErrorProcessor

source: For 200 error codes, the response object is returned immediately.
es: Para códigos de error que no están en el rango de los 200, el objeto de respuesta es retornado inmediatamente.

source: For non-200 error codes, this simply passes the job on to the :meth:`http_error_\<type\>` handler methods, via :meth:`OpenerDirector.error`. Eventually, :class:`HTTPDefaultErrorHandler` will raise an :exc:`~urllib.error.HTTPError` if no other handler handles the error.
es: Para códigos de error que no están en el rango de los 200, esto simplemente pasa el trabajo a los métodos del manejador :meth:`http_error_\<type\>`, mediante :meth:`OpenerDirector.error`. Eventualmente, :class:`HTTPDefaultErrorHandler` lanzará un :exc:`~urllib.error.HTTPError` si ningún otro manejador maneja el error.

source: Process HTTPS error responses.
es: Procesa los errores HTTPS de las respuestas.

source: The behavior is same as :meth:`http_response`.
es: Este comportamiento es el mismo que :meth:`http_response`.

source: Examples
es: Ejemplos
