Repository: python/python-docs-es
Catalog: library/uuid.po
Languages: es

source: :mod:`uuid` --- UUID objects according to :rfc:`4122`
es: :mod:`uuid` --- objetos UUID según :rfc:`4122`

source: **Source code:** :source:`Lib/uuid.py`
es: **Código fuente:** :source:`Lib/uuid.py`

source: This module provides immutable :class:`UUID` objects (the :class:`UUID` class) and the functions :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` for generating version 1, 3, 4, and 5 UUIDs as specified in :rfc:`4122`.
es: Este módulo proporciona objetos :class:`UUID` inmutables (la clase :class:`UUID`) y las funciones :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` para generar los UUID de las versiones 1, 3, 4 y 5 como se especifica en :rfc:`4122`.

source: If all you want is a unique ID, you should probably call :func:`uuid1` or :func:`uuid4`. Note that :func:`uuid1` may compromise privacy since it creates a UUID containing the computer's network address. :func:`uuid4` creates a random UUID.
es: Si todo lo que quieres es una identificación única, probablemente deberías llamar a :func:`uuuid1` o :func:`uuid4`. Ten en cuenta que :func:`uuid1` puede comprometer la privacidad ya que crea un UUID que contiene la dirección de red del ordenador. :func:`uuid4` crea un UUID aleatorio.

source: Depending on support from the underlying platform, :func:`uuid1` may or may not return a "safe" UUID. A safe UUID is one which is generated using synchronization methods that ensure no two processes can obtain the same UUID. All instances of :class:`UUID` have an :attr:`~UUID.is_safe` attribute which relays any information about the UUID's safety, using this enumeration:
es: Dependiendo del soporte de la plataforma subyacente, :func:`uuid1` puede o no retornar un UUID "seguro". Un UUID seguro es aquel que se genera mediante métodos de sincronización que aseguran que ningún proceso pueda obtener el mismo UUID. Todas las instancias de :class:`UUID` tienen un atributo :attr:`~UUID.is_safe` que transmite cualquier información sobre la seguridad del UUID, usando esta enumeración:

source: The UUID was generated by the platform in a multiprocessing-safe way.
es: El UUID fue generado por la plataforma de una manera segura para multiprocesamiento.

source: The UUID was not generated in a multiprocessing-safe way.
es: El UUID no fue generado por la plataforma de una manera segura de multiprocesamiento.

source: The platform does not provide information on whether the UUID was generated safely or not.
es: La plataforma no proporciona información sobre si el UUID se generó de forma segura o no.

source: Create a UUID from either a string of 32 hexadecimal digits, a string of 16 bytes in big-endian order as the *bytes* argument, a string of 16 bytes in little-endian order as the *bytes_le* argument, a tuple of six integers (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) as the *fields* argument, or a single 128-bit integer as the *int* argument. When a string of hex digits is given, curly braces, hyphens, and a URN prefix are all optional. For example, these expressions all yield the same UUID::
es: Crea un UUID a partir de una cadena de 32 dígitos hexadecimales, una cadena de 16 bytes en orden *big-endian* como el argumento *bytes*, una cadena de 16 bytes en orden *little-endian* como el argumento *bytes_le*, una tupla de seis enteros (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) como el argumento *fields*, o un solo entero de 128-bit como el argumento *int*. Cuando se da una cadena de dígitos hexadecimales, los corchetes, los guiones y el prefijo URN son todos opcionales. Por ejemplo, todas estas expresiones producen el mismo UUID::

source: Exactly one of *hex*, *bytes*, *bytes_le*, *fields*, or *int* must be given. The *version* argument is optional; if given, the resulting UUID will have its variant and version number set according to :rfc:`4122`, overriding bits in the given *hex*, *bytes*, *bytes_le*, *fields*, or *int*.
es: Exactamente uno de *hex*, *bytes*, *bytes_le*, *fields*, o *int* debe ser dado. El argumento *version* es opcional; si se da, el UUID resultante tendrá su variante y número de versión establecidos de acuerdo con :rfc:`4122`, anulando los bits en la *hex*, *bytes*, *bytes_le*, *fields*, o *int* dados.

source: Comparison of UUID objects are made by way of comparing their :attr:`UUID.int` attributes. Comparison with a non-UUID object raises a :exc:`TypeError`.
es: La comparación de los objetos UUID se hace mediante la comparación de sus atributos :attr:`UID.int`. La comparación con un objeto no UUID produce un :exc:`TypeError`.

source: ``str(uuid)`` returns a string in the form ``12345678-1234-5678-1234-567812345678`` where the 32 hexadecimal digits represent the UUID.
es: ``str(uuid)`` retorna una cadena en la forma ``12345678-1234-5678-1234-567812345678`` donde los 32 dígitos hexadecimales representan el UUID.

source: :class:`UUID` instances have these read-only attributes:
es: Las instancias de :class:`UUID` tienen estos atributos de sólo lectura:

source: The UUID as a 16-byte string (containing the six integer fields in big-endian byte order).
es: El UUID como una cadena de 16 bytes (que contiene los seis campos enteros en orden de bytes *big-endian*).

source: The UUID as a 16-byte string (with *time_low*, *time_mid*, and *time_hi_version* in little-endian byte order).
es: El UUID como una cadena de 16 bytes (con *time_low*, *time_mid*, y *time_hi_version* en el orden de bytes *little-endian*).

source: A tuple of the six integer fields of the UUID, which are also available as six individual attributes and two derived attributes:
es: Una tupla de los seis campos enteros de la UUID, que también están disponibles como seis atributos individuales y dos atributos derivados:

source: Field
es: Campo

source: Meaning
es: Significado

source: The first 32 bits of the UUID.
es: los primeros 32 bits del UUID.

source: The next 16 bits of the UUID.
es: los siguientes 16 bits del UUID.

source: The next 8 bits of the UUID.
es: los siguientes 8 bits del UUID.

source: The last 48 bits of the UUID.
es: los últimos 48 bits del UUID.

source: The 60-bit timestamp.
es: el timestamp de 60-bit.

source: The 14-bit sequence number.
es: el número de secuencia de 14-bit.

source: The UUID as a 32-character lowercase hexadecimal string.
es: El UUID como una cadena hexadecimal en minúsculas de 32 caracteres.

source: The UUID as a 128-bit integer.
es: El UUID como un entero de 128 bits.

source: The UUID as a URN as specified in :rfc:`4122`.
es: El UUID como URN como se especifica en :rfc:`4122`.

source: The UUID variant, which determines the internal layout of the UUID. This will be one of the constants :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, or :const:`RESERVED_FUTURE`.
es: La variante UUID, que determina la disposición interna del UUID. Esta será una de las constantes :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, o :const:`RESERVED_FUTURE`.

source: The UUID version number (1 through 5, meaningful only when the variant is :const:`RFC_4122`).
es: El número de versión UUID (del 1 al 5, significativo sólo cuando la variante es :const:`RFC_4122`).

source: An enumeration of :class:`SafeUUID` which indicates whether the platform generated the UUID in a multiprocessing-safe way.
es: Una enumeración de :class:`SafeUUID` que indica si la plataforma generó el UUID de forma segura para el multiprocesamiento.

source: The :mod:`uuid` module defines the following functions:
es: El módulo :mod:`uuid` define las siguientes funciones:

source: Get the hardware address as a 48-bit positive integer. The first time this runs, it may launch a separate program, which could be quite slow. If all attempts to obtain the hardware address fail, we choose a random 48-bit number with the multicast bit (least significant bit of the first octet) set to 1 as recommended in :rfc:`4122`. "Hardware address" means the MAC address of a network interface. On a machine with multiple network interfaces, universally administered MAC addresses (i.e. where the second least significant bit of the first octet is *unset*) will be preferred over locally administered MAC addresses, but with no other ordering guarantees.
es: Obtiene la dirección del hardware como un entero positivo de 48 bits. La primera vez que esto se ejecute, puede lanzar un programa separado, que podría ser bastante lento. Si todos los intentos de obtener la dirección de hardware fallan, elegimos un número aleatorio de 48 bits con el bit multicast (el bit menos significativo del primer octeto) puesto a 1 como se recomienda en :rfc:`4122`. "Dirección de hardware" significa la dirección MAC de una interfaz de red. En una máquina con múltiples interfaces de red, las direcciones MAC administradas universalmente (es decir, donde el segundo bit menos significativo del primer octeto es *unset*) se preferirán a las direcciones MAC administradas localmente, pero sin otras garantías de orden.

source: Universally administered MAC addresses are preferred over locally administered MAC addresses, since the former are guaranteed to be globally unique, while the latter are not.
es: Se prefieren las direcciones MAC administradas universalmente a las administradas localmente, ya que se garantiza que las primeras son únicas a nivel mundial, mientras que las segundas no lo son.

source: Generate a UUID from a host ID, sequence number, and the current time. If *node* is not given, :func:`getnode` is used to obtain the hardware address. If *clock_seq* is given, it is used as the sequence number; otherwise a random 14-bit sequence number is chosen.
es: Genera un UUID a partir de un ID de host, número de secuencia y la hora actual. Si no se da *node*, se usa :func:`getnode` para obtener la dirección del hardware. Si se da *clock_seq*, se utiliza como número de secuencia; de lo contrario se elige un número de secuencia aleatorio de 14 bits.

source: Generate a UUID based on the MD5 hash of a namespace identifier (which is a UUID) and a name (which is a :class:`bytes` object or a string that will be encoded using UTF-8).
es: Genera un UUID basado en el hash MD5 de un identificador de espacio de nombres (que es un UUID) y un nombre (que es un objeto :class:`bytes` o una cadena de caracteres que se codificará usando UTF-8).

source: Generate a random UUID.
es: Genera un UUID aleatorio.

source: Generate a UUID based on the SHA-1 hash of a namespace identifier (which is a UUID) and a name (which is a :class:`bytes` object or a string that will be encoded using UTF-8).
es: Genera un UUID basado en el hash SHA-1 de un identificador de espacio de nombres (que es un UUID) y un nombre (que es un objeto :class:`bytes` o una cadena de caracteres que se codificará usando UTF-8).

source: The :mod:`uuid` module defines the following namespace identifiers for use with :func:`uuid3` or :func:`uuid5`.
es: El módulo :mod:`uuuid` define los siguientes identificadores de espacios de nombres para su uso con :func:`uuid3` o :func:`uuuid5`.

source: When this namespace is specified, the *name* string is a fully qualified domain name.
es: Cuando se especifica este espacio de nombres, la cadena *name* es un nombre de dominio completamente calificado.

source: When this namespace is specified, the *name* string is a URL.
es: Cuando se especifica este espacio de nombres, la cadena *name* es una URL.

source: When this namespace is specified, the *name* string is an ISO OID.
es: Cuando se especifica este espacio de nombres, la cadena *name* es un OID ISO.

source: When this namespace is specified, the *name* string is an X.500 DN in DER or a text output format.
es: Cuando se especifica este espacio de nombres, la cadena *name* es un X.500 DN en DER o un formato de salida de texto.

source: The :mod:`uuid` module defines the following constants for the possible values of the :attr:`~UUID.variant` attribute:
es: El módulo :mod:`uuid` define las siguientes constantes para los posibles valores del atributo :attr:`~UUID.variant`:

source: Reserved for NCS compatibility.
es: Reservado para la compatibilidad con NCS.

source: Specifies the UUID layout given in :rfc:`4122`.
es: Especifica el diseño del UUID dado en :rfc:`4122`.

source: Reserved for Microsoft compatibility.
es: Reservado para la compatibilidad con Microsoft.

source: Reserved for future definition.
es: Reservado para una futura definición.

source: :rfc:`4122` - A Universally Unique IDentifier (UUID) URN Namespace
es: :rfc:`4122` - Un espacio de nombres URN de identificador único universal (UUID)

source: This specification defines a Uniform Resource Name namespace for UUIDs, the internal format of UUIDs, and methods of generating UUIDs.
es: Esta especificación define un espacio de nombres de recursos uniforme para los UUID, el formato interno de los UUID y los métodos de generación de los UUID.

source: Command-Line Usage
es: Uso de la línea de comandos

source: The :mod:`uuid` module can be executed as a script from the command line.
es: El módulo :mod:`uuid` se puede ejecutar como un script desde la línea de comando.

source: The following options are accepted:
es: Se aceptan las siguientes opciones:

source: Show the help message and exit.
es: Muestra el mensaje de ayuda y libera la linea de comando.

source: Specify the function name to use to generate the uuid. By default :func:`uuid4` is used.
es: Especifica el nombre de la función que se utilizará para generar el uuid. Por defecto se utiliza :func:`uuid4`.

source: The namespace is a ``UUID``, or ``@ns`` where ``ns`` is a well-known predefined UUID addressed by namespace name. Such as ``@dns``, ``@url``, ``@oid``, and ``@x500``. Only required for :func:`uuid3` / :func:`uuid5` functions.
es: El espacio de nombres es un ``UUID`` o ``@ns`` donde ``ns`` es un UUID predefinido conocido dirigido por el nombre del espacio de nombres. Como ``@dns``, ``@url``, ``@oid`` y ``@x500``. Solo se requiere para las funciones :func:`uuid3` / :func:`uuid5`.

source: The name used as part of generating the uuid. Only required for :func:`uuid3` / :func:`uuid5` functions.
es: El nombre utilizado como parte de la generación del uuid. Solo se requiere para las funciones :func:`uuid3` / :func:`uuid5`.

source: Example
es: Ejemplo

source: Here are some examples of typical usage of the :mod:`uuid` module::
es: Aquí hay algunos ejemplos del uso típico del modulo :mod:`uuid`::

source: Command-Line Example
es: Ejemplo de línea de comandos

source: Here are some examples of typical usage of the :mod:`uuid` command line interface:
es: Aquí hay algunos ejemplos del uso típico del modulo :mod:`uuid`:
