Repository: python/python-docs-es
Catalog: library/venv.po
Languages: es

source: :mod:`venv` --- Creation of virtual environments
es: :mod:`venv` --- Creación de entornos virtuales

source: **Source code:** :source:`Lib/venv/`
es: **Código fuente:** :source:`Lib/venv/`

source: The :mod:`!venv` module supports creating lightweight "virtual environments", each with their own independent set of Python packages installed in their :mod:`site` directories. A virtual environment is created on top of an existing Python installation, known as the virtual environment's "base" Python, and may optionally be isolated from the packages in the base environment, so only those explicitly installed in the virtual environment are available.
es: El módulo :mod:`!venv` admite la creación de "entornos virtuales" ligeros, cada uno con su propio conjunto independiente de paquetes de Python instalados en sus directorios :mod:`site`. Se crea un entorno virtual sobre una instalación existente de Python, conocida como la "base" del entorno virtual de Python y, opcionalmente, se puede aislar de los paquetes en la base del entorno, así que solo están disponibles los instalados explícitamente en el entorno virtual.

source: When used from within a virtual environment, common installation tools such as `pip`_ will install Python packages into a virtual environment without needing to be told to do so explicitly.
es: Cuando se utilizan desde un entorno virtual, las herramientas de instalación habituales como `pip`_ instalarán paquetes de Python en un entorno virtual sin necesidad de que se les diga explícitamente que lo hagan.

source: See :pep:`405` for more background on Python virtual environments.
es: Ver :pep:`405` para más información sobre los entornos virtuales de Python.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#creating-a-virtual-environment>`__
es: `Guía del usuario de la Paquetería Python: Creación y uso de entornos virtuales <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#creating-a-virtual-environment>`__

source: Creating virtual environments
es: Creación de entornos virtuales

source: How venvs work
es: Cómo funcionan los venvs

source: When a Python interpreter is running from a virtual environment, :data:`sys.prefix` and :data:`sys.exec_prefix` point to the directories of the virtual environment, whereas :data:`sys.base_prefix` and :data:`sys.base_exec_prefix` point to those of the base Python used to create the environment. It is sufficient to check ``sys.prefix == sys.base_prefix`` to determine if the current interpreter is running from a virtual environment.
es: Cuando un intérprete de Python se ejecuta desde un entorno virtual, :data:`sys.prefix` y :data:`sys.exec_prefix` apuntan a los directorios del entorno virtual, mientras que :data:`sys.base_prefix` y :data:`sys.base_exec_prefix` apuntan a los de las base de Python que se utilizó para crear el entorno. Es suficiente verificar ``sys.prefix == sys.base_prefix`` para determinar si el intérprete actual se ejecuta desde un entorno virtual.

source: A virtual environment may be "activated" using a script in its binary directory (``bin`` on POSIX; ``Scripts`` on Windows). This will prepend that directory to your :envvar:`!PATH`, so that running :program:`!python` will invoke the environment's Python interpreter and you can run installed scripts without having to use their full path. The invocation of the activation script is platform-specific (:samp:`{<venv>}` must be replaced by the path to the directory containing the virtual environment):
es: Un entorno virtual se puede "activar" al usar un script en su directorio binario (``bin`` en POSIX; ``Scripts`` en Windows). Esto agregará ese directorio a tu :envvar:`!PATH`, de modo que al ejecutar :program:`!python` invocará el intérprete de Python del entorno y podrá ejecutar los scripts instalados sin tener que usar su ruta completa. La invocación del script de activación es específica de la plataforma (:samp:`{<venv>}` debe reemplazarse por la ruta del directorio que contiene el entorno virtual):

source: Platform
es: Plataforma

source: Command to activate virtual environment
es: Comando para activar el entorno virtual

source: :program:`!fish` and :program:`!csh` activation scripts.
es: Scripts de activación :program:`!fish` y :program:`!csh`.

source: PowerShell activation scripts installed under POSIX for PowerShell Core support.
es: Scripts de activación de PowerShell instalados en POSIX para compatibilidad con PowerShell Core.

source: You don't specifically *need* to activate a virtual environment, as you can just specify the full path to that environment's Python interpreter when invoking Python. Furthermore, all scripts installed in the environment should be runnable without activating it.
es: No *necesita* específicamente activar un entorno virtual, ya que puede solo especificar la ruta completa al intérprete de Python de ese entorno al invocar Python. Además, todos los scripts instalados en el entorno deben poder ejecutarse sin activarlo.

source: In order to achieve this, scripts installed into virtual environments have a "shebang" line which points to the environment's Python interpreter, i.e. :samp:`#!/{<path-to-venv>}/bin/python`. This means that the script will run with that interpreter regardless of the value of :envvar:`!PATH`. On Windows, "shebang" line processing is supported if you have the :ref:`launcher` installed. Thus, double-clicking an installed script in a Windows Explorer window should run it with the correct interpreter without the environment needing to be activated or on the :envvar:`!PATH`.
es: Para lograr esto, los scripts instalados en entornos virtuales tienen una línea "shebang" que apunta al intérprete de Python del entorno, en otras palabras, :samp:`#!/{<path-to-venv>}/bin/python`. Esto significa que el script se ejecutará con ese intérprete independientemente del valor de :envvar:`!PATH`. En Windows, se admite el procesamiento de la línea "shebang" si tiene el :ref:`launcher` instalado. Por lo tanto, hacer doble clic en un script instalado en una ventana del Explorador de Windows debería ejecutarlo con intérprete correcto sin la necesidad de activarse el entorno o el :envvar:`!PATH`.

source: When a virtual environment has been activated, the :envvar:`!VIRTUAL_ENV` environment variable is set to the path of the environment. Since explicitly activating a virtual environment is not required to use it, :envvar:`!VIRTUAL_ENV` cannot be relied upon to determine whether a virtual environment is being used.
es: Cuando se ha activado un entorno virtual, la variable de entorno :envvar:`!VIRTUAL_ENV` se establece en la ruta del entorno. Dado que no se requiere activar explícitamente una entorno virtual para usarla, no se puede confiar en :envvar:`!VIRTUAL_ENV` para determinar si se está usando un entorno virtual.

source: Because scripts installed in environments should not expect the environment to be activated, their shebang lines contain the absolute paths to their environment's interpreters. Because of this, environments are inherently non-portable, in the general case. You should always have a simple means of recreating an environment (for example, if you have a requirements file ``requirements.txt``, you can invoke ``pip install -r requirements.txt`` using the environment's ``pip`` to install all of the packages needed by the environment). If for any reason you need to move the environment to a new location, you should recreate it at the desired location and delete the one at the old location. If you move an environment because you moved a parent directory of it, you should recreate the environment in its new location. Otherwise, software installed into the environment may not work as expected.
es: Debido a que los scripts instalados en entornos no deben esperar a que el entorno se active, sus líneas shebang contienen las rutas absolutas a los intérpretes de su entorno. Debido a esto, los entornos son inherentemente no portables, en el caso general. Siempre debe tener un medio simple para recrear un entorno (por ejemplo, si tiene un archivo de requisitos ``requirements.txt``, puede invocar ``pip install -r requirements.txt`` al usar ``pip`` del entorno para instalar todos los paquetes que necesite el entorno). Si por alguna razón necesita mover el entorno a una nueva ubicación, debe recrearlo en la ubicación deseada y eliminar el de la ubicación anterior. Si mueve un entorno porque movió un directorio principal del mismo, debe recrear el entorno en su nueva ubicación. De lo contrario, el software instalado en el entorno puede no funcionar como se espera.

source: You can deactivate a virtual environment by typing ``deactivate`` in your shell. The exact mechanism is platform-specific and is an internal implementation detail (typically, a script or shell function will be used).
es: Puede desactivar un entorno virtual al escribir ``deactivate`` en el shell. El mecanismo exacto es específico de la plataforma y es un detalle de implementación interno (se usará normalmente una función de script o shell).

source: The high-level method described above makes use of a simple API which provides mechanisms for third-party virtual environment creators to customize environment creation according to their needs, the :class:`EnvBuilder` class.
es: El método de alto nivel descrito anteriormente utiliza una sencilla API que proporciona mecanismos para que les creadores de entornos virtuales de terceras/os puedan personalizar la creación de entornos según sus necesidades, la clase :class:`EnvBuilder`.

source: The :class:`EnvBuilder` class accepts the following keyword arguments on instantiation:
es: La clase :class:`EnvBuilder` acepta los siguientes argumentos de palabras clave en la instanciación:

source: ``system_site_packages`` -- a Boolean value indicating that the system Python site-packages should be available to the environment (defaults to ``False``).
es: ``system_site_packages`` -- un valor booleano que indica que los *site-packages* del sistema Python deben estar disponibles para el entorno (por defecto es ``False``).

source: ``clear`` -- a Boolean value which, if true, will delete the contents of any existing target directory, before creating the environment.
es: ``clear`` -- un valor booleano que, si es verdadero, borrará el contenido de cualquier directorio de destino existente, antes de crear el entorno.

source: ``symlinks`` -- a Boolean value indicating whether to attempt to symlink the Python binary rather than copying.
es: ``symlinks`` -- un valor booleano que indica si se debe intentar crear un enlace simbólico del binario de Python en lugar de copiarlo.

source: ``upgrade`` -- a Boolean value which, if true, will upgrade an existing environment with the running Python - for use when that Python has been upgraded in-place (defaults to ``False``).
es: ``upgrade`` -- un valor booleano que, si es verdadero, actualizará un entorno existente con el Python en ejecución -- para ser usado cuando ese Python haya sido actualizado in situ (por defecto es ``False``).

source: ``with_pip`` -- a Boolean value which, if true, ensures pip is installed in the virtual environment. This uses :mod:`ensurepip` with the ``--default-pip`` option.
es: ``with_pip`` -- un valor booleano que, si es verdadero, asegura que pip está instalado en el entorno virtual. Esto usa :mod:`ensurepip` con la opción ``--default-pip``.

source: ``prompt`` -- a String to be used after virtual environment is activated (defaults to ``None`` which means directory name of the environment would be used). If the special string ``"."`` is provided, the basename of the current directory is used as the prompt.
es: ``prompt`` -- una cadena de caracteres que se utilizará después de que se active el entorno virtual (el valor predeterminado es ``None``, lo que significa que se utilizaría el nombre del directorio del entorno). Si se proporciona la cadena especial ``"."``, el nombre base del directorio actual se utiliza como indicador.

source: ``upgrade_deps`` -- Update the base venv modules to the latest on PyPI
es: ``upgrade_deps`` -- actualiza los módulos venv base a lo último en PyPI

source: Added the ``with_pip`` parameter
es: Añadido el parámetro ``with_pip``

source: Added the ``prompt`` parameter
es: Añadido el parámetro ``prompt``

source: Added the ``upgrade_deps`` parameter
es: Se agregó el parámetro ``upgrade_deps``

source: Creators of third-party virtual environment tools will be free to use the provided :class:`EnvBuilder` class as a base class.
es: Las/Los creadoras/es de herramientas de entorno virtual de terceros/as serán libres de usar la clase :class:`EnvBuilder` proporcionada como clase base.

source: The returned env-builder is an object which has a method, ``create``:
es: El *env-builder* retornado es un objeto que tiene un método, ``create``:

source: Create a virtual environment by specifying the target directory (absolute or relative to the current directory) which is to contain the virtual environment. The ``create`` method will either create the environment in the specified directory, or raise an appropriate exception.
es: Crear un entorno virtual especificando el directorio de destino (de forma absoluta o relativa al directorio actual) que ha de contener el entorno virtual. El método ``create`` creará el entorno en el directorio especificado, o lanzará la correspondiente excepción.

source: The ``create`` method of the :class:`EnvBuilder` class illustrates the hooks available for subclass customization::
es: El método ``create`` de la clase :class:`EnvBuilder` ilustra los enlaces disponibles para la personalización de la subclase::

source: Each of the methods :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` and :meth:`post_setup` can be overridden.
es: Cada uno de los métodos :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` y :meth:`post_setup` pueden ser anulados.

source: Creates the environment directory and all necessary subdirectories that don't already exist, and returns a context object. This context object is just a holder for attributes (such as paths) for use by the other methods. If the :class:`EnvBuilder` is created with the arg ``clear=True``, contents of the environment directory will be cleared and then all necessary subdirectories will be recreated.
es: Crea el directorio del entorno y todos los subdirectorios necesarios que aún no existen, y retorna un objeto de contexto. Este objeto de contexto es solo un contenedor de atributos (como rutas) para que lo usen otros métodos. Si se crea :class:`EnvBuilder` con el argumento ``clear=True``, se borrará el contenido del directorio del entorno y luego se recrearán todos los subdirectorios necesarios.

source: The returned context object is a :class:`types.SimpleNamespace` with the following attributes:
es: El objeto de contexto que retorna es un :class:`types.SimpleNamespace` con los siguientes atributos:

source: ``env_dir`` - The location of the virtual environment. Used for ``__VENV_DIR__`` in activation scripts (see :meth:`install_scripts`).
es: ``env_dir`` - La ubicación del entorno virtual. Se usa para ``__VENV_DIR__`` en scripts de activación (ver :meth:`install_scripts`).

source: ``env_name`` - The name of the virtual environment. Used for ``__VENV_NAME__`` in activation scripts (see :meth:`install_scripts`).
es: ``env_name`` - El nombre del entorno virtual. Se usa para ``__VENV_NAME__`` en scripts de activación (ver :meth:`install_scripts`).

source: ``prompt`` - The prompt to be used by the activation scripts. Used for ``__VENV_PROMPT__`` in activation scripts (see :meth:`install_scripts`).
es: ``prompt`` - El prompt que utilizarán los scripts de activación. Se usa para ``__VENV_PROMPT__`` en scripts de activación (ver :meth:`install_scripts`).

source: ``executable`` - The underlying Python executable used by the virtual environment. This takes into account the case where a virtual environment is created from another virtual environment.
es: ``executable`` - El ejecutable de Python subyacente que se utiliza por el entorno virtual. Esto tiene en cuenta el caso donde se crea un entorno virtual a partir de otro entorno virtual.

source: ``inc_path`` - The include path for the virtual environment.
es: ``inc_path`` - La ruta de include para el entorno virtual.

source: ``lib_path`` - The purelib path for the virtual environment.
es: ``lib_path`` - La ruta de purelib para el entorno virtual.

source: ``bin_path`` - The script path for the virtual environment.
es: ``bin_path`` - La ruta del script para el entorno virtual.

source: ``bin_name`` - The name of the script path relative to the virtual environment location. Used for ``__VENV_BIN_NAME__`` in activation scripts (see :meth:`install_scripts`).
es: ``bin_name`` - El nombre de la ruta del script en relación con la ubicación del entorno virtual. Se usa para ``__VENV_BIN_NAME__`` en scripts de activación (ver :meth:`install_scripts`).

source: ``env_exe`` - The name of the Python interpreter in the virtual environment. Used for ``__VENV_PYTHON__`` in activation scripts (see :meth:`install_scripts`).
es: ``env_exe`` - El nombre del intérprete de Python en el entorno virtual. Se usa para ``__VENV_PYTHON__`` en scripts de activación (ver :meth:`install_scripts`).

source: ``env_exec_cmd`` - The name of the Python interpreter, taking into account filesystem redirections. This can be used to run Python in the virtual environment.
es: ``env_exec_cmd`` - El nombre del intérprete de Python, teniendo en cuenta las redirecciones del sistema de archivos. Se puede utilizar para ejecutar Python en el entorno virtual.

source: The attribute ``lib_path`` was added to the context, and the context object was documented.
es: Se agregó el atributo ``lib_path`` al contexto y se documentó el objeto de contexto.

source: The *venv* :ref:`sysconfig installation scheme <installation_paths>` is used to construct the paths of the created directories.
es: El :ref:`esquema de instalación de sysconfig <installation_paths>` de *venv* se utiliza para construir las rutas de los directorios creados.

source: Creates the ``pyvenv.cfg`` configuration file in the environment.
es: Crea el archivo de configuración ``pyvenv.cfg`` en el entorno.

source: Creates a copy or symlink to the Python executable in the environment. On POSIX systems, if a specific executable ``python3.x`` was used, symlinks to ``python`` and ``python3`` will be created pointing to that executable, unless files with those names already exist.
es: Crea una copia o enlace simbólico al ejecutable Python en el entorno. En los sistemas POSIX, si se usó un ejecutable específico ``python3.x``, se crearán enlaces simbólicos a ``python`` y ``python3`` apuntando a ese ejecutable, a menos que ya existan archivos con esos nombres.

source: Installs activation scripts appropriate to the platform into the virtual environment.
es: Instala los scripts de activación apropiados para la plataforma en el entorno virtual.

source: Upgrades the core venv dependency packages (currently ``pip`` and ``setuptools``) in the environment. This is done by shelling out to the ``pip`` executable in the environment.
es: Actualiza los paquetes de dependencia principales de venv (actualmente ``pip`` y ``setuptools``) en el entorno. Esto se hace desembolsando el ejecutable ``pip`` en el entorno.

source: A placeholder method which can be overridden in third party implementations to pre-install packages in the virtual environment or perform other post-creation steps.
es: Un método de marcador de posición que puede ser anulado en implementaciones de terceros/as para previo instalar paquetes en el entorno virtual o realizar otros pasos posteriores a la creación.

source: Windows now uses redirector scripts for ``python[w].exe`` instead of copying the actual binaries. In 3.7.2 only :meth:`setup_python` does nothing unless running from a build in the source tree.
es: Windows ahora usa scripts de redireccionamiento para ``python[w].exe`` en lugar de copiar los propios binarios. Para 3.7.2 solamente :meth:`setup_python` no hace nada a menos que se ejecute desde una compilación en el árbol de directorios fuente.

source: Windows copies the redirector scripts as part of :meth:`setup_python` instead of :meth:`setup_scripts`. This was not the case in 3.7.2. When using symlinks, the original executables will be linked.
es: Windows copia los scripts de redireccionamiento como parte de :meth:`setup_python` en lugar de :meth:`setup_scripts`. Este no era el caso para 3.7.2. Cuando se usan enlaces simbólicos, los ejecutables originales se enlazan.

source: In addition, :class:`EnvBuilder` provides this utility method that can be called from :meth:`setup_scripts` or :meth:`post_setup` in subclasses to assist in installing custom scripts into the virtual environment.
es: Además, :class:`EnvBuilder` proporciona este método de utilidad que puede ser llamado desde :meth:`setup_scripts` o :meth:`post_setup` en subclases para ayudar a instalar scripts personalizados en el entorno virtual.

source: *path* is the path to a directory that should contain subdirectories "common", "posix", "nt", each containing scripts destined for the bin directory in the environment. The contents of "common" and the directory corresponding to :data:`os.name` are copied after some text replacement of placeholders:
es: *path* es la ruta a un directorio que debería contener los subdirectorios "*common*", "*posix*", "*nt*", cada uno de los cuales contiene scripts destinados al directorio *bin* del entorno. El contenido de "*common*" y el directorio correspondiente a :data:`os.name` se copian después de algún reemplazo de texto de los marcadores de posición:

source: ``__VENV_DIR__`` is replaced with the absolute path of the environment directory.
es: ``__VENV_DIR__`` se sustituye por la ruta absoluta del directorio del entorno.

source: ``__VENV_NAME__`` is replaced with the environment name (final path segment of environment directory).
es: ``__VENV_NAME__`` se sustituye por el nombre del entorno (parte final de la ruta del directorio del entorno).

source: ``__VENV_PROMPT__`` is replaced with the prompt (the environment name surrounded by parentheses and with a following space)
es: ``__VENV_PROMPT__`` se sustituye por el *prompt* (el nombre del entorno entre paréntesis y con un espacio posterior)

source: ``__VENV_BIN_NAME__`` is replaced with the name of the bin directory (either ``bin`` or ``Scripts``).
es: ``__VENV_BIN_NAME__`` se sustituye con el nombre del directorio *bin* (ya sea ``bin`` o ``Scripts``).

source: ``__VENV_PYTHON__`` is replaced with the absolute path of the environment's executable.
es: ``__VENV_PYTHON__`` se sustituye con la ruta absoluta del ejecutable del entorno.

source: The directories are allowed to exist (for when an existing environment is being upgraded).
es: Se permite la existencia de los directorios (para cuando se está actualizando un entorno existente).

source: There is also a module-level convenience function:
es: También hay una función de conveniencia a nivel de módulo:

source: Create an :class:`EnvBuilder` with the given keyword arguments, and call its :meth:`~EnvBuilder.create` method with the *env_dir* argument.
es: Crea un :class:`EnvBuilder` con los argumentos de la palabra clave dada, y llama a su método :meth:`~EnvBuilder.create` con el argumento *env_dir*.

source: An example of extending ``EnvBuilder``
es: Un ejemplo de la extensión de ``EnvBuilder``
