Repository: python/python-docs-es
Catalog: library/venv.po
Languages: es

source: The following script shows how to extend :class:`EnvBuilder` by implementing a subclass which installs setuptools and pip into a created virtual environment::
es: El siguiente script muestra como extender :class:`EnvBuilder` implementando una subclase que instala setuptools y pip en un entorno virtual creado::

source: This script is also available for download `online <https://gist.github.com/vsajip/4673395>`_.
es: Este script está también disponible para su descarga `online <https://gist.github.com/vsajip/4673395>`_.
