Repository: python/python-docs-es
Catalog: library/wave.po
Languages: es

source: :mod:`wave` --- Read and write WAV files
es: :mod:`wave` --- Leer y escribir archivos WAV

source: **Source code:** :source:`Lib/wave.py`
es: **Código fuente:** :source:`Lib/wave.py`

source: The :mod:`wave` module defines the following function and exception:
es: El módulo :mod:`wave` define la siguiente función y excepción:

source: If *file* is a string, open the file by that name, otherwise treat it as a file-like object. *mode* can be:
es: Si *file* es una cadena, abra el archivo con ese nombre, de lo contrario trátelo como un objeto similar a un archivo. *mode* puede ser:

source: Read only mode.
es: Modo de solo lectura.

source: Write only mode.
es: Modo de solo escritura.

source: Note that it does not allow read/write WAV files.
es: Tenga en cuenta que no permite archivos WAV de lectura/escritura.

source: A *mode* of ``'rb'`` returns a :class:`Wave_read` object, while a *mode* of ``'wb'`` returns a :class:`Wave_write` object. If *mode* is omitted and a file-like object is passed as *file*, ``file.mode`` is used as the default value for *mode*.
es: Un *mode* de ``'rb'`` retorna un objeto :class:`Wave_read`, mientras que un *mode* de ``'wb'`` retorna un objeto :class:`Wave_write`. Si se omite *mode* y se pasa un objeto similar a un archivo como *file*, ``file.mode`` se usa como el valor predeterminado para *mode*.

source: Added support for unseekable files.
es: Se agregó soporte para archivos no encontrados.

source: An error raised when something is impossible because it violates the WAV specification or hits an implementation deficiency.
es: Error que se produce cuando algo es imposible porque viola la especificación WAV o alcanza una deficiencia de implementación.

source: Wave_read Objects
es: Los objetos *Wave_read*

source: Wave_read objects, as returned by :func:`.open`, have the following methods:
es: Los objetos *Wave_read*, tal como lo retorna :func:`.open`, tienen los siguientes métodos:

source: Close the stream if it was opened by :mod:`wave`, and make the instance unusable. This is called automatically on object collection.
es: Cierra la secuencia si fue abierta por :mod:`wave`, y hace que la instancia sea inutilizable. Esto es llamado automáticamente en la colección de objetos.

source: Returns number of audio channels (``1`` for mono, ``2`` for stereo).
es: Retorna el número de canales de audio (``1`` para mono, ``2`` para estéreo).

source: Returns sample width in bytes.
es: Retorna el ancho de la muestra en bytes.

source: Returns sampling frequency.
es: Retorna la frecuencia del muestreo.

source: Returns number of audio frames.
es: Retorna el número de cuadros del audio.

source: Returns compression type (``'NONE'`` is the only supported type).
es: Retorna el tipo de compresión (``'NONE'`` es el único tipo admitido).

source: Human-readable version of :meth:`getcomptype`. Usually ``'not compressed'`` parallels ``'NONE'``.
es: Versión legible para humanos de :meth:`getcomptype`. Generalmente ``'not compressed'`` significa ``'NONE'``.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object.
es: Lee y retorna como máximo *n* cuadros de audio, como un objeto :class:`bytes`.

source: Rewind the file pointer to the beginning of the audio stream.
es: Rebobina el puntero del archivo hasta el principio de la secuencia de audio.

source: The following two methods are defined for compatibility with the :mod:`aifc` module, and don't do anything interesting.
es: Los dos métodos siguientes se definen por compatibilidad con el módulo :mod:`aifc`, y no hacen nada interesante.

source: Returns ``None``.
es: Retorna ``None``.

source: Raise an error.
es: Lanza un error.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
es: Los dos métodos siguientes definen un término "posición" que es compatible entre ellos y, es dependiente de la implementación.

source: Set the file pointer to the specified position.
es: Establece el puntero del archivo en la posición especificada.

source: Return current file pointer position.
es: Retorna la posición actual del puntero del archivo.

source: Wave_write Objects
es: Los objetos *Wave_write*

source: Make sure *nframes* is correct, and close the file if it was opened by :mod:`wave`. This method is called upon object collection. It will raise an exception if the output stream is not seekable and *nframes* does not match the number of frames actually written.
es: Asegúrese de que *nframes* sea correcto y cierre el archivo si fue abierto por :mod:`wave`. Este método es invocado en la colección de objetos. Levantará una excepción si la secuencia de salida no se puede buscar y *nframes* no coinciden con el número de cuadros realmente escritos.

source: Set the number of channels.
es: Configure el número de canales.

source: Set the sample width to *n* bytes.
es: Establezca el ancho de la muestra en *n* bytes.

source: Set the frame rate to *n*.
es: Establezca la velocidad del cuadro en *n*.

source: A non-integral input to this method is rounded to the nearest integer.
es: Una entrada no-entera para este método se redondea al número entero más cercano.

source: Set the number of frames to *n*. This will be changed later if the number of frames actually written is different (this update attempt will raise an error if the output stream is not seekable).
es: Establezca el número de cuadros en *n*. Esto se cambiará más adelante si el número de cuadros realmente escritos es diferente (este intento de actualización levantará un error si no se encuentra la secuencia de salida).

source: Set the compression type and description. At the moment, only compression type ``NONE`` is supported, meaning no compression.
es: Establece el tipo de compresión y la descripción. Por el momento, solo se admite el tipo de compresión ``NONE``, lo que significa que no hay compresión.

source: Return current position in the file, with the same disclaimer for the :meth:`Wave_read.tell` and :meth:`Wave_read.setpos` methods.
es: Retorna la posición actual en el archivo, con el mismo descargo para los métodos :meth:`Wave_read.tell` y :meth:`Wave_read.setpos`.

source: Write audio frames, without correcting *nframes*.
es: Escribe cuadros de audio, sin corregir *nframes*.

source: Any :term:`bytes-like object` is now accepted.
es: Todo :term:`bytes-like object` ahora es aceptado.

source: Write audio frames and make sure *nframes* is correct. It will raise an error if the output stream is not seekable and the total number of frames that have been written after *data* has been written does not match the previously set value for *nframes*.
es: Escribe cuadros de audio y se asegura de que *nframes* sea correcto. Levantará un error si no se puede encontrar la secuencia de salida y si el número total de cuadros que se han escrito después de que se haya escrito *data* no coincide con el valor establecido previamente para *nframes*.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`, and any attempt to do so will raise :exc:`wave.Error`.
es: Tenga en cuenta que no es válido establecer ningún parámetro después de invocar a :meth:`writeframes` o :meth:`writeframesraw`, y cualquier intento de hacerlo levantará :exc:`wave.Error`.
