Repository: python/python-docs-es
Catalog: library/wsgiref.po
Languages: es_es

source: The default implementation just uses the :attr:`error_status`, :attr:`error_headers`, and :attr:`error_body` attributes to generate an output page. Subclasses can override this to produce more dynamic error output.
es_es: La implementación por defecto sólo utiliza los atributos :attr:`error_status`, :attr:`error_headers` y :attr:`error_body` para generar una página de salida. Las subclases pueden sobrescribir éste para producir una salida de error dinámica mejor.

source: Note, however, that it's not recommended from a security perspective to spit out diagnostics to any old user; ideally, you should have to do something special to enable diagnostic output, which is why the default implementation doesn't include any.
es_es: Hay que tener en cuenta, sin embargo, que no se recomienda, desde una perspectiva de seguridad, mostrar información de diagnóstico a cualquier usuario antiguo. Idealmente, se debería hacer algo especial para activar la salida de información de diagnóstico, motivo por el que la implementación por defecto no incluye ninguna.

source: The HTTP status used for error responses. This should be a status string as defined in :pep:`3333`; it defaults to a 500 code and message.
es_es: El estado HTTP utilizado para las respuestas de error. Se debería utilizar una de las cadenas de estado definidas en :pep:`3333`. Por defecto es un código 500 y un mensaje.

source: The HTTP headers used for error responses. This should be a list of WSGI response headers (``(name, value)`` tuples), as described in :pep:`3333`. The default list just sets the content type to ``text/plain``.
es_es: Las cabeceras HTTP utilizadas por las respuestas de error. Debería tratarse de una lista de cabeceras de respuesta WSGI (tuplas ``(name, value)``), tal y como se describe en :pep:`3333`. La lista por defecto simplemente establece el tipo de contenido a ``text/plain``.

source: The error response body. This should be an HTTP response body bytestring. It defaults to the plain text, "A server error occurred. Please contact the administrator."
es_es: El cuerpo de la respuesta de error. Debería ser una cadena de bytes con el cuerpo de la respuesta HTTP. Por defecto contiene el texto plano *A server error occurred. Please contact the administrator.*

source: Methods and attributes for :pep:`3333`'s "Optional Platform-Specific File Handling" feature:
es_es: Métodos y atributos para la funcionalidad "Optional Platform-Specific File Handling" de :pep:`3333`:

source: A ``wsgi.file_wrapper`` factory, compatible with :class:`wsgiref.types.FileWrapper`, or ``None``. The default value of this attribute is the :class:`wsgiref.util.FileWrapper` class.
es_es: Una fábrica ``wsgi.file_wrapper`` compatible con :class:`wsgiref.types.FileWrapper`, o ``None``. El valor por defecto de este atributo es la clase :class:`wsgiref.util.FileWrapper`.

source: Override to implement platform-specific file transmission. This method is called only if the application's return value is an instance of the class specified by the :attr:`wsgi_file_wrapper` attribute. It should return a true value if it was able to successfully transmit the file, so that the default transmission code will not be executed. The default implementation of this method just returns a false value.
es_es: Sobrescribir para implementar la transmisión de ficheros específica para la plataforma. Este método se llama sólo si el valor de retorno de la aplicación es una instancia de la clase especificada por el atributo :attr:`wsgi_file_wrapper`. Debería retornar un valor cierto si fue capaz de transmitir correctamente el fichero, de modo que el código por defecto de transmisión no será ejecutado. La implementación por defecto de este método simplemente retorna un valor falso.

source: Miscellaneous methods and attributes:
es_es: Métodos y atributos varios:

source: This attribute should be set to a true value if the handler's :meth:`_write` and :meth:`_flush` are being used to communicate directly to the client, rather than via a CGI-like gateway protocol that wants the HTTP status in a special ``Status:`` header.
es_es: Este atributo debería establecerse a cierto si los métodos :meth:`_write` y :meth:`_flush` están siendo usados para comunicar directamente al cliente, en lugar de usar un protocolo de pasarela CGI que requiere el estado HTTP en una cabecera ``Status:`` especial.

source: This attribute's default value is true in :class:`BaseHandler`, but false in :class:`BaseCGIHandler` and :class:`CGIHandler`.
es_es: El valor por defecto de este atributo es cierto en :class:`BaseHandler`, pero en :class:`BaseCGIHandler` y :class:`CGIHandler` es falso.

source: If :attr:`origin_server` is true, this string attribute is used to set the HTTP version of the response set to the client. It defaults to ``"1.0"``.
es_es: Si :attr:`origin_server` es cierto, este atributo de tipo cadena se usa para establecer la versión HTTP de la respuesta enviada al cliente. Por defecto es ``"1.0"``.

source: Transcode CGI variables from ``os.environ`` to :pep:`3333` "bytes in unicode" strings, returning a new dictionary. This function is used by :class:`CGIHandler` and :class:`IISCGIHandler` in place of directly using ``os.environ``, which is not necessarily WSGI-compliant on all platforms and web servers using Python 3 -- specifically, ones where the OS's actual environment is Unicode (i.e. Windows), or ones where the environment is bytes, but the system encoding used by Python to decode it is anything other than ISO-8859-1 (e.g. Unix systems using UTF-8).
es_es: Transcodifica las variables CGI de ``os.environ`` a cadenas "bytes in unicode" definidas en :pep:`3333`, retornando un nuevo diccionario. Esta función se usa en :class:`CGIHandler` y :class:`IISCGIHandler` en lugar de usar directamente ``os.environ``, lo que no es necesariamente compatible con EWGI en todas las plataformas y servidores web usando Python 3 -- específicamente, aquellas en las que el entorno actual del sistema operativo es Unicode, p.e. Windows, o en las que el entorno está en bytes, pero la codificación del sistema usada por Python para descodificar lo es cualquier otro que ISO-8859-1, por ejemplo, sistemas UNIX que usen UTF-8.

source: If you are implementing a CGI-based handler of your own, you probably want to use this routine instead of just copying values out of ``os.environ`` directly.
es_es: Cuando se está implementando un gestor basado en CGI propio, probablemente se requiera usar esta rutina en lugar de sólo copiar directamente los valores de ``os.environ``.

source: :mod:`wsgiref.types` -- WSGI types for static type checking
es_es: :mod:`wsgiref.types` --- Tipos de WSGI para validadores estáticos de tipos

source: This module provides various types for static type checking as described in :pep:`3333`.
es_es: Este módulo provee varios tipos para validadores estáticos de tipos, como se describe en :pep:`3333`.

source: A :class:`typing.Protocol` describing `start_response() <https://peps.python.org/pep-3333/#the-start-response-callable>`_ callables (:pep:`3333`).
es_es: Un :class:`typing.Protocol` que describe los invocables `start_response() <https://peps.python.org/pep-3333/#the-start-response-callable>`_ (:pep:`3333`).

source: A type alias describing a WSGI environment dictionary.
es_es: Un alias de tipo que describe un diccionario de entorno WSGI.

source: A type alias describing a WSGI application callable.
es_es: Un alias de tipo que describe una aplicación WSGI invocable.

source: A :class:`typing.Protocol` describing a `WSGI Input Stream <https://peps.python.org/pep-3333/#input-and-error-streams>`_.
es_es: Un :class:`typing.Protocol` que describe un `flujo de entrada WSGI <https://peps.python.org/pep-3333/#input-and-error-streams>`_.

source: A :class:`typing.Protocol` describing a `WSGI Error Stream <https://peps.python.org/pep-3333/#input-and-error-streams>`_.
es_es: Un :class:`typing.Protocol` que describe un `flujo de error WSGI <https://peps.python.org/pep-3333/#input-and-error-streams>`_.

source: A :class:`typing.Protocol` describing a `file wrapper <https://peps.python.org/pep-3333/#optional-platform-specific-file-handling>`_. See :class:`wsgiref.util.FileWrapper` for a concrete implementation of this protocol.
es_es: Un :class:`typing.Protocol` que describe un `envoltorio de archivo <https://peps.python.org/pep-3333/#optional-platform-specific-file-handling>`_. Vea :class:`wsgiref.util.FileWrapper` para una implementación concreta de este protocolo.

source: Examples
es_es: Ejemplos

source: This is a working "Hello World" WSGI application::
es_es: Ésta es una aplicación WSGI "Hello World" que funciona:

source: Example of a WSGI application serving the current directory, accept optional directory and port number (default: 8000) on the command line::
es_es: Ejemplo de una aplicación WSGI que sirve el directorio actual, acepta un directorio opcional y un número de puerto (default: 8000) en la línea de comandos::
