Repository: python/python-docs-es
Catalog: library/wsgiref.po
Languages: es_es

source: You do not need to create instances of this class directly; they are automatically created as needed by :class:`WSGIServer` objects. You can, however, subclass this class and supply it as a *handler_class* to the :func:`make_server` function. Some possibly relevant methods for overriding in subclasses:
es_es: No es necesario crear instancias de esta clase directamente. Se crean automáticamente bajo demanda por objetos :class:`WSGIServer`. Sin embargo, se pueden crear subclases de esta clase y proveerlas como *handler_class* a la función :func:`make_server`. Algunos métodos posiblemente relevantes para sobreescribir en estas subclases:

source: Return a :data:`~wsgiref.types.WSGIEnvironment` dictionary for a request. The default implementation copies the contents of the :class:`WSGIServer` object's :attr:`base_environ` dictionary attribute and then adds various headers derived from the HTTP request. Each call to this method should return a new dictionary containing all of the relevant CGI environment variables as specified in :pep:`3333`.
es_es: Retorna un diccionario :data:`~wsgiref.types.WSGIEnvironment` para una petición. La implementación por defecto copia el contenido del diccionario atributo :attr:`base_environ` del objeto :class:`WSGIserver` y añade varias cabeceras derivadas de la petición HTTP. Cada llamada a este método debe retornar un nuevo diccionario con todas las variables de entorno CGI relevantes especificadas en :pep:`3333`.

source: Return the object that should be used as the ``wsgi.errors`` stream. The default implementation just returns ``sys.stderr``.
es_es: Retorna el objeto que debe usarse como el flujo de ``wsgi.errors``. La implementación por defecto retorna simplemente ``sys.stderr``.

source: Process the HTTP request. The default implementation creates a handler instance using a :mod:`wsgiref.handlers` class to implement the actual WSGI application interface.
es_es: Procesa la petición HTTP. La implementación por defecto crea una instancia gestora usando una clase :mod:`wsgiref.handlers` para implementar la interfaz de aplicación WSGI real.

source: :mod:`wsgiref.validate` --- WSGI conformance checker
es_es: :mod:`wsgiref.validate` --- Verificador de compatibilidad WSGI

source: When creating new WSGI application objects, frameworks, servers, or middleware, it can be useful to validate the new code's conformance using :mod:`wsgiref.validate`. This module provides a function that creates WSGI application objects that validate communications between a WSGI server or gateway and a WSGI application object, to check both sides for protocol conformance.
es_es: Al crear nuevos objetos aplicación WSGI, *frameworks*, servidores, o *middleware*, puede ser útil validar la compatibilidad del nuevo código usando :mod:`wsgiref.validate`. Este módulo ofrece una función que crea objetos de aplicación WSGI que validan las comunicaciones entre un servidor o *gateway* WSGI y un objeto de aplicación WSGI, para comprobar la compatibilidad del protocolo en ambos lados.

source: Note that this utility does not guarantee complete :pep:`3333` compliance; an absence of errors from this module does not necessarily mean that errors do not exist. However, if this module does produce an error, then it is virtually certain that either the server or application is not 100% compliant.
es_es: Hay que observar que esta utilidad no garantiza compatibilidad completa con :pep:`3333`. La ausencia de errores usando este módulo no implica que no existan errores. Sin embargo, si este módulo produce errores, implica que o el servidor o la aplicación no son 100% compatibles.

source: This module is based on the :mod:`paste.lint` module from Ian Bicking's "Python Paste" library.
es_es: Este módulo se basa en el módulo :mod:`paste.lint` de la librería *Python Paste* de *Ian Bicking*.

source: Wrap *application* and return a new WSGI application object. The returned application will forward all requests to the original *application*, and will check that both the *application* and the server invoking it are conforming to the WSGI specification and to :rfc:`2616`.
es_es: Envuelve *application* y retorna un nuevo objeto de aplicación WSGI. La aplicación retornada reenviará todas las peticiones a la *application* original y comprobará que tanto la *application* como el servidor que la llama son compatibles con la especificación WSGI y con :rfc:`2616`.

source: Any detected nonconformance results in an :exc:`AssertionError` being raised; note, however, that how these errors are handled is server-dependent. For example, :mod:`wsgiref.simple_server` and other servers based on :mod:`wsgiref.handlers` (that don't override the error handling methods to do something else) will simply output a message that an error has occurred, and dump the traceback to ``sys.stderr`` or some other error stream.
es_es: Cualquier incompatibilidad detectada provocará el lanzamiento de un :exc:`AssertionError`. Nótese que, sin embargo, cómo se gestionan estos errores depende del servidor. Por ejemplo, :mod:`wsgiref.simple_server` y otros servidores basados en :mod:`wsgiref.handlers`, que no sobreescriben los métodos de gestión de errores para hacer otras cosas, simplemente escribirán un mensaje de que el error ha ocurrido y volcarán la traza de error en ``sys.stderr`` o algún otro flujo de errores.

source: This wrapper may also generate output using the :mod:`warnings` module to indicate behaviors that are questionable but which may not actually be prohibited by :pep:`3333`. Unless they are suppressed using Python command-line options or the :mod:`warnings` API, any such warnings will be written to ``sys.stderr`` (*not* ``wsgi.errors``, unless they happen to be the same object).
es_es: Este *wrapper* puede también generar salidas usando el módulo :mod:`warnings` para señalar comportamientos que son cuestionables pero que no están realmente prohibidos por :pep:`3333`. A no ser que se suprima esta salida usando opciones de línea de comandos de Python o la API de :mod:`warnings`, cualquier aviso se escribirá en ``sys.stderr``, en lugar de en ``wsgi.errors``, aunque sean el mismo objeto.

source: :mod:`wsgiref.handlers` -- server/gateway base classes
es_es: :mod:`wsgiref.handlers` -- Clases base servidor/*gateway*

source: This module provides base handler classes for implementing WSGI servers and gateways. These base classes handle most of the work of communicating with a WSGI application, as long as they are given a CGI-like environment, along with input, output, and error streams.
es_es: Este módulo ofrece clases gestoras base para implementar servidores y *gateways* WSGI. Estas clases base gestionan la mayoría del trabajo de comunicarse con una aplicación WSGI, siempre que se les dé un entorno CGI, junto con una entrada, una salida, y un flujo de errores.

source: CGI-based invocation via ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` and ``os.environ``. This is useful when you have a WSGI application and want to run it as a CGI script. Simply invoke ``CGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
es_es: Invocación basada en CGI vía ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` y ``os.environ``. Esto es útil cuando se quiere ejecutar una aplicación WSGI como un script CGI. Simplemente es necesario invocar ``CGIHandler().run(app)``, donde ``app`` es el objeto de aplicación WSGI que se quiere invocar.

source: This class is a subclass of :class:`BaseCGIHandler` that sets ``wsgi.run_once`` to true, ``wsgi.multithread`` to false, and ``wsgi.multiprocess`` to true, and always uses :mod:`sys` and :mod:`os` to obtain the necessary CGI streams and environment.
es_es: Esta clase es una subclase de :class:`BaseCGIHandler` que establece ``wsgi.run_once`` a cierto, ``wsgi.multithread`` a falso, y ``wsgi.multiprocess`` a cierto, y siempre usa :mod:`sys` y :mod:`os` para obtener los flujos y entorno CGI necesarios.

source: A specialized alternative to :class:`CGIHandler`, for use when deploying on Microsoft's IIS web server, without having set the config allowPathInfo option (IIS>=7) or metabase allowPathInfoForScriptMappings (IIS<7).
es_es: Una alternativa especializada a :class:`CGIHandler`, para usar al desplegar en servidores web Microsoft IIS, sin establecer la opción de configuración ``allowPathInfo`` (IIS>=7) o la meta-base ``allowPathInfoForScriptMappings`` (IIS<7).

source: By default, IIS gives a ``PATH_INFO`` that duplicates the ``SCRIPT_NAME`` at the front, causing problems for WSGI applications that wish to implement routing. This handler strips any such duplicated path.
es_es: Por defecto, IIS entrega ``PATH_INFO`` que duplica ``SCRIPT_NAME`` al principio, causando problemas con aplicaciones WSGI que implementan enrutamiento. Este gestor elimina las partes duplicadas de la ruta.

source: IIS can be configured to pass the correct ``PATH_INFO``, but this causes another bug where ``PATH_TRANSLATED`` is wrong. Luckily this variable is rarely used and is not guaranteed by WSGI. On IIS<7, though, the setting can only be made on a vhost level, affecting all other script mappings, many of which break when exposed to the ``PATH_TRANSLATED`` bug. For this reason IIS<7 is almost never deployed with the fix (Even IIS7 rarely uses it because there is still no UI for it.).
es_es: IIS se puede configurar para pasar el ``PATH_INFO`` correcto, pero esto causa otro error donde ``PATH_TRANSLATED`` es incorrecto. Afortunadamente, esta variable rara vez se usa y no está garantizada por WSGI. Sin embargo, en IIS<7, la configuración solo se puede realizar en un nivel de vhost, lo que afecta a todas las demás asignaciones de scripts, muchas de las cuales se rompen cuando se exponen al error ``PATH_TRANSLATED``. Por esta razón, IIS<7 casi nunca se implementa con la solución (incluso IIS7 rara vez lo usa porque todavía no tiene una interfaz de usuario).

source: There is no way for CGI code to tell whether the option was set, so a separate handler class is provided. It is used in the same way as :class:`CGIHandler`, i.e., by calling ``IISCGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
es_es: No hay forma de que el código CGI detecte cuándo la opción está activada, por lo que se ofrece una clase gestora separada. Se usa de la misma forma que :class:`CGIHandler`, p.e. llamando a ``IISCGIHandler().run(app)``, donde ``app`` es el objeto aplicación WSGI que se desea invocar.

source: Similar to :class:`CGIHandler`, but instead of using the :mod:`sys` and :mod:`os` modules, the CGI environment and I/O streams are specified explicitly. The *multithread* and *multiprocess* values are used to set the ``wsgi.multithread`` and ``wsgi.multiprocess`` flags for any applications run by the handler instance.
es_es: Similar a :class:`CGIHandler`, pero en lugar de usar los módulos :mod:`sys` y :mod:`os`, el entorno CGI y los flujos de E/S se especifican explícitamente. Los valores *multithread* y *multiprocess* se pasan a las aplicaciones ejecutadas por la instancia de gestión como ``wsgi.multithread`` y ``wsgi.multiprocess``.

source: This class is a subclass of :class:`SimpleHandler` intended for use with software other than HTTP "origin servers". If you are writing a gateway protocol implementation (such as CGI, FastCGI, SCGI, etc.) that uses a ``Status:`` header to send an HTTP status, you probably want to subclass this instead of :class:`SimpleHandler`.
es_es: Esta clase es una subclase de :class:`SimpleHandler` para usarse con servidores HTTP que no reciben peticiones directas de Internet, *HTTP origin servers*. Al escribir una implementación de un protocolo de pasarela, como CGI, FastCGI, SCGI, etcétera, que use una cabecera ``Status:`` para enviar un estado HTTP, probablemente sea adecuado heredar de esta clase, en lugar de :class:`SimpleHandler`.

source: Similar to :class:`BaseCGIHandler`, but designed for use with HTTP origin servers. If you are writing an HTTP server implementation, you will probably want to subclass this instead of :class:`BaseCGIHandler`.
es_es: Similar a :class:`BaseCGIHandler` pero diseñada para usarse con servidores que reciban peticiones directamente de Internet, o *HTTP origin servers*. Al escribir una implementación de un servidor HTTP, probablemente prefiera heredar de esta clase en lugar de :class:`BaseCGIHandler`.

source: This class is a subclass of :class:`BaseHandler`. It overrides the :meth:`__init__`, :meth:`get_stdin`, :meth:`get_stderr`, :meth:`add_cgi_vars`, :meth:`_write`, and :meth:`_flush` methods to support explicitly setting the environment and streams via the constructor. The supplied environment and streams are stored in the :attr:`stdin`, :attr:`stdout`, :attr:`stderr`, and :attr:`environ` attributes.
es_es: Esta clase es una subclase de :class:`BaseHandler`. Sobreescribe los métodos :meth:`__init__`, :meth:`get_stdin`, :meth:`get_stderr`, :meth:`add_cgi_vars`, :meth:`_write` y :meth:`_flush` para soportar el uso explícito del entorno y los flujos a partir del constructor. El entorno y los flujos especificados se almacenan en los atributos :attr:`stdin`, :attr:`stdout`, :attr:`stderr` y :attr:`environ`.

source: The :meth:`~io.BufferedIOBase.write` method of *stdout* should write each chunk in full, like :class:`io.BufferedIOBase`.
es_es: El método :meth:`~io.BufferedIOBase.write` de *stdout* podría escribir cada fragmento de información completamente, como :class:`io.BufferedIOBase`.

source: This is an abstract base class for running WSGI applications. Each instance will handle a single HTTP request, although in principle you could create a subclass that was reusable for multiple requests.
es_es: Esta es una clase base abstracta para ejecutar aplicaciones WSGI. Cada instancia gestionará una sola petición HTTP, aunque en principio se podría crear una subclase reutilizable para múltiples peticiones.

source: :class:`BaseHandler` instances have only one method intended for external use:
es_es: Las instancias de :class:`BaseHandler` tiene un sólo método para uso externo:

source: Run the specified WSGI application, *app*.
es_es: Ejecuta la aplicación WSGI *app* indicada.

source: All of the other :class:`BaseHandler` methods are invoked by this method in the process of running the application, and thus exist primarily to allow customizing the process.
es_es: Todos los otros métodos de :class:`BaseHandler` se invocan por este método en el proceso de ejecutar la aplicación, es decir, existen principalmente para permitir personalizar el proceso.

source: The following methods MUST be overridden in a subclass:
es_es: Los métodos siguientes DEBEN sobrescribirse en una subclase:

source: Buffer the bytes *data* for transmission to the client. It's okay if this method actually transmits the data; :class:`BaseHandler` just separates write and flush operations for greater efficiency when the underlying system actually has such a distinction.
es_es: Enviar los bytes *data* para la transmisión al cliente. Es correcto que este método realmente transmita la información. La clase :class:`BaseHandler` simplemente separa las operaciones de escritura y liberación para una mayor eficiencia cuando el sistema subyacente realmente hace esa distinción.

source: Force buffered data to be transmitted to the client. It's okay if this method is a no-op (i.e., if :meth:`_write` actually sends the data).
es_es: Forzar la transmisión de los datos en el búfer al cliente. Es correcto si este método no es operativo, p.e., si :meth:`_write` realmente envía los datos.

source: Return an object compatible with :class:`~wsgiref.types.InputStream` suitable for use as the ``wsgi.input`` of the request currently being processed.
es_es: Retorna un objeto compatible con :class:`~wsgiref.types.InputStream`, apropiado para usar como ``wsgi.input`` de la petición en proceso actualmente.

source: Return an object compatible with :class:`~wsgiref.types.ErrorStream` suitable for use as the ``wsgi.errors`` of the request currently being processed.
es_es: Retorna un objeto compatible con :class:`~wsgiref.types.ErrorStream`, apropiado para usar como ``wsgi.errors`` de la petición en proceso actualmente.

source: Insert CGI variables for the current request into the :attr:`environ` attribute.
es_es: Inserta las variables CGI para la petición actual en el atributo :attr:`environ`.

source: Here are some other methods and attributes you may wish to override. This list is only a summary, however, and does not include every method that can be overridden. You should consult the docstrings and source code for additional information before attempting to create a customized :class:`BaseHandler` subclass.
es_es: A continuación se describen algunos métodos y atributos más que podría ser interesante sobrescribir. Esta lista es sólo un sumario, sin embargo, y no incluye cada método que puede ser sobrescrito. Conviene consultar las docstrings y el código fuente para obtener información adicional antes de intentar crear una subclase de :class:`BaseHandler` personalizada.

source: Attributes and methods for customizing the WSGI environment:
es_es: Atributos y métodos para personalizar el entorno WSGI:

source: The value to be used for the ``wsgi.multithread`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
es_es: El valor a usar en la variable de entorno ``wsgi.multithread``. Por defecto es cierto en :class:`BaseHandler`, pero puede tener un valor por defecto distinto (o establecerse en el constructor) en otras subclases.

source: The value to be used for the ``wsgi.multiprocess`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
es_es: El valor a usar en la variable de entorno ``wsgi.multiprocess``. Por defecto es cierto en :class:`BaseHandler`, pero puede tener un valor por defecto distinto (o establecerse en el constructor) en otras subclases.

source: The value to be used for the ``wsgi.run_once`` environment variable. It defaults to false in :class:`BaseHandler`, but :class:`CGIHandler` sets it to true by default.
es_es: El valor a usar en la variable de entorno ``wsgi.run_once``. Por defecto es falso en :class:`BaseHandler`, pero en :class:`CGIHandler` es cierto por defecto.

source: The default environment variables to be included in every request's WSGI environment. By default, this is a copy of ``os.environ`` at the time that :mod:`wsgiref.handlers` was imported, but subclasses can either create their own at the class or instance level. Note that the dictionary should be considered read-only, since the default value is shared between multiple classes and instances.
es_es: Las variables de entorno por defecto que se incluirán en el entorno WSGI de cada petición. Por defecto, es una copia de ``os.environ`` cuando se importa :mod:`wsgiref.handlers`, pero otras subclases pueden crear las suyas propias a nivel de clase o de instancia. Se debe tener en cuenta que el diccionario se debe considerar como de sólo lectura, ya que el valor por defecto se comparte entre múltiples clases e instancias.

source: If the :attr:`origin_server` attribute is set, this attribute's value is used to set the default ``SERVER_SOFTWARE`` WSGI environment variable, and also to set a default ``Server:`` header in HTTP responses. It is ignored for handlers (such as :class:`BaseCGIHandler` and :class:`CGIHandler`) that are not HTTP origin servers.
es_es: Si el atributo :attr:`origin_server` tiene valor, éste se usa para establecer el valor por defecto de la variable de entorno WSGI ``SERVER_SOFTWARE`` y un cabecera ``Server:`` por defecto en las respuestas HTTP. Las clases gestoras que no son *HTTP origin servers*, como :class:`BaseCGIHandler` y :class:`CGIHandler`, ignoran este atributo.

source: The term "Python" is replaced with implementation specific term like "CPython", "Jython" etc.
es_es: El término "Python" se reemplaza con el término específico correspondiente a la implementación del intérprete, como "CPython", "Jython", etc.

source: Return the URL scheme being used for the current request. The default implementation uses the :func:`guess_scheme` function from :mod:`wsgiref.util` to guess whether the scheme should be "http" or "https", based on the current request's :attr:`environ` variables.
es_es: Retorna el esquema usado en la URL para la petición actual. La implementación por defecto utiliza la función :func:`guess_scheme` de :mod:`wsgiref.util` para adivinar si el esquema debería ser "http" o "https", basándose en las variables de :attr:`environ` de la petición actual.

source: Set the :attr:`environ` attribute to a fully populated WSGI environment. The default implementation uses all of the above methods and attributes, plus the :meth:`get_stdin`, :meth:`get_stderr`, and :meth:`add_cgi_vars` methods and the :attr:`wsgi_file_wrapper` attribute. It also inserts a ``SERVER_SOFTWARE`` key if not present, as long as the :attr:`origin_server` attribute is a true value and the :attr:`server_software` attribute is set.
es_es: Establece el atributo :attr:`environ` a un entorno WSGI completo. La implementación por defecto utiliza todos los métodos y atributos anteriormente mencionados, más los métodos :meth:`get_stdin`, :meth:`get_stderr` y :meth:`add_cgi_vars`, y el atributo :attr:`wsgi_file_wrapper`. También incluye una clave ``SERVER_SOFTWARE`` si no existe, siempre y cuando el atributo :attr:`origin_server` tiene un valor válido y el atributo :attr:`server_software` está establecido.

source: Methods and attributes for customizing exception handling:
es_es: Métodos y atributos para personalizar el manejo de excepciones:

source: Log the *exc_info* tuple in the server log. *exc_info* is a ``(type, value, traceback)`` tuple. The default implementation simply writes the traceback to the request's ``wsgi.errors`` stream and flushes it. Subclasses can override this method to change the format or retarget the output, mail the traceback to an administrator, or whatever other action may be deemed suitable.
es_es: Envía la tupla *exc_info* al registro del servidor. *exc_info* es un tupla ``(type, value, traceback)``. La implementación por defecto simplemente escribe el seguimiento de la pila en el flujo ``wsgi.errors`` de la petición y lo vacía. Las subclases pueden sobrescribir éste método para cambiar el formato o redirigir la salida, enviar mensajes de correo con el seguimiento de pila a un administrador o cualquier otra acción que se considere adecuada.

source: The maximum number of frames to include in tracebacks output by the default :meth:`log_exception` method. If ``None``, all frames are included.
es_es: El máximo número de marcos a incluir en la salida de seguimientos de pilas por el método por defecto :meth:`log_exception`. Si vale ``None``, se incluyen todos los marcos.

source: This method is a WSGI application to generate an error page for the user. It is only invoked if an error occurs before headers are sent to the client.
es_es: Este método es una aplicación WSGI para generar una página de error para el usuario. Sólo se invoca si un error ocurre antes de enviar las cabeceras al cliente.

source: This method can access the current error using ``sys.exception()``, and should pass that information to *start_response* when calling it (as described in the "Error Handling" section of :pep:`3333`).
es_es: Este método puede acceder al error actual usando ``sys.exception()``, y debería pasar esa información a *start_response* cuando la llame (tal y como se describe en la sección "Error Handling" de :pep:`3333`).
