Repository: python/python-docs-es
Catalog: library/wsgiref.po
Languages: es_es

source: :mod:`wsgiref` --- WSGI Utilities and Reference Implementation
es_es: :mod:`wsgiref` --- Utilidades WSGI e implementación de referencia

source: **Source code:** :source:`Lib/wsgiref`
es_es: **Código fuente:** :source:`Lib/wsgiref`

source: The Web Server Gateway Interface (WSGI) is a standard interface between web server software and web applications written in Python. Having a standard interface makes it easy to use an application that supports WSGI with a number of different web servers.
es_es: La Interfaz de Pasarela del Servidor Web, o *Web Server Gateway Interface* en inglés (WSGI), es una interfaz estándar entre el servidor web y aplicaciones web escritas en Python. Con una interfaz estándar es más sencillo usar una aplicación que soporte WSGI con diferentes servidores web.

source: Only authors of web servers and programming frameworks need to know every detail and corner case of the WSGI design. You don't need to understand every detail of WSGI just to install a WSGI application or to write a web application using an existing framework.
es_es: Sólo los autores de servidores y frameworks web necesitan conocer cada detalle y caso límite del diseño WSGI. No es necesario conocer cada detalle de WSGI sólo para instalar o escribir una aplicación web usando un *framework* existente.

source: :mod:`wsgiref` is a reference implementation of the WSGI specification that can be used to add WSGI support to a web server or framework. It provides utilities for manipulating WSGI environment variables and response headers, base classes for implementing WSGI servers, a demo HTTP server that serves WSGI applications, types for static type checking, and a validation tool that checks WSGI servers and applications for conformance to the WSGI specification (:pep:`3333`).
es_es: :mod:`wsgiref` es una implementación de referencia de la especificación WSGI que se puede usar para añadir soporte WSGI a un servidor o *framework* web. Este módulo provee utilidades para manipular las variables de entorno WSGI y las cabeceras de respuesta, clases base para implementar servidores WSGI, un servidor HTTP de demostración que sirve aplicaciones WSGI, tipos para validadores estáticos de tipos, y una herramienta de validación que comprueba la compatibilidad de servidores y aplicaciones WSGI en base a la especificación :pep:`3333`.

source: See `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ for more information about WSGI, and links to tutorials and other resources.
es_es: Vea `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ para más información sobre WSGI, así como enlaces a tutoriales y otros recursos.

source: :mod:`wsgiref.util` -- WSGI environment utilities
es_es: :mod:`wsgiref.util` -- Utilidades de entorno WSGI

source: This module provides a variety of utility functions for working with WSGI environments. A WSGI environment is a dictionary containing HTTP request variables as described in :pep:`3333`. All of the functions taking an *environ* parameter expect a WSGI-compliant dictionary to be supplied; please see :pep:`3333` for a detailed specification and :data:`~wsgiref.types.WSGIEnvironment` for a type alias that can be used in type annotations.
es_es: Este módulo ofrece una variedad de funciones útiles para trabajar con entornos WSGI. Un entorno WSGI es un diccionario que contiene variables de la petición HTTP, descrito en :pep:`3333`. Todas las funciones que aceptan un parámetro *environ* esperan un diccionario compatible con WSGI. Por favor, consulte la especificación detallada en :pep:`3333`, y los alias de tipos que pueden usarse en las anotaciones de tipo en :data:`~wsgiref.types.WSGIEnvironment`.

source: Return a guess for whether ``wsgi.url_scheme`` should be "http" or "https", by checking for a ``HTTPS`` environment variable in the *environ* dictionary. The return value is a string.
es_es: Retorna una deducción del valor para ``wsgi.url_scheme`` que debería ser "http" o "https", buscando la variable de entorno ``HTTPS`` en el diccionario *environ*. El valor de retorno es una cadena.

source: This function is useful when creating a gateway that wraps CGI or a CGI-like protocol such as FastCGI. Typically, servers providing such protocols will include a ``HTTPS`` variable with a value of "1", "yes", or "on" when a request is received via SSL. So, this function returns "https" if such a value is found, and "http" otherwise.
es_es: Esta función es útil al crear un *gateway* que envuelve CGI o un protocolo similar como FastCGI. Habitualmente, los servidores que ofrecen estos protocolos incluyen una variable ``HTTPS`` con el valor "1", "yes", o "on" cuando reciben una petición vía SSL. Así, esta función retorna "https" si encuentra ese valor, o "http", en caso contrario.

source: Return the full request URI, optionally including the query string, using the algorithm found in the "URL Reconstruction" section of :pep:`3333`. If *include_query* is false, the query string is not included in the resulting URI.
es_es: Retorna la URI completa de la petición, opcionalmente la cadena de consulta, usando el algoritmo encontrado en la sección "URL Reconstruction" de :pep:`3333`. Si *include_query* es falso, la cadena de consulta no se incluye en la URI resultante.

source: Similar to :func:`request_uri`, except that the ``PATH_INFO`` and ``QUERY_STRING`` variables are ignored. The result is the base URI of the application object addressed by the request.
es_es: Similar a :func:`request_uri` excepto que se ignoran las variables ``PATH_INFO`` y ``QUERY_STRING``. El resultado es la URI base del objeto de aplicación indicado en la petición.

source: Shift a single name from ``PATH_INFO`` to ``SCRIPT_NAME`` and return the name. The *environ* dictionary is *modified* in-place; use a copy if you need to keep the original ``PATH_INFO`` or ``SCRIPT_NAME`` intact.
es_es: Desplaza un solo nombre de ``PATH_INFO`` a ``SCRIPT_NAME`` y retorna el nombre. Se modifica el diccionario *environ*, por lo que se deberá usar una copia si se quiere mantener ``PATH_INFO`` o ``SCRIPT_NAME`` intactos.

source: If there are no remaining path segments in ``PATH_INFO``, ``None`` is returned.
es_es: Si no quedan segmentos en ``PATH_INFO``, retornará ``None``.

source: Typically, this routine is used to process each portion of a request URI path, for example to treat the path as a series of dictionary keys. This routine modifies the passed-in environment to make it suitable for invoking another WSGI application that is located at the target URI. For example, if there is a WSGI application at ``/foo``, and the request URI path is ``/foo/bar/baz``, and the WSGI application at ``/foo`` calls :func:`shift_path_info`, it will receive the string "bar", and the environment will be updated to be suitable for passing to a WSGI application at ``/foo/bar``. That is, ``SCRIPT_NAME`` will change from ``/foo`` to ``/foo/bar``, and ``PATH_INFO`` will change from ``/bar/baz`` to ``/baz``.
es_es: Habitualmente, esta rutina se usa para procesar cada porción de la ruta del URI de la petición, por ejemplo, para usar la ruta como una serie de claves en un diccionario. Esta rutina modifica el entorno pasado para permitir invocar otra aplicación WSGI que esté localizada en la URI objetivo. Por ejemplo, si hay una aplicación WSGI en ``/foo``, y la ruta es ``/foo/bar/baz``, y la aplicación WSGI en ``/foo`` llama a :func:`shift_path_info`, recibirá la cadena "bar", y se actualizará el entorno para pasarlo a una aplicación WSGI en ``/foo/bar``. Es decir, ``SCRIPT_NAME`` cambiará de ``/foo`` a ``/foo/bar`` y ``PATH_INFO`` cambiará de ``/bar/baz`` a ``/baz``.

source: When ``PATH_INFO`` is just a "/", this routine returns an empty string and appends a trailing slash to ``SCRIPT_NAME``, even though empty path segments are normally ignored, and ``SCRIPT_NAME`` doesn't normally end in a slash. This is intentional behavior, to ensure that an application can tell the difference between URIs ending in ``/x`` from ones ending in ``/x/`` when using this routine to do object traversal.
es_es: Cuando ``PATH_INFO`` es únicamente "/", esta rutina retornará una cadena vacía y añadirá una barra final a ``SCRIPT_NAME``, incluso cuando normalmente los segmentos de ruta vacíos se ignoran y ``SCRIPT_NAME`` no acaba con una barra. Este comportamiento es intencional, para asegurar que una aplicación puede diferenciar entre URIs que acaban en ``/x`` de las que acaban en ``/x/`` cuando usan esta rutina para atravesar objetos.

source: Update *environ* with trivial defaults for testing purposes.
es_es: Actualiza *environ* con valores por defecto triviales con propósito de prueba.

source: This routine adds various parameters required for WSGI, including ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO``, and all of the :pep:`3333`\ -defined ``wsgi.*`` variables. It only supplies default values, and does not replace any existing settings for these variables.
es_es: Esta rutina añade varios parámetros requeridos por WSGI, incluyendo ``HTTP_POST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO``, y todas las variables ``wsgi.*`` definidas en :pep:`3333`. Sólo ofrece valores por defecto y no reemplaza ningún valor existente en esas variables.

source: This routine is intended to make it easier for unit tests of WSGI servers and applications to set up dummy environments. It should NOT be used by actual WSGI servers or applications, since the data is fake!
es_es: Esta rutina pretende facilitar la preparación de entornos ficticios para pruebas unitarias de servidores y aplicaciones WSGI. NO debería usarse en servidores y aplicaciones WSGI reales, ya que los valores son ficticios!

source: Example usage::
es_es: Ejemplo de uso::

source: In addition to the environment functions above, the :mod:`wsgiref.util` module also provides these miscellaneous utilities:
es_es: Además de las funciones de entorno previas, el módulo :mod:`wsgiref.util` también ofrece las siguientes utilidades varias:

source: Return ``True`` if 'header_name' is an HTTP/1.1 "Hop-by-Hop" header, as defined by :rfc:`2616`.
es_es: Retorna ``True`` si 'header_name' es una cabecera "Hop-by-Hop" HTTP/1.1, como se define en :rfc:`2616`.

source: A concrete implementation of the :class:`wsgiref.types.FileWrapper` protocol used to convert a file-like object to an :term:`iterator`. The resulting objects are :term:`iterable`\ s. As the object is iterated over, the optional *blksize* parameter will be repeatedly passed to the *filelike* object's :meth:`read` method to obtain bytestrings to yield. When :meth:`read` returns an empty bytestring, iteration is ended and is not resumable.
es_es: Una implementación concreta del protocolo :class:`wsgiref.types.FileWrapper` usado para convertir objetos de tipo archivo en un :term:`iterator`. Los objetos resultantes son :term:`iterable`\ s. A medida que se itera sobre el objeto, el parámetro opcional *blksize* se pasará repetidamente al método :meth:`read` del objeto archivo para obtener cadenas de bytes para entregar. Cuando :meth:`read` retorna una cadena de bytes vacía, la iteración finalizará y no se podrá reiniciar.

source: If *filelike* has a :meth:`close` method, the returned object will also have a :meth:`close` method, and it will invoke the *filelike* object's :meth:`close` method when called.
es_es: Si *filelike* tiene un método :meth:`close`, el objeto retornado también tendrá un método :meth:`close` que llamará al método :meth:`close` del objeto archivo subyacente.

source: Support for :meth:`__getitem__` method has been removed.
es_es: Se ha quitado el soporte para el método :meth:`sequence protocol <__getitem__>`.

source: :mod:`wsgiref.headers` -- WSGI response header tools
es_es: :mod:`wsgiref.headers` -- Herramientas para cabeceras de respuesta WSGI

source: This module provides a single class, :class:`Headers`, for convenient manipulation of WSGI response headers using a mapping-like interface.
es_es: Este módulo ofrece una sola clase, :class:`Headers`, para la manipulación de cabeceras de respuesta WSGI usando un interfaz de mapa.

source: Create a mapping-like object wrapping *headers*, which must be a list of header name/value tuples as described in :pep:`3333`. The default value of *headers* is an empty list.
es_es: Crea un objeto con interfaz de mapa envolviendo *headers*, que debe ser una lista de tuplas nombre/valor de las cabeceras, como se describe en :pep:`3333`. El valor por defecto de *headers* es una lista vacía.

source: :class:`Headers` objects support typical mapping operations including :meth:`__getitem__`, :meth:`get`, :meth:`__setitem__`, :meth:`setdefault`, :meth:`__delitem__` and :meth:`__contains__`. For each of these methods, the key is the header name (treated case-insensitively), and the value is the first value associated with that header name. Setting a header deletes any existing values for that header, then adds a new value at the end of the wrapped header list. Headers' existing order is generally maintained, with new headers added to the end of the wrapped list.
es_es: Los objetos :class:`Headers` soportan las operaciones de mapa habituales incluyendo :meth:`__getitem__`, :meth:`get`, :meth:`__setitem__`, :meth:`setdefault`, :meth:`__delitem__` y :meth:`__contains__`. Para cada uno de esos métodos, la clave es el nombre de la cabecera, sin distinción entre mayúsculas y minúsculas, y el valor es el primer valor asociado con el nombre de la cabecera. Establecer una cabecera borra cualquier valor previamente existente y añade un nuevo valor al final de la lista de cabeceras. En general, el orden de las cabeceras existentes se mantiene, con las nuevas cabeceras añadidas al final de la lista de cabeceras.

source: Unlike a dictionary, :class:`Headers` objects do not raise an error when you try to get or delete a key that isn't in the wrapped header list. Getting a nonexistent header just returns ``None``, and deleting a nonexistent header does nothing.
es_es: A diferencia de un diccionario, los objetos :class:`Headers` no lanzan un error cuando se intenta obtener o eliminar una clave que no está en la lista de cabeceras subyacente. Al intentar obtener una clave inexistente simplemente se retornará ``None``, mientras que el intento de eliminación de una cabecera inexistente simplemente no tendrá ningún efecto.

source: :class:`Headers` objects also support :meth:`keys`, :meth:`values`, and :meth:`items` methods. The lists returned by :meth:`keys` and :meth:`items` can include the same key more than once if there is a multi-valued header. The ``len()`` of a :class:`Headers` object is the same as the length of its :meth:`items`, which is the same as the length of the wrapped header list. In fact, the :meth:`items` method just returns a copy of the wrapped header list.
es_es: Los objetos :class:`Headers` también soportan los métodos :meth:`keys`, :meth:`values`, y :meth:`items`. Las listas retornadas por :meth:`keys` y :meth:`items` pueden incluir la misma clave más de una vez si se trata de una cabecera de valor múltiple. La ``len()`` de un objeto :class:`Headers` es la misma que la longitud de sus :meth:`items`, que es la misma que la longitud de la lista de cabeceras envuelta. De hecho, el método :meth:`items` simplemente retorna una copia de la lista de cabeceras.

source: Calling ``bytes()`` on a :class:`Headers` object returns a formatted bytestring suitable for transmission as HTTP response headers. Each header is placed on a line with its value, separated by a colon and a space. Each line is terminated by a carriage return and line feed, and the bytestring is terminated with a blank line.
es_es: La llamada ``bytes()`` sobre un objeto :class:`Headers` retorna una cadena de bytes formateada y lista para su transmisión como cabeceras de respuesta HTTP. Cada cabecera se ubica en una línea con su valor separado por dos puntos y un espacio. Cada línea finaliza con un retorno de carro y un salto de línea, y la cadena de bytes finaliza con una línea en blanco.

source: In addition to their mapping interface and formatting features, :class:`Headers` objects also have the following methods for querying and adding multi-valued headers, and for adding headers with MIME parameters:
es_es: Además de la interfaz de mapa y las funcionalidades de formateado, los objetos :class:`Headers` también ofrecen los siguientes métodos para consultar y añadir cabeceras con múltiples valores, y para añadir cabeceras con parámetros MIME:

source: Return a list of all the values for the named header.
es_es: Retorna una lista de todos los valores para la cabecera indicada.

source: The returned list will be sorted in the order they appeared in the original header list or were added to this instance, and may contain duplicates. Any fields deleted and re-inserted are always appended to the header list. If no fields exist with the given name, returns an empty list.
es_es: La lista retornada tendrá los valores ordenados según la lista de cabeceras original o según se hayan añadido a esta instancia, y podrá contener duplicados. Cualquier campo eliminado y añadido de nuevo estará al final de la lista. Si no existen campos con el nombre indicado, retornará una lista vacía.

source: Add a (possibly multi-valued) header, with optional MIME parameters specified via keyword arguments.
es_es: Añade una cabecera, posiblemente de valor múltiple, con los parámetros MIME opcionales especificados vía argumentos por palabra clave.

source: *name* is the header field to add. Keyword arguments can be used to set MIME parameters for the header field. Each parameter must be a string or ``None``. Underscores in parameter names are converted to dashes, since dashes are illegal in Python identifiers, but many MIME parameter names include dashes. If the parameter value is a string, it is added to the header value parameters in the form ``name="value"``. If it is ``None``, only the parameter name is added. (This is used for MIME parameters without a value.) Example usage::
es_es: *name* es el nombre de la cabecera a añadir. Se pueden usar argumentos por palabra clave para establecer parámetros MIME para la cabecera. Cada parámetro debe ser una cadena o ``None``. Todos los guiones bajos en los nombres de parámetros se convierten en guiones, dado que los guiones son inválidos en identificadores Python y muchos parámetros MIME incluyen guiones. Si el valor del parámetro es una cadena, se añade a los parámetros del valor de la cabecera con la forma ``nombre=valor``. Si es ``None``, sólo se añade el nombre del parámetro, para reflejar parámetros MIME sin valor. Ejemplo de uso::

source: The above will add a header that looks like this::
es_es: El código anterior añadirá una cabecera como la siguiente::

source: *headers* parameter is optional.
es_es: El parámetro *headers* es opcional.

source: :mod:`wsgiref.simple_server` -- a simple WSGI HTTP server
es_es: :mod:`wsgiref.simple_server`-- Un servidor HTTP WSGI simple

source: This module implements a simple HTTP server (based on :mod:`http.server`) that serves WSGI applications. Each server instance serves a single WSGI application on a given host and port. If you want to serve multiple applications on a single host and port, you should create a WSGI application that parses ``PATH_INFO`` to select which application to invoke for each request. (E.g., using the :func:`shift_path_info` function from :mod:`wsgiref.util`.)
es_es: Este módulo implementa un servidor HTTP simple, basado en :mod:`http.server`, que sirve aplicaciones WSGI. Cada instancia del servidor sirve una aplicación WSGI simple en una máquina y puerto dados. Si se quiere servir múltiples aplicaciones en una misma máquina y puerto, se deberá crear una aplicación WSGI que analiza ``PATH_INFO`` para seleccionar qué aplicación invocar para cada petición. Por ejemplo, usando la función :func:`shift_path_info` de :mod:`wsgiref.util`.

source: Create a new WSGI server listening on *host* and *port*, accepting connections for *app*. The return value is an instance of the supplied *server_class*, and will process requests using the specified *handler_class*. *app* must be a WSGI application object, as defined by :pep:`3333`.
es_es: Crea un nuevo servidor WSGI que sirve en *host* y *port*, aceptando conexiones para *app*. El valor de retorno es una instancia de *server_class* y procesará peticiones usando *handler_class*. *app* debe ser un objeto aplicación WSGI, como se define en :pep:`3333`.

source: This function is a small but complete WSGI application that returns a text page containing the message "Hello world!" and a list of the key/value pairs provided in the *environ* parameter. It's useful for verifying that a WSGI server (such as :mod:`wsgiref.simple_server`) is able to run a simple WSGI application correctly.
es_es: Esta función es una pequeña pero completa aplicación WSGI que retorna una página de texto con el mensaje "Hello world!" y una lista de pares clave/valor obtenida del parámetro *environ*. Es útil para verificar que un servidor WSGI, como :mod:`wsgiref.simple_server`, es capaz de ejecutar una aplicación WSGI simple correctamente.

source: Create a :class:`WSGIServer` instance. *server_address* should be a ``(host,port)`` tuple, and *RequestHandlerClass* should be the subclass of :class:`http.server.BaseHTTPRequestHandler` that will be used to process requests.
es_es: Crea una instancia de :class:`WSGIServer`. *server_address* debe ser una tupla ``(máquina,puerto)`` y *RequestHandlerClass* debe ser la subclase de :class:`http.server.BaseHTTPRequestHandler` que se usará para procesar peticiones.

source: You do not normally need to call this constructor, as the :func:`make_server` function can handle all the details for you.
es_es: Normalmente, no es necesario invocar este constructor, ya que la función :func:`make_server` puede gestionar todos los detalles.

source: :class:`WSGIServer` is a subclass of :class:`http.server.HTTPServer`, so all of its methods (such as :meth:`serve_forever` and :meth:`handle_request`) are available. :class:`WSGIServer` also provides these WSGI-specific methods:
es_es: :class:`WSGIServer` es una subclase de :class:`http.server.HTTPServer`, por lo que todos sus métodos, como :meth:`serve_forever` y :meth:`handle_request`, están disponibles. :class:`WSGIServer` también ofrece los siguientes métodos específicos de WSGI:

source: Sets the callable *application* as the WSGI application that will receive requests.
es_es: Establece el invocable *application* como la aplicación WSGI que recibirá las peticiones.

source: Returns the currently set application callable.
es_es: Retorna la aplicación invocable actualmente establecida.

source: Normally, however, you do not need to use these additional methods, as :meth:`set_app` is normally called by :func:`make_server`, and the :meth:`get_app` exists mainly for the benefit of request handler instances.
es_es: Habitualmente, sin embargo, no es necesario usar estos métodos adicionales, ya que :meth:`set_app` se llama desde :func:`make_server` y :meth:`get_app` existe sobretodo para el beneficio de instancias del gestor de peticiones.

source: Create an HTTP handler for the given *request* (i.e. a socket), *client_address* (a ``(host,port)`` tuple), and *server* (:class:`WSGIServer` instance).
es_es: Crea un gestor HTTP para la *request* indicada (es decir un socket), *client_address (una tupla ``(máquina,puerto)``), y *server* (una instancia :class:`WSGIServer`).
