Repository: python/python-docs-es
Catalog: library/xml.po
Languages: es

source: XML Processing Modules
es: Módulos de procesamiento XML

source: **Source code:** :source:`Lib/xml/`
es: **Código fuente:** :source:`Lib/xml/`

source: Python's interfaces for processing XML are grouped in the ``xml`` package.
es: Interfaces de Python para procesar XML están agrupadas en el paquete ``xml``.

source: The XML modules are not secure against erroneous or maliciously constructed data. If you need to parse untrusted or unauthenticated data see the :ref:`xml-vulnerabilities` and :ref:`defused-packages` sections.
es: Los módulos XML no son seguros contra datos erróneos o construidos malintencionadamente. Si necesita analizar datos no confiables o no autenticados, consulte las secciones :ref:`xml-vulnerabilities` y :ref:`defused-packages`.

source: It is important to note that modules in the :mod:`xml` package require that there be at least one SAX-compliant XML parser available. The Expat parser is included with Python, so the :mod:`xml.parsers.expat` module will always be available.
es: Es importante tener en cuenta que los módulos del paquete :mod:`xml` requieren que haya al menos un analizador XML compatible con SAX disponible. El analizador Expat se incluye con Python, por lo que el módulo :mod:`xml.parsers.expat` siempre estará disponible.

source: The documentation for the :mod:`xml.dom` and :mod:`xml.sax` packages are the definition of the Python bindings for the DOM and SAX interfaces.
es: La documentación de los paquetes :mod:`xml.dom` y :mod:`xml.sax` es la definición de los enlaces de Python para las interfaces DOM y SAX.

source: The XML handling submodules are:
es: Los submódulos de manejo de XML son:

source: :mod:`xml.etree.ElementTree`: the ElementTree API, a simple and lightweight XML processor
es: :mod:`xml.etree.ElementTree`: la API ElementTree, un procesador de XML simple y ligero

source: :mod:`xml.dom`: the DOM API definition
es: :mod:`xml.dom`: la definición de la API DOM

source: :mod:`xml.dom.minidom`: a minimal DOM implementation
es: :mod:`xml.dom.minidom`: una implementación mínima de DOM

source: :mod:`xml.dom.pulldom`: support for building partial DOM trees
es: :mod:`xml.dom.pulldom`: soporte para la construcción de árboles DOM parciales

source: :mod:`xml.sax`: SAX2 base classes and convenience functions
es: :mod:`xml.sax`: clases base SAX2 y funciones de conveniencia

source: :mod:`xml.parsers.expat`: the Expat parser binding
es: :mod:`xml.parsers.expat`: el enlace del analizador Expat

source: XML vulnerabilities
es: Vulnerabilidades XML

source: The XML processing modules are not secure against maliciously constructed data. An attacker can abuse XML features to carry out denial of service attacks, access local files, generate network connections to other machines, or circumvent firewalls.
es: Los módulos de procesamiento XML no son seguros contra datos construidos malintencionadamente. Un atacante puede abusar de las características XML para llevar a cabo ataques de denegación de servicio, acceder a archivos locales, generar conexiones de red a otras máquinas o eludir firewalls.

source: The following table gives an overview of the known attacks and whether the various modules are vulnerable to them.
es: En la tabla siguiente se ofrece una visión general de los ataques conocidos y si los distintos módulos son vulnerables a ellos.

source: kind
es: tipo

source: billion laughs
es: mil millones de risas

source: quadratic blowup
es: explosión cuadrática

source: external entity expansion
es: expansión de entidad externa

source: Safe (4)
es: Seguro (4)

source: Safe (1)
es: Seguro (1)

source: Safe (2)
es: Seguro (2)

source: Safe (3)
es: Seguro (3)

source: `DTD`_ retrieval
es: Recuperación de `DTD`_

source: Safe
es: Seguro

source: decompression bomb
es: bomba de descompresión

source: :mod:`xml.etree.ElementTree` doesn't expand external entities and raises a :exc:`ParserError` when an entity occurs.
es: :mod:`xml.etree.ElementTree` no expande entidades externas y genera un :exc:`ParserError` cuando se produce una entidad.

source: :mod:`xml.dom.minidom` doesn't expand external entities and simply returns the unexpanded entity verbatim.
es: :mod:`xml.dom.minidom` no expande entidades externas y simplemente devuelve la entidad no expandida literalmente.

source: :mod:`xmlrpclib` doesn't expand external entities and omits them.
es: :mod:`xmlrpclib` no expande entidades externas y las omite.

source: Since Python 3.7.1, external general entities are no longer processed by default.
es: Desde Python 3.7.1, las entidades generales externas ya no se procesan de forma predeterminada.

source: billion laughs / exponential entity expansion
es: mil millones de risas / expansión exponencial de entidad

source: The `Billion Laughs`_ attack -- also known as exponential entity expansion -- uses multiple levels of nested entities. Each entity refers to another entity several times, and the final entity definition contains a small string. The exponential expansion results in several gigabytes of text and consumes lots of memory and CPU time.
es: El ataque `Mil Millones de Risas`_, también conocido como expansión exponencial de entidades, utiliza varios niveles de entidades anidadas. Cada entidad hace referencia a otra entidad varias veces y la definición de entidad final contiene una cadena pequeña. La expansión exponencial da como resultado varios gigabytes de texto y consume mucha memoria y tiempo de CPU.

source: quadratic blowup entity expansion
es: expansión de entidad de explosión cuadrática

source: A quadratic blowup attack is similar to a `Billion Laughs`_ attack; it abuses entity expansion, too. Instead of nested entities it repeats one large entity with a couple of thousand chars over and over again. The attack isn't as efficient as the exponential case but it avoids triggering parser countermeasures that forbid deeply-nested entities.
es: Un ataque de explosión cuadrática es similar a un ataque de `Mil Millones de Risas`_; también abusa de la expansión de entidad. En lugar de entidades anidadas, repite una entidad grande con un par de miles de caracteres una y otra vez. El ataque no es tan eficaz como el caso exponencial, pero evita desencadenar contramedidas del analizador que prohíben entidades profundamente anidadas.

source: Entity declarations can contain more than just text for replacement. They can also point to external resources or local files. The XML parser accesses the resource and embeds the content into the XML document.
es: Las declaraciones de entidad pueden contener algo más que texto para su reemplazo. También pueden apuntar a recursos externos o archivos locales. El analizador XML tiene acceso al recurso e incrusta el contenido en el documento XML.

source: Some XML libraries like Python's :mod:`xml.dom.pulldom` retrieve document type definitions from remote or local locations. The feature has similar implications as the external entity expansion issue.
es: Algunas bibliotecas XML como :mod`xml.dom.pulldom` de Python recuperan definiciones de tipo de documento de ubicaciones remotas o locales. La característica tiene implicaciones similares a las del problema de expansión de entidades externas.

source: Decompression bombs (aka `ZIP bomb`_) apply to all XML libraries that can parse compressed XML streams such as gzipped HTTP streams or LZMA-compressed files. For an attacker it can reduce the amount of transmitted data by three magnitudes or more.
es: Las bombas de descompresión (también conocidas como `ZIP bomb`_) se aplican a todas las bibliotecas XML que pueden analizar secuencias XML comprimidas, como secuencias HTTP comprimidas con gzip o archivos comprimidos por LZMA. Para un atacante puede reducir la cantidad de datos transmitidos en magnitudes de tres o más.

source: The documentation for `defusedxml`_ on PyPI has further information about all known attack vectors with examples and references.
es: La documentación de `defusedxml`_ en PyPI tiene más información sobre todos los vectores de ataque conocidos con ejemplos y referencias.

source: The :mod:`defusedxml` and :mod:`defusedexpat` Packages
es: Paquetes :mod:`defusedxml` y :mod:`defusedexpat`

source: `defusedxml`_ is a pure Python package with modified subclasses of all stdlib XML parsers that prevent any potentially malicious operation. Use of this package is recommended for any server code that parses untrusted XML data. The package also ships with example exploits and extended documentation on more XML exploits such as XPath injection.
es: `defusedxml`_ es un paquete Python puro con subclases modificadas de todos los analizadores XML stdlib que impiden cualquier operación potencialmente malintencionada. Se recomienda el uso de este paquete para cualquier código de servidor que analice datos XML que no sean de confianza. El paquete también incluye ataques de ejemplo y documentación ampliada sobre más vulnerabilidades XML, como la inyección de XPath.

source: `defusedexpat`_ provides a modified libexpat and a patched :mod:`pyexpat` module that have countermeasures against entity expansion DoS attacks. The :mod:`defusedexpat` module still allows a sane and configurable amount of entity expansions. The modifications may be included in some future release of Python, but will not be included in any bugfix releases of Python because they break backward compatibility.
es: `defusedexpat`_ proporciona un libexpat modificado y un módulo :mod:`pyexpat` parcheado que tienen contramedidas contra ataques DoS de expansión de entidad. El módulo :mod:`defusedexpat` todavía permite una cantidad sensata y configurable de expansiones de entidades. Las modificaciones pueden incluirse en alguna versión futura de Python, pero no se incluirán en ninguna versión de corrección de errores de Python porque rompen la compatibilidad con versiones anteriores.
