Repository: python/python-docs-es
Catalog: library/xml.etree.elementtree.po
Languages: es

source: To collect the inner text of an element, see :meth:`itertext`, for example ``"".join(element.itertext())``.
es: Para recoger el texto interior de un elemento, véase :meth:`itertext`, por ejemplo ``"".join(element.itertext())``.

source: Applications may store arbitrary objects in these attributes.
es: Las aplicaciones pueden almacenar objetos arbitrarios en estos atributos.

source: A dictionary containing the element's attributes. Note that while the *attrib* value is always a real mutable Python dictionary, an ElementTree implementation may choose to use another internal representation, and create the dictionary only if someone asks for it. To take advantage of such implementations, use the dictionary methods below whenever possible.
es: Un diccionario que contiene los atributos del elemento. Ten en cuenta que aunque el valor *attrib* es siempre un diccionario mutable real de Python, una implementación de ElementTree puede elegir utilizar otra representación interna, y crear el diccionario sólo si alguien lo pide. Para aprovechar este tipo de implementaciones, utiliza los métodos de diccionario que aparecen a continuación siempre que sea posible.

source: The following dictionary-like methods work on the element attributes.
es: Los siguientes métodos tipo diccionario funcionan con los atributos de los elementos.

source: Resets an element. This function removes all subelements, clears all attributes, and sets the text and tail attributes to ``None``.
es: Restablece un elemento. Esta función elimina todos los sub-elementos, borra todos los atributos y establece los atributos de texto y cola como ``None``.

source: Gets the element attribute named *key*.
es: Obtiene el atributo del elemento llamado *key*.

source: Returns the attribute value, or *default* if the attribute was not found.
es: Retorna el valor del atributo, o *default* si el atributo no fue encontrado.

source: Returns the element attributes as a sequence of (name, value) pairs. The attributes are returned in an arbitrary order.
es: Retorna los atributos del elemento como una secuencia de pares (nombre, valor). Los atributos se retornan en un orden arbitrario.

source: Returns the elements attribute names as a list. The names are returned in an arbitrary order.
es: Retorna los nombres de los atributos de los elementos como una lista. Los nombres se retornan en un orden arbitrario.

source: Set the attribute *key* on the element to *value*.
es: Establecer el atributo *key* en el elemento a *value*.

source: The following methods work on the element's children (subelements).
es: Los siguientes métodos actúan sobre los hijos del elemento (sub-elementos).

source: Adds the element *subelement* to the end of this element's internal list of subelements. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
es: Añade el elemento *subelement* al final de la lista interna de sub-elementos de este elemento. Lanza :exc:`TypeError` si *subelement* no es un :class:`Element`.

source: Appends *subelements* from a sequence object with zero or more elements. Raises :exc:`TypeError` if a subelement is not an :class:`Element`.
es: Añade *subelements* de un objeto de secuencia con cero o más elementos. Lanza :exc:`TypeError` si un sub-elemento no es un :class:`Element`.

source: Finds the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns an element instance or ``None``. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
es: Encuentra el primer sub-elemento que coincide con *match*. *match* puede ser un nombre de etiqueta o un :ref:`path <elementtree-xpath>`. Retorna una instancia de elemento o ``None``. *namespaces* es un mapeo opcional del prefijo del espacio de nombres al nombre completo. Pasa ``''`` como prefijo para mover todos los nombres de etiquetas sin prefijo en la expresión al espacio de nombres dado.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns a list containing all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
es: Encuentra todos los sub-elementos coincidentes, por nombre de etiqueta o :ref:`path <elementtree-xpath>`. Retorna una lista que contiene todos los elementos coincidentes en el orden del documento. *namespaces* es un mapeo opcional del prefijo del espacio de nombres al nombre completo. Pasa ``''`` como prefijo para mover todos los nombres de etiquetas sin prefijo en la expresión al espacio de nombres dado.

source: Finds text for the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns the text content of the first matching element, or *default* if no element was found. Note that if the matching element has no text content an empty string is returned. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
es: Busca el texto del primer sub-elemento que coincida con *match*. *match* puede ser un nombre de etiqueta o un :ref:`path <elementtree-xpath>`. Retorna el contenido del texto del primer elemento que coincida, o *default* si no se encuentra ningún elemento. Tenga en cuenta que si el elemento coincidente no tiene contenido de texto se devuelve una cadena vacía. *namespaces* es un mapeo opcional del prefijo del espacio de nombres al nombre completo. Pasa ``''`` como prefijo para mover todos los nombres de etiquetas sin prefijo en la expresión al espacio de nombres dado.

source: Inserts *subelement* at the given position in this element. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
es: Inserta *subelement* en la posición dada en este elemento. Lanza :exc:`TypeError` si *subelement* no es un :class:`Element`.

source: Creates a tree :term:`iterator` with the current element as the root. The iterator iterates over this element and all elements below it, in document (depth first) order. If *tag* is not ``None`` or ``'*'``, only elements whose tag equals *tag* are returned from the iterator. If the tree structure is modified during iteration, the result is undefined.
es: Crea un árbol :term:`iterator` con el elemento actual como raíz. El iterador itera sobre este elemento y todos los elementos por debajo de él, en el orden del documento (profundidad primero). Si *tag* no es ``None`` o ``'*'``, sólo los elementos cuya etiqueta es igual a *tag* son retornados por el iterador. Si la estructura del árbol se modifica durante la iteración, el resultado es indefinido.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns an iterable yielding all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name.
es: Encuentra todos los subelementos que coinciden, por nombre de etiqueta o :ref:`ruta <elementtree-xpath>`. Retorna un iterable con todos los elementos coincidentes en el orden del documento. *namespaces* es un mapeo opcional del prefijo del espacio de nombres al nombre completo.

source: Creates a text iterator. The iterator loops over this element and all subelements, in document order, and returns all inner text.
es: Crea un iterador de texto. El iterador hace un bucle sobre este elemento y todos los subelementos, en el orden del documento, y retorna todo el texto interior.

source: Creates a new element object of the same type as this element. Do not call this method, use the :func:`SubElement` factory function instead.
es: Crea un nuevo objeto elemento del mismo tipo que este elemento. No llame a este método, utilice la función de fábrica :func:`SubElement` en su lugar.

source: Removes *subelement* from the element. Unlike the find\* methods this method compares elements based on the instance identity, not on tag value or contents.
es: Elimina el *subelement* del elemento. A diferencia de los métodos find\*, este método compara los elementos basándose en la identidad de la instancia, no en el valor de la etiqueta o el contenido.

source: :class:`Element` objects also support the following sequence type methods for working with subelements: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.
es: Los objetos :class:`Element` también soportan los siguientes métodos de tipo secuencia para trabajar con subelementos: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.

source: Caution: Elements with no subelements will test as ``False``. This behavior will change in future versions. Use specific ``len(elem)`` or ``elem is None`` test instead. ::
es: Precaución: Los elementos que no tengan subelementos serán evaluados como ``False``. Este comportamiento cambiará en futuras versiones. Utilizar en su lugar el test específico ``len(elem)`` o ``elem is None``. ::

source: Prior to Python 3.8, the serialisation order of the XML attributes of elements was artificially made predictable by sorting the attributes by their name. Based on the now guaranteed ordering of dicts, this arbitrary reordering was removed in Python 3.8 to preserve the order in which attributes were originally parsed or created by user code.
es: Antes de Python 3.8, el orden de serialización de los atributos XML de los elementos se hacía predecible artificialmente ordenando los atributos por su nombre. Basado en el ordenamiento -ahora garantizado- de los diccionarios, este reordenamiento arbitrario fue eliminado en Python 3.8 para preservar el orden en que los atributos fueron originalmente analizados o creados por el código del usuario.

source: In general, user code should try not to depend on a specific ordering of attributes, given that the `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ explicitly excludes the attribute order from conveying information. Code should be prepared to deal with any ordering on input. In cases where deterministic XML output is required, e.g. for cryptographic signing or test data sets, canonical serialisation is available with the :func:`canonicalize` function.
es: En general, el código del usuario debería intentar no depender de un orden específico de los atributos, dado que el `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ excluye explícitamente el orden de los atributos para transmitir información. El código debe estar preparado para hacer frente a cualquier orden en la entrada. En los casos en los que se requiere una salida XML determinista, por ejemplo, para la firma criptográfica o los conjuntos de datos de prueba, la serialización canónica está disponible con la función :func:`canonicalize`.

source: In cases where canonical output is not applicable but a specific attribute order is still desirable on output, code should aim for creating the attributes directly in the desired order, to avoid perceptual mismatches for readers of the code. In cases where this is difficult to achieve, a recipe like the following can be applied prior to serialisation to enforce an order independently from the Element creation::
es: En los casos en los que la salida canónica no es aplicable, pero un orden de atributos específico sigue siendo deseable en la salida, el código debe tratar de crear los atributos directamente en el orden deseado, para evitar desajustes perceptivos para los lectores del código. En los casos en que esto es difícil de lograr, una receta como la siguiente se puede aplicar antes de la serialización para hacer cumplir un orden independientemente de la creación de elementos::

source: ElementTree Objects
es: Objetos ElementTree

source: ElementTree wrapper class. This class represents an entire element hierarchy, and adds some extra support for serialization to and from standard XML.
es: Clase envoltorio de un ElementTree. Esta clase representa una jerarquía de elementos completa, y añade algún soporte extra para la serialización hacia y desde XML estándar.

source: *element* is the root element. The tree is initialized with the contents of the XML *file* if given.
es: *element* es el elemento raíz. El árbol se inicializa con el contenido del *file* XML si se da.

source: Replaces the root element for this tree. This discards the current contents of the tree, and replaces it with the given element. Use with care. *element* is an element instance.
es: Reemplaza el elemento raíz de este árbol. Esto descarta el contenido actual del árbol, y lo reemplaza con el elemento dado. Utilícelo con cuidado. *element* es una instancia de elemento.

source: Same as :meth:`Element.find`, starting at the root of the tree.
es: Igual que :meth:`Element.find`, empezando por la raíz del árbol.

source: Same as :meth:`Element.findall`, starting at the root of the tree.
es: Igual que :meth:`Element.findall`, empezando por la raíz del árbol.

source: Same as :meth:`Element.findtext`, starting at the root of the tree.
es: Igual que :meth:`Element.findtext`, empezando por la raíz del árbol.

source: Returns the root element for this tree.
es: Retorna el elemento raíz de este árbol.

source: Creates and returns a tree iterator for the root element. The iterator loops over all elements in this tree, in section order. *tag* is the tag to look for (default is to return all elements).
es: Crea y retorna un iterador de árbol para el elemento raíz. El iterador recorre todos los elementos de este árbol, en orden de sección. *tag* es la etiqueta a buscar (por defecto devuelve todos los elementos).

source: Same as :meth:`Element.iterfind`, starting at the root of the tree.
es: Igual que :meth:`Element.iterfind`, empezando por la raíz del árbol.

source: Loads an external XML section into this element tree. *source* is a file name or :term:`file object`. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns the section root element.
es: Carga una sección XML externa en este árbol de elementos. *source* es un nombre de archivo o un :term:`file object`. *parser* es una instancia opcional del analizador. Si no se da, se utiliza el analizador estándar :class:`XMLParser`. Retorna el elemento raíz de la sección.

source: Writes the element tree to a file, as XML. *file* is a file name, or a :term:`file object` opened for writing. *encoding* [1]_ is the output encoding (default is US-ASCII). *xml_declaration* controls if an XML declaration should be added to the file. Use ``False`` for never, ``True`` for always, ``None`` for only if not US-ASCII or UTF-8 or Unicode (default is ``None``). *default_namespace* sets the default XML namespace (for "xmlns"). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). The keyword-only *short_empty_elements* parameter controls the formatting of elements that contain no content. If ``True`` (the default), they are emitted as a single self-closed tag, otherwise they are emitted as a pair of start/end tags.
es: Escribe el árbol de elementos en un archivo, como XML. *file* es un nombre de archivo, o un :term:`file object` abierto para escritura. *encoding* [1]_ es la codificación de salida (por defecto es US-ASCII). *xml_declaration* controla si se debe añadir una declaración XML al archivo. Utilice ``False`` para nunca, ``True`` para siempre, ``None`` para sólo si no es US-ASCII o UTF-8 o Unicode (por defecto es ``None``). *default_namespace* establece el espacio de nombres XML por defecto (para "xmlns"). *method* es ``"xml"``, ``"html"`` o ``"text"`` (por defecto es ``"xml"``). El parámetro *short_empty_elements* controla el formato de los elementos sin contenido. Si es ``True`` (por defecto), se emiten como una sola etiqueta autocerrada, de lo contrario se emiten como un par de etiquetas de inicio/fin.

source: The output is either a string (:class:`str`) or binary (:class:`bytes`). This is controlled by the *encoding* argument. If *encoding* is ``"unicode"``, the output is a string; otherwise, it's binary. Note that this may conflict with the type of *file* if it's an open :term:`file object`; make sure you do not try to write a string to a binary stream and vice versa.
es: La salida es una cadena de caracteres (:class:`str`) o binaria (:class:`bytes`). Esto es controlado por el argumento *encoding*. Si *encoding* es ``unicode``, la salida es una cadena de caracteres; en caso contrario, es binaria. Tenga en cuenta que esto puede entrar en conflicto con el tipo de *file* si es un :term:`file object` abierto; asegúrese de no intentar escribir una cadena en un flujo binario y viceversa.

source: The :meth:`write` method now preserves the attribute order specified by the user.
es: El método :meth:`write` ahora conserva el orden de los atributos especificado por el usuario.

source: This is the XML file that is going to be manipulated::
es: Este es el archivo XML que será manipulado::

source: Example of changing the attribute "target" of every link in first paragraph::
es: Ejemplo de cambio del atributo "target" de cada enlace en el primer párrafo::

source: QName Objects
es: Objetos QName

source: QName wrapper. This can be used to wrap a QName attribute value, in order to get proper namespace handling on output. *text_or_uri* is a string containing the QName value, in the form {uri}local, or, if the tag argument is given, the URI part of a QName. If *tag* is given, the first argument is interpreted as a URI, and this argument is interpreted as a local name. :class:`QName` instances are opaque.
es: QName wrapper. Se puede utilizar para envolver un valor de atributo QName, con el fin de obtener un manejo adecuado del espacio de nombres en la salida. *text_or_uri* es una cadena de caracteres que contiene el valor QName, en la forma {uri}local, o, si se da el argumento tag, la parte URI de un QName. Si se da *tag*, el primer argumento se interpreta como un URI, y este argumento se interpreta como un nombre local. Las instancias de :class:`QName` son opacas.

source: TreeBuilder Objects
es: Objetos TreeBuilder

source: Generic element structure builder. This builder converts a sequence of start, data, end, comment and pi method calls to a well-formed element structure. You can use this class to build an element structure using a custom XML parser, or a parser for some other XML-like format.
es: Constructor genérico de estructuras de elementos. Este constructor convierte una secuencia de llamadas a los métodos start, data, end, comment y pi en una estructura de elementos bien formada. Puedes utilizar esta clase para construir una estructura de elementos utilizando un analizador XML personalizado, o un analizador para algún otro formato similar a XML.

source: *element_factory*, when given, must be a callable accepting two positional arguments: a tag and a dict of attributes. It is expected to return a new element instance.
es: *element_factory*, cuando se da, debe ser un callable que acepta dos argumentos posicionales: una etiqueta y un diccionario de atributos. Se espera que retorne una nueva instancia de elemento.

source: The *comment_factory* and *pi_factory* functions, when given, should behave like the :func:`Comment` and :func:`ProcessingInstruction` functions to create comments and processing instructions. When not given, the default factories will be used. When *insert_comments* and/or *insert_pis* is true, comments/pis will be inserted into the tree if they appear within the root element (but not outside of it).
es: Las funciones *comment_factory* y *pi_factory*, cuando se dan, deben comportarse como las funciones :func:`Comment` y :func:`ProcessingInstruction` para crear comentarios e instrucciones de procesamiento. Si no se dan, se utilizarán las fábricas por defecto. Cuando *insert_comments* y/o *insert_pis* es verdadero, los comentarios/pis se insertarán en el árbol si aparecen dentro del elemento raíz (pero no fuera de él).

source: Flushes the builder buffers, and returns the toplevel document element. Returns an :class:`Element` instance.
es: Vacía los buffers del constructor y retorna el elemento del documento de nivel superior. Retorna una instancia de :class:`Element`.

source: Adds text to the current element. *data* is a string. This should be either a bytestring, or a Unicode string.
es: Añade texto al elemento actual. *data* es una cadena. Debe ser una cadena de bytes o una cadena Unicode.

source: Closes the current element. *tag* is the element name. Returns the closed element.
es: Cierra el elemento actual. *tag* es el nombre del elemento. Retorna el elemento cerrado.

source: Opens a new element. *tag* is the element name. *attrs* is a dictionary containing element attributes. Returns the opened element.
es: Abre un nuevo elemento. *tag* es el nombre del elemento. *attrs* es un diccionario que contiene los atributos del elemento. Retorna el elemento abierto.

source: Creates a comment with the given *text*. If ``insert_comments`` is true, this will also add it to the tree.
es: Crea un comentario con el *texto* dado. Si ``insert_comments`` es verdadero, esto también lo añadirá al árbol.

source: Creates a comment with the given *target* name and *text*. If ``insert_pis`` is true, this will also add it to the tree.
es: Crea un comentario con el nombre *target* y el *texto* dados. Si ``insert_pis`` es verdadero, esto también lo añadirá al árbol.

source: In addition, a custom :class:`TreeBuilder` object can provide the following methods:
es: Además, un objeto :class:`TreeBuilder` personalizado puede proporcionar los siguientes métodos:

source: Handles a doctype declaration. *name* is the doctype name. *pubid* is the public identifier. *system* is the system identifier. This method does not exist on the default :class:`TreeBuilder` class.
es: Maneja una declaración de doctype. *name* es el nombre del doctype. *pubid* es el identificador público. *system* es el identificador del sistema. Este método no existe en la clase por defecto :class:`TreeBuilder`.

source: Is called whenever the parser encounters a new namespace declaration, before the ``start()`` callback for the opening element that defines it. *prefix* is ``''`` for the default namespace and the declared namespace prefix name otherwise. *uri* is the namespace URI.
es: Se llama cada vez que el analizador encuentra una nueva declaración de espacio de nombres, antes de la llamada de retorno ``start()`` para el elemento de apertura que lo define. *prefix* es ``''`` para el espacio de nombres por defecto y el nombre del prefijo del espacio de nombres declarado en caso contrario. *uri* es el URI del espacio de nombres.

source: Is called after the ``end()`` callback of an element that declared a namespace prefix mapping, with the name of the *prefix* that went out of scope.
es: Se llama después de la llamada de retorno ``end()`` de un elemento que declaró un mapeo de prefijo de espacio de nombres, con el nombre del *prefijo* que salió del ámbito.

source: A `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ writer. Arguments are the same as for the :func:`canonicalize` function. This class does not build a tree but translates the callback events directly into a serialised form using the *write* function.
es: Un escritor `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_. Los argumentos son los mismos que para la función :func:`canonicalize`. Esta clase no construye un árbol, sino que traduce los eventos de devolución de llamada directamente a una forma serializada utilizando la función *write*.

source: XMLParser Objects
es: Objetos XMLParser
