Repository: python/python-docs-es
Catalog: library/xml.etree.elementtree.po
Languages: es

source: In the option list above, "a set" refers to any collection or iterable of strings, no ordering is expected.
es: En la lista de opciones anterior, "un conjunto" se refiere a cualquier colección o iterable de cadenas, no se espera ningún orden.

source: Comment element factory. This factory function creates a special element that will be serialized as an XML comment by the standard serializer. The comment string can be either a bytestring or a Unicode string. *text* is a string containing the comment string. Returns an element instance representing a comment.
es: Fábrica de elementos de comentario. Esta función de fábrica crea un elemento especial que será serializado como un comentario XML por el serializador estándar. La cadena de comentario puede ser una cadena de bytes o una cadena Unicode. *text* es una cadena que contiene la cadena de comentario. Devuelve una instancia de elemento que representa un comentario.

source: Note that :class:`XMLParser` skips over comments in the input instead of creating comment objects for them. An :class:`ElementTree` will only contain comment nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
es: Tenga en cuenta que :class:`XMLParser` omite los comentarios en la entrada en lugar de crear objetos de comentario para ellos. Un :class:`ElementTree` sólo contendrá nodos de comentario si se han insertado en el árbol utilizando uno de los métodos :class:`Element`.

source: Writes an element tree or element structure to sys.stdout. This function should be used for debugging only.
es: Escribe un árbol de elementos o una estructura de elementos en sys.stdout. Esta función debe utilizarse únicamente para debugging.

source: The exact output format is implementation dependent. In this version, it's written as an ordinary XML file.
es: El formato de salida exacto depende de la implementación. En esta versión, se escribe como un archivo XML ordinario.

source: *elem* is an element tree or an individual element.
es: *elem* es un árbol de elementos o un elemento individual.

source: The :func:`dump` function now preserves the attribute order specified by the user.
es: La función :func:`dump` ahora preserva el orden de atributos especificado por el usuario.

source: Parses an XML section from a string constant. Same as :func:`XML`. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
es: Analiza una sección XML a partir de una constante de cadena. Igual que :func:`XML`. *text* es una cadena que contiene datos XML. *parser* es una instancia de parser opcional. Si no se da, se utiliza el analizador estándar :class:`XMLParser`. Devuelve una instancia de :class:`Element`.

source: Parses an XML document from a sequence of string fragments. *sequence* is a list or other sequence containing XML data fragments. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
es: Analiza un documento XML a partir de una secuencia de fragmentos de cadena de caracteres. *sequence* es una lista u otra secuencia que contiene fragmentos de datos XML. *parser* es una instancia de parser opcional. Si no se da, se utiliza el analizador estándar :class:`XMLParser`. Retorna una instancia de :class:`Element`.

source: Appends whitespace to the subtree to indent the tree visually. This can be used to generate pretty-printed XML output. *tree* can be an Element or ElementTree. *space* is the whitespace string that will be inserted for each indentation level, two space characters by default. For indenting partial subtrees inside of an already indented tree, pass the initial indentation level as *level*.
es: Añade espacios en blanco al subárbol para indentar el árbol visualmente. Esto puede utilizarse para generar una salida XML con una impresión bonita. *tree* puede ser un Element o ElementTree. *space* es la cadena de espacio en blanco que se insertará para cada nivel de indentación, dos caracteres de espacio por defecto. Para indentar subárboles parciales dentro de un árbol ya indentado, pase el nivel de indentación inicial como *level*.

source: Check if an object appears to be a valid element object. *element* is an element instance. Return ``True`` if this is an element object.
es: Comprueba si un objeto parece ser un objeto elemento válido. *element* es una instancia de elemento. Retorna ``True`` si se trata de un objeto elemento.

source: Parses an XML section into an element tree incrementally, and reports what's going on to the user. *source* is a filename or :term:`file object` containing XML data. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. *parser* must be a subclass of :class:`XMLParser` and can only use the default :class:`TreeBuilder` as a target. Returns an :term:`iterator` providing ``(event, elem)`` pairs.
es: Analiza una sección XML en un árbol de elementos de forma incremental, e informa al usuario de lo que ocurre. *source* es un nombre de archivo o un :term:`file object` que contiene datos XML. *events* es una secuencia de eventos para informar. Los eventos soportados son las cadenas ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` y ``"end-ns"`` (los eventos "ns" se utilizan para obtener información detallada del espacio de nombres). Si se omite *events*, sólo se informará de los eventos ``"end"``. *parser* es una instancia opcional de parser. Si no se da, se utiliza el analizador estándar de :class:`XMLParser`. *parser* debe ser una subclase de :class:`XMLParser` y sólo puede utilizar el :class:`TreeBuilder` por defecto como objetivo. Devuelve un :term:`iterator` que proporciona pares ``(event, elem)``.

source: Note that while :func:`iterparse` builds the tree incrementally, it issues blocking reads on *source* (or the file it names). As such, it's unsuitable for applications where blocking reads can't be made. For fully non-blocking parsing, see :class:`XMLPullParser`.
es: Tenga en cuenta que mientras :func:`iterparse` construye el árbol de forma incremental, emite lecturas de bloqueo en la *source* (o en el fichero que nombra). Por lo tanto, no es adecuado para aplicaciones en las que no se pueden realizar lecturas de bloqueo. Para un análisis completamente no bloqueante, véase :class:`XMLPullParser`.

source: :func:`iterparse` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
es: :func:`iterparse` sólo garantiza que ha visto el carácter ">" de una etiqueta de inicio cuando emite un evento "start", por lo que los atributos están definidos, pero el contenido de los atributos text y tail está indefinido en ese momento. Lo mismo ocurre con los hijos del elemento; pueden estar presentes o no.

source: If you need a fully populated element, look for "end" events instead.
es: Si necesita un elemento totalmente poblado, busque los eventos "end" en su lugar.

source: The *parser* argument.
es: El argumento *parser*.

source: The ``comment`` and ``pi`` events were added.
es: Los eventos ``comment`` y ``pi`` han sido añadidos.

source: Parses an XML section into an element tree. *source* is a filename or file object containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`ElementTree` instance.
es: Analiza una sección XML en un árbol de elementos. *source* es un nombre de archivo o un objeto de archivo que contiene datos XML. *parser* es una instancia de parser opcional. Si no se da, se utiliza el analizador estándar :class:`XMLParser`. Devuelve una instancia de :class:`ElementTree`.

source: PI element factory. This factory function creates a special element that will be serialized as an XML processing instruction. *target* is a string containing the PI target. *text* is a string containing the PI contents, if given. Returns an element instance, representing a processing instruction.
es: Fábrica de elementos PI. Esta función de fábrica crea un elemento especial que será serializado como una instrucción de procesamiento XML. *target* es una cadena que contiene el objetivo de PI. *text* es una cadena que contiene el contenido de PI, si se da. Devuelve una instancia de elemento, representando una instrucción de procesamiento.

source: Note that :class:`XMLParser` skips over processing instructions in the input instead of creating comment objects for them. An :class:`ElementTree` will only contain processing instruction nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
es: Tenga en cuenta que :class:`XMLParser` omite las instrucciones de procesamiento en la entrada en lugar de crear objetos de comentario para ellas. Un :class:`ElementTree` sólo contendrá nodos de instrucciones de procesamiento si se han insertado en el árbol utilizando uno de los métodos :class:`Element`.

source: Registers a namespace prefix. The registry is global, and any existing mapping for either the given prefix or the namespace URI will be removed. *prefix* is a namespace prefix. *uri* is a namespace uri. Tags and attributes in this namespace will be serialized with the given prefix, if at all possible.
es: Registra un prefijo de espacio de nombres. El registro es global, y cualquier asignación existente para el prefijo dado o el URI del espacio de nombres será eliminado. *prefix* es un prefijo de espacio de nombres. *uri* es una uri del espacio de nombres. Las etiquetas y los atributos de este espacio de nombres se serializarán con el prefijo dado, si es posible.

source: Subelement factory. This function creates an element instance, and appends it to an existing element.
es: Fábrica de sub-elementos. Esta función crea una instancia de elemento y la añade a un elemento existente.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *parent* is the parent element. *tag* is the subelement name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments. Returns an element instance.
es: El nombre del elemento, los nombres de los atributos y los valores de los atributos pueden ser cadenas de bytes o cadenas de caracteres Unicode. *parent* es el elemento padre. *tag* es el nombre del sub-elemento. *attrib* es un diccionario opcional que contiene los atributos del elemento. *extra* contiene atributos adicionales, dados como argumentos de palabras clave. Devuelve una instancia de elemento.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns an (optionally) encoded string containing the XML data.
es: Genera una representación de cadena de caracteres de un elemento XML, incluyendo todos los sub-elementos. *element* es una instancia de :class:`Element`. *encoding* [1]_ es la codificación de salida (por defecto es US-ASCII). Utilice ``encoding="unicode"`` para generar una cadena de caracteres Unicode (de lo contrario, se genera una cadena de bytes). *method* es ``"xml"``, ``"html"`` o ``"text"`` (por defecto es ``"xml"``). *xml_declaration*, *default_namespace* y *short_empty_elements* tienen el mismo significado que en :meth:`ElementTree.write`. Devuelve una cadena (opcionalmente) codificada que contiene los datos XML.

source: The *short_empty_elements* parameter.
es: El parámetro *short_empty_elements*.

source: The *xml_declaration* and *default_namespace* parameters.
es: Los parámetros *xml_declaration* y *default_namespace*.

source: The :func:`tostring` function now preserves the attribute order specified by the user.
es: La función :func:`tostring` ahora preserva el orden de atributos especificado por el usuario.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns a list of (optionally) encoded strings containing the XML data. It does not guarantee any specific sequence, except that ``b"".join(tostringlist(element)) == tostring(element)``.
es: Genera una representación de cadena de caracteres de un elemento XML, incluyendo todos los sub-elementos. *element* es una instancia de :class:`Element`. *encoding* [1]_ es la codificación de salida (por defecto es US-ASCII). Utilice ``encoding="unicode"`` para generar una cadena de caracteres Unicode (de lo contrario, se genera una cadena de bytes). *method* es ``"xml"``, ``"html"`` o ``"text"`` (por defecto es ``"xml"``). *xml_declaration*, *default_namespace* y *short_empty_elements* tienen el mismo significado que en :meth:`ElementTree.write`. Devuelve una lista de cadenas (opcionalmente) codificadas que contienen los datos XML. No garantiza ninguna secuencia específica, excepto que ``b"".join(tostringlist(element)) == tostring(element)``.

source: The :func:`tostringlist` function now preserves the attribute order specified by the user.
es: La función :func:`tostringlist` ahora preserva el orden de atributos especificado por el usuario.

source: Parses an XML section from a string constant. This function can be used to embed "XML literals" in Python code. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
es: Analiza una sección XML a partir de una constante de cadena de caracteres. Esta función puede utilizarse para incrustar "literales XML" en el código de Python. *text* es una cadena de caracteres que contiene datos XML. *parser* es una instancia de parser opcional. Si no se da, se utiliza el analizador estándar :class:`XMLParser`. Devuelve una instancia de :class:`Element`.

source: Parses an XML section from a string constant, and also returns a dictionary which maps from element id:s to elements. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns a tuple containing an :class:`Element` instance and a dictionary.
es: Analiza una sección XML a partir de una constante de cadena de caracteres, y también devuelve un diccionario que mapea los id:s de elementos a elementos. *text* es una cadena de caracteres que contiene datos XML. *parser* es una instancia de parser opcional. Si no se da, se utiliza el analizador estándar de :class:`XMLParser`. Devuelve una tupla que contiene una instancia de :class:`Element` y un diccionario.

source: XInclude support
es: Soporte de XInclude

source: This module provides limited support for `XInclude directives <https://www.w3.org/TR/xinclude/>`_, via the :mod:`xml.etree.ElementInclude` helper module. This module can be used to insert subtrees and text strings into element trees, based on information in the tree.
es: Este módulo proporciona un soporte limitado para las directivas `XInclude <https://www.w3.org/TR/xinclude/>`_, a través del módulo de ayuda :mod:`xml.etree.ElementInclude`. Este módulo puede utilizarse para insertar subárboles y cadenas de texto en árboles de elementos, basándose en la información del árbol.

source: Here's an example that demonstrates use of the XInclude module. To include an XML document in the current document, use the ``{http://www.w3.org/2001/XInclude}include`` element and set the **parse** attribute to ``"xml"``, and use the **href** attribute to specify the document to include.
es: Aquí hay un ejemplo que demuestra el uso del módulo XInclude. Para incluir un documento XML en el documento actual, utilice el elemento ``{http://www.w3.org/2001/XInclude}include`` y establezca el atributo **parse** como ``"xml"``, y utilice el atributo **href** para especificar el documento a incluir.

source: By default, the **href** attribute is treated as a file name. You can use custom loaders to override this behaviour. Also note that the standard helper does not support XPointer syntax.
es: Por defecto, el atributo **href** se trata como un nombre de archivo. Puede utilizar cargadores personalizados para anular este comportamiento. También tenga en cuenta que el ayudante estándar no soporta la sintaxis XPointer.

source: To process this file, load it as usual, and pass the root element to the :mod:`xml.etree.ElementTree` module:
es: Para procesar este archivo, cárguelo como de costumbre y pase el elemento raíz al módulo :mod:`xml.etree.ElementTree`:

source: The ElementInclude module replaces the ``{http://www.w3.org/2001/XInclude}include`` element with the root element from the **source.xml** document. The result might look something like this:
es: El módulo ElementInclude sustituye el elemento ``{http://www.w3.org/2001/XInclude}include`` por el elemento raíz del documento **source.xml**. El resultado podría ser algo así:

source: If the **parse** attribute is omitted, it defaults to "xml". The href attribute is required.
es: Si se omite el atributo **parse**, el valor por defecto es "xml". El atributo href es obligatorio.

source: To include a text document, use the ``{http://www.w3.org/2001/XInclude}include`` element, and set the **parse** attribute to "text":
es: Para incluir un documento de texto, utilice el elemento ``{http://www.w3.org/2001/XInclude}include`` y establezca el atributo **parse** como "text":

source: The result might look something like:
es: El resultado podría ser algo así:

source: Default loader. This default loader reads an included resource from disk. *href* is a URL. *parse* is for parse mode either "xml" or "text". *encoding* is an optional text encoding. If not given, encoding is ``utf-8``. Returns the expanded resource. If the parse mode is ``"xml"``, this is an ElementTree instance. If the parse mode is "text", this is a Unicode string. If the loader fails, it can return None or raise an exception.
es: Cargador por defecto. Este cargador por defecto lee un recurso incluido del disco. *href* es una URL. *parse* es para el modo de análisis "xml" o "text". *encoding* es una codificación de texto opcional. Si no se da, la codificación es ``utf-8``. Retorna el recurso expandido. Si el modo de análisis es ``"xml"``, es una instancia de ElementTree. Si el modo de análisis es "text", se trata de una cadena Unicode. Si el cargador falla, puede retornar None o lanzar una excepción.

source: This function expands XInclude directives. *elem* is the root element. *loader* is an optional resource loader. If omitted, it defaults to :func:`default_loader`. If given, it should be a callable that implements the same interface as :func:`default_loader`. *base_url* is base URL of the original file, to resolve relative include file references. *max_depth* is the maximum number of recursive inclusions. Limited to reduce the risk of malicious content explosion. Pass a negative value to disable the limitation.
es: Esta función expande las directivas XInclude. *elem* es el elemento raíz. *loader* es un cargador de recursos opcional. Si se omite, se utiliza por defecto :func:`default_loader`. Si se da, debe ser un callable que implemente la misma interfaz que :func:`default_loader`. *base_url* es la URL base del archivo original, para resolver las referencias relativas al archivo de inclusión. *max_depth* es el número máximo de inclusiones recursivas. Limitado para reducir el riesgo de explosión de contenido malicioso. Pase un valor negativo para desactivar la limitación.

source: Returns the expanded resource. If the parse mode is ``"xml"``, this is an ElementTree instance. If the parse mode is "text", this is a Unicode string. If the loader fails, it can return None or raise an exception.
es: Retorna el recurso expandido. Si el modo de análisis es ``"xml"``, se trata de una instancia de ElementTree. Si el modo de análisis es "text", se trata de una cadena Unicode. Si el cargador falla, puede retornar None o lanzar una excepción.

source: The *base_url* and *max_depth* parameters.
es: Los parámetros *base_url* y *max_depth*.

source: Element Objects
es: Objetos Element

source: Element class. This class defines the Element interface, and provides a reference implementation of this interface.
es: Clase Element. Esta clase define la interfaz Element, y provee una implementación de referencia de esta interfaz.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *tag* is the element name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments.
es: El nombre del elemento, los nombres de los atributos y los valores de los atributos pueden ser cadenas de bytes o cadenas Unicode. *tag* es el nombre del elemento. *attrib* es un diccionario opcional que contiene los atributos del elemento. *extra* contiene atributos adicionales, dados como argumentos de palabras clave.

source: A string identifying what kind of data this element represents (the element type, in other words).
es: Una cadena de caracteres que identifica qué tipo de datos representa este elemento (el tipo de elemento, en otras palabras).

source: These attributes can be used to hold additional data associated with the element. Their values are usually strings but may be any application-specific object. If the element is created from an XML file, the *text* attribute holds either the text between the element's start tag and its first child or end tag, or ``None``, and the *tail* attribute holds either the text between the element's end tag and the next tag, or ``None``. For the XML data
es: Estos atributos pueden utilizarse para contener datos adicionales asociados al elemento. Sus valores suelen ser cadenas, pero pueden ser cualquier objeto específico de la aplicación. Si el elemento se crea a partir de un archivo XML, el atributo *text* contiene el texto entre la etiqueta inicial del elemento y su primera etiqueta hija o final, o ``None``, y el atributo *tail* contiene el texto entre la etiqueta final del elemento y la siguiente etiqueta, o ``None``. Para los datos XML

source: the *a* element has ``None`` for both *text* and *tail* attributes, the *b* element has *text* ``"1"`` and *tail* ``"4"``, the *c* element has *text* ``"2"`` and *tail* ``None``, and the *d* element has *text* ``None`` and *tail* ``"3"``.
es: el elemento *a* tiene ``None`` para los atributos *text* y *tail*, el elemento *b* tiene *text* ``"1"`` y *tail* ``"4"``, el elemento *c* tiene *text* ``"2"`` y *tail* ``None``, y el elemento *d* tiene *text* ``None`` y *tail* ``"3"``.
