Repository: python/python-docs-es
Catalog: library/xml.dom.po
Languages: es

source: The Python DOM interface provides the constants, but also expands the set of exceptions so that a specific exception exists for each of the exception codes defined by the DOM. The implementations must raise the appropriate specific exception, each of which carries the appropriate value for the :attr:`code` attribute.
es: La interfaz *DOM* de Python provee las constantes, pero también expande el conjunto de excepciones para que exista una excepción específica para cada uno de los códigos de excepción definidos por el *DOM*. Las implementaciones deben lanzar la excepción específica apropiada, cada uno de los cuales lleva el valor apropiado para el atributo :attr:`code`.

source: Base exception class used for all specific DOM exceptions. This exception class cannot be directly instantiated.
es: Clase base de excepción usada para todas las excepciones del *DOM* específicas. Esta clase de excepción no puede ser instanciada directamente.

source: Raised when a specified range of text does not fit into a string. This is not known to be used in the Python DOM implementations, but may be received from DOM implementations not written in Python.
es: Lanzado cuando un rango de texto específico no cabe en una cadena de caracteres. No se sabe si se usa in las implementación *DOM* de Python, pero puede ser recibido de otras implementaciones *DOM* que no hayan sido escritas en Python.

source: Raised when an attempt is made to insert a node where the node type is not allowed.
es: Lanzado cuando se intenta insertar un nodo donde el tipo de nodo no es permitido.

source: Raised when an index or size parameter to a method is negative or exceeds the allowed values.
es: Lanzado cuando un parámetro del índice o tamaño de un método es negativo o excede los valores permitidos.

source: Raised when an attempt is made to insert an :class:`Attr` node that is already present elsewhere in the document.
es: Lanzado cuando se intenta insertar un nodo :class:`Attr` que está presente en algún lado en el documento.

source: Raised if a parameter or an operation is not supported on the underlying object.
es: Lanzado si un parámetro o una operación no es soportada por el objeto subyacente.

source: This exception is raised when a string parameter contains a character that is not permitted in the context it's being used in by the XML 1.0 recommendation. For example, attempting to create an :class:`Element` node with a space in the element type name will cause this error to be raised.
es: Esta excepción es lanzada cuando un parámetro de cadena de caracteres contiene un carácter que no está permitido en el contexto que está siendo usado por la recomendación *XML 1.0*. Por ejemplo, intentar crear un nodo :class:`Element` con un espacio en el nombre del tipo de elemento causará que se lance este error.

source: Raised when an attempt is made to modify the type of a node.
es: Lanzado cuando se intenta modificar el tipo de un nodo.

source: Raised when an attempt is made to use an object that is not defined or is no longer usable.
es: Lanzado cuando se intenta usar un objeto que no está definido o ya no es usable.

source: If an attempt is made to change any object in a way that is not permitted with regard to the `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ recommendation, this exception is raised.
es: Si se intenta cambiar cualquier objeto de forma que no sea permitida con respecto a la recomendación `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_, esta excepción es lanzada.

source: Exception when a node does not exist in the referenced context. For example, :meth:`NamedNodeMap.removeNamedItem` will raise this if the node passed in does not exist in the map.
es: Excepción cuando un nodo no existe en el contexto referenciado. Por ejemplo, :meth:`NamedNodeMap.removeNamedItem` será lanzado si el nodo pasado no existe en el mapa.

source: Raised when the implementation does not support the requested type of object or operation.
es: Lanzado cuando la implementación no soporta el tipo requerido del objeto u operación.

source: This is raised if data is specified for a node which does not support data.
es: Es lanzado si se especifican datos para un nodo que no soporta datos.

source: Raised on attempts to modify an object where modifications are not allowed (such as for read-only nodes).
es: Lanzado cuando se intenta modificar un objeto donde las modificaciones no son permitidas (tal como los nodos de sólo-lectura).

source: Raised when an invalid or illegal string is specified.
es: Lanzado cuando se especifica una cadena de caracteres inválida o ilegal.

source: Raised when a node is inserted in a different document than it currently belongs to, and the implementation does not support migrating the node from one document to the other.
es: Lanzado cuando un nodo es insertado en un documento diferente al que este actualmente pertenece, y la implementación no soporta migrar el nodo de un documento a otro.

source: The exception codes defined in the DOM recommendation map to the exceptions described above according to this table:
es: Los códigos de excepción definidos en la recomendación del *DOM* se mapean a las excepciones descritas arriba de acuerdo a esta tabla:

source: Constant
es: Constante

source: Exception
es: Excepción

source: Conformance
es: Conformidad

source: This section describes the conformance requirements and relationships between the Python DOM API, the W3C DOM recommendations, and the OMG IDL mapping for Python.
es: Esta sección describe los requisitos de conformidad y las relaciones entre el *DOM API* de Python, las recomendaciones del *DOM* del *W3C*, y el mapeo *OMG IDL* para Python.

source: Type Mapping
es: Mapeo de tipos

source: The IDL types used in the DOM specification are mapped to Python types according to the following table.
es: Los tipos IDL usados en la especificación del *DOM* son mapeados a los tipos de tipos de Python de acuerdo a la siguiente tabla.

source: IDL Type
es: Tipo IDL

source: Python Type
es: Tipo en Python

source: ``bool`` or ``int``
es: ``bool`` o ``int``

source: ``str`` or ``bytes``
es: ``str`` o ``bytes``

source: Accessor Methods
es: Métodos de acceso (*accessor*)

source: The mapping from OMG IDL to Python defines accessor functions for IDL ``attribute`` declarations in much the way the Java mapping does. Mapping the IDL declarations ::
es: El mapeo de *OMG IDL* a python define funciones de acceso para las declaraciones del atributo *IDL* de la que misma forma en que el mapeo de Java lo hace. Mapear las declaraciones IDL:

source: yields three accessor functions: a "get" method for :attr:`someValue` (:meth:`_get_someValue`), and "get" and "set" methods for :attr:`anotherValue` (:meth:`_get_anotherValue` and :meth:`_set_anotherValue`). The mapping, in particular, does not require that the IDL attributes are accessible as normal Python attributes: ``object.someValue`` is *not* required to work, and may raise an :exc:`AttributeError`.
es: produce tres funciones de acceso: un método "get" para :attr:`someValue` (:meth:`_get_someValue`), y métodos "get" y "set" para :attr:`anotherValue` (:meth:`_get_anotherValue` y :meth:`_set_anotherValue`). El mapeado, en particular, no requiere que los atributos *IDL* sean accesibles como los atributos normales de Python: No es obligatorio que ``object.someValue`` funcione, y puede lanzar un :exc:`AttributeError`.

source: The Python DOM API, however, *does* require that normal attribute access work. This means that the typical surrogates generated by Python IDL compilers are not likely to work, and wrapper objects may be needed on the client if the DOM objects are accessed via CORBA. While this does require some additional consideration for CORBA DOM clients, the implementers with experience using DOM over CORBA from Python do not consider this a problem. Attributes that are declared ``readonly`` may not restrict write access in all DOM implementations.
es: El *DOM API* de Python, sin embargo, *si* requiere que los atributos de acceso normales funcionen. Esto significa que no es probable que los típicos sustitutos generados por compiladores de *IDL* en Python funcionen, y los objetos envoltorio (*wrapper*) pueden ser necesarios en el cliente si los objetos del *DOM* son accedidos mediante *CORBA*. Mientras que esto requiere consideraciones adicionales para clientes *DOM* en *CORBA*, los implementadores con experiencia que usen *DOM* por encima de *CORBA* desde Python no lo consideran un problema. Los atributos que se declaran ``readonly`` pueden no restringir el acceso de escritura en todas las implementaciones DOM.

source: In the Python DOM API, accessor functions are not required. If provided, they should take the form defined by the Python IDL mapping, but these methods are considered unnecessary since the attributes are accessible directly from Python. "Set" accessors should never be provided for ``readonly`` attributes.
es: En el *DOM API* de Python, las funciones de acceso no son obligatorias. Si se proveen, deben tomar la forma definida por el mapeo *IDL* de Python, pero estos métodos se consideran innecesarios debido a que los atributos son accesibles directamente desde Python. Nunca se deben proporcionar métodos de acceso (*accessor*) "Set" para los atributos ``readonly``.

source: The IDL definitions do not fully embody the requirements of the W3C DOM API, such as the notion of certain objects, such as the return value of :meth:`getElementsByTagName`, being "live". The Python DOM API does not require implementations to enforce such requirements.
es: Las definiciones de IDL no encarnan los requisitos del *DOM API* del *W3C* por completo, como las nociones de ciertos objetos, como el valor de retorno :meth:`getElementsByTagName`, siendo "live". El DOM API de Python no requiere que las implementaciones hagan cumplir tales requisitos.
