Repository: python/python-docs-es
Catalog: library/xml.etree.elementtree.po
Languages: es

source: :mod:`xml.etree.ElementTree` --- The ElementTree XML API
es: :mod:`xml.etree.ElementTree` --- La API XML de ElementTree

source: **Source code:** :source:`Lib/xml/etree/ElementTree.py`
es: **Código fuente:** :source:`Lib/xml/etree/ElementTree.py`

source: The :mod:`xml.etree.ElementTree` module implements a simple and efficient API for parsing and creating XML data.
es: El módulo :mod:`xml.etree.ElementTree` implementa una API simple y eficiente para parsear y crear datos XML.

source: This module will use a fast implementation whenever available.
es: Este módulo utilizará una implementación rápida siempre que esté disponible.

source: The :mod:`xml.etree.cElementTree` module is deprecated.
es: El módulo :mod:`xml.etree.cElementTree` es obsoleto.

source: The :mod:`xml.etree.ElementTree` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
es: El módulo :mod:`xml.etree.ElementTree` no es seguro contra datos construidos maliciosamente. Si necesita parsear datos no fiables o no autentificados, vea :ref:`xml-vulnerabilities`.

source: This is a short tutorial for using :mod:`xml.etree.ElementTree` (``ET`` in short). The goal is to demonstrate some of the building blocks and basic concepts of the module.
es: Este es un tutorial corto para usar :mod:`xml.etree.ElementTree` (``ET`` en resumen). El objetivo es demostrar algunos de los componentes y conceptos básicos del módulo.

source: XML tree and elements
es: Árbol y elementos XML

source: XML is an inherently hierarchical data format, and the most natural way to represent it is with a tree. ``ET`` has two classes for this purpose - :class:`ElementTree` represents the whole XML document as a tree, and :class:`Element` represents a single node in this tree. Interactions with the whole document (reading and writing to/from files) are usually done on the :class:`ElementTree` level. Interactions with a single XML element and its sub-elements are done on the :class:`Element` level.
es: XML es un formato de datos inherentemente jerárquico, y la forma más natural de representarlo es con un árbol. ``ET`` tiene dos clases para este propósito - :class:`ElementTree` representa todo el documento XML como un árbol, y :class:`Element` representa un solo nodo en este árbol. Las interacciones con todo el documento (leer y escribir en/desde archivos) se realizan normalmente en el nivel de :class:`ElementTree`. Las interacciones con un solo elemento XML y sus sub-elementos se realizan en el nivel :class:`Element`.

source: Parsing XML
es: Procesando XML

source: We'll be using the following XML document as the sample data for this section:
es: Usaremos el siguiente documento XML como los datos de muestra para esta sección:

source: We can import this data by reading from a file::
es: Podemos importar estos datos leyendo desde un archivo::

source: Or directly from a string::
es: O directamente desde una cadena de caracteres::

source: :func:`fromstring` parses XML from a string directly into an :class:`Element`, which is the root element of the parsed tree. Other parsing functions may create an :class:`ElementTree`. Check the documentation to be sure.
es: :func:`fromstring` analiza el XML de una cadena de caracteres directamente en un :class:`Element`, que es el elemento raíz del árbol analizado. Otras funciones de análisis pueden crear un :class:`ElementTree`. Compruebe la documentación para estar seguro.

source: As an :class:`Element`, ``root`` has a tag and a dictionary of attributes::
es: Como un :class:`Element`, ``root`` tiene una etiqueta y un diccionario de atributos::

source: It also has children nodes over which we can iterate::
es: También tiene nodos hijos sobre los cuales podemos iterar::

source: Children are nested, and we can access specific child nodes by index::
es: Los hijos están anidados, y podemos acceder a nodos hijos específicos por el índice::

source: Not all elements of the XML input will end up as elements of the parsed tree. Currently, this module skips over any XML comments, processing instructions, and document type declarations in the input. Nevertheless, trees built using this module's API rather than parsing from XML text can have comments and processing instructions in them; they will be included when generating XML output. A document type declaration may be accessed by passing a custom :class:`TreeBuilder` instance to the :class:`XMLParser` constructor.
es: No todos los elementos de la entrada XML acabarán siendo elementos del árbol analizado. Actualmente, este módulo omite cualquier comentario XML, instrucciones de procesamiento y declaraciones de tipo documento en la entrada. Sin embargo, los árboles construidos utilizando la API de este módulo, en lugar de analizar el texto XML, pueden contener comentarios e instrucciones de procesamiento, que se incluirán al generar la salida XML. Se puede acceder a una declaración de tipo documento pasando una instancia :class:`TreeBuilder` personalizada al constructor :class:`XMLParser`.

source: Pull API for non-blocking parsing
es: API de consulta para un procesamiento no bloqueante

source: Most parsing functions provided by this module require the whole document to be read at once before returning any result. It is possible to use an :class:`XMLParser` and feed data into it incrementally, but it is a push API that calls methods on a callback target, which is too low-level and inconvenient for most needs. Sometimes what the user really wants is to be able to parse XML incrementally, without blocking operations, while enjoying the convenience of fully constructed :class:`Element` objects.
es: La mayoría de las funciones de análisis proporcionadas por este módulo requieren que se lea todo el documento a la vez antes de retornar cualquier resultado. Es posible utilizar un :class:`XMLParser` y alimentar los datos en él de forma incremental, pero se trata de una *push* API que llama a métodos en un objetivo invocable, que es demasiado bajo nivel e inconveniente para la mayoría de las necesidades. A veces, lo que el usuario realmente quiere es ser capaz de analizar XML de forma incremental, sin bloquear las operaciones, mientras disfruta de la comodidad de los objetos :class:`Element` totalmente construidos.

source: The most powerful tool for doing this is :class:`XMLPullParser`. It does not require a blocking read to obtain the XML data, and is instead fed with data incrementally with :meth:`XMLPullParser.feed` calls. To get the parsed XML elements, call :meth:`XMLPullParser.read_events`. Here is an example::
es: La herramienta más potente para hacer esto es :class:`XMLPullParser`. No requiere una lectura de bloqueo para obtener los datos XML, y en su lugar se alimenta de datos de forma incremental con llamadas a :meth:`XMLPullParser.feed`. Para obtener los elementos XML analizados, llama a :meth:`XMLPullParser.read_events`. He aquí un ejemplo::

source: The obvious use case is applications that operate in a non-blocking fashion where the XML data is being received from a socket or read incrementally from some storage device. In such cases, blocking reads are unacceptable.
es: El caso de uso obvio es el de las aplicaciones que operan de forma no bloqueante, donde los datos XML se reciben de un socket o se leen de forma incremental desde algún dispositivo de almacenamiento. En estos casos, las lecturas bloqueantes son inaceptables.

source: Because it's so flexible, :class:`XMLPullParser` can be inconvenient to use for simpler use-cases. If you don't mind your application blocking on reading XML data but would still like to have incremental parsing capabilities, take a look at :func:`iterparse`. It can be useful when you're reading a large XML document and don't want to hold it wholly in memory.
es: Debido a su flexibilidad, :class:`XMLPullParser` puede ser un inconveniente para los casos de uso más simples. Si no te importa que tu aplicación se bloquee en la lectura de datos XML pero te gustaría tener capacidades de análisis incremental, echa un vistazo a :func:`iterparse`. Puede ser útil cuando estás leyendo un documento XML grande y no quieres mantenerlo completamente en memoria.

source: Finding interesting elements
es: Encontrando elementos interesantes

source: :class:`Element` has some useful methods that help iterate recursively over all the sub-tree below it (its children, their children, and so on). For example, :meth:`Element.iter`::
es: :class:`Element` tiene algunos métodos útiles que ayudan a iterar recursivamente sobre todo el sub-árbol por debajo de él (sus hijos, los hijos de sus hijos, y así sucesivamente). Por ejemplo, :meth:`Element.iter`::

source: :meth:`Element.findall` finds only elements with a tag which are direct children of the current element. :meth:`Element.find` finds the *first* child with a particular tag, and :attr:`Element.text` accesses the element's text content. :meth:`Element.get` accesses the element's attributes::
es: :meth:`Element.findall` encuentra sólo los elementos con una etiqueta que son hijos directos del elemento actual. :meth:`Element.find` encuentra el *primer* hijo con una etiqueta determinada, y :attr:`Element.text` accede al contenido de texto del elemento. :meth:`Element.get` accede a los atributos del elemento::

source: More sophisticated specification of which elements to look for is possible by using :ref:`XPath <elementtree-xpath>`.
es: Es posible especificar de forma más sofisticada qué elementos buscar utilizando :ref:`XPath <elementtree-xpath>`.

source: Modifying an XML File
es: Modificando un archivo XML

source: :class:`ElementTree` provides a simple way to build XML documents and write them to files. The :meth:`ElementTree.write` method serves this purpose.
es: :class:`ElementTree` proporciona una forma sencilla de construir documentos XML y escribirlos en archivos. El método :meth:`ElementTree.write` sirve para este propósito.

source: Once created, an :class:`Element` object may be manipulated by directly changing its fields (such as :attr:`Element.text`), adding and modifying attributes (:meth:`Element.set` method), as well as adding new children (for example with :meth:`Element.append`).
es: Una vez creado, un objeto :class:`Element` puede ser manipulado cambiando directamente sus campos (como :attr:`Element.text`), añadiendo y modificando atributos (método :meth:`Element.set`), así como añadiendo nuevos hijos (por ejemplo con :meth:`Element.append`).

source: Let's say we want to add one to each country's rank, and add an ``updated`` attribute to the rank element::
es: Digamos que queremos añadir uno al rango de cada país, y añadir un atributo ``updated`` al elemento rango::

source: Our XML now looks like this:
es: Nuestro XML tiene ahora este aspecto:

source: We can remove elements using :meth:`Element.remove`. Let's say we want to remove all countries with a rank higher than 50::
es: Podemos eliminar elementos utilizando :meth:`Element.remove`. Digamos que queremos eliminar todos los países con un rango superior a 50::

source: Note that concurrent modification while iterating can lead to problems, just like when iterating and modifying Python lists or dicts. Therefore, the example first collects all matching elements with ``root.findall()``, and only then iterates over the list of matches.
es: Tenga en cuenta que la modificación concurrente mientras se itera puede conducir a problemas, al igual que cuando se itera y modifica listas o diccionarios de Python. Por lo tanto, el ejemplo recoge primero todos los elementos coincidentes con ``root.findall()``, y sólo entonces itera sobre la lista de coincidencias.

source: Building XML documents
es: Construyendo documentos XML

source: The :func:`SubElement` function also provides a convenient way to create new sub-elements for a given element::
es: La función :func:`SubElement` también proporciona una forma cómoda de crear nuevos sub-elementos para un elemento dado::

source: Parsing XML with Namespaces
es: Procesando XML con espacio de nombres

source: If the XML input has `namespaces <https://en.wikipedia.org/wiki/XML_namespace>`__, tags and attributes with prefixes in the form ``prefix:sometag`` get expanded to ``{uri}sometag`` where the *prefix* is replaced by the full *URI*. Also, if there is a `default namespace <https://www.w3.org/TR/xml-names/#defaulting>`__, that full URI gets prepended to all of the non-prefixed tags.
es: Si la entrada XML tiene `espacio de nombres <https://es.wikipedia.org/wiki/Espacio_de_nombres_XML>`__, las etiquetas y los atributos con prefijos de la forma ``prefix:sometag`` se expanden a ``{uri}sometag`` donde el *prefix* se sustituye por el *URI* completo. Además, si hay un `espacio de nombre por defecto <https://www.w3.org/TR/xml-names/#defaulting>`__, ese URI completo se antepone a todas las etiquetas sin prefijo.

source: Here is an XML example that incorporates two namespaces, one with the prefix "fictional" and the other serving as the default namespace:
es: A continuación se muestra un ejemplo de XML que incorpora dos espacios de nombres, uno con el prefijo "fictional" y el otro que sirve como espacio de nombres por defecto:

source: One way to search and explore this XML example is to manually add the URI to every tag or attribute in the xpath of a :meth:`~Element.find` or :meth:`~Element.findall`::
es: Una forma de buscar y explorar este ejemplo XML es añadir manualmente el URI a cada etiqueta o atributo en el XPath de un :meth:`~Element.find` o :meth:`~Element.findall`::

source: A better way to search the namespaced XML example is to create a dictionary with your own prefixes and use those in the search functions::
es: Una mejor manera de buscar en el ejemplo de XML con espacio para nombres es crear un diccionario con sus propios prefijos y utilizarlos en las funciones de búsqueda::

source: These two approaches both output::
es: Estos dos enfoques dan como resultado::

source: XPath support
es: Soporte de XPath

source: This module provides limited support for `XPath expressions <https://www.w3.org/TR/xpath>`_ for locating elements in a tree. The goal is to support a small subset of the abbreviated syntax; a full XPath engine is outside the scope of the module.
es: Este módulo proporciona un soporte limitado para las expresiones `XPath <https://www.w3.org/TR/xpath>`_ para localizar elementos en un árbol. El objetivo es soportar un pequeño subconjunto de la sintaxis abreviada; un motor XPath completo está fuera del alcance del módulo.

source: Example
es: Ejemplo

source: Here's an example that demonstrates some of the XPath capabilities of the module. We'll be using the ``countrydata`` XML document from the :ref:`Parsing XML <elementtree-parsing-xml>` section::
es: A continuación se muestra un ejemplo que demuestra algunas de las capacidades de XPath del módulo. Utilizaremos el documento XML ``countrydata`` de la sección :ref:`Parsing XML <elementtree-parsing-xml>`::

source: For XML with namespaces, use the usual qualified ``{namespace}tag`` notation::
es: Para XML con espacios de nombre, use la notación calificada habitual ``{namespace}tag``::

source: Supported XPath syntax
es: Sintaxis XPath soportada

source: Syntax
es: Sintaxis

source: Meaning
es: Significado

source: Selects all child elements with the given tag. For example, ``spam`` selects all child elements named ``spam``, and ``spam/egg`` selects all grandchildren named ``egg`` in all children named ``spam``. ``{namespace}*`` selects all tags in the given namespace, ``{*}spam`` selects tags named ``spam`` in any (or no) namespace, and ``{}*`` only selects tags that are not in a namespace.
es: Selecciona todos los elementos hijos con la etiqueta dada. Por ejemplo, ``spam`` selecciona todos los elementos hijos llamados ``spam``, y ``spam/egg`` selecciona todos los nietos llamados ``egg`` en todos los hijos llamados ``spam``. ``{namespace}*`` selecciona todas las etiquetas en el espacio de nombres dado, ``{*}spam`` selecciona las etiquetas llamadas ``spam`` en cualquier (o ningún) espacio de nombres, y ``{}*`` sólo selecciona las etiquetas que no están en un espacio de nombres.

source: Support for star-wildcards was added.
es: Se ha añadido la posibilidad de utilizar comodines asterisco.

source: Selects all child elements, including comments and processing instructions. For example, ``*/egg`` selects all grandchildren named ``egg``.
es: Selecciona todos los elementos hijos, incluidos los comentarios y las instrucciones de procesamiento. Por ejemplo, ``*/egg`` selecciona todos los hijos llamados ``egg``.

source: Selects the current node. This is mostly useful at the beginning of the path, to indicate that it's a relative path.
es: Selecciona el nodo actual. Esto es útil sobre todo al principio de la ruta, para indicar que es una ruta relativa.

source: Selects all subelements, on all levels beneath the current element. For example, ``.//egg`` selects all ``egg`` elements in the entire tree.
es: Selecciona todos los sub-elementos, en todos los niveles por debajo del elemento actual. Por ejemplo, ``.//egg`` selecciona todos los elementos ``egg`` en todo el árbol.

source: Selects the parent element. Returns ``None`` if the path attempts to reach the ancestors of the start element (the element ``find`` was called on).
es: Selecciona el elemento padre. Retorna ``None`` si la ruta intenta llegar a los ancestros del elemento inicial (el elemento ``find`` fue invocado).

source: Selects all elements that have the given attribute.
es: Selecciona todos los elementos que tengan el atributo dado.

source: Selects all elements for which the given attribute has the given value. The value cannot contain quotes.
es: Selecciona todos los elementos para los que el atributo dado tiene el valor dado. El valor no puede contener comillas.

source: Selects all elements for which the given attribute does not have the given value. The value cannot contain quotes.
es: Selecciona todos los elementos para los que el atributo dado no tiene el valor dado. El valor no puede contener comillas.

source: Selects all elements that have a child named ``tag``. Only immediate children are supported.
es: Selecciona todos los elementos que tienen un hijo llamado ``tag``. Sólo se admiten los hijos inmediatos.

source: Selects all elements whose complete text content, including descendants, equals the given ``text``.
es: Selecciona todos los elementos cuyo contenido de texto completo, incluyendo los descendientes, es igual al "texto" dado.

source: Selects all elements whose complete text content, including descendants, does not equal the given ``text``.
es: Selecciona todos los elementos cuyo contenido de texto completo, incluidos los descendientes, no es igual al ``text`` proporcionado.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, equals the given ``text``.
es: Selecciona todos los elementos que tienen un hijo llamado ``tag`` cuyo contenido de texto completo, incluyendo los descendientes, es igual al ``text`` dado.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, does not equal the given ``text``.
es: Selecciona todos los elementos que tienen un hijo llamado ``tag`` cuyo contenido de texto completo, incluidos los descendientes, no es igual al ``text`` dado.

source: Selects all elements that are located at the given position. The position can be either an integer (1 is the first position), the expression ``last()`` (for the last position), or a position relative to the last position (e.g. ``last()-1``).
es: Selecciona todos los elementos que se encuentran en la posición dada. La posición puede ser un número entero (1 es la primera posición), la expresión ``last()`` (para la última posición), o una posición relativa a la última posición (por ejemplo, ``last()-1``).

source: Predicates (expressions within square brackets) must be preceded by a tag name, an asterisk, or another predicate. ``position`` predicates must be preceded by a tag name.
es: Los predicados (expresiones entre corchetes) deben ir precedidos de un nombre de etiqueta, un asterisco u otro predicado. Los predicados ``position`` deben ir precedidos de un nombre de etiqueta.

source: Reference
es: Referencia

source: Functions
es: Funciones

source: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ transformation function.
es: Función de transformación `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_.

source: Canonicalization is a way to normalise XML output in a way that allows byte-by-byte comparisons and digital signatures. It reduced the freedom that XML serializers have and instead generates a more constrained XML representation. The main restrictions regard the placement of namespace declarations, the ordering of attributes, and ignorable whitespace.
es: La canonización es una forma de normalizar la salida de XML de manera que permita comparaciones byte a byte y firmas digitales. Reduce la libertad que tienen los serializadores XML y en su lugar genera una representación XML más restringida. Las principales restricciones se refieren a la colocación de las declaraciones de espacio de nombres, el orden de los atributos y los espacios en blanco ignorables.

source: This function takes an XML data string (*xml_data*) or a file path or file-like object (*from_file*) as input, converts it to the canonical form, and writes it out using the *out* file(-like) object, if provided, or returns it as a text string if not. The output file receives text, not bytes. It should therefore be opened in text mode with ``utf-8`` encoding.
es: Esta función toma una cadena de datos XML (*xml_data*) o una ruta de archivo o un objeto tipo archivo (*from_file*) como entrada, la convierte a la forma canónica y la escribe utilizando el objeto archivo (o tipo archivo) *out*, si se proporciona, o la devuelve como una cadena de texto si no. El archivo de salida recibe texto, no bytes. Por tanto, debe abrirse en modo texto con codificación ``utf-8``.

source: Typical uses::
es: Usos típicos::

source: The configuration *options* are as follows:
es: Las opciones de configuración *options* son las siguientes:

source: *with_comments*: set to true to include comments (default: false)
es: *with_comments*: configurar a ``True`` para incluir los comentarios (por defecto: ``False``)

source: *strip_text*: set to true to strip whitespace before and after text content
es: *strip_text*: configurar a ``True`` para eliminar los espacios en blanco antes y después del contenido del texto

source: (default: false)
es: (por defecto: ``False``)

source: *rewrite_prefixes*: set to true to replace namespace prefixes by "n{number}"
es: *rewrite_prefixes*: configurar a ``True`` para sustituir los prefijos de espacios de nombres por "n{number}"

source: *qname_aware_tags*: a set of qname aware tag names in which prefixes
es: *qname_aware_tags*: un conjunto de nombres de etiquetas conscientes de qname en el que los prefijos

source: should be replaced in text content (default: empty)
es: deben ser reemplazados en el contenido del texto (por defecto: vacío)

source: *qname_aware_attrs*: a set of qname aware attribute names in which prefixes
es: *qname_aware_attrs*: un conjunto de nombres de atributos conscientes de qname en el que los prefijos

source: *exclude_attrs*: a set of attribute names that should not be serialised
es: *exclude_attrs*: un conjunto de nombres de atributos que no deben serializarse

source: *exclude_tags*: a set of tag names that should not be serialised
es: *exclude_tags*: un conjunto de nombres de etiquetas que no deben serializarse
