Repository: python/python-docs-es
Catalog: library/xml.dom.po
Languages: es

source: Insert a new child node before an existing child. It must be the case that *refChild* is a child of this node; if not, :exc:`ValueError` is raised. *newChild* is returned. If *refChild* is ``None``, it inserts *newChild* at the end of the children's list.
es: Inserta un nuevo nodo hijo antes de un hijo existente. Debe ser el caso que *refChild* sea un hijo de este nodo; si no, :exc:`ValueError` es lanzado. *newChild* es retornado. Si *refChild* es ``None``, se inserta a *newChild* al final de la lista de hijos.

source: Remove a child node. *oldChild* must be a child of this node; if not, :exc:`ValueError` is raised. *oldChild* is returned on success. If *oldChild* will not be used further, its :meth:`unlink` method should be called.
es: Elimina un nodo hijo. *oldChild* debe ser un hijo de este nodo; si no, :exc:`ValueError` es lanzado. *oldChild* es retornado si tiene éxito. Si *oldChild* no será usado más adelante, se debe llamar a su método :meth:`unlink`.

source: Replace an existing node with a new node. It must be the case that *oldChild* is a child of this node; if not, :exc:`ValueError` is raised.
es: Reemplaza un nodo existente con un nuevo nodo. Debe ser el caso que *oldChild* sea un hijo de este nodo; si no, :exc:`ValueError` es lanzado.

source: Join adjacent text nodes so that all stretches of text are stored as single :class:`Text` instances. This simplifies processing text from a DOM tree for many applications.
es: Une nodos de texto adyacentes para que todos los tramos de texto sean guardados como únicas instancias de :class:`Text`. Esto simplifica el procesamiento de texto de un árbol del *DOM* para muchas aplicaciones.

source: Clone this node. Setting *deep* means to clone all child nodes as well. This returns the clone.
es: Clona este nodo. Poner *deep* significa clonar todos los nodos hijo también. Esto retorna el clon.

source: NodeList Objects
es: Objetos *NodeList*

source: A :class:`NodeList` represents a sequence of nodes. These objects are used in two ways in the DOM Core recommendation: an :class:`Element` object provides one as its list of child nodes, and the :meth:`getElementsByTagName` and :meth:`getElementsByTagNameNS` methods of :class:`Node` return objects with this interface to represent query results.
es: Un :class:`NodeList` representa una secuencia de nodos. Estos objetos se usan de dos formas en la recomendación principal del *DOM*: un objeto :class:`Element` proporciona uno como su lista de nodos hijo, y los métodos :meth:`getElementsByTagName` y :meth:`getElementsByTagNameNS` de :class:`Node` retornan objetos con esta interfaz para representar resultados de consulta.

source: The DOM Level 2 recommendation defines one method and one attribute for these objects:
es: La recomendación del *DOM* nivel 2 define un método y un atributo para estos objetos:

source: Return the *i*'th item from the sequence, if there is one, or ``None``. The index *i* is not allowed to be less than zero or greater than or equal to the length of the sequence.
es: Retorna el i-ésimo *item* de la secuencia, si hay uno, o ``None``. El índice *i* no puede ser menor que cero o mayor o igual que el tamaño de la secuencia.

source: The number of nodes in the sequence.
es: El número de nodos en la secuencia.

source: In addition, the Python DOM interface requires that some additional support is provided to allow :class:`NodeList` objects to be used as Python sequences. All :class:`NodeList` implementations must include support for :meth:`~object.__len__` and :meth:`~object.__getitem__`; this allows iteration over the :class:`NodeList` in :keyword:`for` statements and proper support for the :func:`len` built-in function.
es: Además, la interfaz *DOM* de Python requiere que un algún soporte adicional sea proporcionado para que los objetos :class:`NodeList` puedan ser usados como secuencias de Python. Todas las implementaciones de :class:`NodeList` deben incluir soporte para :meth:`~object.__len__` y :meth:`~object.__getitem__`; esto permite la iteración de :class:`NodeList` en sentencias con :keyword:`for` y un soporte apropiado para la función incorporada :func:`len`.

source: If a DOM implementation supports modification of the document, the :class:`NodeList` implementation must also support the :meth:`~object.__setitem__` and :meth:`~object.__delitem__` methods.
es: Si una implementación DOM soporta la modificación del documento, la implementación de :class:`NodeList` debe también soportar los métodos :meth:`~object.__setitem__` y :meth:`~object.__delitem__`.

source: DocumentType Objects
es: Objetos *DocumentType*

source: Information about the notations and entities declared by a document (including the external subset if the parser uses it and can provide the information) is available from a :class:`DocumentType` object. The :class:`DocumentType` for a document is available from the :class:`Document` object's :attr:`doctype` attribute; if there is no ``DOCTYPE`` declaration for the document, the document's :attr:`doctype` attribute will be set to ``None`` instead of an instance of this interface.
es: La información acerca de las notaciones y entidades declaradas por un documento (incluido el subconjunto externo si el analizador lo usa y puede proporcionar información) está disponible desde un objeto :class:`DocumentType`. El :class:`DocumentType` para un documento está disponible desde el atributo :attr:`doctype` del objeto :class:`Document`; si no hay ninguna declaración ``DOCTYPE`` para el documento, el atributo :attr:`doctype` del documento se pondrá como ``None`` en vez de una instancia de esta interfaz.

source: :class:`DocumentType` is a specialization of :class:`Node`, and adds the following attributes:
es: :class:`DocumentType` es una especialización de :class:`Node`, y añade los siguientes atributos:

source: The public identifier for the external subset of the document type definition. This will be a string or ``None``.
es: El identificador público para el subconjunto externo de la definición del tipo de documento. Esto será una cadena de caracteres o ``None``.

source: The system identifier for the external subset of the document type definition. This will be a URI as a string, or ``None``.
es: El identificador del sistema para el subconjunto externo de la definición del tipo de documento. Esto será una *URI* como una cadena de caracteres, o ``None``.

source: A string giving the complete internal subset from the document. This does not include the brackets which enclose the subset. If the document has no internal subset, this should be ``None``.
es: Una cadena de caracteres proporcionando el subconjunto interno completo del documento. Esto no incluye los paréntesis que cierran el subconjunto. Si el documento no tiene ningún subconjunto interno, debe ser ``None``.

source: The name of the root element as given in the ``DOCTYPE`` declaration, if present.
es: El nombre del elemento raíz como se indica en la declaración ``DOCTYPE``, si está presente.

source: This is a :class:`NamedNodeMap` giving the definitions of external entities. For entity names defined more than once, only the first definition is provided (others are ignored as required by the XML recommendation). This may be ``None`` if the information is not provided by the parser, or if no entities are defined.
es: Este es un :class:`NamedNodeMap` proporcionando las definiciones de las entidades externas. Para nombres de entidades definidas más de una vez, sólo la primera definición es proporcionada (el resto es ignorado como se requiere por la recomendación de *XML*). Puede ser ``None`` si el analizador no proporciona la información, o si ninguna entidad es definida.

source: This is a :class:`NamedNodeMap` giving the definitions of notations. For notation names defined more than once, only the first definition is provided (others are ignored as required by the XML recommendation). This may be ``None`` if the information is not provided by the parser, or if no notations are defined.
es: Este es un :class:`NamedNodeMap` proporcionando las definiciones de las notaciones. Para nombres de notaciones definidas más de una vez, sólo la primera definición es proporcionada (el resto es ignorado como se requiere por la recomendación *XML*). Puede ser ``None`` si el analizador no proporciona la información, o si no hay notaciones definidas.

source: Document Objects
es: Objetos Documento

source: A :class:`Document` represents an entire XML document, including its constituent elements, attributes, processing instructions, comments etc. Remember that it inherits properties from :class:`Node`.
es: Un :class:`Documento` representa un documento *XML* entero, incluyendo sus elementos constituyentes, atributos, instrucciones de procesamiento, comentarios, etc. Recuerda que este hereda propiedades de :class:`Node`.

source: The one and only root element of the document.
es: El único elemento raíz del documento.

source: Create and return a new element node. The element is not inserted into the document when it is created. You need to explicitly insert it with one of the other methods such as :meth:`insertBefore` or :meth:`appendChild`.
es: Crea y retorna un nuevo elemento nodo. El elemento no se inserta en el documento cuando es creado. Necesitas insertarlo explícitamente con uno de los otros métodos como :meth:`insertBefore` o :meth:`appendChild`.

source: Create and return a new element with a namespace. The *tagName* may have a prefix. The element is not inserted into the document when it is created. You need to explicitly insert it with one of the other methods such as :meth:`insertBefore` or :meth:`appendChild`.
es: Crea y retorna un nuevo elemento con un espacio de nombres. El *tagName* puede tener un prefijo. El elemento no se inserta en el documento cuando es creado. Necesitas insertarlo explícitamente con uno de los otros métodos como :meth:`insertBefore` o :meth:`appendChild`.

source: Create and return a text node containing the data passed as a parameter. As with the other creation methods, this one does not insert the node into the tree.
es: Crea y retorna un nodo texto conteniendo los datos pasados como parámetros, Como con los otros métodos de creación, este no inserta el nodo en el árbol.

source: Create and return a comment node containing the data passed as a parameter. As with the other creation methods, this one does not insert the node into the tree.
es: Crea y retorna un nodo comentario conteniendo los datos pasados como parámetros. Como con los otros métodos de creación, este no inserta el nodo en el árbol.

source: Create and return a processing instruction node containing the *target* and *data* passed as parameters. As with the other creation methods, this one does not insert the node into the tree.
es: Crea y retorna una instrucción de procesamiento conteniendo el *target* y *data* pasados como parámetros. Como con los otros métodos de creación, este no inserta en nodo en el árbol.

source: Create and return an attribute node. This method does not associate the attribute node with any particular element. You must use :meth:`setAttributeNode` on the appropriate :class:`Element` object to use the newly created attribute instance.
es: Crea y retorna un nodo atributo. Este método no asocia el nodo atributo con ningún elemento particular. Debes usar :meth:`setAttributeNode` en el objeto :class:`Element` apropiado para usar la instancia del atributo recién creada.

source: Create and return an attribute node with a namespace. The *tagName* may have a prefix. This method does not associate the attribute node with any particular element. You must use :meth:`setAttributeNode` on the appropriate :class:`Element` object to use the newly created attribute instance.
es: Crea y retorna un nodo atributo con un espacio de nombres. El *tagName* puede ser un prefijo. Este método no asocia el nodo atributo con ningún elemento en particular. Debes usar :meth:`setAttributeNode` en el objeto :class:`Element` apropiado para usar la instancia del atributo recién creada.

source: Search for all descendants (direct children, children's children, etc.) with a particular element type name.
es: Busca todos los descendientes (hijos directos, hijos de los hijos, etc.) con un nombre del tipo de elemento particular.

source: Search for all descendants (direct children, children's children, etc.) with a particular namespace URI and localname. The localname is the part of the namespace after the prefix.
es: Busca todos los descendientes (hijos directos, hijos de hijos, etc.) con un espacio de nombres URI particular (*namespaceURI*) y nombre local (*localname*). El nombre local es parte del espacio de nombres después del prefijo.

source: Element Objects
es: Objetos Elemento

source: :class:`Element` is a subclass of :class:`Node`, so inherits all the attributes of that class.
es: :class:`Element` es una subclase de :class:`Node`, por lo que hereda todos los atributos de esa clase.

source: The element type name. In a namespace-using document it may have colons in it. The value is a string.
es: El nombre del tipo de elemento. En un documento que usa espacios de nombres este puede tener varios dos puntos en el. El valor es una cadena de caracteres.

source: Same as equivalent method in the :class:`Document` class.
es: Igual al método equivalente en la clase :class:`Document`.

source: Return ``True`` if the element has an attribute named by *name*.
es: Retorna ``True`` si el elemento tiene un atributo nombrado *name*.

source: Return ``True`` if the element has an attribute named by *namespaceURI* and *localName*.
es: Retorna ``True`` si el elemento tiene un atributo nombrado por *namespaceURI* y *localName*.

source: Return the value of the attribute named by *name* as a string. If no such attribute exists, an empty string is returned, as if the attribute had no value.
es: Retorna el valor del atributo nombrado por *name* como una cadena de caracteres. Si no existe dicho atributo, una cadena vacía es retornada, como si el atributo no tuviera valor.

source: Return the :class:`Attr` node for the attribute named by *attrname*.
es: Retorna el nodo :class:`Attr` para el atributo nombrado por *attrname*.

source: Return the value of the attribute named by *namespaceURI* and *localName* as a string. If no such attribute exists, an empty string is returned, as if the attribute had no value.
es: Retorna el valor del atributo nombrado por *namespaceURI* y *localName* como una cadena de caracteres. Si no existe dicho atributo, una cadena vacía es retornada, como si el atributo no tuviera valor.

source: Return an attribute value as a node, given a *namespaceURI* and *localName*.
es: Retorna un valor de atributo como nodo, dado un *namespaceURI* y *localName*.

source: Remove an attribute by name. If there is no matching attribute, a :exc:`NotFoundErr` is raised.
es: Remueve un atributo por nombre (*name*). Si no hay un atributo correspondiente, un :exc:`NotFoundErr` es levantado.

source: Remove and return *oldAttr* from the attribute list, if present. If *oldAttr* is not present, :exc:`NotFoundErr` is raised.
es: Remueve y retorna *oldAttr* de la lista de atributos, si está presenta. Si *oldAttr* no está presente, :exc:`NotFoundErr` es levantado.

source: Remove an attribute by name. Note that it uses a localName, not a qname. No exception is raised if there is no matching attribute.
es: Remueve un atributo por nombre (*name*). Note que esto usa un *localName*, no un *qname*. Ninguna excepción es levantada si no existe el atributo correspondiente.

source: Set an attribute value from a string.
es: Pone un valor de atributo como una cadena de caracteres.

source: Add a new attribute node to the element, replacing an existing attribute if necessary if the :attr:`name` attribute matches. If a replacement occurs, the old attribute node will be returned. If *newAttr* is already in use, :exc:`InuseAttributeErr` will be raised.
es: Añade un nuevo atributo nodo al elemento, reemplazando un atributo existente si es necesario si el atributo :attr:`name` coincide. Si un reemplazo ocurre, el viejo atributo será retornado. Si *newAttr* ya está en uso, :exc:`InuseAttributeErr` será lanzado.

source: Add a new attribute node to the element, replacing an existing attribute if necessary if the :attr:`namespaceURI` and :attr:`localName` attributes match. If a replacement occurs, the old attribute node will be returned. If *newAttr* is already in use, :exc:`InuseAttributeErr` will be raised.
es: Añade un nuevo nodo atributo al elemento, reemplazando un atributo existente si es necesario, si el :attr:`namesapceURI` y :attr:`localName` coinciden. Si un reemplazo ocurre, el viejo atributo será retornado. Si *newAttr* está en uso, :exc:`InuseAttributeErr` será levantado.

source: Set an attribute value from a string, given a *namespaceURI* and a *qname*. Note that a qname is the whole attribute name. This is different than above.
es: Pone un valor de atributo a partir de una cadena de caracteres, dados un *namespaceURI* y *qname*. Note que un *qname* es el nombre completo del atributo. Esto es diferente al de arriba.

source: Attr Objects
es: Objetos Atributo

source: :class:`Attr` inherits from :class:`Node`, so inherits all its attributes.
es: :class:`Attr` hereda de :class:`Node`, por lo que hereda todos sus atributos.

source: The attribute name. In a namespace-using document it may include a colon.
es: El nombre del atributo. En un documento que usa espacio de nombres, puede incluir dos puntos.

source: The part of the name following the colon if there is one, else the entire name. This is a read-only attribute.
es: La parte del nombre seguido después de los dos puntos si hay uno, si no el nombre entero. Este es un atributo de sólo lectura.

source: The part of the name preceding the colon if there is one, else the empty string.
es: La parte del nombre que precede los dos puntos si hay uno, si no la cadena de caracteres vacía.

source: The text value of the attribute. This is a synonym for the :attr:`nodeValue` attribute.
es: El valor textual del atributo. Este es un sinónimo para el atributo :attr:`nodeValue`.

source: NamedNodeMap Objects
es: Objetos *NamedNodeMap*

source: :class:`NamedNodeMap` does *not* inherit from :class:`Node`.
es: :class:`NamedNodeMap` *no* hereda de :class:`Node`.

source: The length of the attribute list.
es: La longitud de la lista de atributos.

source: Return an attribute with a particular index. The order you get the attributes in is arbitrary but will be consistent for the life of a DOM. Each item is an attribute node. Get its value with the :attr:`value` attribute.
es: Retorna un atributo con un índice particular. El orden en los que obtienes los atributos es arbitrario pero será consistente en la vida de un *DOM*. Cada *item* es un nodo atributo. Obtén su valor con el atributo :attr:`value`.

source: There are also experimental methods that give this class more mapping behavior. You can use them or you can use the standardized :meth:`getAttribute\*` family of methods on the :class:`Element` objects.
es: También hay métodos experimentales que dan a esta clase más comportamiento de mapeado. Puedes usarlos o puedes usar la familia de métodos estandarizados :meth:`getAttribute\*` en los objetos :class:`Element`.

source: Comment Objects
es: Objetos Comentario

source: :class:`Comment` represents a comment in the XML document. It is a subclass of :class:`Node`, but cannot have child nodes.
es: :class:`Comment` representa un comentario en el documento *XML*. Es una subclase de :class:`Node`, pero no puede tener hijos nodo.

source: The content of the comment as a string. The attribute contains all characters between the leading ``<!-``\ ``-`` and trailing ``-``\ ``->``, but does not include them.
es: El contenido del comentario como una cadena de caracteres. El atributo contiene todos los caracteres entre el ``<!-``\ ``-`` que empieza y el ``-``\ ``->`` que termina, pero no los incluye.

source: Text and CDATASection Objects
es: Objetos Texto y *CDATASection*

source: The :class:`Text` interface represents text in the XML document. If the parser and DOM implementation support the DOM's XML extension, portions of the text enclosed in CDATA marked sections are stored in :class:`CDATASection` objects. These two interfaces are identical, but provide different values for the :attr:`nodeType` attribute.
es: La interfaz :class:`Text` representa el texto en el documento *XML*. Si el analizador y la implementación del *DOM* soporta la extensión *XML* del *DOM*, las porciones de texto rodeadas secciones marcadas como *CDATA* se guardan en objetos :class:`CDATASection`. Estas dos interfaces son idénticas, pero proveen valores diferentes para el atributo :attr:`nodeType`.

source: These interfaces extend the :class:`Node` interface. They cannot have child nodes.
es: Estas interfaces extienden la interfaz :class:`Node`. No pueden tener nodos hijo.

source: The content of the text node as a string.
es: El contenido del nodo texto como una cadena de caracteres.

source: The use of a :class:`CDATASection` node does not indicate that the node represents a complete CDATA marked section, only that the content of the node was part of a CDATA section. A single CDATA section may be represented by more than one node in the document tree. There is no way to determine whether two adjacent :class:`CDATASection` nodes represent different CDATA marked sections.
es: El uso de un nodo :class:`CDATASection` no indica que el nodo represente una sección completa marcada como *CDATA*, sólo que el contenido del nodo fue parte de una sección *CDATA*. Una sola sección *CDATA* puede ser representada por más de un nodo en el árbol del documento. No hay manera de determinar si dos nodos adyacentes :class:`CDATASection` son representados diferentes a secciones marcadas como *CDATA*.

source: ProcessingInstruction Objects
es: Objetos *ProcessingInstruction*

source: Represents a processing instruction in the XML document; this inherits from the :class:`Node` interface and cannot have child nodes.
es: Representa una instrucción de procesamiento en el documento *XML*; hereda de la interfaz :class:`Node` y no puede tener hijos.

source: The content of the processing instruction up to the first whitespace character. This is a read-only attribute.
es: El contenido de la instrucción de procesamiento hasta el carácter en blanco. Este es un atributo de sólo lectura.

source: The content of the processing instruction following the first whitespace character.
es: El contenido de la instrucción de procesamiento después del primer carácter en blanco.

source: Exceptions
es: Excepciones

source: The DOM Level 2 recommendation defines a single exception, :exc:`DOMException`, and a number of constants that allow applications to determine what sort of error occurred. :exc:`DOMException` instances carry a :attr:`code` attribute that provides the appropriate value for the specific exception.
es: La recomendación del *DOM* nivel 2 define una sola excepción, :exc:`DOMException`, y un número de constantes que permite que las aplicaciones determinen qué tipo de error ocurrió. las instancias de :exc:`DOMException` llevan un atributo :attr:`code` que proporciona el valor apropiado para la excepción específica.
