Repository: python/python-docs-es
Catalog: library/xml.etree.elementtree.po
Languages: es

source: This class is the low-level building block of the module. It uses :mod:`xml.parsers.expat` for efficient, event-based parsing of XML. It can be fed XML data incrementally with the :meth:`feed` method, and parsing events are translated to a push API - by invoking callbacks on the *target* object. If *target* is omitted, the standard :class:`TreeBuilder` is used. If *encoding* [1]_ is given, the value overrides the encoding specified in the XML file.
es: Esta clase es el bloque de construcción de bajo nivel del módulo. Utiliza :mod:`xml.parsers.expat` para un análisis eficiente de XML basado en eventos. Puede ser alimentada con datos XML de forma incremental con el método :meth:`feed`, y los eventos de análisis se traducen en una API push - invocando callbacks en el objeto *target*. Si se omite *target*, se utiliza la clase estándar :class:`TreeBuilder`. Si se da *encoding* [1]_, el valor anula la codificación especificada en el archivo XML.

source: Parameters are now :ref:`keyword-only <keyword-only_parameter>`. The *html* argument no longer supported.
es: Los parámetros son ahora :ref:`keyword-only <keyword-only_parameter>`. El argumento *html* ya no se admite.

source: Finishes feeding data to the parser. Returns the result of calling the ``close()`` method of the *target* passed during construction; by default, this is the toplevel document element.
es: Finaliza la alimentación de datos al analizador. Retorna el resultado de llamar al método ``close()`` del *target* pasado durante la construcción; por defecto, es el elemento del documento de nivel superior.

source: Feeds data to the parser. *data* is encoded data.
es: Introduce los datos en el analizador sintáctico. *data* son datos codificados.

source: :meth:`XMLParser.feed` calls *target*\'s ``start(tag, attrs_dict)`` method for each opening tag, its ``end(tag)`` method for each closing tag, and data is processed by method ``data(data)``. For further supported callback methods, see the :class:`TreeBuilder` class. :meth:`XMLParser.close` calls *target*\'s method ``close()``. :class:`XMLParser` can be used not only for building a tree structure. This is an example of counting the maximum depth of an XML file::
es: :meth:`XMLParser.feed` llama al método ``start(tag, attrs_dict)`` de *target* para cada etiqueta de apertura, a su método ``end(tag)`` para cada etiqueta de cierre, y los datos son procesados por el método ``data(data)``. Para más métodos de callback soportados, véase la clase :class:`TreeBuilder`. :meth:`XMLParser.close` llama al método ``close()`` de *target*. :class:`XMLParser` puede utilizarse no sólo para construir una estructura de árbol. Este es un ejemplo de contar la profundidad máxima de un archivo XML::

source: XMLPullParser Objects
es: Objetos XMLPullParser

source: A pull parser suitable for non-blocking applications. Its input-side API is similar to that of :class:`XMLParser`, but instead of pushing calls to a callback target, :class:`XMLPullParser` collects an internal list of parsing events and lets the user read from it. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported.
es: Un analizador sintáctico pull adecuado para aplicaciones no bloqueantes. Su API de entrada es similar a la de :class:`XMLParser`, pero en lugar de enviar llamadas a un objetivo de devolución de llamada, :class:`XMLPullParser` recoge una lista interna de eventos de análisis y permite al usuario leer de ella. *events* son una secuencia de eventos a reportar. Los eventos soportados son las cadenas ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` y ``"end-ns"`` (los eventos "ns" se utilizan para obtener información detallada del espacio de nombres). Si se omite *events*, sólo se informará de los eventos ``"end"``.

source: Feed the given bytes data to the parser.
es: Introduce los datos de los bytes dados en el analizador.

source: Signal the parser that the data stream is terminated. Unlike :meth:`XMLParser.close`, this method always returns :const:`None`. Any events not yet retrieved when the parser is closed can still be read with :meth:`read_events`.
es: Señala al analizador que el flujo de datos ha terminado. A diferencia de :meth:`XMLParser.close`, este método siempre retorna :const:`None`. Cualquier evento que no haya sido recuperado cuando el analizador se cierra puede ser leído con :meth:`read_events`.

source: Return an iterator over the events which have been encountered in the data fed to the parser. The iterator yields ``(event, elem)`` pairs, where *event* is a string representing the type of event (e.g. ``"end"``) and *elem* is the encountered :class:`Element` object, or other context value as follows.
es: Retorna un iterador sobre los eventos que se han encontrado en los datos alimentados al analizador. El iterador retorna pares ``(event, elem)``, donde *event* es una cadena de caracteres que representa el tipo de evento (por ejemplo, ``"fin"``) y *elem* es el objeto :class:`Element` encontrado, u otro valor de contexto como el siguiente.

source: ``start``, ``end``: the current Element.
es: ``start``, ``end``: el Element actual.

source: ``comment``, ``pi``: the current comment / processing instruction
es: ``comment``, ``pi``: el comentario / la instrucción de procesamiento actual

source: ``start-ns``: a tuple ``(prefix, uri)`` naming the declared namespace mapping.
es: ``start-ns``: una tupla ``(prefix, uri)`` que nombra el mapeo del espacio de nombres declarado.

source: ``end-ns``: :const:`None` (this may change in a future version)
es: ``end-ns``: :const:`None` (esto puede cambiar en una versión futura)

source: Events provided in a previous call to :meth:`read_events` will not be yielded again. Events are consumed from the internal queue only when they are retrieved from the iterator, so multiple readers iterating in parallel over iterators obtained from :meth:`read_events` will have unpredictable results.
es: Los eventos proporcionados en una llamada anterior a :meth:`read_events` no serán retornados nuevamente. Los eventos se consumen de la cola interna sólo cuando se recuperan del iterador, por lo que múltiples lectores iterando en paralelo sobre iteradores obtenidos de :meth:`read_events` tendrán resultados impredecibles.

source: :class:`XMLPullParser` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
es: :class:`XMLPullParser` sólo garantiza que ha visto el carácter ">" de una etiqueta de inicio cuando emite un evento "start", por lo que los atributos están definidos, pero el contenido de los atributos text y tail está indefinido en ese momento. Lo mismo ocurre con los hijos del elemento; pueden estar presentes o no.

source: Exceptions
es: Excepciones

source: XML parse error, raised by the various parsing methods in this module when parsing fails. The string representation of an instance of this exception will contain a user-friendly error message. In addition, it will have the following attributes available:
es: Error de análisis de XML, lanzado por los distintos métodos de análisis de este módulo cuando el análisis falla. La representación en cadena de caracteres de una instancia de esta excepción contendrá un mensaje de error fácil de entender. Además, tendrá los siguientes atributos disponibles:

source: A numeric error code from the expat parser. See the documentation of :mod:`xml.parsers.expat` for the list of error codes and their meanings.
es: Un código de error numérico del analizador sintáctico expat. Consulte la documentación de :mod:`xml.parsers.expat` para ver la lista de códigos de error y sus significados.

source: A tuple of *line*, *column* numbers, specifying where the error occurred.
es: Una tupla de números de *line*, *column*, que especifica dónde se produjo el error.

source: Footnotes
es: Notas al pie de página

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
es: La cadena de caracteres de codificación incluida en la salida XML debe ajustarse a los estándares adecuados. Por ejemplo, "UTF-8" es válido, pero "UTF8" no lo es. Consulte https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl y https://www.iana.org/assignments/character-sets/character-sets.xhtml.
