Repository: python/python-docs-es
Catalog: library/xml.sax.reader.po
Languages: es_ar

source: :mod:`xml.sax.xmlreader` --- Interface for XML parsers
es_ar: :mod:`xml.sax.xmlreader` --- Interfaz para analizadores XML

source: **Source code:** :source:`Lib/xml/sax/xmlreader.py`
es_ar: **Código fuente:** :source:`Lib/xml/sax/xmlreader.py`

source: SAX parsers implement the :class:`XMLReader` interface. They are implemented in a Python module, which must provide a function :func:`create_parser`. This function is invoked by :func:`xml.sax.make_parser` with no arguments to create a new parser object.
es_ar: Los analizadores SAX implementan la interfaz :class:`XMLReader`. Están implementados en un módulo Python, que debe proveer una función :func:`create_parser`. Esta función es invocada por :func:`xml.sax.make_parser` sin argumentos para crear un nuevo objeto analizador.

source: Base class which can be inherited by SAX parsers.
es_ar: Clase base que puede ser heredada por analizadores SAX.

source: In some cases, it is desirable not to parse an input source at once, but to feed chunks of the document as they get available. Note that the reader will normally not read the entire file, but read it in chunks as well; still :meth:`parse` won't return until the entire document is processed. So these interfaces should be used if the blocking behaviour of :meth:`parse` is not desirable.
es_ar: En algunos casos, es deseable no analizar una fuente de entrada a la vez, si no alimentar partes del documento a medida que estén disponibles. Tenga en cuenta que el lector normalmente no leerá el fichero completo, si no que también lo leerá por partes, aún así :meth:`parse` no retornará hasta que el documento por completo es procesado. Por lo tanto, estas interfaces deben utilizarse si el comportamiento de bloqueo :meth:`parse` no es deseable.

source: When the parser is instantiated it is ready to begin accepting data from the feed method immediately. After parsing has been finished with a call to close the reset method must be called to make the parser ready to accept new data, either from feed or using the parse method.
es_ar: Cuando se crea una instancia del analizador, está listo para comenzar a aceptar información desde el método de alimentación inmediatamente. Después de que el análisis ha finalizado con una llamada para cerrar, se debe llamar al método de reinicio para que el analizador esté listo para aceptar información nueva, ya sea de la fuente o utilizando el método de análisis.

source: Note that these methods must *not* be called during parsing, that is, after parse has been called and before it returns.
es_ar: Tenga en cuenta que estos métodos *no* deben ser llamados durante el análisis, es decir, después de que el análisis ha sido llamado y antes de que regrese.

source: By default, the class also implements the parse method of the XMLReader interface using the feed, close and reset methods of the IncrementalParser interface as a convenience to SAX 2.0 driver writers.
es_ar: Por defecto, la clase también implementa el método de análisis de la interfaz XMLReader utilizando los métodos de alimentación, cierre y reinicio de la interfaz IncrementalParser en conveniencia a los escritores de controlador SAX 2.0.

source: Interface for associating a SAX event with a document location. A locator object will return valid results only during calls to DocumentHandler methods; at any other time, the results are unpredictable. If information is not available, methods may return ``None``.
es_ar: La interfaz para asociar un evento SAX con una ubicación del documento. Un objecto localizador retornará resultados válidos sólo durante llamadas a métodos DocumentHandler; en cualquier otro momento, los resultados son impredecibles. Si la información no está disponible, los métodos pueden retornar ``None``.

source: Encapsulation of the information needed by the :class:`XMLReader` to read entities.
es_ar: La encapsulación de la información necesaria por el :class:`XMLReader` para leer entidades.

source: This class may include information about the public identifier, system identifier, byte stream (possibly with character encoding information) and/or the character stream of an entity.
es_ar: Esta clase puede incluir información sobre el identificador público, identificador del sistema, flujo de bytes (posiblemente con la información de codificación de caracteres) y/o el flujo de caracteres de una entidad.

source: Applications will create objects of this class for use in the :meth:`XMLReader.parse` method and for returning from EntityResolver.resolveEntity.
es_ar: Las aplicaciones crearán objetos de esta clase para uso en el método :meth:`XMLReader.parse` y para retornar desde EntityResolver.resolveEntity.

source: An :class:`InputSource` belongs to the application, the :class:`XMLReader` is not allowed to modify :class:`InputSource` objects passed to it from the application, although it may make copies and modify those.
es_ar: Una :class:`InputSource` pertenece a la aplicación, el :class:`XMLReader` no tiene permitido modificar objetos :class:`InputSource` pasados desde la aplicación, a pesar de que puede hacer copias y modificarlas.

source: This is an implementation of the :class:`Attributes` interface (see section :ref:`attributes-objects`). This is a dictionary-like object which represents the element attributes in a :meth:`startElement` call. In addition to the most useful dictionary operations, it supports a number of other methods as described by the interface. Objects of this class should be instantiated by readers; *attrs* must be a dictionary-like object containing a mapping from attribute names to attribute values.
es_ar: Esta es una implementación de la interfaz :class:`Attributes` (vea la sección :ref:`attributes-objects`). Este es un objeto de tipo diccionario que representa los atributos de elemento en una llamada :meth:`startElement`. En adición a las operaciones de diccionario más útiles, soporta una serie de otros métodos como se describe en la interfaz. Los lectores deben crear una instancia de los objetos de esta clase; *attrs* debe ser un objeto de tipo diccionario que contenga un mapeo de nombres de atributo a valores de atributo.

source: Namespace-aware variant of :class:`AttributesImpl`, which will be passed to :meth:`startElementNS`. It is derived from :class:`AttributesImpl`, but understands attribute names as two-tuples of *namespaceURI* and *localname*. In addition, it provides a number of methods expecting qualified names as they appear in the original document. This class implements the :class:`AttributesNS` interface (see section :ref:`attributes-ns-objects`).
es_ar: Variante consciente del espacio de nombres de :class:`AttributesImpl`, que se pasará a :meth:`startElementNS`. Es derivada de :class:`AttributesImpl`, pero entiende nombres de atributo como dos tuplas de *namespaceURI* y *localname*. En adición, provee una serie de métodos esperando nombres calificados como aparecen en el documento original. Esta clase implementa la interfaz :class:`AttributesNS` (vea la sección :ref:`attributes-ns-objects`).

source: XMLReader Objects
es_ar: Objetos XMLReader

source: The :class:`XMLReader` interface supports the following methods:
es_ar: La interfaz :class:`XMLReader` soporta los siguientes métodos:

source: Process an input source, producing SAX events. The *source* object can be a system identifier (a string identifying the input source -- typically a file name or a URL), a :class:`pathlib.Path` or :term:`path-like <path-like object>` object, or an :class:`InputSource` object. When :meth:`parse` returns, the input is completely processed, and the parser object can be discarded or reset.
es_ar: Procesa una fuente de entrada, produciendo eventos SAX. El objeto *source* puede ser un identificador de sistema (una cadena identificando la fuente de entrada -- típicamente un nombre de fichero o una URL), un :class:`pathlib.Path` o un objeto :term:`path-like <path-like object>`, o un objeto :class:`InputSource`. Cuando :meth:`parse` retorna, la entrada es procesada completamente, y el objeto analizador puede ser descartado o reiniciado.

source: Added support of character streams.
es_ar: Agregado soporte de flujo de caracteres.

source: Added support of path-like objects.
es_ar: Agregado soporte de objetos path-like.

source: Return the current :class:`~xml.sax.handler.ContentHandler`.
es_ar: Retorna el :class:`~xml.sax.handler.ContentHandler` actual.

source: Set the current :class:`~xml.sax.handler.ContentHandler`. If no :class:`~xml.sax.handler.ContentHandler` is set, content events will be discarded.
es_ar: Establece el :class:`~xml.sax.handler.ContentHandler` actual. Si ningún :class:`~xml.sax.handler.ContentHandler` es establecido, los eventos de contenido serán descartados.

source: Return the current :class:`~xml.sax.handler.DTDHandler`.
es_ar: Retorna el :class:`~xml.sax.handler.DTDHandler` actual.

source: Set the current :class:`~xml.sax.handler.DTDHandler`. If no :class:`~xml.sax.handler.DTDHandler` is set, DTD events will be discarded.
es_ar: Establece el :class:`~xml.sax.handler.DTDHandler` actual. Si ningún :class:`~xml.sax.handler.DTDHandler` es establecido, los eventos DTD serán descartados.

source: Return the current :class:`~xml.sax.handler.EntityResolver`.
es_ar: Retorna el :class:`~xml.sax.handler.EntityResolver` actual.

source: Set the current :class:`~xml.sax.handler.EntityResolver`. If no :class:`~xml.sax.handler.EntityResolver` is set, attempts to resolve an external entity will result in opening the system identifier for the entity, and fail if it is not available.
es_ar: Establece el :class:`~xml.sax.handler.EntityResolver` actual. Si ningún :class:`~xml.sax.handler.EntityResolver` es establecido, los intentos de resolver una entidad externa resultarán en la apertura del identificador de sistema para la entidad, y un error si no está disponible.

source: Return the current :class:`~xml.sax.handler.ErrorHandler`.
es_ar: Retorna el :class:`~xml.sax.handler.ErrorHandler` actual.

source: Set the current error handler. If no :class:`~xml.sax.handler.ErrorHandler` is set, errors will be raised as exceptions, and warnings will be printed.
es_ar: Establece el manejador de errores actual. Si ningún :class:`~xml.sax.handler.ErrorHandler` es establecido, se lanzarán errores como excepciones, y se imprimirán alertas.

source: Allow an application to set the locale for errors and warnings.
es_ar: Permite a una aplicación establecer la configuración local para errores y alertas.

source: SAX parsers are not required to provide localization for errors and warnings; if they cannot support the requested locale, however, they must raise a SAX exception. Applications may request a locale change in the middle of a parse.
es_ar: Analizadores SAX no son requeridos para proveer localización para errores y alertas; si no pueden soportar la configuración local solicitada, de cualquier forma, lanzarán una excepción SAX. Las aplicaciones pueden solicitar un cambio local en medio del análisis.

source: Return the current setting for feature *featurename*. If the feature is not recognized, :exc:`SAXNotRecognizedException` is raised. The well-known featurenames are listed in the module :mod:`xml.sax.handler`.
es_ar: Retorna la configuración actual para la característica *featurename*. Si la característica no es reconocida, :exc:`SAXNotRecognizedException` es lanzada. Los bien conocidos featurenames son listados en el módulo :mod:`xml.sax.handler`.

source: Set the *featurename* to *value*. If the feature is not recognized, :exc:`SAXNotRecognizedException` is raised. If the feature or its setting is not supported by the parser, *SAXNotSupportedException* is raised.
es_ar: Establece el *featurename* a *value*. Si la característica no es reconocida, :exc:`SAXNotRecognizedException` es lanzada. Si la característica o su configuración no es soportada por el analizador, *SAXNotSupportedException* es lanzada.

source: Return the current setting for property *propertyname*. If the property is not recognized, a :exc:`SAXNotRecognizedException` is raised. The well-known propertynames are listed in the module :mod:`xml.sax.handler`.
es_ar: Retorna la configuración actual para la propiedad *propertyname*. Si la configuración no es reconocida, una :exc:`SAXNotRecognizedException` es lanzada. Las bien conocidas propertynames son listadas en el módulo :mod:`xml.sax.handler`.

source: Set the *propertyname* to *value*. If the property is not recognized, :exc:`SAXNotRecognizedException` is raised. If the property or its setting is not supported by the parser, *SAXNotSupportedException* is raised.
es_ar: Establece el *propertyname* a *value*. Si la propiedad no es reconocida, :exc:`SAXNotRecognizedException` es lanzada. Si la propiedad o su configuración no es soportada por el analizador, *SAXNotSupportedException* es lanzada.

source: IncrementalParser Objects
es_ar: Objetos IncrementalParser

source: Instances of :class:`IncrementalParser` offer the following additional methods:
es_ar: Las instancias de :class:`IncrementalParser` ofrecen los siguientes métodos adicionales:

source: Process a chunk of *data*.
es_ar: Procesa una parte de *data*.

source: Assume the end of the document. That will check well-formedness conditions that can be checked only at the end, invoke handlers, and may clean up resources allocated during parsing.
es_ar: Asume el fin del documento. Eso verificará las condiciones bien formadas que pueden ser verificadas sólo al final, invocar manejadores, y puede limpiar los recursos asignados durante el análisis.

source: This method is called after close has been called to reset the parser so that it is ready to parse new documents. The results of calling parse or feed after close without calling reset are undefined.
es_ar: Este método es llamado después de que el cierre ha sido llamado para restablecer el analizador, de forma que esté listo para analizar nuevos documentos. Los resultados de llamar parse o feed después del cierre sin llamar a reset son indefinidos.

source: Locator Objects
es_ar: Objetos localizadores

source: Instances of :class:`Locator` provide these methods:
es_ar: Las instancias de :class:`Locator` proveen estos métodos:

source: Return the column number where the current event begins.
es_ar: Retorna el número de columna donde el evento actual comienza.

source: Return the line number where the current event begins.
es_ar: Retorna el número de línea donde el evento actual comienza.

source: Return the public identifier for the current event.
es_ar: Retorna el identificador público para el evento actual.

source: Return the system identifier for the current event.
es_ar: Retorna el identificador de sistema para el evento actual.

source: InputSource Objects
es_ar: Objetos InputSource

source: Sets the public identifier of this :class:`InputSource`.
es_ar: Establece el identificador público de esta :class:`InputSource`.

source: Returns the public identifier of this :class:`InputSource`.
es_ar: Retorna el identificador público para esta :class:`InputSource`.

source: Sets the system identifier of this :class:`InputSource`.
es_ar: Establece el identificador de sistema de esta :class:`InputSource`.

source: Returns the system identifier of this :class:`InputSource`.
es_ar: Retorna el identificador de sistema para esta :class:`InputSource`.

source: Sets the character encoding of this :class:`InputSource`.
es_ar: Establece la codificación de caracteres para esta :class:`InputSource`.

source: The encoding must be a string acceptable for an XML encoding declaration (see section 4.3.3 of the XML recommendation).
es_ar: La codificación debe ser una cadena aceptable para una declaración de codificación XML (vea la sección 4.3.3 de la recomendación XML).

source: The encoding attribute of the :class:`InputSource` is ignored if the :class:`InputSource` also contains a character stream.
es_ar: El atributo de codificación de la :class:`InputSource` es ignorado si la :class:`InputSource` contiene también un flujo de caracteres.

source: Get the character encoding of this InputSource.
es_ar: Obtiene la codificación de caracteres de esta InputSource.

source: Set the byte stream (a :term:`binary file`) for this input source.
es_ar: Establece el flujo de bytes (un :term:`binary file`) para esta fuente de entrada.

source: The SAX parser will ignore this if there is also a character stream specified, but it will use a byte stream in preference to opening a URI connection itself.
es_ar: El analizador SAX ignorará esto si existe también un flujo de caracteres especificado, pero utilizará un flujo de bytes en preferencia para abrir una conexión URI en sí.

source: If the application knows the character encoding of the byte stream, it should set it with the setEncoding method.
es_ar: Si la aplicación conoce la codificación de caracteres del flujo de bytes, debería establecerla con el método setEncoding.

source: Get the byte stream for this input source.
es_ar: Obtiene el flujo de bytes para esta fuente de entrada.

source: The getEncoding method will return the character encoding for this byte stream, or ``None`` if unknown.
es_ar: El método getEncoding retornará la codificación de caracteres para este flujo de bytes, o ``None`` si se desconoce.

source: Set the character stream (a :term:`text file`) for this input source.
es_ar: Establece el flujo de caracteres (un :term:`text file`) para esta fuente de entrada.

source: If there is a character stream specified, the SAX parser will ignore any byte stream and will not attempt to open a URI connection to the system identifier.
es_ar: Si existe un flujo de caracteres especificado, el analizador SAX ignorará cualquier flujo de bytes y no intentará abrir una conexión URI al identificador de sistema.

source: Get the character stream for this input source.
es_ar: Obtiene el flujo de caracteres para esta fuente de entrada.

source: The :class:`Attributes` Interface
es_ar: La Interfaz :class:`Attributes`

source: :class:`Attributes` objects implement a portion of the :term:`mapping protocol <mapping>`, including the methods :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping.get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys`, and :meth:`~collections.abc.Mapping.values`. The following methods are also provided:
es_ar: Los objetos :class:`Attributes` implementa una porción del :term:`mapping protocol <mapping>`, incluyendo los métodos :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping.get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys`, y :meth:`~collections.abc.Mapping.values`. Los siguientes métodos también son provistos:

source: Return the number of attributes.
es_ar: Retorna el número de atributos.

source: Return the names of the attributes.
es_ar: Retorna los nombres de los atributos.

source: Returns the type of the attribute *name*, which is normally ``'CDATA'``.
es_ar: Retorna el tipo del atributo *name*, que es normalmente ``'CDATA'``.

source: Return the value of attribute *name*.
es_ar: Retorna el valor del atributo *name*.

source: The :class:`AttributesNS` Interface
es_ar: La Interfaz :class:`AttributesNS`

source: This interface is a subtype of the :class:`Attributes` interface (see section :ref:`attributes-objects`). All methods supported by that interface are also available on :class:`AttributesNS` objects.
es_ar: Esta interfaz es un subtipo de la interfaz :class:`Attributes` (vea la sección :ref:`attributes-objects`). Todos los métodos soportados por la interfaz están también disponibles en los objetos :class:`AttributesNS`.

source: The following methods are also available:
es_ar: Los siguientes métodos están también disponibles:

source: Return the value for a qualified name.
es_ar: Retorna el valor para un nombre cualificado.

source: Return the ``(namespace, localname)`` pair for a qualified *name*.
es_ar: Retorna el par ``(namespace, localname)`` para un *name* cualificado.

source: Return the qualified name for a ``(namespace, localname)`` pair.
es_ar: Retorna el nombre cualificado para un par ``(namespace, localname)``.

source: Return the qualified names of all attributes.
es_ar: Retorna los nombres cualificados para todos los atributos.
