Repository: python/python-docs-es
Catalog: library/xml.dom.po
Languages: es

source: :mod:`xml.dom` --- The Document Object Model API
es: :mod:`xml.dom` --- El *API* del Modelo de Objetos del Documento

source: **Source code:** :source:`Lib/xml/dom/__init__.py`
es: **Código Fuente:** :source:`Lib/xml/dom/__init__.py`

source: The Document Object Model, or "DOM," is a cross-language API from the World Wide Web Consortium (W3C) for accessing and modifying XML documents. A DOM implementation presents an XML document as a tree structure, or allows client code to build such a structure from scratch. It then gives access to the structure through a set of objects which provided well-known interfaces.
es: El Modelo de Objetos del Documento, o "DOM" por sus siglas en inglés, es un lenguaje API del Consorcio *World Wide Web* (W3C) para acceder y modificar documentos XML. Una implementación del DOM presenta los documento XML como un árbol, o permite al código cliente construir dichas estructuras desde cero para luego darles acceso a la estructura a través de un conjunto de objetos que implementaron interfaces conocidas.

source: The DOM is extremely useful for random-access applications. SAX only allows you a view of one bit of the document at a time. If you are looking at one SAX element, you have no access to another. If you are looking at a text node, you have no access to a containing element. When you write a SAX application, you need to keep track of your program's position in the document somewhere in your own code. SAX does not do it for you. Also, if you need to look ahead in the XML document, you are just out of luck.
es: El DOM es extremadamente útil para aplicaciones de acceso directo. SAX sólo te permite la vista de una parte del documento a la vez. Si estás mirando un elemento SAX, no tienes acceso a otro. Si estás viendo un nodo de texto, no tienes acceso al elemento contendor. Cuando desarrollas una aplicación SAX, necesitas registrar la posición de tu programa en el documento en algún lado de tu código. SAX no lo hace por ti. Además, desafortunadamente no podrás mirar hacia adelante (*look ahead*) en el documento XML.

source: Some applications are simply impossible in an event driven model with no access to a tree. Of course you could build some sort of tree yourself in SAX events, but the DOM allows you to avoid writing that code. The DOM is a standard tree representation for XML data.
es: Algunas aplicaciones son imposibles en un modelo orientado a eventos sin acceso a un árbol. Por supuesto que puedes construir algún tipo de árbol por tu cuenta en eventos SAX, pero el DOM te evita escribir ese código. El DOM es una representación de árbol estándar para datos XML.

source: The Document Object Model is being defined by the W3C in stages, or "levels" in their terminology. The Python mapping of the API is substantially based on the DOM Level 2 recommendation.
es: El Modelo de Objetos del Documento es definido por el *W3C* en fases, o "niveles" en su terminología. El mapeado de Python de la API está basado en la recomendación del DOM nivel 2.

source: DOM applications typically start by parsing some XML into a DOM. How this is accomplished is not covered at all by DOM Level 1, and Level 2 provides only limited improvements: There is a :class:`DOMImplementation` object class which provides access to :class:`Document` creation methods, but no way to access an XML reader/parser/Document builder in an implementation-independent way. There is also no well-defined way to access these methods without an existing :class:`Document` object. In Python, each DOM implementation will provide a function :func:`getDOMImplementation`. DOM Level 3 adds a Load/Store specification, which defines an interface to the reader, but this is not yet available in the Python standard library.
es: Las aplicaciones DOM típicamente empiezan al diseccionar (*parse*) el XML en un DOM. Cómo esto funciona no está incluido en el DOM nivel 1, y el nivel 2 provee mejoras limitadas. Existe una clase objeto llamada :class:`DOMImplementation` que da acceso a métodos de creación de :class:`Document`, pero de ninguna forma da acceso a los constructores (*builders*) de *reader*/*parser*/*Document* de una forma independiente a la implementación. No hay una forma clara para acceder a estos método sin un objeto :class:`Document` existente. En Python, cada implementación del DOM proporcionará una función :func:`getDOMImplementation`. El DOM de nivel 3 añade una especificación para Cargar(*Load*)/Guardar(*Store*), que define una interfaz al lector (*reader*), pero no está disponible aún en la librería estándar de Python.

source: Once you have a DOM document object, you can access the parts of your XML document through its properties and methods. These properties are defined in the DOM specification; this portion of the reference manual describes the interpretation of the specification in Python.
es: Una vez que tengas un objeto del documento del DOM, puedes acceder a las partes de tu documento XML a través de sus propiedades y métodos. Estas propiedades están definidas en la especificación del DOM; está porción del manual describe la interpretación de la especificación en Python.

source: The specification provided by the W3C defines the DOM API for Java, ECMAScript, and OMG IDL. The Python mapping defined here is based in large part on the IDL version of the specification, but strict compliance is not required (though implementations are free to support the strict mapping from IDL). See section :ref:`dom-conformance` for a detailed discussion of mapping requirements.
es: La especificación estipulada por el *W3C* define la *DOM API* para Java, ECMAScript, y OMG IDL. El mapeo de Python definido aquí está basado en gran parte en la versión IDL de la especificación, pero no se requiere el cumplimiento estricto (aunque las implementaciones son libres de soportar el mapeo estricto de IDL). Véase la sección :ref:`dom-conformance` para una discusión detallada del mapeo de los requisitos.

source: The W3C recommendation upon which the Python DOM API is based.
es: La recomendación del *W3C* con la cual se basa el *DOM API* de Python.

source: The W3C recommendation for the DOM supported by :mod:`xml.dom.minidom`.
es: La recomendación del W3C para el DOM soportada por :mod:`xml.dom.minidom`.

source: This specifies the mapping from OMG IDL to Python.
es: Este documento especifica el mapeo de OMG IDL a Python.

source: Module Contents
es: Contenido del Módulo

source: The :mod:`xml.dom` contains the following functions:
es: El módulo :mod:`xml.dom` contiene las siguientes funciones:

source: Register the *factory* function with the name *name*. The factory function should return an object which implements the :class:`DOMImplementation` interface. The factory function can return the same object every time, or a new one for each call, as appropriate for the specific implementation (e.g. if that implementation supports some customization).
es: Registra la función *factory* con el nombre *name*. La función fábrica (*factory*) debe retornar un objeto que implemente la interfaz :class:`DOMImplementation`. La función fábrica puede retornar el mismo objeto cada vez que se llame, o uno nuevo por cada llamada, según sea apropiado para la implementación específica (e.g. si la implementación soporta algunas personalizaciones).

source: Return a suitable DOM implementation. The *name* is either well-known, the module name of a DOM implementation, or ``None``. If it is not ``None``, imports the corresponding module and returns a :class:`DOMImplementation` object if the import succeeds. If no name is given, and if the environment variable :envvar:`PYTHON_DOM` is set, this variable is used to find the implementation.
es: Retorna una implementación del DOM apropiada. El *name* es o bien conocido, el nombre del módulo de una implementación DOM, o ``None``. Si no es ``None`` importa el módulo correspondiente y retorna un objecto :class:`DomImplementation` si la importación tiene éxito. Si no se le pasa un nombre, y el entorno de variable :envvar:`PYTHON_DOM` ha sido puesto, dicha variable es usada para encontrar la información de la implementación.

source: If name is not given, this examines the available implementations to find one with the required feature set. If no implementation can be found, raise an :exc:`ImportError`. The features list must be a sequence of ``(feature, version)`` pairs which are passed to the :meth:`hasFeature` method on available :class:`DOMImplementation` objects.
es: Si no se le pasa un nombre, examina las implementaciones disponibles para encontrar uno con el conjunto de características requeridas. Si no se encuentra ninguna implementación, levanta una excepción :exc:`ImportError`. La lista de características debe ser una secuencia de pares ``(feature,version)`` que son pasados al método :meth:`hasFeature` en objetos disponibles de :class:`DOMImplementation`.

source: Some convenience constants are also provided:
es: Algunas constantes convenientes son proporcionadas:

source: The value used to indicate that no namespace is associated with a node in the DOM. This is typically found as the :attr:`namespaceURI` of a node, or used as the *namespaceURI* parameter to a namespaces-specific method.
es: El valor usado para indicar que ningún espacio de nombres es asociado con un nodo en el DOM. Se encuentra típicamente con el :attr:`namespaceURI` de un nodo, o usado como el parámetro *namespaceURI* para un método específico del *namespace*.

source: The namespace URI associated with the reserved prefix ``xml``, as defined by `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ (section 4).
es: El espacio de nombres de la URI asociada con el prefijo ``xml``, como se define por `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ (section 4).

source: The namespace URI for namespace declarations, as defined by `Document Object Model (DOM) Level 2 Core Specification <https://www.w3.org/TR/DOM-Level-2-Core/core.html>`_ (section 1.1.8).
es: El espacio de nombres del URI para declaraciones del espacio de nombres, como se define en `Document Object Model (DOM) Level 2 Core Specification <https://www.w3.org/TR/DOM-Level-2-Core/core.html>`_ (section 1.1.8).

source: The URI of the XHTML namespace as defined by `XHTML 1.0: The Extensible HyperText Markup Language <https://www.w3.org/TR/xhtml1/>`_ (section 3.1.1).
es: El URI del espacio de nombres del XHTML como se define en `XHTML 1.0: The Extensible HyperText Markup Language <https://www.w3.org/TR/xhtml1/>`_ (section 3.1.1).

source: In addition, :mod:`xml.dom` contains a base :class:`Node` class and the DOM exception classes. The :class:`Node` class provided by this module does not implement any of the methods or attributes defined by the DOM specification; concrete DOM implementations must provide those. The :class:`Node` class provided as part of this module does provide the constants used for the :attr:`nodeType` attribute on concrete :class:`Node` objects; they are located within the class rather than at the module level to conform with the DOM specifications.
es: Además, :mod:`xml.dom` contiene una clase base :class:`Node` y las clases de excepciones del DOM. La clase :class:`Node` proporcionada por este módulo no implementa ninguno de los métodos o atributos definidos en la especificación DOM; las implementaciones del DOM concretas deben definirlas. La clase :class:`Node` propuesta por este módulo sí proporciona las constantes usadas por el atributo :attr:`nodeType` en objetos concretos de :class:`Node`; estas son localizadas dentro de la clase en vez de estar al nivel del módulo para cumplir las especificaciones del DOM.

source: Objects in the DOM
es: Objetos en el DOM

source: The definitive documentation for the DOM is the DOM specification from the W3C.
es: La documentación definitiva para el DOM es la especificación del DOM del W3C.

source: Note that DOM attributes may also be manipulated as nodes instead of as simple strings. It is fairly rare that you must do this, however, so this usage is not yet documented.
es: Note que los atributos del DOM también pueden ser manipulados como nodos en vez de simples cadenas de caracteres (*strings*). Sin embargo, es bastante raro que tengas que hacer esto, por lo que su uso aún no está documentado.

source: Interface
es: Interfaz

source: Section
es: Sección

source: Purpose
es: Propósito

source: Interface to the underlying implementation.
es: Interfaz para las implementaciones subyacentes.

source: Base interface for most objects in a document.
es: Interfaz base para la mayoría de objetos en un documento.

source: Interface for a sequence of nodes.
es: Interfaz para una secuencia de nodos.

source: Information about the declarations needed to process a document.
es: Información acerca de la declaraciones necesarias para procesar un documento.

source: Object which represents an entire document.
es: Objeto que representa un documento entero.

source: Element nodes in the document hierarchy.
es: Nodos elemento en la jerarquía del documento.

source: Attribute value nodes on element nodes.
es: Nodos de los valores de los atributos en los elementos nodo.

source: Representation of comments in the source document.
es: Representación de los comentarios en el documento fuente.

source: Nodes containing textual content from the document.
es: Nodos con contenido textual del documento.

source: Processing instruction representation.
es: Representación de instrucción del procesamiento.

source: An additional section describes the exceptions defined for working with the DOM in Python.
es: Una sección adicional describe las excepciones definidas para trabajar con el *DOM* en Python.

source: DOMImplementation Objects
es: Objetos *DOMImplementation*

source: The :class:`DOMImplementation` interface provides a way for applications to determine the availability of particular features in the DOM they are using. DOM Level 2 added the ability to create new :class:`Document` and :class:`DocumentType` objects using the :class:`DOMImplementation` as well.
es: La interfaz :class:`DOMImplementation` proporciona una forma para que las aplicaciones determinen la disponibilidad de características particulares en el *DOM* que están usando. El *DOM* nivel 2 añadió la habilidad de crear nuevos objetos :class:`Document` y :class:`DocumentType` usando :class:`DOMImplementation` también.

source: Return ``True`` if the feature identified by the pair of strings *feature* and *version* is implemented.
es: Retorna ``True`` si la característica identificada por el par de cadenas de caracteres *feature* y *version* está implementada.

source: Return a new :class:`Document` object (the root of the DOM), with a child :class:`Element` object having the given *namespaceUri* and *qualifiedName*. The *doctype* must be a :class:`DocumentType` object created by :meth:`createDocumentType`, or ``None``. In the Python DOM API, the first two arguments can also be ``None`` in order to indicate that no :class:`Element` child is to be created.
es: Retorna un nuevo objeto :class:`Document` (la raíz del DOM), con un hijo objeto :class:`Element` teniendo el *namespaceUri* y *qualifiedName* dados. El *doctype* debe ser un :class:`DocumentType` creado por :meth:`createDocumentType` o ``None``. En la *DOM API* de Python, los primeros argumentos pueden ser ``None`` para indicar que ningún hijo :class:`Element` va a ser creado.

source: Return a new :class:`DocumentType` object that encapsulates the given *qualifiedName*, *publicId*, and *systemId* strings, representing the information contained in an XML document type declaration.
es: Retorna un nuevo objeto :class:`DocumentType` que encapsula las cadenas de caracteres *qualifiedName*, *publicId*, y *systemId* dadas, representando la información contenida en un tipo de declaración de documento XML.

source: Node Objects
es: Objetos Nodo

source: All of the components of an XML document are subclasses of :class:`Node`.
es: Todos los componentes de un documento XML son sub-clases de :class:`Node`.

source: An integer representing the node type. Symbolic constants for the types are on the :class:`Node` object: :const:`ELEMENT_NODE`, :const:`ATTRIBUTE_NODE`, :const:`TEXT_NODE`, :const:`CDATA_SECTION_NODE`, :const:`ENTITY_NODE`, :const:`PROCESSING_INSTRUCTION_NODE`, :const:`COMMENT_NODE`, :const:`DOCUMENT_NODE`, :const:`DOCUMENT_TYPE_NODE`, :const:`NOTATION_NODE`. This is a read-only attribute.
es: Un entero representando el tipo de nodo. Las Constantes simbólicas para los tipos están en el objeto :class:`Nodo`: :const:`ELEMENT_NODE`, :const:`ATTRIBUTE_NODE`, :const:`TEXT_NODE`, :const:`CDATA_SECTION_NODE`, :const:`ENTITY_NODE`, :const:`PROCESSING_INSTRUCTION_NODE`, :const:`COMMENT_NODE`, :const:`DOCUMENT_NODE`, :const:`DOCUMENT_TYPE_NODE`, :const:`NOTATION_NODE`. Este es un atributo sólo de lectura.

source: The parent of the current node, or ``None`` for the document node. The value is always a :class:`Node` object or ``None``. For :class:`Element` nodes, this will be the parent element, except for the root element, in which case it will be the :class:`Document` object. For :class:`Attr` nodes, this is always ``None``. This is a read-only attribute.
es: El padre del nodo actual, o ``None`` para el nodo del documento. El valor es siempre un objeto :class:`Node` o ``None``. Para los nodos :class:`Element`, este será el elemento padre, excepto para el elemento raíz, en cuyo caso será el objeto :class:`Document`. Para los nodos :class:`Attr`, este siempre es ``None``. Este es un atributo de sólo lectura.

source: A :class:`NamedNodeMap` of attribute objects. Only elements have actual values for this; others provide ``None`` for this attribute. This is a read-only attribute.
es: Un :class:`NamedNodeMap` de objetos de atributos. Sólo los elementos tienes un valor real para esto; otros nodos proporcionan ``None`` para este atributo. Este es un atributo de sólo lectura.

source: The node that immediately precedes this one with the same parent. For instance the element with an end-tag that comes just before the *self* element's start-tag. Of course, XML documents are made up of more than just elements so the previous sibling could be text, a comment, or something else. If this node is the first child of the parent, this attribute will be ``None``. This is a read-only attribute.
es: El nodo que precede inmediatamente este nodo con el mismo padre. Por ejemplo el elemento con una etiqueta final que viene justo antes de la etiqueta del comienzo del elemento *self*. Por supuesto, los documentos XML está hechos de más que sólo elementos por lo que el hermano anterior puede ser un texto, un comentario, o algo más. Si este nodo es el primer hijo del padre, este atributo será ``None``. Este es un atributo de sólo lectura.

source: The node that immediately follows this one with the same parent. See also :attr:`previousSibling`. If this is the last child of the parent, this attribute will be ``None``. This is a read-only attribute.
es: El nodo que sigue inmediatamente este nodo con el mismo padre. Véase también :attr:`previousSibling`. Si este es el último hijo del padre, este atributo será ``None``. Este es un atributo de sólo lectura.

source: A list of nodes contained within this node. This is a read-only attribute.
es: Una lista de nodos contenidos dentro de este nodo. Este es un atributo de sólo lectura.

source: The first child of the node, if there are any, or ``None``. This is a read-only attribute.
es: El primer hijo del nodo, si hay alguno, o ``None``. Este es un atributo de sólo lectura.

source: The last child of the node, if there are any, or ``None``. This is a read-only attribute.
es: El último hijo del nodo, si hay alguno, o ``None``. Este es un atributo de sólo lectura.

source: The part of the :attr:`tagName` following the colon if there is one, else the entire :attr:`tagName`. The value is a string.
es: La parte del :attr:`tagName` seguido de los dos puntos si hay uno, si no, el :attr:`tagName` entero. El valor es una cadena de caracteres.

source: The part of the :attr:`tagName` preceding the colon if there is one, else the empty string. The value is a string, or ``None``.
es: La parte del :attr:`tagName` antes de los dos puntos si hay uno, si no, la cadena de caracteres vacía. El valor es una cadena, o ``None``.

source: The namespace associated with the element name. This will be a string or ``None``. This is a read-only attribute.
es: El espacio de nombres asociado con el nombre del elemento. Este será una cadena de caracteres o ``None``. Este es una atributo de sólo lectura.

source: This has a different meaning for each node type; see the DOM specification for details. You can always get the information you would get here from another property such as the :attr:`tagName` property for elements or the :attr:`name` property for attributes. For all node types, the value of this attribute will be either a string or ``None``. This is a read-only attribute.
es: Este tiene un significado diferente para cada tipo de nodo; véase la especificación del DOM para los detalles. Siempre puedes obtener la información que obtendrías aquí desde otra propiedad como la propiedad :attr:`tagName` para elementos o la propiedad :attr:`name` para atributos. Para todos los tipos de nodo, el valor de este atributo tendrá o una cadena de caracteres o ``None``. Este es un atributo de sólo lectura.

source: This has a different meaning for each node type; see the DOM specification for details. The situation is similar to that with :attr:`nodeName`. The value is a string or ``None``.
es: Este tiene un significado diferente para cada tipo de nodo; véase la especificación del DOM para los detalles. La situación es similar a ese con :attr:`nodeName`. El valor es una cadena de caracteres o ``None``.

source: Return ``True`` if the node has any attributes.
es: Retorna ``True`` si el nodo tiene algún atributo.

source: Return ``True`` if the node has any child nodes.
es: Retorna ``True`` si el nodo tiene algún nodo hijo.

source: Return ``True`` if *other* refers to the same node as this node. This is especially useful for DOM implementations which use any sort of proxy architecture (because more than one object can refer to the same node).
es: Retorna ``True`` si *other* hace referencia al mismo nodo como este nodo. Esto es especialmente útil para las implementaciones DOM que usan una arquitectura *proxy* de cualquier tipo (porque más de un objeto puede hacer referencia al mismo nodo).

source: This is based on a proposed DOM Level 3 API which is still in the "working draft" stage, but this particular interface appears uncontroversial. Changes from the W3C will not necessarily affect this method in the Python DOM interface (though any new W3C API for this would also be supported).
es: Esto se basa en una *DOM API* de nivel 3 propuesta que está en la etapa de "borrador de trabajo" (*"working draft"*), pero esta interfaz en particular no parece controversial. Los cambios del *W3C* necesariamente no afectaran este método en la interfaz del *DOM* del Python (aunque cualquier nueva *API* del *W3C* para esto también sería soportado).

source: Add a new child node to this node at the end of the list of children, returning *newChild*. If the node was already in the tree, it is removed first.
es: Añade un nuevo nodo hijo a este nodo al final de la lista de hijos, retornando *newChild*. Si el nodo ya estaba en el árbol, este se remueve primero.
