Repository: python/python-docs-es
Catalog: library/xml.sax.handler.po
Languages: es

source: Objects with this interface are used to receive error and warning information from the :class:`~xml.sax.xmlreader.XMLReader`. If you create an object that implements this interface, then register the object with your :class:`~xml.sax.xmlreader.XMLReader`, the parser will call the methods in your object to report all warnings and errors. There are three levels of errors available: warnings, (possibly) recoverable errors, and unrecoverable errors. All methods take a :exc:`~xml.sax.SAXParseException` as the only parameter. Errors and warnings may be converted to an exception by raising the passed-in exception object.
es: Los objetos con esta interfaz se usan para recibir información de error y advertencia del :class:`~xml.sax.xmlreader.XMLReader`. Si creas un objeto que implemente esta interfaz, y luego registras el objeto con tu :class:`~xml.sax.xmlreader.XMLReader`, el parser (analizador) invocará a los métodos de tu objeto para informar de todas las advertencias y errores. Hay tres niveles de errores disponibles: advertencias, errores (posiblemente) recuperables y errores no recuperables. Todos los métodos toman un :exc:`~xml.sax.SAXParseException` como único parámetro. Los errores y advertencias pueden ser convertidos en una excepción lanzando el objeto de excepción pasado.

source: Called when the parser encounters a recoverable error. If this method does not raise an exception, parsing may continue, but further document information should not be expected by the application. Allowing the parser to continue may allow additional errors to be discovered in the input document.
es: Invocación cuando el parser (analizador) encuentra un error recuperable. Si este método no lanza una excepción, el análisis sintáctico puede continuar, pero la aplicación no debe esperar más información del documento. Permitir que el parser (analizador) continúe puede permitir que se descubran errores adicionales en el documento de entrada.

source: Called when the parser encounters an error it cannot recover from; parsing is expected to terminate when this method returns.
es: Invocación cuando el parser (analizador) encuentra un error del que no puede recuperarse; se espera que el análisis sintáctico termine cuando vuelva este método.

source: Called when the parser presents minor warning information to the application. Parsing is expected to continue when this method returns, and document information will continue to be passed to the application. Raising an exception in this method will cause parsing to end.
es: Invocación cuando el parser (analizador) presenta información de advertencia menor a la aplicación. Se espera que el análisis sintáctico continúe cuando vuelva este método, y la información del documento seguirá pasando a la aplicación. Si se lanza una excepción con este método, el análisis sintáctico terminará.

source: LexicalHandler Objects
es: Objetos DTDHandler

source: Optional SAX2 handler for lexical events.
es: Handler (manipulador) de extensión opcional para eventos léxicos SAX2.

source: This handler is used to obtain lexical information about an XML document. Lexical information includes information describing the document encoding used and XML comments embedded in the document, as well as section boundaries for the DTD and for any CDATA sections. The lexical handlers are used in the same manner as content handlers.
es: Este handler se usa para obtener información léxica de un documento XML. La información léxica incluye información que describe la codificación del documento usado u los comentarios XML embebidos en el documento, como también una sección para el DTD y para cada sección CDTA. Estos manipuladores léxicos son usado de la misma forma que los manipuladores de contenido (content handlers).

source: Set the LexicalHandler of an XMLReader by using the setProperty method with the property identifier ``'http://xml.org/sax/properties/lexical-handler'``.
es: Configurar el LexicalHandlerde un XMLReader usando el método setProperty con la propiedad identificadora ``'http://xml.org/sax/properties/lexical-handler'``.

source: Reports a comment anywhere in the document (including the DTD and outside the document element).
es: Reporta un comentario en cualquier lugar en el documento (incluyendo el DTD y elementos por fuera del documento).

source: Reports the start of the DTD declarations if the document has an associated DTD.
es: Reporta el estado de las declaraciones del DTD en caso de tenga asociado un DTD.

source: Reports the end of DTD declaration.
es: Reporta el fin de la declaración del DTD.

source: Reports the start of a CDATA marked section.
es: Reporta el inicio de la sección CDATA marcada.

source: The contents of the CDATA marked section will be reported through the characters handler.
es: El contenido de la sección marcada del CDATA se reportará a través de manipulador de caracteres.

source: Reports the end of a CDATA marked section.
es: Reporta el final de la sección marcada del CDATA.
