Repository: python/python-docs-es
Catalog: library/xml.sax.handler.po
Languages: es

source: The SAX API defines five kinds of handlers: content handlers, DTD handlers, error handlers, entity resolvers and lexical handlers. Applications normally only need to implement those interfaces whose events they are interested in; they can implement the interfaces in a single object or in multiple objects. Handler implementations should inherit from the base classes provided in the module :mod:`xml.sax.handler`, so that all methods get default implementations.
es: La API de SAX define cuatro tipos de manejadores: manejadores de contenido, manejadores de DTD, manejadores de errores y resolvedores de entidades. Normalmente, las aplicaciones solo necesitan implementar las interfaces cuyos eventos les interesan; pueden implementar las interfaces en un solo objeto o en múltiples objetos. Las implementaciones de los manejadores deben heredar de las clases base provistas en el módulo :mod:`xml.sax.handler`, de modo que todos los métodos obtengan implementaciones por defecto.

source: This is the main callback interface in SAX, and the one most important to applications. The order of events in this interface mirrors the order of the information in the document.
es: Esta es la principal interfaz de devolución de llamada en el SAX, y la más importante para las aplicaciones. El orden de los eventos en esta interfaz refleja el orden de la información en el documento.

source: Handle DTD events.
es: Manejar eventos de DTD.

source: This interface specifies only those DTD events required for basic parsing (unparsed entities and attributes).
es: Esta interfaz especifica solo los eventos DTD necesarios para el análisis básico (entidades y atributos no analizados).

source: Basic interface for resolving entities. If you create an object implementing this interface, then register the object with your Parser, the parser will call the method in your object to resolve all external entities.
es: Interfaz básica para resolver entidades. Si creas un objeto implementando esta interfaz, y luego registras el objeto con tu Parser, el parser (analizador) invocara al método en tu objeto para resolver todas las entidades externas.

source: Interface used by the parser to present error and warning messages to the application. The methods of this object control whether errors are immediately converted to exceptions or are handled in some other way.
es: Interfaz utilizada por el parser para presentar mensajes de error y advertencia a la aplicación. Los métodos de este objeto controlan si los errores se convierten inmediatamente en excepciones o se manejan de alguna otra manera.

source: Interface used by the parser to represent low frequency events which may not be of interest to many applications.
es: Interface usada por el parser para representar eventos de baja frecuencia que pueden no ser de interés para muchas aplicaciones.

source: In addition to these classes, :mod:`xml.sax.handler` provides symbolic constants for the feature and property names.
es: Además de estas clases, :mod:`xml.sax.handler` proporciona constantes simbólicas para los nombres de las características y propiedades.

source: true: Perform Namespace processing.
es: true: Realizar el procesamiento del Namespace (espacio de nombres).

source: false: Optionally do not perform Namespace processing (implies namespace-prefixes; default).
es: false: Opcionalmente no realizar el procesamiento del Namespace (espacio de nombres) (implica prefijos de espacio de nombres; por defecto).

source: access: (parsing) read-only; (not parsing) read/write
es: acceso: (parsing) solo de lectura; (not parsing) lectura/escritura

source: true: Report the original prefixed names and attributes used for Namespace declarations.
es: true: Reporte de los nombres prefijados originales y los atributos utilizados para las declaraciones del Namespace (espacio de nombres).

source: false: Do not report attributes used for Namespace declarations, and optionally do not report original prefixed names (default).
es: false: No informar de los atributos utilizados para las declaraciones del Namespace (espacio de nombres), y opcionalmente no informar de los nombres prefijados originales (por defecto).

source: true: All element names, prefixes, attribute names, Namespace URIs, and local names are interned using the built-in intern function.
es: true: Todos los nombres de elementos, prefijos, nombres de atributos, URIs del Namespace (espacio de nombres) y nombres locales son internados usando la función interna incorporada.

source: false: Names are not necessarily interned, although they may be (default).
es: false: Los nombres no están necesariamente internados, aunque pueden estarlo (por defecto).

source: true: Report all validation errors (implies external-general-entities and external-parameter-entities).
es: true: Reportar de todos los errores de validación (implica entidades generales externas y entidades de parámetros externos).

source: false: Do not report validation errors.
es: false: No informe de los errores de validación.

source: value: ``"http://xml.org/sax/features/external-general-entities"``
es: value: ``"http://xml.org/sax/features/external-parameter-entities"``

source: true: Include all external general (text) entities.
es: true: Incluye todas las entidades externas generales de texto (text).

source: false: Do not include external general entities.
es: false: No incluya entidades generales externas.

source: true: Include all external parameter entities, including the external DTD subset.
es: true: Incluye todas las entidades paramétricas externas, incluyendo el subconjunto DTD externo.

source: false: Do not include any external parameter entities, even the external DTD subset.
es: false: No incluya ninguna entidad paramétrica externa, ni siquiera el subconjunto DTD externo.

source: List of all features.
es: Lista de todas las características.

source: data type: xml.sax.handler.LexicalHandler (not supported in Python 2)
es: data type: xml.sax.sax2lib.LexicalHandler (no soportado en Python 2)

source: description: An optional extension handler for lexical events like comments.
es: descripción: Un handler (manipulador) de extensión opcional para eventos léxicos como los comentarios.

source: access: read/write
es: acceso: read/write (leer/escribir)

source: data type: xml.sax.sax2lib.DeclHandler (not supported in Python 2)
es: data type: xml.sax.sax2lib.DeclHandler (no soportado en Python 2)

source: description: An optional extension handler for DTD-related events other than notations and unparsed entities.
es: description: Un gestor de extensión opcional para eventos relacionados con la DTD que no sean anotaciones y entidades no preparadas.

source: description: When parsing, the current DOM node being visited if this is a DOM iterator; when not parsing, the root DOM node for iteration.
es: descripción: Cuando se analiza, el nodo DOM actual que se visita si se trata de un iterador DOM; cuando no se analiza, el nodo DOM raíz para la iteración.

source: data type: Bytes
es: tipo de datos: Bytes

source: description: The literal string of characters that was the source for the current event.
es: description: La cadena literal de caracteres que fue la fuente del evento actual.

source: access: read-only
es: acceso: solo-lectura

source: List of all known property names.
es: Lista de todos los nombres de propiedades conocidas.

source: ContentHandler Objects
es: Objetos ContentHandler

source: Users are expected to subclass :class:`ContentHandler` to support their application. The following methods are called by the parser on the appropriate events in the input document:
es: Se espera que los usuarios subclasifiquen :class:`ContentHandler` para apoyar su aplicación. Los siguientes métodos son llamados por el analizador en los eventos apropiados en el documento de entrada:

source: Called by the parser to give the application a locator for locating the origin of document events.
es: Invocado por el parser (analizador) para dar a la aplicación un localizador para determinar el origen de los eventos del documento.

source: SAX parsers are strongly encouraged (though not absolutely required) to supply a locator: if it does so, it must supply the locator to the application by invoking this method before invoking any of the other methods in the DocumentHandler interface.
es: Se recomienda encarecidamente a los parsers (analizadores) SAX (aunque no es absolutamente necesario) que proporcionen un localizador: si lo hace, debe proporcionar el localizador a la aplicación invocando este método antes de invocar cualquiera de los otros métodos de la interfaz DocumentHandler.

source: The locator allows the application to determine the end position of any document-related event, even if the parser is not reporting an error. Typically, the application will use this information for reporting its own errors (such as character content that does not match an application's business rules). The information returned by the locator is probably not sufficient for use with a search engine.
es: El localizador permite a la aplicación determinar la posición final de cualquier evento relacionado con el documento, incluso si el analizador no informa de un error. Normalmente, la aplicación utilizará esta información para informar de sus propios errores (como el contenido de los caracteres que no coinciden con las reglas de negocio de la aplicación). Es probable que la información retornada por el localizador no sea suficiente para su uso con un motor de búsqueda.

source: Note that the locator will return correct information only during the invocation of the events in this interface. The application should not attempt to use it at any other time.
es: Tenga en cuenta que el localizador retornará la información correcta solo durante la invocación de los eventos en esta interfaz. La aplicación no debe intentar utilizarlo en ningún otro momento.

source: Receive notification of the beginning of a document.
es: Recibir la notificación del inicio de un documento.

source: The SAX parser will invoke this method only once, before any other methods in this interface or in DTDHandler (except for :meth:`setDocumentLocator`).
es: El parser (analizador) SAX invocará este método solo una vez, antes que cualquier otro método en esta interfaz o en DTDHandler (excepto :meth:`setDocumentLocator`).

source: Receive notification of the end of a document.
es: Recibir una notificación del final de un documento.

source: The SAX parser will invoke this method only once, and it will be the last method invoked during the parse. The parser shall not invoke this method until it has either abandoned parsing (because of an unrecoverable error) or reached the end of input.
es: El analizador (parser) SAX invocará este método solo una vez, y será el último método invocado durante el análisis. El analizador no invocará este método hasta que no haya abandonado el análisis sintáctico (debido a un error irrecuperable) o haya llegado al final de la entrada.

source: Begin the scope of a prefix-URI Namespace mapping.
es: Comienza el alcance de un mapeo del prefijo-URI Namespace.

source: The information from this event is not necessary for normal Namespace processing: the SAX XML reader will automatically replace prefixes for element and attribute names when the ``feature_namespaces`` feature is enabled (the default).
es: La información de este evento no es necesaria para el procesamiento normal del Namespace (espacio de nombres): el lector de XML SAX sustituirá automáticamente los prefijos de los nombres de elementos y atributos cuando se active la función ``feature_namespaces`` default (el valor por defecto).

source: There are cases, however, when applications need to use prefixes in character data or in attribute values, where they cannot safely be expanded automatically; the :meth:`startPrefixMapping` and :meth:`endPrefixMapping` events supply the information to the application to expand prefixes in those contexts itself, if necessary.
es: Sin embargo, hay casos en que las aplicaciones necesitan utilizar prefijos en los datos de los caracteres o en los valores de los atributos, en los que no se pueden expandir automáticamente de forma segura; los eventos :meth:`startPrefixMapping` y :meth:`endPrefixMapping` suministran la información a la aplicación para expandir los prefijos en esos contextos por sí mismos, si es necesario.

source: Note that :meth:`startPrefixMapping` and :meth:`endPrefixMapping` events are not guaranteed to be properly nested relative to each-other: all :meth:`startPrefixMapping` events will occur before the corresponding :meth:`startElement` event, and all :meth:`endPrefixMapping` events will occur after the corresponding :meth:`endElement` event, but their order is not guaranteed.
es: Note que los eventos :meth:`startPrefixMapping` y :meth:`endPrefixMapping` no están garantizados de estar apropiadamente anidados en relación a cada uno: todos los eventos :meth:`startPrefixMapping` ocurrirán antes del correspondiente evento :meth:`startElement`, y todos los eventos :meth:`endPrefixMapping` ocurrirán después del correspondiente evento :meth:`endElement`, pero su orden no está garantizado.

source: End the scope of a prefix-URI mapping.
es: Terminar con el alcance de un mapeo de prefijos-URI.

source: See :meth:`startPrefixMapping` for details. This event will always occur after the corresponding :meth:`endElement` event, but the order of :meth:`endPrefixMapping` events is not otherwise guaranteed.
es: Ver :meth:`startPrefixMapping` para más detalles. Este evento siempre ocurrirá después del correspondiente evento :meth:`endElement`, pero el orden de los eventos :meth:`endPrefixMapping` no está garantizado.

source: Signals the start of an element in non-namespace mode.
es: Señala el inicio de un elemento en modo no espacial.

source: The *name* parameter contains the raw XML 1.0 name of the element type as a string and the *attrs* parameter holds an object of the :class:`~xml.sax.xmlreader.Attributes` interface (see :ref:`attributes-objects`) containing the attributes of the element. The object passed as *attrs* may be re-used by the parser; holding on to a reference to it is not a reliable way to keep a copy of the attributes. To keep a copy of the attributes, use the :meth:`copy` method of the *attrs* object.
es: El parámetro *name* contiene el nombre XML 1.0 en bruto del tipo de elemento como una cadena y el parámetro *attrs* contiene un objeto de la interfaz :class:`~xml.sax.xmlreader.Attributes` (véase :ref:`attributes-objects`) que contiene los atributos del elemento. El objeto pasado como *attrs* puede ser reutilizado por el parser (analizador); mantener una referencia a él no es una forma fiable de conservar una copia de los atributos. Para guardar una copia de los atributos, usa el método :meth:`copy` del objeto *attrs*.

source: Signals the end of an element in non-namespace mode.
es: Señala el final de un elemento en modo no espacial.

source: The *name* parameter contains the name of the element type, just as with the :meth:`startElement` event.
es: El parámetro *name* contiene el nombre del tipo de elemento, al igual que con el evento :meth:`startElement`.

source: Signals the start of an element in namespace mode.
es: Señala el inicio de un elemento en el modo de Namespace (espacio de nombres).

source: The *name* parameter contains the name of the element type as a ``(uri, localname)`` tuple, the *qname* parameter contains the raw XML 1.0 name used in the source document, and the *attrs* parameter holds an instance of the :class:`~xml.sax.xmlreader.AttributesNS` interface (see :ref:`attributes-ns-objects`) containing the attributes of the element. If no namespace is associated with the element, the *uri* component of *name* will be ``None``. The object passed as *attrs* may be re-used by the parser; holding on to a reference to it is not a reliable way to keep a copy of the attributes. To keep a copy of the attributes, use the :meth:`copy` method of the *attrs* object.
es: El parámetro *name* contiene el nombre del tipo de elemento como una tupla ``(uri, localname)``, el parámetro *qname* contiene el nombre XML 1.0 en bruto usado en el documento fuente, y el parámetro *attrs* contiene una instancia de la interfaz :class:`~xml.sax.xmlreader.AttributesNS` (ver :ref:`attributes-ns-objects`) que contiene los atributos del elemento. Si no hay ningún Namespace (espacio de nombres) asociado al elemento, el componente *uri* de *name* será ``Ninguno``. El objeto pasado como *attrs* puede ser reutilizado por el analizador; mantener una referencia a él no es una forma fiable de conservar una copia de los atributos. Para guardar una copia de los atributos, usa el método :meth:`copy`` del objeto *attrs*.

source: Parsers may set the *qname* parameter to ``None``, unless the ``feature_namespace_prefixes`` feature is activated.
es: Los parsers (analizadores) pueden establecer el parámetro *qname* como ``None``, a menos que se active la función ``feature_namespace_prefixes``.

source: Signals the end of an element in namespace mode.
es: Señala el final de un elemento en el modo de namespace.

source: The *name* parameter contains the name of the element type, just as with the :meth:`startElementNS` method, likewise the *qname* parameter.
es: El parámetro *name* contiene el nombre del tipo de elemento, al igual que con el método :meth:`startElementNS`, así como el parámetro *qname*.

source: Receive notification of character data.
es: Recibir la notificación de los datos de los caracteres.

source: The Parser will call this method to report each chunk of character data. SAX parsers may return all contiguous character data in a single chunk, or they may split it into several chunks; however, all of the characters in any single event must come from the same external entity so that the Locator provides useful information.
es: El Parser (analizador) llamará a este método para informar de cada dato de carácter. Los parsers (analizadores) SAX pueden retornar todos los datos de caracteres contiguos en un solo trozo, o pueden dividirlos en varios trozos; sin embargo, todos los caracteres de un mismo evento deben provenir de la misma entidad externa para que el Localizador proporcione información útil.

source: *content* may be a string or bytes instance; the ``expat`` reader module always produces strings.
es: **content** puede ser una cadena o una instancia de bytes; el módulo lector de "Expat" siempre produce cadenas.

source: The earlier SAX 1 interface provided by the Python XML Special Interest Group used a more Java-like interface for this method. Since most parsers used from Python did not take advantage of the older interface, the simpler signature was chosen to replace it. To convert old code to the new interface, use *content* instead of slicing content with the old *offset* and *length* parameters.
es: La anterior interfaz SAX 1 proporcionada por el Grupo de Interés Especial de Python XML utilizaba una interfaz más parecida a Java para este método. Dado que la mayoría de los parsers (analizadores) utilizados de Python no aprovecharon la interfaz más antigua, se eligió la firma más simple para reemplazarla. Para convertir el código antiguo en la nueva interfaz, se utilizó *content* en lugar de cortar el contenido con los antiguos parámetros *offset* y *length*.

source: Receive notification of ignorable whitespace in element content.
es: Recibir notificación de espacios en blanco ignorables en el contenido de los elementos.

source: Validating Parsers must use this method to report each chunk of ignorable whitespace (see the W3C XML 1.0 recommendation, section 2.10): non-validating parsers may also use this method if they are capable of parsing and using content models.
es: Los parsers validadores deben utilizar este método para informar de cada trozo de espacio en blanco desconocido (véase la recomendación W3C XML 1.0, sección 2.10): los analizadores no validadores también pueden utilizar este método si son capaces de analizar y utilizar modelos de contenido.

source: SAX parsers may return all contiguous whitespace in a single chunk, or they may split it into several chunks; however, all of the characters in any single event must come from the same external entity, so that the Locator provides useful information.
es: Los parsers (analizadores) SAX pueden retornar todos los espacios blancos contiguos en un solo trozo, o pueden dividirlo en varios trozos; sin embargo, todos los caracteres de un mismo evento deben provenir de la misma entidad externa, para que el Localizador proporcione información útil.

source: Receive notification of a processing instruction.
es: Recibir la notificación de una instrucción de procesamiento.

source: The Parser will invoke this method once for each processing instruction found: note that processing instructions may occur before or after the main document element.
es: El Parser (analizador) invocará este método una vez por cada instrucción de procesamiento encontrada: nótese que las instrucciones de procesamiento pueden ocurrir antes o después del elemento principal del documento.

source: A SAX parser should never report an XML declaration (XML 1.0, section 2.8) or a text declaration (XML 1.0, section 4.3.1) using this method.
es: Un parser (analizador) SAX nunca debe informar de una declaración XML (XML 1.0, sección 2.8) o una declaración de texto (XML 1.0, sección 4.3.1) utilizando este método.

source: Receive notification of a skipped entity.
es: Recibir la notificación de una entidad salteada.

source: The Parser will invoke this method once for each entity skipped. Non-validating processors may skip entities if they have not seen the declarations (because, for example, the entity was declared in an external DTD subset). All processors may skip external entities, depending on the values of the ``feature_external_ges`` and the ``feature_external_pes`` properties.
es: El Parser invocará este método una vez por cada entidad omitida. Los procesos no validadores pueden omitir entidades si no han visto las declaraciones (porque, por ejemplo, la entidad fue declarada en un subconjunto DTD externo). Todos los procesos pueden omitir entidades externas, dependiendo de los valores de las propiedades ``feature_external_ges`` y ``feature_external_pes``.

source: DTDHandler Objects
es: Objetos DTDHandler

source: :class:`DTDHandler` instances provide the following methods:
es: :class:`DTDHandler` la instancia provee los siguientes métodos:

source: Handle a notation declaration event.
es: Manejar un evento de declaración de anotación.

source: Handle an unparsed entity declaration event.
es: Manejar un evento de declaración de entidad no preparada.

source: EntityResolver Objects
es: Objetos EntityResolver

source: Resolve the system identifier of an entity and return either the system identifier to read from as a string, or an InputSource to read from. The default implementation returns *systemId*.
es: Resolver el identificador de sistema de una entidad y retornar ya sea el identificador de sistema para leerlo como una cadena, o una fuente de entrada para leerlo. La implementación por defecto retorna *systemId*.

source: ErrorHandler Objects
es: Objetos ErrorHandler
