Repository: python/python-docs-es
Catalog: library/xmlrpc.client.po
Languages: es

source: Create an object used to boxcar method calls. *server* is the eventual target of the call. Calls can be made to the result object, but they will immediately return ``None``, and only store the call name and parameters in the :class:`MultiCall` object. Calling the object itself causes all stored calls to be transmitted as a single ``system.multicall`` request. The result of this call is a :term:`generator`; iterating over this generator yields the individual results.
es: Crea un objeto usado para llamadas al método boxcar. *server* es el objetivo final de la llamada. Se pueden realizar llamadas al objeto de resultado, pero retornarán inmediatamente ``None`` y solo almacenarán el nombre y los parámetros de la llamada en el objeto :class:`MultiCall`. Llamar al objeto en sí hace que todas las llamadas almacenadas se transmitan como una única solicitud de ``system.multicall``. El resultado de esta llamada es un :term:`generator`; iterar sobre este generador produce los resultados individuales.

source: A usage example of this class follows. The server code::
es: A continuación se muestra un ejemplo de uso de esta clase. El código del servidor::

source: Convenience Functions
es: Funciones de Conveniencia

source: Convert *params* into an XML-RPC request. or into a response if *methodresponse* is true. *params* can be either a tuple of arguments or an instance of the :exc:`Fault` exception class. If *methodresponse* is true, only a single value can be returned, meaning that *params* must be of length 1. *encoding*, if supplied, is the encoding to use in the generated XML; the default is UTF-8. Python's :const:`None` value cannot be used in standard XML-RPC; to allow using it via an extension, provide a true value for *allow_none*.
es: Convierta *params* en una solicitud XML-RPC. o en una respuesta si *methodresponse* es verdadero. *params* puede ser una tupla de argumentos o una instancia de la clase de excepción :exc:`Fault`. Si *methodresponse* es verdadero, solo se puede devolver un único valor, lo que significa que *params* debe tener una longitud de 1. *encoding*, si se proporciona, es la codificación que se utilizará en el XML generado; el predeterminado es UTF-8. El valor de Python :const:`None` no se puede usar en XML-RPC estándar; para permitir su uso a través de una extensión, proporcione un valor verdadero para *allow_none*.

source: Convert an XML-RPC request or response into Python objects, a ``(params, methodname)``. *params* is a tuple of argument; *methodname* is a string, or ``None`` if no method name is present in the packet. If the XML-RPC packet represents a fault condition, this function will raise a :exc:`Fault` exception. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default.
es: Convierte una solicitud o respuesta XML-RPC en objetos Python, un ``(params, methodname)``. *params* es una tupla de argumento; *methodname* es una cadena de caracteres, o ``None`` si no hay ningún nombre de método presente en el paquete. Si el paquete XML-RPC representa una condición de falla, esta función generará una excepción :exc:`Fault`. La flag *use_builtin_types* puede usarse para hacer que los valores de fecha/hora se presenten como objetos de :class:`datetime.datetime` y datos binarios que se presenten como objetos de :class:`bytes`; esta flag es falsa por defecto.

source: The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
es: La flag obsoleta *use_datetime* es similar a *use_builtin_types* pero esto aplica solo a valores fecha/hora.

source: Example of Client Usage
es: Ejemplo de Uso de Cliente

source: To access an XML-RPC server through a HTTP proxy, you need to define a custom transport. The following example shows how::
es: Para acceder a un servidor XML-RPC a través de un proxy HTTP, debe definir un transporte personalizado. El siguiente ejemplo muestra cómo:

source: Example of Client and Server Usage
es: Ejemplo de Uso de Cliente y Servidor

source: See :ref:`simplexmlrpcserver-example`.
es: Vea :ref:`simplexmlrpcserver-example`.

source: Footnotes
es: Pie de notas

source: This approach has been first presented in `a discussion on xmlrpc.com <https://web.archive.org/web/20060624230303/http://www.xmlrpc.com/discuss/msgReader$1208?mode=topic>`_.
es: Este enfoque se presentó por primera vez en `una discusión en xmlrpc.com <https://web.archive.org/web/20060624230303/http://www.xmlrpc.com/discuss/msgReader$1208?mode=topic>`_.
