Repository: python/python-docs-es
Catalog: library/xmlrpc.client.po
Languages: es

source: :mod:`xmlrpc.client` --- XML-RPC client access
es: :mod:`xmlrpc.client` --- acceso cliente XML-RPC

source: XML-RPC is a Remote Procedure Call method that uses XML passed via HTTP(S) as a transport. With it, a client can call methods with parameters on a remote server (the server is named by a URI) and get back structured data. This module supports writing XML-RPC client code; it handles all the details of translating between conformable Python objects and XML on the wire.
es: XML-RPC es un método de llamada a procedimiento remoto que utiliza XML pasado a través de HTTP(S) como transporte. Con él, un cliente puede llamar a métodos con parámetros en un servidor remoto (el servidor es nombrado por un URI) y recuperar datos estructurados. Este módulo admite la escritura de código de cliente XML-RPC; maneja todos los detalles de la traducción entre objetos de Python conformes y XML en el cable.

source: The :mod:`xmlrpc.client` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
es: El módulo :mod:`xmlrpc.client` no es seguro contra datos construidos maliciosamente. Si necesita analizar datos que no son de confianza o no autenticados, consulte :ref:`xml-vulnerabilities`.

source: For HTTPS URIs, :mod:`xmlrpc.client` now performs all the necessary certificate and hostname checks by default.
es: Para HTTPS URI, :mod:`xmlrpc.client` ahora realiza todas las comprobaciones necesarias de certificados y nombres de host de forma predeterminada.

source: A :class:`ServerProxy` instance is an object that manages communication with a remote XML-RPC server. The required first argument is a URI (Uniform Resource Indicator), and will normally be the URL of the server. The optional second argument is a transport factory instance; by default it is an internal :class:`SafeTransport` instance for https: URLs and an internal HTTP :class:`Transport` instance otherwise. The optional third argument is an encoding, by default UTF-8. The optional fourth argument is a debugging flag.
es: Una :class:`ServerProxy` instancia un objeto que gestiona la comunicación con un servidor XML-RPC remoto. El primer argumento requerido es un URI (*Uniform Resource Indicator*) y normalmente será la URL del servidor. El segundo argumento opcional es una instancia de fábrica de transporte; de forma predeterminada, es una instancia interna :class:`SafeTransport` para https: URL y una instancia interna HTTP :class:`Transport` en caso contrario. El tercer argumento opcional es una codificación, por defecto UTF-8. El cuarto argumento opcional es un indicador de depuración.

source: The following parameters govern the use of the returned proxy instance. If *allow_none* is true, the Python constant ``None`` will be translated into XML; the default behaviour is for ``None`` to raise a :exc:`TypeError`. This is a commonly-used extension to the XML-RPC specification, but isn't supported by all clients and servers; see `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>`_ for a description. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default. :class:`datetime.datetime`, :class:`bytes` and :class:`bytearray` objects may be passed to calls. The *headers* parameter is an optional sequence of HTTP headers to send with each request, expressed as a sequence of 2-tuples representing the header name and value. (e.g. `[('Header-Name', 'value')]`). The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
es: Los siguientes parámetros rigen el uso de la instancia de proxy retornada. Si *allow_none* es verdadero, la constante de Python ``None`` se traducirá a XML; el comportamiento predeterminado es que ``None`` genere un :exc:`TypeError`. Esta es una extensión de uso común para la especificación XML-RPC, pero no todos los clientes y servidores la admiten; ver `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>` _ para una descripción. La flag *use_builtin_types* puede usarse para hacer que los valores de fecha/hora se presenten como : clase: objetos `datetime.datetime` y datos binarios que se presenten como objetos :class:`datetime.datetime` y los datos binarios pueden ser presentados como objetos :class:`bytes`; esta flag es falsa por defecto. Los objetos :class:`datetime.datetime`, :class:`bytes` y :class:`bytearray` se pueden pasar a las llamadas. El parámetro *header* es una secuencia opcional de encabezados HTTP para enviar con cada solicitud, expresada como una secuencia de 2 tuplas que representan el nombre y el valor del encabezado. (por ejemplo, `[('Header-Name', 'value')]`). La flag obsoleta *use_datetime* es similar a *use_builtin_types* pero solo se aplica a los valores de fecha/hora.

source: The *use_builtin_types* flag was added.
es: La flag *use_builtin_types* fue añadida.

source: The *headers* parameter was added.
es: El parámetro *headers* fue añadida.

source: Both the HTTP and HTTPS transports support the URL syntax extension for HTTP Basic Authentication: ``http://user:pass@host:port/path``. The ``user:pass`` portion will be base64-encoded as an HTTP 'Authorization' header, and sent to the remote server as part of the connection process when invoking an XML-RPC method. You only need to use this if the remote server requires a Basic Authentication user and password. If an HTTPS URL is provided, *context* may be :class:`ssl.SSLContext` and configures the SSL settings of the underlying HTTPS connection.
es: Tanto los transportes HTTP como HTTPS admiten la extensión de sintaxis de URL para la autenticación básica HTTP:``http://user:pass@host:port/path``. La parte ``user:pass`` se codificará en base64 como un encabezado HTTP de 'Authorization' y se enviará al servidor remoto como parte del proceso de conexión al invocar un método XML-RPC. Solo necesita usar esto si el servidor remoto requiere un usuario y contraseña de autenticación básica. Si se proporciona una URL HTTPS, el *context* puede ser :class:`ssl.SSLContext` y configura la configuración SSL de la conexión HTTPS subyacente.

source: The returned instance is a proxy object with methods that can be used to invoke corresponding RPC calls on the remote server. If the remote server supports the introspection API, the proxy can also be used to query the remote server for the methods it supports (service discovery) and fetch other server-associated metadata.
es: La instancia retornada es un objeto proxy con métodos que se pueden utilizar para invocar las correspondientes llamadas RPC en el servidor remoto. Si el servidor remoto admite la API de introspección, el proxy también se puede utilizar para consultar al servidor remoto los métodos que admite (descubrimiento de servicios) y recuperar otros metadatos asociados al servidor.

source: Types that are conformable (e.g. that can be marshalled through XML), include the following (and except where noted, they are unmarshalled as the same Python type):
es: Los tipos que son conformes (por ejemplo, que se pueden clasificar a través de XML) incluyen lo siguiente (y, excepto donde se indique, no se clasifican como el mismo tipo de Python):

source: XML-RPC type
es: Tipo XML-RPC

source: Python type
es: Tipo de Python

source: :class:`int` in range from -2147483648 to 2147483647. Values get the ``<int>`` tag.
es: :class:`int` en el rango de -2147483648 a 2147483647. Los valores obtienen la etiqueta ``<int>`` .

source: ``double`` or ``float``
es: ``double`` o ``float``

source: :class:`float`. Values get the ``<double>`` tag.
es: :class:`float`. Los valores obtienen la etiqueta ``<double>``.

source: :class:`list` or :class:`tuple` containing conformable elements. Arrays are returned as :class:`lists <list>`.
es: :class:`list` o :class:`tuple` que contiene elementos determinados. Las matrices se retornan como :class:`lists <list>`.

source: :class:`dict`. Keys must be strings, values may be any conformable type. Objects of user-defined classes can be passed in; only their :attr:`~object.__dict__` attribute is transmitted.
es: :class:`dict`. Las claves deben ser cadenas de caracteres, los valores pueden ser de cualquier tipo determinado. Pueden pasarse objetos de clases definidas por el usuario; sólo se transmite su atributo :attr:`~object.__dict__` .

source: :class:`DateTime` or :class:`datetime.datetime`. Returned type depends on values of *use_builtin_types* and *use_datetime* flags.
es: :class:`DateTime` o :class:`datetime.datetime`. El tipo retornado depende de los valores de los indicadores *use_builtin_types* y *use_datetime* .

source: :class:`Binary`, :class:`bytes` or :class:`bytearray`. Returned type depends on the value of the *use_builtin_types* flag.
es: :class:`Binary`, :class:`bytes` o :class:`bytearray`. El tipo retornado depende del valor de la marca *use_builtin_types*.

source: The ``None`` constant. Passing is allowed only if *allow_none* is true.
es: La constante ``None``. Solo se permite pasar si *allow_none* es verdadero.

source: :class:`decimal.Decimal`. Returned type only.
es: :class:`decimal.Decimal`. Retornado solo el tipo.

source: This is the full set of data types supported by XML-RPC. Method calls may also raise a special :exc:`Fault` instance, used to signal XML-RPC server errors, or :exc:`ProtocolError` used to signal an error in the HTTP/HTTPS transport layer. Both :exc:`Fault` and :exc:`ProtocolError` derive from a base class called :exc:`Error`. Note that the xmlrpc client module currently does not marshal instances of subclasses of built-in types.
es: Este es el conjunto completo de tipos de datos admitidos por XML-RPC. Las llamadas a métodos también pueden generar una instancia especial :exc:`Fault`, que se usa para señalar errores del servidor XML-RPC, o :exc:`ProtocolError` que se usa para señalar un error en la capa de transporte HTTP/HTTPS. Ambos :exc:`Fault` y :exc:`ProtocolError` derivan de una clase base llamada :exc:`Error`. Tenga en cuenta que el módulo de cliente xmlrpc actualmente no clasifica instancias de subclases de tipos integrados.

source: When passing strings, characters special to XML such as ``<``, ``>``, and ``&`` will be automatically escaped. However, it's the caller's responsibility to ensure that the string is free of characters that aren't allowed in XML, such as the control characters with ASCII values between 0 and 31 (except, of course, tab, newline and carriage return); failing to do this will result in an XML-RPC request that isn't well-formed XML. If you have to pass arbitrary bytes via XML-RPC, use :class:`bytes` or :class:`bytearray` classes or the :class:`Binary` wrapper class described below.
es: Al pasar cadenas de caracteres, los caracteres especiales de XML como ``<``, ``>`` y ``&`` se escaparán automáticamente. Sin embargo, es responsabilidad de la persona que llama asegurarse de que la cadena de caracteres esté libre de caracteres que no están permitidos en XML, como los caracteres de control con valores ASCII entre 0 y 31 (excepto, por supuesto, tabulación, nueva línea y retorno de carro); no hacer esto resultará en una solicitud XML-RPC que no es XML bien formado. Si tiene que pasar bytes arbitrarios a través de XML-RPC, use las clases :class:`bytes` o :class:`bytearray` o la clase contenedora :class:`Binary` descrita a continuación.

source: :class:`Server` is retained as an alias for :class:`ServerProxy` for backwards compatibility. New code should use :class:`ServerProxy`.
es: :class:`Server` se conserva como un alias para :class:`ServerProxy` para compatibilidad con versiones anteriores. El nuevo código debe usar :class:`ServerProxy`.

source: Added the *context* argument.
es: Se agregó el argumento *context*.

source: Added support of type tags with prefixes (e.g. ``ex:nil``). Added support of unmarshalling additional types used by Apache XML-RPC implementation for numerics: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` and ``bigdecimal``. See http://ws.apache.org/xmlrpc/types.html for a description.
es: Se agregó soporte para etiquetas de tipo con prefijos (por ejemplo. ``ex:nil``). Se agregó soporte para desagrupar los tipos adicionales utilizados por la implementación Apache XML-RPC para números: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` y ``bigdecimal``. Consulte http://ws.apache.org/xmlrpc/types.html para obtener una descripción.

source: A good description of XML-RPC operation and client software in several languages. Contains pretty much everything an XML-RPC client developer needs to know.
es: Una buena descripción del funcionamiento de XML-RPC y del software cliente en varios idiomas. Contiene prácticamente todo lo que un desarrollador de cliente XML-RPC necesita saber.

source: Describes the XML-RPC protocol extension for introspection.
es: Describe la extensión del protocolo XML-RPC para la introspección.

source: The official specification.
es: La especificación oficial.

source: Fredrik Lundh's "unofficial errata, intended to clarify certain details in the XML-RPC specification, as well as hint at 'best practices' to use when designing your own XML-RPC implementations."
es: "Las erratas no oficiales de Fredrik Lundh, destinadas a aclarar ciertos detalles en la especificación XML-RPC, así como dar pistas sobre las 'mejores prácticas' para usar al diseñar sus propias implementaciones XML-RPC".

source: ServerProxy Objects
es: Objetos *ServerProxy*

source: A :class:`ServerProxy` instance has a method corresponding to each remote procedure call accepted by the XML-RPC server. Calling the method performs an RPC, dispatched by both name and argument signature (e.g. the same method name can be overloaded with multiple argument signatures). The RPC finishes by returning a value, which may be either returned data in a conformant type or a :class:`Fault` or :class:`ProtocolError` object indicating an error.
es: La instancia de :class:`ServerProxy` tiene un método correspondiente a cada llamada de procedimiento remoto aceptada por el servidor XML-RPC. Llamar al método realiza un RPC, enviado por nombre y firma de argumento (por ejemplo, el mismo nombre de método puede sobrecargarse con múltiples firmas de argumento). El RPC finaliza retornando un valor, que puede ser datos retornados en un tipo conforme o un objeto :class:`Fault` o :class:`ProtocolError` que indica un error.

source: Servers that support the XML introspection API support some common methods grouped under the reserved :attr:`~ServerProxy.system` attribute:
es: Los servidores que admiten la API de introspección XML admiten algunos métodos comunes agrupados bajo el atributo reservado :attr:`~ServerProxy.system`:

source: This method returns a list of strings, one for each (non-system) method supported by the XML-RPC server.
es: Este método retorna una lista de cadenas, una para cada método (que no es del sistema) admitido por el servidor XML-RPC.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns an array of possible signatures for this method. A signature is an array of types. The first of these types is the return type of the method, the rest are parameters.
es: Este método toma un parámetro, el nombre de un método implementado por el servidor XML-RPC. Retorna una matriz de posibles firmas para este método. Una firma es una variedad de tipos. El primero de estos tipos es el tipo de retorno del método, el resto son parámetros.

source: Because multiple signatures (ie. overloading) is permitted, this method returns a list of signatures rather than a singleton.
es: Debido a que se permiten múltiples firmas (es decir, sobrecarga), este método retorna una lista de firmas en lugar de un singleton.

source: Signatures themselves are restricted to the top level parameters expected by a method. For instance if a method expects one array of structs as a parameter, and it returns a string, its signature is simply "string, array". If it expects three integers and returns a string, its signature is "string, int, int, int".
es: Las propias firmas están restringidas a los parámetros de nivel superior esperados por un método. Por ejemplo, si un método espera una matriz de estructuras como parámetro y retorna una cadena de caracteres, su firma es simplemente "cadena, matriz". Si espera tres enteros y retorna una cadena, su firma es "string, int, int, int".

source: If no signature is defined for the method, a non-array value is returned. In Python this means that the type of the returned value will be something other than list.
es: Si no se define una firma para el método, se retorna un valor que no es una matriz. En Python, esto significa que el tipo de valor retornado será diferente a una lista.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns a documentation string describing the use of that method. If no such string is available, an empty string is returned. The documentation string may contain HTML markup.
es: Este método toma un parámetro, el nombre de un método implementado por el servidor XML-RPC. Retorna una cadena de caracteres de documentación que describe el uso de ese método. Si no hay tal cadena de caracteres disponible, se retorna una cadena de caracteres vacía. La cadena de caracteres de documentación puede contener marcado HTML.

source: Instances of :class:`ServerProxy` support the :term:`context manager` protocol for closing the underlying transport.
es: Las instancias de :class:`ServerProxy` admiten el protocolo :term:`context manager` para cerrar el transporte subyacente.

source: A working example follows. The server code::
es: A continuación se muestra un ejemplo práctico. El código del servidor::

source: The client code for the preceding server::
es: El código de cliente para el servidor anterior::

source: DateTime Objects
es: Objetos *DateTime*

source: This class may be initialized with seconds since the epoch, a time tuple, an ISO 8601 time/date string, or a :class:`datetime.datetime` instance. It has the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
es: Esta clase puede inicializarse con segundos desde la época, una tupla de tiempo, una cadena de fecha/hora ISO 8601 o una instancia :class:`datetime.datetime`. Tiene los siguientes métodos, soportados principalmente para uso interno por el código de clasificación/eliminación de clasificación:

source: Accept a string as the instance's new time value.
es: Acepta una cadena de caracteres como el nuevo valor de tiempo de la instancia.

source: Write the XML-RPC encoding of this :class:`DateTime` item to the *out* stream object.
es: Escribe la codificación XML-RPC de este elemento :class:`DateTime` en el objeto de flujo *out*.

source: It also supports certain of Python's built-in operators through rich comparison and :meth:`__repr__` methods.
es: También es compatible con algunos de los operadores integrados de Python a través de una rica comparación y métodos :meth:`__repr__`.

source: Binary Objects
es: Objetos binarios

source: This class may be initialized from bytes data (which may include NULs). The primary access to the content of a :class:`Binary` object is provided by an attribute:
es: Esta clase puede inicializarse a partir de datos de bytes (que pueden incluir NUL). El acceso principal al contenido de un objeto :class:`Binary` lo proporciona un atributo:

source: The binary data encapsulated by the :class:`Binary` instance. The data is provided as a :class:`bytes` object.
es: Los datos binarios encapsulados por la instancia :class:`Binary`. Los datos se proporcionan como un objeto :class:`bytes`.

source: :class:`Binary` objects have the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
es: Los objetos :class:`Binary` tienen los siguientes métodos, soportados principalmente para uso interno por el código de clasificación/desagrupación:

source: Accept a base64 :class:`bytes` object and decode it as the instance's new data.
es: Acepta un objeto base64 :class:`bytes` y se descodifica como los nuevos datos de la instancia.

source: Write the XML-RPC base 64 encoding of this binary item to the *out* stream object.
es: Escribe la codificación XML-RPC base 64 de este elemento binario en el objeto de flujo *out*.

source: It also supports certain of Python's built-in operators through :meth:`__eq__` and :meth:`__ne__` methods.
es: También admite algunos de los operadores integrados de Python a través de los métodos :meth:`__eq__` and :meth:`__ne__`.

source: Example usage of the binary objects. We're going to transfer an image over XMLRPC::
es: Ejemplo de uso de los objetos binarios. Vamos a transferir una imagen sobre XMLRPC::

source: The client gets the image and saves it to a file::
es: El cliente obtiene la imagen y la guarda en un archivo::

source: Fault Objects
es: Objetos Faults

source: A :class:`Fault` object encapsulates the content of an XML-RPC fault tag. Fault objects have the following attributes:
es: Un objeto :class:`Fault` encapsula el contenido de una etiqueta de error XML-RPC. Los objetos de error tienen los siguientes atributos:

source: A string indicating the fault type.
es: Una cadena de caracteres que indica el tipo de fallo.

source: A string containing a diagnostic message associated with the fault.
es: Una cadena de caracteres que contiene un mensaje de diagnóstico asociado con el fallo.

source: In the following example we're going to intentionally cause a :exc:`Fault` by returning a complex type object. The server code::
es: En el siguiente ejemplo vamos a causar intencionalmente un :exc:`Fault` al retornar un objeto de tipo complejo. El código del servidor::

source: ProtocolError Objects
es: Objetos ProtocolError

source: A :class:`ProtocolError` object describes a protocol error in the underlying transport layer (such as a 404 'not found' error if the server named by the URI does not exist). It has the following attributes:
es: El objeto :class:`ProtocolError` describe un error de protocolo en la capa de transporte subyacente (como un error 404 'no encontrado' si el servidor nombrado por el URI no existe). Tiene los siguientes atributos:

source: The URI or URL that triggered the error.
es: El URI o URL que provocó el error.

source: The error code.
es: El código de error.

source: The error message or diagnostic string.
es: El mensaje de error o la cadena de caracteres de diagnóstico.

source: A dict containing the headers of the HTTP/HTTPS request that triggered the error.
es: Un diccionario que contiene los encabezados de la solicitud HTTP/HTTPS que desencadenó el error.

source: In the following example we're going to intentionally cause a :exc:`ProtocolError` by providing an invalid URI::
es: En el siguiente ejemplo, vamos a causar intencionalmente un :exc:`ProtocolError` proporcionando un URI inválido::

source: MultiCall Objects
es: Objectos MultiCall

source: The :class:`MultiCall` object provides a way to encapsulate multiple calls to a remote server into a single request [#]_.
es: El objeto :class:`MultiCall` proporciona una forma de encapsular múltiples llamadas a un servidor remoto en una sola solicitud [#]_.
