Repository: python/python-docs-es
Catalog: library/zipapp.po
Languages: es

source: :mod:`zipapp` --- Manage executable Python zip archives
es: :mod:`zipapp` --- Gestiona archivadores zip ejecutables de Python

source: **Source code:** :source:`Lib/zipapp.py`
es: **Código fuente:** :source:`Lib/zipapp.py`

source: This module provides tools to manage the creation of zip files containing Python code, which can be :ref:`executed directly by the Python interpreter <using-on-interface-options>`. The module provides both a :ref:`zipapp-command-line-interface` and a :ref:`zipapp-python-api`.
es: Este módulo provee herramientas para administrar la creación de archivos zip que contengan código Python, los que pueden ser :ref:`ejecutados directamente por el intérprete de Python <using-on-interface-options>`. El módulo provee tanto una :ref:`zipapp-command-line-interface` y una :ref:`zipapp-python-api`.

source: Basic Example
es: Ejemplo básico

source: The following example shows how the :ref:`zipapp-command-line-interface` can be used to create an executable archive from a directory containing Python code. When run, the archive will execute the ``main`` function from the module ``myapp`` in the archive.
es: El siguiente ejemplo muestra cómo la :ref:`zipapp-command-line-interface` puede utilizarse para crear un archivador ejecutable de un directorio que contenga código en Python. Al ponerse en funcionamiento, el archivador ejecutará la función ``main`` del módulo ``myapp`` en el archivador.

source: Command-Line Interface
es: Interfaz de línea de comando

source: When called as a program from the command line, the following form is used:
es: En la ejecución como programa desde la línea de comandos, se utiliza el siguiente formato:

source: If *source* is a directory, this will create an archive from the contents of *source*. If *source* is a file, it should be an archive, and it will be copied to the target archive (or the contents of its shebang line will be displayed if the --info option is specified).
es: Si *source* es un directorio, se creará un archivador zip para los contenidos de *source*. Si *source* es un archivo, debería ser un archivador, y se copiará al archivador de destino (o los contenidos de su línea *shebang* se mostrarán si se especifica la opción --info).

source: The following options are understood:
es: Se aceptan las siguientes opciones:

source: Write the output to a file named *output*. If this option is not specified, the output filename will be the same as the input *source*, with the extension ``.pyz`` added. If an explicit filename is given, it is used as is (so a ``.pyz`` extension should be included if required).
es: Escribe la salida a un archivo llamado *output*. Si esta opción no está especificada, el nombre del archivo de salida será el mismo que la entrada *source*, con la extensión ``.pyz`` agregada. Si se provee de un nombre de archivo explícito, se usa tal como está (por lo que una extensión ``.pyz`` debería incluirse si esto se requiere).

source: An output filename must be specified if the *source* is an archive (and in that case, *output* must not be the same as *source*).
es: Un nombre de archivo de salida debe especificarse si *source* es un archivador (y en ese caso, *output* no debería ser igual que *source*).

source: Add a ``#!`` line to the archive specifying *interpreter* as the command to run. Also, on POSIX, make the archive executable. The default is to write no ``#!`` line, and not make the file executable.
es: Agrega una línea ``#!`` al archivador especificando *interpreter* como comando a ejecutar. También en POSIX, convierte al archivador en ejecutable. La opción por defecto es no escribir una línea ``#!``, y no hacer que el archivo sea ejecutable.

source: Write a ``__main__.py`` file to the archive that executes *mainfn*. The *mainfn* argument should have the form "pkg.mod:fn", where "pkg.mod" is a package/module in the archive, and "fn" is a callable in the given module. The ``__main__.py`` file will execute that callable.
es: Escribe un archivo ``__main__.py`` en el archivador que ejecuta *mainfn*. El argumento *mainfn* debería tener la forma "pkg.mod:fn", donde "pkg.mod" is un paquete/módulo en el archivador, y "fn" es un invocable (*callable*) en ese módulo. El archivo ``__main__.py`` ejecutará ese invocable.

source: :option:`--main` cannot be specified when copying an archive.
es: :option:`--main` no puede especificarse al copiar un archivador.

source: Compress files with the deflate method, reducing the size of the output file. By default, files are stored uncompressed in the archive.
es: Comprime los archivos con el método *deflate*, lo que reduce el tamaño del archivo de salida. Por defecto, los archivos se guardan sin comprimir en el archivador.

source: :option:`--compress` has no effect when copying an archive.
es: :option:`--compress` no surte efecto al copiar un archivador.

source: Display the interpreter embedded in the archive, for diagnostic purposes. In this case, any other options are ignored and SOURCE must be an archive, not a directory.
es: Muestra el intérprete incrustado en el archivador, para diagnósticos. En este caso cualquier otra opción se ignora, y SOURCE debe ser un archivador, no un directorio.

source: Print a short usage message and exit.
es: Muestra un breve mensaje sobre el modo de uso, y sale.

source: Python API
es: API de Python

source: The module defines two convenience functions:
es: El módulo define dos funciones convenientes:

source: Create an application archive from *source*. The source can be any of the following:
es: Crea un archivador de aplicación a partir de *source*. Este *source* (origen), puede ser cualquiera de los siguientes:

source: The name of a directory, or a :term:`path-like object` referring to a directory, in which case a new application archive will be created from the content of that directory.
es: El nombre de un directorio, o un :term:`path-like object` que se refiera a un directorio, en cuyo caso un nuevo archivador de aplicación se creará a partir del contenido de dicho directorio.

source: The name of an existing application archive file, or a :term:`path-like object` referring to such a file, in which case the file is copied to the target (modifying it to reflect the value given for the *interpreter* argument). The file name should include the ``.pyz`` extension, if required.
es: El nombre de un archivador de aplicación existente o un :term:`path-like object` que refiera a dicho archivo, en cuyo caso el archivo se copiará al destino (modificándolo para reflejar el valor dado por el argumento *interpreter*. El nombre de archivo debería incluir la extensión ``.pyz``, si se requiere.

source: A file object open for reading in bytes mode. The content of the file should be an application archive, and the file object is assumed to be positioned at the start of the archive.
es: Un objeto archivo abierto para lectura en modo bytes. El contenido del archivo debería ser un archivador de aplicación. Se infiere que el objeto archivo está posicionado al comienzo del archivador.

source: The *target* argument determines where the resulting archive will be written:
es: El argumento *target* determina dónde quedará escrito el archivador resultante:

source: If it is the name of a file, or a :term:`path-like object`, the archive will be written to that file.
es: Si es el nombre de un archivo, o un :term:`path-like object`, el archivador será escrito a ese archivo.

source: If it is an open file object, the archive will be written to that file object, which must be open for writing in bytes mode.
es: Si es un objeto archivo abierto, el archivador se escribirá en ese objeto archivo, el cual debe estar abierto para escritura en modo bytes.

source: If the target is omitted (or ``None``), the source must be a directory and the target will be a file with the same name as the source, with a ``.pyz`` extension added.
es: Si el destino (*target*) se omite (o es ``None``), el origen (*source*) debe ser un directorio, y el destino será un archivo con el mismo nombre que el origen, con la extensión ``.pyz`` añadida.

source: The *interpreter* argument specifies the name of the Python interpreter with which the archive will be executed. It is written as a "shebang" line at the start of the archive. On POSIX, this will be interpreted by the OS, and on Windows it will be handled by the Python launcher. Omitting the *interpreter* results in no shebang line being written. If an interpreter is specified, and the target is a filename, the executable bit of the target file will be set.
es: El argumento *interpreter* especifica el nombre del intérprete Python con el que el archivador será ejecutado. Se escribe como una línea *"shebang"* al comienzo del archivador. En POSIX, el Sistema Operativo será quien lo interprete, y en Windows será gestionado por el lanzador Python. Omitir el *interpreter* tendrá como consecuencia que no se escribirá ninguna línea *shebang*. Si se especifica un intérprete y el destino (*target*) es un nombre de archivo, el bit de ejecución del archivo destino será activado.

source: The *main* argument specifies the name of a callable which will be used as the main program for the archive. It can only be specified if the source is a directory, and the source does not already contain a ``__main__.py`` file. The *main* argument should take the form "pkg.module:callable" and the archive will be run by importing "pkg.module" and executing the given callable with no arguments. It is an error to omit *main* if the source is a directory and does not contain a ``__main__.py`` file, as otherwise the resulting archive would not be executable.
es: El argumento *main* especifica el nombre de un invocable (*callable*) que se utilizará como programa principal para el archivador. Solamente se puede especificar si el origen (*source*) es un directorio que no contiene un archivo ``__main__.py``. El argumento *main* debería tener la forma "pkg.module:callable", y el archivador será ejecutado importando "pkg.module" y ejecutando el *callable* sin argumentos. Es un error omitir *main* si el origen es un directorio que no contiene un archivo ``__main__.py``, ya que esto resultaría en un archivador no ejecutable.

source: The optional *filter* argument specifies a callback function that is passed a Path object representing the path to the file being added (relative to the source directory). It should return ``True`` if the file is to be added.
es: El argumento opcional *filter* especifica una función *callback* que se pasa como objeto Path, para representar el *path* (ruta) al archivo que se está añadiendo (ruta relativa al directorio origen, *source*). Debería retornar ``True`` si el archivo será añadido.

source: The optional *compressed* argument determines whether files are compressed. If set to ``True``, files in the archive are compressed with the deflate method; otherwise, files are stored uncompressed. This argument has no effect when copying an existing archive.
es: El argumento opcional *compressed* determina si los archivos están comprimidos. Si se define como ``True``, los archivos en el archivador serán comprimidos con el método deflate.

source: If a file object is specified for *source* or *target*, it is the caller's responsibility to close it after calling create_archive.
es: Si se especifica un objeto archivo para *source* o * target*, es responsabilidad de quien invoca cerrarlo luego de invocar a create_archive.

source: When copying an existing archive, file objects supplied only need ``read`` and ``readline``, or ``write`` methods. When creating an archive from a directory, if the target is a file object it will be passed to the ``zipfile.ZipFile`` class, and must supply the methods needed by that class.
es: Al copiar un archivador existente, los objetos archivo provistos, solamente necesitan los métodos ``read`` y ``readline``, o bien ``write``. Al crear un archivador a partir de un directorio, si el destino (*target*) es un objeto archivo, éste se pasará a la clase ``zipfile.ZipFile``, y debe proveer los métodos que esa clase necesita.

source: Added the *filter* and *compressed* arguments.
es: Añadidos los argumentos *filter* y *compressed*.

source: Return the interpreter specified in the ``#!`` line at the start of the archive. If there is no ``#!`` line, return :const:`None`. The *archive* argument can be a filename or a file-like object open for reading in bytes mode. It is assumed to be at the start of the archive.
es: Retorna el intérprete especificado en la línea ``#!`` al comienzo del archivador. Si no hay línea ``#!``, retorna :const:`None`. El argumento *archive* (archivador), puede ser un nombre de archivo o un objeto tipo archivo abierto para lectura en modo bytes. Se supone que está al principio del archivador.

source: Examples
es: Ejemplos

source: Pack up a directory into an archive, and run it.
es: Empaqueta un directorio en un archivador, y lo ejecuta.

source: The same can be done using the :func:`create_archive` function::
es: Lo mismo puede lograrse utilizando la función :func:`create_archive`::

source: To make the application directly executable on POSIX, specify an interpreter to use.
es: Para que la aplicación sea ejecutable directamente en POSIX, especifica un intérprete.

source: To replace the shebang line on an existing archive, create a modified archive using the :func:`create_archive` function::
es: Para reemplazar la línea *shebang* en un archivador existente, cree un archivador modificado, utilizando la función :func:`create_archive`::

source: To update the file in place, do the replacement in memory using a :class:`BytesIO` object, and then overwrite the source afterwards. Note that there is a risk when overwriting a file in place that an error will result in the loss of the original file. This code does not protect against such errors, but production code should do so. Also, this method will only work if the archive fits in memory::
es: Para actualizar el archivo en el lugar, reemplaza en memoria utilizando un objeto :class:`BytesIO`, y luego sobreescribe el origen (*source*). Nótese que hay un riesgo al sobreescribir un archivo en el lugar, ya que un error resultará en la pérdida del archivo original. Este código no ofrece protección contra este tipo de errores, sino que el código de producción debería hacerlo. Además, este método solamente funcionará si el archivador cabe en la memoria::

source: Specifying the Interpreter
es: Especificar el intérprete

source: Note that if you specify an interpreter and then distribute your application archive, you need to ensure that the interpreter used is portable. The Python launcher for Windows supports most common forms of POSIX ``#!`` line, but there are other issues to consider:
es: Nótese que si se especifica el intérprete y luego se distribuye el archivador de aplicación, es necesario asegurarse de que el intérprete utilizado es portable. El lanzador Python para Windows soporta las formas más comunes de líneas ``#!`` POSIX, pero hay otras cuestiones a considerar:

source: If you use "/usr/bin/env python" (or other forms of the "python" command, such as "/usr/bin/python"), you need to consider that your users may have either Python 2 or Python 3 as their default, and write your code to work under both versions.
es: Si se utiliza "/usr/bin/env python" (u otras formas del comando "python", como "/usr/bin/python"), es necesario considerar que los usuarios quizá tengan tanto Python2 como Python3 como versión por defecto, y el código debe escribirse bajo ambas versiones.

source: If you use an explicit version, for example "/usr/bin/env python3" your application will not work for users who do not have that version. (This may be what you want if you have not made your code Python 2 compatible).
es: Si se utiliza una versión específica, por ejemplo "/usr/bin/env python3", la aplicación no funcionará para los usuarios que no tengan esa versión. (Esta puede ser la opción deseada si no se hecho el código compatible con Python 2).

source: There is no way to say "python X.Y or later", so be careful of using an exact version like "/usr/bin/env python3.4" as you will need to change your shebang line for users of Python 3.5, for example.
es: No hay manera de decir "python X.Y o posterior", así que se debe ser cuidadoso al utilizar una versión exacta, tal como "/usr/bin/env python3.4", ya que será necesario cambiar la línea *shebang* para usuarios de Python 3.5, por ejemplo.

source: Typically, you should use an "/usr/bin/env python2" or "/usr/bin/env python3", depending on whether your code is written for Python 2 or 3.
es: Normalmente, se debería utilizar "/usr/bin/env python2" o "/usr/bin/env python3", según si el código está escrito para Python 2 ó 3.

source: Creating Standalone Applications with zipapp
es: Creando aplicaciones independientes con zipapp

source: Using the :mod:`zipapp` module, it is possible to create self-contained Python programs, which can be distributed to end users who only need to have a suitable version of Python installed on their system. The key to doing this is to bundle all of the application's dependencies into the archive, along with the application code.
es: Utilizando el módulo :mod:`zipapp`, es posible crear programas Python auto-contenidos, que pueden ser distribuidos a usuarios finales que solo necesitarán una versión adecuada de Python instalada en sus sistemas. La clave es empaquetar todas las dependencias de la aplicación dentro del archivador, junto al código de la misma.

source: The steps to create a standalone archive are as follows:
es: Los pasos para crear un archivador independiente son los siguientes:

source: Create your application in a directory as normal, so you have a ``myapp`` directory containing a ``__main__.py`` file, and any supporting application code.
es: Crea tu aplicación en un directorio normalmente, tal que tengas una directorio ``myapp`` que contenga un archivo ``__main__.py``, y cualquier código extra de la aplicación.

source: Install all of your application's dependencies into the ``myapp`` directory, using pip:
es: Instala todas las dependencias de la aplicación en el directorio ``myapp``, usando pip:

source: (this assumes you have your project requirements in a ``requirements.txt`` file - if not, you can just list the dependencies manually on the pip command line).
es: (se supone que tienes los requisitos de tu proyecto en un archivo ``requirements.txt``, de lo contrario, puedes listar manualmente las dependencias en la línea de comandos de pip).

source: Optionally, delete the ``.dist-info`` directories created by pip in the ``myapp`` directory. These hold metadata for pip to manage the packages, and as you won't be making any further use of pip they aren't required - although it won't do any harm if you leave them.
es: Opcionalmente, borra los directorios ``.dist-info`` creados por pip en el directorio ``myapp``. Éstos tienen metadatos para que pip gestione los paquetes, y como ya no se utilizará pip, no hace falta que permanezcan (aunque no causará ningún problema si los dejas).

source: Package the application using:
es: Empaqueta la aplicación utilizando:

source: This will produce a standalone executable, which can be run on any machine with the appropriate interpreter available. See :ref:`zipapp-specifying-the-interpreter` for details. It can be shipped to users as a single file.
es: Esto producirá un ejecutable independiente, que puede ser ejecutado en cualquier máquina que disponga del intérprete apropiado. Véase :ref:`zipapp-specifying-the-interpreter` para más detalles. Puede enviarse a los usuarios como un solo archivo.

source: On Unix, the ``myapp.pyz`` file is executable as it stands. You can rename the file to remove the ``.pyz`` extension if you prefer a "plain" command name. On Windows, the ``myapp.pyz[w]`` file is executable by virtue of the fact that the Python interpreter registers the ``.pyz`` and ``.pyzw`` file extensions when installed.
es: En Unix, el archivo ``myapp.pyz`` será ejecutable tal como está. Puede ser renombrado, para quitar la extensión ``.pyz`` si se prefiere un nombre de comando "simple". En Windows, el archivo ``myapp.pyz[w]`` es ejecutable, ya que el intérprete Python registra las extensiones ``.pyz`` y ``pyzw`` al ser instalado.

source: Making a Windows executable
es: Hacer un ejecutable para Windows

source: On Windows, registration of the ``.pyz`` extension is optional, and furthermore, there are certain places that don't recognise registered extensions "transparently" (the simplest example is that ``subprocess.run(['myapp'])`` won't find your application - you need to explicitly specify the extension).
es: En Windows, registrar la extensión ``.pyz`` es opcional, y además hay ciertos sitios que no reconocen las extensiones registradas de manera "transparente" (el ejemplo más simple es que ``subprocess.run(['myapp'])`` no va a encontrar la aplicación, es necesario especificar explícitamente la extensión).

source: On Windows, therefore, it is often preferable to create an executable from the zipapp. This is relatively easy, although it does require a C compiler. The basic approach relies on the fact that zipfiles can have arbitrary data prepended, and Windows exe files can have arbitrary data appended. So by creating a suitable launcher and tacking the ``.pyz`` file onto the end of it, you end up with a single-file executable that runs your application.
es: Por lo tanto, en Windows, suele ser preferible crear un ejecutable a partir del zipapp. Esto es relativamente fácil, aunque requiere un compilador de C. La estrategia básica se basa en que los archivos zip pueden tener datos arbitrarios antepuestos, y los archivos exe de Windows pueden tener datos arbitrarios agregados. Entonces, si se crea un lanzador adecuado mudando el archivo ``.pyz`` al final del mismo, se obtiene un solo archivo ejecutable que corre la aplicación.

source: A suitable launcher can be as simple as the following::
es: Un lanzador adecuado puede ser así de simple::

source: If you define the ``WINDOWS`` preprocessor symbol, this will generate a GUI executable, and without it, a console executable.
es: Si se define el símbolo de preprocesador ``WINDOWS``, se generará una GUI (interfaz gráfica de usuario) ejecutable, y sin este símbolo, un ejecutable de consola.

source: To compile the executable, you can either just use the standard MSVC command line tools, or you can take advantage of the fact that distutils knows how to compile Python source::
es: Para compilar el ejecutable, se puede usar únicamente la línea de comando estándar MSVC, o se puede aprovechar la ventaja de que distutils sabe cómo compilar código fuente Python::

source: The resulting launcher uses the "Limited ABI", so it will run unchanged with any version of Python 3.x. All it needs is for Python (``python3.dll``) to be on the user's ``PATH``.
es: El lanzador resultante utiliza "Limited ABI", así que correrá sin cambios con cualquier versión de Python 3.x. Todo lo que necesita es que Python (``python3.dll``) esté en el ``PATH`` del usuario.

source: For a fully standalone distribution, you can distribute the launcher with your application appended, bundled with the Python "embedded" distribution. This will run on any PC with the appropriate architecture (32 bit or 64 bit).
es: Para una distribución completamente independiente, se puede distribuir el lanzador con la aplicación incluida, empaquetada con la distribución "*embedded*" de Python. Va a funcionar en cualquier PC con la arquitectura adecuada (32 o 64 bits).

source: Caveats
es: Advertencias
