Repository: python/python-docs-es
Catalog: library/zipapp.po
Languages: es

source: There are some limitations to the process of bundling your application into a single file. In most, if not all, cases they can be addressed without needing major changes to your application.
es: Hay algunas limitaciones para empaquetar la aplicación en un solo archivo. In la mayoría, si no en todos los casos, se pueden abordar sin que haga falta ningún cambio importante en la aplicación.

source: If your application depends on a package that includes a C extension, that package cannot be run from a zip file (this is an OS limitation, as executable code must be present in the filesystem for the OS loader to load it). In this case, you can exclude that dependency from the zipfile, and either require your users to have it installed, or ship it alongside your zipfile and add code to your ``__main__.py`` to include the directory containing the unzipped module in ``sys.path``. In this case, you will need to make sure to ship appropriate binaries for your target architecture(s) (and potentially pick the correct version to add to ``sys.path`` at runtime, based on the user's machine).
es: Si la aplicación depende de un paquete que incluye una extensión C, ese paquete no puede ser ejecutado desde un archivo zip (esta es una limitación del sistema operativo, dado que el código ejecutable debe estar presente en el sistema de archivos para que el *loader* del SO lo pueda cargar). En este caso, se puede excluir la dependencia del archivo zip, y requerir que los usuarios la tengan instalada, o bien distribuirla conjuntamente con el archivo zip, y agregar código al ``__main__.py`` para que incluya el directorio que contiene el módulo descomprimido en ``sys.path``. En este caso, será necesario asegurarse de distribuir los binarios adecuados para la/s arquitectura/s a las que esté destinada la aplicación (y potencialmente elegir la versión correcta para agregar a ``sys.path`` en tiempo de ejecución, basándose en la máquina del usuario).

source: If you are shipping a Windows executable as described above, you either need to ensure that your users have ``python3.dll`` on their PATH (which is not the default behaviour of the installer) or you should bundle your application with the embedded distribution.
es: Al distribuir ejecutables Windows tal como se describe más arriba, hay que asegurarse de que los usuarios tienen ``python3.dll`` en su PATH (lo cual no es una opción por defecto en el instalador), o bien empaquetar la aplicación con la distribución *embedded*.

source: The suggested launcher above uses the Python embedding API. This means that in your application, ``sys.executable`` will be your application, and *not* a conventional Python interpreter. Your code and its dependencies need to be prepared for this possibility. For example, if your application uses the :mod:`multiprocessing` module, it will need to call :func:`multiprocessing.set_executable` to let the module know where to find the standard Python interpreter.
es: El lanzador que se sugiere más arriba, utiliza la API de incrustación de Python (*Python embedding API*). Esto significa que ``sys.executable`` será la aplicación, y *no* el intérprete Python convencional. El código y sus dependencias deben estar preparados para esta posibilidad. Por ejemplo, si la aplicación utiliza el módulo :mod:`multiprocessing`, necesitará invocar a :func:`multiprocessing.set_executable` para permitir que el módulo sepa dónde encontrar el intérprete Python estándar.

source: The Python Zip Application Archive Format
es: El formato de archivado Zip de aplicaciones Python

source: Python has been able to execute zip files which contain a ``__main__.py`` file since version 2.6. In order to be executed by Python, an application archive simply has to be a standard zip file containing a ``__main__.py`` file which will be run as the entry point for the application. As usual for any Python script, the parent of the script (in this case the zip file) will be placed on :data:`sys.path` and thus further modules can be imported from the zip file.
es: Python puede ejecutar archivadores zip que contengan un archivo ``__main__.py`` desde la versión 2.6. Para que sea ejecutada por Python, basta con que una aplicación de archivador sea un archivo zip estándar que contenga un archivo ``__main__.py``, el cual será ejecutado como punto de entrada para la aplicación. Como es usual para cualquier script Python, el elemento padre del script (en este caso, el archivo zip), será ubicado en :data:`sys.path`, por lo que pueden importarse otros módulos desde el archivo zip.

source: The zip file format allows arbitrary data to be prepended to a zip file. The zip application format uses this ability to prepend a standard POSIX "shebang" line to the file (``#!/path/to/interpreter``).
es: El formato de archivo zip, permite que se antepongan al archivo datos arbitrarios. El formato de aplicación zip utiliza esta capacidad para anteponer una línea "*shebang*" POSIX estándar al archivo (``#!/ruta/al/interprete``).

source: Formally, the Python zip application format is therefore:
es: Formalmente, el Formato de archivado Zip de aplicaciones Python es:

source: An optional shebang line, containing the characters ``b'#!'`` followed by an interpreter name, and then a newline (``b'\n'``) character. The interpreter name can be anything acceptable to the OS "shebang" processing, or the Python launcher on Windows. The interpreter should be encoded in UTF-8 on Windows, and in :func:`sys.getfilesystemencoding()` on POSIX.
es: Una línea *shebang* opcional, conteniendo los caracteres``b'#!'`` seguidos por un nombre de intérprete, y luego un carácter de nueva línea (``b'\n'``). El nombre del intérprete puede ser cualquiera que sea aceptable para el procesamiento de *shebang* del Sistema Operativo, o el lanzador Python en Windows. El intérprete debería estar codificado en UTF-8 en Windows, y en :func:`sys.getfilesystemencoding()` en POSIX.

source: Standard zipfile data, as generated by the :mod:`zipfile` module. The zipfile content *must* include a file called ``__main__.py`` (which must be in the "root" of the zipfile - i.e., it cannot be in a subdirectory). The zipfile data can be compressed or uncompressed.
es: Los datos estándares de archivo zip, tal como se generan en el módulo :mod:`zipfile`. El contenido del archivo zip *debe* incluir un archivo llamado ``__main__.py`` (que debe estar en la "raíz" del archivo zip, es decir, no puede estar en un subdirectorio). El los datos del archivo zip pueden estar comprimidos o no.

source: If an application archive has a shebang line, it may have the executable bit set on POSIX systems, to allow it to be executed directly.
es: Si un archivador de aplicación tiene una línea de shebang, puede tener el bit de ejecución activado en los sistemas POSIX, para permitir que sea ejecutado directamente.

source: There is no requirement that the tools in this module are used to create application archives - the module is a convenience, but archives in the above format created by any means are acceptable to Python.
es: No se requiere que las herramientas de este módulo sean las que se utilicen para crear archivadores de aplicación. El módulo es útil, pero cualquier archivo que esté en el formato descripto anteriormente es aceptable para Python, no importa cómo haya sido creado.
