Repository: python/python-docs-es
Catalog: library/zipimport.po
Languages: es

source: :mod:`zipimport` --- Import modules from Zip archives
es: :mod:`zipimport` --- Importar módulos desde archivos zip

source: **Source code:** :source:`Lib/zipimport.py`
es: **Código fuente:** :source:`Lib/zipimport.py`

source: This module adds the ability to import Python modules (:file:`\*.py`, :file:`\*.pyc`) and packages from ZIP-format archives. It is usually not needed to use the :mod:`zipimport` module explicitly; it is automatically used by the built-in :keyword:`import` mechanism for :data:`sys.path` items that are paths to ZIP archives.
es: Este módulo añade la capacidad de importar módulos de Python (:file:`\*.py`, :file:`\*.pyc`) y paquetes de archivos de formato ZIP. Por lo general, no es necesario utilizar el módulo :mod:`zipimport` explícitamente; se utiliza automáticamente por el mecanismo incorporado :keyword:`import` para los ítems :data:`sys.path` que son rutas a archivos ZIP.

source: Typically, :data:`sys.path` is a list of directory names as strings. This module also allows an item of :data:`sys.path` to be a string naming a ZIP file archive. The ZIP archive can contain a subdirectory structure to support package imports, and a path within the archive can be specified to only import from a subdirectory. For example, the path :file:`example.zip/lib/` would only import from the :file:`lib/` subdirectory within the archive.
es: Típicamente :data:`sys.path` es una lista de cadenas con nombres de directorios. Este módulo también permite a un elemento de :data:`sys.path` ser una cadena con la que se nombre a un archivo ZIP. El archivo ZIP puede contener una estructura de subdirectorios para soportar la importación de paquetes, y una ruta dentro del archivo puede ser especificada para únicamente importar desde un subdirectorio. Por ejemplo, la ruta :file:`example.zip/lib/` sólo importaría desde el subdirectorio :file:`lib/` dentro del archivo.

source: Any files may be present in the ZIP archive, but importers are only invoked for :file:`.py` and :file:`.pyc` files. ZIP import of dynamic modules (:file:`.pyd`, :file:`.so`) is disallowed. Note that if an archive only contains :file:`.py` files, Python will not attempt to modify the archive by adding the corresponding :file:`.pyc` file, meaning that if a ZIP archive doesn't contain :file:`.pyc` files, importing may be rather slow.
es: Cualquier archivo puede estar presente en el archivo ZIP, pero los importadores solo son invocados para archivos :file:`.py` y :file:`.pyc`. La importación ZIP de módulos dinámicos (:file:`.pyd`, :file:`.so`) no está permitida. Cabe señalar que si un archivo ZIP contiene solamente archivos :file:`.py`, Python no intentará modificar el archivo agregando los correspondientes archivos :file:`.pyc`, esto quiere decir que si un archivo ZIP no contiene archivos :file:`.pyc` la importación puede ser algo lenta.

source: Previously, ZIP archives with an archive comment were not supported.
es: Anteriormente, los archivos ZIP con un comentario de archivo no eran compatibles.

source: `PKZIP Application Note <https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT>`_
es: `PKZIP Nota de aplicación <https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT>`_

source: Documentation on the ZIP file format by Phil Katz, the creator of the format and algorithms used.
es: Documentación sobre el formato de archivo ZIP por Phil Katz, el creador del formato y algoritmos utilizados.

source: :pep:`273` - Import Modules from Zip Archives
es: :pep:`273` - Importar módulos de archivos Zip

source: Written by James C. Ahlstrom, who also provided an implementation. Python 2.3 follows the specification in :pep:`273`, but uses an implementation written by Just van Rossum that uses the import hooks described in :pep:`302`.
es: Escrito por James C. Ahlstrom, quien también proporcionó una implementación. Python 2.3 sigue la especificación en PEP 273, pero utiliza una implementación escrita por Just van Rossum que utiliza los ganchos importados descritos en PEP 302.

source: :mod:`importlib` - The implementation of the import machinery
es: :mod:`importlib` - La implementación de la maquinaria de importación

source: Package providing the relevant protocols for all importers to implement.
es: El paquete proporciona los protocolos relevantes para que los implementen todos los importadores.

source: This module defines an exception:
es: Este módulo define una excepción:

source: Exception raised by zipimporter objects. It's a subclass of :exc:`ImportError`, so it can be caught as :exc:`ImportError`, too.
es: Excepción lanzada por objetos zipimporter. Es una subclase de :exc:`ImportError`, por lo que también puede ser capturada como :exc:`ImportError`.

source: zipimporter Objects
es: Objetos zipimporter

source: :class:`zipimporter` is the class for importing ZIP files.
es: :class:`zipimporter` es la clase para importar archivos ZIP.

source: Create a new zipimporter instance. *archivepath* must be a path to a ZIP file, or to a specific path within a ZIP file. For example, an *archivepath* of :file:`foo/bar.zip/lib` will look for modules in the :file:`lib` directory inside the ZIP file :file:`foo/bar.zip` (provided that it exists).
es: Crea una nueva instancia zipimporter. *archivepath* debe ser una ruta a un archivo ZIP, o a una ruta específica dentro de un archivo ZIP. Por ejemplo, un *archivepath* de :file:`foo/bar.zip/lib` buscará módulos en el directorio :file:`lib` dentro del archivo ZIP :file:`foo/bar.zip` (siempre que exista).

source: :exc:`ZipImportError` is raised if *archivepath* doesn't point to a valid ZIP archive.
es: :exc:`ZipImportError` es lanzada si *archivepath* no apunta a un archivo ZIP válido.

source: Methods ``find_loader()`` and ``find_module()``, deprecated in 3.10 are now removed. Use :meth:`find_spec` instead.
es: Los métodos ``find_loader()`` y ``find_module()``, deprecados en la versión 3.10, han sido eliminados. Use en su lugar :meth:`find_spec`.

source: Implementation of :meth:`importlib.abc.Loader.create_module` that returns :const:`None` to explicitly request the default semantics.
es: Implementación de :meth:`importlib.abc.Loader.create_module` que retorna :const:`None` para solicitar explícitamente la semántica predeterminada.

source: Implementation of :meth:`importlib.abc.Loader.exec_module`.
es: Implementación de :meth:`importlib.abc.Loader.exec_module`.

source: An implementation of :meth:`importlib.abc.PathEntryFinder.find_spec`.
es: Una implementación de :meth:`importlib.abc.PathEntryFinder.find_spec`.

source: Return the code object for the specified module. Raise :exc:`ZipImportError` if the module couldn't be imported.
es: Retorna el objeto de código para el módulo especificado. Lanza :exc:`ZipImportError` si el módulo no se pudo importar.

source: Return the data associated with *pathname*. Raise :exc:`OSError` if the file wasn't found.
es: Retorna los datos asociados con *pathname*. Lanza :exc:`OSError` si el archivo no fue encontrado.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`.
es: :exc:`IOError` solía lanzarse en lugar de :exc:`OSError`.

source: Return the value ``__file__`` would be set to if the specified module was imported. Raise :exc:`ZipImportError` if the module couldn't be imported.
es: Retorna el valor que se le habría asignado a ``__file__`` si el módulo especificado fue importado. Lanza :exc:`ZipImportError` si el módulo no se pudo importar.

source: Return the source code for the specified module. Raise :exc:`ZipImportError` if the module couldn't be found, return :const:`None` if the archive does contain the module, but has no source for it.
es: Retorna el código fuente para el módulo especificado. Lanza :exc:`ZipImportError` si el módulo no pudo ser encontrado, retorna :const:`None` si el archivo contiene al módulo, pero no tiene fuente para ello.

source: Return ``True`` if the module specified by *fullname* is a package. Raise :exc:`ZipImportError` if the module couldn't be found.
es: Retorna ``True`` si el módulo especificado por *fullname* es un paquete. Lanza :exc:`ZipImportError` si el módulo no pudo ser encontrado.

source: Load the module specified by *fullname*. *fullname* must be the fully qualified (dotted) module name. Returns the imported module on success, raises :exc:`ZipImportError` on failure.
es: Carga el módulo especificado por *fullname*. *fullname* debe ser el nombre completo de módulo (punteado). Retorna el módulo importado, o lanza :exc:`ZipImportError` si no fue encontrado.

source: Use :meth:`exec_module` instead.
es: Utilizar en su lugar :meth:`exec_module`.

source: Clear out the internal cache of information about files found within the ZIP archive.
es: Limpia la caché interna de información sobre los archivos que se encuentran dentro del archivo ZIP.

source: The file name of the importer's associated ZIP file, without a possible subpath.
es: El nombre de archivo del archivo ZIP asociado del importador, sin una posible sub-ruta.

source: The subpath within the ZIP file where modules are searched. This is the empty string for zipimporter objects which point to the root of the ZIP file.
es: La sub-ruta dentro del archivo ZIP donde se buscan los módulos. Esta es la cadena vacía para objetos zipimporter la cual apunta a la raíz del archivo ZIP.

source: The :attr:`archive` and :attr:`prefix` attributes, when combined with a slash, equal the original *archivepath* argument given to the :class:`zipimporter` constructor.
es: Los atributos :attr:`archive` y :attr:`prefix`, cuando son combinados con una barra diagonal, son iguales al argumento original *archivepath* dado al constructor :class:`zipimporter`.

source: Examples
es: Ejemplos

source: Here is an example that imports a module from a ZIP archive - note that the :mod:`zipimport` module is not explicitly used.
es: Este es un ejemplo que importa un módulo de un archivo ZIP - tenga en cuenta que el módulo :mod:`zipimport` no está usado explícitamente.
