Repository: python/python-docs-es
Catalog: distributing/index.po
Languages: es

source: Distributing Python Modules
es: Distribuir módulos de Python

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
es: Como un proyecto de desarrollo de código abierto popular, Python tiene una comunidad activa de colaboradores y usuarios que también hacen que su software esté disponible para que otros desarrolladores de Python los usen bajo términos de licencia de código abierto.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
es: Esto permite a los usuarios de Python compartir y colaborar eficazmente, beneficiándose de las soluciones que otros ya han creado a problemas comunes (¡y a veces incluso raros!), así como potencialmente contribuyendo con sus propias soluciones al grupo común.

source: This guide covers the distribution part of the process. For a guide to installing other Python projects, refer to the :ref:`installation guide <installing-index>`.
es: Esta guía cubre la parte de distribución del proceso. Para obtener una guía para instalar otros proyectos de Python, consulte :ref:`installation guide <installing-index>`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
es: Para usuarios corporativos y otros usuarios institucionales, tenga en cuenta que muchas organizaciones tienen sus propias políticas en torno al uso y la contribución al software de código abierto. Por favor tenga en cuenta estas políticas al hacer uso de las herramientas de distribución e instalación proporcionadas con Python.

source: Key terms
es: Términos clave

source: the `Python Packaging Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users
es: el `Python Packaging Index <https://pypi.org>`__ es un repositorio público de paquetes con licencia de código abierto puestos a disposición para su uso por otros usuarios de Python

source: the `Python Packaging Authority <https://www.pypa.io/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
es: la `Python Packaging Authority <https://www.pypa.io/>`__ es el grupo de desarrolladores y autores de documentación responsables del mantenimiento y la evolución de las herramientas de empaquetado estándar y los metadatos asociados y los estándares de formato de archivo. Ellos mantienen una variedad de herramientas, documentación y rastreadores de problemas tanto en `GitHub <https://github.com/pypa>`__ como `Bitbucket <https://bitbucket.org/pypa/>`__.

source: :mod:`distutils` is the original build and distribution system first added to the Python standard library in 1998. While direct use of :mod:`distutils` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
es: :mod:`distutils` es el sistema de distribución y compilación original que se agregó por primera vez a la biblioteca estándar de Python en 1998. Si bien el uso directo de :mod:`distutils` se está eliminando, aún es la base para la infraestructura de empaquetado y distribución actual, y no solo sigue siendo parte de la biblioteca estándar, sino que su nombre vive de otras formas (como el nombre de la lista de correo utilizada para coordinar el desarrollo de estándares de empaquetado de Python).

source: `setuptools`_ is a (largely) drop-in replacement for :mod:`distutils` first published in 2004. Its most notable addition over the unmodified :mod:`distutils` tools was the ability to declare dependencies on other packages. It is currently recommended as a more regularly updated alternative to :mod:`distutils` that offers consistent support for more recent packaging standards across a wide range of Python versions.
es: `setuptools`_ es un reemplazo (en gran parte) directo de :mod:`distutils` publicado por primera vez en 2004. Su adición más notable sobre las herramientas sin modificar :mod:`distutils` fue la capacidad de declarar dependencias en otros paquetes. Actualmente se recomienda como una alternativa actualizada con más regularidad a :mod:`distutils` que ofrece soporte consistente para estándares de empaquetado más recientes en una amplia gama de versiones de Python.

source: `wheel`_ (in this context) is a project that adds the ``bdist_wheel`` command to :mod:`distutils`/`setuptools`_. This produces a cross platform binary packaging format (called "wheels" or "wheel files" and defined in :pep:`427`) that allows Python libraries, even those including binary extensions, to be installed on a system without needing to be built locally.
es: `wheel`_ (en este contexto) es un proyecto que agrega el comando ``bdist_wheel`` a :mod:`distutils`/`setuptools`_. Esto produce un formato de empaquetado binario multiplataforma (llamado "wheels" o "wheel files" y definido en :pep:`427`) que permite que las bibliotecas de Python, incluso aquellas que incluyen extensiones binarias, se instalen en un sistema sin necesidad de ser compiladas en la zona.

source: Open source licensing and collaboration
es: Licencias de código abierto y colaboración

source: In most parts of the world, software is automatically covered by copyright. This means that other developers require explicit permission to copy, use, modify and redistribute the software.
es: En la mayor parte del mundo, el software está automáticamente protegido por derechos de autor. Esto significa que otros desarrolladores requieren permiso explícito para copiar, usar, modificar y redistribuir el software.

source: Open source licensing is a way of explicitly granting such permission in a relatively consistent way, allowing developers to share and collaborate efficiently by making common solutions to various problems freely available. This leaves many developers free to spend more time focusing on the problems that are relatively unique to their specific situation.
es: La concesión de licencias de código abierto es una forma de otorgar explícitamente dicho permiso de una manera relativamente consistente, lo que permite a los desarrolladores compartir y colaborar de manera eficiente al hacer que las soluciones comunes a varios problemas estén disponibles de forma gratuita. Esto deja a muchos desarrolladores libres para dedicar más tiempo a concentrarse en los problemas que son relativamente únicos para su situación específica.

source: The distribution tools provided with Python are designed to make it reasonably straightforward for developers to make their own contributions back to that common pool of software if they choose to do so.
es: Las herramientas de distribución proporcionadas con Python están diseñadas para que sea razonablemente sencillo para los desarrolladores hacer sus propias contribuciones a ese grupo común de software si así lo desean.

source: The same distribution tools can also be used to distribute software within an organisation, regardless of whether that software is published as open source software or not.
es: Las mismas herramientas de distribución también se pueden utilizar para distribuir software dentro de una organización, independientemente de si ese software se publica como software de código abierto o no.

source: Installing the tools
es: Instalando las herramientas

source: The standard library does not include build tools that support modern Python packaging standards, as the core development team has found that it is important to have standard tools that work consistently, even on older versions of Python.
es: La biblioteca estándar no incluye herramientas de compilación que sean compatibles con los estándares de empaquetado de Python modernos, ya que el equipo de desarrollo central ha descubierto que es importante tener herramientas estándar que funcionen de manera consistente, incluso en versiones anteriores de Python.

source: The currently recommended build and distribution tools can be installed by invoking the ``pip`` module at the command line::
es: Las herramientas de construcción y distribución recomendadas actualmente se pueden instalar invocando el módulo ``pip`` en la línea de comando::

source: For POSIX users (including Mac OS X and Linux users), these instructions assume the use of a :term:`virtual environment`.
es: Para los usuarios POSIX (incluidos los usuarios de Mac OS X y Linux), estas instrucciones asumen el uso de un :term:`virtual environment`.

source: For Windows users, these instructions assume that the option to adjust the system PATH environment variable was selected when installing Python.
es: Para los usuarios de Windows, estas instrucciones asumen que se seleccionó la opción para ajustar la variable de entorno PATH del sistema al instalar Python.

source: The Python Packaging User Guide includes more details on the `currently recommended tools`_.
es: La "Python Packaging User Guide" incluye más detalles sobre las `currently recommended tools`_.

source: Reading the Python Packaging User Guide
es: Leyendo la "Python Packaging User Guide"

source: The Python Packaging User Guide covers the various key steps and elements involved in creating and publishing a project:
es: La "Python Packaging User Guide" cubre los diversos pasos y elementos clave involucrados en la creación y publicación de un proyecto:

source: `Project structure`_
es: `Estructura del proyecto`_

source: `Building and packaging the project`_
es: `Compilando y empaquetando el proyecto`_

source: `Uploading the project to the Python Packaging Index`_
es: `Subiendo el proyecto al Python Packaging Index`_

source: How do I...?
es: Cómo puedo...?

source: These are quick answers or links for some common tasks.
es: Estas son respuestas rápidas o enlaces para algunas tareas comunes.

source: ... choose a name for my project?
es: ... elegir un nombre para mi proyecto?

source: This isn't an easy topic, but here are a few tips:
es: Este no es un tema fácil, pero aquí hay algunos consejos:

source: check the Python Packaging Index to see if the name is already in use
es: verifique el "Python Packaging Index" para ver si el nombre ya está en uso

source: check popular hosting sites like GitHub, Bitbucket, etc to see if there is already a project with that name
es: verifique sitios de alojamiento populares como GitHub, Bitbucket, etc. para ver si ya existe un proyecto con ese nombre

source: check what comes up in a web search for the name you're considering
es: verifique lo que aparece en una búsqueda web para el nombre que está considerando

source: avoid particularly common words, especially ones with multiple meanings, as they can make it difficult for users to find your software when searching for it
es: evite palabras particularmente comunes, especialmente aquellas con múltiples significados, ya que pueden dificultar que los usuarios encuentren su software cuando lo busquen

source: ... create and distribute binary extensions?
es: ... crear y distribuir extensiones binarias?

source: This is actually quite a complex topic, with a variety of alternatives available depending on exactly what you're aiming to achieve. See the Python Packaging User Guide for more information and recommendations.
es: Este es un tema bastante complejo, con una variedad de alternativas disponibles según exactamente lo que pretenda lograr. Consulte la "Python Packaging User Guide" para obtener más información y recomendaciones.
