Repository: python/python-docs-es
Catalog: distutils/apiref.po
Languages: es

source: *link* allows you to make hard links (using :func:`os.link`) or symbolic links (using :func:`os.symlink`) instead of copying: set it to ``'hard'`` or ``'sym'``; if it is ``None`` (the default), files are copied. Don't set *link* on systems that don't support it: :func:`copy_file` doesn't check if hard or symbolic linking is available. It uses :func:`_copy_file_contents` to copy file contents.
es: *link* te permite crear enlaces físicos (usando :func:`os.link`) o enlaces simbólicos (usando :func:`os.symlink`) en lugar de copiar: configúralo en ``'hard'`` o ``'sym'``; si es ``None`` (el predeterminado), los archivos se copian. No establezcas *link* en sistemas que no lo admitan: :func:`copy_file` pues no comprueba si hay enlaces físicos o simbólicos disponibles. Utiliza :func:`_copy_file_contents` para copiar el contenido del archivo.

source: Return a tuple ``(dest_name, copied)``: *dest_name* is the actual name of the output file, and *copied* is true if the file was copied (or would have been copied, if *dry_run* true).
es: Retorna una tupla ``(dest_name, copied)``: *dest_name* es el nombre real del archivo de salida, y *copied* es verdadero si el archivo fue copiado (o se habría copiado, si *dry_run* es verdadero).

source: Move file *src* to *dst*. If *dst* is a directory, the file will be moved into it with the same name; otherwise, *src* is just renamed to *dst*. Returns the new full name of the file.
es: Mueve el archivo *src* a *dst*. Si *dst* es un directorio, el archivo se moverá a el con el mismo nombre; de lo contrario, *src* simplemente se renombra a *dst*. Retorna el nuevo nombre completo del archivo.

source: Handles cross-device moves on Unix using :func:`copy_file`. What about other systems?
es: Maneja movimientos entre dispositivos en Unix usando :func:`copy_file`. ¿Qué pasa con otros sistemas?

source: Create a file called *filename* and write *contents* (a sequence of strings without line terminators) to it.
es: Crea un archivo llamado *filename* y escribe *contents* (una secuencia de strings sin terminadores de línea) en el.

source: :mod:`distutils.util` --- Miscellaneous other utility functions
es: :mod:`distutils.util` --- Otras funciones de utilidad varias

source: This module contains other assorted bits and pieces that don't fit into any other utility module.
es: Este módulo contiene otras partes y piezas variadas que no encajan en ningún otro módulo de utilidad.

source: Return a string that identifies the current platform. This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by 'os.uname()'), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
es: Retorna un string que identifica la plataforma actual. Se utiliza principalmente para distinguir los directorios de compilación específicos de la plataforma y las distribuciones compiladas específicas de la plataforma. Por lo general, incluye el nombre y la versión del sistema operativo y la arquitectura (como lo proporciona 'os.uname ()'), aunque incluir la exacta depende del sistema operativo; por ejemplo, en Linux, la versión del kernel no es particularmente importante.

source: Examples of returned values:
es: Ejemplos de valores retornados:

source: For non-POSIX platforms, currently just returns ``sys.platform``.
es: Para las plataformas que no son POSIX, actualmente solo retorna ``sys.platform``.

source: For Mac OS X systems the OS version reflects the minimal version on which binaries will run (that is, the value of ``MACOSX_DEPLOYMENT_TARGET`` during the build of Python), not the OS version of the current system.
es: Para los sistemas Mac OS X, la versión del SO refleja la versión mínima en la que se ejecutarán los binarios (es decir, el valor de ``MACOSX_DEPLOYMENT_TARGET`` durante la compilación de Python), no la versión del SO del sistema actual.

source: For universal binary builds on Mac OS X the architecture value reflects the universal binary status instead of the architecture of the current processor. For 32-bit universal binaries the architecture is ``fat``, for 64-bit universal binaries the architecture is ``fat64``, and for 4-way universal binaries the architecture is ``universal``. Starting from Python 2.7 and Python 3.2 the architecture ``fat3`` is used for a 3-way universal build (ppc, i386, x86_64) and ``intel`` is used for a universal build with the i386 and x86_64 architectures
es: Para las compilaciones binarias universales en Mac OS X, el valor de la arquitectura refleja el estado binario universal en lugar de la arquitectura del procesador actual. Para los binarios universales de 32 bits, la arquitectura es ``fat``, para los binarios universales de 64 bits la arquitectura es ``fat64`` y para los binarios universales de 4 vías la arquitectura es ``universal``. A partir de Python 2.7 y Python 3.2, la arquitectura ``fat3`` se usa para una compilación universal de 3 vías (ppc, i386, x86_64) e ``intel`` se usa para una compilación universal con las arquitecturas i386 y x86_64

source: Examples of returned values on Mac OS X:
es: Ejemplos de valores retornados en Mac OS X:

source: Return 'pathname' as a name that will work on the native filesystem, i.e. split it on '/' and put it back together again using the current directory separator. Needed because filenames in the setup script are always supplied in Unix style, and have to be converted to the local convention before we can actually use them in the filesystem. Raises :exc:`ValueError` on non-Unix-ish systems if *pathname* either starts or ends with a slash.
es: Retorna '*pathname*' (o nombre de ruta), como un nombre que funcionará en el sistema de archivos nativo, es decir, divídelo con '/' y vuelve a armarlo usando el separador de directorio actual. Necesario porque los nombres de archivo en el script de configuración siempre se proporcionan en estilo Unix y deben convertirse a la convención local antes de que podamos usarlos en el sistema de archivos. Lanza :exc:`ValueError` en sistemas que no son Unix-ish si *pathname* comienza o termina con una barra.

source: Return *pathname* with *new_root* prepended. If *pathname* is relative, this is equivalent to ``os.path.join(new_root,pathname)`` Otherwise, it requires making *pathname* relative and then joining the two, which is tricky on DOS/Windows.
es: Retorna *pathname* con *new_root* precedido. Si *pathname* es relativo, esto es equivalente a ``os.path.join (new_root, pathname)``. De lo contrario, requiere hacer que *pathname* sea relativo y luego unir los dos, lo cual es complicado en DOS/Windows.

source: Ensure that 'os.environ' has all the environment variables we guarantee that users can use in config files, command-line options, etc. Currently this includes:
es: Asegúrate de que '*os.environ*' tenga todas las variables de entorno garantizamos que los usuarios pueden usar en archivos de configuración, opciones de línea de comandos, etc. Actualmente, esto incluye:

source: :envvar:`HOME` - user's home directory (Unix only)
es: :envvar:`HOME` - directorio de inicio del usuario (solo Unix)

source: :envvar:`PLAT` - description of the current platform, including hardware and OS (see :func:`get_platform`)
es: :envvar:`PLAT` - descripción de la plataforma actual, incluido el hardware y el sistema operativo (consulta :func:`get_platform`)

source: Perform shell/Perl-style variable substitution on *s*. Every occurrence of ``$`` followed by a name is considered a variable, and variable is substituted by the value found in the *local_vars* dictionary, or in ``os.environ`` if it's not in *local_vars*. *os.environ* is first checked/augmented to guarantee that it contains certain values: see :func:`check_environ`. Raise :exc:`ValueError` for any variables not found in either *local_vars* or ``os.environ``.
es: Realiza la sustitución de variables de estilo shell/Perl en *s*. Cada aparición de ``$`` seguido de un nombre se considera una variable, y la variable se sustituye por el valor que se encuentra en el diccionario *local_vars*, o en ``os.environ`` si no está en *local_vars*. *os.environ* primero se comprueba/aumenta para garantizar que contiene ciertos valores: ver :func:`check_environ`. Lanza :exc:`ValueError` para cualquier variable que no se encuentre en *local_vars* u ``os.environ``.

source: Note that this is not a fully-fledged string interpolation function. A valid ``$variable`` can consist only of upper and lower case letters, numbers and an underscore. No { } or ( ) style quoting is available.
es: Ten en cuenta que esta no es una función de interpolación de string completa. Una ``$ variable`` válida que puede constar solo de letras mayúsculas y minúsculas, números y un guión bajo. No hay citas de estilo {} o () disponibles.

source: Split a string up according to Unix shell-like rules for quotes and backslashes. In short: words are delimited by spaces, as long as those spaces are not escaped by a backslash, or inside a quoted string. Single and double quotes are equivalent, and the quote characters can be backslash-escaped. The backslash is stripped from any two-character escape sequence, leaving only the escaped character. The quote characters are stripped from any quoted string. Returns a list of words.
es: Divide un string de acuerdo con las reglas de tipo *shell* de Unix para comillas y barras invertidas. En resumen: las palabras están delimitadas por espacios, siempre que esos espacios no se escapen con una barra invertida o dentro de un string entre comillas. Las comillas simples y dobles son equivalentes, y los caracteres de las comillas pueden tener un escape de barra invertida. La barra invertida se elimina de cualquier secuencia de escape de dos caracteres, dejando solo el carácter de escape. Los caracteres de comillas se eliminan de cualquier string entre comillas. Retorna una lista de palabras.

source: Perform some action that affects the outside world (for instance, writing to the filesystem). Such actions are special because they are disabled by the *dry_run* flag. This method takes care of all that bureaucracy for you; all you have to do is supply the function to call and an argument tuple for it (to embody the "external action" being performed), and an optional message to print.
es: Realiza alguna acción que afecta al mundo exterior (por ejemplo, escribir en el sistema de archivos). Tales acciones son especiales porque están deshabilitadas por el indicador *dry_run*. Este método se encarga de toda esa burocracia por ti; todo lo que tienes que hacer es proporcionar la función a llamar y una tupla de argumentos para esta (para incorporar la "acción externa" que se está realizando), y un mensaje opcional para imprimir.

source: Convert a string representation of truth to true (1) or false (0).
es: Convierte una representación real de un string a verdadero (1) o falso (0).

source: True values are ``y``, ``yes``, ``t``, ``true``, ``on`` and ``1``; false values are ``n``, ``no``, ``f``, ``false``, ``off`` and ``0``. Raises :exc:`ValueError` if *val* is anything else.
es: Los valores verdaderos son ``y``, ``yes``, ``t``, ``true``, ``on`` y ``1``; los valores falsos son ``n``, ``no``, ``f``, ``false``, ``off`` and ``0``. Lanza :exc:`ValueError` si *val* es cualquier otra cosa.

source: Byte-compile a collection of Python source files to :file:`.pyc` files in a :file:`__pycache__` subdirectory (see :pep:`3147` and :pep:`488`). *py_files* is a list of files to compile; any files that don't end in :file:`.py` are silently skipped. *optimize* must be one of the following:
es: *Byte-compile* es una colección de archivos fuente de Python de :file:`.pyc` en un subdirectorio :file:`__pycache__` (ver :pep:`3147` y :pep:`488`). *py_files* es una lista de archivos para compilar; cualquier archivo que no termine en :file:`.py` se omite silenciosamente. *optimize* debe ser uno de los siguientes:

source: ``0`` - don't optimize
es: ``0`` - no optimizar

source: ``1`` - normal optimization (like ``python -O``)
es: ``1`` - optimización normal (como ``python -O``)

source: ``2`` - extra optimization (like ``python -OO``)
es: ``2`` - extra optimización (como ``python -OO``)

source: If *force* is true, all files are recompiled regardless of timestamps.
es: Si *force* es verdadero, todos los archivos se vuelven a compilar independientemente de las marcas de tiempo.

source: The source filename encoded in each :term:`bytecode` file defaults to the filenames listed in *py_files*; you can modify these with *prefix* and *basedir*. *prefix* is a string that will be stripped off of each source filename, and *base_dir* is a directory name that will be prepended (after *prefix* is stripped). You can supply either or both (or neither) of *prefix* and *base_dir*, as you wish.
es: El nombre del archivo de origen codificado en cada archivo :term:`bytecode` tiene por defecto los nombres de archivo listados en *py_files*; puede modificarlos con *prefix* y *basedir*. *prefix* es un string que se eliminará de cada nombre de archivo de origen, y *base_dir* es un nombre de directorio que se antepondrá (después de eliminar *prefix*). Puedes proporcionar uno o ambos (o ninguno) de *prefix* y * base_dir*, como desees.

source: If *dry_run* is true, doesn't actually do anything that would affect the filesystem.
es: Si *dry_run* es verdadero, actualmente no hace nada que pueda afectar el sistema de archivos.

source: Byte-compilation is either done directly in this interpreter process with the standard :mod:`py_compile` module, or indirectly by writing a temporary script and executing it. Normally, you should let :func:`byte_compile` figure out to use direct compilation or not (see the source for details). The *direct* flag is used by the script generated in indirect mode; unless you know what you're doing, leave it set to ``None``.
es: La compilación de *bytes* se realiza directamente en este proceso de interpretación con el módulo estándar :mod:`py_compile`, o indirectamente escribiendo un script temporal y ejecutándolo. Normalmente, debería dejar que :func:`byte_compile` se dé cuenta de si usar la compilación directa o no (consulta la fuente para obtener más detalles). El indicador *direct* es utilizado por el script generado en modo indirecto; a menos que sepa lo que está haciendo, se deja configurado en ``None``.

source: Create ``.pyc`` files with an :func:`import magic tag <imp.get_tag>` in their name, in a :file:`__pycache__` subdirectory instead of files without tag in the current directory.
es: Crea archivos ``.pyc`` con una etiqueta mágica :func:`import <imp.get_tag>` en su nombre, en un subdirectorio :file:`__pycache__` en lugar de archivos sin etiqueta en el directorio actual.

source: Create ``.pyc`` files according to :pep:`488`.
es: Crea archivos ``.pyc`` de acuerdo a :pep:`488`.

source: Return a version of *header* escaped for inclusion in an :rfc:`822` header, by ensuring there are 8 spaces space after each newline. Note that it does no other modification of the string.
es: Retorna una versión de *header* para su inclusión en un encabezado :rfc:`822`, asegurándose de que haya 8 espacios después de cada nueva línea. Ten en cuenta que no hace ninguna otra modificación del string.

source: :mod:`distutils.dist` --- The Distribution class
es: :mod:`distutils.dist` --- La clase *Distribution*

source: This module provides the :class:`~distutils.core.Distribution` class, which represents the module distribution being built/installed/distributed.
es: Este módulo proporciona la clase :class:`~ distutils.core.Distribution`, que representa la distribución del módulo que se está construyendo/instalando/distribuyendo.

source: :mod:`distutils.extension` --- The Extension class
es: :mod:`distutils.extension` --- La clase *Extension*

source: This module provides the :class:`Extension` class, used to describe C/C++ extension modules in setup scripts.
es: Este módulo proporciona la clase :class:`Extension`, que se utiliza para describir los módulos de extensión C/C ++ en los scripts de configuración.

source: :mod:`distutils.debug` --- Distutils debug mode
es: :mod:`distutils.debug` --- modo de depuración *Distutils*

source: This module provides the DEBUG flag.
es: Este módulo proporciona el indicador *DEBUG*.

source: :mod:`distutils.errors` --- Distutils exceptions
es: :mod:`distutils.errors` --- excepciones *Distutils*

source: Provides exceptions used by the Distutils modules. Note that Distutils modules may raise standard exceptions; in particular, SystemExit is usually raised for errors that are obviously the end-user's fault (eg. bad command-line arguments).
es: Proporciona excepciones utilizadas por los módulos *Distutils*. Ten en cuenta que los módulos de Distutils pueden lanzar excepciones estándar; en particular, *SystemExit* generalmente se lanza por errores que obviamente son culpa del usuario final (por ejemplo, argumentos incorrectos en la línea de comandos).

source: This module is safe to use in ``from ... import *`` mode; it only exports symbols whose names start with ``Distutils`` and end with ``Error``.
es: Este módulo es seguro de usar en el modo ``from ... import*``; solo exporta símbolos cuyos nombres comienzan con ``Distutils`` y terminan con ``Error``.

source: :mod:`distutils.fancy_getopt` --- Wrapper around the standard getopt module
es: :mod:`distutils.fancy_getopt` --- *Wrapper* alrededor del módulo estándar *getopt*

source: This module provides a wrapper around the standard :mod:`getopt` module that provides the following additional features:
es: Este módulo proporciona una envoltura alrededor del modulo estándar :mod:`getopt` que proporciona las siguientes características adicionales:

source: short and long options are tied together
es: las opciones cortas y largas están unidas

source: options have help strings, so :func:`fancy_getopt` could potentially create a complete usage summary
es: las opciones tienen strings de ayuda, por lo que :func:`fancy_getopt` podría potencialmente crear un resumen de uso completo

source: options set attributes of a passed-in object
es: las opciones establecen atributos de un objeto pasado

source: boolean options can have "negative aliases" --- eg. if :option:`!--quiet` is the "negative alias" of :option:`!--verbose`, then :option:`!--quiet` on the command line sets *verbose* to false.
es: las opciones booleanas pueden tener "alias negativos" --- p. ej. si :option:`!-quiet` es el "alias negativo" de :option:`!-verbose`, entonces: option:`!-quiet` en la línea de comando establece falso a *verbose*.

source: Wrapper function. *options* is a list of ``(long_option, short_option, help_string)`` 3-tuples as described in the constructor for :class:`FancyGetopt`. *negative_opt* should be a dictionary mapping option names to option names, both the key and value should be in the *options* list. *object* is an object which will be used to store values (see the :meth:`getopt` method of the :class:`FancyGetopt` class). *args* is the argument list. Will use ``sys.argv[1:]`` if you pass ``None`` as *args*.
es: Función *Wrapper*. *options* es una lista de ``(*long_option*, *short_option*, *help_string*)`` 3-tuplas como se describe en el constructor para :class:`FancyGetopt`. *negative_opt* debe ser un diccionario de mapeo de nombres de opciones a nombres de opciones, tanto la clave como el valor deben estar en la lista de *options*. *object* es un objeto que se usará para almacenar valores (ver el método :meth:`getopt` de la clase :class:`FancyGetopt`). *args* es la lista de argumentos. Usará ``sys.argv [1:]`` si pasa ``None`` como *args*.

source: Wraps *text* to less than *width* wide.
es: Envuelve *text* a menos de *width* ancho.

source: The option_table is a list of 3-tuples: ``(long_option, short_option, help_string)``
es: option_table es una lista de 3 tuplas: ``(long_option, short_option, help_string)``

source: If an option takes an argument, its *long_option* should have ``'='`` appended; *short_option* should just be a single character, no ``':'`` in any case. *short_option* should be ``None`` if a *long_option* doesn't have a corresponding *short_option*. All option tuples must have long options.
es: Si una opción toma un argumento, su *long_option* debería tener `` '=' `` anexado; *short_option* debe ser solo un carácter, sin `` ':' `` en cualquier caso. *short_option* debe ser ``None`` si *long_option* no tiene una *short_option* correspondiente. Todas las tuplas de opciones deben tener opciones largas.

source: The :class:`FancyGetopt` class provides the following methods:
es: La clase :class:`FancyGetopt` proporciona los siguientes métodos:

source: Parse command-line options in args. Store as attributes on *object*.
es: Analiza las opciones de la línea de comandos en *args*. Almacena como atributos en *object*.

source: If *args* is ``None`` or not supplied, uses ``sys.argv[1:]``. If *object* is ``None`` or not supplied, creates a new :class:`OptionDummy` instance, stores option values there, and returns a tuple ``(args, object)``. If *object* is supplied, it is modified in place and :func:`getopt` just returns *args*; in both cases, the returned *args* is a modified copy of the passed-in *args* list, which is left untouched.
es: Si *args* es ``None`` o no se proporciona, utiliza ``sys.argv [1:]``. Si *object* es ``None`` o no se proporciona, crea una nueva instancia :class:`OptionDummy`, que allí almacena valores de opción y retorna una tupla ``(args, object)``. Si se proporciona *object*, se modifica en su lugar y :func:`getopt` simplemente retorna *args*; en ambos casos, el *args* retornado es una copia modificada de la lista *args* pasada, que se deja intacta.

source: Returns the list of ``(option, value)`` tuples processed by the previous run of :meth:`getopt` Raises :exc:`RuntimeError` if :meth:`getopt` hasn't been called yet.
es: Retorna la lista de tuplas ``(*option*, *value*)`` procesadas por la ejecución anterior de :meth:`getopt` Lanza :exc:`RuntimeError` si :meth:`getopt` aún no se ha llamado.

source: Generate help text (a list of strings, one per suggested line of output) from the option table for this :class:`FancyGetopt` object.
es: Genera un texto de ayuda (una lista de strings, una por cada línea de salida sugerida) de la tabla de opciones para este objeto :class:`FancyGetopt`.

source: If supplied, prints the supplied *header* at the top of the help.
es: Si se suministra, imprime el *header* suministrado en la parte superior de la ayuda.

source: :mod:`distutils.filelist` --- The FileList class
es: :mod:`distutils.filelist` --- La clase *FileList*

source: This module provides the :class:`FileList` class, used for poking about the filesystem and building lists of files.
es: Este módulo proporciona la clase :class:`FileList`, utilizada para hurgar en el sistema de archivos y crear listas de archivos.

source: :mod:`distutils.log` --- Simple :pep:`282`-style logging
es: :mod:`distutils.log` --- Simple :pep:`282`-registro de estilo

source: :mod:`distutils.spawn` --- Spawn a sub-process
es: :mod:`distutils.spawn` --- Genera un subproceso

source: This module provides the :func:`spawn` function, a front-end to various platform-specific functions for launching another program in a sub-process. Also provides :func:`find_executable` to search the path for a given executable name.
es: Este módulo proporciona la función :func:`spawn`, un *front-end* para varias funciones específicas de la plataforma para iniciar otro programa en un subproceso. También proporciona :func:`find_executable` para buscar en la ruta un nombre ejecutable determinado.
