Repository: python/python-docs-es
Catalog: distutils/apiref.po
Languages: es

source: The constructor for each subclass creates an instance of the Compiler object. Flags are *verbose* (show verbose output), *dry_run* (don't actually execute the steps) and *force* (rebuild everything, regardless of dependencies). All of these flags default to ``0`` (off). Note that you probably don't want to instantiate :class:`CCompiler` or one of its subclasses directly - use the :func:`distutils.CCompiler.new_compiler` factory function instead.
es: El constructor de cada subclase crea una instancia del objeto *Compiler*. Los indicadores son *verbose* (muestra un resultado detallado), *dry_run* (en realidad no ejecuta los pasos) y *force* (reconstruye todo, independientemente de las dependencias). Todos estos indicadores están predeterminados en ``0`` (desactivado). Ten en cuenta que probablemente no desees crear una instancia de :class:`CCompiler` o una de sus subclases directamente; usa la función de fábrica :func:`distutils.CCompiler.new_compiler` en su lugar.

source: The following methods allow you to manually alter compiler options for the instance of the Compiler class.
es: Los siguientes métodos te permiten modificar manualmente las opciones del compilador para la instancia de la clase *Compiler*.

source: Add *dir* to the list of directories that will be searched for header files. The compiler is instructed to search directories in the order in which they are supplied by successive calls to :meth:`add_include_dir`.
es: Agrega *dir* a la lista de directorios en los que se buscarán archivos de encabezado. Se le indica al compilador que busque directorios en el orden en que son proporcionados por llamadas sucesivas a :meth:`add_include_dir`.

source: Set the list of directories that will be searched to *dirs* (a list of strings). Overrides any preceding calls to :meth:`add_include_dir`; subsequent calls to :meth:`add_include_dir` add to the list passed to :meth:`set_include_dirs`. This does not affect any list of standard include directories that the compiler may search by default.
es: Establece la lista de directorios que se buscarán en *dirs* (una lista de strings). Anula cualquier llamada anterior a :meth:`add_include_dir`; llamadas posteriores a :meth:`add_include_dir` agrega a la lista pasada a :meth:`set_include_dirs`. Esto no afecta a ninguna lista de directorios de inclusión estándar que el compilador pueda buscar de forma predeterminada.

source: Add *libname* to the list of libraries that will be included in all links driven by this compiler object. Note that *libname* should \*not\* be the name of a file containing a library, but the name of the library itself: the actual filename will be inferred by the linker, the compiler, or the compiler class (depending on the platform).
es: Agrega *libname* a la lista de bibliotecas que se incluirán en todos los enlaces manejados por este compilador de objeto. Ten en cuenta que *libname* debería no ser el nombre de un archivo que contenga una biblioteca, sino el nombre de la biblioteca en sí: el enlazador, el compilador o la clase del compilador deducirán el nombre del archivo actual (según el plataforma).

source: The linker will be instructed to link against libraries in the order they were supplied to :meth:`add_library` and/or :meth:`set_libraries`. It is perfectly valid to duplicate library names; the linker will be instructed to link against libraries as many times as they are mentioned.
es: Se le indicará al enlazador que se vincule con las bibliotecas en el orden en que se proporcionaron :meth:`add_library` y/o :meth:`set_libraries`. Es perfectamente válido duplicar nombres de bibliotecas; se le indicará al enlazador que se vincule con las bibliotecas tantas veces como se mencionen.

source: Set the list of libraries to be included in all links driven by this compiler object to *libnames* (a list of strings). This does not affect any standard system libraries that the linker may include by default.
es: Establece la lista de bibliotecas que se incluirán en todos los enlaces manejados ​​por este compilador de objeto en *libnames* (una lista de strings). Esto no afecta a las bibliotecas del sistema estándar que el vinculador pueda incluir de forma predeterminada.

source: Add *dir* to the list of directories that will be searched for libraries specified to :meth:`add_library` and :meth:`set_libraries`. The linker will be instructed to search for libraries in the order they are supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`.
es: Agrega *dir* a la lista de directorios en los que se buscarán las bibliotecas especificadas para :meth:`add_library` y :meth:`set_libraries`. Se le indicará al enlazador que busque bibliotecas en el orden en que se suministran a :meth:`add_library_dir` y/o :meth:`set_library_dirs`.

source: Set the list of library search directories to *dirs* (a list of strings). This does not affect any standard library search path that the linker may search by default.
es: Establece la lista de directorios de búsqueda de bibliotecas en *dirs* (una lista de strings). Esto no afecta a ninguna ruta de búsqueda de biblioteca estándar que el enlazador pueda buscar de forma predeterminada.

source: Add *dir* to the list of directories that will be searched for shared libraries at runtime.
es: Agrega *dir* a la lista de directorios en los que se buscarán bibliotecas compartidas en tiempo de ejecución.

source: Set the list of directories to search for shared libraries at runtime to *dirs* (a list of strings). This does not affect any standard search path that the runtime linker may search by default.
es: Establece la lista de directorios para buscar bibliotecas compartidas en tiempo de ejecución en *dirs* (una lista de strings). Esto no afecta a ninguna ruta de búsqueda estándar que el enlazador en tiempo de ejecución pueda buscar de forma predeterminada.

source: Define a preprocessor macro for all compilations driven by this compiler object. The optional parameter *value* should be a string; if it is not supplied, then the macro will be defined without an explicit value and the exact outcome depends on the compiler used.
es: Define una macro de preprocesador para todas las compilaciones impulsadas por este objeto compilador. El parámetro opcional *value* debe ser un string; si no se proporciona, la macro se definirá sin un valor explícito y el resultado exacto depende del compilador utilizado.

source: Undefine a preprocessor macro for all compilations driven by this compiler object. If the same macro is defined by :meth:`define_macro` and undefined by :meth:`undefine_macro` the last call takes precedence (including multiple redefinitions or undefinitions). If the macro is redefined/undefined on a per-compilation basis (ie. in the call to :meth:`compile`), then that takes precedence.
es: Anula la definición de una macro de preprocesador para todas las compilaciones impulsadas por este compilador de objeto. Si la misma macro está definida por :meth:`define_macro` y la indefinida por :meth:`undefine_macro`, la última llamada tiene prioridad (incluidas varias redefiniciones o indefiniciones). Si la macro está redefinida/indefinida por compilación (es decir, en la llamada a :meth:`compile`), entonces eso tiene prioridad.

source: Add *object* to the list of object files (or analogues, such as explicitly named library files or the output of "resource compilers") to be included in every link driven by this compiler object.
es: Agrega *object* a la lista de archivos de objeto (o análogos, como archivos de biblioteca nombrados explícitamente o la salida de "*resource compilers*" o compiladores de recursos) para que se incluyan en cada enlace impulsado por este objeto de compilador.

source: Set the list of object files (or analogues) to be included in every link to *objects*. This does not affect any standard object files that the linker may include by default (such as system libraries).
es: Establece la lista de archivos de objetos (o análogos) que se incluirán en cada enlace a *objects*. Esto no afecta a ningún archivo de objeto estándar que el enlazador pueda incluir de forma predeterminada (como las bibliotecas del sistema).

source: The following methods implement methods for autodetection of compiler options, providing some functionality similar to GNU :program:`autoconf`.
es: Los siguientes métodos implementan métodos para la detección automática de opciones del compilador, proporcionando alguna funcionalidad similar a GNU :program: `autoconf`.

source: Detect the language of a given file, or list of files. Uses the instance attributes :attr:`language_map` (a dictionary), and :attr:`language_order` (a list) to do the job.
es: Detecta el idioma de un archivo determinado o una lista de archivos. Utiliza los atributos de instancia :attr:`language_map` (un diccionario) y :attr:`language_order` (una lista) para hacer el trabajo.

source: Search the specified list of directories for a static or shared library file *lib* and return the full path to that file. If *debug* is true, look for a debugging version (if that makes sense on the current platform). Return ``None`` if *lib* wasn't found in any of the specified directories.
es: Busca en la lista especificada de directorios un archivo de biblioteca estático o compartido y retorna la ruta completa a ese archive *lib*. Si *debug* es verdadero, busca una versión de depuración (si tiene sentido en la plataforma actual). Retorna ``None`` si *lib* no se encontró en ninguno de los directorios especificados.

source: Return a boolean indicating whether *funcname* is supported on the current platform. The optional arguments can be used to augment the compilation environment by providing additional include files and paths and libraries and paths.
es: Retorna un valor booleano que indica si *funcname* es compatible con la plataforma actual. Los argumentos opcionales se pueden utilizar para aumentar el entorno de compilación proporcionando archivos y rutas de inclusión adicionales y bibliotecas y rutas.

source: Return the compiler option to add *dir* to the list of directories searched for libraries.
es: Retorna la opción del compilador para agregar *dir* a la lista de directorios buscados por bibliotecas.

source: Return the compiler option to add *lib* to the list of libraries linked into the shared library or executable.
es: Retorna la opción del compilador para agregar *lib* a la lista de bibliotecas vinculadas a la biblioteca compartida o ejecutable.

source: Return the compiler option to add *dir* to the list of directories searched for runtime libraries.
es: Retorna la opción del compilador para agregar *dir* a la lista de directorios buscados por bibliotecas en tiempo de ejecución.

source: Define the executables (and options for them) that will be run to perform the various stages of compilation. The exact set of executables that may be specified here depends on the compiler class (via the 'executables' class attribute), but most will have:
es: Define los ejecutables (y las opciones para ellos) que se ejecutarán para realizar las distintas etapas de compilación. El conjunto exacto de ejecutables que se pueden especificar aquí depende de la clase del compilador (a través del atributo de clase '*executables*'), pero la mayoría tendrá:

source: attribute
es: atributo

source: the C/C++ compiler
es: el compilador C/C++

source: linker used to create shared objects and libraries
es: enlazador utilizado para crear bibliotecas y objetos compartidos

source: linker used to create binary executables
es: enlazador utilizado para crear ejecutables binarios

source: static library creator
es: creador de biblioteca estática

source: On platforms with a command-line (Unix, DOS/Windows), each of these is a string that will be split into executable name and (optional) list of arguments. (Splitting the string is done similarly to how Unix shells operate: words are delimited by spaces, but quotes and backslashes can override this. See :func:`distutils.util.split_quoted`.)
es: En plataformas con una línea de comandos (Unix, DOS/Windows), cada uno de estos es un string que se dividirá en un nombre ejecutable y una lista de argumentos (opcional). (La división de la cadena se realiza de manera similar a como funcionan los *shells* de Unix: las palabras están delimitadas por espacios, pero las comillas y las barras invertidas pueden anular esto. Ver :func:`distutils.util.split_quoted`.)

source: The following methods invoke stages in the build process.
es: Los siguientes métodos invocan etapas en el proceso de construcción.

source: Compile one or more source files. Generates object files (e.g. transforms a :file:`.c` file to a :file:`.o` file.)
es: Compila uno o más archivos fuente. Genera archivos de objeto (por ejemplo, transforma un archivo :file:`.c` en un archivo :file:`.o`).

source: *sources* must be a list of filenames, most likely C/C++ files, but in reality anything that can be handled by a particular compiler and compiler class (eg. :class:`MSVCCompiler` can handle resource files in *sources*). Return a list of object filenames, one per source filename in *sources*. Depending on the implementation, not all source files will necessarily be compiled, but all corresponding object filenames will be returned.
es: *sources* debe ser una lista de nombres de archivo, probablemente archivos C/C ++, pero en realidad cualquier cosa que pueda ser manejada por un compilador particular y un compilador de clase (por ejemplo :class:`MSVCCompiler` puede manejar archivos de recursos en *source*). Retorna una lista de nombres de archivos de objetos, uno por nombre de archivo fuente en *sources*. Dependiendo de la implementación, no se compilarán necesariamente todos los archivos fuente, pero se retornarán todos los nombres de archivo de objeto correspondientes.

source: If *output_dir* is given, object files will be put under it, while retaining their original path component. That is, :file:`foo/bar.c` normally compiles to :file:`foo/bar.o` (for a Unix implementation); if *output_dir* is *build*, then it would compile to :file:`build/foo/bar.o`.
es: Si se indica el *output_dir*, los objeto de archivos se colocarán debajo de él, conservando su componente de ruta original. Es decir, :file:`foo/bar.c` normalmente se compila en :file:`foo/bar.o` (para una implementación de Unix); si *output_dir* es *build*, entonces se compilaría en :file:`build/foo/bar.o`.

source: *macros*, if given, must be a list of macro definitions. A macro definition is either a ``(name, value)`` 2-tuple or a ``(name,)`` 1-tuple. The former defines a macro; if the value is ``None``, the macro is defined without an explicit value. The 1-tuple case undefines a macro. Later definitions/redefinitions/undefinitions take precedence.
es: *macros*, si se proporciona, debe ser una lista de definiciones de una macro. Una definición de una macro es un ``(*name*, *value*)`` 2-tupla o un ``(*name*,)`` 1-tupla. El primero define una macro; si el valor es ``None``, la macro se define sin un valor explícito. El caso de 1 tupla no define una macro. Las definiciones/redefiniciones/indefiniciones posteriores tienen prioridad.

source: *include_dirs*, if given, must be a list of strings, the directories to add to the default include file search path for this compilation only.
es: *include_dirs*, si se proporciona, debe ser una lista de strings, para esta compilación solo se agregarán a la ruta de búsqueda de archivos los directorios de inclusión predeterminada.

source: *debug* is a boolean; if true, the compiler will be instructed to output debug symbols in (or alongside) the object file(s).
es: *debug* es un booleano; si es verdadero, se le indicará al compilador que genere símbolos de depuración en (o junto a) los archivos de objetos.

source: *extra_preargs* and *extra_postargs* are implementation-dependent. On platforms that have the notion of a command-line (e.g. Unix, DOS/Windows), they are most likely lists of strings: extra command-line arguments to prepend/append to the compiler command line. On other platforms, consult the implementation class documentation. In any event, they are intended as an escape hatch for those occasions when the abstract compiler framework doesn't cut the mustard.
es: *extra_preargs* y *extra_postargs* dependen de la implementación. En plataformas que tienen la noción de línea de comandos (por ejemplo, Unix, DOS/Windows), lo más probable es que sean listas de strings: argumentos de línea de comandos adicionales para anteponer/agregar a la línea de comandos del compilador. En otras plataformas, consulta la documentación de la clase de implementación. En cualquier caso, están pensados ​​como una vía de escape para aquellas ocasiones en las que la marco del compilador abstracto no es suficiente.

source: *depends*, if given, is a list of filenames that all targets depend on. If a source file is older than any file in depends, then the source file will be recompiled. This supports dependency tracking, but only at a coarse granularity.
es: *depends*, si se proporciona, es una lista de nombres de archivos de los que dependen todos los destinos. Si un archivo de origen es más antiguo que cualquier archivo en *depends*, se volverá a compilar el archivo de origen. Esto admite el seguimiento de dependencias, pero solo con una granularidad aproximada.

source: Raises :exc:`CompileError` on failure.
es: Lanza :exc:`CompileError` en caso de falla.

source: Link a bunch of stuff together to create a static library file. The "bunch of stuff" consists of the list of object files supplied as *objects*, the extra object files supplied to :meth:`add_link_object` and/or :meth:`set_link_objects`, the libraries supplied to :meth:`add_library` and/or :meth:`set_libraries`, and the libraries supplied as *libraries* (if any).
es: Enlaza un montón de cosas para crear un archivo de biblioteca estático. El "montón de cosas" o "*bunch of stuff*" consiste en la lista de archivos de objeto suministrados como *objects*, los archivos de objeto adicionales suministrados a :meth:`add_link_object` y/o :meth:`set_link_objects`, las bibliotecas suministradas a :meth:`add_library` y/o :meth:`set_libraries`, y las bibliotecas proporcionadas como *libraries* (si las hay).

source: *output_libname* should be a library name, not a filename; the filename will be inferred from the library name. *output_dir* is the directory where the library file will be put.
es: *output_libname* debe ser un nombre de biblioteca, no un nombre de archivo; el nombre del archivo se deducirá del nombre de la biblioteca. *output_dir* es el directorio donde se colocará el archivo de la biblioteca.

source: *debug* is a boolean; if true, debugging information will be included in the library (note that on most platforms, it is the compile step where this matters: the *debug* flag is included here just for consistency).
es: *debug* es un booleano; si es verdadero, la depuración se incluirá en la biblioteca (ten en cuenta que en la mayoría de las plataformas, es el paso de compilación donde esto es importante: el indicador *debug* se incluye aquí solo por coherencia).

source: *target_lang* is the target language for which the given objects are being compiled. This allows specific linkage time treatment of certain languages.
es: *target_lang* es el idioma de destino para el que se compilan los objetos dados. Esto permite un tratamiento específico del tiempo de vinculación de ciertos idiomas.

source: Raises :exc:`LibError` on failure.
es: Lanza :exc:`LibError` en caso de falla.

source: Link a bunch of stuff together to create an executable or shared library file.
es: Enlaza un montón de cosas (o *bunch of stuff*) juntos para crear un archivo de biblioteca ejecutable o compartido.

source: The "bunch of stuff" consists of the list of object files supplied as *objects*. *output_filename* should be a filename. If *output_dir* is supplied, *output_filename* is relative to it (i.e. *output_filename* can provide directory components if needed).
es: El "montón de cosas" o (*bunch of stuff*) consiste en la lista de archivos de objeto suministrados como *objects *. *output_filename* debe ser un nombre del archivo. Si se proporciona *output_dir*, *output_filename* es relativo a él (es decir, *output_filename* puede proporcionar componentes de directorio si es necesario).

source: *libraries* is a list of libraries to link against. These are library names, not filenames, since they're translated into filenames in a platform-specific way (eg. *foo* becomes :file:`libfoo.a` on Unix and :file:`foo.lib` on DOS/Windows). However, they can include a directory component, which means the linker will look in that specific directory rather than searching all the normal locations.
es: *libraries* es una lista de bibliotecas para enlazar. Estos son nombres de bibliotecas, no nombres de archivos, ya que se traducen a nombres de archivos de una manera específica de la plataforma (por ejemplo, *foo* se convierte en :file:`libfoo.a` en Unix y :file:`foo.lib` en DOS/Windows). Sin embargo, pueden incluir un componente de directorio, lo que significa que el enlazador buscará en ese directorio específico en lugar de buscar en todas las ubicaciones normales.

source: *library_dirs*, if supplied, should be a list of directories to search for libraries that were specified as bare library names (ie. no directory component). These are on top of the system default and those supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`. *runtime_library_dirs* is a list of directories that will be embedded into the shared library and used to search for other shared libraries that \*it\* depends on at run-time. (This may only be relevant on Unix.)
es: *library_dirs*, si se proporciona, debe ser una lista de directorios para buscar bibliotecas que se especificaron como nombres de bibliotecas descubiertos (es decir, sin componentes de directorio). Estos están en la parte superior del sistema predeterminado y los suministrados a :meth:`add_library_dir` y/o :meth:`set_library_dirs`. *runtime_library_dirs* es una lista de directorios que se incrustarán en la biblioteca compartida y se usarán para buscar otras bibliotecas compartidas de las que depende en tiempo de ejecución. (Esto solo puede ser relevante en Unix).

source: *export_symbols* is a list of symbols that the shared library will export. (This appears to be relevant only on Windows.)
es: *export_symbols* es una lista de símbolos que exportará la biblioteca compartida. (Esto parece ser relevante solo en Windows).

source: *debug* is as for :meth:`compile` and :meth:`create_static_lib`, with the slight distinction that it actually matters on most platforms (as opposed to :meth:`create_static_lib`, which includes a *debug* flag mostly for form's sake).
es: *debug* es para métodos como :meth:`compile` y :meth:`create_static_lib`, con la ligera distinción de que en realidad es relevante en la mayoría de las plataformas (a diferencia de :meth:`create_static_lib`, que incluye un indicador *debug* principalmente por el bien de la forma).

source: *extra_preargs* and *extra_postargs* are as for :meth:`compile` (except of course that they supply command-line arguments for the particular linker being used).
es: *extra_preargs* y *extra_postargs* son para métodos como :meth:`compile` (excepto, por supuesto, que proporcionan argumentos de línea de comandos para el enlazador particular que se está utilizando).

source: Raises :exc:`LinkError` on failure.
es: Lanza :exc:`LinkError` en caso de falla.
