Repository: python/python-docs-es
Catalog: distutils/apiref.po
Languages: es

source: :mod:`distutils.sysconfig` --- System configuration information
es: :mod:`distutils.sysconfig` --- Información de configuración del sistema

source: The :mod:`distutils.sysconfig` module provides access to Python's low-level configuration information. The specific configuration variables available depend heavily on the platform and configuration. The specific variables depend on the build process for the specific version of Python being run; the variables are those found in the :file:`Makefile` and configuration header that are installed with Python on Unix systems. The configuration header is called :file:`pyconfig.h` for Python versions starting with 2.2, and :file:`config.h` for earlier versions of Python.
es: El modulo :mod:`distutils.sysconfig` proporciona acceso a la configuración de bajo nivel de Python. Las variables de configuración específicas disponibles dependen en gran medida de la plataforma y la configuración. Las variables específicas dependen del proceso de compilación de la versión específica de Python que se está ejecutando; las variables son las que se encuentran en el archivo :file:`Makefile` y el encabezado de configuración que se instalan con Python en sistemas Unix. El encabezado de configuración se llama :file:`pyconfig.h` para las versiones de Python que comienzan con 2.2, y :file:`config.h` para versiones anteriores de Python.

source: Some additional functions are provided which perform some useful manipulations for other parts of the :mod:`distutils` package.
es: Se proporcionan algunas funciones adicionales que realizan algunas manipulaciones útiles para otras partes del paquete :mod:`distutils`.

source: The result of ``os.path.normpath(sys.prefix)``.
es: El resultado de ``os.path.normpath(sys.prefix)``.

source: The result of ``os.path.normpath(sys.exec_prefix)``.
es: El resultado de ``os.path.normpath(sys.exec_prefix)``.

source: Return the value of a single variable. This is equivalent to ``get_config_vars().get(name)``.
es: Retorna el valor de una sola variable. Esto es equivalente a ``get_config_vars ().get(name)``.

source: Return a set of variable definitions. If there are no arguments, this returns a dictionary mapping names of configuration variables to values. If arguments are provided, they should be strings, and the return value will be a sequence giving the associated values. If a given name does not have a corresponding value, ``None`` will be included for that variable.
es: Retorna un conjunto de definiciones de variables. Si no hay argumentos, esto retorna un diccionario que asigna los nombres de las variables de configuración a los valores. Si se proporcionan argumentos, deben ser strings y el valor de retorno será una secuencia que proporcione los valores asociados. Si un nombre de pila no tiene un valor correspondiente, se incluirá ``None`` para esa variable.

source: Return the full path name of the configuration header. For Unix, this will be the header generated by the :program:`configure` script; for other platforms the header will have been supplied directly by the Python source distribution. The file is a platform-specific text file.
es: Retorna el nombre completo de la ruta del encabezado de configuración. Para Unix, este será el encabezado generado por el script :program:`configure`; para otras plataformas, el encabezado habrá sido proporcionado directamente por la distribución fuente de Python. El archivo es un archivo de texto específico de la plataforma.

source: Return the full path name of the :file:`Makefile` used to build Python. For Unix, this will be a file generated by the :program:`configure` script; the meaning for other platforms will vary. The file is a platform-specific text file, if it exists. This function is only useful on POSIX platforms.
es: Retorna el nombre completo de la ruta del archivo :file:`Makefile` usado para construir Python. Para Unix, este será un archivo generado por el script :program:`configure`; el significado para otras plataformas variará. El archivo es un archivo de texto específico de la plataforma, si existe. Esta función solo es útil en plataformas POSIX.

source: Return the directory for either the general or platform-dependent C include files. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true.
es: Retorna el directorio para los archivos de inclusión de C generales o dependientes de la plataforma. Si *plat_specific* es verdadero, se retorna el directorio de inclusión dependiente de la plataforma; si es falso o se omite, se retorna el directorio independiente de la plataforma. Si se proporciona *prefix*, se usa como prefijo en lugar de :const:`PREFIX`, o como *exec-prefix* en lugar de :const:`EXEC_PREFIX` si *plat_specific* es verdadero.

source: Return the directory for either the general or platform-dependent library installation. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true. If *standard_lib* is true, the directory for the standard library is returned rather than the directory for the installation of third-party extensions.
es: Retorna el directorio para la instalación de la biblioteca general o dependiente de la plataforma. Si *plat_specific* es verdadero, se retorna el directorio de inclusión dependiente de la plataforma; si es falso o se omite, se retorna el directorio independiente de la plataforma. Si se proporciona *prefix*, se usa como prefijo en lugar de :const:`PREFIX`, o como *exec-prefix* en lugar de :const:`EXEC_PREFIX` si *plat_specific* es verdadero. Si *standard_lib* es verdadero, se retorna el directorio de la biblioteca estándar en lugar del directorio para la instalación de extensiones de terceros.

source: The following function is only intended for use within the :mod:`distutils` package.
es: La siguiente función solo está pensada para su uso dentro del paquete :mod:`distutils`.

source: Do any platform-specific customization of a :class:`distutils.ccompiler.CCompiler` instance.
es: Realiza cualquier personalización específica de la plataforma de una instancia :class:`distutils.ccompiler.CCompiler`.

source: This function is only needed on Unix at this time, but should be called consistently to support forward-compatibility. It inserts the information that varies across Unix flavors and is stored in Python's :file:`Makefile`. This information includes the selected compiler, compiler and linker options, and the extension used by the linker for shared objects.
es: Esta función solo es necesaria en Unix en este momento, pero se debe llamar de manera consistente para admitir la compatibilidad con versiones posteriores. Inserta la información que varía según los tipos de Unix y se almacena en el archivo de Python :file:`Makefile`. Esta incluye el compilador seleccionado, las opciones del compilador y del enlazador, y la extensión utilizada por el enlazador para los objetos compartidos.

source: This function is even more special-purpose, and should only be used from Python's own build procedures.
es: Esta función tiene un propósito aún más especial y solo debe usarse desde los propios procedimientos de compilación de Python.

source: Inform the :mod:`distutils.sysconfig` module that it is being used as part of the build process for Python. This changes a lot of relative locations for files, allowing them to be located in the build area rather than in an installed Python.
es: Informa al módulo :mod:`distutils.sysconfig` que se está utilizando como parte del proceso de compilación de Python. Esto cambia muchas ubicaciones relativas de los archivos, lo que les permite ubicarse en el área de compilación en lugar de en un Python instalado.

source: :mod:`distutils.text_file` --- The TextFile class
es: :mod:`distutils.text_file` --- La clase *TextFile*

source: This module provides the :class:`TextFile` class, which gives an interface to text files that (optionally) takes care of stripping comments, ignoring blank lines, and joining lines with backslashes.
es: Este módulo proporciona la clase :class:`TextFile`, que proporciona una interfaz a los archivos de texto que (opcionalmente) se encarga de eliminar los comentarios, ignorar las líneas en blanco y unir líneas con barras invertidas.

source: This class provides a file-like object that takes care of all the things you commonly want to do when processing a text file that has some line-by-line syntax: strip comments (as long as ``#`` is your comment character), skip blank lines, join adjacent lines by escaping the newline (ie. backslash at end of line), strip leading and/or trailing whitespace. All of these are optional and independently controllable.
es: Esta clase proporciona un objeto similar a un archivo que se encarga de todas las cosas que comúnmente desea hacer al procesar un archivo de texto que tiene alguna sintaxis línea por línea: elimina comentarios (siempre que ``#`` sea su carácter de comentario), omite líneas en blanco, une líneas adyacentes escapando de la nueva línea (es decir, barra invertida al final de la línea), elimina los espacios en blanco iniciales o finales. Todos estos son opcionales y controlables de forma independiente.

source: The class provides a :meth:`warn` method so you can generate warning messages that report physical line number, even if the logical line in question spans multiple physical lines. Also provides :meth:`unreadline` for implementing line-at-a-time lookahead.
es: La clase proporciona un método :meth:`warn` para que pueda generar mensajes de advertencia que informen el número de línea física, incluso si la línea lógica en cuestión abarca varias líneas físicas. También proporciona :meth:`unreadline` para implementar una búsqueda anticipada de línea a la vez.

source: :class:`TextFile` instances are create with either *filename*, *file*, or both. :exc:`RuntimeError` is raised if both are ``None``. *filename* should be a string, and *file* a file object (or something that provides :meth:`readline` and :meth:`close` methods). It is recommended that you supply at least *filename*, so that :class:`TextFile` can include it in warning messages. If *file* is not supplied, :class:`TextFile` creates its own using the :func:`open` built-in function.
es: Las instancias de :class:`TextFile` se crean con *filename*, *file* o ambos. :exc:`RuntimeError` se lanza si ambos son ``None``. *filename* debe ser un string, y *file* un archive de objeto (o algo que proporcione los métodos :meth:`readline` y :meth:`close`). Se recomienda que proporcione al menos *filename*, para que :class:`TextFile` pueda incluirlo en mensajes de advertencia. Si no se proporciona *file*, :class:`TextFile` crea uno propio usando la función incorporada :func:`open`.

source: The options are all boolean, and affect the values returned by :meth:`readline`
es: Todas las opciones son booleanas y afectan los valores retornados por :meth:`readline`

source: option name
es: nombre de la opción

source: default
es: predeterminado

source: strip from ``'#'`` to end-of-line, as well as any whitespace leading up to the ``'#'``\ ---unless it is escaped by a backslash
es: elimina desde ``'#'`` hasta el final de la línea, así como cualquier espacio en blanco que conduzca al ``'#'`` \ --- a menos que se escape por una barra invertida

source: true
es: verdadero

source: strip leading whitespace from each line before returning it
es: elimina los espacios en blanco iniciales de cada línea antes de retornarlo

source: false
es: falso

source: strip trailing whitespace (including line terminator!) from each line before returning it.
es: elimina los espacios en blanco finales (incluido el terminador de línea!) de cada línea antes de retornarlo.

source: skip lines that are empty \*after\* stripping comments and whitespace. (If both lstrip_ws and rstrip_ws are false, then some lines may consist of solely whitespace: these will \*not\* be skipped, even if *skip_blanks* is true.)
es: omite las líneas que están vacías \* después de\* elimina los comentarios y los espacios en blanco. (Si tanto *lstrip_ws* como *rstrip_ws* son falsos, algunas líneas pueden consistir únicamente en espacios en blanco: estos no se omitirán, incluso si *skip_blanks* es verdadero).

source: if a backslash is the last non-newline character on a line after stripping comments and whitespace, join the following line to it to form one logical line; if N consecutive lines end with a backslash, then N+1 physical lines will be joined to form one logical line.
es: si una barra invertida es el último carácter que no es una nueva línea en una línea después de eliminar los comentarios y los espacios en blanco, únela a la siguiente línea para formar una línea lógica; si N líneas consecutivas terminan con una barra invertida, entonces N + 1 líneas físicas se unirán para formar una línea lógica.

source: strip leading whitespace from lines that are joined to their predecessor; only matters if ``(join_lines and not lstrip_ws)``
es: elimina los espacios en blanco iniciales de las líneas que están unidas a su predecesor; solo importa si ``(*join_lines* y no *lstrip_ws*)``

source: Note that since *rstrip_ws* can strip the trailing newline, the semantics of :meth:`readline` must differ from those of the built-in file object's :meth:`readline` method! In particular, :meth:`readline` returns ``None`` for end-of-file: an empty string might just be a blank line (or an all-whitespace line), if *rstrip_ws* is true but *skip_blanks* is not.
es: Ten en cuenta que, dado que *rstrip_ws* puede eliminar la nueva línea final, la semántica de :meth:`readline` debe diferir de las del método :meth:`readline` del objeto de archivo integrado. En particular, :meth:`readline` retorna ``None`` para el final del archivo: un string vacío puede ser solo una línea en blanco (o una línea con espacios en blanco), si *rstrip_ws* es verdadero pero *skip_blanks* no es.

source: Open a new file *filename*. This overrides any *file* or *filename* constructor arguments.
es: Abre un nuevo archivo *filename*. Esto anula cualquier *file* o *filename* argumentado del constructor.

source: Close the current file and forget everything we know about it (including the filename and the current line number).
es: Cierra el archivo actual y olvida todo lo que sabemos sobre él (incluido el nombre del archivo y el número de línea actual).

source: Print (to stderr) a warning message tied to the current logical line in the current file. If the current logical line in the file spans multiple physical lines, the warning refers to the whole range, such as ``"lines 3-5"``. If *line* is supplied, it overrides the current line number; it may be a list or tuple to indicate a range of physical lines, or an integer for a single physical line.
es: Imprime (a *stderr*) un mensaje de advertencia vinculado a la línea lógica actual en el archivo actual. Si la línea lógica actual en el archivo abarca varias líneas físicas, la advertencia se refiere a todo el rango, como ``"lines 3-5"``. Si se proporciona *line*, anula el número de línea actual; puede ser una lista o tupla para indicar un rango de líneas físicas, o un número entero para una sola línea física.

source: Read and return a single logical line from the current file (or from an internal buffer if lines have previously been "unread" with :meth:`unreadline`). If the *join_lines* option is true, this may involve reading multiple physical lines concatenated into a single string. Updates the current line number, so calling :meth:`warn` after :meth:`readline` emits a warning about the physical line(s) just read. Returns ``None`` on end-of-file, since the empty string can occur if *rstrip_ws* is true but *strip_blanks* is not.
es: Lee y retorna una sola línea lógica del archivo actual (o de un búfer interno si las líneas han sido "no leídas" previamente con :meth:`unreadline`). Si la opción *join_lines* es verdadera, esto puede implicar la lectura de varias líneas físicas concatenadas en una sola cadena. Actualiza el número de línea actual, por lo que llamar a :meth:`warn` después :meth:`readline` emite una advertencia sobre las líneas físicas que acaba de leer. Retorna ``None`` al final del archivo, ya que un string vacío puede aparecer si *rstrip_ws* es verdadero pero *strip_blanks* no lo es.

source: Read and return the list of all logical lines remaining in the current file. This updates the current line number to the last line of the file.
es: Lee y retorna la lista de todas las líneas lógicas restantes en el archivo actual. Esto actualiza el número de línea actual a la última línea del archivo.

source: Push *line* (a string) onto an internal buffer that will be checked by future :meth:`readline` calls. Handy for implementing a parser with line-at-a-time lookahead. Note that lines that are "unread" with :meth:`unreadline` are not subsequently re-cleansed (whitespace stripped, or whatever) when read with :meth:`readline`. If multiple calls are made to :meth:`unreadline` before a call to :meth:`readline`, the lines will be returned most in most recent first order.
es: Empuja *line* (un string) en un búfer interno que será verificado por futuras llamadas a :meth:`readline`. Útil para implementar un analizador con búsqueda anticipada de línea a la vez. Tenga en cuenta que las líneas que están "no leídas" con :meth:`unreadline` no se vuelven a limpiar posteriormente (se eliminan los espacios en blanco o lo que sea) cuando se leen con :meth:`readline`. Si se realizan varias llamadas a :meth:`unreadline` antes de una llamada a :meth:`readline`, la mayoría de las líneas se retornarán en el primer orden más reciente.

source: :mod:`distutils.version` --- Version number classes
es: :mod:`distutils.version` --- Clases de número de versión

source: :mod:`distutils.cmd` --- Abstract base class for Distutils commands
es: :mod:`distutils.cmd` --- Clase base abstracta para comandos *Distutils*

source: This module supplies the abstract base class :class:`Command`.
es: Este módulo proporciona la clase base abstracta :class:`Command`.

source: Abstract base class for defining command classes, the "worker bees" of the Distutils. A useful analogy for command classes is to think of them as subroutines with local variables called *options*. The options are declared in :meth:`initialize_options` and defined (given their final values) in :meth:`finalize_options`, both of which must be defined by every command class. The distinction between the two is necessary because option values might come from the outside world (command line, config file, ...), and any options dependent on other options must be computed after these outside influences have been processed --- hence :meth:`finalize_options`. The body of the subroutine, where it does all its work based on the values of its options, is the :meth:`run` method, which must also be implemented by every command class.
es: La clase base abstracta para definir clases de comando, las "*worker bees*" de *Distutils*. Una analogía útil para las clases de comando es pensar en ellas como subrutinas con variables locales llamadas *options*. Las opciones se declaran en :meth:`initialize_options` y se definen (dados sus valores finales) en :meth:`finalize_options`, los cuales deben ser definidos por cada clase de comando. La distinción entre los dos es necesaria porque los valores de las opciones pueden provenir del mundo exterior (línea de comando, archivo de configuración, ...), y cualquier opción que dependa de otras opciones debe calcularse después de que se hayan procesado estas influencias externas --- por lo tanto :meth:`finalize_options`. El cuerpo de la subrutina, donde hace todo su trabajo basado en los valores de sus opciones, es el método :meth:`run`, que también debe ser implementado por cada clase de comando.

source: The class constructor takes a single argument *dist*, a :class:`~distutils.core.Distribution` instance.
es: El constructor de la clase toma un solo argumento *dist*, una instancia :class:`~ distutils.core.Distribution`.

source: Creating a new Distutils command
es: Creando un nuevo comando *Distutils*

source: This section outlines the steps to create a new Distutils command.
es: Esta sección describe los pasos para crear un nuevo comando *Distutils*.

source: A new command lives in a module in the :mod:`distutils.command` package. There is a sample template in that directory called :file:`command_template`. Copy this file to a new module with the same name as the new command you're implementing. This module should implement a class with the same name as the module (and the command). So, for instance, to create the command ``peel_banana`` (so that users can run ``setup.py peel_banana``), you'd copy :file:`command_template` to :file:`distutils/command/peel_banana.py`, then edit it so that it's implementing the class :class:`peel_banana`, a subclass of :class:`distutils.cmd.Command`.
es: Un nuevo comando reside en un módulo en el paquete :mod:`distutils.command`. Hay una plantilla de muestra en ese directorio llamada :file:`command_template`. Copia este archivo en un nuevo módulo con el mismo nombre que el nuevo comando que está implementando. Este módulo debe implementar una clase con el mismo nombre que el módulo (y el comando). Entonces, por ejemplo, para crear el comando ``peel_banana`` (para que los usuarios puedan ejecutar ``setup.py peel_banana``), deben copiar :file:`command_template` a :file:`distutils/command/peel_banana.py`, luego edítelo para que implemente la clase :class:`peel_banana`, una subclase de :class:`distutils.cmd.Command`.

source: Subclasses of :class:`Command` must define the following methods.
es: Las subclases de :class:`Command` deben definir los siguientes métodos.

source: Set default values for all the options that this command supports. Note that these defaults may be overridden by other commands, by the setup script, by config files, or by the command-line. Thus, this is not the place to code dependencies between options; generally, :meth:`initialize_options` implementations are just a bunch of ``self.foo = None`` assignments.
es: Establece valores predeterminados para todas las opciones que admite este comando. Ten en cuenta que estos valores predeterminados pueden ser anulados por otros comandos, por el script de configuración, por los archivos de configuración o por la línea de comandos. Por tanto, este no es el lugar para codificar dependencias entre opciones; generalmente, las implementaciones de :meth:`initialize_options` son solo un montón de asignaciones ``self.fo = None`` .
