Repository: python/python-docs-es
Catalog: distutils/apiref.po
Languages: es

source: Set final values for all the options that this command supports. This is always called as late as possible, ie. after any option assignments from the command-line or from other commands have been done. Thus, this is the place to code option dependencies: if *foo* depends on *bar*, then it is safe to set *foo* from *bar* as long as *foo* still has the same value it was assigned in :meth:`initialize_options`.
es: Establece valores finales para todas las opciones que admite este comando. Esto siempre se llama lo más tarde posible, es decir. después de que se hayan realizado las asignaciones de opciones desde la línea de comandos o desde otros comandos. Por lo tanto, este es el lugar para codificar las dependencias de opciones: si *foo* depende de *bar*, entonces es seguro establecer *foo* desde *bar* siempre que *foo* todavía tenga el mismo valor que se asignó en :meth:`initialize_options`.

source: A command's raison d'etre: carry out the action it exists to perform, controlled by the options initialized in :meth:`initialize_options`, customized by other commands, the setup script, the command-line, and config files, and finalized in :meth:`finalize_options`. All terminal output and filesystem interaction should be done by :meth:`run`.
es: La razón de ser de un comando: llevar a cabo la acción que debe realizar, controlada por las opciones inicializadas en :meth:`initialize_options`, personalizadas por otros comandos, el script de configuración, la línea de comandos y los archivos de configuración, y finalizadas en :meth:`finalize_options`. Toda la salida de la terminal y la interacción del sistema de archivos debe realizarse mediante :meth:`run`.

source: *sub_commands* formalizes the notion of a "family" of commands, e.g. ``install`` as the parent with sub-commands ``install_lib``, ``install_headers``, etc. The parent of a family of commands defines *sub_commands* as a class attribute; it's a list of 2-tuples ``(command_name, predicate)``, with *command_name* a string and *predicate* a function, a string or ``None``. *predicate* is a method of the parent command that determines whether the corresponding command is applicable in the current situation. (E.g. ``install_headers`` is only applicable if we have any C header files to install.) If *predicate* is ``None``, that command is always applicable.
es: *sub_commands* formaliza la noción de una "familia" de comandos, p. ej. ``install`` como padre con subcomandos ``install_lib``, ``install_headers``, etc. El padre de una familia de comandos define *sub_commands* como un atributo de clase; es una lista de 2 tuplas ``(command_name, predicate)``, con *command_name* un string y *predicate* una función, un string o ``None``. *predicate* es un método del comando padre que determina si el comando correspondiente es aplicable en la situación actual. (Por ejemplo, ``install_headers`` solo es aplicable si tenemos archivos de encabezado C para instalar). Si *predicate* es ``None``, ese comando siempre es aplicable.

source: *sub_commands* is usually defined at the *end* of a class, because predicates can be methods of the class, so they must already have been defined. The canonical example is the :command:`install` command.
es: *sub_commands* generalmente se define al *end* de una clase, porque los predicados pueden ser métodos de la clase, por lo que ya deben haber sido definidos. El ejemplo canónico es el comando :command:`install`.

source: :mod:`distutils.command` --- Individual Distutils commands
es: :mod:`distutils.command` --- Comandos individuales de *Distutils*

source: :mod:`distutils.command.bdist` --- Build a binary installer
es: :mod:`distutils.command.bdist` --- Construye un instalador binario

source: :mod:`distutils.command.bdist_packager` --- Abstract base class for packagers
es: :mod:`distutils.command.bdist_packager` --- Clase base abstracta para empaquetadores

source: :mod:`distutils.command.bdist_dumb` --- Build a "dumb" installer
es: :mod:`distutils.command.bdist_dumb` --- Construye un instalador "*dump*"

source: :mod:`distutils.command.bdist_msi` --- Build a Microsoft Installer binary package
es: :mod:`distutils.command.bdist_msi` --- Construye un paquete binario instalador de Microsoft

source: Builds a `Windows Installer`_ (.msi) binary package.
es: Construye un paquete binario `Windows Installer`_ (.msi)

source: In most cases, the ``bdist_msi`` installer is a better choice than the ``bdist_wininst`` installer, because it provides better support for Win64 platforms, allows administrators to perform non-interactive installations, and allows installation through group policies.
es: En la mayoría de los casos, el instalador ``bdist_msi`` es una mejor opción que el instalador ``bdist_wininst``, porque proporciona un mejor soporte para plataformas Win64, permite a los administradores realizar instalaciones no interactivas y permite la instalación a través de políticas de grupo.

source: :mod:`distutils.command.bdist_rpm` --- Build a binary distribution as a Redhat RPM and SRPM
es: :mod:`distutils.command.bdist_rpm` --- Construye una distribución binaria como RedHat RPM y SRPM

source: :mod:`distutils.command.bdist_wininst` --- Build a Windows installer
es: :mod:`distutils.command.bdist_wininst` --- Construye un instalador de Windows

source: Use bdist_wheel (wheel packages) instead.
es: Utiliza *bdist_wheel* (paquetes *wheel*) en su lugar.

source: :mod:`distutils.command.sdist` --- Build a source distribution
es: :mod:`distutils.command.sdist` --- Construye una distribución de código fuente

source: :mod:`distutils.command.build` --- Build all files of a package
es: :mod:`distutils.command.build` --- Construye todos los archivos de un paquete

source: :mod:`distutils.command.build_clib` --- Build any C libraries in a package
es: :mod:`distutils.command.build_clib` --- Construye cualquier biblioteca C en un paquete

source: :mod:`distutils.command.build_ext` --- Build any extensions in a package
es: :mod:`distutils.command.build_ext` --- Construye cualquier extensión en un paquete

source: :mod:`distutils.command.build_py` --- Build the .py/.pyc files of a package
es: :mod:`distutils.command.build_py` --- Construye los archivos .py/.pyc de un paquete

source: Alternative implementation of build_py which also runs the 2to3 conversion library on each .py file that is going to be installed. To use this in a setup.py file for a distribution that is designed to run with both Python 2.x and 3.x, add::
es: Implementación alternativa de *build_py* que también ejecuta la biblioteca de conversión *2to3* en cada archivo .py que se va a instalar. Para usar esto en un archivo *setup.py* de una distribución que está diseñada para ejecutarse con Python 2.x y 3.x, agrega:

source: to your setup.py, and later::
es: a su *setup.py*, y posteriormente:

source: to the invocation of setup().
es: a la invocación de configuración setup().

source: :mod:`distutils.command.build_scripts` --- Build the scripts of a package
es: :mod:`distutils.command.build_scripts` --- Construye los scripts de un paquete

source: :mod:`distutils.command.clean` --- Clean a package build area
es: :mod:`distutils.command.clean` --- Limpia el área de construcción de un paquete

source: This command removes the temporary files created by :command:`build` and its subcommands, like intermediary compiled object files. With the ``--all`` option, the complete build directory will be removed.
es: Este comando elimina los archivos temporales creados por el comando :command:`build` y sus subcomandos, como archivos de objeto compilados intermediarios. Con la opción ``--all``, se eliminará el directorio de compilación completo.

source: Extension modules built :ref:`in place <distutils-build-ext-inplace>` will not be cleaned, as they are not in the build directory.
es: Los módulos de extensión construidos :ref:`in place <distutils-build-ext-inplace>` no se limpiarán, ya que no están en el directorio de construcción.

source: :mod:`distutils.command.config` --- Perform package configuration
es: :mod:`distutils.command.config` --- Realiza la configuración de un paquete

source: :mod:`distutils.command.install` --- Install a package
es: :mod:`distutils.command.install` --- Instala un paquete

source: :mod:`distutils.command.install_data` --- Install data files from a package
es: :mod:`distutils.command.install_data` --- Instala archivos de datos de un paquete

source: :mod:`distutils.command.install_headers` --- Install C/C++ header files from a package
es: :mod:`distutils.command.install_headers` --- Instala archivos de encabezado C/C++ desde un paquete

source: :mod:`distutils.command.install_lib` --- Install library files from a package
es: :mod:`distutils.command.install_lib` --- Instala archivos de biblioteca desde un paquete

source: :mod:`distutils.command.install_scripts` --- Install script files from a package
es: :mod:`distutils.command.install_scripts` --- Instala archivos de script desde un paquete

source: :mod:`distutils.command.register` --- Register a module with the Python Package Index
es: :mod:`distutils.command.register` --- Registra un módulo con el índice de paquetes de Python

source: The ``register`` command registers the package with the Python Package Index. This is described in more detail in :pep:`301`.
es: El comando ``register`` registra el paquete con el índice de paquetes de Python. Esto se describe con más detalle en :pep:`301`.

source: :mod:`distutils.command.check` --- Check the meta-data of a package
es: :mod:`distutils.command.check` --- Verificar los metadatos de un paquete

source: The ``check`` command performs some tests on the meta-data of a package. For example, it verifies that all required meta-data are provided as the arguments passed to the :func:`setup` function.
es: El comando ``check`` realiza algunas pruebas en los metadatos de un paquete. Por ejemplo, verifica que todos los metadatos requeridos se proporcionen como argumentos pasados ​​a la función :func:`setup`.
