Repository: python/python-docs-es
Catalog: distutils/apiref.po
Languages: es

source: API Reference
es: Referencia de la API

source: `New and changed setup.py arguments in setuptools`_
es: `Argumentos nuevos y cambiados de setup.py en setuptools`_

source: The ``setuptools`` project adds new capabilities to the ``setup`` function and other APIs, makes the API consistent across different Python versions, and is hence recommended over using ``distutils`` directly.
es: El proyecto ``setuptools`` añade nuevas capacidades a la función ``setup`` y otras API, hace que la API sea coherente en diferentes versiones de Python y, por lo tanto, se recomienda usar ``distutils`` directamente.

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
es: Este documento se conserva únicamente hasta que la documentación de ``setuptools`` en https://setuptools.readthedocs.io/en/latest/setuptools.html cubra de forma independiente toda la información relevante que actualmente se incluye aquí.

source: :mod:`distutils.core` --- Core Distutils functionality
es: :mod:`distutils.core` --- Funcionalidad Core Distutils

source: The :mod:`distutils.core` module is the only module that needs to be installed to use the Distutils. It provides the :func:`setup` (which is called from the setup script). Indirectly provides the :class:`distutils.dist.Distribution` and :class:`distutils.cmd.Command` class.
es: El módulo :mod:`distutils.core` es el único módulo que necesita ser instalado para utilizar *Distutils*. Proporciona el :func:`setup` (que es llamado desde el script de configuración). Indirectamente proporciona la clase :class:`distutils.dist.Distribution` y la clase :class:`distutils.cmd.Command`.

source: The basic do-everything function that does most everything you could ever ask for from a Distutils method.
es: La función básica *do-everything* hace casi todo lo que podrías pedir de un método *Distutils*.

source: The setup function takes a large number of arguments. These are laid out in the following table.
es: La función de configuración toma un gran número de argumentos. Estos se presentan en la siguiente tabla.

source: argument name
es: nombre del argumento

source: value
es: valor

source: type
es: tipo

source: The name of the package
es: El nombre del paquete

source: a string
es: un string

source: The version number of the package; see :mod:`distutils.version`
es: El número de versión del paquete; ver :mod:`distutils.version`

source: A single line describing the package
es: Una sola línea describiendo el paquete

source: Longer description of the package
es: Descripción larga del paquete

source: The name of the package author
es: El nombre del autor del paquete

source: The email address of the package author
es: La dirección de correo electrónico del autor del paquete

source: The name of the current maintainer, if different from the author. Note that if the maintainer is provided, distutils will use it as the author in :file:`PKG-INFO`
es: El nombre del mantenedor actual, si es diferente del autor. Ten en cuenta que si se proporciona el mantenedor, *distuils* lo usará como el autor en :file:`PKG-INFO`

source: The email address of the current maintainer, if different from the author
es: La dirección de correo electrónico del mantenedor actual, si es diferente del autor

source: A URL for the package (homepage)
es: Una URL para el paquete (página principal)

source: A URL to download the package
es: Una URL para descargar el paquete

source: A list of Python packages that distutils will manipulate
es: Una lista de paquetes Python que *distutils* podrá manipular

source: a list of strings
es: una lista de strings

source: A list of Python modules that distutils will manipulate
es: Una lista de módulos Python que *distutils* podrá manipular

source: A list of standalone script files to be built and installed
es: Una lista de archivos únicos de scripts que serán creados e instalados

source: A list of Python extensions to be built
es: Una lista de extensiones Python para ser creadas

source: a list of instances of :class:`distutils.core.Extension`
es: una lista de las instancias de la clase :class:`distutils.core.Extension`

source: A list of categories for the package
es: Una lista de categorías para el paquete

source: a list of strings; valid classifiers are listed on `PyPI <https://pypi.org/classifiers>`_.
es: una lista de strings; los clasificadores válidos están listados en `PyPI <https://pypi.org/classifiers>`_.

source: the :class:`Distribution` class to use
es: la clase para usar la clase :class:`Distribution`

source: a subclass of :class:`distutils.core.Distribution`
es: una sub-clase de la clase :class:`distutils.core.Distribution`

source: The name of the setup.py script - defaults to ``sys.argv[0]``
es: El nombre del script del setup.py - el predeterminado es ``sys.argv[0]``

source: Arguments to supply to the setup script
es: Argumentos para suministrar el script de configuración

source: default options for the setup script
es: opciones por defecto para el script de configuración

source: a dictionary
es: un diccionario

source: The license for the package
es: La licencia para el paquete

source: Descriptive meta-data, see :pep:`314`
es: Metadatos descriptivos, ver :pep:`314`

source: a list of strings or a comma-separated string
es: una lista de strings o un string separado por comas

source: A mapping of command names to :class:`Command` subclasses
es: Una asignación de los nombres de los comandos a las sub-clases de la clase :class:`Command`

source: A list of data files to install
es: Una lista de archivos de datos para instalar

source: a list
es: una lista

source: A mapping of package to directory names
es: Una asignación de directorios a los nombres de los paquetes

source: Run a setup script in a somewhat controlled environment, and return the :class:`distutils.dist.Distribution` instance that drives things. This is useful if you need to find out the distribution meta-data (passed as keyword args from *script* to :func:`setup`), or the contents of the config files or command-line.
es: Ejecuta un script de instalación en un entorno algo controlado y retorna la instancia de la clase :class:`distutils.dist.Distribution` que maneja las cosas. Esto es útil si se necesitan encontrar los metadatos de distribución (pasados ​​como palabra clave *args* desde un script a la función :func:`setup`), o el contenido de los archivos de configuración o la línea de comandos.

source: *script_name* is a file that will be read and run with :func:`exec`. ``sys.argv[0]`` will be replaced with *script* for the duration of the call. *script_args* is a list of strings; if supplied, ``sys.argv[1:]`` will be replaced by *script_args* for the duration of the call.
es: *script_name* o nombre del script es un archivo que será leído y ejecutado con la función :func:`exec`. ``sys.argv[0]`` será reemplazado con un script durante la duración de la llamada. *script_args* es una lista de strings; si se proporciona, ``sys.argv[1:]`` será reemplazado por *script_args* durante la duración de la llamada.

source: *stop_after* tells :func:`setup` when to stop processing; possible values:
es: *stop_after* le dice a la función :func:`setup` cuando parar el procesamiento; los valores posibles son:

source: description
es: descripción

source: Stop after the :class:`Distribution` instance has been created and populated with the keyword arguments to :func:`setup`
es: Detiene después de que la instancia de la clase :class:`Distribution` haya sido creada y llenada con los argumentos de la palabra clave para la función :func:`setup`

source: Stop after config files have been parsed (and their data stored in the :class:`Distribution` instance)
es: Detiene después que los archivos de configuración hayan sido analizados (y sus datos almacenados en la instancia de la clase :class:`Distribution`)

source: Stop after the command-line (``sys.argv[1:]`` or *script_args*) have been parsed (and the data stored in the :class:`Distribution` instance.)
es: Detiene después de que la línea de comandos (``sys.argv[1:]`` o *script_args*) se haya analizado (y los datos almacenados en la instancia de la clase :class:`Distribution`.)

source: Stop after all commands have been run (the same as if :func:`setup` had been called in the usual way). This is the default value.
es: Detiene después de que todos los comandos hayan sido ejecutados (lo mismo que si la función :func:`setup` haya sido llamada de forma habitual). Este es el valor predeterminado.

source: In addition, the :mod:`distutils.core` module exposed a number of classes that live elsewhere.
es: Además, el módulo :mod:`distutils.core` expuso una serie de clases que residen en otros lugares.

source: :class:`~distutils.extension.Extension` from :mod:`distutils.extension`
es: la clase :class:`~distutils.extension.Extension` del módulo :mod:`distutils.extension`

source: :class:`~distutils.cmd.Command` from :mod:`distutils.cmd`
es: la clase :class:`~distutils.cmd.Command` del módulo :mod:`distutils.cmd`

source: :class:`~distutils.dist.Distribution` from :mod:`distutils.dist`
es: la clase :class:`~distutils.dist.Distribution` del módulo :mod:`distutils.dist`

source: A short description of each of these follows, but see the relevant module for the full reference.
es: A continuación una breve descripción de cada uno de estos, pero para una referencia completa consulta el módulo correspondiente.

source: The Extension class describes a single C or C++ extension module in a setup script. It accepts the following keyword arguments in its constructor:
es: La clase *Extension* describe un solo módulo de extensión C o C++ en un script de configuración. Acepta los siguientes argumentos de palabras clave de su constructor:

source: the full name of the extension, including any packages --- ie. *not* a filename or pathname, but Python dotted name
es: el nombre completo de la extensión, incluidos los paquetes --- es decir, no un nombre de archivo o ruta, sino un nombre punteado Python

source: list of source filenames, relative to the distribution root (where the setup script lives), in Unix form (slash-separated) for portability. Source files may be C, C++, SWIG (.i), platform-specific resource files, or whatever else is recognized by the :command:`build_ext` command as source for a Python extension.
es: lista de nombres de archivos de origen, en relación con la raíz de distribución (donde reside el script de configuración), en forma Unix (separados por barras) para su portabilidad. Los archivos fuente pueden ser C, C ++, SWIG (.i), archivos de recursos específicos de la plataforma o cualquier otra cosa que el comando :command:`build_ext` reconozca como fuente para una extensión de Python.

source: list of directories to search for C/C++ header files (in Unix form for portability)
es: lista de los directorios para buscar archivos de encabezados de C/C++ (en forma de Unix para portabilidad)

source: list of macros to define; each macro is defined using a 2-tuple ``(name, value)``, where *value* is either the string to define it to or ``None`` to define it without a particular value (equivalent of ``#define FOO`` in source or :option:`!-DFOO` on Unix C compiler command line)
es: lista de macros para definir; cada macro se define usando una tupla de 2 ``(*name*, *value*)``, donde *value* es el string para definirla o ``None`` para definirla sin un valor particular (equivalente a ``#define FOO`` en la fuente o :option:`!-DFOO` en la línea de comandos de un compilador de Unix C)

source: a list of tuples
es: una lista de tuplas

source: list of macros to undefine explicitly
es: lista de macros para indefinir explícitamente

source: list of directories to search for C/C++ libraries at link time
es: lista de directorios para buscar bibliotecas C/C++ en el momento del enlace

source: list of library names (not filenames or paths) to link against
es: lista de nombres de bibliotecas para vincular (no nombres de archivos o rutas)

source: list of directories to search for C/C++ libraries at run time (for shared extensions, this is when the extension is loaded)
es: lista de directorios para buscar bibliotecas C/C++ en tiempo de ejecución (para extensiones compartidas, esto es cuando se carga una extensión)

source: list of extra files to link with (eg. object files not implied by 'sources', static library that must be explicitly specified, binary resource files, etc.)
es: lista de archivos adicionales para vincular (por ejemplo, archivos de objeto no implícitos en `*sources*`, una biblioteca estática que debe especificarse explicitamente, archivos de recursos binarios, etc.)

source: any extra platform- and compiler-specific information to use when compiling the source files in 'sources'. For platforms and compilers where a command line makes sense, this is typically a list of command-line arguments, but for other platforms it could be anything.
es: cualquier adicional específico de la plataforma y del compilador para usar cuando compila los archivos fuente en `*sources*`. Para plataformas y compiladores donde una línea de comando tiene sentido, esta es típicamente una lista de argumentos de línea de comando pero para otras plataformas podría ser cualquier cosa.

source: any extra platform- and compiler-specific information to use when linking object files together to create the extension (or to create a new static Python interpreter). Similar interpretation as for 'extra_compile_args'.
es: cualquier adicional específico de la plataforma y del compilador para usar al vincular archivos del tipo objeto para crear la extensión (o para crear un nuevo intérprete de Python estático). Interpretación similar a la de `*extra_compile_args*`.

source: list of symbols to be exported from a shared extension. Not used on all platforms, and not generally necessary for Python extensions, which typically export exactly one symbol: ``init`` + extension_name.
es: lista de símbolos que se exportarán desde una extensión compartida. No se usa en todas las plataformas y, en general, no es necesario para las extensiones de Python, que normalmente exportan exactamente un símbolo: ``init`` + *extension_name*.

source: list of files that the extension depends on
es: lista de archivos de los que depende la extensión

source: extension language (i.e. ``'c'``, ``'c++'``, ``'objc'``). Will be detected from the source extensions if not provided.
es: lenguaje de extensión (es decir, ``'c'``, ``'c++'``, ``'objc'``). Se detectará en las extensiones de origen si no se proporcionan.

source: specifies that a build failure in the extension should not abort the build process, but simply skip the extension.
es: especifica que una falla de compilación en la extensión no debe abortar el proceso de compilación, sino simplemente omitir la extensión.

source: a boolean
es: un booleano

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin.
es: En Unix, las extensiones C ya no están vinculadas a libpython excepto en Android y Cygwin.

source: A :class:`Distribution` describes how to build, install and package up a Python software package.
es: Una clase :class:`Distribution` describe cómo construir, instalar y empaquetar un paquete de software Python.

source: See the :func:`setup` function for a list of keyword arguments accepted by the Distribution constructor. :func:`setup` creates a Distribution instance.
es: Consulta la función :func:`setup` para obtener una lista de argumentos de palabras clave aceptados por el constructor de distribución. La función :func:`setup` crea una instancia de distribución.

source: :class:`~distutils.core.Distribution` now warns if ``classifiers``, ``keywords`` and ``platforms`` fields are not specified as a list or a string.
es: La clase :class:`~distutils.core.Distribution` ahora advierte si los campos ``*classifiers*``, ``*keywords*`` y ``*platforms*`` no se especifican como una lista o un string.

source: A :class:`Command` class (or rather, an instance of one of its subclasses) implement a single distutils command.
es: Una clase :class:`Command` (o más bien, una instancia de una de sus subclases) implementa un solo comando distutils.

source: :mod:`distutils.ccompiler` --- CCompiler base class
es: :mod:`distutils.ccompiler` --- Clase base CCompiler

source: This module provides the abstract base class for the :class:`CCompiler` classes. A :class:`CCompiler` instance can be used for all the compile and link steps needed to build a single project. Methods are provided to set options for the compiler --- macro definitions, include directories, link path, libraries and the like.
es: Este módulo proporciona la clase base abstracta para las clases :class:`CCompiler`. Una instancia de la clase :class:`CCompiler` se puede usar para todos los pasos de compilación y enlace necesarios para construir un solo proyecto. Se proporcionan métodos para establecer opciones para el compilador --- definiciones de macros, que incluyen directorios, ruta de enlace, bibliotecas y similares.

source: This module provides the following functions.
es: Este módulo proporciona las siguientes funciones.

source: Generate linker options for searching library directories and linking with specific libraries. *libraries* and *library_dirs* are, respectively, lists of library names (not filenames!) and search directories. Returns a list of command-line options suitable for use with some compiler (depending on the two format strings passed in).
es: Genera opciones de vinculador para buscar directorios de bibliotecas y vincular con bibliotecas específicas. *libraries* y * library_dirs* son, respectivamente, listas de nombres de bibliotecas (no nombres de archivos!) y directorios de búsqueda. Retorna una lista de opciones de línea de comandos adecuadas para su uso con algún compilador (dependiendo de los dos strings de formato suministrados).

source: Generate C pre-processor options (:option:`!-D`, :option:`!-U`, :option:`!-I`) as used by at least two types of compilers: the typical Unix compiler and Visual C++. *macros* is the usual thing, a list of 1- or 2-tuples, where ``(name,)`` means undefine (:option:`!-U`) macro *name*, and ``(name, value)`` means define (:option:`!-D`) macro *name* to *value*. *include_dirs* is just a list of directory names to be added to the header file search path (:option:`!-I`). Returns a list of command-line options suitable for either Unix compilers or Visual C++.
es: Genera opciones de preprocesador de C (:option:`!-D`, :option:`!-U`, :option:`!-I`) tal como lo utilizan al menos dos tipos de compiladores: el compilador típico de Unix y el Visual C++. *macros* es lo habitual, una lista de 1 o 2 tuplas, donde ``(*name*,)`` significa indefinir (:option:`!-U`) macro *name*, y ``(*name*, *value*)`` significa definir (:option:`!-D`) macro de *name* a *value*. *include_dirs* es solo una lista de nombres de directorio que se agregarán a la ruta de búsqueda del archivo de encabezado (:option:`!-I`). Retorna una lista de opciones de línea de comandos adecuadas para compiladores de Unix o Visual C++.

source: Determine the default compiler to use for the given platform.
es: Determina el compilador predeterminado que se utilizará para la plataforma dada.

source: *osname* should be one of the standard Python OS names (i.e. the ones returned by ``os.name``) and *platform* the common value returned by ``sys.platform`` for the platform in question.
es: *osname* debe ser uno de los nombres estándar de Python OS (es decir, los retornados por ``os.name``) y *platform* el valor común retornado por ``sys.platform`` para la plataforma en cuestión.

source: The default values are ``os.name`` and ``sys.platform`` in case the parameters are not given.
es: Los valores predeterminados son ``os.name`` y ``sys.platform`` en caso de que no se proporcionen los parámetros.

source: Factory function to generate an instance of some CCompiler subclass for the supplied platform/compiler combination. *plat* defaults to ``os.name`` (eg. ``'posix'``, ``'nt'``), and *compiler* defaults to the default compiler for that platform. Currently only ``'posix'`` and ``'nt'`` are supported, and the default compilers are "traditional Unix interface" (:class:`UnixCCompiler` class) and Visual C++ (:class:`MSVCCompiler` class). Note that it's perfectly possible to ask for a Unix compiler object under Windows, and a Microsoft compiler object under Unix---if you supply a value for *compiler*, *plat* is ignored.
es: Función de fábrica para generar una instancia de alguna subclase *CCompiler* para la combinación de plataforma/compilador proporcionada. *plat* por defecto es ``os.name`` (por ejemplo, ``'posix'``, ``'nt'``), y *compiler* por defecto es el compilador por defecto para esa plataforma. Actualmente solo se admiten ``'posix'`` y ``'nt'``, y los compiladores predeterminados son la "interfaz Unix tradicional" (clase :class:`UnixCCompiler`) y Visual C++ (clase :class:`MSVCCompiler`). Tenga en cuenta que es perfectamente posible solicitar un objeto de compilador de Unix en Windows y un objeto de compilador de Microsoft en Unix --- si proporciona un valor para *compiler*, *plat* es ignorado.

source: Print list of available compilers (used by the :option:`!--help-compiler` options to :command:`build`, :command:`build_ext`, :command:`build_clib`).
es: Imprime la lista de compiladores disponibles (usado por las opciones :option:`! - help-compiler` para :command:`build`, :command: `build_ext`, :command:`build_clib`).

source: The abstract base class :class:`CCompiler` defines the interface that must be implemented by real compiler classes. The class also has some utility methods used by several compiler classes.
es: La clase base abstracta :class:`CCompiler` define la interfaz que deben implementar las clases de compiladores reales. La clase también tiene algunos métodos de utilidad utilizados por varias clases de compiladores.

source: The basic idea behind a compiler abstraction class is that each instance can be used for all the compile/link steps in building a single project. Thus, attributes common to all of those compile and link steps --- include directories, macros to define, libraries to link against, etc. --- are attributes of the compiler instance. To allow for variability in how individual files are treated, most of those attributes may be varied on a per-compilation or per-link basis.
es: La idea básica detrás de una clase de abstracción de compilador es que cada instancia se puede usar para todos los pasos de compilación/enlace en la construcción de un solo proyecto. Por lo tanto, los atributos comunes a todos esos pasos de compilación y enlace --- incluyen directorios, macros para definir, bibliotecas para enlazar, etc. --- son atributos de la instancia del compilador. Para permitir la variabilidad en la forma en que se tratan los archivos individuales, la mayoría de esos atributos se pueden variar por compilación o por enlace.
