Repository: python/python-docs-es
Catalog: distutils/apiref.po
Languages: es

source: Link an executable. *output_progname* is the name of the file executable, while *objects* are a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
es: Enlaza un ejecutable. *output_progname* es el nombre del archivo ejecutable, mientras que *objects* son una lista de nombres de archivos de objetos para vincular. Otros argumentos son para métodos como :meth:`link`.

source: Link a shared library. *output_libname* is the name of the output library, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
es: Enlaza una biblioteca compartida. *output_libname* es el nombre de la biblioteca de salida, mientras que *objects* es una lista de nombres de archivos de objetos para vincular. Otros argumentos son para métodos como :meth:`link`.

source: Link a shared object. *output_filename* is the name of the shared object that will be created, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
es: Enlaza un objeto compartido. *output_filename* es el nombre del objeto compartido que se creará, mientras que *objects* es una lista de nombres de archivos de objetos para vincular. Otros argumentos son para métodos como :meth:`link`.

source: Preprocess a single C/C++ source file, named in *source*. Output will be written to file named *output_file*, or *stdout* if *output_file* not supplied. *macros* is a list of macro definitions as for :meth:`compile`, which will augment the macros set with :meth:`define_macro` and :meth:`undefine_macro`. *include_dirs* is a list of directory names that will be added to the default list, in the same way as :meth:`add_include_dir`.
es: Preprocesa un solo archivo fuente C/C ++, nombrado en *source*. La salida se escribirá en el archivo llamado *output_file*, o *stdout* si *output_file* no se proporciona. *macros* es una lista de definiciones de macros para métodos como :meth:`compile`, que aumentará el conjunto de macros con :meth:`define_macro` y :meth:`undefine_macro`. *include_dirs* es una lista de nombres de directorio que se agregarán a la lista predeterminada, de la misma manera que :meth:`add_include_dir`.

source: Raises :exc:`PreprocessError` on failure.
es: Lanza :exc:`PreprocessError` en caso de falla.

source: The following utility methods are defined by the :class:`CCompiler` class, for use by the various concrete subclasses.
es: Los siguientes métodos de utilidad están definidos por la clase :class:`CCompiler`, para uso de las distintas subclases concretas.

source: Returns the filename of the executable for the given *basename*. Typically for non-Windows platforms this is the same as the basename, while Windows will get a :file:`.exe` added.
es: Retorna el nombre de archivo del ejecutable para el *basename* dado. Por lo general, para las plataformas que no son de Windows, este es el mismo que el nombre base, mientras que Windows obtendrá un archivo :file:`.exe` agregado.

source: Returns the filename for the given library name on the current platform. On Unix a library with *lib_type* of ``'static'`` will typically be of the form :file:`liblibname.a`, while a *lib_type* of ``'dynamic'`` will be of the form :file:`liblibname.so`.
es: Retorna el nombre de archivo para el nombre de biblioteca dado en la plataforma actual. En Unix, una biblioteca con *lib_type* de ``'static'`` normalmente tendrá la forma :file:`liblibname.a`, mientras que *lib_type* de ``'dynamic'`` tendrá la forma :file:`liblibname.so`.

source: Returns the name of the object files for the given source files. *source_filenames* should be a list of filenames.
es: Retorna el nombre de los archivos de objeto para los archivos de origen dados. *source_filenames* debe ser una lista de nombres de archivo.

source: Returns the name of a shared object file for the given file name *basename*.
es: Retorna el nombre de un archivo de objeto compartido para el nombre de archivo *basename*.

source: Invokes :func:`distutils.util.execute`. This method invokes a Python function *func* with the given arguments *args*, after logging and taking into account the *dry_run* flag.
es: Invoca el método :func:`distutils.util.execute`. Este método invoca una función de Python *func* con los argumentos *args* dados, después de iniciar sesión y teniendo en cuenta el indicador *dry_run*.

source: Invokes :func:`distutils.util.spawn`. This invokes an external process to run the given command.
es: Invoca :func:`distutils.util.spawn`. Esto invoca un proceso externo para ejecutar el comando dado.

source: Invokes :func:`distutils.dir_util.mkpath`. This creates a directory and any missing ancestor directories.
es: Invoca :func:`distutils.dir_util.mkpath`. Esto crea un directorio y los directorios ancestros que faltan.

source: Invokes :meth:`distutils.file_util.move_file`. Renames *src* to *dst*.
es: Invoca :meth:`distutils.file_util.move_file`. Cambia el nombre de *src* a *dst*.

source: Write a message using :func:`distutils.log.debug`.
es: Escribe un mensaje usando :func:`distutils.log.debug`.

source: Write a warning message *msg* to standard error.
es: Escribe un mensaje de advertencia *msg* al error estándar.

source: If the *debug* flag is set on this :class:`CCompiler` instance, print *msg* to standard output, otherwise do nothing.
es: Si el indicador *debug* está configurado en la instancia de la clase :class:`CCompiler`, imprime *msg* en la salida estándar; de lo contrario, no hace nada.

source: This module provides the :class:`UnixCCompiler` class, a subclass of :class:`CCompiler` that handles the typical Unix-style command-line C compiler:
es: Este módulo proporciona la clase :class:`UnixCCompiler`, una subclase de :class:`CCompiler` que maneja el típico compilador C de línea de comandos estilo Unix:

source: macros defined with :option:`!-Dname[=value]`
es: macros definidas con :option:`!-Dname[= value]`

source: macros undefined with :option:`!-Uname`
es: macros definidas con :option:`!-Uname`

source: include search directories specified with :option:`!-Idir`
es: incluye directorios de búsqueda especificados con :option:`!-Idir`

source: libraries specified with :option:`!-llib`
es: bibliotecas especificadas con :option:`!-llib`

source: library search directories specified with :option:`!-Ldir`
es: directorios de búsqueda de bibliotecas especificados con :option:`!-Ldir`

source: compile handled by :program:`cc` (or similar) executable with :option:`!-c` option: compiles :file:`.c` to :file:`.o`
es: compilación manejada por :program:`cc` (o similar) ejecutable con :option:`!-c` opción: compilar :file:`.c` a :file:`.o`

source: link static library handled by :program:`ar` command (possibly with :program:`ranlib`)
es: enlaza la biblioteca estática manejada por el comando :program:`ar` (posiblemente con :program:`ranlib`)

source: link shared library handled by :program:`cc` :option:`!-shared`
es: enlaza la biblioteca compartida manejada por :program:`cc` :option:`!-shared`

source: :mod:`distutils.msvccompiler` --- Microsoft Compiler
es: :mod:`distutils.msvccompiler` --- Compilador de Microsoft

source: This module provides :class:`MSVCCompiler`, an implementation of the abstract :class:`CCompiler` class for Microsoft Visual Studio. Typically, extension modules need to be compiled with the same compiler that was used to compile Python. For Python 2.3 and earlier, the compiler was Visual Studio 6. For Python 2.4 and 2.5, the compiler is Visual Studio .NET 2003.
es: Este módulo proporciona :class:`MSVCCompiler`, una implementación de la clase abstracta :class:`CCompiler` para Microsoft Visual Studio. Por lo general, los módulos de extensión deben compilarse con el mismo compilador Python que se utilizó para compilar. Para Python 2.3 y versiones anteriores, el compilador fue Visual Studio 6. Para Python 2.4 y 2.5, el compilador es Visual Studio .NET 2003.

source: :class:`MSVCCompiler` will normally choose the right compiler, linker etc. on its own. To override this choice, the environment variables *DISTUTILS_USE_SDK* and *MSSdk* must be both set. *MSSdk* indicates that the current environment has been setup by the SDK's ``SetEnv.Cmd`` script, or that the environment variables had been registered when the SDK was installed; *DISTUTILS_USE_SDK* indicates that the distutils user has made an explicit choice to override the compiler selection by :class:`MSVCCompiler`.
es: :class:`MSVCCompiler` normalmente elegirá el compilador, enlazador, etc. correcto por sí solo. Para anular esta opción, las variables de entorno *DISTUTILS_USE_SDK* y *MSSdk* deben estar configuradas. *MSSdk* indica que el entorno actual ha sido configurado por el script ``SetEnv.Cmd`` del SDK, o que las variables de entorno se habían registrado cuando se instaló el SDK; *DISTUTILS_USE_SDK* indica que el usuario de *distutils* ha hecho una elección explícita para anular la selección del compilador por :class:`MSVCCompiler`.

source: :mod:`distutils.bcppcompiler` --- Borland Compiler
es: :mod:`distutils.bcppcompiler` --- Compilador Borland

source: This module provides :class:`BorlandCCompiler`, a subclass of the abstract :class:`CCompiler` class for the Borland C++ compiler.
es: Este módulo proporciona :class:`BorlandCCompiler`, una subclase de la clase abstracta :class:`CCompiler` para el compilador Borland C++.

source: :mod:`distutils.cygwincompiler` --- Cygwin Compiler
es: :mod:`distutils.cygwincompiler` --- Compilador Cygwin

source: This module provides the :class:`CygwinCCompiler` class, a subclass of :class:`UnixCCompiler` that handles the Cygwin port of the GNU C compiler to Windows. It also contains the Mingw32CCompiler class which handles the mingw32 port of GCC (same as cygwin in no-cygwin mode).
es: Este módulo proporciona la clase :class:`CygwinCCompiler`, una subclase de :class:`UnixCCompiler` que maneja el puerto Cygwin del compilador GNU C a Windows. También contiene la clase Mingw32CCompiler que maneja el puerto mingw32 de GCC (igual que cygwin en modo no-cygwin).

source: :mod:`distutils.archive_util` --- Archiving utilities
es: :mod:`distutils.archive_util` --- Utilidades de archivo

source: This module provides a few functions for creating archive files, such as tarballs or zipfiles.
es: Este módulo proporciona algunas funciones para crear archivos de almacenamiento, como *tarballs* o *zipfiles*.

source: Create an archive file (eg. ``zip`` or ``tar``). *base_name* is the name of the file to create, minus any format-specific extension; *format* is the archive format: one of ``zip``, ``tar``, ``gztar``, ``bztar``, ``xztar``, or ``ztar``. *root_dir* is a directory that will be the root directory of the archive; ie. we typically ``chdir`` into *root_dir* before creating the archive. *base_dir* is the directory where we start archiving from; ie. *base_dir* will be the common prefix of all files and directories in the archive. *root_dir* and *base_dir* both default to the current directory. Returns the name of the archive file.
es: Crea un archivo de almacenamiento (por ejemplo, ``zip`` o ``tar``). *base_name* es el nombre del archivo a crear, menos cualquier extensión específica del formato; *format* es el formato de archivo: como ``zip``, ``tar``, ``gztar``, ``bztar``, ``xztar`` o ``ztar``. *root_dir* es un directorio que será el directorio raíz del archivo; es decir, normalmente ``chdir`` en *root_dir* antes de crear el archivo. *base_dir* es el directorio desde donde comenzamos a archivar; es decir, *base_dir* será el prefijo común de todos los archivos y directorios del archivo. *root_dir* y *base_dir* ambos predeterminados al directorio actual. Retorna el nombre del archivo de almacenamiento.

source: Added support for the ``xztar`` format.
es: Se agregó soporte para el formato ``xztar``.

source: 'Create an (optional compressed) archive as a tar file from all files in and under *base_dir*. *compress* must be ``'gzip'`` (the default), ``'bzip2'``, ``'xz'``, ``'compress'``, or ``None``. For the ``'compress'`` method the compression utility named by :program:`compress` must be on the default program search path, so this is probably Unix-specific. The output tar file will be named :file:`base_dir.tar`, possibly plus the appropriate compression extension (``.gz``, ``.bz2``, ``.xz`` or ``.Z``). Return the output filename.
es: Crea un archivo (opcionalmente comprimido) como un archivo ``tar`` de todos los archivos en y bajo *base_dir*. *compress* debe ser ``'gzip'`` (el valor predeterminado), ``'bzip2'``, ``'xz'``, ``'compress``' o ``None``. Para el método ``'compress'``, la utilidad de compresión nombrada por :program:`compress` debe estar en la ruta de búsqueda del programa predeterminada, por lo que probablemente sea específica de Unix. El archivo ``tar`` de salida se llamará :file:`base_dir.tar`, posiblemente más la extensión de compresión apropiada (``.gz``,``.bz2``,``.xz`` o ``.Z``). Retorna el nombre del archivo de salida.

source: Added support for the ``xz`` compression.
es: Se agregó soporte para la compresión ``xz``.

source: Create a zip file from all files in and under *base_dir*. The output zip file will be named *base_name* + :file:`.zip`. Uses either the :mod:`zipfile` Python module (if available) or the InfoZIP :file:`zip` utility (if installed and found on the default search path). If neither tool is available, raises :exc:`DistutilsExecError`. Returns the name of the output zip file.
es: Crea un archivo *zip* a partir de todos los archivos incluidos en *base_dir*. El archivo *zip* de salida se llamará *base_name* + :file:`.zip`. Utiliza el módulo Python :mod:`zipfile` (si está disponible) o la utilidad InfoZIP :file:`zip` (si está instalada y se encuentra en la ruta de búsqueda predeterminada). Si ninguna de las herramientas está disponible, lanza :exc:`DistutilsExecError`. Retorna el nombre del archivo *zip* de salida.

source: :mod:`distutils.dep_util` --- Dependency checking
es: :mod:`distutils.dep_util` --- Comprobación de dependencias

source: This module provides functions for performing simple, timestamp-based dependency of files and groups of files; also, functions based entirely on such timestamp dependency analysis.
es: Este módulo proporciona funciones para realizar una dependencia simple basada en marcas de tiempo de archivos y grupos de archivos; también, funciones basadas completamente en dicho análisis de dependencia de marca de tiempo.

source: Return true if *source* exists and is more recently modified than *target*, or if *source* exists and *target* doesn't. Return false if both exist and *target* is the same age or newer than *source*. Raise :exc:`DistutilsFileError` if *source* does not exist.
es: Retorna verdadero si *source* existe y se ha modificado más recientemente que *target*, o si *source* existe y *target* no. Retorna falso si ambos existen y si *target* tiene el mismo tiempo o es más reciente que *source*. Lanza :exc:`DistutilsFileError` si *source* no existe.

source: Walk two filename lists in parallel, testing if each source is newer than its corresponding target. Return a pair of lists (*sources*, *targets*) where source is newer than target, according to the semantics of :func:`newer`.
es: Recorre dos listas de nombres de archivos en paralelo, probando si cada fuente es más nueva que su correspondiente destino. Retorna un par de listas (*sources*, *target*) donde la fuente es más nueva que el destino, de acuerdo con la semántica de :func:`newer`.

source: Return true if *target* is out-of-date with respect to any file listed in *sources*. In other words, if *target* exists and is newer than every file in *sources*, return false; otherwise return true. *missing* controls what we do when a source file is missing; the default (``'error'``) is to blow up with an :exc:`OSError` from inside :func:`os.stat`; if it is ``'ignore'``, we silently drop any missing source files; if it is ``'newer'``, any missing source files make us assume that *target* is out-of-date (this is handy in "dry-run" mode: it'll make you pretend to carry out commands that wouldn't work because inputs are missing, but that doesn't matter because you're not actually going to run the commands).
es: Retorna verdadero si *target* no está actualizado con respecto a cualquier archivo listado en *sources*. En otras palabras, si *target* existe y es más reciente que todos los archivos en *sources*, retorna falso; de lo contrario, retorna verdadero. *missing* controla lo que hacemos cuando falta un archivo fuente; el valor predeterminado (``'error'``) explota con un :exc:`OSError` desde :func:`os.stat`; si es ``'ignore'``, eliminamos silenciosamente cualquier archivo fuente faltante; si es ``'newer'``, cualquier archivo fuente que falte nos hace suponer que *target* está desactualizado (esto es útil en el modo de "*dry-run*" (o ejecución en seco): que hará que pretenda ejecutar comandos que no funcionaría porque faltan entradas, pero no importa porque en realidad no va a ejecutar los comandos).

source: :mod:`distutils.dir_util` --- Directory tree operations
es: :mod:`distutils.dir_util` --- Operaciones del árbol de directorios

source: This module provides functions for operating on directories and trees of directories.
es: Este módulo proporciona funciones para operar en directorios y árboles de directorios.

source: Create a directory and any missing ancestor directories. If the directory already exists (or if *name* is the empty string, which means the current directory, which of course exists), then do nothing. Raise :exc:`DistutilsFileError` if unable to create some directory along the way (eg. some sub-path exists, but is a file rather than a directory). If *verbose* is true, print a one-line summary of each mkdir to stdout. Return the list of directories actually created.
es: Crea un directorio y cualquier directorio ancestro que falte. Si el directorio ya existe (o si *name* es el string vacío, significa que el directorio actual, por supuesto existe), no hace nada. Lanza :exc:`DistutilsFileError` si no puede crear algún directorio en el camino (por ejemplo, existe alguna subruta, pero es un archivo en lugar de un directorio). Si *verbose* es verdadero, imprime un resumen de una línea de cada *mkdir* en *stdout*. Retorna la lista de directorios realmente creados.

source: Create all the empty directories under *base_dir* needed to put *files* there. *base_dir* is just the name of a directory which doesn't necessarily exist yet; *files* is a list of filenames to be interpreted relative to *base_dir*. *base_dir* + the directory portion of every file in *files* will be created if it doesn't already exist. *mode*, *verbose* and *dry_run* flags are as for :func:`mkpath`.
es: Crea todos los directorios vacíos en *base_dir* necesarios para colocar *files* allí. *base_dir* es solo el nombre de un directorio que no existe necesariamente todavía; *files* es una lista de nombres de archivos que se interpretarán en relación con *base_dir*. *base_dir* + la parte del directorio de cada archivo en *files* se creará si aún no existe. Los indicadores *mode*, *verbose* y *dry_run* son para funciones como :func:`mkpath`.

source: Copy an entire directory tree *src* to a new location *dst*. Both *src* and *dst* must be directory names. If *src* is not a directory, raise :exc:`DistutilsFileError`. If *dst* does not exist, it is created with :func:`mkpath`. The end result of the copy is that every file in *src* is copied to *dst*, and directories under *src* are recursively copied to *dst*. Return the list of files that were copied or might have been copied, using their output name. The return value is unaffected by *update* or *dry_run*: it is simply the list of all files under *src*, with the names changed to be under *dst*.
es: Copia un árbol de directorio completo *src* en una nueva ubicación *dst*. Tanto *src* como *dst* deben ser nombres de directorio. Si *src* no es un directorio, lanza :exc:`DistutilsFileError`. Si *dst* no existe, se crea con :func:`mkpath`. El resultado final de la copia es que todos los archivos de *src* se copian en *dst*, y los directorios de *src* se copian de forma recursiva en *dst*. Retorna la lista de archivos que se copiaron o que podrían haberse copiado, utilizando su nombre de salida. El valor de retorno no se ve afectado por *update* o *dry_run*: es simplemente la lista de todos los archivos bajo *src *, con los nombres cambiados para estar bajo *dst*.

source: *preserve_mode* and *preserve_times* are the same as for :func:`distutils.file_util.copy_file`; note that they only apply to regular files, not to directories. If *preserve_symlinks* is true, symlinks will be copied as symlinks (on platforms that support them!); otherwise (the default), the destination of the symlink will be copied. *update* and *verbose* are the same as for :func:`copy_file`.
es: *preserve_mode* y *preserve_times* son los mismos que para :func:`distutils.file_util.copy_file`; ten en cuenta que solo se aplican a archivos normales, no a directorios. Si *preserve_symlinks* es verdadero, los enlaces simbólicos se copiarán como enlaces simbólicos (en plataformas que los admitan!); de lo contrario (por defecto), se copiará el destino del enlace simbólico. *update* y *verbose* son los mismos que para :func:`copy_file`.

source: Files in *src* that begin with :file:`.nfs` are skipped (more information on these files is available in answer D2 of the `NFS FAQ page <http://nfs.sourceforge.net/#section_d>`_).
es: Los archivos en *src* que comienzan con :file:`.nfs` se omiten (hay más sobre estos archivos disponible en la respuesta D2 de la página de preguntas frecuentes de`NFS <http://nfs.sourceforge.net/#section_d>`_ ).

source: NFS files are ignored.
es: Se ignoran los archivos NFS.

source: Recursively remove *directory* and all files and directories underneath it. Any errors are ignored (apart from being reported to ``sys.stdout`` if *verbose* is true).
es: Elimina de forma recursiva *directory* y todos los archivos y directorios que se encuentran debajo. Cualquier error se ignora (aparte de ser informado a ``sys.stdout`` si *verbose* es verdadero).

source: :mod:`distutils.file_util` --- Single file operations
es: :mod:`distutils.file_util` --- Operaciones de un solo archivo

source: This module contains some utility functions for operating on individual files.
es: Este módulo contiene algunas funciones de utilidad para operar en archivos individuales.

source: Copy file *src* to *dst*. If *dst* is a directory, then *src* is copied there with the same name; otherwise, it must be a filename. (If the file exists, it will be ruthlessly clobbered.) If *preserve_mode* is true (the default), the file's mode (type and permission bits, or whatever is analogous on the current platform) is copied. If *preserve_times* is true (the default), the last-modified and last-access times are copied as well. If *update* is true, *src* will only be copied if *dst* does not exist, or if *dst* does exist but is older than *src*.
es: Copia el archivo desde *src* a *dst*. Si *dst* es un directorio, entonces *src* se copia allí con el mismo nombre; de lo contrario, debe ser un nombre de archivo. (Si el archivo existe, será atacado). Si *preserve_mode* es verdadero (el valor predeterminado), se copia el modo del archivo (*bits* de tipo y permiso, o lo que sea análogo en la plataforma actual). Si *preserve_times* es verdadero (el valor predeterminado), también se copian las horas de última modificación y de último acceso. Si *update* es verdadero, *src* solo se copiará si *dst* no existe, o si *dst* existe pero es anterior a *src*.
