Repository: python/python-docs-es
Catalog: distutils/builtdist.po
Languages: es_es

source: Creating Built Distributions
es_es: Crear distribuciones compiladas

source: A "built distribution" is what you're probably used to thinking of either as a "binary package" or an "installer" (depending on your background). It's not necessarily binary, though, because it might contain only Python source code and/or byte-code; and we don't call it a package, because that word is already spoken for in Python. (And "installer" is a term specific to the world of mainstream desktop systems.)
es_es: Una "distribución compilada" es lo que probablemente conoce como un "paquete binario" o un "instalador" (dependiendo de sus antecedentes). No es necesariamente binario, sin embargo, porque podría contener sólo código fuente de Python o código de bytes; y no lo llamamos paquete, porque esa palabra ya existe en Python. (E "instalador" es un término específico para el mundo de los sistemas de escritorio convencionales.)

source: A built distribution is how you make life as easy as possible for installers of your module distribution: for users of RPM-based Linux systems, it's a binary RPM; for Windows users, it's an executable installer; for Debian-based Linux users, it's a Debian package; and so forth. Obviously, no one person will be able to create built distributions for every platform under the sun, so the Distutils are designed to enable module developers to concentrate on their specialty---writing code and creating source distributions---while an intermediary species called *packagers* springs up to turn source distributions into built distributions for as many platforms as there are packagers.
es_es: Una distribución compilada es la forma de hacer la vida lo más fácil posible para los instaladores de la distribución de módulos: para los usuarios de sistemas Linux basados en RPM, es un RPM binario; para los usuarios de Windows, es un instalador ejecutable; para los usuarios de Linux basados en Debian, es un paquete Debian; y así sucesivamente. Obviamente, ninguna persona podrá crear distribuciones compiladas para cada plataforma existente, por lo que los Distutils están diseñados para permitir que los desarrolladores de módulos se concentren en su especialidad---escribir código y crear distribuciones de fuentes---mientras una especie intermedia llamada empaquetadores surge para convertir las distribuciones de fuentes en distribuciones compiladas para tantas plataformas como empaquetadores.

source: Of course, the module developer could be their own packager; or the packager could be a volunteer "out there" somewhere who has access to a platform which the original developer does not; or it could be software periodically grabbing new source distributions and turning them into built distributions for as many platforms as the software has access to. Regardless of who they are, a packager uses the setup script and the :command:`bdist` command family to generate built distributions.
es_es: Por supuesto, el desarrollador del módulo podría ser su propio empaquetador; o el empaquetador podría ser un voluntario "por ahí" en algún lugar que tenga acceso a una plataforma a la que el desarrollador original no tiene; o podría ser software que periódicamente obtiene nuevas distribuciones de fuentes y las convierte en distribuciones compiladas para tantas plataformas como el software tenga acceso. Independientemente de quiénes sean, un empaquetador utiliza el script de configuración y la familia de comandos :command:`bdist` para generar distribuciones compiladas.

source: As a simple example, if I run the following command in the Distutils source tree::
es_es: Como un ejemplo sencillo, si ejecuto el siguiente comando en el árbol de código de Distutils::

source: then the Distutils builds my module distribution (the Distutils itself in this case), does a "fake" installation (also in the :file:`build` directory), and creates the default type of built distribution for my platform. The default format for built distributions is a "dumb" tar file on Unix, and a simple executable installer on Windows. (That tar file is considered "dumb" because it has to be unpacked in a specific location to work.)
es_es: a continuación, Distutils crea mi distribución de módulos (el propio Distutils en este caso), realiza una instalación "falsa" (también en el directorio :file:`build`) y crea el tipo predeterminado de distribución compilada para mi plataforma. El formato predeterminado para las distribuciones compiladas es un archivo tar "dumb" en Unix, y un simple instalador ejecutable en Windows. (Ese archivo tar se considera "dumb" porque tiene que ser desempaquetado en una ubicación específica para funcionar.)

source: Thus, the above command on a Unix system creates :file:`Distutils-1.0.{plat}.tar.gz`; unpacking this tarball from the right place installs the Distutils just as though you had downloaded the source distribution and run ``python setup.py install``. (The "right place" is either the root of the filesystem or Python's :file:`{prefix}` directory, depending on the options given to the :command:`bdist_dumb` command; the default is to make dumb distributions relative to :file:`{prefix}`.)
es_es: Por lo tanto, el comando anterior en un sistema Unix crea :file:`Distutils-1.0.{plat}.tar.gz`; desempaquetar este tarball desde el lugar correcto instala el Distutils como si hubiera descargado la distribución de fuentes y ejecutado ``python setup.py install``. (El "lugar correcto" es la raíz del sistema de ficheros o del directorio :file:`{prefix}` de Python, dependiendo de las opciones dadas al comando :command:`bdist_dumb`; por defecto se realizan distribuciones *dumb* relativas a :file:`{prefix}`.)

source: Obviously, for pure Python distributions, this isn't any simpler than just running ``python setup.py install``\ ---but for non-pure distributions, which include extensions that would need to be compiled, it can mean the difference between someone being able to use your extensions or not. And creating "smart" built distributions, such as an RPM package or an executable installer for Windows, is far more convenient for users even if your distribution doesn't include any extensions.
es_es: Obviamente, para distribuciones puras de Python, esto es tan simple como ejecutar ``python setup.py install``\ ---pero para distribuciones no puras, que incluyen extensiones que tendrían que ser compiladas, puede significar la diferencia entre alguien que puede usar sus extensiones o no. Y crear distribuciones compiladas "inteligentes", como un paquete RPM o un instalador ejecutable para Windows, es mucho más conveniente para los usuarios, incluso si su distribución no incluye ninguna extensión.

source: The :command:`bdist` command has a :option:`!--formats` option, similar to the :command:`sdist` command, which you can use to select the types of built distribution to generate: for example, ::
es_es: El comando :command:`bdist` tiene una opción :option:`!--formats` , similar al comando :command:`sdist`, que puede utilizar para seleccionar los tipos de distribución compilada a generar: por ejemplo, ::

source: would, when run on a Unix system, create :file:`Distutils-1.0.{plat}.zip`\ ---again, this archive would be unpacked from the root directory to install the Distutils.
es_es: cuando se ejecuta en un sistema *Unix*, crearía :file:`Distutils-1.0.{plat}.zip`\ ---de nuevo, este archivo sería desempaquetado desde el directorio raíz para instalar *Distutils*.

source: The available formats for built distributions are:
es_es: Los formatos disponibles para distribuciones compiladas son:

source: Format
es_es: Formato

source: Description
es_es: Descripción

source: Notes
es_es: Notas

source: gzipped tar file (:file:`.tar.gz`)
es_es: archivo *gzipped tar* (:file:`.tar.gz`)

source: bzipped tar file (:file:`.tar.bz2`)
es_es: archivo *bzipped tar* (:file:`.tar.bz2`)

source: xzipped tar file (:file:`.tar.xz`)
es_es: archivo *xzipped tar* (:file:`.tar.xz`)

source: compressed tar file (:file:`.tar.Z`)
es_es: archivo *tar* comprimido (:file:`.tar.Z`)

source: tar file (:file:`.tar`)
es_es: archivo *tar* (:file:`.tar`)

source: zip file (:file:`.zip`)
es_es: archivo *zip* (:file:`.zip`)

source: self-extracting ZIP file for Windows
es_es: archivo *ZIP* autoextraíble para Windows

source: Microsoft Installer.
es_es: Instalador Microsoft.

source: Added support for the ``xztar`` format.
es_es: Añadido soporte para el formato ``xztar``.

source: Notes:
es_es: Notas:

source: default on Unix
es_es: predeterminado en *Unix*

source: default on Windows
es_es: predeterminado en Windows

source: requires external :program:`compress` utility.
es_es: requiere utilidad externa :program:`compress` .

source: requires either external :program:`zip` utility or :mod:`zipfile` module (part of the standard Python library since Python 1.6)
es_es: requiere o bien la utilidad externa :program:`zip` o bien el módulo :mod:`zipfile` (parte de la librería estándar de Python desde Python 1.6)

source: requires external :program:`rpm` utility, version 3.0.4 or better (use ``rpm --version`` to find out which version you have)
es_es: requiere la utilidad externa :program:`rpm`, versión 3.0.4 o mejor (usar ``rpm --version`` para descubrir que versión tiene)

source: You don't have to use the :command:`bdist` command with the :option:`!--formats` option; you can also use the command that directly implements the format you're interested in. Some of these :command:`bdist` "sub-commands" actually generate several similar formats; for instance, the :command:`bdist_dumb` command generates all the "dumb" archive formats (``tar``, ``gztar``, ``bztar``, ``xztar``, ``ztar``, and ``zip``), and :command:`bdist_rpm` generates both binary and source RPMs. The :command:`bdist` sub-commands, and the formats generated by each, are:
es_es: No tiene que usar el comando :command:`bdist` con la opción :option:`!--formats`; también puede usar el comando que directamente implementa el formato en el que esté interesado. Algunos de estos :command:`bdist` "sub-commands" de hecho generan varios formatos similares; por ejemplo, el comando :command:`bdist_dumb` genera todos los formatos de archivo "dumb" (``tar``, ``gztar``, ``bztar``, ``xztar``, ``ztar``, y ``zip``), y :command:`bdist_rpm` genera tanto binario como fuentes *RPMs*. Los subcomandos :command:`bdist`, y los formatos generados por cada uno, son:

source: Command
es_es: Comando

source: Formats
es_es: Formatos

source: bdist_wininst is deprecated since Python 3.8.
es_es: *bdist_wininst* se encuentra obsoleto desde Python 3.8.

source: The following sections give details on the individual :command:`bdist_\*` commands.
es_es: Las siguientes secciones proporcionan detalles sobre los comandos individuales de :command:`bdist_\*` .

source: Creating RPM packages
es_es: Creando paquetes *RPM*

source: The RPM format is used by many popular Linux distributions, including Red Hat, SuSE, and Mandrake. If one of these (or any of the other RPM-based Linux distributions) is your usual environment, creating RPM packages for other users of that same distribution is trivial. Depending on the complexity of your module distribution and differences between Linux distributions, you may also be able to create RPMs that work on different RPM-based distributions.
es_es: El formato *RPM* se usa en muchas distribuciones de Linux populares, incluyendo *Red Hat*, *SuSE*, y *Mandrake*. Si alguna de éstas (o cualquier otra distribución de Linux basada en *RPM*) es su entorno habitual, crear paquetes *RPM* para otros usuarios de la misma distribución es trivial. Dependiendo de la complejidad de su módulo de distribución y las diferencias entre distribuciones Linux, también podrá crear *RPMs* que funcionen en distribuciones diferentes basadas en *RPM*.

source: The usual way to create an RPM of your module distribution is to run the :command:`bdist_rpm` command::
es_es: El forma más común de crear un *RPM* de su distribución de módulo es ejecutar el comando :command:`bdist_rpm` ::

source: or the :command:`bdist` command with the :option:`!--format` option::
es_es: o el comando :command:`bdist` con la opción :option:`!--format` ::

source: The former allows you to specify RPM-specific options; the latter allows you to easily specify multiple formats in one run. If you need to do both, you can explicitly specify multiple :command:`bdist_\*` commands and their options::
es_es: El primero permite especificar las opciones específicas de *RPM*; el segundo permite especificar fácilmente varios formatos en una ejecución. Si necesita hacer los dos, se pueden especificar explícitamente múltiples comandos :command:`bdist_\*` y sus opciones::

source: Creating RPM packages is driven by a :file:`.spec` file, much as using the Distutils is driven by the setup script. To make your life easier, the :command:`bdist_rpm` command normally creates a :file:`.spec` file based on the information you supply in the setup script, on the command line, and in any Distutils configuration files. Various options and sections in the :file:`.spec` file are derived from options in the setup script as follows:
es_es: La creación de paquetes *RPM* es impulsada por un archivo :file:`.spec`, al igual que el uso de *Distutils* es impulsado por el script de configuración. Para hacer su vida más fácil, el comando :command:`bdist_rpm` normalmente crea un archivo :file:`.spec` basado en la información que usted proporciona en el script de configuración, en la línea de comandos y en cualquier archivo de configuración de *Distutils*. Varias opciones y secciones en el archivo :file:`.spec` se derivan de las opciones del script de configuración de la siguiente manera:

source: RPM :file:`.spec` file option or section
es_es: Opción de archivo *RPM* :file:`.spec` o sección

source: Distutils setup script option
es_es: Opción del script de instalación de *Distutils*

source: Name
es_es: Nombre

source: Summary (in preamble)
es_es: Resumen (en el preámbulo)

source: Version
es_es: Versión

source: Vendor
es_es: Vendedor

source: ``author`` and ``author_email``, or --- & ``maintainer`` and ``maintainer_email``
es_es: ``author`` y ``author_email``, o --- & ``maintainer`` y ``maintainer_email``

source: %description (section)
es_es: %description (sección)

source: Additionally, there are many options in :file:`.spec` files that don't have corresponding options in the setup script. Most of these are handled through options to the :command:`bdist_rpm` command as follows:
es_es: Adicionalmente, hay muchas opciones en los archivos :file:`.spec` que no se corresponden a opciones en el script de configuración. La mayoría de éstas están manejadas a través de opciones al comando :command:`bdist_rpm` como sigue:

source: :command:`bdist_rpm` option
es_es: Opción :command:`bdist_rpm`

source: default value
es_es: valor predefinido

source: Group
es_es: Grupo

source: "Development/Libraries"
es_es: "Desarrollo/Librerías"

source: (see above)
es_es: (ver arriba)

source: Packager
es_es: Empaquetador

source: (none)
es_es: (ninguno)

source: Provides
es_es: Proporciona

source: Requires
es_es: Requiere

source: Conflicts
es_es: Conflictos

source: Obsoletes
es_es: Obsolescencias

source: Distribution
es_es: Distribución

source: BuildRequires
es_es: Requisitos de compilación

source: Icon
es_es: Icono

source: Obviously, supplying even a few of these options on the command-line would be tedious and error-prone, so it's usually best to put them in the setup configuration file, :file:`setup.cfg`\ ---see section :ref:`setup-config`. If you distribute or package many Python module distributions, you might want to put options that apply to all of them in your personal Distutils configuration file (:file:`~/.pydistutils.cfg`). If you want to temporarily disable this file, you can pass the :option:`!--no-user-cfg` option to :file:`setup.py`.
es_es: Obviamente, proporcionar incluso algunas de estas opciones en la línea de comandos sería tedioso y propenso a errores, por lo que generalmente es mejor ponerlas en el archivo de configuración de instalación,:file:`setup.cfg`\ --- ver sección :ref:`setup-config`. Si distribuye o empaqueta muchas distribuciones de módulos de Python, es posible que desee incluir opciones que se apliquen a todas ellas en su archivo de configuración personal de *Distutils* (:file:`~/.pydistutils.cfg`). Si desea deshabilitar temporalmente este archivo, puede pasar la opción :option:`!--no-user-cfg` a :file:`setup.py`.

source: There are three steps to building a binary RPM package, all of which are handled automatically by the Distutils:
es_es: Hay tres pasos para construir un paquete *RPM* binario, los cuales son manejados automáticamente por *Distutils*:

source: create a :file:`.spec` file, which describes the package (analogous to the Distutils setup script; in fact, much of the information in the setup script winds up in the :file:`.spec` file)
es_es: crear un archivo :file:`.spec`. que describe el paquete (análogo al script de configuración de Distutils; de hecho, gran parte de la información en el script de configuración termina en el fichero :file:`.spec` )

source: create the source RPM
es_es: crear el fuente RPM

source: create the "binary" RPM (which may or may not contain binary code, depending on whether your module distribution contains Python extensions)
es_es: crear el "binario" RPM (que puede o no contener código binario, dependiendo de si la distribución de su módulo contiene extensiones Python)

source: Normally, RPM bundles the last two steps together; when you use the Distutils, all three steps are typically bundled together.
es_es: Normalmente, *RPM* agrupa los dos últimos pasos; cuando usa las *Distutils*, los tres pasos generalmente están agrupados.

source: If you wish, you can separate these three steps. You can use the :option:`!--spec-only` option to make :command:`bdist_rpm` just create the :file:`.spec` file and exit; in this case, the :file:`.spec` file will be written to the "distribution directory"---normally :file:`dist/`, but customizable with the :option:`!--dist-dir` option. (Normally, the :file:`.spec` file winds up deep in the "build tree," in a temporary directory created by :command:`bdist_rpm`.)
es_es: Si lo desea, puede separar estos tres pasos. Puede usar la opción :option:`!--spec-only` para hacer :command:`bdist_rpm` simplemente cree el archivo :file:`.spec` y salga; en este caso, el archivo :file:`.spec` se escribirá en el "directorio de distribución"--- normalmente :file:`dist/`, pero se puede personalizar con la opción :option:`!--dist-dir`. (Normalmente, el archivo :file:`.spec` termina en lo más profundo del "árbol de compilación", en un directorio temporal creado por :command:`bdist_rpm`.)

source: Creating Windows Installers
es_es: Crear instaladores de Windows

source: Executable installers are the natural format for binary distributions on Windows. They display a nice graphical user interface, display some information about the module distribution to be installed taken from the metadata in the setup script, let the user select a few options, and start or cancel the installation.
es_es: Los instaladores ejecutables son el formato natural para distribuciones binarias en Windows. Muestran una agradable interfaz gráfica de usuario, con información sobre la distribución del módulo que se instalará extraída de los metadatos en el script de configuración, permiten al usuario seleccionar algunas opciones e iniciar o cancelar la instalación.

source: Since the metadata is taken from the setup script, creating Windows installers is usually as easy as running::
es_es: Dado que los metadatos se toman del script de configuración, crear instaladores de Windows suele ser tan fácil como ejecutar::

source: or the :command:`bdist` command with the :option:`!--formats` option::
es_es: o el comando :command:`bdist` con la opción :option:`!--formats` ::

source: If you have a pure module distribution (only containing pure Python modules and packages), the resulting installer will be version independent and have a name like :file:`foo-1.0.win32.exe`. Note that creating ``wininst`` binary distributions in only supported on Windows systems.
es_es: Si tiene una distribución de módulo pura (sólo conteniendo módulos de Python puros y paquetes), el instalador resultante será independiente de la versión y tendrá un nombre similar a :file:`foo-1.0.win32.exe`. Tenga en cuenta que crear distribuciones binarias ``wininst`` sólo se soporta en sistemas Windows.

source: If you have a non-pure distribution, the extensions can only be created on a Windows platform, and will be Python version dependent. The installer filename will reflect this and now has the form :file:`foo-1.0.win32-py2.0.exe`. You have to create a separate installer for every Python version you want to support.
es_es: Si tiene distribuciones no puras, las extensiones sólo se pueden crear en una plataforma Windows, y serán dependientes de la versión de Python. El nombre de archivo del instalador reflejará esto y ahora tiene la forma :file:`foo-1.0.win32-py2.0.exe`. Debe crear un instalador separado para cada versión de Python que se quiera soportar.

source: The installer will try to compile pure modules into :term:`bytecode` after installation on the target system in normal and optimizing mode. If you don't want this to happen for some reason, you can run the :command:`bdist_wininst` command with the :option:`!--no-target-compile` and/or the :option:`!--no-target-optimize` option.
es_es: El instalador intentará compilar módulos puros en :term:`bytecode` después de la instalación en el sistema de destino en modo normal y optimizado. Si no desea que esto suceda por alguna razón, puede ejecutar el comando :command:`bdist_wininst` con la opción :option:`!--no-target-compile` o la opción :option:`!--no-target-optimize`.

source: By default the installer will display the cool "Python Powered" logo when it is run, but you can also supply your own 152x261 bitmap which must be a Windows :file:`.bmp` file with the :option:`!--bitmap` option.
es_es: Por defecto, el instalador mostrará el genial logo "Python Powered" cuando se ejecute, pero puede también proporcionar su propio mapa de bits de 152x261 que debe ser un archivo Windows :file:`.bmp` con la opción :option:`!--bitmap`.

source: The installer will also display a large title on the desktop background window when it is run, which is constructed from the name of your distribution and the version number. This can be changed to another text by using the :option:`!--title` option.
es_es: El instalador también mostrará un título grande en la pantalla de fondo del escritorio cuando se ejecute, que se construye a partir del nombre de su distribución y el número de versión. Esto se puede cambiar a otro texto usando la opción :option:`!--title`.

source: The installer file will be written to the "distribution directory" --- normally :file:`dist/`, but customizable with the :option:`!--dist-dir` option.
es_es: El archivo de instalación se escribirá en el "directorio de distribución" --- normalmente :file:`dist/`, pero se puede personalizar con la opción :option:`!--dist-dir`.

source: Cross-compiling on Windows
es_es: Compilación cruzada en Windows

source: Starting with Python 2.6, distutils is capable of cross-compiling between Windows platforms. In practice, this means that with the correct tools installed, you can use a 32bit version of Windows to create 64bit extensions and vice-versa.
es_es: A partir de Python 2.6, distutils es capaz de realizar una compilación cruzada entre plataformas Windows. En la práctica, esto significa que con las herramientas correctas instaladas, puede usar una versión de Windows de 32bit para crear extensiones de 64bit y viceversa.
