Repository: python/python-docs-es
Catalog: distutils/builtdist.po
Languages: es_es

source: To build for an alternate platform, specify the :option:`!--plat-name` option to the build command. Valid values are currently 'win32', and 'win-amd64'. For example, on a 32bit version of Windows, you could execute::
es_es: Para compilar para una plataforma alternativa, especifique la opción :option:`!--plat-name` del comando de compilación. Los valores válidos son actualmente 'win32', y 'win-amd64'. Por ejemplo, en una versión de Windows de 32bit, puede ejecutar::

source: to build a 64bit version of your extension. The Windows Installers also support this option, so the command::
es_es: para crear una versión de 64bit de su extensión. Los instaladores de Windows también admiten esta opción, por lo que el comando::

source: would create a 64bit installation executable on your 32bit version of Windows.
es_es: crearía un ejecutable de instalación de 64bit en su versión de 32bit de Windows.

source: To cross-compile, you must download the Python source code and cross-compile Python itself for the platform you are targeting - it is not possible from a binary installation of Python (as the .lib etc file for other platforms are not included.) In practice, this means the user of a 32 bit operating system will need to use Visual Studio 2008 to open the :file:`PCbuild/PCbuild.sln` solution in the Python source tree and build the "x64" configuration of the 'pythoncore' project before cross-compiling extensions is possible.
es_es: Para realizar una compilación cruzada, debe descargar el código fuente de Python y compilar el propio Python para la plataforma a la que se dirige; no es posible desde una instalación binaria de Python (ya que el archivo *.lib* etc para otras plataformas no está incluido). En la práctica, esto significa que el usuario de un sistema operativo de 32bit necesitará usar Visual Studio 2008 para abrir la solución :file:`PCbuild/PCbuild.sln` en el árbol de código de Python y construir la configuración " x64 " del proyecto 'pythoncore' antes de que sea posible la compilación cruzada de extensiones.

source: Note that by default, Visual Studio 2008 does not install 64bit compilers or tools. You may need to reexecute the Visual Studio setup process and select these tools (using Control Panel->[Add/Remove] Programs is a convenient way to check or modify your existing install.)
es_es: Tenga en cuenta que, de forma predeterminada, Visual Studio 2008 no instala compiladores o herramientas de 64bit. Es posible que deba volver a ejecutar el proceso de instalación de Visual Studio y seleccionar estas herramientas (usar Panel de control -> [Agregar/Quitar] Programas es una forma conveniente de verificar o modificar su instalación existente).

source: The Postinstallation script
es_es: El script posterior a la instalación

source: Starting with Python 2.3, a postinstallation script can be specified with the :option:`!--install-script` option. The basename of the script must be specified, and the script filename must also be listed in the scripts argument to the setup function.
es_es: A partir de Python 2.3, se puede especificar un script posterior a la instalación con la opción :option:`!--install-script` . Se debe especificar el nombre base del script y el nombre del archivo del *script* también se debe incluir en el argumento de los scripts de la función de configuración.

source: This script will be run at installation time on the target system after all the files have been copied, with ``argv[1]`` set to :option:`!-install`, and again at uninstallation time before the files are removed with ``argv[1]`` set to :option:`!-remove`.
es_es: Este script se ejecutará en el momento de la instalación en el sistema de destino después de que se hayan copiado todos los archivos, con ``argv[1]`` establecido en :option:`!-install`, y nuevamente en el momento de la desinstalación antes de que se eliminen los archivos con ``argv[1]`` establecido en :option:`!-remove`.

source: The installation script runs embedded in the windows installer, every output (``sys.stdout``, ``sys.stderr``) is redirected into a buffer and will be displayed in the GUI after the script has finished.
es_es: El script de instalación se ejecuta incrustado en el instalador de Windows, cada salida (``sys.stdout``, ``sys.stderr``) se redirige a un búfer y se mostrará en la GUI una vez finalizado el *script*.

source: Some functions especially useful in this context are available as additional built-in functions in the installation script.
es_es: Algunas funciones especialmente útiles en este contexto están disponibles como funciones integradas adicionales en el script de instalación.

source: These functions should be called when a directory or file is created by the postinstall script at installation time. It will register *path* with the uninstaller, so that it will be removed when the distribution is uninstalled. To be safe, directories are only removed if they are empty.
es_es: Estas funciones deben llamarse cuando el script posterior a la instalación crea un directorio o archivo en el momento de la instalación. Registrará *path* con el des-instalador, de modo que se eliminará cuando se desinstale la distribución. Para mayor seguridad, los directorios solo se eliminan si están vacíos.

source: This function can be used to retrieve special folder locations on Windows like the Start Menu or the Desktop. It returns the full path to the folder. *csidl_string* must be one of the following strings::
es_es: Esta función se puede utilizar para recuperar ubicaciones de directorios especiales en Windows como el menú Inicio o el escritorio. Retorna la ruta completa al directorio. *csidl_string* debe ser una de las siguientes cadenas::

source: If the folder cannot be retrieved, :exc:`OSError` is raised.
es_es: Si no se puede recuperar el directorio, se lanza :exc:`OSError`.

source: Which folders are available depends on the exact Windows version, and probably also the configuration. For details refer to Microsoft's documentation of the :c:func:`SHGetSpecialFolderPath` function.
es_es: Los directorios disponibles dependen de la versión exacta de Windows y probablemente también de la configuración. Para obtener más información, consulte la documentación de Microsoft de la función :c:func:`SHGetSpecialFolderPath` .

source: This function creates a shortcut. *target* is the path to the program to be started by the shortcut. *description* is the description of the shortcut. *filename* is the title of the shortcut that the user will see. *arguments* specifies the command line arguments, if any. *workdir* is the working directory for the program. *iconpath* is the file containing the icon for the shortcut, and *iconindex* is the index of the icon in the file *iconpath*. Again, for details consult the Microsoft documentation for the :class:`IShellLink` interface.
es_es: Esta función crea un atajo. *target* es la ruta al programa que se iniciará con el acceso directo. *description* es la descripción del atajo. *filename* es el título del acceso directo que verá el usuario. *arguments* especifica los argumentos de la línea de comandos, si los hay. *workdir* es el directorio de trabajo del programa. *iconpath* es el archivo que contiene el icono del acceso directo, y *iconindex* es el índice del icono en el archivo *iconpath*. Nuevamente, para obtener más detalles, consulte la documentación de Microsoft para la interfaz :class:`IShellLink`.

source: Starting with Python 2.6, bdist_wininst supports a :option:`!--user-access-control` option. The default is 'none' (meaning no UAC handling is done), and other valid values are 'auto' (meaning prompt for UAC elevation if Python was installed for all users) and 'force' (meaning always prompt for elevation).
es_es: A partir de Python 2.6, *bdist_wininst* admite una opción :option:`!--user-access-control`. El valor predeterminado es 'none' (lo que significa que no se realiza ningún gestión de UAC), y otros valores válidos son 'auto' (lo que significa que se solicita la elevación de UAC si Python se instaló para todos los usuarios) y 'force' (que significa que siempre se solicita la elevación).
