Repository: python/python-docs-es
Catalog: distutils/commandref.po
Languages: es

source: Command Reference
es: Referencia de Instrucciones

source: Installing modules: the :command:`install` command family
es: Instalando módulos: la familia de comandos :command:`install`

source: The install command ensures that the build commands have been run and then runs the subcommands :command:`install_lib`, :command:`install_data` and :command:`install_scripts`.
es: Los comandos de instalación aseguran que los comandos de construcción se han ejecutado y también se han ejecutado los subcomandos :command:`install_lib`, :command:`install_data` y :command:`install_scripts`.

source: This command installs all data files provided with the distribution.
es: Este comando instala todos los archivos de datos proporcionados con la distribución.

source: This command installs all (Python) scripts in the distribution.
es: Este comando instala todos los scripts (Python) en la distribución.

source: Creating a source distribution: the :command:`sdist` command
es: Creando una distribución de origen: el comando :command:`sdist`

source: The manifest template commands are:
es: Los comandos de la plantilla manifest son:

source: Command
es: Comando

source: Description
es: Descripción

source: include all files matching any of the listed patterns
es: incluye todos los archivos que coincidan con cualquiera de los patrones enumerados

source: exclude all files matching any of the listed patterns
es: excluye todos los archivos que coincidan con cualquiera de los patrones enumerados

source: include all files under *dir* matching any of the listed patterns
es: incluye todos los archivos *dir* que coincidan con cualquiera de los patrones enumerados

source: exclude all files under *dir* matching any of the listed patterns
es: excluye todos los archivos *dir* que coincidan con cualquiera de los patrones enumerados

source: include all files anywhere in the source tree matching --- & any of the listed patterns
es: incluye todos los archivos de cualquier lugar en el árbol fuente que coincidan --- y cualquiera de los patrones enumerados

source: exclude all files anywhere in the source tree matching --- & any of the listed patterns
es: excluye todos los archivos de cualquier lugar en el árbol fuente que coincidan --- y cualquiera de los patrones enumerados

source: exclude all files under *dir*
es: excluye todos los archivos *dir*

source: include all files under *dir*
es: incluye todos los archivos *dir*

source: The patterns here are Unix-style "glob" patterns: ``*`` matches any sequence of regular filename characters, ``?`` matches any single regular filename character, and ``[range]`` matches any of the characters in *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). The definition of "regular filename character" is platform-specific: on Unix it is anything except slash; on Windows anything except backslash or colon.
es: Los patrones aquí son patrones "glob" de estilo Unix: ``*`` coincide con cualquier secuencia de caracteres de nombre de archivo habitual, ``?`` coincide con cualquier caracter de nombre de archivo habitual, y ``[range]`` coincide con cualquiera de los caracteres en *range* (p. ej., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). La definición de "caracter de nombre de archivo habitual" es específica de la plataforma: en Unix es cualquier cosa excepto barra; en Windows cualquier cosa excepto barra invertida o dos puntos.
