Repository: python/python-docs-es
Catalog: distutils/examples.po
Languages: es

source: Distutils Examples
es: Ejemplos de Distutils

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
es: Este documento se conserva únicamente hasta que la documentación de ``setuptools`` en https://setuptools.readthedocs.io/en/latest/setuptools.html cubra de forma independiente toda la información relevante actualmente aquí incluida.

source: This chapter provides a number of basic examples to help get started with distutils. Additional information about using distutils can be found in the Distutils Cookbook.
es: Este capitulo provee varios ejemplos básicos para ayudar a comenzar con distutils. Información adicional sobre el uso de distutils puede ser encontrado en el Distutils Cookbook.

source: Collection of recipes showing how to achieve more control over distutils.
es: Colección de recetas que muestran como lograr mayor control sobre distutils.

source: Pure Python distribution (by module)
es: Distribución de Python pura (por módulo)

source: If you're just distributing a couple of modules, especially if they don't live in a particular package, you can specify them individually using the ``py_modules`` option in the setup script.
es: Si solo distribuyes un par de módulos, especialmente si no viven en un paquete en particular, puedes especificarlos individualmente usando la opción ``py_modules`` en el script de instalación.

source: In the simplest case, you'll have two files to worry about: a setup script and the single module you're distributing, :file:`foo.py` in this example::
es: En el caso más simple, tendrás dos archivos de los cuales preocuparte: un script de instalación y el único modulo que estás distribuyendo, en este ejemplo :file:`foo.py`::

source: (In all diagrams in this section, *<root>* will refer to the distribution root directory.) A minimal setup script to describe this situation would be::
es: (En todos los diagramas en esta sección, *<root>* se referirá al directorio raíz de la distribución.) Un script de instalación mínimo para describir esta situación seria::

source: Note that the name of the distribution is specified independently with the ``name`` option, and there's no rule that says it has to be the same as the name of the sole module in the distribution (although that's probably a good convention to follow). However, the distribution name is used to generate filenames, so you should stick to letters, digits, underscores, and hyphens.
es: Observe que el nombre de la distribución esta especificada de forma independiente con la opción ``name``, y no hay ninguna regla que diga que tiene que ser el mismo que el nombre del único modulo de la distribución (aunque probablemente sea una buena convención a seguir). Sin embargo, el nombre de la distribución es usado para generar nombres de archivo, así que deberías limitarte a letras, dígitos, guion bajo, y guiones.

source: Since ``py_modules`` is a list, you can of course specify multiple modules, eg. if you're distributing modules :mod:`foo` and :mod:`bar`, your setup might look like this::
es: Dado que ``py_modules`` es una lista, puedes por supuesto especificar múltiples módulos, por ejemplo, si estás distribuyendo los módulos :mod:`foo` y :mod:`bar`, tu configuración podría verse así::

source: and the setup script might be ::
es: y el script de instalación podría ser::

source: You can put module source files into another directory, but if you have enough modules to do that, it's probably easier to specify modules by package rather than listing them individually.
es: Puedes poner los archivos fuente de los módulos en otro directorio, pero si tienes suficientes módulos para hacerlo, probablemente sea mas fácil especificar los módulos por paquete en lugar de enumerarlos individualmente.

source: Pure Python distribution (by package)
es: Distribución de Python pura (por paquete)

source: If you have more than a couple of modules to distribute, especially if they are in multiple packages, it's probably easier to specify whole packages rather than individual modules. This works even if your modules are not in a package; you can just tell the Distutils to process modules from the root package, and that works the same as any other package (except that you don't have to have an :file:`__init__.py` file).
es: Si tienes más de un par de módulos para distribuir, especialmente si están en múltiples paquetes, probablemente sea más fácil especificar paquetes completos en lugar de módulos individuales. Esto funciona incluso si sus módulos no están en un paquete; solo puedes decirle a los Distutils que procese los módulos desde el paquete raíz, y eso funciona igual que cualquier otro paquete (excepto que no tiene que tener un archivo :file:`__init__.py`.

source: The setup script from the last example could also be written as ::
es: El script de instalación del último ejemplo también podría ser escrito como::

source: (The empty string stands for the root package.)
es: (La cadena de caracteres vacía representa el paquete raíz.)

source: If those two files are moved into a subdirectory, but remain in the root package, e.g.::
es: Si esos dos archivos son movidos a un subdirectorio, pero permanecen en el paquete raíz, por ejemplo::

source: then you would still specify the root package, but you have to tell the Distutils where source files in the root package live::
es: entonces seguirías especificando el paquete raíz, pero tienes que decirle a los Distutils dónde viven los archivos fuente del paquete raíz::

source: More typically, though, you will want to distribute multiple modules in the same package (or in sub-packages). For example, if the :mod:`foo` and :mod:`bar` modules belong in package :mod:`foobar`, one way to layout your source tree is ::
es: No obstante, lo mas típico es que quieras distribuir múltiples módulos en el mismo paquete (o en subpaquetes). Por ejemplo, si los módulos :mod:`foo` y :mod:`bar` pertenecen al paquete :mod:`foobar`, una forma de diseñar su estructura fuente es::

source: This is in fact the default layout expected by the Distutils, and the one that requires the least work to describe in your setup script::
es: Este es, de hecho, la distribución por defecto esperada por los Distutils, y la que requiere menos trabajo para describir en su script de instalación::

source: If you want to put modules in directories not named for their package, then you need to use the ``package_dir`` option again. For example, if the :file:`src` directory holds modules in the :mod:`foobar` package::
es: Si quieres poner módulos en directorios no nombrados por su paquete, entonces necesitas usar la opción ``package_dir`` otra vez. Por ejemplo, si el directorio :file:`src` contiene los módulos en el paquete :mod:`foobar`::

source: an appropriate setup script would be ::
es: un script de instalación apropiado sería::

source: Or, you might put modules from your main package right in the distribution root::
es: O, podrías poner módulos de tu paquete principal justo en la raíz de la distribución::

source: in which case your setup script would be ::
es: en cuyo caso tu script de instalación sería::

source: (The empty string also stands for the current directory.)
es: (La cadena de caracteres vacía también representa el directorio actual.)

source: If you have sub-packages, they must be explicitly listed in ``packages``, but any entries in ``package_dir`` automatically extend to sub-packages. (In other words, the Distutils does *not* scan your source tree, trying to figure out which directories correspond to Python packages by looking for :file:`__init__.py` files.) Thus, if the default layout grows a sub-package::
es: Si tienes subpaquetes, deben ser listados explícitamente en ``packages``, pero cualquier entrada en ``package_dir`` se extiende automáticamente a los subpaquetes. (En otras palabras, los Distutils *no* escanean tu estructura fuente, intentando descubrir que directorios corresponden a los paquetes de Python buscando por archivos :file:`__init__.py`.) Por lo tanto, si la distribución por defecto hace crece un subpaquete::

source: then the corresponding setup script would be ::
es: entonces el script de instalación correspondiente sería::

source: Single extension module
es: Módulo de extensión única

source: Extension modules are specified using the ``ext_modules`` option. ``package_dir`` has no effect on where extension source files are found; it only affects the source for pure Python modules. The simplest case, a single extension module in a single C source file, is::
es: Los módulos de extensión son especificados usando la opción ``ext_modules``. ``package_dir`` no tiene efecto sobre donde se encuentren los archivos fuente de la extensión; solo afecta a la fuente de los módulos de Python puro. El mas simple caso, un único modulo de extensión en un único archivo fuente de C, es::

source: If the :mod:`foo` extension belongs in the root package, the setup script for this could be ::
es: Si la extensión :mod:`foo` pertenece al paquete raíz, el script de instalación para este podría ser::

source: If the extension actually belongs in a package, say :mod:`foopkg`, then
es: Si la extensión realmente pertenece a un paquete, digamos :mod:`foopkg`, entonces

source: With exactly the same source tree layout, this extension can be put in the :mod:`foopkg` package simply by changing the name of the extension::
es: Con exactamente la misma distribución del árbol fuente, esta extensión puede ser puesta en el paquete :mod:`foopkg` simplemente cambiando el nombre de la extensión::

source: Checking a package
es: Verificando un paquete

source: The ``check`` command allows you to verify if your package meta-data meet the minimum requirements to build a distribution.
es: El comando ``check`` le permite verificar si los metadatos de su paquete cumplen los requisitos mínimos para construir la distribución.

source: To run it, just call it using your :file:`setup.py` script. If something is missing, ``check`` will display a warning.
es: Para ejecutarlo, sólo tienes que llamarlo usando tu script :file:`setup.py`. Si falta algo, ``check`` mostrará una advertencia.

source: Let's take an example with a simple script::
es: Tomemos un ejemplo con un script simple::

source: Running the ``check`` command will display some warnings:
es: La ejecución del comando ``check`` mostrará algunas advertencias:

source: If you use the reStructuredText syntax in the ``long_description`` field and `docutils`_ is installed you can check if the syntax is fine with the ``check`` command, using the ``restructuredtext`` option.
es: Si usas la sintaxis ``reStructuredText`` en el campo ``long_description`` y `docutils`_ esta instalado puedes comprobar si la sintaxis está bien con el comando ``check``, usando la opción ``restructuredtext``.

source: For example, if the :file:`setup.py` script is changed like this::
es: Por ejemplo, si el script :file:`setup.py` es cambiado así::

source: Where the long description is broken, ``check`` will be able to detect it by using the :mod:`docutils` parser:
es: Donde se rompa la descripción larga, ``check`` será capaz de detectarla usando el analizador :mod:`docutils`:

source: Reading the metadata
es: Leyendo los metadatos

source: The :func:`distutils.core.setup` function provides a command-line interface that allows you to query the metadata fields of a project through the ``setup.py`` script of a given project:
es: La función :func:`distutils.core.setup` provee una interfaz de línea de comandos que te permite consultar los campos de metadatos de un proyecto a través del script ``setup.py`` de un proyecto dado:

source: This call reads the ``name`` metadata by running the :func:`distutils.core.setup` function. Although, when a source or binary distribution is created with Distutils, the metadata fields are written in a static file called :file:`PKG-INFO`. When a Distutils-based project is installed in Python, the :file:`PKG-INFO` file is copied alongside the modules and packages of the distribution under :file:`NAME-VERSION-pyX.X.egg-info`, where ``NAME`` is the name of the project, ``VERSION`` its version as defined in the Metadata, and ``pyX.X`` the major and minor version of Python like ``2.7`` or ``3.2``.
es: Esta llamada lee los metadatos de ``name`` ejecutando la función :func:`distutils.core.setup`. Aunque, cuando se crea una distribución fuente o binaria con Distutils, los campos de metadatos son escritos en un archivo estático llamado :file:`PKG-INFO`. Cuando un proyecto basado en Distutils es instalado en Python, el archivo :file:`PKG-INFO` es copiado junto con los módulos y paquetes de la distribución en :file:`NAME-VERSION-pyX.X.egg-info`, donde ``NAME`` es el nombre del proyecto, ``VERSION`` su versión como se define en los metadatos, y ``pyX.X` la versión mayor y menor de Python como ``2.7`` o ``3.2``.

source: You can read back this static file, by using the :class:`distutils.dist.DistributionMetadata` class and its :func:`read_pkg_file` method::
es: Puedes leer de nuevo este archivo estático usando la clase :class:`distutils.dist.DistributionMetadata` y su método :func:`read_pkg_file`::

source: Notice that the class can also be instantiated with a metadata file path to loads its values::
es: Note que la clase también puede ser instanciada con una ruta de archivo de metadatos para cargar sus valores::
