Repository: python/python-docs-es
Catalog: distutils/extending.po
Languages: es_ar

source: Extending Distutils
es_ar: Extendiendo Distutils

source: Distutils can be extended in various ways. Most extensions take the form of new commands or replacements for existing commands. New commands may be written to support new types of platform-specific packaging, for example, while replacements for existing commands may be made to modify details of how the command operates on a package.
es_ar: Distutils se puede extender de diversas maneras. La mayoría de las extensiones toman la forma de nuevos comandos o reemplazos de comandos ya existentes. Se pueden escribir nuevos comandos para soportar nuevos tipos de paquetes específicos de la plataforma, por ejemplo, mientras que se pueden reemplazar comandos existentes para modificar los detalles de cómo funciona dicho comando en un paquete.

source: Most extensions of the distutils are made within :file:`setup.py` scripts that want to modify existing commands; many simply add a few file extensions that should be copied into packages in addition to :file:`.py` files as a convenience.
es_ar: La mayoría de las extensiones de distutils están hechas dentro de los scripts :file:`setup.py` donde se desea modificar los comandos existentes. Muchos simplemente añaden algunas extensiones de archivo que deben copiarse dentro de los paquetes, además de los archivos :file:`.py`, para mayor comodidad.

source: Most distutils command implementations are subclasses of the :class:`distutils.cmd.Command` class. New commands may directly inherit from :class:`Command`, while replacements often derive from :class:`Command` indirectly, directly subclassing the command they are replacing. Commands are required to derive from :class:`Command`.
es_ar: La mayoría de las implementaciones de comandos distutils son subclases de la clase :class:`distutils.cmd.Command`. Los nuevos comandos pueden heredar directamente de :class:`Command`. Mientras que los comandos de reemplazo a menudo derivan de la clase :class:`Command` de manera indirecta, subclasificando directamente el comando que están reemplazando. Se requiere que los comandos deriven de :class:`Command`.

source: Integrating new commands
es_ar: Integrando nuevos comandos

source: There are different ways to integrate new command implementations into distutils. The most difficult is to lobby for the inclusion of the new features in distutils itself, and wait for (and require) a version of Python that provides that support. This is really hard for many reasons.
es_ar: Existen diferentes formas de integrar nuevas implementaciones de comandos en distutils. La más difícil es forzar la inclusión de nuevas funciones en distutils y esperar (y requerir) una versión de Python que brinde ese soporte. Esto es realmente complicado por muchas razones.

source: The most common, and possibly the most reasonable for most needs, is to include the new implementations with your :file:`setup.py` script, and cause the :func:`distutils.core.setup` function use them::
es_ar: La más común, y posiblemente la más lógica para casi todas las necesidades, es incluir las nuevas implementaciones con su *script* :file:`setup.py` y hacer que la función :func:`distutils.core.setup` las utilice::

source: This approach is most valuable if the new implementations must be used to use a particular package, as everyone interested in the package will need to have the new command implementation.
es_ar: Este enfoque es más valioso sí las nuevas implementaciones deben utilizarse para hacer uso de un paquete en particular, ya que todos los interesados en el paquete deberán tener la implementación del nuevo comando.

source: Beginning with Python 2.4, a third option is available, intended to allow new commands to be added which can support existing :file:`setup.py` scripts without requiring modifications to the Python installation. This is expected to allow third-party extensions to provide support for additional packaging systems, but the commands can be used for anything distutils commands can be used for. A new configuration option, ``command_packages`` (command-line option :option:`!--command-packages`), can be used to specify additional packages to be searched for modules implementing commands. Like all distutils options, this can be specified on the command line or in a configuration file. This option can only be set in the ``[global]`` section of a configuration file, or before any commands on the command line. If set in a configuration file, it can be overridden from the command line; setting it to an empty string on the command line causes the default to be used. This should never be set in a configuration file provided with a package.
es_ar: A partir de Python 2.4, hay una tercera opción disponible, destinada a permitir agregar nuevos comandos que sean compatibles con los scripts :file:`setup.py` existentes, sin requerir modificaciones en la instalación de Python. Se espera que esto permita que las extensiones de terceros brinden soporte para sistemas de empaquetado adicionales, pero los comandos pueden ser usados en los mismos casos en los que los comandos de distutils son utilizados. Una nueva opción de configuración, ``command_packages`` (opción de la línea de comandos :option:`!--command-packages`), puede ser aplicada para especificar paquetes adicionales a ser buscados para módulos que implementen comandos. Como todas las opciones de distutuils, esto puede especificarse en la línea de comandos o en un archivo de configuración. Esta opción sólo se puede configurar en la sección ``[global]`` de un archivo de configuración, o antes de cualquier comando en la línea de comandos. Si se establece en un archivo de configuración, se puede sobrescribir desde la línea de comandos. Establecer una cadena de caracteres vacía como valor de esta opción en la línea de comandos forzará el uso del valor predeterminado. Esto nunca debería ser establecido en un archivo de configuración proporcionado con un paquete.

source: This new option can be used to add any number of packages to the list of packages searched for command implementations; multiple package names should be separated by commas. When not specified, the search is only performed in the :mod:`distutils.command` package. When :file:`setup.py` is run with the option ``--command-packages distcmds,buildcmds``, however, the packages :mod:`distutils.command`, :mod:`distcmds`, and :mod:`buildcmds` will be searched in that order. New commands are expected to be implemented in modules of the same name as the command by classes sharing the same name. Given the example command line option above, the command :command:`bdist_openpkg` could be implemented by the class :class:`distcmds.bdist_openpkg.bdist_openpkg` or :class:`buildcmds.bdist_openpkg.bdist_openpkg`.
es_ar: Esta nueva opción puede ser usada para añadir cualquier cantidad de número de paquetes a la lista de paquetes buscados para las implementaciones de comandos; los nombres múltiples de paquetes deben ser separados por comas. Cuando no se especifica, la búsqueda sólo se realiza en el paquete :mod:`distutils.command`. Sin embargo, cuando :file:`setup.py` se ejecuta con la opción ``--command-packages distcmds,buildcmds``, se buscarán los paquetes :mod:`distutils.command`, :mod:`distcmds` y :mod:`buildcmds` en ese orden. Se espera que los nuevos comandos se implementen en módulos con idéntico nombre que el comando mediante clases que comparten el mismo nombre. Dado el ejemplo anterior de la opción de línea de comandos, el comando :command:`bdist_openpkg` podría ser implementado por la clase :class:`distcmds.bdist_openpkg.bdist_openpkg` o por la clase :class:`buildcmds.bdist_openpkg.bdist_openpkg`.

source: Adding new distribution types
es_ar: Añadiendo nuevos tipos de distribución

source: Commands that create distributions (files in the :file:`dist/` directory) need to add ``(command, filename)`` pairs to ``self.distribution.dist_files`` so that :command:`upload` can upload it to PyPI. The *filename* in the pair contains no path information, only the name of the file itself. In dry-run mode, pairs should still be added to represent what would have been created.
es_ar: Los comandos que crean distribuciones (archivos en el directorio :file:`dist/`) necesitan añadir el par ``(command, filename)`` a ``self.distribution.dist_files`` para que de este modo :command:`upload` pueda subirlo a PyPI. El elemento *filename* en el par no contiene información de la ruta, solo el nombre del archive en sí. En el modo ensayo, los pares aún deben ser añadidos para representar lo que se habría creado.
