Repository: python/python-docs-es
Catalog: distutils/introduction.po
Languages: es

source: An Introduction to Distutils
es: Una introducción a Distutils

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
es: Este documento se conservará hasta que la documentación de ``setuptools`` en https://setuptools.readthedocs.io/en/latest/setuptools.html cubra de forma independiente toda la información relevante incluida aquí.

source: This document covers using the Distutils to distribute your Python modules, concentrating on the role of developer/distributor: if you're looking for information on installing Python modules, you should refer to the :ref:`install-index` chapter.
es: Este documento cubre el uso de Distutils para distribuir módulos de Python, concentrándose en el rol de desarrollador/distribuidor: si está buscando información de como instalar módulos Python, debe consultar el capítulo :ref:`install-index`.

source: Concepts & Terminology
es: Conceptos y Terminología

source: Using the Distutils is quite simple, both for module developers and for users/administrators installing third-party modules. As a developer, your responsibilities (apart from writing solid, well-documented and well-tested code, of course!) are:
es: Usar Distutils es muy simple, tanto para desarrolladores de módulos como para usuarios/administradores que instalan módulos de terceros. Como desarrollador, sus responsabilidades (¡además de escribir código sólido, bien documentado y probado, por supuesto!) son:

source: write a setup script (:file:`setup.py` by convention)
es: escribir un *script* de configuración (:file:`setup.py` por convención)

source: (optional) write a setup configuration file
es: (opcional) escribir un archivo de configuración

source: create a source distribution
es: crear una distribución fuente

source: Each of these tasks is covered in this document.
es: Cada una de estas tareas está cubierta en este documento.

source: Not all module developers have access to a multitude of platforms, so it's not always feasible to expect them to create a multitude of built distributions. It is hoped that a class of intermediaries, called *packagers*, will arise to address this need. Packagers will take source distributions released by module developers, build them on one or more platforms, and release the resulting built distributions. Thus, users on the most popular platforms will be able to install most popular Python module distributions in the most natural way for their platform, without having to run a single setup script or compile a line of code.
es: No todos los desarrolladores de módulos tienen acceso a una multitud de plataformas, por lo que no siempre es factible esperar que creen una multitud de distribuciones. Es de esperar que surjan intermediarios, llamados *empaquetadores*, para ayudar con esta necesidad. Los *empaquetadores* tomarán distribuciones de origen lanzadas por desarrolladores de módulo, las compilaran en una o más plataformas, y lanzaran las distribuciones resultantes. Así, los usuarios en las plataformas más populares podrán instalar las distribuciones de módulos Python más populares de la manera más natural para su plataforma, sin tener que ejecutar un solo *script* de configuración o compilar una línea de código.

source: A Simple Example
es: Un ejemplo simple

source: The setup script is usually quite simple, although since it's written in Python, there are no arbitrary limits to what you can do with it, though you should be careful about putting arbitrarily expensive operations in your setup script. Unlike, say, Autoconf-style configure scripts, the setup script may be run multiple times in the course of building and installing your module distribution.
es: El *script* de configuración suele ser simple, dado que está escrito en Python, no hay límite para lo que puede hacerse con él, aunque debe tener cuidado al poner operaciones arbitrariamente costosas en el *script* de configuración. A diferencia de, por ejemplo, las secuencias de comandos de configuración de estilo *Autoconf*, la secuencia de comandos de configuración se puede ejecutar varias veces en el transcurso de la construcción e instalación de la distribución de su módulo.

source: If all you want to do is distribute a module called :mod:`foo`, contained in a file :file:`foo.py`, then your setup script can be as simple as this::
es: Si todo lo que quiere hacer es distribuir un módulo llamado :mod:`foo`, contenido en un archivo :file:`foo.py`, entonces el *script* de configuración puede ser tan simple como esto::

source: Some observations:
es: Algunas observaciones:

source: most information that you supply to the Distutils is supplied as keyword arguments to the :func:`setup` function
es: la mayoría de la información que proporcione a Distutils se proporciona como argumentos *keyword* a la función :func:`setup`

source: those keyword arguments fall into two categories: package metadata (name, version number) and information about what's in the package (a list of pure Python modules, in this case)
es: esos argumentos *keyword* se dividen en dos categorías: metadatos del paquete (nombre, número de versión) e información sobre el contenido del paquete (una lista de módulos Python, en este caso)

source: modules are specified by module name, not filename (the same will hold true for packages and extensions)
es: módulos son especificados por nombre de módulo, no por nombre de archivo (lo mismo aplica para paquetes y extensiones)

source: it's recommended that you supply a little more metadata, in particular your name, email address and a URL for the project (see section :ref:`setup-script` for an example)
es: se recomienda que proporcione un poco más de metadatos, en particular nombre, dirección de correo electrónico y *URL* para el proyecto (consulte la sección :ref:`setup-script` para ver un ejemplo)

source: To create a source distribution for this module, you would create a setup script, :file:`setup.py`, containing the above code, and run this command from a terminal::
es: Para crear una distribución fuente para este módulo, debe crear un *script* de configuración, :file:`setup.py`, que contenga el código de arriba, y ejecute este comando en la terminal::

source: For Windows, open a command prompt window (:menuselection:`Start --> Accessories`) and change the command to::
es: En *Windows*, abra una ventana de símbolo de sistema (:menuselection:`Inicio —> Accesorios`) y cambie el comando a::

source: :command:`sdist` will create an archive file (e.g., tarball on Unix, ZIP file on Windows) containing your setup script :file:`setup.py`, and your module :file:`foo.py`. The archive file will be named :file:`foo-1.0.tar.gz` (or :file:`.zip`), and will unpack into a directory :file:`foo-1.0`.
es: :command:`sdist` creará un archivo de almacenamiento (por ejemplo, tarball en Unix, archivo ZIP en Windows) que contiene su *script* de configuración :file:`setup.py`, y su módulo :file:`foo.py`. El archivo de almacenamiento se llamará :file:`foo-1.0.tar.gz` (o :file:`.zip`), y se descomprimirá en un directorio :file:`foo-1.0`.

source: If an end-user wishes to install your :mod:`foo` module, all they have to do is download :file:`foo-1.0.tar.gz` (or :file:`.zip`), unpack it, and---from the :file:`foo-1.0` directory---run ::
es: Si un usuario final desea instalar su módulo :mod:`foo`, lo que tiene que hacer es descargar :file:`foo-1.0.tar.gz` (o :file:`.zip`), descomprimirlo, y---del directorio :file:`foo-1.0`---ejecutar ::

source: which will ultimately copy :file:`foo.py` to the appropriate directory for third-party modules in their Python installation.
es: que finalmente copiará :file:`foo.py` en el directorio apropiado para módulos de terceros en su instalación de Python.

source: This simple example demonstrates some fundamental concepts of the Distutils. First, both developers and installers have the same basic user interface, i.e. the setup script. The difference is which Distutils *commands* they use: the :command:`sdist` command is almost exclusively for module developers, while :command:`install` is more often for installers (although most developers will want to install their own code occasionally).
es: Este sencillo ejemplo demuestra algunos conceptos fundamentales de Distutils. Primero, tanto los desarrolladores como los instaladores tienen la misma interfaz básica, es decir, el *script* de configuración. La diferencia es qué comandos de Distutils usan: el comando :command:`sdist` es casi exclusivamente para desarrolladores de módulos, mientras que :command:`install` es más frecuente para los instaladores (aunque la mayoría de los desarrolladores querrán instalar su propio código ocasionalmente )

source: If you want to make things really easy for your users, you can create one or more built distributions for them. For instance, if you are running on a Windows machine, and want to make things easy for other Windows users, you can create an executable installer (the most appropriate type of built distribution for this platform) with the :command:`bdist_wininst` command. For example::
es: Si desea hacer las cosas realmente fáciles para sus usuarios, puede crear una o más distribuciones integradas para ellos. Por ejemplo, si está ejecutando en una máquina Windows y desea facilitar las cosas para otros usuarios Windows, puede crear un instalador ejecutable (el tipo más apropiado de distribución integrada para esta plataforma) con el comando :command:`bdist_wininst`. Por ejemplo::

source: will create an executable installer, :file:`foo-1.0.win32.exe`, in the current directory.
es: creará un instalador ejecutable, :file:`foo-1.0.win32.exe`, en el directorio actual.

source: Other useful built distribution formats are RPM, implemented by the :command:`bdist_rpm` command, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`), and HP-UX :program:`swinstall` (:command:`bdist_sdux`). For example, the following command will create an RPM file called :file:`foo-1.0.noarch.rpm`::
es: Otros formatos de distribución útiles son RPM, implementados por el comando :command:`bdist_rpm`, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`) y HP-UX :program:`swinstall` (:command:` bdist_sdux`). Por ejemplo, el siguiente comando creará un archivo RPM llamado :file:`foo-1.0.noarch.rpm`::

source: (The :command:`bdist_rpm` command uses the :command:`rpm` executable, therefore this has to be run on an RPM-based system such as Red Hat Linux, SuSE Linux, or Mandrake Linux.)
es: (El comando :command:`bdist_rpm` utiliza el ejecutable :command:`rpm`, por lo tanto, esto debe ejecutarse en un sistema basado en RPM como Red Hat Linux, SuSE Linux o Mandrake Linux).

source: You can find out what distribution formats are available at any time by running ::
es: Puede averiguar qué formatos de distribución están disponibles en cualquier momento ejecutando ::

source: General Python terminology
es: Terminología general de Python

source: If you're reading this document, you probably have a good idea of what modules, extensions, and so forth are. Nevertheless, just to be sure that everyone is operating from a common starting point, we offer the following glossary of common Python terms:
es: Si está leyendo este documento, probablemente tenga una buena idea de qué son los módulos, extensiones, etc. Sin embargo, solo para asegurarnos de que todos operen desde un punto de partida común, ofrecemos el siguiente glosario de términos comunes de Python:

source: module
es: módulo

source: the basic unit of code reusability in Python: a block of code imported by some other code. Three types of modules concern us here: pure Python modules, extension modules, and packages.
es: la unidad básica de reutilización de código en Python: un bloque de código importado por algún otro código. Aquí nos interesan tres tipos de módulos: módulos Python puros, módulos de extensión y paquetes.

source: pure Python module
es: módulo Python puro

source: a module written in Python and contained in a single :file:`.py` file (and possibly associated :file:`.pyc` files). Sometimes referred to as a "pure module."
es: un módulo escrito en Python y contenido en un solo archivo :file:`.py` (y posiblemente asociado con archivos :file:`.pyc`). A veces se lo denomina "módulo puro".

source: extension module
es: módulo de extensión

source: a module written in the low-level language of the Python implementation: C/C++ for Python, Java for Jython. Typically contained in a single dynamically loadable pre-compiled file, e.g. a shared object (:file:`.so`) file for Python extensions on Unix, a DLL (given the :file:`.pyd` extension) for Python extensions on Windows, or a Java class file for Jython extensions. (Note that currently, the Distutils only handles C/C++ extensions for Python.)
es: Un módulo escrito en el lenguaje de bajo nivel de la implementación de Python: C/C++ para Python, Java para Jython. Típicamente contenido en un único archivo precompilado cargable dinámicamente, ejemplo, un archivo de objeto compartido (:file: .so`) para extensiones de Python en Unix, una DLL (dada la extensión :file:`.pyd`) para extensiones de Python en Windows, o un archivo de clase Java para extensiones de Jython. (Tenga en cuenta que actualmente, Distutils solo maneja extensiones C/C++ para Python).

source: package
es: paquete

source: a module that contains other modules; typically contained in a directory in the filesystem and distinguished from other directories by the presence of a file :file:`__init__.py`.
es: un módulo que contiene otros módulos; típicamente contenido en un directorio en el sistema de archivos y diferenciado de otros directorios por la presencia de un archivo :file:`__init __. py`.

source: root package
es: paquete raíz

source: the root of the hierarchy of packages. (This isn't really a package, since it doesn't have an :file:`__init__.py` file. But we have to call it something.) The vast majority of the standard library is in the root package, as are many small, standalone third-party modules that don't belong to a larger module collection. Unlike regular packages, modules in the root package can be found in many directories: in fact, every directory listed in ``sys.path`` contributes modules to the root package.
es: la raíz de la jerarquía de paquetes. (Esto no es realmente un paquete, ya que no tiene un archivo :file:`__init __.py`. Pero tenemos que llamarlo de alguna forma). La gran mayoría de la biblioteca estándar está en el paquete raíz, como muchos módulos de terceros pequeños e independientes que no pertenecen a una colección de módulos más grande. A diferencia de los paquetes regulares, los módulos en el paquete raíz se pueden encontrar en muchos directorios: de hecho, cada directorio listado en ``sys.path`` contribuye con módulos al paquete raíz.

source: Distutils-specific terminology
es: Terminología específica de Distutils

source: The following terms apply more specifically to the domain of distributing Python modules using the Distutils:
es: Los siguientes términos se aplican más específicamente al dominio de distribución de módulos de Python utilizando Distutils:

source: module distribution
es: distribución de módulo

source: a collection of Python modules distributed together as a single downloadable resource and meant to be installed *en masse*. Examples of some well-known module distributions are NumPy, SciPy, Pillow, or mxBase. (This would be called a *package*, except that term is already taken in the Python context: a single module distribution may contain zero, one, or many Python packages.)
es: una colección de módulos de Python distribuidos como un único recurso descargable y destinado a ser instalados *en masa*. Ejemplos de algunas distribuciones de módulos conocidas son NumPy, SciPy, Pillow o mxBase. (Esto se llama *paquete*, excepto que ese término ya se ha tomado en el contexto de Python: una distribución de un solo módulo puede contener cero, uno o muchos paquetes de Python).

source: pure module distribution
es: distribución pura del módulo

source: a module distribution that contains only pure Python modules and packages. Sometimes referred to as a "pure distribution."
es: una distribución de módulos que contiene solo módulos y paquetes de Python. A veces se lo denomina "distribución pura".

source: non-pure module distribution
es: distribución de módulos no puros

source: a module distribution that contains at least one extension module. Sometimes referred to as a "non-pure distribution."
es: una distribución de módulo que contiene al menos un módulo de extensión. En ocasiones se denomina "distribución no pura".

source: distribution root
es: distribución raíz

source: the top-level directory of your source tree (or source distribution); the directory where :file:`setup.py` exists. Generally :file:`setup.py` will be run from this directory.
es: el directorio de nivel superior del árbol fuente (o distribución fuente); el directorio donde :file:`setup.py` existe. Generalmente :file:`setup.py` se ejecutará desde este directorio.
