Repository: python/python-docs-es
Catalog: distutils/setupscript.po
Languages: es

source: Encoding the version information is an art in itself. Python packages generally adhere to the version format *major.minor[.patch][sub]*. The major number is 0 for initial, experimental releases of software. It is incremented for releases that represent major milestones in a package. The minor number is incremented when important new features are added to the package. The patch number increments when bug-fix releases are made. Additional trailing version information is sometimes used to indicate sub-releases. These are "a1,a2,...,aN" (for alpha releases, where functionality and API may change), "b1,b2,...,bN" (for beta releases, which only fix bugs) and "pr1,pr2,...,prN" (for final pre-release release testing). Some examples:
es: Codificar la información de la versión es un arte en sí mismo. Los paquetes de Python generalmente se adhieren al formato de versión *major.minor[.patch][sub]*. El número principal es 0 para las versiones iniciales y experimentales de software. Se incrementa para versiones que representan hitos importantes en un paquete. El número menor se incrementa cuando se agregan nuevas características importantes al paquete. El número de parche aumenta cuando se realizan versiones de corrección de errores. La información adicional de la versión final a veces se usa para indicar sublanzamientos. Estos son "a1, a2, ..., aN" (para versiones alfa, donde la funcionalidad y la API pueden cambiar), "b1, b2, ..., bN" (para versiones beta, que solo corrigen errores) y "pr1 , pr2, ..., prN" (para la prueba final de lanzamiento previo al lanzamiento). Algunos ejemplos:

source: the first, experimental release of a package
es: el primer lanzamiento experimental de un paquete

source: the second alpha release of the first patch version of 1.0
es: la segunda versión alfa de la primera versión del parche 1.0

source: ``classifiers`` must be specified in a list::
es: ``classifiers`` debe ser especificado en una lista::

source: :class:`~distutils.core.setup` now warns when ``classifiers``, ``keywords`` or ``platforms`` fields are not specified as a list or a string.
es: :class:`~distutils.core.setup` ahora advierte cuando los campos ``classifiers``, ``keywords`` o ``platforms`` no se especifican como una lista o una cadena de caracteres.

source: Debugging the setup script
es: Depuración del script de configuración

source: Sometimes things go wrong, and the setup script doesn't do what the developer wants.
es: A veces las cosas salen mal y el script de configuración no hace lo que el desarrollador quiere.

source: Distutils catches any exceptions when running the setup script, and print a simple error message before the script is terminated. The motivation for this behaviour is to not confuse administrators who don't know much about Python and are trying to install a package. If they get a big long traceback from deep inside the guts of Distutils, they may think the package or the Python installation is broken because they don't read all the way down to the bottom and see that it's a permission problem.
es: Distutils detecta cualquier excepción al ejecutar el script de configuración e imprime un mensaje de error simple antes de que finalice el script. La motivación para este comportamiento es no confundir a los administradores que no saben mucho acerca de Python y están tratando de instalar un paquete. Si obtienen un gran rastreo desde las profundidades de Distutils, pueden pensar que el paquete o la instalación de Python están rotos porque no leen hasta el final y ven que es un problema de permiso.

source: On the other hand, this doesn't help the developer to find the cause of the failure. For this purpose, the :envvar:`DISTUTILS_DEBUG` environment variable can be set to anything except an empty string, and distutils will now print detailed information about what it is doing, dump the full traceback when an exception occurs, and print the whole command line when an external program (like a C compiler) fails.
es: Por otro lado, esto no ayuda al desarrollador a encontrar la causa de la falla. Para este propósito, la variable de entorno :envvar:`DISTUTILS_DEBUG` se puede establecer en cualquier cosa excepto una cadena vacía, y distutils ahora imprimirá información detallada sobre lo que está haciendo, volcará el rastreo completo cuando ocurra una excepción e imprimirá todo el comando línea cuando falla un programa externo (como un compilador de C).
