Repository: python/python-docs-es
Catalog: distutils/setupscript.po
Languages: es

source: is the equivalent of having this at the top of every C source file::
es: es el equivalente a tener esto en la parte superior de cada archivo fuente C::

source: Library options
es: Opciones de biblioteca

source: You can also specify the libraries to link against when building your extension, and the directories to search for those libraries. The ``libraries`` option is a list of libraries to link against, ``library_dirs`` is a list of directories to search for libraries at link-time, and ``runtime_library_dirs`` is a list of directories to search for shared (dynamically loaded) libraries at run-time.
es: También puede especificar las bibliotecas para enlazarlas al crear su extensión y los directorios para buscar esas bibliotecas. La opción ``bibliotecas`` es una lista de bibliotecas para enlazar, ``library_dirs`` es una lista de directorios para buscar bibliotecas en el momento del enlace, y ``runtime_library_dirs`` es una lista de directorios para buscar compartidos (cargadas dinámicamente) bibliotecas en tiempo de ejecución.

source: For example, if you need to link against libraries known to be in the standard library search path on target systems ::
es: Por ejemplo, si necesita enlazar con bibliotecas que se sabe que están en la ruta de búsqueda de biblioteca estándar en los sistemas de destino:

source: If you need to link with libraries in a non-standard location, you'll have to include the location in ``library_dirs``::
es: Si necesita enlazar con bibliotecas en una ubicación no estándar, deberá incluir la ubicación en ``library_dirs``::

source: (Again, this sort of non-portable construct should be avoided if you intend to distribute your code.)
es: (Nuevamente, este tipo de construcción no portátil debe evitarse si tiene la intención de distribuir su código.)

source: Other options
es: Otras opciones

source: There are still some other options which can be used to handle special cases.
es: Todavía hay algunas otras opciones que se pueden usar para manejar casos especiales.

source: The ``optional`` option is a boolean; if it is true, a build failure in the extension will not abort the build process, but instead simply not install the failing extension.
es: La opción ``optional`` es booleana; si es cierto, una falla de compilación en la extensión no abortará el proceso de compilación, sino que simplemente no instalará la extensión que falla.

source: The ``extra_objects`` option is a list of object files to be passed to the linker. These files must not have extensions, as the default extension for the compiler is used.
es: La opción ``extra_objects`` es una lista de archivos de objetos que se pasarán al enlazador. Estos archivos no deben tener extensiones, ya que se usa la extensión predeterminada para el compilador.

source: ``extra_compile_args`` and ``extra_link_args`` can be used to specify additional command line options for the respective compiler and linker command lines.
es: ``extra_compile_args`` y ``extra_link_args`` se pueden usar para especificar opciones de línea de comando adicionales para las líneas de comando del compilador y enlazador respectivo.

source: ``export_symbols`` is only useful on Windows. It can contain a list of symbols (functions or variables) to be exported. This option is not needed when building compiled extensions: Distutils will automatically add ``initmodule`` to the list of exported symbols.
es: ``export_symbols`` solo es útil en Windows. Puede contener una lista de símbolos (funciones o variables) para exportar. Esta opción no es necesaria cuando se crean extensiones compiladas: Distutils agregará automáticamente ``initmodule`` a la lista de símbolos exportados.

source: The ``depends`` option is a list of files that the extension depends on (for example header files). The build command will call the compiler on the sources to rebuild extension if any on this files has been modified since the previous build.
es: La opción ``depends`` es una lista de archivos de los que depende la extensión (por ejemplo, archivos de encabezado). El comando de compilación llamará al compilador en las fuentes para reconstruir la extensión si alguno de estos archivos se ha modificado desde la compilación anterior.

source: Relationships between Distributions and Packages
es: Relaciones entre distribuciones y paquetes

source: A distribution may relate to packages in three specific ways:
es: Una distribución puede relacionarse con paquetes de tres maneras específicas:

source: It can require packages or modules.
es: Puede requerir paquetes o módulos.

source: It can provide packages or modules.
es: Puede proporcionar paquetes o módulos.

source: It can obsolete packages or modules.
es: Puede paquetes o módulos obsoletos.

source: These relationships can be specified using keyword arguments to the :func:`distutils.core.setup` function.
es: Estas relaciones se pueden especificar utilizando argumentos de palabras clave para la función :func:`distutils.core.setup`.

source: Dependencies on other Python modules and packages can be specified by supplying the *requires* keyword argument to :func:`setup`. The value must be a list of strings. Each string specifies a package that is required, and optionally what versions are sufficient.
es: Las dependencias en otros módulos y paquetes de Python se pueden especificar proporcionando el argumento de palabra clave *requires* a :func:`setup`. El valor debe ser una lista de cadenas de caracteres. Cada cadena especifica un paquete que se requiere y, opcionalmente, qué versiones son suficientes.

source: To specify that any version of a module or package is required, the string should consist entirely of the module or package name. Examples include ``'mymodule'`` and ``'xml.parsers.expat'``.
es: Para especificar que se requiere cualquier versión de un módulo o paquete, la cadena debe consistir completamente en el nombre del módulo o paquete. Los ejemplos incluyen ``'mymodule'`` y ``'xml.parsers.expat'``.

source: If specific versions are required, a sequence of qualifiers can be supplied in parentheses. Each qualifier may consist of a comparison operator and a version number. The accepted comparison operators are::
es: Si se requieren versiones específicas, se puede proporcionar una secuencia de calificadores entre paréntesis. Cada calificador puede consistir en un operador de comparación y un número de versión. Los operadores de comparación aceptados son::

source: These can be combined by using multiple qualifiers separated by commas (and optional whitespace). In this case, all of the qualifiers must be matched; a logical AND is used to combine the evaluations.
es: Estos se pueden combinar usando múltiples calificadores separados por comas (y espacios en blanco opcionales). En este caso, todos los calificadores deben coincidir; Se utiliza un AND lógico para combinar las evaluaciones.

source: Let's look at a bunch of examples:
es: Veamos algunos ejemplos:

source: Requires Expression
es: Expresión Requiere

source: Explanation
es: Explicación

source: Only version ``1.0`` is compatible
es: Solo la versión ``1.0`` es compatible

source: Any version after ``1.0`` and before ``2.0`` is compatible, except ``1.5.1``
es: Cualquier versión posterior a ``1.0`` y anterior a ``2.0`` es compatible, excepto ``1.5.1``

source: Now that we can specify dependencies, we also need to be able to specify what we provide that other distributions can require. This is done using the *provides* keyword argument to :func:`setup`. The value for this keyword is a list of strings, each of which names a Python module or package, and optionally identifies the version. If the version is not specified, it is assumed to match that of the distribution.
es: Ahora que podemos especificar dependencias, también debemos poder especificar qué proporcionamos que otras distribuciones pueden requerir. Esto se hace usando el argumento de palabra clave *provides* para :func:`setup`. El valor de esta palabra clave es una lista de cadenas, cada una de las cuales nombra un módulo o paquete Python, y opcionalmente identifica la versión. Si no se especifica la versión, se supone que coincide con la de la distribución.

source: Some examples:
es: Algunos ejemplos:

source: Provides Expression
es: Expresión Proporciona

source: Provide ``mypkg``, using the distribution version
es: Proporciona ``mypkg``, utilizando la versión de distribución

source: Provide ``mypkg`` version 1.1, regardless of the distribution version
es: Proporcione ``mypkg`` versión 1.1, independientemente de la versión de distribución

source: A package can declare that it obsoletes other packages using the *obsoletes* keyword argument. The value for this is similar to that of the *requires* keyword: a list of strings giving module or package specifiers. Each specifier consists of a module or package name optionally followed by one or more version qualifiers. Version qualifiers are given in parentheses after the module or package name.
es: Un paquete puede declarar que obsoleto otros paquetes utilizando el argumento de palabra clave *obsoletes*. El valor para esto es similar al de la palabra clave *requires*: una lista de cadenas que dan especificadores de módulo o paquete. Cada especificador consta de un nombre de módulo o paquete opcionalmente seguido de uno o más calificadores de versión. Los calificadores de versión se dan entre paréntesis después del nombre del módulo o paquete.

source: The versions identified by the qualifiers are those that are obsoleted by the distribution being described. If no qualifiers are given, all versions of the named module or package are understood to be obsoleted.
es: Las versiones identificadas por los calificadores son aquellas que están obsoletas por la distribución que se describe. Si no se dan calificadores, se entiende que todas las versiones del módulo o paquete nombrado están obsoletas.

source: Installing Scripts
es: Instalar scripts

source: So far we have been dealing with pure and non-pure Python modules, which are usually not run by themselves but imported by scripts.
es: Hasta ahora hemos estado tratando con módulos Python puros y no puros, que generalmente no se ejecutan solos sino que se importan mediante scripts.

source: Scripts are files containing Python source code, intended to be started from the command line. Scripts don't require Distutils to do anything very complicated. The only clever feature is that if the first line of the script starts with ``#!`` and contains the word "python", the Distutils will adjust the first line to refer to the current interpreter location. By default, it is replaced with the current interpreter location. The :option:`!--executable` (or :option:`!-e`) option will allow the interpreter path to be explicitly overridden.
es: Los scripts son archivos que contienen el código fuente de Python, destinados a iniciarse desde la línea de comandos. Los scripts no requieren que Distutils haga nada muy complicado. La única característica inteligente es que si la primera línea del script comienza con ``#!`` Y contiene la palabra "python", Distutils ajustará la primera línea para referirse a la ubicación actual del intérprete. Por defecto, se reemplaza con la ubicación actual del intérprete. La opción :option:`!-executable` (o :option:`!-e`) permitirá que la ruta del intérprete se anule explícitamente.

source: The ``scripts`` option simply is a list of files to be handled in this way. From the PyXML setup script::
es: La opción ``scripts`` simplemente es una lista de archivos a manejar de esta manera. Desde el script de configuración PyXML::

source: All the scripts will also be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
es: Todos los scripts también se agregarán al archivo ``MANIFEST`` si no se proporciona una plantilla. Ver :ref:`manifest`.

source: Installing Package Data
es: Instalar datos del paquete

source: Often, additional files need to be installed into a package. These files are often data that's closely related to the package's implementation, or text files containing documentation that might be of interest to programmers using the package. These files are called :dfn:`package data`.
es: A menudo, se necesitan instalar archivos adicionales en un paquete. Estos archivos son a menudo datos que están estrechamente relacionados con la implementación del paquete, o archivos de texto que contienen documentación que podría ser de interés para los programadores que usan el paquete. Estos archivos se llaman :dfn:`paquetes de datos <package data>`.

source: Package data can be added to packages using the ``package_data`` keyword argument to the :func:`setup` function. The value must be a mapping from package name to a list of relative path names that should be copied into the package. The paths are interpreted as relative to the directory containing the package (information from the ``package_dir`` mapping is used if appropriate); that is, the files are expected to be part of the package in the source directories. They may contain glob patterns as well.
es: Los datos del paquete se pueden agregar a los paquetes utilizando el argumento de palabra clave ``package_data`` para la función :func:`setup`. El valor debe ser una asignación del nombre del paquete a una lista de nombres de ruta relativos que deben copiarse en el paquete. Las rutas se interpretan como relativas al directorio que contiene el paquete (la información de la asignación ``package_dir`` se usa si corresponde); es decir, se espera que los archivos formen parte del paquete en los directorios de origen. También pueden contener patrones glob.

source: The path names may contain directory portions; any necessary directories will be created in the installation.
es: Los nombres de ruta pueden contener porciones de directorio; cualquier directorio necesario se creará en la instalación.

source: For example, if a package should contain a subdirectory with several data files, the files can be arranged like this in the source tree::
es: Por ejemplo, si un paquete debe contener un subdirectorio con varios archivos de datos, los archivos se pueden organizar de esta manera en el árbol de origen::

source: The corresponding call to :func:`setup` might be::
es: La llamada correspondiente a :func:`setup` podría ser::

source: All the files that match ``package_data`` will be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
es: Todos los archivos que coincidan con ``package_data`` se agregarán al archivo ``MANIFEST`` si no se proporciona una plantilla. Ver :ref:`manifest`.

source: Installing Additional Files
es: Instalar archivos adicionales

source: The ``data_files`` option can be used to specify additional files needed by the module distribution: configuration files, message catalogs, data files, anything which doesn't fit in the previous categories.
es: La opción ``data_files`` se puede usar para especificar archivos adicionales necesarios para la distribución del módulo: archivos de configuración, catálogos de mensajes, archivos de datos, cualquier cosa que no se ajuste a las categorías anteriores.

source: ``data_files`` specifies a sequence of (*directory*, *files*) pairs in the following way::
es: ``data_files`` especifica una secuencia de pares (*directory*, *files*) de la siguiente manera::

source: Each (*directory*, *files*) pair in the sequence specifies the installation directory and the files to install there.
es: Cada par (*directory*, *files*) en la secuencia especifica el directorio de instalación y los archivos a instalar allí.

source: Each file name in *files* is interpreted relative to the :file:`setup.py` script at the top of the package source distribution. Note that you can specify the directory where the data files will be installed, but you cannot rename the data files themselves.
es: Cada nombre de archivo en *files* se interpreta en relación con el script :file:`setup.py` en la parte superior de la distribución de origen del paquete. Tenga en cuenta que puede especificar el directorio donde se instalarán los archivos de datos, pero no puede cambiar el nombre de los archivos de datos.

source: The *directory* should be a relative path. It is interpreted relative to the installation prefix (Python's ``sys.prefix`` for system installations; ``site.USER_BASE`` for user installations). Distutils allows *directory* to be an absolute installation path, but this is discouraged since it is incompatible with the wheel packaging format. No directory information from *files* is used to determine the final location of the installed file; only the name of the file is used.
es: El *directory* debe ser una ruta relativa. Se interpreta en relación con el prefijo de instalación (``sys.prefix`` de Python para instalaciones del sistema; ``site.USER_BASE`` para instalaciones de usuario). Distutils permite que *directory* sea una ruta de instalación absoluta, pero esto se desaconseja ya que es incompatible con el formato de empaquetado de la rueda. No se utiliza información de directorio de *files* para determinar la ubicación final del archivo instalado; solo se usa el nombre del archivo.

source: You can specify the ``data_files`` options as a simple sequence of files without specifying a target directory, but this is not recommended, and the :command:`install` command will print a warning in this case. To install data files directly in the target directory, an empty string should be given as the directory.
es: Puede especificar las opciones ``data_files`` como una secuencia simple de archivos sin especificar un directorio de destino, pero esto no es recomendable, y el comando :command:`install` imprimirá una advertencia en este caso. Para instalar archivos de datos directamente en el directorio de destino, se debe dar una cadena vacía como directorio.

source: All the files that match ``data_files`` will be added to the ``MANIFEST`` file if no template is provided. See :ref:`manifest`.
es: Todos los archivos que coincidan con ``data_files`` se agregarán al archivo ``MANIFEST`` si no se proporciona una plantilla. Ver :ref:`manifest`.

source: Additional meta-data
es: Metadatos adicionales

source: The setup script may include additional meta-data beyond the name and version. This information includes:
es: El script de configuración puede incluir metadatos adicionales más allá del nombre y la versión. Esta información incluye:

source: Meta-Data
es: Metadatos

source: Description
es: Descripción

source: Value
es: Valor

source: Notes
es: Notas

source: name of the package
es: nombre del paquete

source: short string
es: cadena de caracteres corta

source: version of this release
es: versión de este lanzamiento

source: package author's name
es: nombre del autor del paquete

source: email address of the package author
es: dirección de correo electrónico del autor del paquete

source: email address
es: dirección de correo electrónico

source: package maintainer's name
es: nombre del responsable del paquete

source: email address of the package maintainer
es: dirección de correo electrónico del mantenedor del paquete

source: home page for the package
es: página de inicio del paquete

source: short, summary description of the package
es: descripción breve y resumida del paquete

source: longer description of the package
es: descripción más larga del paquete

source: long string
es: cadena de caracteres larga

source: location where the package may be downloaded
es: ubicación donde se puede descargar el paquete

source: a list of classifiers
es: una lista de clasificadores

source: list of strings
es: lista de cadenas de caracteres

source: a list of platforms
es: una lista de plataformas

source: a list of keywords
es: una lista de palabras clave

source: license for the package
es: licencia para el paquete

source: Notes:
es: Notas:

source: These fields are required.
es: Estos campos son obligatorios.

source: It is recommended that versions take the form *major.minor[.patch[.sub]]*.
es: Se recomienda que las versiones tomen la forma *major.minor[.patch[.sub]]*.

source: Either the author or the maintainer must be identified. If maintainer is provided, distutils lists it as the author in :file:`PKG-INFO`.
es: Se debe identificar al autor o al mantenedor. Si se proporciona el mantenedor, distutils lo enumera como el autor en :file:`PKG-INFO`.

source: The ``long_description`` field is used by PyPI when you publish a package, to build its project page.
es: PyPI utiliza el campo ``descripción larga`` cuando publica un paquete para construir su página de proyecto.

source: The ``license`` field is a text indicating the license covering the package where the license is not a selection from the "License" Trove classifiers. See the ``Classifier`` field. Notice that there's a ``licence`` distribution option which is deprecated but still acts as an alias for ``license``.
es: El campo ``license`` es un texto que indica la licencia que cubre el paquete donde la licencia no es una selección de los clasificadores de Trove *"License"*. Vea el campo ``Classifier``. Tenga en cuenta que hay una opción de distribución de ``license`` que está en desuso pero que aún actúa como un alias para la ``license``.

source: This field must be a list.
es: Este campo debe ser una lista.

source: The valid classifiers are listed on `PyPI <https://pypi.org/classifiers>`_.
es: Los clasificadores válidos se enumeran en `PyPI <https://pypi.org/classifiers>`_.

source: To preserve backward compatibility, this field also accepts a string. If you pass a comma-separated string ``'foo, bar'``, it will be converted to ``['foo', 'bar']``, Otherwise, it will be converted to a list of one string.
es: Para preservar la compatibilidad con versiones anteriores, este campo también acepta una cadena. Si pasa una cadena separada por comas ``'foo, bar'``, se convertirá en ``['foo', 'bar']``, de lo contrario, se convertirá en una lista de una cadena de caracteres.

source: 'short string'
es: 'cadenas de caracteres cortas'

source: A single line of text, not more than 200 characters.
es: Una sola línea de texto, no más de 200 caracteres.

source: 'long string'
es: 'cadenas de caracteres largas'

source: Multiple lines of plain text in reStructuredText format (see http://docutils.sourceforge.net/).
es: Múltiples líneas de texto plano en formato reStructuredText (consulte http://docutils.sourceforge.net/).

source: 'list of strings'
es: 'lista de cadenas de caracteres'

source: See below.
es: Vea abajo.
