Repository: python/python-docs-es
Catalog: distutils/setupscript.po
Languages: es

source: Writing the Setup Script
es: Escribir el script de configuración

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
es: Este documento se retiene únicamente hasta que la documentación de ``setuptools`` en https://setuptools.readthedocs.io/en/latest/setuptools.html cubre de forma independiente toda la información relevante actualmente incluida aquí.

source: The setup script is the centre of all activity in building, distributing, and installing modules using the Distutils. The main purpose of the setup script is to describe your module distribution to the Distutils, so that the various commands that operate on your modules do the right thing. As we saw in section :ref:`distutils-simple-example` above, the setup script consists mainly of a call to :func:`setup`, and most information supplied to the Distutils by the module developer is supplied as keyword arguments to :func:`setup`.
es: El script de configuración es el centro de toda actividad en la construcción, distribución e instalación de módulos utilizando Distutils. El propósito principal del script de configuración es describir la distribución de su módulo a Distutils, de modo que los diversos comandos que operan en sus módulos hagan lo correcto. Como vimos en la sección :ref:`ejemplo simple de distutils <distutils-simple-example>` anterior, el script de configuración consiste principalmente en una llamada a :func:`setup`, y la mayoría de la información suministrada a Distutils por el desarrollador del módulo se proporciona como argumentos de palabras clave para :func:`setup`.

source: Here's a slightly more involved example, which we'll follow for the next couple of sections: the Distutils' own setup script. (Keep in mind that although the Distutils are included with Python 1.6 and later, they also have an independent existence so that Python 1.5.2 users can use them to install other module distributions. The Distutils' own setup script, shown here, is used to install the package into Python 1.5.2.) ::
es: Aquí hay un ejemplo un poco más complicado, que seguiremos en las próximas secciones: el propio script de configuración de Distutils. (Tenga en cuenta que aunque los Distutils se incluyen con Python 1.6 y posteriores, también tienen una existencia independiente para que los usuarios de Python 1.5.2 puedan usarlos para instalar otras distribuciones de módulos. Se utiliza el propio script de configuración de Distutils, que se muestra aquí). instalar el paquete en Python 1.5.2.) ::

source: There are only two differences between this and the trivial one-file distribution presented in section :ref:`distutils-simple-example`: more metadata, and the specification of pure Python modules by package, rather than by module. This is important since the Distutils consist of a couple of dozen modules split into (so far) two packages; an explicit list of every module would be tedious to generate and difficult to maintain. For more information on the additional meta-data, see section :ref:`meta-data`.
es: Solo hay dos diferencias entre esto y la trivial distribución de un archivo presentada en la sección :ref:`ejemplo simple de distutils <distutils-simple-example>`: más metadatos y la especificación de módulos Python puros por paquete, en lugar de por módulo. Esto es importante ya que los Distutils consisten en un par de docenas de módulos divididos en (hasta ahora) dos paquetes; Una lista explícita de cada módulo sería tediosa de generar y difícil de mantener. Para obtener más información sobre los metadatos adicionales, consulte la sección :ref:`meta-data`.

source: Note that any pathnames (files or directories) supplied in the setup script should be written using the Unix convention, i.e. slash-separated. The Distutils will take care of converting this platform-neutral representation into whatever is appropriate on your current platform before actually using the pathname. This makes your setup script portable across operating systems, which of course is one of the major goals of the Distutils. In this spirit, all pathnames in this document are slash-separated.
es: Tenga en cuenta que los nombres de ruta (archivos o directorios) proporcionados en el script de configuración deben escribirse utilizando la convención de Unix, es decir, separados por barras. Distutils se encargará de convertir esta representación neutral de la plataforma en lo que sea apropiado en su plataforma actual antes de usar el nombre de ruta. Esto hace que su script de configuración sea portátil en todos los sistemas operativos, lo que, por supuesto, es uno de los principales objetivos de Distutils. En este espíritu, todos los nombres de ruta en este documento están separados por barras.

source: This, of course, only applies to pathnames given to Distutils functions. If you, for example, use standard Python functions such as :func:`glob.glob` or :func:`os.listdir` to specify files, you should be careful to write portable code instead of hardcoding path separators::
es: Esto, por supuesto, solo se aplica a los nombres de ruta asignados a las funciones de Distutils. Si, por ejemplo, utiliza funciones estándar de Python como :func:`glob.glob` o :func:`os.listdir` para especificar archivos, debe tener cuidado al escribir código portátil en lugar de codificar separadores de ruta::

source: Listing whole packages
es: Listado de paquetes completos

source: The ``packages`` option tells the Distutils to process (build, distribute, install, etc.) all pure Python modules found in each package mentioned in the ``packages`` list. In order to do this, of course, there has to be a correspondence between package names and directories in the filesystem. The default correspondence is the most obvious one, i.e. package :mod:`distutils` is found in the directory :file:`distutils` relative to the distribution root. Thus, when you say ``packages = ['foo']`` in your setup script, you are promising that the Distutils will find a file :file:`foo/__init__.py` (which might be spelled differently on your system, but you get the idea) relative to the directory where your setup script lives. If you break this promise, the Distutils will issue a warning but still process the broken package anyway.
es: La opción ``packages`` le dice a Distutils que procese (compile, distribuya, instale, etc.) todos los módulos de Python puros que se encuentran en cada paquete mencionado en la lista de ``packages``. Para hacer esto, por supuesto, debe haber una correspondencia entre los nombres de los paquetes y los directorios en el sistema de archivos. La correspondencia predeterminada es la más obvia, es decir, el paquete :mod:`distutils` se encuentra en el directorio :file:`distutils` en relación con la raíz de distribución. Por lo tanto, cuando diga ``packages = ['foo']`` en su secuencia de comandos de configuración, promete que Distutils encontrará un archivo :file:`foo/__init__.py` (que podría estar escrito de manera diferente en su sistema , pero te haces una idea) en relación con el directorio donde vive tu script de configuración. Si no cumple esta promesa, Distutils emitirá una advertencia pero de todos modos procesará el paquete roto.

source: If you use a different convention to lay out your source directory, that's no problem: you just have to supply the ``package_dir`` option to tell the Distutils about your convention. For example, say you keep all Python source under :file:`lib`, so that modules in the "root package" (i.e., not in any package at all) are in :file:`lib`, modules in the :mod:`foo` package are in :file:`lib/foo`, and so forth. Then you would put ::
es: Si usa una convención diferente para diseñar su directorio de origen, no hay problema: solo tiene que proporcionar la opción ``package_dir`` para informar a los Distutils sobre su convención. Por ejemplo, supongamos que mantiene toda la fuente de Python en :file:`lib`, de modo que los módulos en el "paquete raíz" (es decir, no en ningún paquete) estén en :file:`lib`, módulos en el paquete :mod:`foo` está en archivo :file:`lib/foo`, y así sucesivamente. Entonces pondrías ::

source: in your setup script. The keys to this dictionary are package names, and an empty package name stands for the root package. The values are directory names relative to your distribution root. In this case, when you say ``packages = ['foo']``, you are promising that the file :file:`lib/foo/__init__.py` exists.
es: en tu script de configuración. Las claves de este diccionario son nombres de paquetes, y un nombre de paquete vacío representa el paquete raíz. Los valores son nombres de directorio relativos a su raíz de distribución. En este caso, cuando dices ``packages = ['foo']``, estás prometiendo que el archivo :file:`lib/foo/__init__.py` existe.

source: Another possible convention is to put the :mod:`foo` package right in :file:`lib`, the :mod:`foo.bar` package in :file:`lib/bar`, etc. This would be written in the setup script as ::
es: Otra posible convención es colocar el paquete :mod:`foo` directamente en :file:`lib`, el paquete :mod:`foo.bar` en :file:`lib/bar`, etc. Esto se escribiría en el script de configuración como ::

source: A ``package: dir`` entry in the ``package_dir`` dictionary implicitly applies to all packages below *package*, so the :mod:`foo.bar` case is automatically handled here. In this example, having ``packages = ['foo', 'foo.bar']`` tells the Distutils to look for :file:`lib/__init__.py` and :file:`lib/bar/__init__.py`. (Keep in mind that although ``package_dir`` applies recursively, you must explicitly list all packages in ``packages``: the Distutils will *not* recursively scan your source tree looking for any directory with an :file:`__init__.py` file.)
es: Una entrada ``package: dir`` en el diccionario ``package_dir`` se aplica implícitamente a todos los paquetes debajo de *package*, por lo que el caso :mod:`foo.bar` se maneja automáticamente aquí. En este ejemplo, tener ``packages = ['foo', 'foo.bar']`` le dice a los Distutils que busquen :file:`lib/__init__.py` y :file:`lib/bar/__init__.py`. (Tenga en cuenta que, aunque ``package_dir`` se aplica de forma recursiva, debe enumerar explícitamente todos los paquetes en ``packages``: los Distutils *no* escanearán recursivamente su árbol de origen buscando cualquier directorio con un archivo :file:`__init__.py`.)

source: Listing individual modules
es: Listado de módulos individuales

source: For a small module distribution, you might prefer to list all modules rather than listing packages---especially the case of a single module that goes in the "root package" (i.e., no package at all). This simplest case was shown in section :ref:`distutils-simple-example`; here is a slightly more involved example::
es: Para una distribución de módulos pequeños, es posible que prefiera enumerar todos los módulos en lugar de enumerar los paquetes, especialmente el caso de un solo módulo que va en el "paquete raíz" (es decir, ningún paquete). Este caso más simple se mostró en la sección :ref:`distutils-simple-example`; Aquí hay un ejemplo un poco más complicado:

source: This describes two modules, one of them in the "root" package, the other in the :mod:`pkg` package. Again, the default package/directory layout implies that these two modules can be found in :file:`mod1.py` and :file:`pkg/mod2.py`, and that :file:`pkg/__init__.py` exists as well. And again, you can override the package/directory correspondence using the ``package_dir`` option.
es: Esto describe dos módulos, uno en el paquete "raíz", el otro en el paquete :mod:`pkg`. Nuevamente, el diseño predeterminado del paquete/directorio implica que estos dos módulos se pueden encontrar en :file:`mod1.py` y :file:`pkg/mod2.py`, y que :file:`pkg/__init__.py` existe también. Y nuevamente, puede anular la correspondencia paquete/directorio utilizando la opción ``package_dir``.

source: Describing extension modules
es: Describiendo módulos de extensión

source: Just as writing Python extension modules is a bit more complicated than writing pure Python modules, describing them to the Distutils is a bit more complicated. Unlike pure modules, it's not enough just to list modules or packages and expect the Distutils to go out and find the right files; you have to specify the extension name, source file(s), and any compile/link requirements (include directories, libraries to link with, etc.).
es: Así como escribir módulos de extensión Python es un poco más complicado que escribir módulos Python puros, describirlos a Distutils es un poco más complicado. A diferencia de los módulos puros, no basta con enumerar módulos o paquetes y esperar que Distutils salga y encuentre los archivos correctos; debe especificar el nombre de la extensión, el (los) archivo (s) de origen y cualquier requisito de compilación/enlace (incluir directorios, bibliotecas para enlazadores, etc.).

source: All of this is done through another keyword argument to :func:`setup`, the ``ext_modules`` option. ``ext_modules`` is just a list of :class:`~distutils.core.Extension` instances, each of which describes a single extension module. Suppose your distribution includes a single extension, called :mod:`foo` and implemented by :file:`foo.c`. If no additional instructions to the compiler/linker are needed, describing this extension is quite simple::
es: Todo esto se realiza a través de otro argumento de palabra clave para :func:`setup`, la opción ``ext_modules``. ``ext_modules`` es solo una lista de instancias :class:`~distutils.core.Extension`, cada una de las cuales describe un único módulo de extensión. Suponga que su distribución incluye una sola extensión, llamada :mod:`foo` e implementada por :file:`foo.c`. Si no se necesitan instrucciones adicionales para el compilador/enlazador, describir esta extensión es bastante simple:

source: The :class:`Extension` class can be imported from :mod:`distutils.core` along with :func:`setup`. Thus, the setup script for a module distribution that contains only this one extension and nothing else might be::
es: La clase :class:`Extension` se puede importar desde :mod:`distutils.core` junto con :func:`setup`. Por lo tanto, el script de configuración para una distribución de módulo que contiene solo esta extensión y nada más podría ser:

source: The :class:`Extension` class (actually, the underlying extension-building machinery implemented by the :command:`build_ext` command) supports a great deal of flexibility in describing Python extensions, which is explained in the following sections.
es: La clase :class:`Extension` (en realidad, la maquinaria de construcción de extensiones subyacente implementada por el comando :command:`build_ext`) admite una gran flexibilidad al describir las extensiones de Python, que se explica en las siguientes secciones.

source: Extension names and packages
es: Nombres de extensión y paquetes

source: The first argument to the :class:`~distutils.core.Extension` constructor is always the name of the extension, including any package names. For example, ::
es: El primer argumento para el constructor :class:`~distutils.core.Extension` es siempre el nombre de la extensión, incluidos los nombres de los paquetes. Por ejemplo, ::

source: describes an extension that lives in the root package, while ::
es: describe una extensión que vive en el paquete raíz, mientras que ::

source: describes the same extension in the :mod:`pkg` package. The source files and resulting object code are identical in both cases; the only difference is where in the filesystem (and therefore where in Python's namespace hierarchy) the resulting extension lives.
es: describe la misma extensión en el paquete :mod:`pkg`. Los archivos fuente y el código objeto resultante son idénticos en ambos casos; la única diferencia es dónde en el sistema de archivos (y, por lo tanto, dónde en la jerarquía del espacio de nombres de Python) vive la extensión resultante.

source: If you have a number of extensions all in the same package (or all under the same base package), use the ``ext_package`` keyword argument to :func:`setup`. For example, ::
es: Si tiene varias extensiones, todas en el mismo paquete (o todas en el mismo paquete base), use el argumento de palabra clave ``ext_package`` para :func:`setup`. Por ejemplo, ::

source: will compile :file:`foo.c` to the extension :mod:`pkg.foo`, and :file:`bar.c` to :mod:`pkg.subpkg.bar`.
es: compilará :file:`foo.c` a la extensión :mod:`pkg.foo`, y :file:`bar.c` a :mod:`pkg.subpkg.bar`.

source: Extension source files
es: Extensión de archivos fuente

source: The second argument to the :class:`~distutils.core.Extension` constructor is a list of source files. Since the Distutils currently only support C, C++, and Objective-C extensions, these are normally C/C++/Objective-C source files. (Be sure to use appropriate extensions to distinguish C++ source files: :file:`.cc` and :file:`.cpp` seem to be recognized by both Unix and Windows compilers.)
es: El segundo argumento para el constructor :class:`~distutils.core.Extension` es una lista de archivos fuente. Dado que Distutils actualmente solo admite extensiones C, C++ y Objective-C, estos normalmente son archivos fuente C/C++/Objective-C. (Asegúrese de usar las extensiones apropiadas para distinguir los archivos fuente de C++ :file:`.cc` y :file:`.cpp` que parecen ser reconocidos por los compiladores de Unix y Windows).

source: However, you can also include SWIG interface (:file:`.i`) files in the list; the :command:`build_ext` command knows how to deal with SWIG extensions: it will run SWIG on the interface file and compile the resulting C/C++ file into your extension.
es: Sin embargo, también puede incluir archivos de interfaz SWIG (:file:`.i`) en la lista; el comando :command:`build_ext` sabe cómo manejar las extensiones SWIG: ejecutará SWIG en el archivo de interfaz y compilará el archivo C/C++ resultante en su extensión.

source: This warning notwithstanding, options to SWIG can be currently passed like this::
es: A pesar de esta advertencia, las opciones para SWIG se pueden pasar actualmente de esta manera:

source: Or on the commandline like this::
es: O en la línea de comandos como esta ::

source: On some platforms, you can include non-source files that are processed by the compiler and included in your extension. Currently, this just means Windows message text (:file:`.mc`) files and resource definition (:file:`.rc`) files for Visual C++. These will be compiled to binary resource (:file:`.res`) files and linked into the executable.
es: En algunas plataformas, puede incluir archivos que no sean de origen procesados por el compilador e incluidos en su extensión. Actualmente, esto solo significa archivos de texto de mensaje de Windows (:file:`.mc`) y archivos de definición de recursos (:file:`.rc`) para Visual C ++. Estos serán compilados en archivos de recursos binarios (:file:`.res`) y enlazados.

source: Preprocessor options
es: Opciones de preprocesador

source: Three optional arguments to :class:`~distutils.core.Extension` will help if you need to specify include directories to search or preprocessor macros to define/undefine: ``include_dirs``, ``define_macros``, and ``undef_macros``.
es: Tres argumentos opcionales para :class:`~distutils.core.Extension` le ayudarán si necesita especificar directorios de inclusión para buscar o preprocesar macros para definir/indefinir: ``include_dirs``, ``define_macros`` y ``undef_macros``.

source: For example, if your extension requires header files in the :file:`include` directory under your distribution root, use the ``include_dirs`` option::
es: Por ejemplo, si su extensión requiere archivos de encabezado en el directorio :file:`include` bajo su raíz de distribución, use la opción ``include_dirs``::

source: You can specify absolute directories there; if you know that your extension will only be built on Unix systems with X11R6 installed to :file:`/usr`, you can get away with ::
es: Puede especificar directorios absolutos allí; si sabe que su extensión solo se construirá en sistemas Unix con X11R6 instalado en :file:`/usr`, puede salirse con ::

source: You should avoid this sort of non-portable usage if you plan to distribute your code: it's probably better to write C code like ::
es: Debería evitar este tipo de uso no portátil si planea distribuir su código: probablemente sea mejor escribir código C como ::

source: If you need to include header files from some other Python extension, you can take advantage of the fact that header files are installed in a consistent way by the Distutils :command:`install_headers` command. For example, the Numerical Python header files are installed (on a standard Unix installation) to :file:`/usr/local/include/python1.5/Numerical`. (The exact location will differ according to your platform and Python installation.) Since the Python include directory---\ :file:`/usr/local/include/python1.5` in this case---is always included in the search path when building Python extensions, the best approach is to write C code like ::
es: Si necesita incluir archivos de encabezado de alguna otra extensión de Python, puede aprovechar el hecho de que los archivos de encabezado se instalan de manera coherente mediante el comando Distutils :command:`install_headers`. Por ejemplo, los archivos de encabezado Python numéricos se instalan (en una instalación estándar de Unix) en :file:`/usr/local/include/python1.5/ Numerical`. (La ubicación exacta diferirá según la plataforma y la instalación de Python). Dado que el directorio de inclusión de Python --- \ :file:`/usr/local/include/python1.5` en este caso --- siempre se incluye en ruta de búsqueda al construir extensiones de Python, el mejor enfoque es escribir código C como ::

source: If you must put the :file:`Numerical` include directory right into your header search path, though, you can find that directory using the Distutils :mod:`distutils.sysconfig` module::
es: Sin embargo, si debe colocar el directorio :file:`Numerical` en la ruta de búsqueda del encabezado, puede encontrar ese directorio utilizando el módulo Distutils :mod:`distutils.sysconfig`::

source: Even though this is quite portable---it will work on any Python installation, regardless of platform---it's probably easier to just write your C code in the sensible way.
es: Aunque esto es bastante portátil, funcionará en cualquier instalación de Python, independientemente de la plataforma, probablemente sea más fácil escribir su código C de manera sensata.

source: You can define and undefine pre-processor macros with the ``define_macros`` and ``undef_macros`` options. ``define_macros`` takes a list of ``(name, value)`` tuples, where ``name`` is the name of the macro to define (a string) and ``value`` is its value: either a string or ``None``. (Defining a macro ``FOO`` to ``None`` is the equivalent of a bare ``#define FOO`` in your C source: with most compilers, this sets ``FOO`` to the string ``1``.) ``undef_macros`` is just a list of macros to undefine.
es: Puede definir y no definir macros de preprocesador con las opciones ``define_macros`` y ``undef_macros``. ``define_macros`` toma una lista de tuplas ``(name, value)``, donde ``name`` es el nombre de la macro a definir (una cadena de caracteres) y ``value`` es su valor: ya sea un cadena de caracteres o ``None``. (Definir una macro ``FOO`` en ``None`` es el equivalente de un simple ``#define FOO`` en su fuente C: con la mayoría de los compiladores, esto establece ``FOO`` en la cadena ``1``.) ``undef_macros`` es solo una lista de macros para indefinir.

source: For example::
es: Por ejemplo::
