Repository: python/python-docs-es
Catalog: distutils/sourcedist.po
Languages: es

source: Creating a Source Distribution
es: Crear una distribución del código fuente

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
es: Este documento se conservará únicamente hasta que la documentación de ``setuptools`` en https://setuptools.readthedocs.io/en/latest/setuptools.html cubra de forma independiente toda la información relevante que actualmente está incluida aquí.

source: As shown in section :ref:`distutils-simple-example`, you use the :command:`sdist` command to create a source distribution. In the simplest case, ::
es: Como se muestra en la sección :ref:`distutils-simple-example`, use el comando :command:`sdist` para crear una distribución de código fuente. En el caso más simple, ::

source: (assuming you haven't specified any :command:`sdist` options in the setup script or config file), :command:`sdist` creates the archive of the default format for the current platform. The default format is a gzip'ed tar file (:file:`.tar.gz`) on Unix, and ZIP file on Windows.
es: (suponiendo que no ha especificado ninguna opción :command:`sdist` en el script de configuración o en el archivo de configuración), :command:`sdist` crea el archivo con el formato predeterminado para la plataforma actual.El formato predeterminado es un archivo tar comprimido con gzip (:file:`.tar.gz`) en Unix, y el archivo ZIP en Windows.

source: You can specify as many formats as you like using the :option:`!--formats` option, for example::
es: Puede especificar tantos formatos como desee usando la opción :option:`!--formats`, por ejemplo::

source: to create a gzipped tarball and a zip file. The available formats are:
es: para crear un *tarball* comprimido y un archivo zip. Los formatos disponibles son:

source: Format
es: Formato

source: Description
es: Descripción

source: Notes
es: Notas

source: zip file (:file:`.zip`)
es: archivo zip (:file:`.zip`)

source: gzip'ed tar file (:file:`.tar.gz`)
es: archivo tar comprimido con gzip (:file:`.tar.gz`)

source: bzip2'ed tar file (:file:`.tar.bz2`)
es: archivo tar comprimido con bzip2 (:file:`.tar.bz2`)

source: xz'ed tar file (:file:`.tar.xz`)
es: archivo tar comprimido con xz (:file:`.tar.xz`)

source: compressed tar file (:file:`.tar.Z`)
es: archivo tar comprimido (:file:`.tar.Z`)

source: tar file (:file:`.tar`)
es: archivo tar (:file:`.tar`)

source: Added support for the ``xztar`` format.
es: Soporte agregado para el formato ``xztar``.

source: Notes:
es: Notas:

source: default on Windows
es: por defecto en Windows

source: default on Unix
es: por defecto en Unix

source: requires either external :program:`zip` utility or :mod:`zipfile` module (part of the standard Python library since Python 1.6)
es: se requiere o bien un programa externo :program:`zip` o el módulo :mod:`zipfile` (parte del estándar de la biblioteca de Python desde Python 1.6)

source: requires the :program:`compress` program. Notice that this format is now pending for deprecation and will be removed in the future versions of Python.
es: requiere el programa :program:`compress`. Tenga en cuenta que ahora este formato está deprecado y será eliminado en las futuras versiones de Python.

source: When using any ``tar`` format (``gztar``, ``bztar``, ``xztar``, ``ztar`` or ``tar``), under Unix you can specify the ``owner`` and ``group`` names that will be set for each member of the archive.
es: Al usar cualquier formato ``tar`` (``gztar``, ``bztar``, ``xztar``, ``ztar`` o ``tar``), en Unix se puede especificar el nombre del ``propietario`` y ``grupo`` que se establecerá para cada uno de los miembros del archivo.

source: For example, if you want all files of the archive to be owned by root::
es: Por ejemplo, si quiere que todos los archivos pertenezcan al usuario root::

source: Specifying the files to distribute
es: Especificar los archivos a distribuir

source: If you don't supply an explicit list of files (or instructions on how to generate one), the :command:`sdist` command puts a minimal default set into the source distribution:
es: Si no se proporciona una lista explícita de los archivos (o instrucciones sobre cómo generar uno), el comando :command:`sdist` pone un conjunto mínimo por defecto en la distribución de código fuente:

source: all Python source files implied by the ``py_modules`` and ``packages`` options
es: todos los archivos de código fuente de Python implícitos por las opciones ``py_modules`` y ``packages``

source: all C source files mentioned in the ``ext_modules`` or ``libraries`` options
es: todos los archivos de código fuente de C mencionados en las opciones ``ext_modules`` o ``libraries``

source: scripts identified by the ``scripts`` option See :ref:`distutils-installing-scripts`.
es: *scripts* identificados por la opción ``scripts`` Ver :ref:`distutils-installing-scripts`.

source: anything that looks like a test script: :file:`test/test\*.py` (currently, the Distutils don't do anything with test scripts except include them in source distributions, but in the future there will be a standard for testing Python module distributions)
es: cualquier archivo que parezca un *script* de pruebas: :file:`test/test\*.py` (actualmente, Distutils no hace nada con *scripts* de prueba, solo los incluye en la distribución, pero en el futuro habrá un estándar para realizar pruebas de los módulos de Python en las distribuciones)

source: Any of the standard README files (:file:`README`, :file:`README.txt`, or :file:`README.rst`), :file:`setup.py` (or whatever you called your setup script), and :file:`setup.cfg`.
es: Cualquiera de los archivos estándar LÉAME (:file:`README`, :file:`README.txt`, o :file:`README.rst`), :file:`setup.py` (o cualquier nombre que le haya puesto al script de configuración), y :file:`setup.cfg`.

source: all files that matches the ``package_data`` metadata. See :ref:`distutils-installing-package-data`.
es: todos los archivos que coincidan con los metadatos ``package_data``. Vea :ref:`distutils-installing-package-data`.

source: all files that matches the ``data_files`` metadata. See :ref:`distutils-additional-files`.
es: todos los archivos que coincidan con los metadatos ``data_files``. Vea :ref:`distutils-additional-files`.

source: Sometimes this is enough, but usually you will want to specify additional files to distribute. The typical way to do this is to write a *manifest template*, called :file:`MANIFEST.in` by default. The manifest template is just a list of instructions for how to generate your manifest file, :file:`MANIFEST`, which is the exact list of files to include in your source distribution. The :command:`sdist` command processes this template and generates a manifest based on its instructions and what it finds in the filesystem.
es: A veces esto es suficiente, pero por lo general, va a querer especificar archivos adicionales a distribuir. La forma típica de hacer esto es escribir una *plantilla de manifiesto*, por defecto con el nombre :file:`MANIFEST.in`. La plantilla de manifiesto es sólo una lista de instrucciones para generar el archivo de manifiesto, :file:`MANIFEST`, el cual es la lista exacta de archivos a incluir en la distribución de código fuente. El comando :command:`sdist` procesa esta plantilla y genera un manifiesto basado en las instrucciones y en lo que encuentra en el sistema de ficheros.

source: If you prefer to roll your own manifest file, the format is simple: one filename per line, regular files (or symlinks to them) only. If you do supply your own :file:`MANIFEST`, you must specify everything: the default set of files described above does not apply in this case.
es: Si prefiere crear su propio archivo de manifiesto, el formato es simple: un nombre de archivo por línea, solamente archivos normales (o enlaces simbólicos a ellos). Si hace su propio :file:`MANIFEST`, debe especificar todo: el conjunto predeterminado de los archivos descritos más arriba no se aplica en este caso.

source: An existing generated :file:`MANIFEST` will be regenerated without :command:`sdist` comparing its modification time to the one of :file:`MANIFEST.in` or :file:`setup.py`.
es: Un :file:`MANIFEST` ya existente y generado, será regenerado sin :command:`sdist` comparando su tiempo de modificación con el de :file:`MANIFEST.in` o :file:`setup.py`.

source: :file:`MANIFEST` files start with a comment indicating they are generated. Files without this comment are not overwritten or removed.
es: :file:`MANIFEST` los archivos comienzan con un comentario indicando que son generados. Los archivos que no tengan este comentario no se sobrescriben ni eliminan.

source: :command:`sdist` will read a :file:`MANIFEST` file if no :file:`MANIFEST.in` exists, like it used to do.
es: :command:`sdist` leerá un archivo :file:`MANIFEST` si no existe el archivo :file:`MANIFEST.in`, como solía hacer.

source: :file:`README.rst` is now included in the list of distutils standard READMEs.
es: :file:`README.rst` ahora está incluido en la lista de LEAMEs estándar de distutils.

source: The manifest template has one command per line, where each command specifies a set of files to include or exclude from the source distribution. For an example, again we turn to the Distutils' own manifest template:
es: La plantilla de manifiesto tiene un comando por línea, donde cada comando especifica un conjunto de archivos para incluir o excluir de la distribución de código fuente. Para un ejemplo, de nuevo nos dirigimos a la Distutils la propia plantilla de manifiesto:

source: The meanings should be fairly clear: include all files in the distribution root matching :file:`\*.txt`, all files anywhere under the :file:`examples` directory matching :file:`\*.txt` or :file:`\*.py`, and exclude all directories matching :file:`examples/sample?/build`. All of this is done *after* the standard include set, so you can exclude files from the standard set with explicit instructions in the manifest template. (Or, you can use the :option:`!--no-defaults` option to disable the standard set entirely.) There are several other commands available in the manifest template mini-language; see section :ref:`sdist-cmd`.
es: Los significados debe ser bastante claros: incluya todos los archivos en la raíz de la distribución, que coincidan con :file:`\*.txt`, todos los archivos dentro del directorio :file:`examples` que coincidan con :file:`\*.txt` o :file:`\*.py`, y excluir todos los directorios que coincidan con :file:`examples/sample?/build`. Todo esto se hace *después* de seguir el conjunto estándar de inclusión, por lo que puede excluir archivos del conjunto establecido con instrucciones explícitas en la plantilla del manifiesto. (O bien, puede utilizar la opción :option:`!--no-defaults` para desactivar el conjunto estándar completo.) Hay varios otros comandos disponibles en el mini-lenguaje de la plantilla de manifiesto; vea la sección :ref:`sdist-cmd`.

source: The order of commands in the manifest template matters: initially, we have the list of default files as described above, and each command in the template adds to or removes from that list of files. Once we have fully processed the manifest template, we remove files that should not be included in the source distribution:
es: El orden de los comandos en la plantilla de manifiesto es importante: inicialmente, tenemos la lista de archivos predeterminados como se describió anteriormente, y cada comando en la plantilla agrega o elimina de esa lista de archivos. Una vez que hemos procesado completamente la plantilla del manifiesto, eliminamos los archivos que no deberían incluirse en la distribución del código fuente:

source: all files in the Distutils "build" tree (default :file:`build/`)
es: todos los archivos en el árbol "build" de Distutils (por defecto :file:`build/`)

source: all files in directories named :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` or :file:`_darcs`
es: todos los archivos en directorios nombrados :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` o :file:`_darcs`

source: Now we have our complete list of files, which is written to the manifest for future reference, and then used to build the source distribution archive(s).
es: Ahora tenemos la lista completa de archivos, que está escrita en el manifiesto para una futura referencia, y luego se utilizará para construir los archivos de distribución de código fuente.

source: You can disable the default set of included files with the :option:`!--no-defaults` option, and you can disable the standard exclude set with :option:`!--no-prune`.
es: Puede deshabilitar el conjunto predeterminado de archivos incluidos con la opción :option:`!--no-defaults`, y puede deshabilitar el conjunto de exclusión estándar con :option:`!--no-prune`.

source: Following the Distutils' own manifest template, let's trace how the :command:`sdist` command builds the list of files to include in the Distutils source distribution:
es: Siguiendo la propia plantilla de manifiesto de Distutils, rastreemos cómo el comando :command:`sdist` crea la lista de archivos para incluir en la distribución fuente de Distutils:

source: include all Python source files in the :file:`distutils` and :file:`distutils/command` subdirectories (because packages corresponding to those two directories were mentioned in the ``packages`` option in the setup script---see section :ref:`setup-script`)
es: incluir todos los archivos fuente de Python en los sub-directorios :file:`distutils` y :file:`distutils/command` (porque los paquetes correspondientes a esos dos directorios se mencionaron en la opción ``packages`` en el script de configuración ---vea la sección :ref:`setup-script`)

source: include :file:`README.txt`, :file:`setup.py`, and :file:`setup.cfg` (standard files)
es: incluir:file:`README.txt`, :file:`setup.py`, y :file:`setup.cfg` (archivos estándar)

source: include :file:`test/test\*.py` (standard files)
es: incluir :file:`test/test\*.py` (archivos estándar)

source: include :file:`\*.txt` in the distribution root (this will find :file:`README.txt` a second time, but such redundancies are weeded out later)
es: incluir :file:`\*.txt` en la raíz de la distribución(esto encontrará :file:`README.txt` por segunda vez, pero tales redundancias se eliminan más tarde)

source: include anything matching :file:`\*.txt` or :file:`\*.py` in the sub-tree under :file:`examples`,
es: incluir cualquier archivo que coincida con :file:`\*.txt` or :file:`\*.py` en el subárbol dentro de :file:`examples`,

source: exclude all files in the sub-trees starting at directories matching :file:`examples/sample?/build`\ ---this may exclude files included by the previous two steps, so it's important that the ``prune`` command in the manifest template comes after the ``recursive-include`` command
es: excluir todos los archivos en los subárboles que comiencen en los directorios que coincidan con :file:`examples/sample?/build`\ ---esto puede excluir los archivos incluidos en los dos pasos anteriores, por lo que es importante que el comando ``prune`` en la plantilla de manifiesto vaya después del comando ``recursive-include``

source: exclude the entire :file:`build` tree, and any :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` and :file:`_darcs` directories
es: excluir todo el árbol :file:`build` y cualquier directorio :file:`RCS`, :file:`CVS`, :file:`.svn`, :file:`.hg`, :file:`.git`, :file:`.bzr` y :file:`_darcs`

source: Just like in the setup script, file and directory names in the manifest template should always be slash-separated; the Distutils will take care of converting them to the standard representation on your platform. That way, the manifest template is portable across operating systems.
es: Al igual que en el script de configuración, los nombres de archivos y directorios en la plantilla de manifiesto siempre deben estar separados por barras; Distutils se encargará de convertirlos a la representación estándar en su plataforma. De esa manera, la plantilla de manifiesto es portable en todos los sistemas operativos.

source: Manifest-related options
es: Opciones relacionadas con el manifesto

source: The normal course of operations for the :command:`sdist` command is as follows:
es: El curso normal de operaciones para el comando :command:`sdist` es el siguiente:

source: if the manifest file (:file:`MANIFEST` by default) exists and the first line does not have a comment indicating it is generated from :file:`MANIFEST.in`, then it is used as is, unaltered
es: si el archivo de manifiesto (:file:`MANIFEST` por defecto) existe y la primera línea no tiene un comentario que indique que se genera a partir de :file:`MANIFEST.in`, entonces se usa como está, sin alteraciones

source: if the manifest file doesn't exist or has been previously automatically generated, read :file:`MANIFEST.in` and create the manifest
es: si el archivo de manifiesto no existe o si se ha generado previamente de forma automática, lea :file:`MANIFEST.in` y cree el manifiesto

source: if neither :file:`MANIFEST` nor :file:`MANIFEST.in` exist, create a manifest with just the default file set
es: si no existe :file:`MANIFEST` ni :file:`MANIFEST.in`, cree un manifiesto solamente con el conjunto de archivos predeterminado

source: use the list of files now in :file:`MANIFEST` (either just generated or read in) to create the source distribution archive(s)
es: use la lista de archivos, que ahora están en :file:`MANIFEST` (ya sea generado o leído) para crear los archivos de distribución de código fuente

source: There are a couple of options that modify this behaviour. First, use the :option:`!--no-defaults` and :option:`!--no-prune` to disable the standard "include" and "exclude" sets.
es: Existen un par de opciones que modifican este comportamiento. Primero, use :option:`!--no-defaults` y :option:`!--no-prune` para desactivar los conjuntos estándar "include" y "exclude".

source: Second, you might just want to (re)generate the manifest, but not create a source distribution::
es: Segundo, quizá quiera (re)generar el manifesto, pero no crear la distribución del código fuente::

source: :option:`!-o` is a shortcut for :option:`!--manifest-only`.
es: :option:`!-o` es una forma corta de :option:`!--manifest-only`.
