Repository: python/python-docs-es
Catalog: install/index.po
Languages: es

source: Installing Python Modules (Legacy version)
es: Instalación de Módulos de Python (versión antigua)

source: Author
es: Autor

source: The up to date module installation documentation. For regular Python usage, you almost certainly want that document rather than this one.
es: La documentación actualizada de instalación de módulos. Para el uso regular de Python, es casi seguro que desee ese documento en lugar de este.

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
es: Este documento es mantenido hasta que la documentación de ``setuptool`` en https://setuptools.readthedocs.io/en/latest/setuptools.html cubra independientemente toda la información relevante que se incluye aquí.

source: This guide only covers the basic tools for building and distributing extensions that are provided as part of this version of Python. Third party tools offer easier to use and more secure alternatives. Refer to the `quick recommendations section <https://packaging.python.org/guides/tool-recommendations/>`__ in the Python Packaging User Guide for more information.
es: Esta guía solamente cubre las herramientas básicas para construir y distribuir extensiones que se proporcionan como parte de esta versión de Python. Herramientas de terceros ofrecen alternativas más sencillas y seguras . Consulte la `sección de recomendaciones <https://packaging.python.org/guides/tool-recommendations/>`__ en la Guía de Usuario de Empaquetamiento de Python para mayor detalle.

source: Introduction
es: Introducción

source: In Python 2.0, the ``distutils`` API was first added to the standard library. This provided Linux distro maintainers with a standard way of converting Python projects into Linux distro packages, and system administrators with a standard way of installing them directly onto target systems.
es: En Python 2.0, la API ``distutils`` fue el primer módulo en ser agregado a la biblioteca estándar. Esto proporcionó a los mantenedores de distribución de Linux una forma estándar de convertir proyectos de Python en paquetes de distribución de Linux, y a los administradores de sistemas con una forma estándar de instalarlos directamente en los sistemas de destino.

source: In the many years since Python 2.0 was released, tightly coupling the build system and package installer to the language runtime release cycle has turned out to be problematic, and it is now recommended that projects use the ``pip`` package installer and the ``setuptools`` build system, rather than using ``distutils`` directly.
es: En los muchos años transcurridos desde el lanzamiento de Python 2.0, el acoplamiento estrecho del sistema de compilación y el instalador del paquete al ciclo de lanzamiento del lenguaje ha sido un problema, ahora se recomienda que los proyectos utilicen el instalador del paquete ``pip`` y el sistema de compilación ``setuptools``, en lugar de utilizar directamente ``distutils``.

source: See :ref:`installing-index` and :ref:`distributing-index` for more details.
es: Ver :ref:`installing-index` y :ref:`distributing-index` para mayor detalles.

source: This legacy documentation is being retained only until we're confident that the ``setuptools`` documentation covers everything needed.
es: Esta documentación heredada se conservará hasta que se esté seguro que la documentación de ``setuptools`` cubre todo lo necesario.

source: Distutils based source distributions
es: Distutils basado la distribuciones de la fuente

source: If you download a module source distribution, you can tell pretty quickly if it was packaged and distributed in the standard way, i.e. using the Distutils. First, the distribution's name and version number will be featured prominently in the name of the downloaded archive, e.g. :file:`foo-1.0.tar.gz` or :file:`widget-0.9.7.zip`. Next, the archive will unpack into a similarly-named directory: :file:`foo-1.0` or :file:`widget-0.9.7`. Additionally, the distribution will contain a setup script :file:`setup.py`, and a file named :file:`README.txt` or possibly just :file:`README`, which should explain that building and installing the module distribution is a simple matter of running one command from a terminal::
es: Si tu descargas un módulo, puede ser mucho más rápido si el módulo fue empaquetado y distribuido de una manera estándar, por ejemplo usando Distutils. Primero, el nombre y la versión de la distribución aparecerá en el nombre del archivo a descargar, por ejemplo: :file:`foo-1.0.tar.gz` or :file:`widget-0.9.7.zip`. A continuación, el archivo se descomprimirá en un directorio con un nombre similar: :file:`foo-1.0` or :file:`widget-0.9.7`. Además, la distribución contendrá un script de configuración :file:`setup.py`, y un archivo llamado :file:`README.txt` o simplemente llamado :file:`README`, que debería explicar cómo construir e instalar la distribución del módulo con una serie de comandos de terminal::

source: For Windows, this command should be run from a command prompt window (:menuselection:`Start --> Accessories`)::
es: Para Windows, este comando debería ejecutarse desde la linea de comandos.(:menuselection:`Start --> Accessories`)::

source: If all these things are true, then you already know how to build and install the modules you've just downloaded: Run the command above. Unless you need to install things in a non-standard way or customize the build process, you don't really need this manual. Or rather, the above command is everything you need to get out of this manual.
es: Si todo es correcto, entonces ya sabe cómo construir e instalar los módulos que acaba de descargar: ejecute el comando anterior. Al menos que se necesite instalar cosas de una manera no estándar o personalizar el proceso de compilación, no necesitará hacer esto de manera manual. Más bien, el comando anterior es todo lo que necesita obtener de este manual.

source: Standard Build and Install
es: Construcción e instalación estándar

source: As described in section :ref:`inst-new-standard`, building and installing a module distribution using the Distutils is usually one simple command to run from a terminal::
es: Como se describe en la sección :ref:`inst-new-standard`, construir e instalar una distribución de módulos usando Distutils suele ser un comando simple para ejecutar desde un terminal::

source: Platform variations
es: Variaciones de acuerdo a la plataforma

source: You should always run the setup command from the distribution root directory, i.e. the top-level subdirectory that the module source distribution unpacks into. For example, if you've just downloaded a module source distribution :file:`foo-1.0.tar.gz` onto a Unix system, the normal thing to do is::
es: Siempre debe ejecutar el comando de configuración desde el directorio raíz de distribución, por ejemplo el subdirectorio de nivel superior en el que se descomprime la distribución fuente del módulo. Por ejemplo, si acaba de descargar una distribución fuente del módulo :file:`foo-1.0.tar.gz` en un sistema Unix, lo normal es::

source: On Windows, you'd probably download :file:`foo-1.0.zip`. If you downloaded the archive file to :file:`C:\\Temp`, then it would unpack into :file:`C:\\Temp\\foo-1.0`; you can use either an archive manipulator with a graphical user interface (such as WinZip) or a command-line tool (such as :program:`unzip` or :program:`pkunzip`) to unpack the archive. Then, open a command prompt window and run::
es: En Windows, probablemente se descargaría :file:`foo-1.0.zip`. Si descargó el archivo en :file:`C:\Temp`, se descomprimirá en :file:`C:\Temp\foo-1.0`; puede usar un manipulador de archivo con una interfaz gráfica de usuario (como WinZip) o una herramienta de línea de comandos (como :program:`unzip` o :program:`pkunzip`) para descomprimir el archivo. Luego, abra una ventana de símbolo del sistema y ejecute::

source: Splitting the job up
es: Dividiendo el trabajo

source: Running ``setup.py install`` builds and installs all modules in one run. If you prefer to work incrementally---especially useful if you want to customize the build process, or if things are going wrong---you can use the setup script to do one thing at a time. This is particularly helpful when the build and install will be done by different users---for example, you might want to build a module distribution and hand it off to a system administrator for installation (or do it yourself, with super-user privileges).
es: La ejecución de ``setup.py install`` compila e instala todos los módulos en una sola ejecución. Si prefiere trabajar de forma incremental, especialmente útil si desea personalizar el proceso de compilación, o si las cosas van mal, puede usar el script de configuración para hacer una cosa a la vez. Esto es particularmente útil cuando la compilación y la instalación serán realizadas por diferentes usuarios, por ejemplo, es posible que desee compilar una distribución de módulos y entregarla a un administrador del sistema para su instalación (o hágalo usted mismo, con privilegios de superusuario )

source: For example, you can build everything in one step, and then install everything in a second step, by invoking the setup script twice::
es: Por ejemplo, puede compilar todo en un solo paso y luego instalarlo en un segundo paso, invocando el script de configuración dos veces::

source: If you do this, you will notice that running the :command:`install` command first runs the :command:`build` command, which---in this case---quickly notices that it has nothing to do, since everything in the :file:`build` directory is up-to-date.
es: Si hace esto, notará que al ejecutar el comando :command:`install` primero ejecuta el comando :command:`build`, que --- en este caso --- rápidamente se da cuenta de que no tiene nada que hacer, ya que todo en la carpeta :file:`build` está actualizado.

source: You may not need this ability to break things down often if all you do is install modules downloaded off the 'net, but it's very handy for more advanced tasks. If you get into distributing your own Python modules and extensions, you'll run lots of individual Distutils commands on their own.
es: Es posible que no necesite esta capacidad de desglosar las cosas si todo lo que hace es instalar módulos descargados de la red, pero es muy útil para tareas más avanzadas. Si llega a distribuir sus propios módulos y extensiones de Python, ejecutará muchos comandos Distutils individuales por su cuenta.

source: How building works
es: Como funciona la construcción

source: As implied above, the :command:`build` command is responsible for putting the files to install into a *build directory*. By default, this is :file:`build` under the distribution root; if you're excessively concerned with speed, or want to keep the source tree pristine, you can change the build directory with the :option:`!--build-base` option. For example::
es: Como se indicó anteriormente, el comando :command:`build` es responsable de colocar los archivos para instalar en un *directorio de compilación*. Por defecto, esto es :file:`build` bajo la raíz de distribución; si está demasiado preocupado por la velocidad, o si desea mantener el árbol de origen prístino, puede cambiar el directorio de compilación con la opción :option:`!--build-base`. Por ejemplo::

source: (Or you could do this permanently with a directive in your system or personal Distutils configuration file; see section :ref:`inst-config-files`.) Normally, this isn't necessary.
es: (O puede hacer esto permanentemente con una directiva en su sistema o archivo de configuración personal de Distutils; ver la sección :ref:`inst-config-files`.) Normalmente, esto no es necesario.

source: The default layout for the build tree is as follows::
es: El diseño predeterminado para el árbol de compilación es el siguiente:

source: where ``<plat>`` expands to a brief description of the current OS/hardware platform and Python version. The first form, with just a :file:`lib` directory, is used for "pure module distributions"---that is, module distributions that include only pure Python modules. If a module distribution contains any extensions (modules written in C/C++), then the second form, with two ``<plat>`` directories, is used. In that case, the :file:`temp.{plat}` directory holds temporary files generated by the compile/link process that don't actually get installed. In either case, the :file:`lib` (or :file:`lib.{plat}`) directory contains all Python modules (pure Python and extensions) that will be installed.
es: donde ``<plat>`` se expande a una breve descripción de la plataforma actual de SO/hardware y la versión de Python. La primera forma, con solo un directorio :file:`lib`, se usa para "distribuciones de módulos puros"--- es decir, distribuciones de módulos que incluyen solo módulos puros de Python. Si la distribución de un módulo contiene alguna extensión (módulos escritos en C/C ++), se utiliza la segunda forma, con dos directorios ``<plat>``. En ese caso, el directorio :file:`temp.{plat}` contiene archivos temporales generados por el proceso de compilación/enlace que en realidad no se instalan. En cualquier caso, el directorio :file:`lib` (o :file:`lib.{plat}`) contiene todos los módulos de Python (Python puro y extensiones) que se instalarán.

source: In the future, more directories will be added to handle Python scripts, documentation, binary executables, and whatever else is needed to handle the job of installing Python modules and applications.
es: En el futuro, se agregarán más directorios para manejar scripts de Python, documentación, ejecutables binarios y todo lo que sea necesario para manejar el trabajo de instalación de módulos y aplicaciones de Python.

source: How installation works
es: Como funciona la instalación

source: After the :command:`build` command runs (whether you run it explicitly, or the :command:`install` command does it for you), the work of the :command:`install` command is relatively simple: all it has to do is copy everything under :file:`build/lib` (or :file:`build/lib.{plat}`) to your chosen installation directory.
es: Después de que se ejecute el comando :command:`build` (ya sea que lo ejecute explícitamente, o el comando :command:`install` lo hace por usted), el trabajo del comando :command:`install` es relativamente simple: todo lo que tiene hacer es copiar todo lo que se encuentra en el directorio :file:`build/lib` (o :file:`build/lib.{plat}`) en el directorio de instalación elegido.

source: If you don't choose an installation directory---i.e., if you just run ``setup.py install``\ ---then the :command:`install` command installs to the standard location for third-party Python modules. This location varies by platform and by how you built/installed Python itself. On Unix (and Mac OS X, which is also Unix-based), it also depends on whether the module distribution being installed is pure Python or contains extensions ("non-pure"):
es: Si no se elige un directorio de instalación---es decir, si solo ejecuta ``setup.py install``\---entonces el comando :command:`install` se instala en la ubicación estándar para módulos Python de terceros . Esta ubicación varía según la plataforma y la forma en la que se compiló/instaló Python. En Unix (y Mac OS X, que también está basado en Unix), depende de si la distribución del módulo que se está instalando es Python puro o contiene extensiones ("no puro"):

source: Platform
es: Plataforma

source: Standard installation location
es: Lugar de instalación estándar

source: Default value
es: Valor por defecto

source: Notes
es: Notas

source: Unix (pure)
es: Unix (puro)

source: Unix (non-pure)
es: Unix (no puro)

source: Notes:
es: Notas:

source: Most Linux distributions include Python as a standard part of the system, so :file:`{prefix}` and :file:`{exec-prefix}` are usually both :file:`/usr` on Linux. If you build Python yourself on Linux (or any Unix-like system), the default :file:`{prefix}` and :file:`{exec-prefix}` are :file:`/usr/local`.
es: La mayoría de las distribuciones de Linux incluyen Python como una parte estándar del sistema, por lo que :file:`{prefix}` y :file:`{exec-prefix}` generalmente son ambos: file: `/usr` en Linux. Si construye Python usted mismo en Linux (o en cualquier sistema similar a Unix), el valor predeterminado :file:`{prefix}` y :file:`{exec-prefix}` son :file:`/usr /local`.

source: The default installation directory on Windows was :file:`C:\\Program Files\\Python` under Python 1.6a1, 1.5.2, and earlier.
es: El directorio de instalación predeterminado en Windows era :file:`C:\\ Archivos de programa \\Python` en Python 1.6a1, 1.5.2 y versiones anteriores.

source: :file:`{prefix}` and :file:`{exec-prefix}` stand for the directories that Python is installed to, and where it finds its libraries at run-time. They are always the same under Windows, and very often the same under Unix and Mac OS X. You can find out what your Python installation uses for :file:`{prefix}` and :file:`{exec-prefix}` by running Python in interactive mode and typing a few simple commands. Under Unix, just type ``python`` at the shell prompt. Under Windows, choose :menuselection:`Start --> Programs --> Python X.Y --> Python (command line)`. Once the interpreter is started, you type Python code at the prompt. For example, on my Linux system, I type the three Python statements shown below, and get the output as shown, to find out my :file:`{prefix}` and :file:`{exec-prefix}`:
es: :file:`{prefix}` y :file:`{exec-prefix}` representan los directorios en los que está instalado Python y donde encuentra sus bibliotecas en tiempo de ejecución. Siempre son los mismos en Windows, y muy a menudo los mismos en Unix y Mac OS X. Puede averiguar qué utiliza el Python que tiene instalado para :file:`{prefix}` y :file:`{exec-prefix}` ejecutando Python en modo interactivo y escribiendo algunos comandos simples. En Unix, simplemente escriba ``python`` en el indicador de comandos de la shell. En Windows, elija :menuselection:`Inicio->Programas->Python X.Y->Python (línea de comando)`. Una vez que se inicia el intérprete, escriba el código Python en el indicador. Por ejemplo, si en mi sistema Linux, escribo las tres declaraciones de Python que se muestran a continuación, y con ello obtengo el resultado como se muestra a continuación. Para averiguar mi :file:`{prefijo}` y :file:`{prefijo-exec}`:

source: A few other placeholders are used in this document: :file:`{X.Y}` stands for the version of Python, for example ``3.2``; :file:`{abiflags}` will be replaced by the value of :data:`sys.abiflags` or the empty string for platforms which don't define ABI flags; :file:`{distname}` will be replaced by the name of the module distribution being installed. Dots and capitalization are important in the paths; for example, a value that uses ``python3.2`` on UNIX will typically use ``Python32`` on Windows.
es: En este documento se utilizan algunos otros marcadores de posición: :file:`{X.Y}` representa la versión de Python, por ejemplo, ``3.2``; :file:`{abiflags}` será reemplazado por el valor de :data:`sys.abiflags` o la cadena vacía para plataformas que no definen flags ABI; :file:`{distname}` será reemplazado por el nombre de la distribución del módulo que se está instalando. Los puntos y las mayúsculas son importantes en los las direcciones; por ejemplo, un valor que usa ``python3.2`` en UNIX generalmente usará ``Python32`` en Windows.

source: If you don't want to install modules to the standard location, or if you don't have permission to write there, then you need to read about alternate installations in section :ref:`inst-alt-install`. If you want to customize your installation directories more heavily, see section :ref:`inst-custom-install` on custom installations.
es: Si no desea instalar módulos en la ubicación estándar, o si no tiene permiso para escribir allí, debe leer acerca de las instalaciones alternativas en la sección :ref:`inst-alt-install`. Si desea personalizar más sus directorios de instalación, consulte la sección :ref:`inst-custom-install` en instalaciones personalizadas.

source: Alternate Installation
es: Instalación alternativa

source: Often, it is necessary or desirable to install modules to a location other than the standard location for third-party Python modules. For example, on a Unix system you might not have permission to write to the standard third-party module directory. Or you might wish to try out a module before making it a standard part of your local Python installation. This is especially true when upgrading a distribution already present: you want to make sure your existing base of scripts still works with the new version before actually upgrading.
es: A menudo, es necesario o deseable instalar módulos en una ubicación distinta de la ubicación estándar para módulos Python de terceros. Por ejemplo, en un sistema Unix, es posible que no tenga permiso para escribir en el directorio estándar de módulos de terceros. O quizás desee probar un módulo antes de convertirlo en una parte estándar de su instalación local de Python. Esto es especialmente cierto cuando se actualiza una distribución ya presente: desea asegurarse de que su base de scripts existente todavía funcione con la nueva versión antes de actualizar realmente.

source: The Distutils :command:`install` command is designed to make installing module distributions to an alternate location simple and painless. The basic idea is that you supply a base directory for the installation, and the :command:`install` command picks a set of directories (called an *installation scheme*) under this base directory in which to install files. The details differ across platforms, so read whichever of the following sections applies to you.
es: El comando Distutils :command:`install` está diseñado para hacer que la instalación de distribuciones de módulos en una ubicación alternativa sea simple e indolora. La idea básica es que proporcione un directorio base para la instalación, y el comando :command:`install` selecciona un conjunto de directorios (llamado *esquema de instalación*) en este directorio base en el que instalar los archivos. Los detalles difieren entre plataformas, por lo tanto, lea la sección que corresponda a usted.

source: Note that the various alternate installation schemes are mutually exclusive: you can pass ``--user``, or ``--home``, or ``--prefix`` and ``--exec-prefix``, or ``--install-base`` and ``--install-platbase``, but you can't mix from these groups.
es: Tenga en cuenta que los diversos esquemas de instalación alternativos son mutuamente excluyentes: se le puede pasar ``--user``, o ``--home``, o ``--prefix`` y ``--exec-prefix``, o ``--install-base`` y ``--install-platbase``, pero no puede mezclar desde estos grupos.

source: Alternate installation: the user scheme
es: Instalación alternativa: el esquema de usuario

source: Files will be installed into subdirectories of :data:`site.USER_BASE` (written as :file:`{userbase}` hereafter). This scheme installs pure Python modules and extension modules in the same location (also known as :data:`site.USER_SITE`). Here are the values for UNIX, including Mac OS X:
es: Los archivos se instalarán en subdirectorios de :data:`site.USER_BASE` (escrito como :file:`{userbase}` en adelante). Este esquema instala módulos Python puros y módulos de extensión en la misma ubicación (también conocida como :data:`site.USER_SITE`). Estos son los valores para UNIX, incluido Mac OS X:

source: Type of file
es: Tipo de archivo

source: Installation directory
es: Directorio de instalación

source: modules
es: módulos

source: data
es: dato

source: C headers
es: Cabeceras C

source: And here are the values used on Windows:
es: Y aquí están los valores usados en Windows:
