Repository: python/python-docs-es
Catalog: install/index.po
Languages: es

source: The advantage of using this scheme compared to the other ones described below is that the user site-packages directory is under normal conditions always included in :data:`sys.path` (see :mod:`site` for more information), which means that there is no additional step to perform after running the :file:`setup.py` script to finalize the installation.
es: La ventaja de usar este esquema en comparación con los otros descritos a continuación es que el directorio de paquetes de sitio del usuario está en condiciones normales siempre incluido en :data:`sys.path` (ver :mod:`site` para más información), que significa que no hay que realizar ningún paso adicional después de ejecutar el script :file:`setup.py` para finalizar la instalación.

source: The :command:`build_ext` command also has a ``--user`` option to add :file:`{userbase}/include` to the compiler search path for header files and :file:`{userbase}/lib` to the compiler search path for libraries as well as to the runtime search path for shared C libraries (rpath).
es: El comando :command:`build_ext` también tiene una opción ``--user`` para agregar :file:`{userbase}/include` a la ruta de búsqueda del compilador para archivos de encabezado y :file:`{userbase}/lib` a la ruta de búsqueda del compilador para bibliotecas, así como a la ruta de búsqueda de tiempo de ejecución para bibliotecas C compartidas (rpath).

source: Alternate installation: the home scheme
es: Instalación alternativa: el esquema de la casa

source: The idea behind the "home scheme" is that you build and maintain a personal stash of Python modules. This scheme's name is derived from the idea of a "home" directory on Unix, since it's not unusual for a Unix user to make their home directory have a layout similar to :file:`/usr/` or :file:`/usr/local/`. This scheme can be used by anyone, regardless of the operating system they are installing for.
es: La idea detrás del "esquema de inicio" es crear y mantener una reserva personal de módulos Python. El nombre de este esquema se deriva de la idea de un directorio "de inicio" en Unix, ya que no es inusual que un usuario de Unix haga que su directorio de inicio tenga un diseño similar a :file:`/usr/` o :file:`/usr/local/`. Cualquiera puede utilizar este esquema, independientemente del sistema operativo para el que se esté instalando.

source: Installing a new module distribution is as simple as ::
es: Instalar un nuevo módulo de distribución es tan simple como::

source: where you can supply any directory you like for the :option:`!--home` option. On Unix, lazy typists can just type a tilde (``~``); the :command:`install` command will expand this to your home directory::
es: dónde se puede suministrar cualquier directorio que desee para la opción :option:`!-inicio`. En Unix, los mecanógrafos perezosos pueden simplemente escribir una tilde (``~``); el comando :command:`install` expandirá esto a su directorio de inicio::

source: To make Python find the distributions installed with this scheme, you may have to :ref:`modify Python's search path <inst-search-path>` or edit :mod:`sitecustomize` (see :mod:`site`) to call :func:`site.addsitedir` or edit :data:`sys.path`.
es: Para hacer que Python encuentre las distribuciones instaladas con este esquema, puede que tenga que :ref:`modificar la ruta de búsqueda de Python <inst-search-path>` o editar :mod:`sitecustomize` (ver :mod:`site`) para llamar :func:`site.addsitedir` o edit :data:`sys.path`.

source: The :option:`!--home` option defines the installation base directory. Files are installed to the following directories under the installation base as follows:
es: La opción :option:`!-inicio` define el directorio base de instalación. Los archivos se instalan en los siguientes directorios bajo la base de instalación de la siguiente manera:

source: (Mentally replace slashes with backslashes if you're on Windows.)
es: (Reemplace mentalmente las barras diagonales con barras diagonales inversas si está en Windows.)

source: Alternate installation: Unix (the prefix scheme)
es: Instalación alternativa: Unix (el esquema de prefijo)

source: The "prefix scheme" is useful when you wish to use one Python installation to perform the build/install (i.e., to run the setup script), but install modules into the third-party module directory of a different Python installation (or something that looks like a different Python installation). If this sounds a trifle unusual, it is---that's why the user and home schemes come before. However, there are at least two known cases where the prefix scheme will be useful.
es: El "esquema de prefijo" es útil cuando desea utilizar una instalación de Python para realizar la compilación / instalación (por ejemplo, para ejecutar el script de configuración), pero instalar módulos en el directorio de módulos de terceros de una instalación de Python diferente (o algo que parece una instalación diferente de Python). Si esto suena un poco inusual, es --- es por eso que el usuario y los esquemas de inicio vienen antes. Sin embargo, hay al menos dos casos conocidos en los que el esquema de prefijo será útil.

source: First, consider that many Linux distributions put Python in :file:`/usr`, rather than the more traditional :file:`/usr/local`. This is entirely appropriate, since in those cases Python is part of "the system" rather than a local add-on. However, if you are installing Python modules from source, you probably want them to go in :file:`/usr/local/lib/python2.{X}` rather than :file:`/usr/lib/python2.{X}`. This can be done with ::
es: Primero, considere que muchas distribuciones de Linux ponen Python en :file:`/usr`, en lugar del tradicional :file:`/usr/local`. Esto es completamente apropiado, ya que en esos casos Python es parte del "sistema" en lugar de un complemento local. Sin embargo, si está instalando módulos de Python desde la fuente, probablemente desee que entren en :file:`/usr/local/lib/python2.{X}` en lugar de :file:`/usr/lib/python2.{X}`. Esto se puede hacer con ::

source: Another possibility is a network filesystem where the name used to write to a remote directory is different from the name used to read it: for example, the Python interpreter accessed as :file:`/usr/local/bin/python` might search for modules in :file:`/usr/local/lib/python2.{X}`, but those modules would have to be installed to, say, :file:`/mnt/{@server}/export/lib/python2.{X}`. This could be done with ::
es: Otra posibilidad es un sistema de archivos de red donde el nombre utilizado para escribir en un directorio remoto es diferente del nombre utilizado para leerlo: por ejemplo, el intérprete de Python al que se accede como :file:`/usr/local/bin/python` podría buscar módulos en :file:`/usr/local/lib/python2.{X}`, pero esos módulos tendrían que instalarse en, por ejemplo, :file:`/mnt/{@servidor}/export/lib/python2.{X}`. Esto podría hacerse con ::

source: In either case, the :option:`!--prefix` option defines the installation base, and the :option:`!--exec-prefix` option defines the platform-specific installation base, which is used for platform-specific files. (Currently, this just means non-pure module distributions, but could be expanded to C libraries, binary executables, etc.) If :option:`!--exec-prefix` is not supplied, it defaults to :option:`!--prefix`. Files are installed as follows:
es: En cualquier caso, la opción :option:`!--prefix` define la base de instalación, y la opción :option:`!--exec-prefix` define la base de instalación específica de la plataforma, que se utiliza para archivos específicos de la plataforma . (Actualmente, esto solo significa distribuciones de módulos no puras, pero podría expandirse a bibliotecas C, ejecutables binarios, etc.) Si:option:`!--exec-prefix` no se proporciona, el valor predeterminado es :option:`!--prefix`. Los archivos se instalan de la siguiente manera:

source: Python modules
es: Modules de Python

source: extension modules
es: extensión de módulos

source: There is no requirement that :option:`!--prefix` or :option:`!--exec-prefix` actually point to an alternate Python installation; if the directories listed above do not already exist, they are created at installation time.
es: No es necesario que :option:`! --prefix` o :option:`!--exec-prefix` realmente apunte a una instalación alternativa de Python; Si los directorios enumerados anteriormente no existen, se crean en el momento de la instalación.

source: Incidentally, the real reason the prefix scheme is important is simply that a standard Unix installation uses the prefix scheme, but with :option:`!--prefix` and :option:`!--exec-prefix` supplied by Python itself as ``sys.prefix`` and ``sys.exec_prefix``. Thus, you might think you'll never use the prefix scheme, but every time you run ``python setup.py install`` without any other options, you're using it.
es: Por cierto, la verdadera razón por la que el esquema de prefijos es importante es simplemente que una instalación estándar de Unix usa el esquema de prefijos, pero con :option:`!--prefix` y :option:`!--exec-prefix` suministrado por Python como ``sys.prefix`` y ``sys.exec_prefix``. Por lo tanto, puede pensar que nunca usará el esquema de prefijo, pero cada vez que ejecuta ``python setup.py install`` sin ninguna otra opción, lo está usando.

source: Note that installing extensions to an alternate Python installation has no effect on how those extensions are built: in particular, the Python header files (:file:`Python.h` and friends) installed with the Python interpreter used to run the setup script will be used in compiling extensions. It is your responsibility to ensure that the interpreter used to run extensions installed in this way is compatible with the interpreter used to build them. The best way to do this is to ensure that the two interpreters are the same version of Python (possibly different builds, or possibly copies of the same build). (Of course, if your :option:`!--prefix` and :option:`!--exec-prefix` don't even point to an alternate Python installation, this is immaterial.)
es: Tenga en cuenta que la instalación de extensiones en una instalación alternativa de Python no tiene efecto sobre cómo se construyen esas extensiones: en particular, los archivos de encabezado de Python (:file:`Python.h` y amigos) instalados con el intérprete de Python utilizado para ejecutar el script de configuración ser utilizado en la compilación de extensiones. Es su responsabilidad asegurarse de que el intérprete utilizado para ejecutar las extensiones instaladas de esta manera sea compatible con el intérprete utilizado para construirlas. La mejor manera de hacer esto es asegurarse de que los dos intérpretes sean la misma versión de Python (posiblemente compilaciones diferentes, o posiblemente copias de la misma compilación). (Por supuesto, si su :option:`! --prefix` y :option:`!-- exec-prefix` ni siquiera apuntan a una instalación alternativa de Python, esto es irrelevante).

source: Alternate installation: Windows (the prefix scheme)
es: Instalación alternativa: Windows (el esquema de prefijo)

source: Windows has no concept of a user's home directory, and since the standard Python installation under Windows is simpler than under Unix, the :option:`!--prefix` option has traditionally been used to install additional packages in separate locations on Windows. ::
es: Windows no tiene el concepto del directorio de inicio de un usuario, y dado que la instalación estándar de Python en Windows es más simple que en Unix, la opción :option:`!--prefix` se ha usado tradicionalmente para instalar paquetes adicionales en ubicaciones separadas en Windows. ::

source: to install modules to the :file:`\\Temp\\Python` directory on the current drive.
es: instalar los módulos en el directorio :file:`\\Temp\\Python` en el disco actual.

source: The installation base is defined by the :option:`!--prefix` option; the :option:`!--exec-prefix` option is not supported under Windows, which means that pure Python modules and extension modules are installed into the same location. Files are installed as follows:
es: La base de instalación se define mediante la opción :option:`!--prefix`; la opción :option:`!--exec-prefix` no es compatible con Windows, lo que significa que los módulos Python puros y los módulos de extensión están instalados en la misma ubicación. Los archivos se instalan de la siguiente manera:

source: Custom Installation
es: Instalación personalizada

source: Sometimes, the alternate installation schemes described in section :ref:`inst-alt-install` just don't do what you want. You might want to tweak just one or two directories while keeping everything under the same base directory, or you might want to completely redefine the installation scheme. In either case, you're creating a *custom installation scheme*.
es: A veces, los esquemas de instalación alternativos descritos en la sección :ref:`inst-alt-install` simplemente no hacen lo que quieres. Es posible que desee ajustar solo uno o dos directorios mientras mantiene todo bajo el mismo directorio base, o puede que desee redefinir completamente el esquema de instalación. En cualquier caso, está creando un *esquema de instalación personalizado*.

source: To create a custom installation scheme, you start with one of the alternate schemes and override some of the installation directories used for the various types of files, using these options:
es: Para crear un esquema de instalación personalizado, comience con uno de los esquemas alternativos y anule algunos de los directorios de instalación utilizados para los distintos tipos de archivos, utilizando estas opciones:

source: Override option
es: Sobreescribir opciones

source: all modules
es: todos los módulos

source: These override options can be relative, absolute, or explicitly defined in terms of one of the installation base directories. (There are two installation base directories, and they are normally the same---they only differ when you use the Unix "prefix scheme" and supply different ``--prefix`` and ``--exec-prefix`` options; using ``--install-lib`` will override values computed or given for ``--install-purelib`` and ``--install-platlib``, and is recommended for schemes that don't make a difference between Python and extension modules.)
es: Estas opciones de invalidación pueden ser relativas, absolutas o definidas explícitamente en términos de uno de los directorios base de instalación. (Hay dos directorios base de instalación, y normalmente son los mismos--- sólo difieren cuando se utiliza el "esquema de prefijo" de Unix y se proporcionan diferentes opciones de ``--prefijo`` y ``--exec-prefix``; usando ``--install-lib`` anulará los valores calculados o dados para ``install-purelib`` y ``--install-platlib``, y se recomienda para esquemas que no hacen diferencia entre Python y extensión.

source: For example, say you're installing a module distribution to your home directory under Unix---but you want scripts to go in :file:`~/scripts` rather than :file:`~/bin`. As you might expect, you can override this directory with the :option:`!--install-scripts` option; in this case, it makes most sense to supply a relative path, which will be interpreted relative to the installation base directory (your home directory, in this case)::
es: Por ejemplo, supongamos que se está instalando una distribución de módulos en su directorio de inicio en Unix---pero se desea que los scripts vayan en :file:`/scripts` en lugar de :file:`/bin`. Como es de esperar, puede invalidar este directorio con la opción :option:`!--install-scripts`; en este caso, tiene más sentido proporcionar una ruta relativa, que se interpretará en relación con el directorio base de la instalación (su directorio principal, en este caso)::

source: Another Unix example: suppose your Python installation was built and installed with a prefix of :file:`/usr/local/python`, so under a standard installation scripts will wind up in :file:`/usr/local/python/bin`. If you want them in :file:`/usr/local/bin` instead, you would supply this absolute directory for the :option:`!--install-scripts` option::
es: Otro ejemplo de Unix: supongamos que la instalación de Python se creó e instaló con un prefijo de :file:`/usr/local/python`, por lo que bajo una instalación estándar los scripts terminarán en :file:`/usr/local/python/bin`. Si los desea en :file:`/usr/local/bin` en su lugar, debe proporcionar este directorio absoluto para la opción :option:`!--install-scripts`::

source: (This performs an installation using the "prefix scheme", where the prefix is whatever your Python interpreter was installed with--- :file:`/usr/local/python` in this case.)
es: (Esto realiza una instalación utilizando el "esquema de prefijo", donde el prefijo es lo que su intérprete de Python se instaló con--- :file:`/usr/local/python` en este caso.)

source: If you maintain Python on Windows, you might want third-party modules to live in a subdirectory of :file:`{prefix}`, rather than right in :file:`{prefix}` itself. This is almost as easy as customizing the script installation directory---you just have to remember that there are two types of modules to worry about, Python and extension modules, which can conveniently be both controlled by one option::
es: Si mantiene Python en Windows, es posible que desee que los módulos de terceros vivan en un subdirectorio de :file:`prefijo`, en lugar de hacerlo en :file:`prefijo` en sí. Esto es casi tan fácil como personalizar el directorio de instalación de script---sólo hay que recordar que hay dos tipos de módulos de los que preocuparse, Python y módulos de extensión, que pueden ser convenientemente controlados por una opción::

source: The specified installation directory is relative to :file:`{prefix}`. Of course, you also have to ensure that this directory is in Python's module search path, such as by putting a :file:`.pth` file in a site directory (see :mod:`site`). See section :ref:`inst-search-path` to find out how to modify Python's search path.
es: El directorio de instalación especificado es relativo a :file:`-prefijo`. Por supuesto, también tiene que asegurarse de que este directorio está en la ruta de búsqueda del módulo de Python, por ejemplo, colocando un archivo :file:`.pth` en un directorio de sitio (consulte :mod:`site`). Consulte la sección :ref:`inst-search-path` para averiguar cómo modificar la ruta de búsqueda de Python.

source: If you want to define an entire installation scheme, you just have to supply all of the installation directory options. The recommended way to do this is to supply relative paths; for example, if you want to maintain all Python module-related files under :file:`python` in your home directory, and you want a separate directory for each platform that you use your home directory from, you might define the following installation scheme::
es: Si desea definir un esquema de instalación completo, sólo tiene que proporcionar todas las opciones del directorio de instalación. La forma recomendada de hacerlo es proporcionar rutas relativas; por ejemplo, si desea mantener todos los archivos relacionados con el módulo python en :file:`python` en su directorio principal y desea un directorio independiente para cada plataforma desde la que utilice el directorio principal, puede definir el siguiente esquema de instalación::

source: or, equivalently, ::
es: o, equivalente, ::

source: ``$PLAT`` is not (necessarily) an environment variable---it will be expanded by the Distutils as it parses your command line options, just as it does when parsing your configuration file(s).
es: ``$PLAT`` no es (necesariamente) una variable de entorno---se expandirá el Distutils a medida que analiza las opciones de línea de comandos, tal como lo hace al analizar los archivos de configuración.

source: Obviously, specifying the entire installation scheme every time you install a new module distribution would be very tedious. Thus, you can put these options into your Distutils config file (see section :ref:`inst-config-files`):
es: Obviamente, especificar el esquema de instalación completo cada vez que instala un nuevo módulo de distribución sería muy tedioso. Por lo tanto, puede poner estas opciones en su archivo de configuración de Distutils (consulte la sección :ref:`inst-config-files`):

source: or, equivalently,
es: o ,equivalente,

source: Note that these two are *not* equivalent if you supply a different installation base directory when you run the setup script. For example, ::
es: Tenga en cuenta que estos dos son *no* equivalentes si proporciona un directorio base de instalación diferente cuando ejecuta el script de configuración. Por ejemplo, ::

source: would install pure modules to :file:`/tmp/python/lib` in the first case, and to :file:`/tmp/lib` in the second case. (For the second case, you probably want to supply an installation base of :file:`/tmp/python`.)
es: instalaría módulos puros en :file:`/tmp/python/lib` en el primer caso, y en :file:`/tmp/lib` en el segundo caso. (Para el segundo caso, probablemente desee proporcionar una base de instalación de :file:`/tmp/python`.)

source: You probably noticed the use of ``$HOME`` and ``$PLAT`` in the sample configuration file input. These are Distutils configuration variables, which bear a strong resemblance to environment variables. In fact, you can use environment variables in config files on platforms that have such a notion but the Distutils additionally define a few extra variables that may not be in your environment, such as ``$PLAT``. (And of course, on systems that don't have environment variables, such as Mac OS 9, the configuration variables supplied by the Distutils are the only ones you can use.) See section :ref:`inst-config-files` for details.
es: Probablemente haya notado el uso de ``$HOME`` y ``$ PLAT`` en la entrada del archivo de configuración de muestra. Estas son las variables de configuración de Distutils, que tienen un gran parecido con las variables de entorno. De hecho, puede usar variables de entorno en archivos de configuración en plataformas que tienen esa noción, pero los Distutils definen adicionalmente algunas variables adicionales que pueden no estar en su entorno, como ``$PLAT``. (Y, por supuesto, en los sistemas que no tienen variables de entorno, como Mac OS 9, las variables de configuración proporcionadas por Distutils son las únicas que puede usar). Consulte la sección :ref:`inst-config-files` para detalles.

source: When a :ref:`virtual environment <venv-def>` is activated, any options that change the installation path will be ignored from all distutils configuration files to prevent inadvertently installing projects outside of the virtual environment.
es: Cuando a :ref:`entorno virtual <venv-def>` está activado, cualquier opción que cambie la ruta de instalación será ignorada de todos los archivos de configuración de distutils para evitar la instalación accidental de proyectos fuera del entorno virtual.

source: Modifying Python's Search Path
es: Modificando el Camino de Búsqueda de Python

source: When the Python interpreter executes an :keyword:`import` statement, it searches for both Python code and extension modules along a search path. A default value for the path is configured into the Python binary when the interpreter is built. You can determine the path by importing the :mod:`sys` module and printing the value of ``sys.path``. ::
es: Cuando el intérprete de Python ejecuta una declaración :keyword:`import`, busca tanto el código de Python como los módulos de extensión a lo largo de una ruta de búsqueda. Un valor predeterminado para la ruta se configura en el binario de Python cuando se construye el intérprete. Puede determinar la ruta importando el módulo :mod:`sys` e imprimiendo el valor de ``sys.path``. ::
