Repository: python/python-docs-es
Catalog: install/index.po
Languages: es

source: The converted files have to reside in the same directories as the normal libraries.
es: Los archivos convertidos tienen que residir en los mismos directorios que las bibliotecas normales.

source: How does Distutils manage to use these libraries with their changed names? If the extension needs a library (eg. :file:`foo`) Distutils checks first if it finds a library with suffix :file:`_bcpp` (eg. :file:`foo_bcpp.lib`) and then uses this library. In the case it doesn't find such a special library it uses the default name (:file:`foo.lib`.) [#]_
es: ¿Cómo logra Distutils usar estas bibliotecas con sus nombres cambiados? Si la extensión necesita una biblioteca (por ejemplo :file:`foo`) Distutils verifica primero si encuentra una biblioteca con el sufijo :file:`_bcpp` (por ejemplo :file:`foo_bcpp.lib`) y luego usa esta biblioteca. En el caso de que no encuentre una biblioteca tan especial, usa el nombre predeterminado (:file:`foo.lib`.) [#]_

source: To let Distutils compile your extension with Borland C++ you now have to type::
es: Para permitir que Distutils compile su extensión con Borland C++, ahora debe escribir::

source: If you want to use the Borland C++ compiler as the default, you could specify this in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
es: Si desea utilizar el compilador Borland C++ como predeterminado, puede especificar esto en su archivo de configuración personal o de todo el sistema para Distutils (consulte la sección :ref:`inst-config-files`.)

source: `C++Builder Compiler <https://www.embarcadero.com/products>`_
es: `Compilador *C++ Builder* <https://www.embarcadero.com/products>`_

source: Information about the free C++ compiler from Borland, including links to the download pages.
es: Información sobre el compilador gratuito de C++ de Borland, incluidos enlaces a las páginas de descarga.

source: `Creating Python Extensions Using Borland's Free Compiler <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_
es: `Crear Extensiones de Python usando el Compilador libre de Borland <http://www.cyberus.ca/~g_will/pyExtenDL.shtml>`_

source: Document describing how to use Borland's free command-line C++ compiler to build Python.
es: Documento que describe cómo usar el compilador C ++ de línea de comandos gratuito de Borland para construir Python.

source: This section describes the necessary steps to use Distutils with the GNU C/C++ compilers in their Cygwin and MinGW distributions. [#]_ For a Python interpreter that was built with Cygwin, everything should work without any of these following steps.
es: Esta sección describe los pasos necesarios para usar Distutils con los compiladores GNU C/C++ en sus distribuciones Cygwin y MinGW. [#]_ Para un intérprete de Python que fue construido con Cygwin, todo debería funcionar sin ninguno de estos pasos.

source: Not all extensions can be built with MinGW or Cygwin, but many can. Extensions most likely to not work are those that use C++ or depend on Microsoft Visual C extensions.
es: No todas las extensiones se pueden construir con MinGW o Cygwin, pero muchas sí. Las extensiones que probablemente no funcionen son aquellas que usan C++ o dependen de las extensiones de Microsoft Visual C.

source: To let Distutils compile your extension with Cygwin you have to type::
es: Para dejar que Distutils compile tu extensión con Cygwin tienes que escribir::

source: and for Cygwin in no-cygwin mode [#]_ or for MinGW type::
es: y para Cygwin en modo no-cygwin [#]_ o para tipo MinGW::

source: If you want to use any of these options/compilers as default, you should consider writing it in your personal or system-wide configuration file for Distutils (see section :ref:`inst-config-files`.)
es: Si desea utilizar cualquiera de estas opciones/compiladores por defecto, debería considerar escribirlo en su archivo de configuración personal o de todo el sistema para Distutils (consulte la sección :ref:`inst-config-files`).

source: Older Versions of Python and MinGW
es: Versiones antiguas de Python y MinGW

source: The following instructions only apply if you're using a version of Python inferior to 2.4.1 with a MinGW inferior to 3.0.0 (with binutils-2.13.90-20030111-1).
es: Las siguientes instrucciones solo se aplican si está utilizando una versión de Python inferior a 2.4.1 con un MinGW inferior a 3.0.0 (con binutils-2.13.90-20030111-1).

source: These compilers require some special libraries. This task is more complex than for Borland's C++, because there is no program to convert the library. First you have to create a list of symbols which the Python DLL exports. (You can find a good program for this task at https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).
es: Estos compiladores requieren algunas bibliotecas especiales. Esta tarea es más compleja que para C++ de Borland, porque no hay un programa para convertir la biblioteca. Primero debe crear una lista de símbolos que exporta la DLL de Python. (Puede encontrar un buen programa para esta tarea en https://sourceforge.net/projects/mingw/files/MinGW/Extension/pexports/).

source: The location of an installed :file:`python25.dll` will depend on the installation options and the version and language of Windows. In a "just for me" installation, it will appear in the root of the installation directory. In a shared installation, it will be located in the system directory.
es: La ubicación de un instalado :file:`python25.dll` dependerá de las opciones de instalación y la versión y el idioma de Windows. En una instalación "solo para mí", aparecerá en la raíz del directorio de instalación. En una instalación compartida, se ubicará en el directorio del sistema.

source: Then you can create from these information an import library for gcc. ::
es: Luego puede crear a partir de esta información una biblioteca de importación para gcc. ::

source: The resulting library has to be placed in the same directory as :file:`python25.lib`. (Should be the :file:`libs` directory under your Python installation directory.)
es: La biblioteca resultante debe colocarse en el mismo directorio que :file:`python25.lib`. (Debe ser el directorio :file:`libs` en el directorio de instalación de Python.)

source: If your extension uses other libraries (zlib,...) you might have to convert them too. The converted files have to reside in the same directories as the normal libraries do.
es: Si su extensión usa otras bibliotecas (zlib, ...), es posible que también deba convertirlas. Los archivos convertidos tienen que residir en los mismos directorios que las bibliotecas normales.

source: `Building Python modules on MS Windows platform with MinGW <http://old.zope.org/Members/als/tips/win32_mingw_modules>`_
es: `Construyendo modules Python en plataformas de Microsoft Windows con MinGW <http://old.zope.org/Members/als/tips/win32_mingw_modules>`_

source: Information about building the required libraries for the MinGW environment.
es: Información sobre la creación de las bibliotecas necesarias para el entorno MinGW.

source: Footnotes
es: Notas al pie

source: This also means you could replace all existing COFF-libraries with OMF-libraries of the same name.
es: Esto también significa que puede reemplazar todas las bibliotecas COFF existentes con bibliotecas OMF del mismo nombre.

source: Check https://www.sourceware.org/cygwin/ and http://www.mingw.org/ for more information
es: Diríjase a https://www.sourceware.org/cygwin/ and http://www.mingw.org/ para mayor información

source: Then you have no POSIX emulation available, but you also don't need :file:`cygwin1.dll`.
es: Entonces no tiene disponible la emulación POSIX, pero tampoco necesita :file:`cygwin1.dll`.
