Repository: python/python-docs-es
Catalog: install/index.po
Languages: es

source: The null string in ``sys.path`` represents the current working directory.
es: La cadena nula en ``sys.path`` representa el directorio de trabajo actual.

source: The expected convention for locally installed packages is to put them in the :file:`{...}/site-packages/` directory, but you may want to install Python modules into some arbitrary directory. For example, your site may have a convention of keeping all software related to the web server under :file:`/www`. Add-on Python modules might then belong in :file:`/www/python`, and in order to import them, this directory must be added to ``sys.path``. There are several different ways to add the directory.
es: La convención esperada para los paquetes instalados localmente es ponerlos en el directorio :file:`{...}/site-packages/`, pero es posible que desee instalar módulos de Python en algún directorio arbitrario. Por ejemplo, su sitio puede tener una convención de mantener todo el software relacionado con el servidor web en :file:`/www`. Los módulos adicionales de Python pueden pertenecer a :file:`/www/python`, y para importarlos, este directorio debe agregarse a ``sys.path``. Hay varias formas diferentes de agregar el directorio.

source: The most convenient way is to add a path configuration file to a directory that's already on Python's path, usually to the :file:`.../site-packages/` directory. Path configuration files have an extension of :file:`.pth`, and each line must contain a single path that will be appended to ``sys.path``. (Because the new paths are appended to ``sys.path``, modules in the added directories will not override standard modules. This means you can't use this mechanism for installing fixed versions of standard modules.)
es: La forma más conveniente es agregar un archivo de configuración de ruta a un directorio que ya está en la ruta de Python, generalmente al directorio :file:`.../site-packages/`. Los archivos de configuración de ruta tienen una extensión de :file:`.pth`, y cada línea debe contener una ruta única que se agregará a ``sys.path``. (Debido a que las nuevas rutas se agregan a ``sys.path``, los módulos en los directorios agregados no anularán los módulos estándar. Esto significa que no puede usar este mecanismo para instalar versiones fijas de módulos estándar).

source: Paths can be absolute or relative, in which case they're relative to the directory containing the :file:`.pth` file. See the documentation of the :mod:`site` module for more information.
es: Las rutas pueden ser absolutas o relativas, en cuyo caso son relativas al directorio que contiene el archivo :file:`.pth`. Consulte la documentación del módulo :mod:`site` para obtener más información.

source: A slightly less convenient way is to edit the :file:`site.py` file in Python's standard library, and modify ``sys.path``. :file:`site.py` is automatically imported when the Python interpreter is executed, unless the :option:`-S` switch is supplied to suppress this behaviour. So you could simply edit :file:`site.py` and add two lines to it:
es: Una forma un poco menos conveniente es editar el archivo :file:`site.py` en la biblioteca estándar de Python y modificar ``sys.path``. :file:`site.py` se importa automáticamente cuando se ejecuta el intérprete de Python, a menos que se proporcione el :option:`-S` para suprimir este comportamiento. Entonces, simplemente puede editar :file:`site.py` y agregarle dos líneas:

source: However, if you reinstall the same major version of Python (perhaps when upgrading from 2.2 to 2.2.2, for example) :file:`site.py` will be overwritten by the stock version. You'd have to remember that it was modified and save a copy before doing the installation.
es: Sin embargo, si reinstala la misma versión principal de Python (tal vez al actualizar de 2.2 a 2.2.2, por ejemplo) la versión de archivo sobrescribirá el :file:`site.py`. Debería recordar que se modificó y guardar una copia antes de realizar la instalación.

source: There are two environment variables that can modify ``sys.path``. :envvar:`PYTHONHOME` sets an alternate value for the prefix of the Python installation. For example, if :envvar:`PYTHONHOME` is set to ``/www/python``, the search path will be set to ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]``.
es: Hay dos variables de entorno que pueden modificar ``sys.path``. :envvar:`PYTHONHOME` establece un valor alternativo para el prefijo de la instalación de Python. Por ejemplo, si :envvar:`PYTHONHOME` está configurado en ``/www/python``, la ruta de búsqueda se establecerá en ``['', '/www/python/lib/pythonX.Y/', '/www/python/lib/pythonX.Y/plat-linux2', ...]``.

source: The :envvar:`PYTHONPATH` variable can be set to a list of paths that will be added to the beginning of ``sys.path``. For example, if :envvar:`PYTHONPATH` is set to ``/www/python:/opt/py``, the search path will begin with ``['/www/python', '/opt/py']``. (Note that directories must exist in order to be added to ``sys.path``; the :mod:`site` module removes paths that don't exist.)
es: La variable :envvar:`PYTHONPATH` se puede establecer en una lista de rutas que se agregarán al comienzo de ``sys.path``. Por ejemplo, si :envvar:`PYTHONPATH` está establecido en ``/www/python:/opt /py``, la ruta de búsqueda comenzará con ``['/www/python', '/opt/py'] ``. (Tenga en cuenta que los directorios deben existir para poder agregarlos a ``sys.path``; el módulo :mod:`site` elimina las rutas que no existen).

source: Finally, ``sys.path`` is just a regular Python list, so any Python application can modify it by adding or removing entries.
es: Finalmente,``sys.path`` es solo una lista normal de Python, por lo que cualquier aplicación de Python puede modificarla agregando o eliminando entradas.

source: Distutils Configuration Files
es: Archivos de Configuración de Distutils

source: As mentioned above, you can use Distutils configuration files to record personal or site preferences for any Distutils options. That is, any option to any command can be stored in one of two or three (depending on your platform) configuration files, which will be consulted before the command-line is parsed. This means that configuration files will override default values, and the command-line will in turn override configuration files. Furthermore, if multiple configuration files apply, values from "earlier" files are overridden by "later" files.
es: Como se mencionó anteriormente, puede usar los archivos de configuración de Distutils para registrar las preferencias personales o del sitio para cualquier opción de Distutils. Es decir, cualquier opción para cualquier comando puede almacenarse en uno de dos o tres (según su plataforma) archivos de configuración, que se consultarán antes de analizar la línea de comandos. Esto significa que los archivos de configuración anularán los valores predeterminados, y la línea de comandos a su vez anulará los archivos de configuración. Además, si se aplican varios archivos de configuración, los valores de los archivos "anteriores" se anulan por los archivos "posteriores".

source: Location and names of config files
es: Ubicación y nombres de los archivos de configuración

source: The names and locations of the configuration files vary slightly across platforms. On Unix and Mac OS X, the three configuration files (in the order they are processed) are:
es: Los nombres y las ubicaciones de los archivos de configuración varían ligeramente según las plataformas. En Unix y Mac OS X, los tres archivos de configuración (en el orden en que se procesan) son:

source: Location and filename
es: Ubicación y nombre de archivo

source: system
es: sistema

source: And on Windows, the configuration files are:
es: Y en Windows, los archivos de configuración son:

source: On all platforms, the "personal" file can be temporarily disabled by passing the `--no-user-cfg` option.
es: En todas las plataformas, el archivo "personal" puede deshabilitarse temporalmente pasando la opción `--no-user-cfg`.

source: Strictly speaking, the system-wide configuration file lives in the directory where the Distutils are installed; under Python 1.6 and later on Unix, this is as shown. For Python 1.5.2, the Distutils will normally be installed to :file:`{prefix}/lib/python1.5/site-packages/distutils`, so the system configuration file should be put there under Python 1.5.2.
es: Estrictamente hablando, el archivo de configuración de todo el sistema vive en el directorio donde están instalados los Distutils; bajo Python 1.6 y posterior en Unix, esto es como se muestra. Para Python 1.5.2, Distutils normalmente se instalará en :file:`{prefijo}/lib/python1.5/site-packages/distutils`, por lo que el archivo de configuración del sistema debe colocarse allí en Python 1.5.2.

source: On Unix, if the :envvar:`HOME` environment variable is not defined, the user's home directory will be determined with the :func:`getpwuid` function from the standard :mod:`pwd` module. This is done by the :func:`os.path.expanduser` function used by Distutils.
es: En Unix, si la variable de entorno :envvar:`HOME` no está definida, el directorio de inicio del usuario se determinará con la función :func:`getpwuid` del módulo estándar :mod:`pwd`. Esto se realiza mediante la función :func:`os.path.expanduser` utilizada por Distutils.

source: I.e., in the current directory (usually the location of the setup script).
es: Por ejemplo, en el directorio actual (usualmente la ubicación del script de setup).

source: (See also note (1).) Under Python 1.6 and later, Python's default "installation prefix" is :file:`C:\\Python`, so the system configuration file is normally :file:`C:\\Python\\Lib\\distutils\\distutils.cfg`. Under Python 1.5.2, the default prefix was :file:`C:\\Program Files\\Python`, and the Distutils were not part of the standard library---so the system configuration file would be :file:`C:\\Program Files\\Python\\distutils\\distutils.cfg` in a standard Python 1.5.2 installation under Windows.
es: (Ver nota (1).) En Python 1.6 y posterior, el "prefijo de instalación" por defecto de Python es :file:`C:\\Python`, entonces el archivo de configuración de sistema es normalmente :file:`C:\\Python\\Lib\\distutils\\distutils.cfg`. En Python 1.5.2, el prefijo por defecto era :file:`C:\\Program Files\\Python`, y *Distutils* no eran parte de la biblioteca estándar---entonces el archivo de configuración de sistema debería ser :file:`C:\\Program Files\\Python\\distutils\\distutils.cfg` en una instalación estándar de Python 1.5.2 en Windows.

source: On Windows, if the :envvar:`HOME` environment variable is not defined, :envvar:`USERPROFILE` then :envvar:`HOMEDRIVE` and :envvar:`HOMEPATH` will be tried. This is done by the :func:`os.path.expanduser` function used by Distutils.
es: En Windows, si la variable de entorno :envvar:`HOME` no está definida, se probará :envvar:`USERPROFILE` y luego :envvar:`HOMEDRIVE` y :envvar:`HOMEPATH`. Esto se realiza mediante la función :func:`os.path.expanduser` utilizada por Distutils.

source: Syntax of config files
es: Archivos de configuración de sintaxis

source: The Distutils configuration files all have the same syntax. The config files are grouped into sections. There is one section for each Distutils command, plus a ``global`` section for global options that affect every command. Each section consists of one option per line, specified as ``option=value``.
es: Todos los archivos de configuración de Distutils tienen la misma sintaxis. Los archivos de configuración se agrupan en secciones. Hay una sección para cada comando de Distutils, más una sección ``global`` para las opciones globales que afectan a cada comando. Cada sección consta de una opción por línea, especificada como ``opción=valor``.

source: For example, the following is a complete config file that just forces all commands to run quietly by default:
es: Por ejemplo, el siguiente es un archivo de configuración completo que solo obliga a todos los comandos a ejecutarse silenciosamente de manera predeterminada:

source: If this is installed as the system config file, it will affect all processing of any Python module distribution by any user on the current system. If it is installed as your personal config file (on systems that support them), it will affect only module distributions processed by you. And if it is used as the :file:`setup.cfg` for a particular module distribution, it affects only that distribution.
es: Si se instala como el archivo de configuración del sistema, afectará todo el procesamiento de cualquier distribución del módulo Python por parte de cualquier usuario en el sistema actual. Si se instala como su archivo de configuración personal (en sistemas que los admiten), afectará solo las distribuciones de módulos procesadas por usted. Y si se usa como :file:`setup.cfg` para una distribución de módulo en particular, solo afecta a esa distribución.

source: You could override the default "build base" directory and make the :command:`build\*` commands always forcibly rebuild all files with the following:
es: Puede anular el directorio "base de compilación" predeterminado y hacer que los comandos :command:`build\*` siempre reconstruyan a la fuerza todos los archivos con lo siguiente:

source: which corresponds to the command-line arguments ::
es: que corresponde a los argumentos de la línea de comandos ::

source: except that including the :command:`build` command on the command-line means that command will be run. Including a particular command in config files has no such implication; it only means that if the command is run, the options in the config file will apply. (Or if other commands that derive values from it are run, they will use the values in the config file.)
es: excepto que incluir el comando :command:`build` en la línea de comandos significa que ese comando se ejecutará. Incluir un comando particular en los archivos de configuración no tiene tal implicación; solo significa que si se ejecuta el comando, se aplicarán las opciones en el archivo de configuración. (O si se ejecutan otros comandos que derivan valores de él, utilizarán los valores en el archivo de configuración).

source: You can find out the complete list of options for any command using the :option:`!--help` option, e.g.::
es: Puede encontrar la lista completa de opciones para cualquier comando usando la opción :option:`!--help`, por ejemplo::

source: and you can find out the complete list of global options by using :option:`!--help` without a command::
es: y puede encontrar la lista completa de opciones globales usando :option:`!-help` sin un comando::

source: See also the "Reference" section of the "Distributing Python Modules" manual.
es: Ver también la sección "Referencia" del manual de "Distribución de Módulos de Python".

source: Building Extensions: Tips and Tricks
es: Construyendo Extensiones: Ayudas y trucos

source: Whenever possible, the Distutils try to use the configuration information made available by the Python interpreter used to run the :file:`setup.py` script. For example, the same compiler and linker flags used to compile Python will also be used for compiling extensions. Usually this will work well, but in complicated situations this might be inappropriate. This section discusses how to override the usual Distutils behaviour.
es: Siempre que sea posible, los Distutils intentan utilizar la información de configuración disponible por el intérprete de Python utilizado para ejecutar el script :file:`setup.py`. Por ejemplo, los mismos indicadores de compilador y enlazador utilizados para compilar Python también se usarán para compilar extensiones. Por lo general, esto funcionará bien, pero en situaciones complicadas esto puede ser inapropiado. Esta sección discute cómo anular el comportamiento habitual de Distutils.

source: Tweaking compiler/linker flags
es: Ajustar las flags del compilador/enlazador

source: Compiling a Python extension written in C or C++ will sometimes require specifying custom flags for the compiler and linker in order to use a particular library or produce a special kind of object code. This is especially true if the extension hasn't been tested on your platform, or if you're trying to cross-compile Python.
es: La compilación de una extensión de Python escrita en C o C ++ a veces requerirá especificar marcas personalizadas para el compilador y el enlazador para usar una biblioteca particular o producir un tipo especial de código de objeto. Esto es especialmente cierto si la extensión no ha sido probada en su plataforma, o si está intentando compilar Python de forma cruzada.

source: In the most general case, the extension author might have foreseen that compiling the extensions would be complicated, and provided a :file:`Setup` file for you to edit. This will likely only be done if the module distribution contains many separate extension modules, or if they often require elaborate sets of compiler flags in order to work.
es: En el caso más general, el autor de la extensión podría haber previsto que compilar las extensiones sería complicado, y proporcionó un archivo :file:`Setup` para que lo edite. Es probable que esto solo se haga si la distribución del módulo contiene muchos módulos de extensión separados, o si a menudo requieren conjuntos elaborados de indicadores de compilación para funcionar.

source: A :file:`Setup` file, if present, is parsed in order to get a list of extensions to build. Each line in a :file:`Setup` describes a single module. Lines have the following structure::
es: Un archivo :file:`Setup`, si está presente, es parseado para obtener una lista de extensiones para compilar. Cada línea en un archivo :file:`Setup` describe un solo módulo. Las líneas tienen la siguiente estructura ::

source: Let's examine each of the fields in turn.
es: Examinemos cada uno de los campos a su vez.

source: *module* is the name of the extension module to be built, and should be a valid Python identifier. You can't just change this in order to rename a module (edits to the source code would also be needed), so this should be left alone.
es: *módulo* es el nombre del módulo de extensión que se creará, y debe ser un identificador válido de Python. No puede simplemente cambiar esto para cambiar el nombre de un módulo (también serían necesarias ediciones en el código fuente), por lo que esto debería dejarse solo.

source: *sourcefile* is anything that's likely to be a source code file, at least judging by the filename. Filenames ending in :file:`.c` are assumed to be written in C, filenames ending in :file:`.C`, :file:`.cc`, and :file:`.c++` are assumed to be C++, and filenames ending in :file:`.m` or :file:`.mm` are assumed to be in Objective C.
es: *archivo fuente* es cualquier cosa que probablemente sea un archivo de código fuente, al menos a juzgar por el nombre del archivo. Se supone que los nombres de archivo que terminan en :file:`.c` están escritos en C, los nombres de archivo que terminan en :file:`.C` , :file:`.cc`, y :file:`.c++` son de C ++, y se supone que los nombres de archivo que terminan en :file:`.m` o :file:`.mm` están en el Objetivo C.

source: *cpparg* is an argument for the C preprocessor, and is anything starting with :option:`!-I`, :option:`!-D`, :option:`!-U` or :option:`!-C`.
es: *cpparg* es un argumento para el preprocesador C, y es cualquier cosa que comience con :option:`!-I`, :option:`!-D`, :option:`!-U` or :option:`!-C`.

source: *library* is anything ending in :file:`.a` or beginning with :option:`!-l` or :option:`!-L`.
es: *biblioteca* es todo aquello que termina con :file:`.a` or empieza con :option:`!-l` o :option:`!-L`.

source: If a particular platform requires a special library on your platform, you can add it by editing the :file:`Setup` file and running ``python setup.py build``. For example, if the module defined by the line ::
es: Si una plataforma en particular requiere una biblioteca especial en su plataforma, puede agregarla editando el archivo :file:`Setup` y ejecutando ``python setup.py build``. Por ejemplo, si el módulo definido por la línea ::

source: must be linked with the math library :file:`libm.a` on your platform, simply add :option:`!-lm` to the line::
es: debe estar vinculado con la biblioteca matemática :file:`libm.a` en su plataforma, simplemente agregue :option:`!-lm` a la línea ::

source: Arbitrary switches intended for the compiler or the linker can be supplied with the :option:`!-Xcompiler` *arg* and :option:`!-Xlinker` *arg* options::
es: Los conmutadores arbitrarios destinados al compilador o al enlazador se pueden suministrar con :option:`!-Xcompiler` *arg* y :option:`!-Xlinker` *arg* options::

source: The next option after :option:`!-Xcompiler` and :option:`!-Xlinker` will be appended to the proper command line, so in the above example the compiler will be passed the :option:`!-o32` option, and the linker will be passed :option:`!-shared`. If a compiler option requires an argument, you'll have to supply multiple :option:`!-Xcompiler` options; for example, to pass ``-x c++`` the :file:`Setup` file would have to contain ``-Xcompiler -x -Xcompiler c++``.
es: La siguiente opción después de :option:`!-Xcompiler` y :option:`!-Xlinker` se agregará a la línea de comando adecuada, por lo que en el ejemplo anterior se pasará al compilador la opción :option:`!-O32` , y se pasará al enlazador :option:`!-shared`. Si una opción del compilador requiere un argumento, deberá proporcionar varias opciones :option:`!-Xcompiler`; por ejemplo, para pasar ``-x c++`` el :file:`Setup` debería contener ``-Xcompiler -x -Xcompiler c++``.

source: Compiler flags can also be supplied through setting the :envvar:`CFLAGS` environment variable. If set, the contents of :envvar:`CFLAGS` will be added to the compiler flags specified in the :file:`Setup` file.
es: Los indicadores del compilador también se pueden suministrar configurando la variable de entorno :envvar:`CFLAGS`. Si se establece, el contenido de :envvar:`CFLAGS` se agregará a los indicadores del compilador especificados en el archivo :file:`Configuración`.

source: Using non-Microsoft compilers on Windows
es: Usando un compilador que no sea de Microsoft en Windows

source: This subsection describes the necessary steps to use Distutils with the Borland C++ compiler version 5.5. First you have to know that Borland's object file format (OMF) is different from the format used by the Python version you can download from the Python or ActiveState Web site. (Python is built with Microsoft Visual C++, which uses COFF as the object file format.) For this reason you have to convert Python's library :file:`python25.lib` into the Borland format. You can do this as follows:
es: Esta subsección describe los pasos necesarios para usar Distutils con el compilador Borland C++ versión 5.5. Primero debe saber que el formato de archivo de objetos (OMF) de Borland es diferente del formato utilizado por la versión de Python que puede descargar del sitio web de Python o ActiveState. (Python está construido con Microsoft Visual C++, que utiliza COFF como formato de archivo de objeto). Por esta razón, debe convertir la biblioteca de Python :file:`python25.lib` al formato Borland. Puede hacer esto de la siguiente manera:

source: The :file:`coff2omf` program comes with the Borland compiler. The file :file:`python25.lib` is in the :file:`Libs` directory of your Python installation. If your extension uses other libraries (zlib, ...) you have to convert them too.
es: El programa :file:`coff2omf` viene con el compilador Borland. El archivo :file:`python25.lib` está en el directorio :file:`Libs` de su instalación de Python. Si su extensión usa otras bibliotecas (zlib, ...), también debe convertirlas.
