Repository: python/python-docs-es
Catalog: using/configure.po
Languages: es

source: the compiler flag ``-L`` (for setting the search path for libraries). The ``-L`` flags are processed from left to right, and any flags in :envvar:`LDFLAGS` would take precedence over user- and package-supplied ``-L`` flags.
es: el indicador del compilador ``-L`` (para establecer la ruta de búsqueda de bibliotecas). Los indicadores ``-L`` se procesan de izquierda a derecha, y cualquier indicador en :envvar:`LDFLAGS` tendrá prioridad sobre los indicadores ``-L`` proporcionados por el usuario y el paquete.

source: Value of :envvar:`LDFLAGS_NODIST` variable passed to the ``./configure`` script.
es: Valor de la variable :envvar:`LDFLAGS_NODIST` pasado al script ``./configure``.

source: Linker flags, e.g. :samp:`-L{lib_dir}` if you have libraries in a nonstandard directory *lib_dir*.
es: Indicadores de vinculación, p. ej. :samp:`-L{lib_dir}` si tiene bibliotecas en un directorio no estándar *lib_dir*.

source: Linker flags to pass libraries to the linker when linking the Python executable.
es: Banderas de vinculación para pasar bibliotecas al vinculador al enlazar el ejecutable de Python.

source: Example: ``-lrt``.
es: Ejemplo: ``-lrt``.

source: Command to build a shared library.
es: Comando para construir una biblioteca compartida.

source: Default: ``@LDSHARED@ $(PY_LDFLAGS)``.
es: Por defecto: ``@LDSHARED@ $(PY_LDFLAGS)``.

source: Command to build ``libpython`` shared library.
es: Comando para compilar la biblioteca compartida ``libpython``.

source: Default: ``@BLDSHARED@ $(PY_CORE_LDFLAGS)``.
es: Por defecto: ``@BLDSHARED@ $(PY_CORE_LDFLAGS)``.

source: Default: ``$(CONFIGURE_LDFLAGS) $(LDFLAGS)``.
es: Por defecto: ``$(CONFIGURE_LDFLAGS) $(LDFLAGS)``.

source: Default: ``$(CONFIGURE_LDFLAGS_NODIST) $(LDFLAGS_NODIST)``.
es: Por defecto: ``$(CONFIGURE_LDFLAGS_NODIST) $(LDFLAGS_NODIST)``.

source: Linker flags used for building the interpreter object files.
es: Banderas de vinculación que se utilizan para crear los archivos de objeto del intérprete.
