Repository: python/python-docs-es
Catalog: using/configure.po
Languages: es

source: Configure Python
es: Configurar Python

source: Build Requirements
es: Requisitos de compilación

source: Features required to build CPython:
es: Características necesarias para compilar CPython:

source: A `C11 <https://en.cppreference.com/w/c/11>`_ compiler. `Optional C11 features <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ are not required.
es: Un compilador `C11 <https://en.cppreference.com/w/c/11>`_. `Características opcionales de C11 <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ no son necesarias.

source: Support for `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ floating point numbers and `floating point Not-a-Number (NaN) <https://en.wikipedia.org/wiki/NaN#Floating_point>`_.
es: Soporte para números en coma flotante `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ y `Not-a-Number (NaN) en coma flotante <https://en.wikipedia.org/wiki/NaN#Floating_point>`_.

source: Support for threads.
es: Soporte para hilos.

source: OpenSSL 1.1.1 or newer for the :mod:`ssl` and :mod:`hashlib` modules.
es: OpenSSL 1.1.1 o posterior para los módulos :mod:`ssl` y :mod:`hashlib`.

source: On Windows, Microsoft Visual Studio 2017 or later is required.
es: En Windows, se necesita Microsoft Visual Studio 2017 o posterior.

source: C11 compiler, IEEE 754 and NaN support are now required. On Windows, Visual Studio 2017 or later is required.
es: Ahora se requiere compatibilidad del compilador C11, IEEE 754 y NaN. En Windows, se necesita Visual Studio 2017 o posterior.

source: OpenSSL 1.1.1 is now required.
es: Ahora se necesita OpenSSL 1.1.1.

source: Thread support and OpenSSL 1.0.2 are now required.
es: Ahora se necesita soporte de hilos y OpenSSL 1.0.2.

source: Selected C99 features are now required, like ``<stdint.h>`` and ``static inline`` functions.
es: Ahora se necesitan características seleccionadas de C99, como ``<stdint.h>`` y funciones ``static inline``.

source: On Windows, Visual Studio 2015 or later is required.
es: En Windows, se necesita Visual Studio 2015 o posterior.

source: See also :pep:`7` "Style Guide for C Code" and :pep:`11` "CPython platform support".
es: Ver también :pep:`7` "Style Guide for C Code" y :pep:`11` "CPython platform support".

source: Generated files
es: Archivos generados

source: To reduce build dependencies, Python source code contains multiple generated files. Commands to regenerate all generated files::
es: Para reducir las dependencias de compilación, el código fuente de Python contiene varios archivos generados. Comandos para regenerar todos los archivos generados::

source: The ``Makefile.pre.in`` file documents generated files, their inputs, and tools used to regenerate them. Search for ``regen-*`` make targets.
es: El archivo ``Makefile.pre.in`` documenta archivos generados, sus entradas y las herramientas que se usaron para regenerarlos. Busque los objetivos make ``regen-*``.

source: The ``make regen-configure`` command runs `tiran/cpython_autoconf <https://github.com/tiran/cpython_autoconf>`_ container for reproducible build; see container ``entry.sh`` script. The container is optional, the following command can be run locally, the generated files depend on autoconf and aclocal versions::
es: El comando ``make regen-configure`` ejecuta el contenedor `tiran/cpython_autoconf <https://github.com/tiran/cpython_autoconf>`_ para la compilación reproducible; consulte el script ``entry.sh`` del contenedor. El contenedor es opcional, el siguiente comando se puede ejecutar localmente, los archivos generados dependen de las versiones autoconf y aclocal::

source: Configure Options
es: Configurar opciones

source: List all ``./configure`` script options using::
es: Enumerar todas las opciones del script ``./configure`` usando::

source: See also the :file:`Misc/SpecialBuilds.txt` in the Python source distribution.
es: Consultar también :file:`Misc/SpecialBuilds.txt` en la distribución fuente de Python.

source: General Options
es: Opciones generales

source: Support loadable extensions in the :mod:`!_sqlite` extension module (default is no) of the :mod:`sqlite3` module.
es: Admite extensiones cargables en el módulo de extensión :mod:`!_sqlite` (el valor por defecto es no) del módulo :mod:`sqlite3`.

source: See the :meth:`sqlite3.Connection.enable_load_extension` method of the :mod:`sqlite3` module.
es: Consultar el método :meth:`sqlite3.Connection.enable_load_extension` del módulo :mod:`sqlite3`.

source: Disable IPv6 support (enabled by default if supported), see the :mod:`socket` module.
es: Deshabilita la compatibilidad con IPv6 (habilitada de forma predeterminada si es compatible), consulte el módulo :mod:`socket`.

source: Define the size in bits of Python :class:`int` digits: 15 or 30 bits.
es: Define el tamaño en bits de los dígitos :class:`int` de Python: 15 o 30 bits.

source: By default, the digit size is 30.
es: Por defecto, el tamaño del dígito es 30.

source: Define the ``PYLONG_BITS_IN_DIGIT`` to ``15`` or ``30``.
es: Define el ``PYLONG_BITS_IN_DIGIT`` en ``15`` o ``30``.

source: See :data:`sys.int_info.bits_per_digit <sys.int_info>`.
es: Consultar :data:`sys.int_info.bits_per_digit <sys.int_info>`.

source: Set the Python executable suffix to *SUFFIX*.
es: Establece el sufijo ejecutable de Python en *SUFFIX*.

source: The default suffix is ``.exe`` on Windows and macOS (``python.exe`` executable), ``.js`` on Emscripten node, ``.html`` on Emscripten browser, ``.wasm`` on WASI, and an empty string on other platforms (``python`` executable).
es: El sufijo predeterminado es ``.exe`` en Windows y macOS (ejecutable ``python.exe``), ``.js`` en el nodo Emscripten, ``.html`` en el navegador Emscripten, ``.wasm`` en WASI y una cadena vacía en otras plataformas (ejecutable ``python``).

source: The default suffix on WASM platform is one of ``.js``, ``.html`` or ``.wasm``.
es: El sufijo predeterminado en la plataforma WASM es uno de ``.js``, ``.html`` o ``.wasm``.

source: Select the default time zone search path for :const:`zoneinfo.TZPATH`. See the :ref:`Compile-time configuration <zoneinfo_data_compile_time_config>` of the :mod:`zoneinfo` module.
es: Selecciona la ruta de búsqueda de zona horaria predeterminada para :const:`zoneinfo.TZPATH`. Consultar la :ref:`Configuración en tiempo de compilación <zoneinfo_data_compile_time_config>` del módulo :mod:`zoneinfo`.

source: Default: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.
es: Por defecto: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.

source: See :data:`os.pathsep` path separator.
es: Consultar separador de rutas :data:`os.pathsep` .

source: Build the ``_decimal`` extension module using a thread-local context rather than a coroutine-local context (default), see the :mod:`decimal` module.
es: Construye el módulo de extensión ``_decimal`` usando un contexto local de hilos en lugar de un contexto local de corutinas (predeterminado), consultar el módulo :mod:`decimal`.

source: See :const:`decimal.HAVE_CONTEXTVAR` and the :mod:`contextvars` module.
es: Consultar :const:`decimal.HAVE_CONTEXTVAR` y el módulo :mod:`contextvars`.

source: Override order to check db backends for the :mod:`dbm` module
es: Sobrescribe el orden para verificar los de las bases datos para el módulo :mod:`dbm`

source: A valid value is a colon (``:``) separated string with the backend names:
es: Un valor válido es una cadena de caracteres separada por dos puntos (``:``) con los nombres de los backends:

source: Disable C locale coercion to a UTF-8 based locale (enabled by default).
es: Deshabilita la coerción de configuración regional C a una configuración regional basada en UTF-8 (habilitada de forma predeterminada).

source: Don't define the ``PY_COERCE_C_LOCALE`` macro.
es: No define la macro ``PY_COERCE_C_LOCALE``.

source: See :envvar:`PYTHONCOERCECLOCALE` and the :pep:`538`.
es: Consultar :envvar:`PYTHONCOERCECLOCALE` y el :pep:`538`.

source: Disable all freelists except the empty tuple singleton.
es: Deshabilita todas las listas libres excepto la tupla única vacía.

source: Python library directory name (default is ``lib``).
es: Nombre del directorio de la biblioteca de Python (por defecto es ``lib``).

source: Fedora and SuSE use ``lib64`` on 64-bit platforms.
es: Fedora y SuSE usan ``lib64`` en plataformas 64-bit.

source: See :data:`sys.platlibdir`.
es: Consultar :data:`sys.platlibdir`.

source: Directory of wheel packages used by the :mod:`ensurepip` module (none by default).
es: Directorio de los paquetes *wheel* usados por el módulo :mod:`ensurepip` (ninguno por defecto)

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the :mod:`!ensurepip._bundled` package.
es: Algunas políticas de empaquetado de distribución de Linux recomiendan no empaquetar dependencias. Por ejemplo, Fedora instala paquetes *wheel* en el directorio ``/usr/share/python-wheels/`` y no instala el paquete :mod:`!ensurepip._bundled`.

source: Whether configure should use :program:`pkg-config` to detect build dependencies.
es: Si configure debe usar :program:`pkg-config` para detectar dependencias de compilación.

source: ``check`` (default): :program:`pkg-config` is optional
es: ``check`` (predeterminado): :program:`pkg-config` es opcional

source: ``yes``: :program:`pkg-config` is mandatory
es: ``yes``: :program:`pkg-config` es obligatorio

source: ``no``: configure does not use :program:`pkg-config` even when present
es: ``no``: configure no usa :program:`pkg-config` incluso cuando está presente

source: Turn on internal statistics gathering.
es: Active la recopilación de estadísticas internas.

source: The statistics will be dumped to a arbitrary (probably unique) file in ``/tmp/py_stats/``, or ``C:\temp\py_stats\`` on Windows. If that directory does not exist, results will be printed on stdout.
es: Las estadísticas se volcarán en un archivo arbitrario (probablemente único) en ``/tmp/py_stats/`` o ``C:\temp\py_stats\`` en Windows. Si ese directorio no existe, los resultados se imprimirán en la salida estándar.

source: Use ``Tools/scripts/summarize_stats.py`` to read the stats.
es: Usa ``Tools/scripts/summarize_stats.py`` para leer las estadísticas.

source: WebAssembly Options
es: Opciones de WebAssembly

source: Set build flavor for ``wasm32-emscripten``.
es: Establezca el tipo de compilación para ``wasm32-emscripten``.

source: ``browser`` (default): preload minimal stdlib, default MEMFS.
es: ``browser`` (predeterminado): precarga mínima stdlib, MEMFS predeterminado.

source: ``node``: NODERAWFS and pthread support.
es: ``node``: soporte para NODERAWFS y pthread.

source: Turn on dynamic linking support for WASM.
es: Active la compatibilidad con enlaces dinámicos para WASM.

source: Dynamic linking enables ``dlopen``. File size of the executable increases due to limited dead code elimination and additional features.
es: La vinculación dinámica habilita ``dlopen``. El tamaño del archivo del ejecutable aumenta debido a la eliminación limitada de código muerto y características adicionales.

source: Turn on pthreads support for WASM.
es: Active la compatibilidad con pthreads para WASM.

source: Install Options
es: Opciones de instalación

source: Install architecture-independent files in PREFIX. On Unix, it defaults to :file:`/usr/local`.
es: Instala archivos independientes de la arquitectura en PREFIX. En Unix, el valor predeterminado es :file:`/usr/local`.

source: This value can be retrieved at runtime using :data:`sys.prefix`.
es: Este valor se puede recuperar en tiempo de ejecución al usar :data:`sys.prefix`.

source: As an example, one can use ``--prefix="$HOME/.local/"`` to install a Python in its home directory.
es: Como ejemplo, se puede utilizar ``--prefix="$HOME/.local/"`` para instalar Python en su directorio raíz.

source: Install architecture-dependent files in EPREFIX, defaults to :option:`--prefix`.
es: Instala archivos independientes de la arquitectura en EPREFIX, el valor predeterminado es :option:`--prefix`.

source: This value can be retrieved at runtime using :data:`sys.exec_prefix`.
es: Este valor se puede recuperar en tiempo de ejecución al usar :data:`sys.exec_prefix`.

source: Don't build nor install test modules, like the :mod:`test` package or the :mod:`!_testcapi` extension module (built and installed by default).
es: No construya ni instale módulos de prueba, como el paquete :mod:`test` o el módulo de extensión :mod:`!_testcapi` (construido e instalado por defecto).

source: Select the :mod:`ensurepip` command run on Python installation:
es: Selecciona el comando :mod:`ensurepip` que se ejecuta en la instalación de Python:

source: ``upgrade`` (default): run ``python -m ensurepip --altinstall --upgrade`` command.
es: ``upgrade`` (por defecto): ejecutar el comando ``python -m ensurepip --altinstall --upgrade``.

source: ``install``: run ``python -m ensurepip --altinstall`` command;
es: ``install``: ejecutar el comando ``python -m ensurepip --altinstall``;

source: ``no``: don't run ensurepip;
es: ``no``: no ejecuta ensurepip;

source: Performance options
es: Opciones de desempeño

source: Configuring Python using ``--enable-optimizations --with-lto`` (PGO + LTO) is recommended for best performance. The experimental ``--enable-bolt`` flag can also be used to improve performance.
es: Se recomienda configurar Python usando ``--enable-optimizations --with-lto`` (PGO + LTO) para obtener el mejor rendimiento. El indicador experimental ``--enable-bolt`` también se puede usar para mejorar el rendimiento.

source: Enable Profile Guided Optimization (PGO) using :envvar:`PROFILE_TASK` (disabled by default).
es: Habilite la Optimización Guiada por Perfiles (*PGO* por sus siglas en inglés) usando :envvar:`PROFILE_TASK` (deshabilitado de forma predeterminada).

source: The C compiler Clang requires ``llvm-profdata`` program for PGO. On macOS, GCC also requires it: GCC is just an alias to Clang on macOS.
es: El compilador de C Clang requiere el programa ``llvm-profdata`` para PGO. En macOS, GCC también lo requiere: GCC es solo un alias de Clang en macOS.

source: Disable also semantic interposition in libpython if ``--enable-shared`` and GCC is used: add ``-fno-semantic-interposition`` to the compiler and linker flags.
es: Desactiva también la interposición semántica en libpython si se usa ``--enable-shared`` y GCC: agregar ``-fno-semantic-interposition`` a los flags del compilador y del enlazador.

source: Use ``-fno-semantic-interposition`` on GCC.
es: Usar ``-fno-semantic-interposition`` en GCC.

source: Environment variable used in the Makefile: Python command line arguments for the PGO generation task.
es: Variable de entorno utilizada en el Makefile: argumentos de la línea de comando Python para la tarea de generación de PGO.

source: Default: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.
es: Por defecto: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.

source: Enable Link Time Optimization (LTO) in any build (disabled by default).
es: Habilita la Optimización de Tiempo de Enlace (*LTO* por sus siglas en inglés) en cualquier compilación (deshabilitado de forma predeterminada).

source: The C compiler Clang requires ``llvm-ar`` for LTO (``ar`` on macOS), as well as an LTO-aware linker (``ld.gold`` or ``lld``).
es: El compilador de C Clang requiere ``llvm-ar`` para LTO (``ar`` en macOS), así como un enlazador compatible con LTO (``ld.gold`` o ``lld``).

source: To use ThinLTO feature, use ``--with-lto=thin`` on Clang.
es: Para usar la función ThinLTO, use ``--with-lto=thin`` en Clang.

source: Use ThinLTO as the default optimization policy on Clang if the compiler accepts the flag.
es: Utiliza ThinLTO como política de optimización predeterminada en Clang si el compilador acepta el indicador.

source: Enable usage of the `BOLT post-link binary optimizer <https://github.com/llvm/llvm-project/tree/main/bolt>`_ (disabled by default).
es: Habilita el uso del `optimizador binario post-enlace BOLT <https://github.com/llvm/llvm-project/tree/main/bolt>`_ (deshabilitado de forma predeterminada).

source: BOLT is part of the LLVM project but is not always included in their binary distributions. This flag requires that ``llvm-bolt`` and ``merge-fdata`` are available.
es: BOLT es parte del proyecto LLVM pero no siempre se incluye en sus distribuciones binarias. Este indicador necesita que ``llvm-bolt`` y ``merge-fdata`` estén disponibles.

source: BOLT is still a fairly new project so this flag should be considered experimental for now. Because this tool operates on machine code its success is dependent on a combination of the build environment + the other optimization configure args + the CPU architecture, and not all combinations are supported. BOLT versions before LLVM 16 are known to crash BOLT under some scenarios. Use of LLVM 16 or newer for BOLT optimization is strongly encouraged.
es: BOLT aún es un proyecto bastante nuevo, así que este indicador debería considerarse experimental por ahora. Debido a que esta herramienta opera en código máquina, su éxito depende de una combinación del entorno de compilación + los otros argumentos de configuración de optimización + la arquitectura del CPU, y no todas las combinaciones son compatibles. Se sabe que las versiones de BOLT anteriores a LLVM 16 bloquean BOLT en algunos escenarios. Se recomienda encarecidamente utilizar LLVM 16 o posterior para la optimización de BOLT.

source: The :envvar:`!BOLT_INSTRUMENT_FLAGS` and :envvar:`!BOLT_APPLY_FLAGS` :program:`configure` variables can be defined to override the default set of arguments for :program:`llvm-bolt` to instrument and apply BOLT data to binaries, respectively.
es: Las variables :program:`configure` :envvar:`!BOLT_INSTRUMENT_FLAGS` y :envvar:`!BOLT_APPLY_FLAGS` se pueden definir para sobrescribir el conjunto predeterminado de argumentos de :program:`llvm-bolt` para instrumentar y aplicar datos BOLT a binarios, respectivamente.

source: Enable computed gotos in evaluation loop (enabled by default on supported compilers).
es: Habilita los *gotos* calculados en el ciclo de evaluación (habilitado de forma predeterminada en los compiladores compatibles).

source: Disable the specialized Python memory allocator :ref:`pymalloc <pymalloc>` (enabled by default).
es: Deshabilita el asignador de memoria especializado de Python :ref:`pymalloc <pymalloc>` (habilitado de forma predeterminada).

source: See also :envvar:`PYTHONMALLOC` environment variable.
es: Consultar también la variable de entorno :envvar:`PYTHONMALLOC`.

source: Disable static documentation strings to reduce the memory footprint (enabled by default). Documentation strings defined in Python are not affected.
es: Deshabilita las cadenas de caracteres de documentación estáticas para reducir el espacio de memoria (habilitado de forma predeterminada). Las cadenas de caracteres de documentación definidas en Python no se ven afectadas.

source: Don't define the ``WITH_DOC_STRINGS`` macro.
es: No define la macro ``WITH_DOC_STRINGS``.

source: See the ``PyDoc_STRVAR()`` macro.
es: Consultar la macro ``PyDoc_STRVAR()``.

source: Enable C-level code profiling with ``gprof`` (disabled by default).
es: Habilita el análisis de rendimiento de código (*profiling*) de nivel C con ``gprof`` (deshabilitado de forma predeterminada).

source: Add ``-fstrict-overflow`` to the C compiler flags (by default we add ``-fno-strict-overflow`` instead).
es: Agrega ``-fstrict-overflow`` a los indicadores del compilador de C (el valor predeterminado que agregamos en su lugar es ``-fno-strict-overflow``).

source: Python Debug Build
es: Compilación de depuración de Python

source: A debug build is Python built with the :option:`--with-pydebug` configure option.
es: Una compilación de depuración es Python construido con la opción de configuración :option:`--with-pydebug`.

source: Effects of a debug build:
es: Efectos de una compilación de depuración:

source: Display all warnings by default: the list of default warning filters is empty in the :mod:`warnings` module.
es: Muestra todas las advertencias de forma predeterminada: la lista de filtros de advertencia predeterminados está vacía en el módulo :mod:`warnings`.

source: Add ``d`` to :data:`sys.abiflags`.
es: Agrega ``d`` a :data:`sys.abiflags`.

source: Add :func:`!sys.gettotalrefcount` function.
es: Agrega la función :func:`!sys.gettotalrefcount`.

source: Add :option:`-X showrefcount <-X>` command line option.
es: Agrega la opción de línea de comando :option:`-X showrefcount <-X>`.

source: Add :option:`-d` command line option and :envvar:`PYTHONDEBUG` environment variable to debug the parser.
es: Agrega la opción de línea de comando :option:`-d` y la variable de entorno :envvar:`PYTHONDEBUG` para depurar el analizador.

source: Add support for the ``__lltrace__`` variable: enable low-level tracing in the bytecode evaluation loop if the variable is defined.
es: Agregue soporte para la variable ``__lltrace__``: habilite el seguimiento de bajo nivel en el ciclo de evaluación del código de bytes si la variable está definida.

source: Install :ref:`debug hooks on memory allocators <default-memory-allocators>` to detect buffer overflow and other memory errors.
es: Instala :ref:`ganchos de depuración en los asignadores de memoria <default-memory-allocators>` para detectar el desbordamiento del búfer y otros errores de memoria.

source: Define ``Py_DEBUG`` and ``Py_REF_DEBUG`` macros.
es: Define las macros ``Py_DEBUG`` y ``Py_REF_DEBUG``.

source: Add runtime checks: code surrounded by ``#ifdef Py_DEBUG`` and ``#endif``. Enable ``assert(...)`` and ``_PyObject_ASSERT(...)`` assertions: don't set the ``NDEBUG`` macro (see also the :option:`--with-assertions` configure option). Main runtime checks:
es: Agregue verificaciones de tiempo de ejecución: código rodeado por ``#ifdef Py_DEBUG`` y ``#endif``. Habilite las aserciones ``assert(...)`` y ``_PyObject_ASSERT(...)``: no configure la macro ``NDEBUG`` (vea también la opción de configuración :option:`--with-assertions`). Comprobaciones principales de tiempo de ejecución:

source: Add sanity checks on the function arguments.
es: Agregue controles de sanidad en los argumentos de la función.

source: Unicode and int objects are created with their memory filled with a pattern to detect usage of uninitialized objects.
es: Los objetos unicode e int se crean con su memoria completa con un patrón para detectar el uso de objetos no inicializados.

source: Ensure that functions which can clear or replace the current exception are not called with an exception raised.
es: Asegúrese de que las funciones que pueden borrar o reemplazar la excepción actual no se invocan con una excepción lanzada.

source: Check that deallocator functions don't change the current exception.
es: Verifique que las funciones de desasignador no cambien la excepción actual.

source: The garbage collector (:func:`gc.collect` function) runs some basic checks on objects consistency.
es: El recolector de basura (función :func:`gc.collect`) ejecuta algunas comprobaciones básicas sobre la consistencia de los objetos.

source: The :c:macro:`!Py_SAFE_DOWNCAST()` macro checks for integer underflow and overflow when downcasting from wide types to narrow types.
es: La macro :c:macro:`!Py_SAFE_DOWNCAST()` comprueba el subdesbordamiento y el desbordamiento de enteros al realizar una conversión descendente de tipos anchos a tipos estrechos.

source: See also the :ref:`Python Development Mode <devmode>` and the :option:`--with-trace-refs` configure option.
es: Consultar también :ref:`Modo de Desarrollo de Python <devmode>` y la opción de configuración :option:`--with-trace-refs`.
