Repository: python/python-docs-es
Catalog: using/configure.po
Languages: es

source: Release builds and debug builds are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro (see the :option:`--with-trace-refs` option), which introduces the only ABI incompatibility.
es: Las compilaciones de lanzamiento y las compilaciones de depuración ahora son compatibles con ABI: definir la macro ``Py_DEBUG`` ya no implica la macro ``Py_TRACE_REFS`` (consultar la opción :option:`--with-trace-refs`), que presenta la única Incompatibilidad ABI.

source: Debug options
es: Opciones de depuración

source: :ref:`Build Python in debug mode <debug-build>`: define the ``Py_DEBUG`` macro (disabled by default).
es: :ref:`Compila Python en modo de depuración <debug-build>`: define la macro ``Py_DEBUG`` (deshabilitada por defecto).

source: Enable tracing references for debugging purpose (disabled by default).
es: Habilita las referencias de seguimiento con fines de depuración (deshabilitado de forma predeterminada).

source: Effects:
es: Efectos:

source: Define the ``Py_TRACE_REFS`` macro.
es: Define la macro ``Py_TRACE_REFS``.

source: Add :func:`!sys.getobjects` function.
es: Agrega la función :func:`!sys.getobjects`.

source: Add :envvar:`PYTHONDUMPREFS` environment variable.
es: Agrega la variable de entorno :envvar:`PYTHONDUMPREFS`.

source: This build is not ABI compatible with release build (default build) or debug build (``Py_DEBUG`` and ``Py_REF_DEBUG`` macros).
es: Esta compilación no es ABI compatible con la compilación de lanzamiento (compilación predeterminada) o la compilación de depuración (macros ``Py_DEBUG`` y ``Py_REF_DEBUG``).

source: Build with C assertions enabled (default is no): ``assert(...);`` and ``_PyObject_ASSERT(...);``.
es: Compila con las aserciones de C habilitadas (el valor predeterminado es no): ``assert(...);`` y ``_PyObject_ASSERT(...);``.

source: If set, the ``NDEBUG`` macro is not defined in the :envvar:`OPT` compiler variable.
es: Si se establece, la macro ``NDEBUG`` no está definida en la variable del compilador :envvar:`OPT`.

source: See also the :option:`--with-pydebug` option (:ref:`debug build <debug-build>`) which also enables assertions.
es: Consultar también la opción :option:`--with-pydebug` (:ref:`compilación de depuración <debug-build>`) que también habilita las aserciones.

source: Enable Valgrind support (default is no).
es: Habilite la compatibilidad con Valgrind (el valor predeterminado es no).

source: Enable DTrace support (default is no).
es: Habilite la compatibilidad con DTrace (el valor predeterminado es no).

source: See :ref:`Instrumenting CPython with DTrace and SystemTap <instrumentation>`.
es: Consultar :ref:`Instrumentación de CPython con DTrace y SystemTap <instrumentation>`.

source: Enable AddressSanitizer memory error detector, ``asan`` (default is no).
es: Habilita el detector de errores de memoria AddressSanitizer, ``asan`` (el valor predeterminado es no).

source: Enable MemorySanitizer allocation error detector, ``msan`` (default is no).
es: Habilita el detector de errores de asignación MemorySanitizer, ``msan`` (el valor predeterminado es no).

source: Enable UndefinedBehaviorSanitizer undefined behaviour detector, ``ubsan`` (default is no).
es: Habilita el detector de comportamiento indefinido UndefinedBehaviorSanitizer, ``ubsan`` (el valor predeterminado es no).

source: Linker options
es: Opciones del enlazador

source: Enable building a shared Python library: ``libpython`` (default is no).
es: Habilita la compilación de una biblioteca compartida de Python :``libpython`` (el valor predeterminado es no).

source: Do not build ``libpythonMAJOR.MINOR.a`` and do not install ``python.o`` (built and enabled by default).
es: No compila ``libpythonMAJOR.MINOR.a`` y no instala ``python.o`` (compilado y habilitado de forma predeterminada).

source: Libraries options
es: Opciones de bibliotecas

source: Link against additional libraries (default is no).
es: Enlace con bibliotecas adicionales (el valor predeterminado es no).

source: Build the :mod:`!pyexpat` module using an installed ``expat`` library (default is no).
es: Compila el módulo :mod:`!pyexpat` usando la biblioteca instalada ``expat`` instalada (por defecto es no).

source: Build the ``_decimal`` extension module using an installed ``mpdec`` library, see the :mod:`decimal` module (default is no).
es: Compila el módulo de extensión ``_decimal`` usando la biblioteca instalada ``mpdec``, ver el módulo :mod:`decimal` (el valor predeterminado es no).

source: Use ``editline`` library for backend of the :mod:`readline` module.
es: Utilice la biblioteca ``editline`` para el backend del módulo :mod:`readline`.

source: Define the ``WITH_EDITLINE`` macro.
es: Define la macro ``WITH_EDITLINE``.

source: Don't build the :mod:`readline` module (built by default).
es: No cree el módulo :mod:`readline` (es construido por defecto).

source: Don't define the ``HAVE_LIBREADLINE`` macro.
es: No defina la macro ``HAVE_LIBREADLINE``.

source: Override ``libm`` math library to *STRING* (default is system-dependent).
es: Sobreescribe la biblioteca matemática ``libm`` a *STRING* (el valor predeterminado es dependiente del sistema).

source: Override ``libc`` C library to *STRING* (default is system-dependent).
es: Sobreescribe la biblioteca C ``libc`` a *STRING* (el valor predeterminado es dependiente del sistema).

source: Root of the OpenSSL directory.
es: Raíz del directorio OpenSSL.

source: Set runtime library directory (rpath) for OpenSSL libraries:
es: Configura el directorio de la biblioteca en tiempo de ejecución (rpath) para las bibliotecas OpenSSL:

source: ``no`` (default): don't set rpath;
es: ``no`` (por defecto): no establece rpath;

source: ``auto``: auto-detect rpath from :option:`--with-openssl` and ``pkg-config``;
es: ``auto``: autodetecta rpath desde :option:`--with-openssl` y ``pkg-config``;

source: *DIR*: set an explicit rpath.
es: *DIR*: establece un rpath explícito.

source: Security Options
es: Opciones de seguridad

source: Select hash algorithm for use in ``Python/pyhash.c``:
es: Selecciona el algoritmo hash para usar en ``Python/pyhash.c``:

source: ``siphash13`` (default);
es: ``siphash13`` (por defecto);

source: ``siphash13`` is added and it is the new default.
es: Se agrega ``siphash13`` y es el nuevo valor predeterminado.

source: Built-in hash modules:
es: Módulos hash incorporados:

source: ``sha3`` (with shake);
es: ``sha3`` (con shake);

source: Override the OpenSSL default cipher suites string:
es: Sobreescribe la cadena de conjuntos de cifrado predeterminada de OpenSSL:

source: ``python`` (default): use Python's preferred selection;
es: ``python`` (por defecto): usa la selección principal de Python;

source: ``openssl``: leave OpenSSL's defaults untouched;
es: ``openssl``: deja intactos los valores predeterminados de OpenSSL;

source: *STRING*: use a custom string
es: *STRING*: usa una cadena de caracteres personalizada

source: See the :mod:`ssl` module.
es: Consultar el módulo :mod:`ssl`.

source: The settings ``python`` and *STRING* also set TLS 1.2 as minimum protocol version.
es: Las configuraciones ``python`` y *STRING* también establecen TLS 1.2 como versión mínima del protocolo.

source: macOS Options
es: Opciones macOS

source: See ``Mac/README.rst``.
es: Ver ``Mac/README.rst``.

source: Create a universal binary build. *SDKDIR* specifies which macOS SDK should be used to perform the build (default is no).
es: Crea una compilación binaria universal. *SDKDIR* especifica qué macOS SDK debe usarse para realizar la compilación (el valor predeterminado es no).

source: Create a Python.framework rather than a traditional Unix install. Optional *INSTALLDIR* specifies the installation path (default is no).
es: Crear un Python.framework en lugar de una instalación Unix tradicional. Opcionalmente *INSTALLDIR* especifica la ruta de instalación (el valor predeterminado es no).

source: Specify the kind of universal binary that should be created. This option is only valid when :option:`--enable-universalsdk` is set.
es: Especifique el tipo de binario universal que se debe crear. Esta opción solo es válida cuando se establece :option:`--enable-universalsdk`.

source: Options:
es: Opciones:

source: Specify the name for the python framework on macOS only valid when :option:`--enable-framework` is set (default: ``Python``).
es: Especifica el nombre del framework de Python en macOS, solo es válido cuando :option:`--enable-framework` está configurada (por defecto: ``Python``).

source: Cross Compiling Options
es: Opciones de compilación cruzada

source: Cross compiling, also known as cross building, can be used to build Python for another CPU architecture or platform. Cross compiling requires a Python interpreter for the build platform. The version of the build Python must match the version of the cross compiled host Python.
es: La compilación cruzada, también conocida como construcción cruzada, se puede usar para construir Python para otra plataforma o arquitectura de CPU. La compilación cruzada requiere un intérprete de Python para la plataforma de compilación. La versión de Python de compilación debe coincidir con la versión de Python host de compilación cruzada.

source: configure for building on BUILD, usually guessed by :program:`config.guess`.
es: configure para construir en BUILD, generalmente adivinado por :program:`config.guess`.

source: cross-compile to build programs to run on HOST (target platform)
es: compilación cruzada para crear programas que se ejecuten en HOST (plataforma de destino)

source: path to build ``python`` binary for cross compiling
es: ruta para construir el binario ``python`` para compilación cruzada

source: An environment variable that points to a file with configure overrides.
es: Una variable de entorno que apunta a un archivo con anulaciones de configuración.

source: Example *config.site* file::
es: Ejemplo de archivo *config.site*::

source: Cross compiling example::
es: Ejemplo de compilación cruzada::

source: Python Build System
es: Sistema de compilación Python

source: Main files of the build system
es: Archivos principales del sistema de compilación

source: :file:`Makefile.pre.in` => :file:`Makefile` (created by :file:`configure`);
es: :file:`Makefile.pre.in` => :file:`Makefile` (creado por :file:`configure`);

source: :file:`pyconfig.h` (created by :file:`configure`);
es: :file:`pyconfig.h` (creado por :file:`configure`);

source: :file:`Modules/Setup`: C extensions built by the Makefile using :file:`Module/makesetup` shell script;
es: :file:`Modules/Setup`: Extensiones C creadas por Makefile usando el script de shell :file:`Module/makesetup`;

source: Main build steps
es: Pasos principales de compilación

source: C files (``.c``) are built as object files (``.o``).
es: Los archivos C (``.c``) se crean como archivos objeto (``.o``).

source: A static ``libpython`` library (``.a``) is created from objects files.
es: La biblioteca estática ``libpython`` (``.a``) se crea a a partir de archivos de objetos.

source: ``python.o`` and the static ``libpython`` library are linked into the final ``python`` program.
es: ``python.o`` y la biblioteca estática ``libpython`` están enlazadas al programa final ``python``.

source: C extensions are built by the Makefile (see :file:`Modules/Setup`).
es: Las extensiones C son creadas por Makefile (ver :file:`Modules/Setup`).

source: Main Makefile targets
es: Objetivos principales de Makefile

source: ``make``: Build Python with the standard library.
es: ``make``: Compilar Python con la biblioteca estándar.

source: ``make platform:``: build the ``python`` program, but don't build the standard library extension modules.
es: ``make platform:``: compila el programa ``python``, pero no construye los módulos de extensión de la biblioteca estándar.

source: ``make profile-opt``: build Python using Profile Guided Optimization (PGO). You can use the configure :option:`--enable-optimizations` option to make this the default target of the ``make`` command (``make all`` or just ``make``).
es: ``make profile-opt``: compila Python utilizando la optimización guiada por perfiles (PGO). Puede usar la opción de configuración :option:`--enable-optimizations` para hacer que este sea el objetivo predeterminado del comando ``make`` (``make all`` o simplemente ``make``).

source: ``make buildbottest``: Build Python and run the Python test suite, the same way than buildbots test Python. Set ``TESTTIMEOUT`` variable (in seconds) to change the test timeout (1200 by default: 20 minutes).
es: ``make buildbottest``: compila Python y ejecuta el conjunto de pruebas de Python, de la misma manera que los buildbots prueban Python. Configure la variable ``TESTTIMEOUT`` (en segundos) para cambiar el tiempo de espera de la prueba (1200 por defecto: 20 minutos).

source: ``make install``: Build and install Python.
es: ``make install``: Compila e instala Python.

source: ``make regen-all``: Regenerate (almost) all generated files; ``make regen-stdlib-module-names`` and ``autoconf`` must be run separately for the remaining generated files.
es: ``make regen-all``: regenera (casi) todos los archivos generados; ``make regen-stdlib-module-names`` y ``autoconf`` deben ejecutarse por separado para los archivos generados restantes.

source: ``make clean``: Remove built files.
es: ``make clean``: elimina los archivos compilados.

source: ``make distclean``: Same than ``make clean``, but remove also files created by the configure script.
es: ``make distclean``: Similar a ``make clean``, pero elimina también los archivos creados por el script de configuración.

source: C extensions
es: Extensiones C

source: Some C extensions are built as built-in modules, like the ``sys`` module. They are built with the ``Py_BUILD_CORE_BUILTIN`` macro defined. Built-in modules have no ``__file__`` attribute::
es: Algunas extensiones de C están construidas como módulos incorporadas, como el módulo ``sys``. Están compiladas con la macro definida ``Py_BUILD_CORE_BUILTIN``. Los módulos incorporados no tienen el atributo ``__file__``:

source: Other C extensions are built as dynamic libraries, like the ``_asyncio`` module. They are built with the ``Py_BUILD_CORE_MODULE`` macro defined. Example on Linux x86-64::
es: Otras extensiones de C se crean como bibliotecas dinámicas, como el módulo ``_asyncio``. Están construidas con la macro ``Py_BUILD_CORE_MODULE`` definida. Ejemplo en Linux x86-64::

source: :file:`Modules/Setup` is used to generate Makefile targets to build C extensions. At the beginning of the files, C extensions are built as built-in modules. Extensions defined after the ``*shared*`` marker are built as dynamic libraries.
es: :file:`Modules/Setup` se usa para generar objetivos Makefile para compilar extensiones C. Al principio de los archivos, las extensiones C se crean como módulos incorporados. Las extensiones definidas después del marcador ``*shared*`` se crean como bibliotecas dinámicas.

source: The :c:macro:`!PyAPI_FUNC()`, :c:macro:`!PyAPI_DATA()` and :c:macro:`PyMODINIT_FUNC` macros of :file:`Include/exports.h` are defined differently depending if the ``Py_BUILD_CORE_MODULE`` macro is defined:
es: Las macros :c:macro:`!PyAPI_FUNC()`, :c:macro:`!PyAPI_DATA()` y :c:macro:`PyMODINIT_FUNC` de :file:`Include/exports.h` se definen de manera diferente dependiendo si es definida la macro ``Py_BUILD_CORE_MODULE``:

source: Use ``Py_EXPORTED_SYMBOL`` if the ``Py_BUILD_CORE_MODULE`` is defined
es: Use ``Py_EXPORTED_SYMBOL`` si ``Py_BUILD_CORE_MODULE`` es definido

source: Use ``Py_IMPORTED_SYMBOL`` otherwise.
es: Use ``Py_IMPORTED_SYMBOL`` de lo contrario.

source: If the ``Py_BUILD_CORE_BUILTIN`` macro is used by mistake on a C extension built as a shared library, its :samp:`PyInit_{xxx}()` function is not exported, causing an :exc:`ImportError` on import.
es: Si la macro ``Py_BUILD_CORE_BUILTIN`` se usa por error en una extensión de C compilada como una biblioteca compartida, su función :samp:`PyInit_{xxx}()` no se exporta, provocando un :exc:`ImportError` en la importación.

source: Compiler and linker flags
es: Banderas de compilador y vinculación

source: Options set by the ``./configure`` script and environment variables and used by ``Makefile``.
es: Opciones establecidas por el script ``./configure`` y las variables de entorno y utilizadas por ``Makefile``.

source: Preprocessor flags
es: Banderas del preprocesador

source: Value of :envvar:`CPPFLAGS` variable passed to the ``./configure`` script.
es: Valor de la variable :envvar:`CPPFLAGS` pasado al script ``./configure``.

source: (Objective) C/C++ preprocessor flags, e.g. :samp:`-I{include_dir}` if you have headers in a nonstandard directory *include_dir*.
es: (Objetivo) Indicadores del preprocesador C/C++, p. ej. :samp:`-I{include_dir}` si tiene encabezados en un directorio no estándar *include_dir*.

source: Both :envvar:`CPPFLAGS` and :envvar:`LDFLAGS` need to contain the shell's value to be able to build extension modules using the directories specified in the environment variables.
es: Ambos :envvar:`CPPFLAGS` y :envvar:`LDFLAGS` necesitan contener el valor del shell para poder compilar módulos de extensión usando los directorios especificados en las variables de entorno.

source: Extra preprocessor flags added for building the interpreter object files.
es: Se agregaron indicadores de preprocesador adicionales para construir los archivos de objeto del intérprete.

source: Default: ``$(BASECPPFLAGS) -I. -I$(srcdir)/Include $(CONFIGURE_CPPFLAGS) $(CPPFLAGS)``.
es: Por defecto: ``$(BASECPPFLAGS) -I. -I$(srcdir)/Include $(CONFIGURE_CPPFLAGS) $(CPPFLAGS)``.

source: Compiler flags
es: Banderas del compilador

source: C compiler command.
es: Comando del compilador C.

source: Example: ``gcc -pthread``.
es: Ejemplo: ``gcc -pthread``.

source: C++ compiler command.
es: Comando del compilador de C++.

source: Example: ``g++ -pthread``.
es: Ejemplo: ``g++ -pthread``.

source: C compiler flags.
es: Banderas del compilador de C.

source: :envvar:`CFLAGS_NODIST` is used for building the interpreter and stdlib C extensions. Use it when a compiler flag should *not* be part of :envvar:`CFLAGS` once Python is installed (:gh:`65320`).
es: :envvar:`CFLAGS_NODIST` se usa para compilar el intérprete y las extensiones stdlib C. Úselo cuando un indicador del compilador *no* deba ser parte de :envvar:`CFLAGS` una vez que Python esté instalado (:gh:`65320`).

source: In particular, :envvar:`CFLAGS` should not contain:
es: En particular, :envvar:`CFLAGS` no debe contener:

source: the compiler flag ``-I`` (for setting the search path for include files). The ``-I`` flags are processed from left to right, and any flags in :envvar:`CFLAGS` would take precedence over user- and package-supplied ``-I`` flags.
es: el indicador del compilador ``-I`` (para configurar la ruta de búsqueda de archivos de inclusión). Los indicadores ``-I`` se procesan de izquierda a derecha, y cualquier indicador en :envvar:`CFLAGS` tendrá prioridad sobre los indicadores ``-I`` proporcionados por el usuario y el paquete.

source: hardening flags such as ``-Werror`` because distributions cannot control whether packages installed by users conform to such heightened standards.
es: banderas de endurecimiento como ``-Werror`` porque las distribuciones no pueden controlar si los paquetes instalados por los usuarios cumplen con estándares tan elevados.

source: Options passed to the :mod:`compileall` command line when building PYC files in ``make install``. Default: ``-j0``.
es: Las opciones pasadas a la línea de comando :mod:`compileall` al crear archivos PYC en ``make install``. El valor predeterminado: ``-j0``.

source: Extra C compiler flags.
es: Banderas adicionales del compilador de C.

source: Value of :envvar:`CFLAGS` variable passed to the ``./configure`` script.
es: Valor de la variable :envvar:`CFLAGS` pasada al script ``./configure``.

source: Value of :envvar:`CFLAGS_NODIST` variable passed to the ``./configure`` script.
es: Valor de la variable :envvar:`CFLAGS_NODIST` pasada al script ``./configure``.

source: Base compiler flags.
es: Banderas base del compilador.

source: Optimization flags.
es: Banderas de optimización.

source: Strict or non-strict aliasing flags used to compile ``Python/dtoa.c``.
es: Banderas de alias estrictos o no estrictos que se utilizan para compilar ``Python/dtoa.c``.

source: Compiler flags used to build a shared library.
es: Banderas del compilador que se utilizan para compilar una biblioteca compartida.

source: For example, ``-fPIC`` is used on Linux and on BSD.
es: Por ejemplo, ``-fPIC`` se usa en Linux y BSD.

source: Extra C flags added for building the interpreter object files.
es: Se agregaron banderas C adicionales para compilar los archivos de objeto del intérprete.

source: Default: ``$(CCSHARED)`` when :option:`--enable-shared` is used, or an empty string otherwise.
es: Por defecto: ``$(CCSHARED)`` cuando se usa :option:`--enable-shared`, o una cadena de caracteres vacía en caso contrario.

source: Default: ``$(BASECFLAGS) $(OPT) $(CONFIGURE_CFLAGS) $(CFLAGS) $(EXTRA_CFLAGS)``.
es: Por defecto: ``$(BASECFLAGS) $(OPT) $(CONFIGURE_CFLAGS) $(CFLAGS) $(EXTRA_CFLAGS)``.

source: Default: ``$(CONFIGURE_CFLAGS_NODIST) $(CFLAGS_NODIST) -I$(srcdir)/Include/internal``.
es: Por defecto: ``$(CONFIGURE_CFLAGS_NODIST) $(CFLAGS_NODIST) -I$(srcdir)/Include/internal``.

source: C flags used for building the interpreter object files.
es: Banderas de C que se utilizan para compilar los archivos de objeto del intérprete.

source: Default: ``$(PY_CFLAGS) $(PY_CFLAGS_NODIST) $(PY_CPPFLAGS) $(CFLAGSFORSHARED)``.
es: Por defecto: ``$(PY_CFLAGS) $(PY_CFLAGS_NODIST) $(PY_CPPFLAGS) $(CFLAGSFORSHARED)``.

source: Default: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE``.
es: Por defecto: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE``.

source: Compiler flags to build a standard library extension module as a built-in module, like the :mod:`posix` module.
es: Banderas del compilador para construir un módulo de extensión de biblioteca estándar como un módulo incorporado, como el módulo :mod:`posix`.

source: Default: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE_BUILTIN``.
es: Por defecto: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE_BUILTIN``.

source: Purify command. Purify is a memory debugger program.
es: Comando Purify. Purify es un programa de depuración de memoria.

source: Default: empty string (not used).
es: Por defecto: cadena de caracteres vacía (no utilizado).

source: Linker flags
es: Banderas de vinculación

source: Linker command used to build programs like ``python`` and ``_testembed``.
es: Comando de vinculación usado para compilar programas como ``python`` y ``_testembed``.

source: Default: ``$(PURIFY) $(CC)``.
es: Por defecto: ``$(PURIFY) $(CC)``.

source: Value of :envvar:`LDFLAGS` variable passed to the ``./configure`` script.
es: Valor de la variable :envvar:`LDFLAGS` pasada al script ``./configure``.

source: Avoid assigning :envvar:`CFLAGS`, :envvar:`LDFLAGS`, etc. so users can use them on the command line to append to these values without stomping the pre-set values.
es: Evite asignar :envvar:`CFLAGS`, :envvar:`LDFLAGS`, etc. así los usuarios pueden usarlos en la línea de comando para agregar estos valores sin pisar los valores preestablecidos.

source: :envvar:`LDFLAGS_NODIST` is used in the same manner as :envvar:`CFLAGS_NODIST`. Use it when a linker flag should *not* be part of :envvar:`LDFLAGS` once Python is installed (:gh:`65320`).
es: :envvar:`LDFLAGS_NODIST` se usa de la misma manera que :envvar:`CFLAGS_NODIST`. Usar cuando un indicador del enlazador *no* deba ser parte de :envvar:`LDFLAGS` una vez que Python esté instalado (:gh:`65320`).

source: In particular, :envvar:`LDFLAGS` should not contain:
es: En particular, :envvar:`LDFLAGS` no debe contener:
