Repository: python/python-docs-es
Catalog: using/unix.po
Languages: es_es

source: Using Python on Unix platforms
es_es: Uso de Python en plataformas Unix

source: Getting and installing the latest version of Python
es_es: Obteniendo e instalando la última versión de Python

source: On Linux
es_es: En Linux

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can easily compile the latest version of Python from source.
es_es: Python viene preinstalado en la mayoría de distribuciones Linux, y también está disponible como paquete en el resto. Sin embargo, hay determinadas características que puede que quiera usar y no están disponibles en tu paquete de distribución. Puedes compilar fácilmente la última versión de Python de la fuente.

source: In the event that Python doesn't come preinstalled and isn't in the repositories as well, you can easily make packages for your own distro. Have a look at the following links:
es_es: En caso de que Python no venga preinstalado y tampoco se encuentre en los repositorios, puede crear fácilmente paquetes para su propia distribución. Eche un vistazo a los siguientes enlaces:

source: for Debian users
es_es: para usuarios de Debian

source: for OpenSuse users
es_es: para los usuarios de OpenSuse

source: for Fedora users
es_es: para los usuarios de Fedora

source: for Slackware users
es_es: para los usuarios de Slackware

source: On FreeBSD and OpenBSD
es_es: En FreeBSD y OpenBSD

source: FreeBSD users, to add the package use::
es_es: Usuarios FreeBSD, para añadir al paquete use::

source: OpenBSD users, to add the package use::
es_es: Usuarios OpenBSD, para añadir al paquete use::

source: For example i386 users get the 2.5.1 version of Python using::
es_es: Por ejemplo, los usuarios de i386 obtienen la versión 2.5.1 de Python usando::

source: Building Python
es_es: Construyendo Python

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `clone <https://devguide.python.org/setup/#get-the-source-code>`_. (If you want to contribute patches, you will need a clone.)
es_es: Si desea compilar CPython por sí mismo, lo primero que debería hacer es obtener la `fuente <https://www.python.org/downloads/source/>`_. Puede descargar la fuente de la última versión o simplemente conseguir un nuevo `clon <https://devguide.python.org/setup/#get-the-source-code>`_. (Si desea contribuir con parches, necesitará un clon.)

source: The build process consists of the usual commands::
es_es: El proceso de construcción consta de los comandos habituales::

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
es_es: :ref:`Opciones de configuración <configure-options>` y las advertencias para plataformas Unix específicas están ampliamente documentadas en el archivo :source:`README.rst` en la raíz del árbol de fuentes de Python.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
es_es: ``make install`` puede sobreescribir o enmascarar el binario :file:`python3`. Por lo tanto se recomienda ``make altinstall`` en lugar de ``make install`` debido a que sólo instala :file:`{exec_prefix}/bin/python{version}`.

source: Python-related paths and files
es_es: Rutas y archivos relacionados con Python

source: These are subject to difference depending on local installation conventions; :option:`prefix <--prefix>` and :option:`exec_prefix <--exec-prefix>` are installation-dependent and should be interpreted as for GNU software; they may be the same.
es_es: Estos están sujetos a diferencias según las convenciones de instalación locales; :option:`prefix <--prefix>` y :option:`exec_prefix <--exec-prefix>` son dependientes de la instalación y deben interpretarse como en el software GNU; pueden ser iguales.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
es_es: Por ejemplo, en la mayoría de los sistemas Linux, el valor predeterminado para ambos es :file:`/usr`.

source: File/directory
es_es: Archivo/directorio

source: Meaning
es_es: Significado

source: Recommended location of the interpreter.
es_es: Ubicación recomendada del intérprete.

source: Recommended locations of the directories containing the standard modules.
es_es: Ubicaciones recomendadas de los directorios que contienen los módulos estándar.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
es_es: Ubicaciones recomendadas de los directorios que contienen los archivos de inclusión necesarios para desarrollar extensiones de Python e incrustar el intérprete.

source: Miscellaneous
es_es: Miscelánea

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
es_es: Para usar fácilmente los scripts de Python en Unix, debe hacerlos ejecutables, p. ej. con

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
es_es: y coloque una línea *Shebang* adecuada en la parte superior del script. Una buena opción es usualmente ::

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
es_es: que busca el intérprete de Python en el conjunto :envvar:`PATH`. Sin embargo, algunos Unices puede que no tengan el comando :program:`env`, por lo que es posible que deba codificar ``/usr/bin/python3`` como la ruta intérprete.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
es_es: Para usar comandos de shell en sus scripts de Python, mire el módulo :mod:`subprocess`.

source: Custom OpenSSL
es_es: OpenSSL personalizado

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
es_es: Para utilizar la configuración de OpenSSL de su proveedor y el almacén de confianza del sistema, busque el directorio con el archivo ``openssl.cnf`` o el enlace simbólico en ``/etc``. En la mayoría de las distribuciones, el archivo está en ``/etc/ssl`` o ``/etc/pki/tls``. El directorio también debe contener un archivo ``cert.pem`` y / o un directorio ``certs``.

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
es_es: Descargue, compile e instale OpenSSL. Asegúrese de utilizar ``install_sw`` y no ``install``. El destino ``install_sw`` no anula ``openssl.cnf``.

source: Build Python with custom OpenSSL (see the configure ``--with-openssl`` and ``--with-openssl-rpath`` options)
es_es: Construir Python con OpenSSL personalizado (consulte las opciones configure ``--with-openssl`` y ``--with-openssl-rpath``)

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
es_es: Las versiones de parche de OpenSSL tienen una ABI compatible con versiones anteriores. No es necesario volver a compilar Python para actualizar OpenSSL. Es suficiente reemplazar la instalación personalizada de OpenSSL con una versión más nueva.
