Repository: python/python-docs-es
Catalog: using/windows.po
Languages: es

source: Any commands not found in the .INI file are treated as **Windows** executable paths that are absolute or relative to the directory containing the script file. This is a convenience for Windows-only scripts, such as those generated by an installer, since the behavior is not compatible with Unix-style shells. These paths may be quoted, and may include multiple arguments, after which the path to the script and any additional arguments will be appended.
es: Cualquier comando que no se encuentre en el archivo .INI se trata como rutas ejecutables de **Windows** que son absolutas o relativas al directorio que contiene el archivo de script. Esto es una comodidad para los scripts solo para Windows, como aquellos generados por un instalador, ya que el comportamiento no es compatible con los shells al estilo Unix. Estas rutas pueden estar entre comillas y pueden incluir varios argumentos, tras los cuales se añadirá la ruta al script y cualquier argumento adicional.

source: Arguments in shebang lines
es: Argumentos en líneas shebang

source: The shebang lines can also specify additional options to be passed to the Python interpreter. For example, if you have a shebang line:
es: Las líneas shebang también pueden especificar opciones adicionales para que sean pasadas al intérprete de Python. Por ej. si se tiene esta línea shebang:

source: Then Python will be started with the ``-v`` option
es: Entonces Python se iniciará con la opción ``-v``

source: Customization
es: Personalización

source: Customization via INI files
es: Personalización con archivos INI

source: Two .ini files will be searched by the launcher - ``py.ini`` in the current user's application data directory (``%LOCALAPPDATA%`` or ``$env:LocalAppData``) and ``py.ini`` in the same directory as the launcher. The same .ini files are used for both the 'console' version of the launcher (i.e. py.exe) and for the 'windows' version (i.e. pyw.exe).
es: El lanzador buscará dos archivos .ini - ``py.ini`` en el directorio de datos de aplicación del usuario actual (``%LOCALAPPDATA%`` o ``$env:LocalAppData``) y ``py.ini`` en el mismo directorio que el lanzador. Los mismos archivos .ini son utilizados tanto para la versión 'consola' del lanzador (es decir, py.exe) como para la version 'windows' (es decir pyw.exe).

source: Customization specified in the "application directory" will have precedence over the one next to the executable, so a user, who may not have write access to the .ini file next to the launcher, can override commands in that global .ini file.
es: La personalización especificada en el "directorio de aplicación" tendrá precedencia por sobre la que esté junto al ejecutable, por lo que un usuario, que podría no tener acceso de escritura al archivo .ini que está junto al lanzador, puede sobrescribir comandos en ese archivo .ini global.

source: Customizing default Python versions
es: Personalizar las versiones de Python predeterminadas

source: In some cases, a version qualifier can be included in a command to dictate which version of Python will be used by the command. A version qualifier starts with a major version number and can optionally be followed by a period ('.') and a minor version specifier. Furthermore it is possible to specify if a 32 or 64 bit implementation shall be requested by adding "-32" or "-64".
es: En algunos casos, un calificador de versión puede ser incluido en un comando para dictar qué versión de Python será utilizada por dicho comando. Un calificador de versión comienza con el número mayor de la versión y pude ser seguido opcionalmente por un punto ('.') y el número menor de la versión. Además es posible especificar si se solicita una implementación de 32 o 64 bit agregando "-32" o "-64".

source: For example, a shebang line of ``#!python`` has no version qualifier, while ``#!python3`` has a version qualifier which specifies only a major version.
es: Por ejemplo, una línea shebang como ``#!python`` no posee calificador de versión, mientras que ``#!python3`` sí tiene un calificador de versión el cual especifica solo el número mayor de la versión.

source: If no version qualifiers are found in a command, the environment variable :envvar:`PY_PYTHON` can be set to specify the default version qualifier. If it is not set, the default is "3". The variable can specify any value that may be passed on the command line, such as "3", "3.7", "3.7-32" or "3.7-64". (Note that the "-64" option is only available with the launcher included with Python 3.7 or newer.)
es: Si no se encuentra un calificador de versión en el comando, la variable de entorno :envvar:`PY_PYTHON` puede configurarse para especificar un calificador de versión predeterminado. Si esta no está configurada, por defecto es "3". La variable puede especificar cualquier valor que pueda ser pasado por línea de comandos, como "3", "3.7", "3.7-32" o "3.7-64". (Tener en cuenta que la opción "-64" solo está disponible con el lanzador incluido con Python 3.7 o versiones posteriores.)

source: If no minor version qualifiers are found, the environment variable ``PY_PYTHON{major}`` (where ``{major}`` is the current major version qualifier as determined above) can be set to specify the full version. If no such option is found, the launcher will enumerate the installed Python versions and use the latest minor release found for the major version, which is likely, although not guaranteed, to be the most recently installed version in that family.
es: Si no se encuentra ningún calificador de versión menor, la variable de entorno ``PY_PYTHON{major}`` (donde ``{major}`` es el actual calificador de versión mayor según lo determinado antes) puede ser configurada para especificar la versión completa. Si dicha opción no se encuentra, el lanzador enumerará las versiones de Python instaladas y utilizará la última versión menor encontrada para la versión mayor, la cual es probable, aunque no se garantiza, que sea la versión más recientemente instalada de esa familia.

source: On 64-bit Windows with both 32-bit and 64-bit implementations of the same (major.minor) Python version installed, the 64-bit version will always be preferred. This will be true for both 32-bit and 64-bit implementations of the launcher - a 32-bit launcher will prefer to execute a 64-bit Python installation of the specified version if available. This is so the behavior of the launcher can be predicted knowing only what versions are installed on the PC and without regard to the order in which they were installed (i.e., without knowing whether a 32 or 64-bit version of Python and corresponding launcher was installed last). As noted above, an optional "-32" or "-64" suffix can be used on a version specifier to change this behaviour.
es: En un Windows de 64 bit con ambas implementaciones de 32 y 64 bit de la misma versión (mayor.menor) de Python instaladas, la versión de 64 bit siempre tendrá precedencia. Esto se cumple para ambas implementaciones de 32 y 64 bit del lanzador - un lanzador de 32 bit priorizará ejecutar una instalación de Python de 64 bit de la versión especificada si está disponible. Esto es así para que el comportamiento del lanzador pueda ser predecible sabiendo solamente qué versiones están instaladas en la PC y sin importar el orden en el cual fueron instaladas (esto es, sin saber si una versión de Python de 32 o 64 bit y su correspondiente lanzador fue la última instalada). Como se especificó antes, el sufijo "-32" o "-64" puede ser utilizado en el especificador de versión para cambiar este comportamiento.

source: Examples:
es: Ejemplos:

source: If no relevant options are set, the commands ``python`` and ``python2`` will use the latest Python 2.x version installed and the command ``python3`` will use the latest Python 3.x installed.
es: Si no se configura ninguna opción relevante, los comandos ``python`` y ``python2`` utilizarán la última versión de Python 2.x instalada y el comando ``python3`` utilizará el último Python 3.x instalado.

source: The command ``python3.7`` will not consult any options at all as the versions are fully specified.
es: El comando ``python3.7`` no consultará ninguna opción ya que las versiones están completamente especificadas.

source: If ``PY_PYTHON=3``, the commands ``python`` and ``python3`` will both use the latest installed Python 3 version.
es: Si ``PY_PYTHON=3``, los comandos ``python`` y ``python3`` utilizarán ambos la última versión instalada de Python 3.

source: If ``PY_PYTHON=3.7-32``, the command ``python`` will use the 32-bit implementation of 3.7 whereas the command ``python3`` will use the latest installed Python (PY_PYTHON was not considered at all as a major version was specified.)
es: Si es ``PY_PYTHON=3.7-32``, el comando ``python`` usará la implementación de 32 bits de 3.7, mientras que el comando ``python3`` usará la última versión de Python instalada (PY_PYTHON no se consideró en absoluto porque se especificó una versión principal).

source: If ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7``, the commands ``python`` and ``python3`` will both use specifically 3.7
es: Si ``PY_PYTHON=3`` y ``PY_PYTHON3=3.7``, los comandos ``python`` y ``python3`` usarán específicamente 3.7

source: In addition to environment variables, the same settings can be configured in the .INI file used by the launcher. The section in the INI file is called ``[defaults]`` and the key name will be the same as the environment variables without the leading ``PY_`` prefix (and note that the key names in the INI file are case insensitive.) The contents of an environment variable will override things specified in the INI file.
es: Además de las variables de entorno, las mismas configuraciones pueden realizarse desde el archivo .INI utilizado por el lanzador. La sección en el archivo INI se llama ``[defaults]`` y el nombre de cada clave será igual al de la variable de entorno pero sin el prefijo ``PY_`` (tenga en cuenta que los nombres de clave en el archivo INI son indiferentes a mayúsculas y minúsculas). El contenido de las variables de entorno sobrescribirá los valores especificados en el archivo INI.

source: For example:
es: Por ejemplo:

source: Setting ``PY_PYTHON=3.7`` is equivalent to the INI file containing:
es: La configuración de ``PY_PYTHON=3.7`` es equivalente al archivo INI que contiene:

source: Setting ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7`` is equivalent to the INI file containing:
es: La configuración de ``PY_PYTHON=3`` y ``PY_PYTHON3=3.7`` es equivalente al archivo INI que contiene:

source: Diagnostics
es: Diagnóstico

source: If an environment variable :envvar:`PYLAUNCHER_DEBUG` is set (to any value), the launcher will print diagnostic information to stderr (i.e. to the console). While this information manages to be simultaneously verbose *and* terse, it should allow you to see what versions of Python were located, why a particular version was chosen and the exact command-line used to execute the target Python. It is primarily intended for testing and debugging.
es: Si se establece una variable de entorno :envvar:`PYLAUNCHER_DEBUG` (en cualquier valor), el lanzador imprimirá información de diagnóstico en stderr (es decir, en la consola). Si bien esta información logra ser simultáneamente detallada *and* concisa, debería permitirle ver qué versiones de Python se ubicaron, por qué se eligió una versión en particular y la línea de comando exacta utilizada para ejecutar el Python de destino. Está destinado principalmente a pruebas y depuración.

source: Dry Run
es: Ejecución en seco

source: If an environment variable :envvar:`PYLAUNCHER_DRYRUN` is set (to any value), the launcher will output the command it would have run, but will not actually launch Python. This may be useful for tools that want to use the launcher to detect and then launch Python directly. Note that the command written to standard output is always encoded using UTF-8, and may not render correctly in the console.
es: Si se establece una variable de entorno :envvar:`PYLAUNCHER_DRYRUN` (en cualquier valor), el lanzador generará el comando que habría ejecutado, pero en realidad no iniciará Python. Esto puede ser útil para las herramientas que desean usar el lanzador para detectar y luego iniciar Python directamente. Tenga en cuenta que el comando escrito en la salida estándar siempre se codifica con UTF-8 y es posible que no se represente correctamente en la consola.

source: Install on demand
es: Instalación bajo demanda

source: If an environment variable :envvar:`PYLAUNCHER_ALLOW_INSTALL` is set (to any value), and the requested Python version is not installed but is available on the Microsoft Store, the launcher will attempt to install it. This may require user interaction to complete, and you may need to run the command again.
es: Si se establece una variable de entorno :envvar:`PYLAUNCHER_ALLOW_INSTALL` (en cualquier valor) y la versión de Python solicitada no está instalada pero está disponible en Microsoft Store, el lanzador intentará instalarla. Esto puede requerir la interacción del usuario para completarse y es posible que deba ejecutar el comando nuevamente.

source: An additional :envvar:`PYLAUNCHER_ALWAYS_INSTALL` variable causes the launcher to always try to install Python, even if it is detected. This is mainly intended for testing (and should be used with :envvar:`PYLAUNCHER_DRYRUN`).
es: Una variable :envvar:`PYLAUNCHER_ALWAYS_INSTALL` adicional hace que el lanzador siempre intente instalar Python, incluso si se detecta. Esto está diseñado principalmente para pruebas (y debe usarse con :envvar:`PYLAUNCHER_DRYRUN`).

source: Return codes
es: Códigos de retorno

source: The following exit codes may be returned by the Python launcher. Unfortunately, there is no way to distinguish these from the exit code of Python itself.
es: El lanzador de Python puede retornar los siguientes códigos de salida. Desafortunadamente, no hay forma de distinguirlos del código de salida de Python.

source: The names of codes are as used in the sources, and are only for reference. There is no way to access or resolve them apart from reading this page. Entries are listed in alphabetical order of names.
es: Los nombres de los códigos son como se usan en las fuentes y son solo para referencia. No hay forma de acceder a ellos o resolverlos aparte de leer esta página. Las entradas se enumeran en orden alfabético de nombres.

source: Value
es: Valor

source: A :file:`pyvenv.cfg` was found but is corrupt.
es: Se encontró un :file:`pyvenv.cfg` pero está corrupto.

source: Failed to launch Python.
es: No se pudo iniciar Python.

source: An install was started, but the command will need to be re-run after it completes.
es: Se inició una instalación, pero será necesario volver a ejecutar el comando una vez que se complete.

source: Unexpected error. Please report a bug.
es: Error inesperado. Por favor, informe de un error.

source: Unable to obtain command line from the operating system.
es: No se puede obtener la línea de comandos del sistema operativo.

source: Unable to locate the requested version.
es: No se puede encontrar la versión solicitada.

source: A :file:`pyvenv.cfg` was required but not found.
es: Se requería un :file:`pyvenv.cfg` pero no se encontró.

source: Finding modules
es: Encontrar módulos

source: These notes supplement the description at :ref:`sys-path-init` with detailed Windows notes.
es: Estas notas complementan la descripción en :ref:`sys-path-init` con notas detalladas de Windows.

source: When no ``._pth`` file is found, this is how :data:`sys.path` is populated on Windows:
es: Cuando no se encuentre ningún archivo ``._pth``, así es como :data:`sys.path` es completado en Windows:

source: An empty entry is added at the start, which corresponds to the current directory.
es: Se agrega una entrada vacía al comienzo, que corresponde al directorio actual.

source: If the environment variable :envvar:`PYTHONPATH` exists, as described in :ref:`using-on-envvars`, its entries are added next. Note that on Windows, paths in this variable must be separated by semicolons, to distinguish them from the colon used in drive identifiers (``C:\`` etc.).
es: Si existe la variable de entorno :envvar:`PYTHONPATH`, de acuerdo a lo descrito en :ref:`using-on-envvars`, sus entradas se agregan a continuación. Tenga en cuenta que en Windows, las rutas en esta variable deben estar separadas por punto y coma (;), para distinguirlas de los dos puntos utilizados en los identificadores de disco (``C:\``, etc.).

source: Additional "application paths" can be added in the registry as subkeys of :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` under both the ``HKEY_CURRENT_USER`` and ``HKEY_LOCAL_MACHINE`` hives. Subkeys which have semicolon-delimited path strings as their default value will cause each path to be added to :data:`sys.path`. (Note that all known installers only use HKLM, so HKCU is typically empty.)
es: Se pueden agregar al registro "rutas de aplicación" adicionales como subclaves de :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` bajo los subárboles ``HKEY_CURRENT_USER`` y ``HKEY_LOCAL_MACHINE``. Las subclaves que contienen un valor por defecto compuesto por cadenas de ruta separadas por punto y coma causan que cada una de esas rutas sea agregada a :data:`sys.path`. (Tenga en cuenta que todos los instaladores conocidos solo utilizan HKLM, por lo que HKCU comúnmente se encuentra vacío.)

source: If the environment variable :envvar:`PYTHONHOME` is set, it is assumed as "Python Home". Otherwise, the path of the main Python executable is used to locate a "landmark file" (either ``Lib\os.py`` or ``pythonXY.zip``) to deduce the "Python Home". If a Python home is found, the relevant sub-directories added to :data:`sys.path` (``Lib``, ``plat-win``, etc) are based on that folder. Otherwise, the core Python path is constructed from the PythonPath stored in the registry.
es: Si se configura la variable de entorno :envvar:`PYTHONHOME`, es asumida como el "Python Home" (el directorio de origen de Python). De lo contrario, la ruta del ejecutable principal de Python es utilizada para ubicar un "archivo de referencia" (ya sea ``Lib\os.py`` o ``pythonXY.zip``) para deducir el "Python Home". Si el directorio de origen de Python es encontrado, los subdirectorios relevantes que se agregan a :data:`sys.path` (``Lib``, ``plat-win``, etc.) se basan en ese directorio. Por el contrario, la ruta principal de Python se construye a partir del PythonPath guardado en el registro.

source: If the Python Home cannot be located, no :envvar:`PYTHONPATH` is specified in the environment, and no registry entries can be found, a default path with relative entries is used (e.g. ``.\Lib;.\plat-win``, etc).
es: Si el Python Home no puede ser ubicado, :envvar:`PYTHONPATH` no está especificado en el entorno y no se encuentra ninguna entrada en el registro, se usa una ruta predeterminada con entradas relativas (por ej. ``.\Lib;.\plat-win``, etc.).

source: If a ``pyvenv.cfg`` file is found alongside the main executable or in the directory one level above the executable, the following variations apply:
es: Si se encuentra el archivo ``pyvenv.cfg`` junto al ejecutable principal o en el directorio un nivel arriba del ejecutable, se aplica la siguiente variación:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing the home location.
es: Si ``home`` es una ruta absoluta y :envvar:`PYTHONHOME` no está configurada, se usa esta ruta en lugar de la ruta al ejecutable principal para deducir la ubicación del directorio de origen.

source: The end result of all this is:
es: El resultado final de todo esto es:

source: When running :file:`python.exe`, or any other .exe in the main Python directory (either an installed version, or directly from the PCbuild directory), the core path is deduced, and the core paths in the registry are ignored. Other "application paths" in the registry are always read.
es: Cuando se ejecuta :file:`python.exe`, o cualquier otro .exe en el directorio principal de Python (tanto la versión instalada como directamente desde el directorio PCbuild), se deduce la ruta principal, y se ignoran las rutas principales en el registro. Siempre se leen otras "rutas de aplicación" del registro.

source: When Python is hosted in another .exe (different directory, embedded via COM, etc), the "Python Home" will not be deduced, so the core path from the registry is used. Other "application paths" in the registry are always read.
es: Cuando se aloja Python en otro .exe (distinto directorio, incrustado mediante COM, etc.), el "Python Home" no se deduce, y se utiliza la ruta principal del registro. Siempre se leen otras "rutas de aplicación" del registro.

source: If Python can't find its home and there are no registry value (frozen .exe, some very strange installation setup) you get a path with some default, but relative, paths.
es: Si Python no puede encontrar su directorio de origen y no hay valores en el registro (un .exe congelado, una muy rara configuración de instalación) se obtiene una ruta relativa predeterminada.

source: For those who want to bundle Python into their application or distribution, the following advice will prevent conflicts with other installations:
es: Para aquellos que quieran incluir Python en su aplicación o distribución, los siguientes consejos evitarán conflictos con otras instalaciones:

source: Include a ``._pth`` file alongside your executable containing the directories to include. This will ignore paths listed in the registry and environment variables, and also ignore :mod:`site` unless ``import site`` is listed.
es: Incluya un archivo ``._pth`` junto al ejecutable, que contenga los directorios a incluir. Esto hará que se ignoren las rutas enumeradas en el registro y en las variables de entorno, y que también se ignore :mod:`site` a menos que se especifique ``import site``.

source: If you are loading :file:`python3.dll` or :file:`python37.dll` in your own executable, explicitly call :c:func:`Py_SetPath` or (at least) :c:func:`Py_SetProgramName` before :c:func:`Py_Initialize`.
es: Si se carga :file:`python3.dll` o :file:`python37.dll` desde un ejecutable propio, invocar explícitamente :c:func:`Py_SetPath` o (al menos) :c:func:`Py_SetProgramName` antes de :c:func:`Py_Initialize`.

source: Clear and/or overwrite :envvar:`PYTHONPATH` and set :envvar:`PYTHONHOME` before launching :file:`python.exe` from your application.
es: Limpie y/o sobrescriba :envvar:`PYTHONPATH` y configure :envvar:`PYTHONHOME` antes de iniciar :file:`python.exe` desde su aplicación.

source: If you cannot use the previous suggestions (for example, you are a distribution that allows people to run :file:`python.exe` directly), ensure that the landmark file (:file:`Lib\\os.py`) exists in your install directory. (Note that it will not be detected inside a ZIP file, but a correctly named ZIP file will be detected instead.)
es: Si no se pueden utilizar las sugerencias previas (por ejemplo, en una distribución que permite a los usuarios ejecutar :file:`python.exe` directamente), hay que asegurarse de que el archivo de referencia (:file:`Lib\\os.py`) exista en el directorio de instalación. (Tener en cuenta que este no será detectado dentro de un archivo ZIP, pero si se detectará un ZIP correctamente nombrado.)
