Repository: python/python-docs-es
Catalog: using/windows.po
Languages: es

source: These will ensure that the files in a system-wide installation will not take precedence over the copy of the standard library bundled with your application. Otherwise, your users may experience problems using your application. Note that the first suggestion is the best, as the others may still be susceptible to non-standard paths in the registry and user site-packages.
es: Esto asegura que los archivos de una instalación del sistema no tendrán precedencia por sobre la copia de la biblioteca estándar incluida en su aplicación. De otra manera, los usuarios podrían experimentar problemas al utilizar su aplicación. Tenga en cuenta que la primera sugerencia es la mejor, ya que las otras aún pueden ser afectadas por rutas no estándar en el registro y en el site-packages del usuario.

source: Adds ``._pth`` file support and removes ``applocal`` option from ``pyvenv.cfg``.
es: Agrega soporte para archivos ``._pth`` y elimina la opción ``applocal`` de ``pyvenv.cfg``.

source: Adds :file:`python{XX}.zip` as a potential landmark when directly adjacent to the executable.
es: Agrega :file:`python{XX}.zip` como un potencial archivo de referencia cuando se encuentra junto al ejecutable.

source: Modules specified in the registry under ``Modules`` (not ``PythonPath``) may be imported by :class:`importlib.machinery.WindowsRegistryFinder`. This finder is enabled on Windows in 3.6.0 and earlier, but may need to be explicitly added to :data:`sys.meta_path` in the future.
es: Los módulos especificados en el registro bajo ``Modules`` (no ``PythonPath``) pueden ser importados por :class:`importlib.machinery.WindowsRegistryFinder`. Este buscador está habilitado en Windows en la versión 3.6.0 y anteriores, pero es posible que deba agregarse explícitamente a :data:`sys.meta_path` en el futuro.

source: Additional modules
es: Módulos adicionales

source: Even though Python aims to be portable among all platforms, there are features that are unique to Windows. A couple of modules, both in the standard library and external, and snippets exist to use these features.
es: Aunque Python pretende ser portátil entre todas las plataformas, hay características que son exclusivas de Windows. Existen un par de módulos, de la biblioteca estándar y externos, y fragmentos de código para utilizar estas funciones.

source: The Windows-specific standard modules are documented in :ref:`mswin-specific-services`.
es: Los módulos estándar específicos para Windows se encuentran documentados en :ref:`mswin-specific-services`.

source: The `PyWin32 <https://pypi.org/project/pywin32>`_ module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
es: El módulo `PyWin32 <https://pypi.org/project/pywin32>`_ de Mark Hammond es una colección de módulos para soporte avanzado específico para Windows. Este incluye utilidades para:

source: Win32 API calls
es: Invocación de la API Win32

source: Registry
es: Registro

source: Event log
es: Registro de eventos

source: `Microsoft Foundation Classes <https://docs.microsoft.com/en-us/cpp/mfc/mfc-desktop-applications>`_ (MFC) user interfaces
es: Interfaces de usuario `Microsoft Foundation Classes <https://docs.microsoft.com/en-us/cpp/mfc/mfc-desktop-applications>`_ (MFC)

source: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
es: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ es una aplicación MFC de muestra distribuida con PyWin32. Es un IDE incrustable con depurador incorporado.

source: by Tim Golden
es: por Tim Golden

source: by David and Paul Boddie
es: por David y Paul Boddie

source: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ wraps Python scripts into executable Windows programs (:file:`{*}.exe` files). When you have done this, you can distribute your application without requiring your users to install Python.
es: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ envuelve scripts de Python en programas ejecutables de Windows (archivos :file:`{*}.exe`).Cuando hayas hecho esto, puedes distribuir tu aplicación sin requerir que tus usuarios instalen Python.

source: Compiling Python on Windows
es: Compilar Python en Windows

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `checkout <https://devguide.python.org/setup/#get-the-source-code>`_.
es: Si desea compilar CPython usted mismo, lo primero que debe hacer es obtener el `source <https://www.python.org/downloads/source/>`_. Puede descargar la fuente de la última versión o simplemente obtener un `checkout <https://devguide.python.org/setup/#get-the-source-code>`_ nuevo.

source: The source tree contains a build solution and project files for Microsoft Visual Studio, which is the compiler used to build the official Python releases. These files are in the :file:`PCbuild` directory.
es: El árbol fuente contiene una solución de compilación y archivos de proyecto para Microsoft Visual Studio, que es el compilador que se usa para compilar las versiones oficiales de Python. Estos archivos están en el directorio :file:`PCbuild`.

source: Check :file:`PCbuild/readme.txt` for general information on the build process.
es: Consulte :file:`PCbuild/readme.txt` para obtener información general acerca del proceso de compilación.

source: For extension modules, consult :ref:`building-on-windows`.
es: Para módulos de extensión, consulte :ref:`building-on-windows`.

source: Other Platforms
es: Otras plataformas

source: With ongoing development of Python, some platforms that used to be supported earlier are no longer supported (due to the lack of users or developers). Check :pep:`11` for details on all unsupported platforms.
es: Con el continuo desarrollo de Python, algunas plataformas que solían ser compatibles ya no lo son (debido a la falta de usuarios o desarrolladores). Consulte :pep:`11` para detalles sobre las plataformas no soportadas.

source: `Windows CE <https://pythonce.sourceforge.net/>`_ is `no longer supported <https://github.com/python/cpython/issues/71542>`__ since Python 3 (if it ever was).
es: `Windows CE <https://pythonce.sourceforge.net/>`_ es `no longer supported <https://github.com/python/cpython/issues/71542>`__ desde Python 3 (si alguna vez lo fue).

source: The `Cygwin <https://cygwin.com/>`_ installer offers to install the `Python interpreter <https://cygwin.com/packages/summary/python3.html>`__ as well
es: El instalador `Cygwin <https://cygwin.com/>`_ ofrece instalar también el `Python interpreter <https://cygwin.com/packages/summary/python3.html>`__

source: See `Python for Windows <https://www.python.org/downloads/windows/>`_ for detailed information about platforms with pre-compiled installers.
es: Para obtener información detallada acerca de las plataformas con instaladores precompilados consulte `Python for Windows <https://www.python.org/downloads/windows/>`_.
