Repository: python/python-docs-es
Catalog: using/windows.po
Languages: es

source: All three commands are also available with version number suffixes, for example, as ``python3.exe`` and ``python3.x.exe`` as well as ``python.exe`` (where ``3.x`` is the specific version you want to launch, such as |version|). Open "Manage App Execution Aliases" through Start to select which version of Python is associated with each command. It is recommended to make sure that ``pip`` and ``idle`` are consistent with whichever version of ``python`` is selected.
es: Los tres comandos también están disponibles con el número de versión como sufijo, por ejemplo, como ``python3.exe`` y ``python3.x.exe`` así como también ``python.exe`` (donde ``3.x`` es la versión específica que se quiera iniciar, como |version|). Abrir "Administrar alias de ejecución de aplicaciones" a través del menú de Inicio para seleccionar cuál versión de Python se asocia con cada comando. Se recomienda asegurarse de que ``pip`` e ``idle`` sean consistentes con la versión de ``python`` que esté seleccionada.

source: Virtual environments can be created with ``python -m venv`` and activated and used as normal.
es: Los entornos virtuales se pueden crear con ``python -m venv`` y se activan y usan normalmente.

source: If you have installed another version of Python and added it to your ``PATH`` variable, it will be available as ``python.exe`` rather than the one from the Microsoft Store. To access the new installation, use ``python3.exe`` or ``python3.x.exe``.
es: Si ha instalado otra versión de Python que se haya agregado a la variable ``PATH``, estará disponible como ``python.exe`` en lugar de la de Microsoft Store. Para acceder a la nueva instalación, use ``python3.exe`` o ``python3.x.exe``.

source: The ``py.exe`` launcher will detect this Python installation, but will prefer installations from the traditional installer.
es: El lanzador ``py.exe`` detectará esta instalación de Python, pero priorizará instalaciones realizadas con el instalador tradicional.

source: To remove Python, open Settings and use Apps and Features, or else find Python in Start and right-click to select Uninstall. Uninstalling will remove all packages you installed directly into this Python installation, but will not remove any virtual environments
es: Para eliminar Python, abra Configuración y utilice Aplicaciones y características, o encuentre Python en el Inicio y mediante click derecho seleccione Desinstalar. La desinstalación eliminará todos los paquetes instalados directamente en esta instalación de Python, pero no eliminará ningún entorno virtual

source: Known issues
es: Problemas conocidos

source: Redirection of local data, registry, and temporary paths
es: Redirección de datos locales, registro y rutas temporales

source: Because of restrictions on Microsoft Store apps, Python scripts may not have full write access to shared locations such as :envvar:`TEMP` and the registry. Instead, it will write to a private copy. If your scripts must modify the shared locations, you will need to install the full installer.
es: Debido a las restricciones de las aplicaciones de Microsoft Store, es posible que los scripts de Python no tengan acceso de escritura completo a ubicaciones compartidas, como :envvar:`TEMP` y el registro. En su lugar, escribirá en una copia privada. Si sus scripts deben modificar las ubicaciones compartidas, deberá instalar el instalador completo.

source: At runtime, Python will use a private copy of well-known Windows folders and the registry. For example, if the environment variable :envvar:`%APPDATA%` is :file:`c:\\Users\\<user>\\AppData\\`, then when writing to :file:`C:\\Users\\<user>\\AppData\\Local` will write to :file:`C:\\Users\\<user>\\AppData\\Local\\Packages\\PythonSoftwareFoundation.Python.3.8_qbz5n2kfra8p0\\LocalCache\\Local\\`.
es: En tiempo de ejecución, Python usará una copia privada de carpetas conocidas de Windows y el registro. Por ejemplo, si la variable de entorno :envvar:`%APPDATA%` es :file:`c:\\Users\\<user>\\AppData\\`, al escribir en :file:`C:\\Users\\<user>\\AppData\\Local` se escribirá en :file:`C:\\Users\\<user>\\AppData\\Local\\Packages\\PythonSoftwareFoundation.Python.3.8_qbz5n2kfra8p0\\LocalCache\\Local\\`.

source: When reading files, Windows will return the file from the private folder, or if that does not exist, the real Windows directory. For example reading :file:`C:\\Windows\\System32` returns the contents of :file:`C:\\Windows\\System32` plus the contents of :file:`C:\\Program Files\\WindowsApps\\package_name\\VFS\\SystemX86`.
es: Al leer archivos, Windows retornará el archivo de la carpeta privada, o si no existe, el directorio real de Windows. Por ejemplo, leer :file:`C:\\Windows\\System32` retorna el contenido de :file:`C:\\Windows\\System32` más el contenido de :file:`C:\\Program Files\\WindowsApps\\package_name\\VFS\\SystemX86`.

source: You can find the real path of any existing file using :func:`os.path.realpath`:
es: Puede encontrar la ruta real de cualquier archivo existente usando :func:`os.path.realpath`:

source: When writing to the Windows Registry, the following behaviors exist:
es: Al escribir en el Registro de Windows, existen los siguientes comportamientos:

source: Reading from ``HKLM\\Software`` is allowed and results are merged with the :file:`registry.dat` file in the package.
es: Se permite la lectura desde ``HKLM\\Software`` y los resultados se fusionan con el archivo :file:`registry.dat` en el paquete.

source: Writing to ``HKLM\\Software`` is not allowed if the corresponding key/value exists, i.e. modifying existing keys.
es: No se permite escribir en ``HKLM\\Software`` si existe la clave/valor correspondiente, es decir, modificar las claves existentes.

source: Writing to ``HKLM\\Software`` is allowed as long as a corresponding key/value does not exist in the package and the user has the correct access permissions.
es: Se permite escribir en ``HKLM\\Software`` siempre que no exista una clave/valor correspondiente en el paquete y el usuario tenga los permisos de acceso correctos.

source: For more detail on the technical basis for these limitations, please consult Microsoft's documentation on packaged full-trust apps, currently available at `docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes <https://docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes>`_
es: Para obtener más detalles sobre la base técnica de estas limitaciones, consulte la documentación de Microsoft sobre aplicaciones empaquetadas de plena confianza, actualmente disponible en `docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes <https://docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes>`_

source: The nuget.org packages
es: El paquete de nuget.org

source: The nuget.org package is a reduced size Python environment intended for use on continuous integration and build systems that do not have a system-wide install of Python. While nuget is "the package manager for .NET", it also works perfectly fine for packages containing build-time tools.
es: El paquete de nuget.org es un entorno Python de tamaño reducido destinado a usarse en sistemas de integración continua y compilación que no posean una instalación de Python a nivel de sistema. Si bien nuget es "el administrador de paquetes para .NET", también funciona perfectamente para paquetes que contienen herramientas de tiempo de compilación.

source: Visit `nuget.org <https://www.nuget.org/>`_ for the most up-to-date information on using nuget. What follows is a summary that is sufficient for Python developers.
es: Visite `nuget.org <https://www.nuget.org/>`_ para obtener la información más actualizada sobre cómo usar nuget. Lo que sigue es un resumen que es suficiente para desarrolladores Python.

source: The ``nuget.exe`` command line tool may be downloaded directly from ``https://aka.ms/nugetclidl``, for example, using curl or PowerShell. With the tool, the latest version of Python for 64-bit or 32-bit machines is installed using::
es: La herramienta de línea de comandos ``nuget.exe`` puede ser descargada directamente desde ``https://aka.ms/nugetclidl``, por ejemplo usando curl o PowerShell. Con esta herramienta, la última versión de Python para máquinas de 64 o 32 bit se instala con::

source: To select a particular version, add a ``-Version 3.x.y``. The output directory may be changed from ``.``, and the package will be installed into a subdirectory. By default, the subdirectory is named the same as the package, and without the ``-ExcludeVersion`` option this name will include the specific version installed. Inside the subdirectory is a ``tools`` directory that contains the Python installation:
es: Para seleccionar una versión en particular, agregue un ``-Version 3.x.y``. El directorio de salida se puede cambiar de ``.`` y el paquete se instalará en un subdirectorio. De forma predeterminada, el subdirectorio tiene el mismo nombre que el paquete y, sin la opción ``-ExcludeVersion``, este nombre incluirá la versión específica instalada. Dentro del subdirectorio hay un directorio ``tools`` que contiene la instalación de Python:

source: In general, nuget packages are not upgradeable, and newer versions should be installed side-by-side and referenced using the full path. Alternatively, delete the package directory manually and install it again. Many CI systems will do this automatically if they do not preserve files between builds.
es: En general, los paquetes nuget no son actualizables, y versiones más nuevas deben ser instaladas en paralelo y referenciadas usando la ruta completa. Otra opción es borrar el directorio del paquete de forma manual e instalarlo de nuevo. Muchos sistemas de CI harán esto automáticamente si no mantienen archivos entre compilaciones.

source: Alongside the ``tools`` directory is a ``build\native`` directory. This contains a MSBuild properties file ``python.props`` that can be used in a C++ project to reference the Python install. Including the settings will automatically use the headers and import libraries in your build.
es: Junto al directorio ``tools`` está el directorio ``build\native``. Este contiene un archivo de propiedades MSBuild ``Python.props`` que puede ser usado en un proyecto C++ para referenciar la instalación de Python. Al incluir las configuraciones, automáticamente se usarán los encabezados y se importarán las bibliotecas en la compilación.

source: The package information pages on nuget.org are `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ for the 64-bit version and `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ for the 32-bit version.
es: Las páginas de información del paquete en nuget.org son `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ para la versión de 64 bit y `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ para la versión de 32 bit.

source: The embeddable package
es: El paquete incrustable

source: The embedded distribution is a ZIP file containing a minimal Python environment. It is intended for acting as part of another application, rather than being directly accessed by end-users.
es: La distribución incrustable consiste en un archivo ZIP que contiene un mínimo entorno de Python. Está destinado a ser usado como parte de otra aplicación, en lugar de ser accedido directamente por los usuarios finales.

source: When extracted, the embedded distribution is (almost) fully isolated from the user's system, including environment variables, system registry settings, and installed packages. The standard library is included as pre-compiled and optimized ``.pyc`` files in a ZIP, and ``python3.dll``, ``python37.dll``, ``python.exe`` and ``pythonw.exe`` are all provided. Tcl/tk (including all dependents, such as Idle), pip and the Python documentation are not included.
es: Al ser extraída, la distribución incrustable está (casi) completamente aislada del sistema del usuario, incluyendo variables de entorno, configuraciones del registro del sistema y paquetes instalados. La biblioteca estándar se incluye como archivos ``.pyc`` precompilados y optimizados dentro de un ZIP, y ``python3.dll``, ``python37.dll``, ``python.exe`` y ``pythonw.exe`` están todos proporcionados. Tcl/tk (incluidas sus dependencias, como Idle), pip y la documentación de Python no están incluidos.

source: The embedded distribution does not include the `Microsoft C Runtime <https://docs.microsoft.com/en-US/cpp/windows/latest-supported-vc-redist#visual-studio-2015-2017-2019-and-2022>`_ and it is the responsibility of the application installer to provide this. The runtime may have already been installed on a user's system previously or automatically via Windows Update, and can be detected by finding ``ucrtbase.dll`` in the system directory.
es: La distribución integrada no incluye la `Microsoft C Runtime <https://docs.microsoft.com/en-US/cpp/windows/latest-supported-vc-redist#visual-studio-2015-2017-2019-and-2022>`_ y es responsabilidad del instalador de la aplicación proporcionarlo. Es posible que la biblioteca runtime ya se haya instalado en el sistema de un usuario previamente o automáticamente a través de Windows Update, y se puede detectar al encontrar ``ucrtbase.dll`` en el directorio del sistema.

source: Third-party packages should be installed by the application installer alongside the embedded distribution. Using pip to manage dependencies as for a regular Python installation is not supported with this distribution, though with some care it may be possible to include and use pip for automatic updates. In general, third-party packages should be treated as part of the application ("vendoring") so that the developer can ensure compatibility with newer versions before providing updates to users.
es: Los paquetes de terceros deben ser instalados por el instalador de la aplicación junto a la distribución incrustada. El uso de pip para administrar dependencias como en una instalación de Python regular no es soportado por esta distribución, aunque con cierto cuidado es posible incluir y usar pip para automatizar las actualizaciones. En general, los paquetes de terceros deben ser tratados como parte de la aplicación ("vendoring") para que el desarrollador pueda asegurar la compatibilidad con las nuevas versiones antes de proporcionar actualizaciones a los usuarios.

source: The two recommended use cases for this distribution are described below.
es: Los dos casos de uso recomendados para esta distribución se describen a continuación.

source: Python Application
es: Aplicación Python

source: An application written in Python does not necessarily require users to be aware of that fact. The embedded distribution may be used in this case to include a private version of Python in an install package. Depending on how transparent it should be (or conversely, how professional it should appear), there are two options.
es: Una aplicación escrita en Python no necesariamente requiere que los usuarios sean conscientes de ese hecho. La distribución incrustada puede ser usada en este caso para incluir una versión privada de Python en un paquete de instalación. Dependiendo de lo transparente que deba ser (o por el contrario, de lo profesional que deba parecer), hay dos opciones.

source: Using a specialized executable as a launcher requires some coding, but provides the most transparent experience for users. With a customized launcher, there are no obvious indications that the program is running on Python: icons can be customized, company and version information can be specified, and file associations behave properly. In most cases, a custom launcher should simply be able to call ``Py_Main`` with a hard-coded command line.
es: El uso de un ejecutable especializado como lanzador requiere algo de código, pero proporciona la experiencia más transparente para los usuarios. Con un lanzador personalizado, no hay indicadores obvios de que el programa se ejecuta en Python: los íconos pueden ser personalizados, se puede especificar información de la compañía y de la versión, y las asociaciones de archivos se comportan correctamente. En la mayoría de los casos, un lanzador personalizado debería simplemente poder invocar ``Py_Main`` utilizando una línea de comandos codificada.

source: The simpler approach is to provide a batch file or generated shortcut that directly calls the ``python.exe`` or ``pythonw.exe`` with the required command-line arguments. In this case, the application will appear to be Python and not its actual name, and users may have trouble distinguishing it from other running Python processes or file associations.
es: El enfoque más simple es proporcionar un archivo por lotes o un acceso directo generado que directamente invoque ``python.exe`` o ``pythonw.exe`` con los argumentos de línea de comandos requeridos. En este caso, la aplicación aparecerá como Python y no con su nombre real, y los usuarios podrían tener problemas para distinguirla de otros procesos Python en ejecución o asociaciones de archivos.

source: With the latter approach, packages should be installed as directories alongside the Python executable to ensure they are available on the path. With the specialized launcher, packages can be located in other locations as there is an opportunity to specify the search path before launching the application.
es: Con este último enfoque, los paquetes deben instalarse como directorios junto al ejecutable de Python para asegurar su disponibilidad en la ruta. Con el lanzador especializado, los paquetes pueden encontrarse en otras ubicaciones ya que hay oportunidad de especificar la ruta de búsqueda antes de iniciar la aplicación.

source: Embedding Python
es: Incrustar Python

source: Applications written in native code often require some form of scripting language, and the embedded Python distribution can be used for this purpose. In general, the majority of the application is in native code, and some part will either invoke ``python.exe`` or directly use ``python3.dll``. For either case, extracting the embedded distribution to a subdirectory of the application installation is sufficient to provide a loadable Python interpreter.
es: Las aplicaciones escritas en código nativo frecuentemente requieren algún tipo de lenguaje de scripting, y la distribución de Python incrustada puede ser utilizada con ese propósito. En general, la mayoría de la aplicación utiliza código nativo, y alguna parte invocará ``python.exe`` o usará ``python3.dll`` directamente. Para cualquiera de estos casos, la extracción de la distribución incrustable a un subdirectorio de la instalación de la aplicación es suficiente para proporcionar un intérprete de Python invocable.

source: As with the application use, packages can be installed to any location as there is an opportunity to specify search paths before initializing the interpreter. Otherwise, there is no fundamental differences between using the embedded distribution and a regular installation.
es: Al igual que con el uso de la aplicación, los paquetes pueden ser instalados en cualquier ubicación, ya que existe la posibilidad de especificar rutas de búsqueda antes de inicializar el intérprete. Más allá de esto, no existen diferencias fundamentales entre el uso de la distribución incrustada y una instalación normal.

source: Alternative bundles
es: Distribuciones alternativas

source: Besides the standard CPython distribution, there are modified packages including additional functionality. The following is a list of popular versions and their key features:
es: Además de la distribución estándar de CPython, hay paquetes modificados que incluyen funcionalidad adicional. La siguiente es una lista de versiones populares y sus características clave:

source: Installer with multi-platform compatibility, documentation, PyWin32
es: Instalador compatible con múltiples plataformas, documentación, PyWin32

source: Popular scientific modules (such as numpy, scipy and pandas) and the ``conda`` package manager.
es: Módulos científicos populares (como numpy, scipy y pandas) y el gestor de paquetes ``conda``.

source: "The Next Generation Python Environment and Package Manager".
es: "El administrador de paquetes y entorno de Python de próxima generación".

source: Previously Enthought provided Canopy, but it `reached end of life in 2016 <https://support.enthought.com/hc/en-us/articles/360038600051-Canopy-GUI-end-of-life-transition-to-the-Enthought-Deployment-Manager-EDM-and-Visual-Studio-Code>`_.
es: Anteriormente, Enthought proporcionaba Canopy, pero `llegó al final de su vida en2016 <https://support.enthought.com/hc/en-us/articles/360038600051-Canopy-GUI-end-of-life-transition-to-the-Enthought-Deployment-Manager-EDM-and-Visual-Studio-Code>`_.

source: Windows-specific distribution with prebuilt scientific packages and tools for building packages.
es: Distribución específica para Windows con paquetes científicos precompilados y herramientas para construir paquetes.

source: Note that these packages may not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
es: Tenga en cuenta que estos paquetes pueden no incluir la última versión de Python u otras bibliotecas, y no son mantenidos ni respaldados por el equipo central de Python.

source: Configuring Python
es: Configuración de Python

source: To run Python conveniently from a command prompt, you might consider changing some default environment variables in Windows. While the installer provides an option to configure the PATH and PATHEXT variables for you, this is only reliable for a single, system-wide installation. If you regularly use multiple versions of Python, consider using the :ref:`launcher`.
es: Para ejecutar Python convenientemente desde el símbolo del sistema, puede considerar cambiar algunas variables de entorno predeterminadas de Windows. Si bien el instalador proporciona una opción para configurar las variables PATH y PATHEXT, esto solo es confiable para una única instalación en todo el sistema. Si utiliza varias versiones de Python con regularidad, considere usar el :ref:`launcher`.

source: Excursus: Setting environment variables
es: Excurso: configurar variables de entorno

source: Windows allows environment variables to be configured permanently at both the User level and the System level, or temporarily in a command prompt.
es: Windows permite configurar las variables de entorno de forma permanente a nivel de usuario y a nivel de sistema, o temporalmente en el símbolo del sistema.

source: To temporarily set environment variables, open Command Prompt and use the :command:`set` command:
es: Para configurar una variable de entorno temporal, abra el símbolo del sistema y utilice el comando :command:`set`:

source: These changes will apply to any further commands executed in that console, and will be inherited by any applications started from the console.
es: Estos cambios serán aplicados a cualquier comando que de aquí en más se ejecute en esa consola, y serán heredados por cualquier aplicación iniciada desde esa consola.

source: Including the variable name within percent signs will expand to the existing value, allowing you to add your new value at either the start or the end. Modifying :envvar:`PATH` by adding the directory containing :program:`python.exe` to the start is a common way to ensure the correct version of Python is launched.
es: Si se incluye el nombre de la variable entre signos de porcentaje, esta se expande al valor existente, permitiendo agregar un nuevo valor tanto al principio como al final. Modificar :envvar:`PATH` agregando el directorio que contiene :program:`python.exe` al comienzo es una forma común de asegurar que se ejecuta la versión correcta de Python.
