Repository: python/python-docs-es
Catalog: using/windows.po
Languages: es

source: To permanently modify the default environment variables, click Start and search for 'edit environment variables', or open System properties, :guilabel:`Advanced system settings` and click the :guilabel:`Environment Variables` button. In this dialog, you can add or modify User and System variables. To change System variables, you need non-restricted access to your machine (i.e. Administrator rights).
es: Para modificar permanentemente las variables de entorno predeterminadas, haga click en Inicio y busque 'editar las variables de entorno', o abra Sistema, :guilabel:`Configuración avanzada del sistema` y haga click en el botón :guilabel:`Variables de entorno`. En este diálogo, se pueden agregar o modificar variables del usuario o del sistema. Para cambiar variables del sistema, se necesita acceso no restringido al equipo (por ej. con credenciales de administrador).

source: Windows will concatenate User variables *after* System variables, which may cause unexpected results when modifying :envvar:`PATH`.
es: Windows concatenará las variables de usuario *luego* de las variables del sistema, lo cual puede causar resultados inesperados cuando se modifica :envvar:`PATH`.

source: The :envvar:`PYTHONPATH` variable is used by all versions of Python, so you should not permanently configure it unless the listed paths only include code that is compatible with all of your installed Python versions.
es: Todas las versiones de Python utilizan la variable :envvar:`PYTHONPATH`, por lo que no debe configurarla de forma permanente a menos que las rutas enumeradas solo incluyan código compatible con todas las versiones de Python instaladas.

source: Overview of environment variables on Windows
es: Descripción general de las variables de entorno en Windows

source: The ``set`` command, for temporarily modifying environment variables
es: El comando ``set``, para modificar temporalmente las variables de entorno

source: The ``setx`` command, for permanently modifying environment variables
es: El comando ``setx``, para modificar permanentemente las variables de entorno

source: Finding the Python executable
es: Encontrar el ejecutable de Python

source: Besides using the automatically created start menu entry for the Python interpreter, you might want to start Python in the command prompt. The installer has an option to set that up for you.
es: Además de utilizar la entrada para el intérprete de Python creada automáticamente en el menú de Inicio, es posible que desee iniciar Python desde el símbolo del sistema. El instalador posee una opción para realizar esa configuración.

source: On the first page of the installer, an option labelled "Add Python to PATH" may be selected to have the installer add the install location into the :envvar:`PATH`. The location of the :file:`Scripts\\` folder is also added. This allows you to type :command:`python` to run the interpreter, and :command:`pip` for the package installer. Thus, you can also execute your scripts with command line options, see :ref:`using-on-cmdline` documentation.
es: En la primera página del instalador, la opción llamada "Add Python to PATH" puede ser seleccionada para que el instalador agregue la ubicación de instalación a :envvar:`PATH`. La ubicación del directorio :file:`Scripts\\` también es agregada. Esto permite escribir :command:`python` para iniciar el intérprete, y :command:`pip` para el instalador de paquetes. De esta manera los scripts también pueden ser ejecutados con opciones de línea de comandos, consulte la documentación de :ref:`using-on-cmdline`.

source: If you don't enable this option at install time, you can always re-run the installer, select Modify, and enable it. Alternatively, you can manually modify the :envvar:`PATH` using the directions in :ref:`setting-envvars`. You need to set your :envvar:`PATH` environment variable to include the directory of your Python installation, delimited by a semicolon from other entries. An example variable could look like this (assuming the first two entries already existed)::
es: Si no se activa esta opción durante la instalación, en cualquier momento se puede ejecutar nuevamente el instalador, seleccionar Modify, y activarla. Otra alternativa es modificar :envvar:`PATH` manualmente siguiendo las instrucciones en :ref:`setting-envvars`. Se necesita configurar la variable de entorno :envvar:`PATH` para que incluya el directorio de instalación de Python, separándolo con punto y coma (;) de las otras entradas. Una variable de ejemplo pude verse así (suponiendo que las dos primeras entradas ya existían)::

source: UTF-8 mode
es: Modo UTF-8

source: Windows still uses legacy encodings for the system encoding (the ANSI Code Page). Python uses it for the default encoding of text files (e.g. :func:`locale.getencoding`).
es: Windows todavía usa codificaciones heredadas para la codificación del sistema (la página de códigos ANSI). Python lo usa para la codificación predeterminada de archivos de texto (por ejemplo, :func:`locale.getencoding`).

source: This may cause issues because UTF-8 is widely used on the internet and most Unix systems, including WSL (Windows Subsystem for Linux).
es: Esto puede causar problemas porque UTF-8 es ampliamente utilizado en internet y en la mayoría de los sistemas Unix, incluido WSL (subsistema de Windows para Linux).

source: You can use the :ref:`Python UTF-8 Mode <utf8-mode>` to change the default text encoding to UTF-8. You can enable the :ref:`Python UTF-8 Mode <utf8-mode>` via the ``-X utf8`` command line option, or the ``PYTHONUTF8=1`` environment variable. See :envvar:`PYTHONUTF8` for enabling UTF-8 mode, and :ref:`setting-envvars` for how to modify environment variables.
es: Se puede utilizar el :ref:`modo UTF-8 <utf8-mode>` para cambiar la codificación predeterminada a UTF-8. El :ref:`modo UTF-8 <utf8-mode>` se puede activar mediante la opción de línea de comandos ``-X utf-8``, o con la variable de entorno ``PYTHONUTF8=1``. Consulte :envvar:`PYTHONUTF8` para activar el modo UTF-8, y :ref:`setting-envvars` para saber cómo modificar las variables de entorno.

source: When the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, you can still use the system encoding (the ANSI Code Page) via the "mbcs" codec.
es: Cuando el :ref:`modo UTF-8 de Python <utf8-mode>` es activado, usted puede seguir usando la codificación del sistema (La página de código ANSI) a través del códec "mbcs".

source: Note that adding ``PYTHONUTF8=1`` to the default environment variables will affect all Python 3.7+ applications on your system. If you have any Python 3.7+ applications which rely on the legacy system encoding, it is recommended to set the environment variable temporarily or use the ``-X utf8`` command line option.
es: Tenga en cuenta que agregar ``PYTHONUTF8=1`` a las variables de entorno predeterminadas afectará a todas las aplicaciones de Python 3.7+ en el sistema. Si utiliza alguna aplicación de Python 3.7+ que depende de la codificación heredada del sistema, se recomienda que se configure la variable de entorno solo temporalmente o se use la opción de línea de comandos ``-X utf8``.

source: Even when UTF-8 mode is disabled, Python uses UTF-8 by default on Windows for:
es: Aún con el modo UTF-8 desactivado, Python utiliza UTF-8 de forma predeterminada en Windows para:

source: Console I/O including standard I/O (see :pep:`528` for details).
es: E/S de consola, incluida la E/S estándar (consultar :pep:`528` para más detalles).

source: The :term:`filesystem encoding <filesystem encoding and error handler>` (see :pep:`529` for details).
es: La :term:`codificación del sistema <filesystem encoding and error handler>` (vea :pep:`529` para más detalles).

source: Python Launcher for Windows
es: Lanzador de Python para Windows

source: The Python launcher for Windows is a utility which aids in locating and executing of different Python versions. It allows scripts (or the command-line) to indicate a preference for a specific Python version, and will locate and execute that version.
es: El lanzador de Python para Windows es una utilidad que ayuda en la ubicación y ejecución de diferentes versiones de Python. Este permite que los scripts (o la línea de comandos) indiquen preferencia por una versión específica de Python, y ubicará y ejecutará esa versión.

source: Unlike the :envvar:`PATH` variable, the launcher will correctly select the most appropriate version of Python. It will prefer per-user installations over system-wide ones, and orders by language version rather than using the most recently installed version.
es: A diferencia de la variable :envvar:`PATH`, el lanzador seleccionará correctamente la versión más apropiada de Python. Priorizará instalaciones del usuario por sobre instalaciones de todo el sistema, y ordenará por versión del lenguaje en lugar de utilizar la más recientemente instalada.

source: The launcher was originally specified in :pep:`397`.
es: El lanzador se especificó originalmente en :pep:`397`.

source: Getting started
es: Comenzar

source: From the command-line
es: Desde la línea de comandos

source: System-wide installations of Python 3.3 and later will put the launcher on your :envvar:`PATH`. The launcher is compatible with all available versions of Python, so it does not matter which version is installed. To check that the launcher is available, execute the following command in Command Prompt::
es: Las instalaciones de todo el sistema de Python 3.3 y versiones posteriores colocarán el lanzador en su :envvar:`PATH`. El lanzador es compatible con todas las versiones disponibles de Python, por lo que no importa qué versión esté instalada. Para comprobar que el lanzador está disponible, ejecute el siguiente comando en el símbolo del sistema:

source: You should find that the latest version of Python you have installed is started - it can be exited as normal, and any additional command-line arguments specified will be sent directly to Python.
es: Debería suceder que se inicia la última versión de Python instalada - se puede cerrar normalmente, y todo argumento adicional especificado por línea de comandos será enviado directamente a Python.

source: If you have multiple versions of Python installed (e.g., 3.7 and |version|) you will have noticed that Python |version| was started - to launch Python 3.7, try the command::
es: Si tiene varias versiones de Python instaladas (por ejemplo, 3.7 y |version|), habrá notado que Python |version| se inició: para iniciar Python 3.7, pruebe el comando:

source: If you want the latest version of Python 2 you have installed, try the command::
es: Si quieres la última versión de Python 2 que tienes instalada, prueba el comando::

source: If you see the following error, you do not have the launcher installed::
es: Si ve el siguiente error, no tiene instalado el lanzador::

source: The command::
es: El comando::

source: displays the currently installed version(s) of Python.
es: muestra la(s) versión(es) actualmente instalada(s) de Python.

source: The ``-x.y`` argument is the short form of the ``-V:Company/Tag`` argument, which allows selecting a specific Python runtime, including those that may have come from somewhere other than python.org. Any runtime registered by following :pep:`514` will be discoverable. The ``--list`` command lists all available runtimes using the ``-V:`` format.
es: El argumento ``-x.y`` es la forma corta del argumento ``-V:Compañía/Etiqueta``, que permite seleccionar un entorno de ejecución Python específico, incluidos aquellos que pueden haber provenido de lugares diferentes a python.org. Cualquier entorno registrado siguiendo el :pep:`514` será detectable. El comando ``--list`` muestra todos los entornos disponibles usando el formato ``-V:``.

source: When using the ``-V:`` argument, specifying the Company will limit selection to runtimes from that provider, while specifying only the Tag will select from all providers. Note that omitting the slash implies a tag::
es: Al usar el argumento ``-V:``, especificar la Compañía limitará la selección a entornos de ese proveedor, mientras que especificar solo la Etiqueta seleccionará de todos los proveedores. Tenga en cuenta que omitir la barra implica una etiqueta:

source: The short form of the argument (``-3``) only ever selects from core Python releases, and not other distributions. However, the longer form (``-V:3``) will select from any.
es: La forma corta del argumento (``-3``) solo selecciona de las versiones principales de Python y no de otras distribuciones. Sin embargo, la forma más larga (``-V:3``) seleccionará de cualquiera.

source: The Company is matched on the full string, case-insenitive. The Tag is matched oneither the full string, or a prefix, provided the next character is a dot or a hyphen. This allows ``-V:3.1`` to match ``3.1-32``, but not ``3.10``. Tags are sorted using numerical ordering (``3.10`` is newer than ``3.1``), but are compared using text (``-V:3.01`` does not match ``3.1``).
es: La Compañía se compara con la cadena completa, sin distinguir entre mayúsculas y minúsculas. La Etiqueta se compara ya sea con la cadena completa o con un prefijo, siempre que el siguiente carácter sea un punto o un guión. Esto permite que ``-V:3.1`` coincida con ``3.1-32``, pero no con ``3.10``. Las etiquetas se ordenan numéricamente(``3.10`` es más reciente que ``3.1``), pero se comparan usando texto (``-V:3.01`` no coincide con ``3.1``).

source: Virtual environments
es: Entornos virtuales

source: If the launcher is run with no explicit Python version specification, and a virtual environment (created with the standard library :mod:`venv` module or the external ``virtualenv`` tool) active, the launcher will run the virtual environment's interpreter rather than the global one. To run the global interpreter, either deactivate the virtual environment, or explicitly specify the global Python version.
es: Si el lanzador es ejecutado sin explícita especificación de la versión de Python, y un entorno virtual se encuentra activo (creado con el módulo :mod:`venv` de la biblioteca estándar o con la herramienta externa ``virtualenv``), el lanzador ejecutará el intérprete del entorno virtual en lugar del global. Para ejecutar el intérprete global, desactive el entorno virtual o especifique explícitamente la versión global de Python.

source: From a script
es: Desde un script

source: Let's create a test Python script - create a file called ``hello.py`` with the following contents
es: Vamos a crear un script de Python para una prueba - cree un archivo llamado ``hello.py`` con el siguiente contenido

source: From the directory in which hello.py lives, execute the command::
es: Desde el directorio en el que vive hello.py, ejecute el comando:

source: You should notice the version number of your latest Python 2.x installation is printed. Now try changing the first line to be:
es: Debería notar que se imprime el número de versión de la última instalación de Python 2.x. Ahora pruebe cambiando la primera línea por:

source: Re-executing the command should now print the latest Python 3.x information. As with the above command-line examples, you can specify a more explicit version qualifier. Assuming you have Python 3.7 installed, try changing the first line to ``#! python3.7`` and you should find the 3.7 version information printed.
es: Volver a ejecutar el comando ahora debería imprimir la información más reciente de Python 3.x. Al igual que con los ejemplos de línea de comandos anteriores, puede especificar un calificador de versión más explícito. Suponiendo que tiene instalado Python 3.7, intente cambiar la primera línea a ``#! python3.7`` y debería encontrar la información de la versión 3.7 impresa.

source: Note that unlike interactive use, a bare "python" will use the latest version of Python 2.x that you have installed. This is for backward compatibility and for compatibility with Unix, where the command ``python`` typically refers to Python 2.
es: Tenga en cuenta que a diferencia del uso interactivo, el comando "python" (a secas) utilizará la última versión de Python 2.x que esté instalada. Esto es así por compatibilidad con versiones anteriores y por compatibilidad con Unix, donde el comando ``python`` usualmente refiere a Python 2.

source: From file associations
es: Desde asociaciones de archivos

source: The launcher should have been associated with Python files (i.e. ``.py``, ``.pyw``, ``.pyc`` files) when it was installed. This means that when you double-click on one of these files from Windows explorer the launcher will be used, and therefore you can use the same facilities described above to have the script specify the version which should be used.
es: El lanzador debería haber sido asociado con archivos de Python (por ej. archivos ``.py``, ``.pyw`` y ``.pyc``) cuando fue instalado. Esto significa que cuando se haga doble click sobre alguno de estos archivos desde el explorador de Windows se utilizará el lanzador, por lo que se pueden utilizar las mismas funciones descritas anteriormente para que el script especifique la versión que debería usarse.

source: The key benefit of this is that a single launcher can support multiple Python versions at the same time depending on the contents of the first line.
es: El beneficio clave de esto es que un único lanzador puede soportar múltiples versiones de Python al mismo tiempo dependiendo del contenido de la primera línea.

source: Shebang Lines
es: Líneas shebang

source: If the first line of a script file starts with ``#!``, it is known as a "shebang" line. Linux and other Unix like operating systems have native support for such lines and they are commonly used on such systems to indicate how a script should be executed. This launcher allows the same facilities to be used with Python scripts on Windows and the examples above demonstrate their use.
es: Si la primera línea de un script comienza con ``#!``, esta se denomina línea "shebang". Linux y otros sistemas operativos tipo Unix soportan de forma nativa este tipo de líneas y son comúnmente utilizadas en dichos sistemas para indicar cómo debería ser ejecutado un script. Este lanzador permite que la misma funcionalidad pueda ser utilizada con scripts de Python en Windows, y los ejemplos anteriores demuestran su uso.

source: To allow shebang lines in Python scripts to be portable between Unix and Windows, this launcher supports a number of 'virtual' commands to specify which interpreter to use. The supported virtual commands are:
es: Para permitir que las líneas shebang de scripts de Python sean trasladables entre Unix y Windows, este lanzador soporta varios comandos 'virtuales' para especificar qué intérprete utilizar. Los comandos virtuales soportados son:

source: For example, if the first line of your script starts with
es: Por ejemplo, si la primera línea del script comienza con

source: The default Python will be located and used. As many Python scripts written to work on Unix will already have this line, you should find these scripts can be used by the launcher without modification. If you are writing a new script on Windows which you hope will be useful on Unix, you should use one of the shebang lines starting with ``/usr``.
es: La versión de Python predeterminada será ubicada y utilizada. Como muchos scripts de Python escritos para funcionar en Unix tienen esta línea, debería suceder que estos scripts pueden ser utilizados por el lanzador sin modificaciones. Si está escribiendo un nuevo script en Windows que espera que sea útil en Unix, debería utilizar una de las líneas shebang que comienza con ``/usr``.

source: Any of the above virtual commands can be suffixed with an explicit version (either just the major version, or the major and minor version). Furthermore the 32-bit version can be requested by adding "-32" after the minor version. I.e. ``/usr/bin/python3.7-32`` will request usage of the 32-bit python 3.7.
es: Cualquiera de los comandos virtuales anteriores puede tener como sufijo una versión explícita (ya sea solo la versión principal o la versión principal y secundaria). Además, la versión de 32 bits se puede solicitar agregando "-32" después de la versión secundaria. Es decir. ``/usr/bin/python3.7-32`` solicitará el uso de Python 3.7 de 32 bits.

source: Beginning with python launcher 3.7 it is possible to request 64-bit version by the "-64" suffix. Furthermore it is possible to specify a major and architecture without minor (i.e. ``/usr/bin/python3-64``).
es: Desde la versión 3.7 del lanzador de Python es posible solicitar la versión de 64 bit con el sufijo "-64". Además es posible especificar una versión mayor y la arquitectura sin la versión menor (por ej. ``/usr/bin/python3-64``).

source: The "-64" suffix is deprecated, and now implies "any architecture that is not provably i386/32-bit". To request a specific environment, use the new :samp:`-V:{TAG}` argument with the complete tag.
es: El sufijo "-64" está en desuso y ahora implica "cualquier arquitectura que comprobable no sea i386/32 bits". Para solicitar un entorno específico, use el nuevo argumento :samp:`-V:{TAG}` con la etiqueta completa.

source: The ``/usr/bin/env`` form of shebang line has one further special property. Before looking for installed Python interpreters, this form will search the executable :envvar:`PATH` for a Python executable matching the name provided as the first argument. This corresponds to the behaviour of the Unix ``env`` program, which performs a :envvar:`PATH` search. If an executable matching the first argument after the ``env`` command cannot be found, but the argument starts with ``python``, it will be handled as described for the other virtual commands. The environment variable :envvar:`PYLAUNCHER_NO_SEARCH_PATH` may be set (to any value) to skip this search of :envvar:`PATH`.
es: La forma ``/usr/bin/env`` de la línea shebang tiene otra propiedad especial adicional. Antes de buscar intérpretes de Python instalados, esta forma buscará en el :envvar:`PATH` de ejecución un ejecutable de Python que coincida con el nombre proporcionado como primer argumento. Esto corresponde al comportamiento del programa Unix ``env``, que realiza una búsqueda en :envvar:`PATH`. Si no se puede encontrar un ejecutable que coincida con el primer argumento después del comando ``env`` pero el argumento comienza con ``python``, será manejado como se describe para los otros comandos virtuales. La variable de entorno :envvar:`PYLAUNCHER_NO_SEARCH_PATH` puede ser establecida (a cualquier valor) para omitir esta búsqueda en :envvar:`PATH`.

source: Shebang lines that do not match any of these patterns are looked up in the ``[commands]`` section of the launcher's :ref:`.INI file <launcher-ini>`. This may be used to handle certain commands in a way that makes sense for your system. The name of the command must be a single argument (no spaces in the shebang executable), and the value substituted is the full path to the executable (additional arguments specified in the .INI will be quoted as part of the filename).
es: Las líneas shebang que no coincidan con ninguno de estos patrones se buscan en la sección ``[commands]`` del :ref:`archivo .INI <launcher-ini>` del lanzador. Esto se puede usar para manejar ciertos comandos de una manera que tenga sentido para tu sistema. El nombre del comando debe ser un único argumento (sin espacios en el ejecutable shebang), y el valor sustituido es la ruta completa al ejecutable (los argumentos adicionales especificados en el .INI se citarán como parte del nombre del archivo).
