Repository: python/python-docs-es
Catalog: using/windows.po
Languages: es

source: Using Python on Windows
es: Uso de Python en Windows

source: This document aims to give an overview of Windows-specific behaviour you should know about when using Python on Microsoft Windows.
es: Este documento pretende dar una visión general del comportamiento específico de Windows que se debería conocer al usar Python en Microsoft Windows.

source: Unlike most Unix systems and services, Windows does not include a system supported installation of Python. To make Python available, the CPython team has compiled Windows installers (MSI packages) with every `release <https://www.python.org/download/releases/>`_ for many years. These installers are primarily intended to add a per-user installation of Python, with the core interpreter and library being used by a single user. The installer is also able to install for all users of a single machine, and a separate ZIP file is available for application-local distributions.
es: A diferencia de la mayoría de sistemas y servicios Unix, Windows no incluye una instalación de Python soportada por el sistema. Para hacer que Python esté disponible, el equipo de CPython ha compilado instaladores de Windows (paquetes MSI) con cada `lanzamiento <https://www.python.org/download/releases/>`_ durante muchos años. Estos instaladores están destinados principalmente a agregar una instalación de Python para cada usuario, con el intérprete principal y la biblioteca para ser usados por un solo usuario. El instalador también es capaz de hacer la instalación para todos los usuarios de una única máquina, y un archivo ZIP separado está disponible para distribuciones locales (específicas) para cada aplicación.

source: As specified in :pep:`11`, a Python release only supports a Windows platform while Microsoft considers the platform under extended support. This means that Python |version| supports Windows 8.1 and newer. If you require Windows 7 support, please install Python 3.8.
es: Como se especifica en :pep:`11`, una versión de Python solo admite una plataforma Windows, mientras que Microsoft considera la plataforma con soporte extendido. Esto significa que Python |version| es compatible con Windows 8.1 y versiones posteriores. Si necesita compatibilidad con Windows 7, instale Python 3.8.

source: There are a number of different installers available for Windows, each with certain benefits and downsides.
es: Hay varios instaladores diferentes disponibles para Windows, cada uno con determinados beneficios y desventajas.

source: :ref:`windows-full` contains all components and is the best option for developers using Python for any kind of project.
es: :ref:`windows-full` contiene todos los componentes y es la mejor opción para desarrolladores que usan Python para cualquier clase de proyecto.

source: :ref:`windows-store` is a simple installation of Python that is suitable for running scripts and packages, and using IDLE or other development environments. It requires Windows 10 and above, but can be safely installed without corrupting other programs. It also provides many convenient commands for launching Python and its tools.
es: :ref:`windows-store` es una instalación simple de Python que es adecuada para ejecutar scripts y paquetes y usar IDLE u otros entornos de desarrollo. Requiere Windows 10 o superior, pero se puede instalar de forma segura sin corromper otros programas. También proporciona muchos comandos convenientes para iniciar Python y sus herramientas.

source: :ref:`windows-nuget` are lightweight installations intended for continuous integration systems. It can be used to build Python packages or run scripts, but is not updateable and has no user interface tools.
es: :ref:`windows-nuget` son instalaciones ligeras destinadas a sistemas de integración continua. Puede ser usada para crear paquetes de Python o para ejecutar scripts, pero no es actualizable y no posee herramientas de interfaz de usuario.

source: :ref:`windows-embeddable` is a minimal package of Python suitable for embedding into a larger application.
es: :ref:`windows-embeddable` es un paquete de Python mínimo que es adecuado para incrustar en una aplicación más grande.

source: The full installer
es: El instalador completo

source: Installation steps
es: Pasos para la instalación

source: Four Python |version| installers are available for download - two each for the 32-bit and 64-bit versions of the interpreter. The *web installer* is a small initial download, and it will automatically download the required components as necessary. The *offline installer* includes the components necessary for a default installation and only requires an internet connection for optional features. See :ref:`install-layout-option` for other ways to avoid downloading during installation.
es: Cuatro instaladores de Python |version| están disponibles para descargar - dos por cada una de las versiones de 32-bit y 64-bit del intérprete. El *instalador web* es una pequeña descarga inicial que automáticamente descargará los componentes requeridos cuando sea necesario. El *instalador fuera de línea* incluye los componentes necesarios para una instalación por defecto y solo requiere de una conexión a internet para características opcionales. Consultar :ref:`install-layout-option` para conocer otras formas de evitar descargas durante la instalación.

source: After starting the installer, one of two options may be selected:
es: Luego de iniciar el instalador, se puede seleccionar una de estas dos opciones:

source: If you select "Install Now":
es: Si se selecciona "Install Now":

source: You will *not* need to be an administrator (unless a system update for the C Runtime Library is required or you install the :ref:`launcher` for all users)
es: *No* necesitarás ser administrador (a menos que se requiera una actualización de sistema para C Runtime Library o se necesite instalar el :ref:`launcher` para todos los usuarios)

source: Python will be installed into your user directory
es: Python será instalado en su directorio de usuario

source: The :ref:`launcher` will be installed according to the option at the bottom of the first page
es: El :ref:`launcher` será instalado de acuerdo con la opción en la parte inferior de la primera página

source: The standard library, test suite, launcher and pip will be installed
es: La biblioteca estándar, conjunto de pruebas, lanzador y pip serán instalados

source: If selected, the install directory will be added to your :envvar:`PATH`
es: Si se selecciona, el directorio de instalación se agregará a su :envvar:`PATH`

source: Shortcuts will only be visible for the current user
es: Los accesos directos solo serán visibles para al usuario actual

source: Selecting "Customize installation" will allow you to select the features to install, the installation location and other options or post-install actions. To install debugging symbols or binaries, you will need to use this option.
es: Si selecciona "Customize installation" podrá elegir qué funciones instalar, el destino de la instalación y otras opciones o acciones posinstalación. Para instalar símbolos de depuración o binarios, necesitará usar esta opción.

source: To perform an all-users installation, you should select "Customize installation". In this case:
es: Para realizar una instalación para todos los usuarios, deberá seleccionar "Customize installation". En este caso:

source: You may be required to provide administrative credentials or approval
es: Es posible que deba proporcionar credenciales administrativas o aprobación

source: Python will be installed into the Program Files directory
es: Python será instalado en el directorio Program Files

source: The :ref:`launcher` will be installed into the Windows directory
es: El :ref:`launcher` será instalado en el directorio Windows

source: Optional features may be selected during installation
es: Se pueden seleccionar características opcionales durante la instalación

source: The standard library can be pre-compiled to bytecode
es: La biblioteca estándar puede ser precompilada a bytecode

source: If selected, the install directory will be added to the system :envvar:`PATH`
es: Si se selecciona, el directorio de instalación será agregado al :envvar:`PATH` del sistema

source: Shortcuts are available for all users
es: Los accesos directos están disponibles para todos los usuarios

source: Removing the MAX_PATH Limitation
es: Quitar el límite de MAX_PATH

source: Windows historically has limited path lengths to 260 characters. This meant that paths longer than this would not resolve and errors would result.
es: Windows históricamente ha limitado la longitud de las rutas a 260 caracteres. Esto significaba que rutas de mayor longitud no resolverían y se producirían errores.

source: In the latest versions of Windows, this limitation can be expanded to approximately 32,000 characters. Your administrator will need to activate the "Enable Win32 long paths" group policy, or set ``LongPathsEnabled`` to ``1`` in the registry key ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.
es: En las últimas versiones de Windows, esta limitación se puede ampliar a aproximadamente 32.000 caracteres. Su administrador deberá activar la política de grupo "Habilitar rutas largas de Win32" o establecer ``LongPathsEnabled`` en ``1`` en la clave de registro ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.

source: This allows the :func:`open` function, the :mod:`os` module and most other path functionality to accept and return paths longer than 260 characters.
es: Esto permite que la función :func:`open`, el módulo :mod:`os` y la mayoría de las demás funciones de ruta acepten y retornen rutas de más de 260 caracteres.

source: After changing the above option, no further configuration is required.
es: Luego de cambiar la opción anterior, no es necesaria ninguna otra configuración.

source: Support for long paths was enabled in Python.
es: Se habilitó el soporte para rutas largas en Python.

source: Installing Without UI
es: Instalación sin interfaz de usuario

source: All of the options available in the installer UI can also be specified from the command line, allowing scripted installers to replicate an installation on many machines without user interaction. These options may also be set without suppressing the UI in order to change some of the defaults.
es: Todas las opciones disponibles desde la interfaz de usuario del instalador también pueden especificarse desde la línea de comandos, lo cual permite que instaladores mediante scripts repliquen una instalación en muchas máquinas sin la interacción del usuario. Estas opciones también pueden ser configuradas sin anular la interfaz de usuario con el fin de cambiar alguno de los valores predeterminados.

source: The following options (found by executing the installer with ``/?``) can be passed into the installer:
es: Las siguientes opciones (encontradas al ejecutar el instalador con ``/?``) pueden ser pasadas al instalador

source: Name
es: Nombre

source: Description
es: Descripción

source: to display progress without requiring user interaction
es: para mostrar el progreso sin requerir interacción del usuario

source: to install/uninstall without displaying any UI
es: para instalar/desinstalar sin mostrar ninguna interfaz

source: to prevent user customization
es: para prevenir la personalización del usuario

source: to remove Python (without confirmation)
es: para eliminar Python (sin confirmación)

source: /layout [directory]
es: /layout [directorio]

source: to pre-download all components
es: para pre-descargar todos los componentes

source: /log [filename]
es: /log [nombre de archivo]

source: to specify log files location
es: para especificar la ubicación de los archivos de registro

source: All other options are passed as ``name=value``, where the value is usually ``0`` to disable a feature, ``1`` to enable a feature, or a path. The full list of available options is shown below.
es: Todas las otras opciones se especifican con la forma ``nombre=valor``, siendo el valor usualmente ``0`` para deshabilitar una funcionalidad, ``1`` para habilitar una funcionalidad, o una ruta. La lista completa de opciones disponibles se muestra a continuación.

source: Default
es: Predeterminado

source: Perform a system-wide installation.
es: Realizar una instalación en todo el sistema.

source: The installation directory
es: El directorio de instalación

source: Selected based on InstallAllUsers
es: Seleccionado de acuerdo a InstallAllUsers

source: The default installation directory for all-user installs
es: El directorio predeterminado de instalación cuando se instala para todos los usuarios

source: :file:`%ProgramFiles%\\\ Python X.Y` or :file:`\ %ProgramFiles(x86)%\\\ Python X.Y`
es: :file:`%ProgramFiles%\\\ Python X.Y` o :file:`\ %ProgramFiles(x86)%\\\ Python X.Y`

source: The default install directory for just-for-me installs
es: El directorio predeterminado de instalación para instalaciones del usuario actual solamente

source: The default custom install directory displayed in the UI
es: El valor predeterminado de directorio de instalación personalizado que se muestra en la interfaz de usuario

source: (empty)
es: (vacío)

source: Create file associations if the launcher is also installed.
es: Crear asociaciones de archivos si el lanzador también es instalado.

source: Compile all ``.py`` files to ``.pyc``.
es: Compilar todos los archivos ``.py`` a ``.pyc``.

source: Prepend install and Scripts directories to :envvar:`PATH` and add ``.PY`` to :envvar:`PATHEXT`
es: Anteponga los directorios de instalación y scripts a :envvar:`PATH` y agregue ``.PY`` a :envvar:`PATHEXT`

source: Append install and Scripts directories to :envvar:`PATH` and add ``.PY`` to :envvar:`PATHEXT`
es: Agregue directorios de instalación y scripts a :envvar:`PATH` y agregue ``.PY`` a :envvar:`PATHEXT`

source: Create shortcuts for the interpreter, documentation and IDLE if installed.
es: Crear accesos directos para el intérprete, documentación e IDLE si está instalado.

source: Install Python manual
es: Instalar el manual de Python

source: Install debug binaries
es: Instalar los binarios de depuración

source: Install developer headers and libraries. Omitting this may lead to an unusable installation.
es: Instale encabezados y bibliotecas de desarrollador. Omitir esto puede conducir a una instalación inutilizable.

source: Install :file:`python.exe` and related files. Omitting this may lead to an unusable installation.
es: Instale :file:`python.exe` y archivos relacionados. Omitir esto puede conducir a una instalación inutilizable.

source: Install :ref:`launcher`.
es: Instalar :ref:`launcher`.

source: Installs the launcher for all users. Also requires ``Include_launcher`` to be set to 1
es: Instala el lanzador para todos los usuarios. También requiere que ``Include_launcher`` se establezca en 1

source: Install standard library and extension modules. Omitting this may lead to an unusable installation.
es: Instale la biblioteca estándar y los módulos de extensión. Omitir esto puede conducir a una instalación inutilizable.

source: Install bundled pip and setuptools
es: Instalar los paquetes pip y setuptools

source: Install debugging symbols (``*.pdb``)
es: Instalar los símbolos de depuración (``*.pdb``)

source: Install Tcl/Tk support and IDLE
es: Instalar IDLE y soporte para Tcl/Tk

source: Install standard library test suite
es: Instalar el conjunto de pruebas de la biblioteca estándar

source: Install utility scripts
es: Instalar scripts de utilidades

source: Only installs the launcher. This will override most other options.
es: Instalar solo el lanzador. Esto anulará la mayoría de las otras opciones.

source: Disable most install UI
es: Deshabilitar muchas de las partes de la interfaz de usuario

source: A custom message to display when the simplified install UI is used.
es: Un mensaje personalizado para mostrar cuando se use la versión simplificada de la interfaz de usuario de instalación.

source: For example, to silently install a default, system-wide Python installation, you could use the following command (from an elevated command prompt)::
es: Por ejemplo, para realizar de forma silenciosa una instalación predeterminada de Python para todo el sistema, se puede usar el siguiente comando (desde un símbolo del sistema con privilegios elevados)::

source: To allow users to easily install a personal copy of Python without the test suite, you could provide a shortcut with the following command. This will display a simplified initial page and disallow customization::
es: Para permitir que los usuarios instalen fácilmente una copia personal de Python sin el conjunto de pruebas, se puede proporcionar un acceso directo con el siguiente comando. Esto mostrará una página inicial simplificada y no permitirá la personalización:

source: (Note that omitting the launcher also omits file associations, and is only recommended for per-user installs when there is also a system-wide installation that included the launcher.)
es: (Tener en cuenta que al omitir el lanzador también se omiten las asociaciones de archivos y solo es recomendable hacerlo para instalaciones por usuario cuando ya hay una instalación en todo el sistema que incluye el lanzador.)

source: The options listed above can also be provided in a file named ``unattend.xml`` alongside the executable. This file specifies a list of options and values. When a value is provided as an attribute, it will be converted to a number if possible. Values provided as element text are always left as strings. This example file sets the same options as the previous example:
es: Las opciones enumeradas anteriormente también se pueden proporcionar en un archivo de nombre ``unattend.xml`` junto al ejecutable. Este archivo especifica una lista de opciones y valores. Cuando un valor se proporciona como un atributo, se convertirá a número si es posible. Los valores proporcionados como elementos de texto siempre se dejan como cadenas. Este archivo de ejemplo configura las mismas opciones que el ejemplo anterior:

source: Installing Without Downloading
es: Instalación sin descargas

source: As some features of Python are not included in the initial installer download, selecting those features may require an internet connection. To avoid this need, all possible components may be downloaded on-demand to create a complete *layout* that will no longer require an internet connection regardless of the selected features. Note that this download may be bigger than required, but where a large number of installations are going to be performed it is very useful to have a locally cached copy.
es: Como algunas características de Python no se incluyen con la descarga inicial del instalador, la selección de estas características podría requerir de una conexión a internet. Para evitar esta necesidad, todos los posibles componentes pueden ser descargados a pedido para crear una estructura que no necesitará una conexión a internet, independientemente de las características que se seleccionen. Tener en cuenta que esta descarga puede ser más grande de lo necesario, pero si se va a realizar un gran número de instalaciones es muy útil tener una copia en la caché local.

source: Execute the following command from Command Prompt to download all possible required files. Remember to substitute ``python-3.9.0.exe`` for the actual name of your installer, and to create layouts in their own directories to avoid collisions between files with the same name.
es: Ejecute el siguiente comando desde el símbolo del sistema para descargar todos los archivos necesarios posibles. Recuerde sustituir ``python-3.9.0.exe`` por el nombre real de su instalador y crear diseños en sus propios directorios para evitar colisiones entre archivos con el mismo nombre.

source: You may also specify the ``/quiet`` option to hide the progress display.
es: También se puede especificar la opción ``/quiet`` para no mostrar el progreso.

source: Modifying an install
es: Modificar una instalación

source: Once Python has been installed, you can add or remove features through the Programs and Features tool that is part of Windows. Select the Python entry and choose "Uninstall/Change" to open the installer in maintenance mode.
es: Una vez que Python ha sido instalado, se puede agregar o quitar funciones a través de la herramienta Programas y características que es parte de Windows. Seleccionar la entrada Python y elegir "Desinstalar/Cambiar" para abrir el instalador en modo mantenimiento.

source: "Modify" allows you to add or remove features by modifying the checkboxes - unchanged checkboxes will not install or remove anything. Some options cannot be changed in this mode, such as the install directory; to modify these, you will need to remove and then reinstall Python completely.
es: "Cambiar" permite agregar o eliminar características modificando las casillas de verificación - aquellas casillas que no se cambien no agregarán ni quitarán nada. Algunas opciones no pueden cambiarse de esta forma, como el directorio de instalación; para modificarlas es necesario eliminar y reinstalar Python completamente.

source: "Repair" will verify all the files that should be installed using the current settings and replace any that have been removed or modified.
es: "Reparar" verificará todos los archivos que deben instalarse con la configuración actual y reemplazará los que se hayan eliminado o modificado.

source: "Uninstall" will remove Python entirely, with the exception of the :ref:`launcher`, which has its own entry in Programs and Features.
es: "Desinstalar" eliminará Python completamente, a excepción del :ref:`launcher`, el cual posee su propia entrada en Programas y características.

source: The Microsoft Store package
es: El paquete Microsoft Store

source: The Microsoft Store package is an easily installable Python interpreter that is intended mainly for interactive use, for example, by students.
es: El paquete de Microsoft Store es un intérprete de Python fácilmente instalable destinado principalmente al uso interactivo, por ejemplo, por estudiantes.

source: To install the package, ensure you have the latest Windows 10 updates and search the Microsoft Store app for "Python |version|". Ensure that the app you select is published by the Python Software Foundation, and install it.
es: Para instalar el paquete, asegúrate de tener las últimas actualizaciones de Windows 10 y busca "Python |version|" en Microsoft Store. Comprueba que la aplicación que seleccionas es una publicación de la Python Software Foundation y procede a instalarla.

source: Python will always be available for free on the Microsoft Store. If you are asked to pay for it, you have not selected the correct package.
es: Python siempre estará disponible de forma gratuita en Microsoft Store. Si se te solicita que pagues por él, entonces el paquete seleccionado no es el correcto.

source: After installation, Python may be launched by finding it in Start. Alternatively, it will be available from any Command Prompt or PowerShell session by typing ``python``. Further, pip and IDLE may be used by typing ``pip`` or ``idle``. IDLE can also be found in Start.
es: Luego de la instalación, Python puede iniciarse a través del menú de Inicio. Como alternativa, también estará disponible desde cualquier símbolo del sistema o sesión de PowerShell al escribir ``python``. Además, pip e IDLE pueden ser usados escribiendo ``pip`` o ``idle``. IDLE también puede ser encontrado en el Inicio.
