Repository: python/python-docs-es
Catalog: howto/clinic.po
Languages: es

source: To see all the return converters Argument Clinic supports, along with their parameters (if any), just run ``Tools/clinic/clinic.py --converters`` for the full list.
es: Para ver todos los convertidores devueltos que admite Argument Clinic, junto con sus parámetros (si los hay), simplemente ejecute ``Tools/clinic/clinic.py --converters`` para ver la lista completa.

source: Cloning existing functions
es: Clonando funciones existentes

source: If you have a number of functions that look similar, you may be able to use Clinic's "clone" feature. When you clone an existing function, you reuse:
es: Si tiene varias funciones que parecen similares, es posible que pueda utilizar la función "clone" de Clinic. Cuando clona una función existente, reutiliza:

source: its parameters, including
es: sus parámetros, incluyendo

source: their names,
es: sus nombres,

source: their converters, with all parameters,
es: sus convertidores, con todos los parámetros,

source: their default values,
es: sus valores predeterminados,

source: their per-parameter docstrings,
es: sus docstrings por parámetro,

source: their *kind* (whether they're positional only, positional or keyword, or keyword only), and
es: su *kind* (ya sea solo posicional, posicional o por palabra clave, o solo por palabra clave), y

source: its return converter.
es: su convertidor de retorno.

source: The only thing not copied from the original function is its docstring; the syntax allows you to specify a new docstring.
es: Lo único que no se ha copiado de la función original es su docstring; la sintaxis le permite especificar un nuevo docstring.

source: Here's the syntax for cloning a function::
es: Aquí está la sintaxis para clonar una función::

source: (The functions can be in different modules or classes. I wrote ``module.class`` in the sample just to illustrate that you must use the full path to *both* functions.)
es: (Las funciones pueden estar en diferentes módulos o clases. Escribí ``module.class`` en la muestra solo para ilustrar que debe usar la ruta completa a *ambas* funciones.)

source: Sorry, there's no syntax for partially-cloning a function, or cloning a function then modifying it. Cloning is an all-or nothing proposition.
es: Lo sentimos, no hay sintaxis para clonar parcialmente una función o clonar una función y luego modificarla. La clonación es una propuesta de todo o nada.

source: Also, the function you are cloning from must have been previously defined in the current file.
es: Además, la función desde la que está clonando debe haberse definido previamente en el archivo actual.

source: Calling Python code
es: Llamando código Python

source: The rest of the advanced topics require you to write Python code which lives inside your C file and modifies Argument Clinic's runtime state. This is simple: you simply define a Python block.
es: El resto de los temas avanzados requieren que escriba código Python que vive dentro de su archivo C y modifica el estado de ejecución de Argument Clinic. Esto es simple: simplemente define un bloque de Python.

source: A Python block uses different delimiter lines than an Argument Clinic function block. It looks like this::
es: Un bloque Python utiliza diferentes líneas delimitadoras que un bloque de función de la Argument Clinic. Se parece a esto::

source: All the code inside the Python block is executed at the time it's parsed. All text written to stdout inside the block is redirected into the "output" after the block.
es: Todo el código dentro del bloque de Python se ejecuta en el momento en que se analiza. Todo el texto escrito en stdout dentro del bloque se redirige a la "salida" después del bloque.

source: As an example, here's a Python block that adds a static integer variable to the C code::
es: Como ejemplo, aquí hay un bloque de Python que agrega una variable entera estática al código C ::

source: Using a "self converter"
es: Usando un "auto convertidor"

source: Argument Clinic automatically adds a "self" parameter for you using a default converter. It automatically sets the ``type`` of this parameter to the "pointer to an instance" you specified when you declared the type. However, you can override Argument Clinic's converter and specify one yourself. Just add your own ``self`` parameter as the first parameter in a block, and ensure that its converter is an instance of ``self_converter`` or a subclass thereof.
es: Argument Clinic agrega automáticamente un parámetro "self" para usted usando un convertidor predeterminado. Establece automáticamente el ``tipo`` de este parámetro en el "puntero a una instancia" que especificó cuando declaró el tipo. Sin embargo, puede anular el convertidor de Argument Clinic y especificar uno usted mismo. Simplemente agregue su propio parámetro ``self`` como el primer parámetro en un bloque y asegúrese de que su convertidor sea una instancia de ``self_converter`` o una subclase del mismo.

source: What's the point? This lets you override the type of ``self``, or give it a different default name.
es: ¿Cuál es el punto de? Esto le permite anular el tipo de ``self`` o darle un nombre predeterminado diferente.

source: How do you specify the custom type you want to cast ``self`` to? If you only have one or two functions with the same type for ``self``, you can directly use Argument Clinic's existing ``self`` converter, passing in the type you want to use as the ``type`` parameter::
es: ¿Cómo especifica el tipo personalizado al que desea transmitir ``self``? Si solo tiene una o dos funciones con el mismo tipo para ``self``, puede usar directamente el convertidor ``self`` existente de Argument Clinic, pasando el tipo que desea usar como parámetro de ``type``::

source: On the other hand, if you have a lot of functions that will use the same type for ``self``, it's best to create your own converter, subclassing ``self_converter`` but overwriting the ``type`` member::
es: Por otro lado, si tiene muchas funciones que usarán el mismo tipo para ``self``, es mejor crear su propio convertidor, subclasificando ``self_converter`` pero sobrescribiendo el miembro `` type``:

source: Writing a custom converter
es: Escribiendo un convertidor personalizado

source: As we hinted at in the previous section... you can write your own converters! A converter is simply a Python class that inherits from ``CConverter``. The main purpose of a custom converter is if you have a parameter using the ``O&`` format unit—parsing this parameter means calling a :c:func:`PyArg_ParseTuple` "converter function".
es: Como dijimos en la sección anterior... ¡puedes escribir tus propios convertidores! Un convertidor es simplemente una clase de Python que hereda de ``CConverter``. El propósito principal de un convertidor personalizado es si tiene un parámetro que usa la unidad de formato ``O&``; analizar este parámetro significa llamar a :c:func:`PyArg_ParseTuple` "función de conversión".

source: Your converter class should be named ``*something*_converter``. If the name follows this convention, then your converter class will be automatically registered with Argument Clinic; its name will be the name of your class with the ``_converter`` suffix stripped off. (This is accomplished with a metaclass.)
es: Su clase de convertidor debe llamarse ``*something*_converter``. Si el nombre sigue esta convención, entonces su clase de convertidor se registrará automáticamente con Argument Clinic; su nombre será el nombre de su clase con el sufijo ``_converter`` eliminado. (Esto se logra con una metaclase).

source: You shouldn't subclass ``CConverter.__init__``. Instead, you should write a ``converter_init()`` function. ``converter_init()`` always accepts a ``self`` parameter; after that, all additional parameters *must* be keyword-only. Any arguments passed in to the converter in Argument Clinic will be passed along to your ``converter_init()``.
es: No debe subclasificar ``CConverter.__init__``. En su lugar, debe escribir una función ``converter_init()``. ``converter_init()`` siempre acepta un parámetro ``self``; después de eso, todos los parámetros adicionales *deben* ser solo palabras clave. Cualquier argumento que se pase al convertidor en Argument Clinic se pasará a su ``converter_init()``.

source: There are some additional members of ``CConverter`` you may wish to specify in your subclass. Here's the current list:
es: Hay algunos miembros adicionales de ``CConverter`` que tal vez desee especificar en su subclase. Aquí está la lista actual:

source: The C type to use for this variable. ``type`` should be a Python string specifying the type, e.g. ``int``. If this is a pointer type, the type string should end with ``' *'``.
es: El tipo C que se utilizará para esta variable. ``type`` debe ser una cadena de Python que especifique el tipo, por ejemplo ``int``. Si se trata de un tipo de puntero, la cadena de tipo debe terminar con ``'*'``.

source: The Python default value for this parameter, as a Python value. Or the magic value ``unspecified`` if there is no default.
es: El valor predeterminado de Python para este parámetro, como un valor de Python. O el valor mágico ``unspecified`` si no hay ningún valor predeterminado.

source: ``default`` as it should appear in Python code, as a string. Or ``None`` if there is no default.
es: ``default`` como debería aparecer en el código Python, como una cadena. O ``None`` si no hay un valor predeterminado.

source: ``default`` as it should appear in C code, as a string. Or ``None`` if there is no default.
es: ``default`` como debería aparecer en el código C, como una cadena de caracteres. O ``None`` si no hay un valor predeterminado.

source: The default value used to initialize the C variable when there is no default, but not specifying a default may result in an "uninitialized variable" warning. This can easily happen when using option groups—although properly-written code will never actually use this value, the variable does get passed in to the impl, and the C compiler will complain about the "use" of the uninitialized value. This value should always be a non-empty string.
es: El valor predeterminado utilizado para inicializar la variable C cuando no hay ningún valor predeterminado, pero no especificar un valor predeterminado puede resultar en una advertencia de "variable no inicializada". Esto puede suceder fácilmente cuando se utilizan grupos de opciones, aunque el código escrito correctamente nunca utilizará este valor, la variable se pasa al impl, y el compilador de C se quejará del "uso" del valor no inicializado. Este valor siempre debe ser una cadena de caracteres no vacía.

source: The name of the C converter function, as a string.
es: El nombre de la función de conversión de C, como una cadena de caracteres.

source: A boolean value. If true, Argument Clinic will add a ``&`` in front of the name of the variable when passing it into the impl function.
es: Un valor booleano. Si es verdadero, Argument Clinic agregará un ``&`` delante del nombre de la variable al pasarlo a la función *impl*.

source: A boolean value. If true, Argument Clinic will add a ``&`` in front of the name of the variable when passing it into :c:func:`PyArg_ParseTuple`.
es: Un valor booleano. Si es verdadero, Argument Clinic agregará un ``&`` delante del nombre de la variable al pasarlo a :c:func:`PyArg_ParseTuple`.

source: Here's the simplest example of a custom converter, from ``Modules/zlibmodule.c``::
es: Aquí está el ejemplo más simple de un convertidor personalizado, de ``Modules/zlibmodule.c``:

source: This block adds a converter to Argument Clinic named ``ssize_t``. Parameters declared as ``ssize_t`` will be declared as type ``Py_ssize_t``, and will be parsed by the ``'O&'`` format unit, which will call the ``ssize_t_converter`` converter function. ``ssize_t`` variables automatically support default values.
es: Este bloque agrega un convertidor a Argument Clinic llamado ``ssize_t``. Los parámetros declarados como ``ssize_t`` se declararán como tipo ``Py_ssize_t`` y serán analizados por la unidad de formato ``'O&'``, que llamará a la función de conversión ``ssize_t_converter``. Las variables ``ssize_t`` admiten automáticamente los valores predeterminados.

source: More sophisticated custom converters can insert custom C code to handle initialization and cleanup. You can see more examples of custom converters in the CPython source tree; grep the C files for the string ``CConverter``.
es: Los convertidores personalizados más sofisticados pueden insertar código C personalizado para manejar la inicialización y la limpieza. Puede ver más ejemplos de convertidores personalizados en el árbol de fuentes de CPython; grep los archivos C para la cadena ``CConverter``.

source: Writing a custom return converter
es: Escribiendo un convertidor de retorno personalizado

source: Writing a custom return converter is much like writing a custom converter. Except it's somewhat simpler, because return converters are themselves much simpler.
es: Escribir un convertidor de retorno personalizado es muy parecido a escribir un convertidor personalizado. Excepto que es algo más simple, porque los convertidores de retorno son en sí mismos mucho más simples.

source: Return converters must subclass ``CReturnConverter``. There are no examples yet of custom return converters, because they are not widely used yet. If you wish to write your own return converter, please read ``Tools/clinic/clinic.py``, specifically the implementation of ``CReturnConverter`` and all its subclasses.
es: Los convertidores de retorno deben tener una subclase de ``CReturnConverter``. Todavía no hay ejemplos de convertidores de devoluciones personalizados, porque todavía no se utilizan ampliamente. Si desea escribir su propio convertidor de retorno, lea ``Tools/clinic/clinic.py``, específicamente la implementación de ``CReturnConverter`` y todas sus subclases.

source: METH_O and METH_NOARGS
es: METH_O y METH_NOARGS

source: To convert a function using ``METH_O``, make sure the function's single argument is using the ``object`` converter, and mark the arguments as positional-only::
es: Para convertir una función usando ``METH_O``, asegúrese de que el único argumento de la función esté usando el convertidor de ``object`` y marque los argumentos como solo posicional:

source: To convert a function using ``METH_NOARGS``, just don't specify any arguments.
es: Para convertir una función usando ``METH_NOARGS``, simplemente no especifique ningún argumento.

source: You can still use a self converter, a return converter, and specify a ``type`` argument to the object converter for ``METH_O``.
es: Aún puede usar un autoconvertidor, un convertidor de retorno y especificar un argumento de ``tipo`` para el convertidor de objetos para ``METH_O``.

source: tp_new and tp_init functions
es: funciones tp_new y tp_init

source: You can convert ``tp_new`` and ``tp_init`` functions. Just name them ``__new__`` or ``__init__`` as appropriate. Notes:
es: Puede convertir las funciones ``tp_new`` y ``tp_init``. Simplemente nómbrelos ``__new__`` o ``__init__`` según corresponda. Notas:

source: The function name generated for ``__new__`` doesn't end in ``__new__`` like it would by default. It's just the name of the class, converted into a valid C identifier.
es: El nombre de la función generado para ``__new__`` no termina en ``__new__`` como lo haría por defecto. Es solo el nombre de la clase, convertido en un identificador C válido.

source: No ``PyMethodDef`` ``#define`` is generated for these functions.
es: No se genera ningún ``PyMethodDef`` ``#define`` para estas funciones.

source: ``__init__`` functions return ``int``, not ``PyObject *``.
es: funciones ``__init__`` retornan ``int``, no ``PyObject *``.

source: Use the docstring as the class docstring.
es: Utilice docstring como la clase de documentación.

source: Although ``__new__`` and ``__init__`` functions must always accept both the ``args`` and ``kwargs`` objects, when converting you may specify any signature for these functions that you like. (If your function doesn't support keywords, the parsing function generated will throw an exception if it receives any.)
es: Aunque las funciones ``__new__ `` y ``__init__`` siempre deben aceptar tanto los objetos ``args`` como los ``kwargs``, al realizar la conversión puede especificar cualquier firma para estas funciones que desee. (Si su función no admite palabras clave, la función de análisis generada generará una excepción si recibe alguna).

source: Changing and redirecting Clinic's output
es: Cambiar y redirigir la salida de Clinic

source: It can be inconvenient to have Clinic's output interspersed with your conventional hand-edited C code. Luckily, Clinic is configurable: you can buffer up its output for printing later (or earlier!), or write its output to a separate file. You can also add a prefix or suffix to every line of Clinic's generated output.
es: Puede ser inconveniente tener la salida de Clinic intercalada con su código C convencional editado a mano. Afortunadamente, Clinic es configurable: puede almacenar en búfer su salida para imprimir más tarde (¡o antes!), O escribir su salida en un archivo separado. También puede agregar un prefijo o sufijo a cada línea del resultado generado por Clinic.

source: While changing Clinic's output in this manner can be a boon to readability, it may result in Clinic code using types before they are defined, or your code attempting to use Clinic-generated code before it is defined. These problems can be easily solved by rearranging the declarations in your file, or moving where Clinic's generated code goes. (This is why the default behavior of Clinic is to output everything into the current block; while many people consider this hampers readability, it will never require rearranging your code to fix definition-before-use problems.)
es: Si bien cambiar la salida de la Clínica de esta manera puede ser una bendición para la legibilidad, puede resultar en que el código de la Clínica utilice tipos antes de que se definan, o que su código intente utilizar el código generado por la Clínica antes de que se defina. Estos problemas pueden resolverse fácilmente reorganizando las declaraciones en su archivo o moviendo el código generado por Clinic a donde va. (Esta es la razón por la que el comportamiento predeterminado de Clinic es enviar todo al bloque actual; aunque muchas personas consideran que esto dificulta la legibilidad, nunca será necesario reorganizar su código para solucionar problemas de definición antes de su uso).

source: Let's start with defining some terminology:
es: Comencemos por definir alguna terminología:

source: A field, in this context, is a subsection of Clinic's output. For example, the ``#define`` for the ``PyMethodDef`` structure is a field, called ``methoddef_define``. Clinic has seven different fields it can output per function definition:
es: Un campo, en este contexto, es una subsección del resultado de la Clínica. Por ejemplo, el ``#define`` para la estructura ``PyMethodDef`` es un campo, llamado ``methoddef_define``. La clínica tiene siete campos diferentes que puede generar por definición de función:

source: All the names are of the form ``"<a>_<b>"``, where ``"<a>"`` is the semantic object represented (the parsing function, the impl function, the docstring, or the methoddef structure) and ``"<b>"`` represents what kind of statement the field is. Field names that end in ``"_prototype"`` represent forward declarations of that thing, without the actual body/data of the thing; field names that end in ``"_definition"`` represent the actual definition of the thing, with the body/data of the thing. (``"methoddef"`` is special, it's the only one that ends with ``"_define"``, representing that it's a preprocessor #define.)
es: Todos los nombres tienen la forma ``"<a>_<b>"``, donde ``"<a>"`` es el objeto semántico representado (la función de análisis, la función impl, el docstring o la estructura methoddef) y ``"<b>"`` representa qué tipo de declaración es el campo. Los nombres de campo que terminan en ``"_prototype"`` representan declaraciones hacia adelante de esa cosa, sin el cuerpo/datos reales de la cosa; los nombres de campo que terminan en ``"_definition"`` representan la definición real de la cosa, con el cuerpo/datos de la cosa. (``"methoddef"`` es especial, es el único que termina con ``"_define"``, lo que representa que es un preprocesador #define).

source: A destination is a place Clinic can write output to. There are five built-in destinations:
es: Un destino es un lugar en el que la Clínica puede escribir resultados. Hay cinco destinos incorporados:

source: The default destination: printed in the output section of the current Clinic block.
es: El destino predeterminado: impreso en la sección de salida del bloque Clínico actual.

source: A text buffer where you can save text for later. Text sent here is appended to the end of any existing text. It's an error to have any text left in the buffer when Clinic finishes processing a file.
es: Un búfer de texto donde puede guardar texto para más tarde. El texto enviado aquí se agrega al final de cualquier texto existente. Es un error dejar texto en el búfer cuando Clinic termina de procesar un archivo.

source: A separate "clinic file" that will be created automatically by Clinic. The filename chosen for the file is ``{basename}.clinic{extension}``, where ``basename`` and ``extension`` were assigned the output from ``os.path.splitext()`` run on the current file. (Example: the ``file`` destination for ``_pickle.c`` would be written to ``_pickle.clinic.c``.)
es: Un "archivo clínico" separado que Clinic creará automáticamente. El nombre de archivo elegido para el archivo es ``{basename}.clinic{extension}``, donde a ``basename`` y ``extension`` se les asignó la salida de ``os.path.splitext()`` ejecutar en El archivo actual. (Ejemplo: el destino del ``file`` para ``_pickle.c`` se escribiría en ``_pickle.clinic.c``.)

source: **Important: When using a** ``file`` **destination, you** *must check in* **the generated file!**
es: **Importante: Al usar un destino **``file``**, *debe registrar* **el archivo generado!**

source: A buffer like ``buffer``. However, a two-pass buffer can only be dumped once, and it prints out all text sent to it during all processing, even from Clinic blocks *after* the dumping point.
es: Un búfer como ``buffer``. Sin embargo, un búfer de dos pasadas solo se puede volcar una vez, e imprime todo el texto que se le envía durante todo el procesamiento, incluso desde los bloques de la Clínica *después* del punto de descarga.

source: The text is suppressed—thrown away.
es: El texto se suprime --- se tira.

source: Clinic defines five new directives that let you reconfigure its output.
es: Clinic define cinco nuevas directivas que le permiten reconfigurar su salida.

source: The first new directive is ``dump``:
es: La primera nueva directiva es ``dump``:

source: This dumps the current contents of the named destination into the output of the current block, and empties it. This only works with ``buffer`` and ``two-pass`` destinations.
es: Esto vuelca el contenido actual del destino nombrado en la salida del bloque actual y lo vacía. Esto solo funciona con destinos de ``búfer`` y de ``dos pasadas``.

source: The second new directive is ``output``. The most basic form of ``output`` is like this:
es: La segunda nueva directiva es ``output``. La forma más básica de ``output`` es así:
