Repository: python/python-docs-es
Catalog: howto/clinic.po
Languages: es

source: Here's how to add a per-parameter docstring. The first line of the per-parameter docstring must be indented further than the parameter definition. The left margin of this first line establishes the left margin for the whole per-parameter docstring; all the text you write will be outdented by this amount. You can write as much text as you like, across multiple lines if you wish.
es: A continuación, se explica cómo agregar un docstring por parámetro. La primera línea del docstring por parámetro debe tener más sangría que la definición del parámetro. El margen izquierdo de esta primera línea establece el margen izquierdo para todo el docstring por parámetro; todo el texto que escriba se verá afectado por esta cantidad. Puede escribir todo el texto que desee, en varias líneas si lo desea.

source: Save and close the file, then run ``Tools/clinic/clinic.py`` on it. With luck everything worked---your block now has output, and a ``.c.h`` file has been generated! Reopen the file in your text editor to see::
es: Guarde y cierre el archivo, luego ejecute ``Tools/clinic/clinic.py`` en él. ¡Con suerte, todo funcionó --- su bloque ahora tiene salida y se ha generado un archivo ``.c.h`` ! Vuelva a abrir el archivo en su editor de texto para ver:

source: Obviously, if Argument Clinic didn't produce any output, it's because it found an error in your input. Keep fixing your errors and retrying until Argument Clinic processes your file without complaint.
es: Obviamente, si Argument Clinic no produjo ningún resultado, es porque encontró un error en su entrada. Siga corrigiendo sus errores y vuelva a intentarlo hasta que Argument Clinic procese su archivo sin quejas.

source: For readability, most of the glue code has been generated to a ``.c.h`` file. You'll need to include that in your original ``.c`` file, typically right after the clinic module block::
es: Para facilitar la lectura, la mayor parte del código de pegamento se ha generado en un archivo ``.c.h``. Deberá incluir eso en su archivo ``.c`` original, generalmente justo después del bloque del módulo de la clínica:

source: Double-check that the argument-parsing code Argument Clinic generated looks basically the same as the existing code.
es: Vuelva a verificar que el código de análisis de argumentos generado por Argument Clinic se ve básicamente igual al código existente.

source: First, ensure both places use the same argument-parsing function. The existing code must call either :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords`; ensure that the code generated by Argument Clinic calls the *exact* same function.
es: Primero, asegúrese de que ambos lugares usen la misma función de análisis de argumentos. El código existente debe llamar a :c:func:`PyArg_ParseTuple` o :c:func:`PyArg_ParseTupleAndKeywords`; asegúrese de que el código generado por Argument Clinic llame a la misma *exacta* función.

source: Second, the format string passed in to :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords` should be *exactly* the same as the hand-written one in the existing function, up to the colon or semi-colon.
es: En segundo lugar, la cadena de formato pasada a :c:func:`PyArg_ParseTuple` o :c:func:`PyArg_ParseTupleAndKeywords` debe ser *exactamente* la misma que la escrita a mano en la función existente, hasta los dos puntos o punto y coma.

source: (Argument Clinic always generates its format strings with a ``:`` followed by the name of the function. If the existing code's format string ends with ``;``, to provide usage help, this change is harmless—don't worry about it.)
es: (Argument Clinic siempre genera sus cadenas de caracteres de formato con un ``:`` seguido del nombre de la función. Si la cadena de caracteres de formato del código existente termina con ``;``, para proporcionar ayuda de uso, este cambio es inofensivo; no se preocupe)

source: Third, for parameters whose format units require two arguments (like a length variable, or an encoding string, or a pointer to a conversion function), ensure that the second argument is *exactly* the same between the two invocations.
es: En tercer lugar, para los parámetros cuyas unidades de formato requieren dos argumentos (como una variable de longitud, una cadena de codificación o un puntero a una función de conversión), asegúrese de que el segundo argumento sea *exactamente* el mismo entre las dos invocaciones.

source: Fourth, inside the output portion of the block you'll find a preprocessor macro defining the appropriate static :c:type:`PyMethodDef` structure for this builtin::
es: En cuarto lugar, dentro de la parte de salida del bloque, encontrará una macro de preprocesador que define la estructura static :c:type:`PyMethodDef` apropiada para este incorporado::

source: This static structure should be *exactly* the same as the existing static :c:type:`PyMethodDef` structure for this builtin.
es: Esta estructura estática debe ser *exactamente* la misma que la estructura estática existente :c:type:`PyMethodDef` para este incorporado.

source: If any of these items differ in *any way*, adjust your Argument Clinic function specification and rerun ``Tools/clinic/clinic.py`` until they *are* the same.
es: Si alguno de estos elementos difiere *de alguna manera*, ajuste la especificación de la función de Argument Clinic y vuelva a ejecutar ``Tools/clinic/clinic.py`` hasta que *sean* iguales.

source: Notice that the last line of its output is the declaration of your "impl" function. This is where the builtin's implementation goes. Delete the existing prototype of the function you're modifying, but leave the opening curly brace. Now delete its argument parsing code and the declarations of all the variables it dumps the arguments into. Notice how the Python arguments are now arguments to this impl function; if the implementation used different names for these variables, fix it.
es: Observe que la última línea de su salida es la declaración de su función "impl". Aquí es donde va la implementación incorporada. Elimine el prototipo existente de la función que está modificando, pero deje la llave de apertura. Ahora elimine su código de análisis de argumentos y las declaraciones de todas las variables en las que vierte los argumentos. Observe cómo los argumentos de Python ahora son argumentos para esta función implícita; si la implementación usó nombres diferentes para estas variables, corríjalo.

source: Let's reiterate, just because it's kind of weird. Your code should now look like this::
es: Reiteremos, solo porque es un poco extraño. Su código ahora debería verse así:

source: Argument Clinic generated the checksum line and the function prototype just above it. You should write the opening (and closing) curly braces for the function, and the implementation inside.
es: Argument Clinic generó la línea de suma de comprobación y el prototipo de función justo encima de ella. Debe escribir las llaves de apertura (y cierre) para la función y la implementación en el interior.

source: Remember the macro with the :c:type:`PyMethodDef` structure for this function? Find the existing :c:type:`PyMethodDef` structure for this function and replace it with a reference to the macro. (If the builtin is at module scope, this will probably be very near the end of the file; if the builtin is a class method, this will probably be below but relatively near to the implementation.)
es: ¿Recuerda la macro con la estructura :c:type:`PyMethodDef` para esta función? Busque la estructura existente :c:type:`PyMethodDef` para esta función y la reemplaza con una referencia a la macro. (Si el incorporado está en el alcance del módulo, esto probablemente estará muy cerca del final del archivo; si el incorporado es un método de clase, probablemente estará debajo pero relativamente cerca de la implementación).

source: Note that the body of the macro contains a trailing comma. So when you replace the existing static :c:type:`PyMethodDef` structure with the macro, *don't* add a comma to the end.
es: Tenga en cuenta que el cuerpo de la macro contiene una coma al final. Entonces, cuando reemplace la estructura static :c:type:`PyMethodDef` existente con la macro, *no* agregue una coma al final.

source: Compile, then run the relevant portions of the regression-test suite. This change should not introduce any new compile-time warnings or errors, and there should be no externally-visible change to Python's behavior.
es: Compile y luego ejecute las partes relevantes del conjunto de pruebas de regresión. Este cambio no debería introducir nuevas advertencias o errores en tiempo de compilación, y no debería haber ningún cambio visible desde el exterior en el comportamiento de Python.

source: Well, except for one difference: ``inspect.signature()`` run on your function should now provide a valid signature!
es: Bueno, excepto por una diferencia: ``inspect.signature()`` ejecutar en su función ahora debería proporcionar una firma válida!

source: Congratulations, you've ported your first function to work with Argument Clinic!
es: ¡Felicitaciones, ha adaptado su primera función para trabajar con Argument Clinic!

source: Advanced Topics
es: Temas avanzados

source: Now that you've had some experience working with Argument Clinic, it's time for some advanced topics.
es: Ahora que ha tenido algo de experiencia trabajando con Argument Clinic, es hora de algunos temas avanzados.

source: Symbolic default values
es: Valores predeterminados simbólicos

source: The default value you provide for a parameter can't be any arbitrary expression. Currently the following are explicitly supported:
es: El valor predeterminado que proporcione para un parámetro no puede ser una expresión arbitraria. Actualmente, lo siguiente se admite explícitamente:

source: Numeric constants (integer and float)
es: Constantes numéricas (enteros y flotantes)

source: String constants
es: Constantes de cadena de caracteres

source: ``True``, ``False``, and ``None``
es: ``True``, ``False``, y ``None``

source: Simple symbolic constants like ``sys.maxsize``, which must start with the name of the module
es: Constantes simbólicas simples como ``sys.maxsize``, que debe comenzar con el nombre del módulo

source: In case you're curious, this is implemented in ``from_builtin()`` in ``Lib/inspect.py``.
es: En caso de que tenga curiosidad, esto se implementa en ``from_builtin()`` en ``Lib/inspect.py``.

source: (In the future, this may need to get even more elaborate, to allow full expressions like ``CONSTANT - 1``.)
es: (En el futuro, esto puede necesitar ser aún más elaborado, para permitir expresiones completas como ``CONSTANT - 1``.)

source: Renaming the C functions and variables generated by Argument Clinic
es: Cambiar el nombre de las funciones y variables C generadas por Argument Clinic

source: Argument Clinic automatically names the functions it generates for you. Occasionally this may cause a problem, if the generated name collides with the name of an existing C function. There's an easy solution: override the names used for the C functions. Just add the keyword ``"as"`` to your function declaration line, followed by the function name you wish to use. Argument Clinic will use that function name for the base (generated) function, then add ``"_impl"`` to the end and use that for the name of the impl function.
es: Argument Clinic nombra automáticamente las funciones que genera para usted. Ocasionalmente, esto puede causar un problema, si el nombre generado choca con el nombre de una función C existente. Hay una solución sencilla: anule los nombres utilizados para las funciones de C. Simplemente agregue la palabra clave ``"as"`` a la línea de declaración de su función, seguida del nombre de la función que desea usar. Argument Clinic usará ese nombre de función para la función base (generada), luego agregará ``"_impl"`` al final y lo usará para el nombre de la función impl.

source: For example, if we wanted to rename the C function names generated for ``pickle.Pickler.dump``, it'd look like this::
es: Por ejemplo, si quisiéramos cambiar el nombre de las funciones de C generadas para ``pickle.Pickler.dump``, se vería así:

source: The base function would now be named ``pickler_dumper()``, and the impl function would now be named ``pickler_dumper_impl()``.
es: La función base ahora se llamaría ``pickler_dumper()``, y la función implícita ahora se llamaría ``pickler_dumper_impl()``.

source: Similarly, you may have a problem where you want to give a parameter a specific Python name, but that name may be inconvenient in C. Argument Clinic allows you to give a parameter different names in Python and in C, using the same ``"as"`` syntax::
es: De manera similar, es posible que tenga un problema en el que desee asignar un nombre específico de Python a un parámetro, pero ese nombre puede ser inconveniente en C. Argument Clinic le permite asignar nombres diferentes a un parámetro en Python y en C, usando el mismo ``"as"`` como sintaxis::

source: Here, the name used in Python (in the signature and the ``keywords`` array) would be ``file``, but the C variable would be named ``file_obj``.
es: Aquí, el nombre usado en Python (en la firma y el arreglo de ``keywords``) sería ``file``, pero la variable C se llamaría ``file_obj``.

source: You can use this to rename the ``self`` parameter too!
es: ¡También puede usar esto para cambiar el nombre del parámetro ``self``!

source: Converting functions using PyArg_UnpackTuple
es: Convirtiendo funciones usando PyArg_UnpackTuple

source: To convert a function parsing its arguments with :c:func:`PyArg_UnpackTuple`, simply write out all the arguments, specifying each as an ``object``. You may specify the ``type`` argument to cast the type as appropriate. All arguments should be marked positional-only (add a ``/`` on a line by itself after the last argument).
es: Para convertir una función que analiza sus argumentos con :c:func:`PyArg_UnpackTuple`, simplemente escribe todos los argumentos, especificando cada uno como un ``object``. Puede especificar el argumento ``type`` para convertir el tipo según corresponda. Todos los argumentos deben estar marcados como solo posicionales (agregue un ``/`` en una línea después del último argumento).

source: Currently the generated code will use :c:func:`PyArg_ParseTuple`, but this will change soon.
es: Actualmente, el código generado usará :c:func:`PyArg_ParseTuple`, pero esto cambiará pronto.

source: Optional Groups
es: Grupos opcionales

source: Some legacy functions have a tricky approach to parsing their arguments: they count the number of positional arguments, then use a ``switch`` statement to call one of several different :c:func:`PyArg_ParseTuple` calls depending on how many positional arguments there are. (These functions cannot accept keyword-only arguments.) This approach was used to simulate optional arguments back before :c:func:`PyArg_ParseTupleAndKeywords` was created.
es: Algunas funciones heredadas tienen un enfoque complicado para analizar sus argumentos: cuentan el número de argumentos posicionales, luego usan una instrucción ``switch`` para llamar a una de varias llamadas diferentes :c:func:`PyArg_ParseTuple` dependiendo de cuántos argumentos posicionales existen. (Estas funciones no pueden aceptar argumentos de solo palabras clave). Este enfoque se usó para simular argumentos opcionales antes de que se creara :c:func:`PyArg_ParseTupleAndKeywords`.

source: While functions using this approach can often be converted to use :c:func:`PyArg_ParseTupleAndKeywords`, optional arguments, and default values, it's not always possible. Some of these legacy functions have behaviors :c:func:`PyArg_ParseTupleAndKeywords` doesn't directly support. The most obvious example is the builtin function ``range()``, which has an optional argument on the *left* side of its required argument! Another example is ``curses.window.addch()``, which has a group of two arguments that must always be specified together. (The arguments are called ``x`` and ``y``; if you call the function passing in ``x``, you must also pass in ``y``—and if you don't pass in ``x`` you may not pass in ``y`` either.)
es: Si bien las funciones que utilizan este enfoque a menudo se pueden convertir para usar :c:func:`PyArg_ParseTupleAndKeywords`, argumentos opcionales y valores predeterminados, no siempre es posible. Algunas de estas funciones heredadas tienen comportamientos :c:func:`PyArg_ParseTupleAndKeywords` no admite directamente. El ejemplo más obvio es la función incorporada ``range()``, que tiene un argumento opcional en el lado *izquierdo* de su argumento requerido. Otro ejemplo es ``curses.window.addch()``, que tiene un grupo de dos argumentos que siempre deben especificarse juntos. (Los argumentos se denominan ``x`` e ``y``; si llama a la función pasando ``x``, también debe pasar ``y``, y si no pasa ``x`` tampoco puede pasar ``y``.)

source: In any case, the goal of Argument Clinic is to support argument parsing for all existing CPython builtins without changing their semantics. Therefore Argument Clinic supports this alternate approach to parsing, using what are called *optional groups*. Optional groups are groups of arguments that must all be passed in together. They can be to the left or the right of the required arguments. They can *only* be used with positional-only parameters.
es: En cualquier caso, el objetivo de Argument Clinic es admitir el análisis de argumentos para todas las incorporaciones CPython existentes sin cambiar su semántica. Por lo tanto, Argument Clinic admite este enfoque alternativo de análisis, utilizando lo que se denominan *grupos opcionales*. Los grupos opcionales son grupos de argumentos que deben pasarse todos juntos. Pueden estar a la izquierda o la derecha de los argumentos requeridos. *Solo* se pueden usar con parámetros de solo posición.

source: Optional groups are *only* intended for use when converting functions that make multiple calls to :c:func:`PyArg_ParseTuple`! Functions that use *any* other approach for parsing arguments should *almost never* be converted to Argument Clinic using optional groups. Functions using optional groups currently cannot have accurate signatures in Python, because Python just doesn't understand the concept. Please avoid using optional groups wherever possible.
es: Los grupos opcionales *solo* están pensados para su uso al convertir funciones que realizan múltiples llamadas a :c:func:`PyArg_ParseTuple`! Las funciones que usan *cualquier* otro enfoque para analizar argumentos deben *casi nunca* convertirse a Argument Clinic usando grupos opcionales. Las funciones que utilizan grupos opcionales actualmente no pueden tener firmas precisas en Python, porque Python simplemente no comprende el concepto. Evite el uso de grupos opcionales siempre que sea posible.

source: To specify an optional group, add a ``[`` on a line by itself before the parameters you wish to group together, and a ``]`` on a line by itself after these parameters. As an example, here's how ``curses.window.addch`` uses optional groups to make the first two parameters and the last parameter optional::
es: Para especificar un grupo opcional, agregue un ``[`` en una línea antes de los parámetros que desea agrupar y un ``]`` en una línea después de estos parámetros. Como ejemplo, así es como ``curses.window.addch`` usa grupos opcionales para hacer que los primeros dos parámetros y el último parámetro sean opcionales:

source: Notes:
es: Notas:

source: For every optional group, one additional parameter will be passed into the impl function representing the group. The parameter will be an int named ``group_{direction}_{number}``, where ``{direction}`` is either ``right`` or ``left`` depending on whether the group is before or after the required parameters, and ``{number}`` is a monotonically increasing number (starting at 1) indicating how far away the group is from the required parameters. When the impl is called, this parameter will be set to zero if this group was unused, and set to non-zero if this group was used. (By used or unused, I mean whether or not the parameters received arguments in this invocation.)
es: Para cada grupo opcional, se pasará un parámetro adicional a la función *impl* que representa al grupo. El parámetro será un int llamado ``grupo_{direction}_{number}``, donde ``{direction}`` es ``right`` o ``left`` dependiendo de si el grupo está antes o después los parámetros requeridos, y ``{number}`` es un número que aumenta monótonamente (comenzando en 1) que indica qué tan lejos está el grupo de los parámetros requeridos. Cuando se llama a impl, este parámetro se establecerá en cero si este grupo no se usó, y se establecerá en un valor distinto de cero si se usó este grupo. (Por usado o no usado, me refiero a si los parámetros recibieron argumentos en esta invocación).

source: If there are no required arguments, the optional groups will behave as if they're to the right of the required arguments.
es: Si no hay argumentos requeridos, los grupos opcionales se comportarán como si estuvieran a la derecha de los argumentos requeridos.

source: In the case of ambiguity, the argument parsing code favors parameters on the left (before the required parameters).
es: En el caso de ambigüedad, el código de análisis de argumentos favorece los parámetros de la izquierda (antes de los parámetros requeridos).

source: Optional groups can only contain positional-only parameters.
es: Los grupos opcionales solo pueden contener parámetros posicionales.

source: Optional groups are *only* intended for legacy code. Please do not use optional groups for new code.
es: Los grupos opcionales son *solo* destinados al código heredado. No utilice grupos opcionales para el código nuevo.

source: Using real Argument Clinic converters, instead of "legacy converters"
es: Usar convertidores de Argument Clinic reales, en lugar de "convertidores heredados"

source: To save time, and to minimize how much you need to learn to achieve your first port to Argument Clinic, the walkthrough above tells you to use "legacy converters". "Legacy converters" are a convenience, designed explicitly to make porting existing code to Argument Clinic easier. And to be clear, their use is acceptable when porting code for Python 3.4.
es: Para ahorrar tiempo y minimizar cuánto necesita aprender para lograr su primer puerto a Argument Clinic, el tutorial anterior le indica que use "convertidores heredados". Los "convertidores heredados" son una conveniencia, diseñados explícitamente para facilitar la migración del código existente a Argument Clinic. Y para ser claros, su uso es aceptable al portar código para Python 3.4.

source: However, in the long term we probably want all our blocks to use Argument Clinic's real syntax for converters. Why? A couple reasons:
es: Sin embargo, a largo plazo probablemente queramos que todos nuestros bloques utilicen la sintaxis real de Argument Clinic para los convertidores. ¿Por qué? Un par de razones:

source: The proper converters are far easier to read and clearer in their intent.
es: Los convertidores adecuados son mucho más fáciles de leer y más claros en su intención.

source: There are some format units that are unsupported as "legacy converters", because they require arguments, and the legacy converter syntax doesn't support specifying arguments.
es: Hay algunas unidades de formato que no se admiten como "convertidores heredados", porque requieren argumentos y la sintaxis del convertidor heredado no admite la especificación de argumentos.
