Repository: python/python-docs-es
Catalog: howto/clinic.po
Languages: es

source: This tells Clinic to output *field* to *destination*. ``output`` also supports a special meta-destination, called ``everything``, which tells Clinic to output *all* fields to that *destination*.
es: Esto le dice a la Clínica que envíe *field* a *destination*. ``output`` también admite un metadestino especial, llamado ``everything``, que le dice a Clinic que envíe *todos* los campos a ese *destination*.

source: ``output`` has a number of other functions:
es: ``output`` tiene una serie de otras funciones:

source: ``output push`` and ``output pop`` allow you to push and pop configurations on an internal configuration stack, so that you can temporarily modify the output configuration, then easily restore the previous configuration. Simply push before your change to save the current configuration, then pop when you wish to restore the previous configuration.
es: ``output push`` y ``output pop`` le permiten agregar y quitar configuraciones en una pila de configuración interna, para que pueda modificar temporalmente la configuración de salida, y luego restaurar fácilmente la configuración anterior. Simplemente presione antes de su cambio para guardar la configuración actual, luego haga estallar cuando desee restaurar la configuración anterior.

source: ``output preset`` sets Clinic's output to one of several built-in preset configurations, as follows:
es: ``output preset`` configura la salida de Clinic en una de varias configuraciones preestablecidas incorporadas, de la siguiente manera:

source: Clinic's original starting configuration. Writes everything immediately after the input block.
es: Configuración inicial original de la clínica. Escribe todo inmediatamente después del bloque de entrada.

source: Suppress the ``parser_prototype`` and ``docstring_prototype``, write everything else to ``block``.
es: Suprime el ``parser_prototype`` y ``docstring_prototype``, escribe todo lo demás en ``block``.

source: Designed to write everything to the "clinic file" that it can. You then ``#include`` this file near the top of your file. You may need to rearrange your file to make this work, though usually this just means creating forward declarations for various ``typedef`` and ``PyTypeObject`` definitions.
es: Diseñado para escribir todo lo que pueda en el "archivo clínico". Luego, ``#include`` este archivo cerca de la parte superior de su archivo. Es posible que deba reorganizar su archivo para que esto funcione, aunque generalmente esto solo significa crear declaraciones hacia adelante para varias definiciones de ``typedef`` y ``PyTypeObject``.

source: Suppress the ``parser_prototype`` and ``docstring_prototype``, write the ``impl_definition`` to ``block``, and write everything else to ``file``.
es: Suprima ``parser_prototype`` y ``docstring_prototype``, escriba la ``impl_definition`` en ``block`` y escriba todo lo demás en ``file``.

source: The default filename is ``"{dirname}/clinic/{basename}.h"``.
es: El nombre de archivo predeterminado es ``"{dirname}/clinic/{basename}.h"``.

source: Save up most of the output from Clinic, to be written into your file near the end. For Python files implementing modules or builtin types, it's recommended that you dump the buffer just above the static structures for your module or builtin type; these are normally very near the end. Using ``buffer`` may require even more editing than ``file``, if your file has static ``PyMethodDef`` arrays defined in the middle of the file.
es: Guarde la mayor parte del resultado de Clinic para escribirlo en su archivo cerca del final. Para los archivos Python que implementan módulos o tipos incorporado, se recomienda que descargue el búfer justo encima de las estructuras estáticas para su módulo o tipo incorporado; estos suelen estar muy cerca del final. El uso de ``buffer`` puede requerir incluso más edición que ``file``, si su archivo tiene arreglos estáticos ``PyMethodDef`` definidos en el medio del archivo.

source: Suppress the ``parser_prototype``, ``impl_prototype``, and ``docstring_prototype``, write the ``impl_definition`` to ``block``, and write everything else to ``file``.
es: Suprima el ``parser_prototype``, ``impl_prototype`` y ``docstring_prototype``, escriba ``impl_definition`` en ``block`` y escriba todo lo demás en ``file``.

source: Similar to the ``buffer`` preset, but writes forward declarations to the ``two-pass`` buffer, and definitions to the ``buffer``. This is similar to the ``buffer`` preset, but may require less editing than ``buffer``. Dump the ``two-pass`` buffer near the top of your file, and dump the ``buffer`` near the end just like you would when using the ``buffer`` preset.
es: Similar al ajuste preestablecido de ``buffer``, pero escribe declaraciones hacia adelante en el búfer de ``dos pasadas`` y definiciones en el ``buffer``. Esto es similar al ajuste preestablecido de ``buffer``, pero puede requerir menos edición que ``buffer``. Vierta el búfer de ``dos pasadas`` cerca de la parte superior de su archivo y descargue el ``buffer`` cerca del final como lo haría cuando usa el ajuste preestablecido de ``buffer``.

source: Suppresses the ``impl_prototype``, write the ``impl_definition`` to ``block``, write ``docstring_prototype``, ``methoddef_define``, and ``parser_prototype`` to ``two-pass``, write everything else to ``buffer``.
es: Suprime el ``impl_prototype``, escribe ``impl_definition`` en ``block``, escribe ``docstring_prototype``, ``methoddef_define`` y ``parser_prototype`` en ``two-pass``, escribe todo lo demás en ``buffer``.

source: Similar to the ``buffer`` preset, but writes more things to ``block``, only writing the really big chunks of generated code to ``buffer``. This avoids the definition-before-use problem of ``buffer`` completely, at the small cost of having slightly more stuff in the block's output. Dump the ``buffer`` near the end, just like you would when using the ``buffer`` preset.
es: Similar al ajuste preestablecido de ``buffer``, pero escribe más cosas en ``block``, solo escribe los trozos realmente grandes de código generado en ``buffer``. Esto evita el problema de definición antes del uso de ``buffer`` por completo, con el pequeño costo de tener un poco más de material en la salida del bloque. Vierta el ``buffer`` cerca del final, tal como lo haría cuando usa el ajuste predeterminado de ``buffer``.

source: Suppresses the ``impl_prototype``, write the ``docstring_definition`` and ``parser_definition`` to ``buffer``, write everything else to ``block``.
es: Suprime el ``impl_prototype``, escribe ``docstring_definition`` y ``parser_definition`` en ``buffer``, escribe todo lo demás en ``block``.

source: The third new directive is ``destination``:
es: La tercera nueva directiva es ``destino``:

source: This performs an operation on the destination named ``name``.
es: Esto realiza una operación en el destino llamado ``name``.

source: There are two defined subcommands: ``new`` and ``clear``.
es: Hay dos subcomandos definidos: ``new`` y ``clear``.

source: The ``new`` subcommand works like this:
es: El subcomando ``new`` funciona así:

source: This creates a new destination with name ``<name>`` and type ``<type>``.
es: Esto crea un nuevo destino con el nombre ``<nombre>`` y escribe ``<tipo>``.

source: There are five destination types:
es: Hay cinco tipos de destinos:

source: Throws the text away.
es: Tira el texto.

source: Writes the text to the current block. This is what Clinic originally did.
es: Escribe el texto en el bloque actual. Esto es lo que hizo Clinic originalmente.

source: A simple text buffer, like the "buffer" builtin destination above.
es: Un búfer de texto simple, como el destino incorporado "búfer" anterior.

source: A text file. The file destination takes an extra argument, a template to use for building the filename, like so:
es: Un archivo de texto. El destino del archivo toma un argumento adicional, una plantilla para usar para construir el nombre de archivo, así:

source: destination <name> new <type> <file_template>
es: destino <name> nuevo <type> <file_template>

source: The template can use three strings internally that will be replaced by bits of the filename:
es: La plantilla puede usar tres cadenas internamente que serán reemplazadas por bits del nombre del archivo:

source: The full path to the file, including directory and full filename.
es: La ruta completa al archivo, incluido el directorio y el nombre de archivo completo.

source: The name of the directory the file is in.
es: El nombre del directorio en el que se encuentra el archivo.

source: Just the name of the file, not including the directory.
es: Solo el nombre del archivo, sin incluir el directorio.

source: Basename with the extension clipped off (everything up to but not including the last '.').
es: Nombre de base con la extensión recortada (todo hasta pero sin incluir el último '.').

source: The last '.' and everything after it. If the basename does not contain a period, this will be the empty string.
es: El último '.' y todo lo que sigue. Si el nombre base no contiene un punto, esta será la cadena de caracteres vacía.

source: If there are no periods in the filename, {basename} and {filename} are the same, and {extension} is empty. "{basename}{extension}" is always exactly the same as "{filename}"."
es: Si no hay puntos en el nombre del archivo, {basename} y {filename} son iguales, y {extension} está vacía. "{basename}{extension}" es siempre exactamente igual que "{filename}". "

source: A two-pass buffer, like the "two-pass" builtin destination above.
es: Un búfer de dos pasadas (*two-pass*), como el destino incorporado de "dos pasadas" anterior.

source: The ``clear`` subcommand works like this:
es: El subcomando ``clear`` funciona así:

source: It removes all the accumulated text up to this point in the destination. (I don't know what you'd need this for, but I thought maybe it'd be useful while someone's experimenting.)
es: Elimina todo el texto acumulado hasta este punto en el destino. (No sé para qué necesitarías esto, pero pensé que tal vez sería útil mientras alguien está experimentando).

source: The fourth new directive is ``set``:
es: La cuarta nueva directiva está ``set``:

source: ``set`` lets you set two internal variables in Clinic. ``line_prefix`` is a string that will be prepended to every line of Clinic's output; ``line_suffix`` is a string that will be appended to every line of Clinic's output.
es: ``set`` le permite configurar dos variables internas en la Clínica. ``line_prefix`` es una cadena que se antepondrá a cada línea de salida de la Clínica; ``line_suffix`` es una cadena de caracteres que se agregará a cada línea de salida de la Clínica.

source: Both of these support two format strings:
es: Ambos admiten dos cadenas de caracteres de formato:

source: Turns into the string ``/*``, the start-comment text sequence for C files.
es: Se convierte en la cadena de caracteres ``/*``, la secuencia de texto de inicio de comentario para archivos C.

source: Turns into the string ``*/``, the end-comment text sequence for C files.
es: Se convierte en la cadena ``*/``, la secuencia de texto del comentario final para los archivos C.

source: The final new directive is one you shouldn't need to use directly, called ``preserve``:
es: La nueva directiva final es una que no debería necesitar usar directamente, llamada ``preserve``:

source: This tells Clinic that the current contents of the output should be kept, unmodified. This is used internally by Clinic when dumping output into ``file`` files; wrapping it in a Clinic block lets Clinic use its existing checksum functionality to ensure the file was not modified by hand before it gets overwritten.
es: Esto le dice a Clinic que el contenido actual de la salida debe mantenerse, sin modificaciones. La Clínica lo usa internamente cuando se descarga la salida en archivos de ``file``; envolverlo en un bloque Clinic permite que Clinic use su funcionalidad de suma de comprobación existente para garantizar que el archivo no se modificó a mano antes de sobrescribirlo.

source: The #ifdef trick
es: El truco #ifdef

source: If you're converting a function that isn't available on all platforms, there's a trick you can use to make life a little easier. The existing code probably looks like this::
es: Si está convirtiendo una función que no está disponible en todas las plataformas, hay un truco que puede usar para hacer la vida un poco más fácil. El código existente probablemente se ve así:

source: And then in the ``PyMethodDef`` structure at the bottom the existing code will have:
es: Y luego, en la estructura ``PyMethodDef`` en la parte inferior, el código existente tendrá:

source: In this scenario, you should enclose the body of your impl function inside the ``#ifdef``, like so::
es: En este escenario, debe encerrar el cuerpo de su función *impl* dentro de ``#ifdef``, así:

source: Then, remove those three lines from the ``PyMethodDef`` structure, replacing them with the macro Argument Clinic generated:
es: Luego, elimine esas tres líneas de la estructura ``PyMethodDef``, reemplazándolas con la macro Argument Clinic generada:

source: (You can find the real name for this macro inside the generated code. Or you can calculate it yourself: it's the name of your function as defined on the first line of your block, but with periods changed to underscores, uppercased, and ``"_METHODDEF"`` added to the end.)
es: (Puede encontrar el nombre real de esta macro dentro del código generado. O puede calcularlo usted mismo: es el nombre de su función tal como se define en la primera línea de su bloque, pero con puntos cambiados a guiones bajos, mayúsculas y ``"_METHODDEF"`` agregado al final.)

source: Perhaps you're wondering: what if ``HAVE_FUNCTIONNAME`` isn't defined? The ``MODULE_FUNCTIONNAME_METHODDEF`` macro won't be defined either!
es: Quizás se esté preguntando: ¿qué pasa si ``HAVE_FUNCTIONNAME`` no está definido? ¡La macro ``MODULE_FUNCTIONNAME_METHODDEF`` tampoco se definirá!

source: Here's where Argument Clinic gets very clever. It actually detects that the Argument Clinic block might be deactivated by the ``#ifdef``. When that happens, it generates a little extra code that looks like this::
es: Aquí es donde Argument Clinic se vuelve muy inteligente. De hecho, detecta que el bloqueo de Argument Clinic podría estar desactivado por el ``#ifdef``. Cuando eso sucede, genera un pequeño código adicional que se ve así:

source: That means the macro always works. If the function is defined, this turns into the correct structure, including the trailing comma. If the function is undefined, this turns into nothing.
es: Eso significa que la macro siempre funciona. Si la función está definida, se convierte en la estructura correcta, incluida la coma al final. Si la función no está definida, esto se convierte en nada.

source: However, this causes one ticklish problem: where should Argument Clinic put this extra code when using the "block" output preset? It can't go in the output block, because that could be deactivated by the ``#ifdef``. (That's the whole point!)
es: Sin embargo, esto causa un problema delicado: ¿dónde debería poner Argument Clinic este código adicional cuando se usa el ajuste preestablecido de salida "bloque"? No puede entrar en el bloque de salida, porque podría desactivarse con ``#ifdef``. (¡Ese es todo el punto!)

source: In this situation, Argument Clinic writes the extra code to the "buffer" destination. This may mean that you get a complaint from Argument Clinic:
es: En esta situación, Argument Clinic escribe el código adicional en el destino del "búfer". Esto puede significar que recibe una queja de Argument Clinic:

source: When this happens, just open your file, find the ``dump buffer`` block that Argument Clinic added to your file (it'll be at the very bottom), then move it above the ``PyMethodDef`` structure where that macro is used.
es: Cuando esto suceda, simplemente abra su archivo, busque el bloque ``dump buffer`` que Argument Clinic agregó a su archivo (estará en la parte inferior), luego muévalo arriba de la estructura ``PyMethodDef`` donde esa macro se utiliza.

source: Using Argument Clinic in Python files
es: Usando Argument Clinic en archivos Python

source: It's actually possible to use Argument Clinic to preprocess Python files. There's no point to using Argument Clinic blocks, of course, as the output wouldn't make any sense to the Python interpreter. But using Argument Clinic to run Python blocks lets you use Python as a Python preprocessor!
es: De hecho, es posible utilizar Argument Clinic para preprocesar archivos Python. Por supuesto, no tiene sentido usar bloques de Argument Clinic, ya que la salida no tendría ningún sentido para el intérprete de Python. ¡Pero usar Argument Clinic para ejecutar bloques de Python le permite usar Python como un preprocesador de Python!

source: Since Python comments are different from C comments, Argument Clinic blocks embedded in Python files look slightly different. They look like this:
es: Dado que los comentarios de Python son diferentes de los comentarios de C, los bloques de Argument Clinic incrustados en archivos de Python tienen un aspecto ligeramente diferente. Se ven así:
