Repository: python/python-docs-es
Catalog: howto/clinic.po
Languages: es

source: Argument Clinic How-To
es: *How-To* Argument Clinic

source: author
es: autor

source: Abstract
es: Resumen

source: Argument Clinic is a preprocessor for CPython C files. Its purpose is to automate all the boilerplate involved with writing argument parsing code for "builtins". This document shows you how to convert your first C function to work with Argument Clinic, and then introduces some advanced topics on Argument Clinic usage.
es: Argument Clinic es un preprocesador para archivos CPython C. Su propósito es automatizar todo el texto estándar involucrado con la escritura de código de análisis de argumentos para "incorporados". Este documento le muestra cómo convertir su primera función C para que funcione con Argument Clinic y luego presenta algunos temas avanzados sobre el uso de Argument Clinic.

source: Currently Argument Clinic is considered internal-only for CPython. Its use is not supported for files outside CPython, and no guarantees are made regarding backwards compatibility for future versions. In other words: if you maintain an external C extension for CPython, you're welcome to experiment with Argument Clinic in your own code. But the version of Argument Clinic that ships with the next version of CPython *could* be totally incompatible and break all your code.
es: Actualmente, Argument Clinic se considera solo interno para CPython. Su uso no es compatible con archivos fuera de CPython y no se ofrecen garantías con respecto a la compatibilidad con versiones anteriores. En otras palabras: si mantiene una extensión C externa para CPython, puede experimentar con Argument Clinic en su propio código. Pero la versión de Argument Clinic que se envía con la próxima versión de CPython *podría* ser totalmente incompatible y romper todo su código.

source: The Goals Of Argument Clinic
es: Los objetivos del Argument Clinic

source: Argument Clinic's primary goal is to take over responsibility for all argument parsing code inside CPython. This means that, when you convert a function to work with Argument Clinic, that function should no longer do any of its own argument parsing—the code generated by Argument Clinic should be a "black box" to you, where CPython calls in at the top, and your code gets called at the bottom, with ``PyObject *args`` (and maybe ``PyObject *kwargs``) magically converted into the C variables and types you need.
es: El objetivo principal de Argument Clinic es asumir la responsabilidad de todo el código de análisis de argumentos dentro de CPython. Esto significa que, cuando convierte una función para que funcione con Argument Clinic, esa función ya no debería realizar ninguno de sus propios análisis de argumentos; el código generado por Argument Clinic debería ser una "caja negra" para usted, donde CPython llama al top, y su código se llama en la parte inferior, con ``PyObject *args`` (y tal vez ``PyObject *kwargs``) convertido mágicamente en las variables y tipos C que necesita.

source: In order for Argument Clinic to accomplish its primary goal, it must be easy to use. Currently, working with CPython's argument parsing library is a chore, requiring maintaining redundant information in a surprising number of places. When you use Argument Clinic, you don't have to repeat yourself.
es: Para que Argument Clinic logre su objetivo principal, debe ser fácil de usar. Actualmente, trabajar con la biblioteca de análisis de argumentos de CPython es una tarea ardua que requiere mantener información redundante en un número sorprendente de lugares. Cuando usa Argument Clinic, no tiene que repetirse.

source: Obviously, no one would want to use Argument Clinic unless it's solving their problem—and without creating new problems of its own. So it's paramount that Argument Clinic generate correct code. It'd be nice if the code was faster, too, but at the very least it should not introduce a major speed regression. (Eventually Argument Clinic *should* make a major speedup possible—we could rewrite its code generator to produce tailor-made argument parsing code, rather than calling the general-purpose CPython argument parsing library. That would make for the fastest argument parsing possible!)
es: Obviamente, si Argument Clinic no produjo ningún resultado, es porque encontró un error en su entrada. Siga corrigiendo sus errores y vuelva a intentarlo hasta que Argument Clinic procese su archivo sin quejas.

source: Additionally, Argument Clinic must be flexible enough to work with any approach to argument parsing. Python has some functions with some very strange parsing behaviors; Argument Clinic's goal is to support all of them.
es: Además, Argument Clinic debe ser lo suficientemente flexible como para trabajar con cualquier enfoque de análisis de argumentos. Python tiene algunas funciones con algunos comportamientos de análisis muy extraños; El objetivo de Argument Clinic es apoyarlos a todos.

source: Finally, the original motivation for Argument Clinic was to provide introspection "signatures" for CPython builtins. It used to be, the introspection query functions would throw an exception if you passed in a builtin. With Argument Clinic, that's a thing of the past!
es: Finalmente, la motivación original de Argument Clinic era proporcionar "firmas" de introspección para las incorporaciones de CPython. Solía ser, las funciones de consulta de introspección lanzarían una excepción si pasaba un archivo incorporado. ¡Con Argument Clinic, eso es cosa del pasado!

source: One idea you should keep in mind, as you work with Argument Clinic: the more information you give it, the better job it'll be able to do. Argument Clinic is admittedly relatively simple right now. But as it evolves it will get more sophisticated, and it should be able to do many interesting and smart things with all the information you give it.
es: Una idea que debe tener en cuenta al trabajar con Argument Clinic: cuanta más información le dé, mejor será su trabajo. Argument Clinic es ciertamente relativamente simple en este momento. Pero a medida que evolucione, se volverá más sofisticado y debería poder hacer muchas cosas interesantes e inteligentes con toda la información que le proporcione.

source: Basic Concepts And Usage
es: Conceptos básicos y uso

source: Argument Clinic ships with CPython; you'll find it in ``Tools/clinic/clinic.py``. If you run that script, specifying a C file as an argument:
es: Argument Clinic se envía con CPython; lo encontrará en ``Tools/clinic/clinic.py``. Si ejecuta ese script, especificando un archivo C como argumento:

source: Argument Clinic will scan over the file looking for lines that look exactly like this:
es: Argument Clinic escaneará el archivo buscando líneas que se vean exactamente así:

source: When it finds one, it reads everything up to a line that looks exactly like this:
es: Cuando encuentra uno, lee todo hasta una línea que se ve exactamente así:

source: Everything in between these two lines is input for Argument Clinic. All of these lines, including the beginning and ending comment lines, are collectively called an Argument Clinic "block".
es: Todo lo que se encuentra entre estas dos líneas es entrada para Argument Clinic. Todas estas líneas, incluidas las líneas de comentarios iniciales y finales, se denominan colectivamente un "bloque" de Argument Clinic.

source: When Argument Clinic parses one of these blocks, it generates output. This output is rewritten into the C file immediately after the block, followed by a comment containing a checksum. The Argument Clinic block now looks like this:
es: Cuando Argument Clinic analiza uno de estos bloques, genera una salida. Esta salida se reescribe en el archivo C inmediatamente después del bloque, seguida de un comentario que contiene una suma de comprobación. El bloque Argument Clinic ahora tiene este aspecto:

source: If you run Argument Clinic on the same file a second time, Argument Clinic will discard the old output and write out the new output with a fresh checksum line. However, if the input hasn't changed, the output won't change either.
es: Si ejecuta Argument Clinic en el mismo archivo por segunda vez, Argument Clinic descartará la salida anterior y escribirá la nueva salida con una nueva línea de suma de comprobación. Sin embargo, si la entrada no ha cambiado, la salida tampoco cambiará.

source: You should never modify the output portion of an Argument Clinic block. Instead, change the input until it produces the output you want. (That's the purpose of the checksum—to detect if someone changed the output, as these edits would be lost the next time Argument Clinic writes out fresh output.)
es: Nunca debe modificar la parte de salida de un bloque de Argument Clinic. En su lugar, cambie la entrada hasta que produzca la salida que desea. (Ese es el propósito de la suma de comprobación: detectar si alguien cambió la salida, ya que estas ediciones se perderían la próxima vez que Argument Clinic escriba una salida nueva).

source: For the sake of clarity, here's the terminology we'll use with Argument Clinic:
es: En aras de la claridad, esta es la terminología que usaremos con Argument Clinic:

source: The first line of the comment (``/*[clinic input]``) is the *start line*.
es: La primera línea del comentario (``/*[clinic input]``) es la *línea de inicio*.

source: The last line of the initial comment (``[clinic start generated code]*/``) is the *end line*.
es: La última línea del comentario inicial (``[clinic start generated code]*/``) es la *línea final*.

source: The last line (``/*[clinic end generated code: checksum=...]*/``) is the *checksum line*.
es: La última línea (``/*[clinic end generated code: checksum=...]*/``) es la *línea de suma de comprobación* (*chemsum line*).

source: In between the start line and the end line is the *input*.
es: Entre la línea de inicio y la línea final está el *input*.

source: In between the end line and the checksum line is the *output*.
es: Entre la línea final y la línea de suma de comprobación se encuentra la *output*.

source: All the text collectively, from the start line to the checksum line inclusively, is the *block*. (A block that hasn't been successfully processed by Argument Clinic yet doesn't have output or a checksum line, but it's still considered a block.)
es: Todo el texto colectivamente, desde la línea de inicio hasta la línea de suma de verificación inclusive, es el *bloque*. (Un bloque que no ha sido procesado con éxito por Argument Clinic todavía no tiene salida o una línea de suma de verificación, pero aún se considera un bloque).

source: Converting Your First Function
es: Convirtiendo su primera función

source: The best way to get a sense of how Argument Clinic works is to convert a function to work with it. Here, then, are the bare minimum steps you'd need to follow to convert a function to work with Argument Clinic. Note that for code you plan to check in to CPython, you really should take the conversion farther, using some of the advanced concepts you'll see later on in the document (like "return converters" and "self converters"). But we'll keep it simple for this walkthrough so you can learn.
es: La mejor manera de tener una idea de cómo funciona Argument Clinic es convertir una función para que funcione con ella. Aquí, entonces, están los pasos mínimos que debe seguir para convertir una función para que funcione con Argument Clinic. Tenga en cuenta que para el código que planea registrar en CPython, realmente debería llevar la conversión más lejos, utilizando algunos de los conceptos avanzados que verá más adelante en el documento (como "convertidores de retorno" y "convertidores automáticos"). Pero lo haremos simple para este tutorial para que pueda aprender.

source: Let's dive in!
es: ¡Vamos a sumergirnos!

source: Make sure you're working with a freshly updated checkout of the CPython trunk.
es: Asegúrese de estar trabajando con una versión recién actualizada de CPython.

source: Find a Python builtin that calls either :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords`, and hasn't been converted to work with Argument Clinic yet. For my example I'm using ``_pickle.Pickler.dump()``.
es: Busca un incorporado de Python que llame a :c:func:`PyArg_ParseTuple` o :c:func:`PyArg_ParseTupleAndKeywords`, y que aún no se haya convertido para funcionar con Argument Clinic. Para mi ejemplo, estoy usando ``_pickle.Pickler.dump()``.

source: If the call to the ``PyArg_Parse`` function uses any of the following format units:
es: Si la llamada a la función ``PyArg_Parse`` usa cualquiera de las siguientes unidades de formato:

source: or if it has multiple calls to :c:func:`PyArg_ParseTuple`, you should choose a different function. Argument Clinic *does* support all of these scenarios. But these are advanced topics—let's do something simpler for your first function.
es: o si tiene múltiples llamadas a :c:func:`PyArg_ParseTuple`, debes elegir una función diferente. Argument Clinic *sí* admite todos estos escenarios. Pero estos son temas avanzados; hagamos algo más simple para su primera función.

source: Also, if the function has multiple calls to :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords` where it supports different types for the same argument, or if the function uses something besides PyArg_Parse functions to parse its arguments, it probably isn't suitable for conversion to Argument Clinic. Argument Clinic doesn't support generic functions or polymorphic parameters.
es: Además, si la función tiene múltiples llamadas a :c:func:`PyArg_ParseTuple` o :c:func:`PyArg_ParseTupleAndKeywords` donde admite diferentes tipos para el mismo argumento, o si la función usa algo además de las funciones PyArg_Parse para analizar sus argumentos, probablemente no sea adecuado para la conversión a Argument Clinic. Argument Clinic no admite funciones genéricas ni parámetros polimórficos.

source: Add the following boilerplate above the function, creating our block::
es: Agrega la siguiente plantilla sobre la función, creando nuestro bloque ::

source: Cut the docstring and paste it in between the ``[clinic]`` lines, removing all the junk that makes it a properly quoted C string. When you're done you should have just the text, based at the left margin, with no line wider than 80 characters. (Argument Clinic will preserve indents inside the docstring.)
es: Corta el docstring y lo pega entre las líneas ``[clinic]``, eliminando toda la basura que la convierte en una cadena C entre comillas. Cuando haya terminado, debería tener solo el texto, basado en el margen izquierdo, sin una línea de más de 80 caracteres. (Argument Clinic conservará las sangrías dentro del docstring).

source: If the old docstring had a first line that looked like a function signature, throw that line away. (The docstring doesn't need it anymore—when you use ``help()`` on your builtin in the future, the first line will be built automatically based on the function's signature.)
es: Si el docstring antiguo tenía una primera línea que parecía una firma de función, elimine esa línea. (El docstring ya no la necesita; cuando use ``help()`` en su incorporado en el futuro, la primera línea se creará automáticamente en función de la firma de la función).

source: Sample::
es: Muestra::

source: If your docstring doesn't have a "summary" line, Argument Clinic will complain. So let's make sure it has one. The "summary" line should be a paragraph consisting of a single 80-column line at the beginning of the docstring.
es: Si su cadena de documentos no tiene una línea de "resumen", Argument Clinic se quejará. Así que asegurémonos de que tenga uno. La línea de "resumen" debe ser un párrafo que consta de una sola línea de 80 columnas al comienzo de la cadena de documentos.

source: (Our example docstring consists solely of a summary line, so the sample code doesn't have to change for this step.)
es: (Nuestro docstring de ejemplo consiste únicamente en una línea de resumen, por lo que el código de muestra no tiene que cambiar para este paso.)

source: Above the docstring, enter the name of the function, followed by a blank line. This should be the Python name of the function, and should be the full dotted path to the function—it should start with the name of the module, include any sub-modules, and if the function is a method on a class it should include the class name too.
es: Sobre el docstring, ingrese el nombre de la función, seguido de una línea en blanco. Este debería ser el nombre de Python de la función, y debería ser la ruta de puntos completa a la función; debería comenzar con el nombre del módulo, incluir cualquier submódulo y, si la función es un método en una clase, debe incluir el nombre de la clase también.

source: If this is the first time that module or class has been used with Argument Clinic in this C file, you must declare the module and/or class. Proper Argument Clinic hygiene prefers declaring these in a separate block somewhere near the top of the C file, in the same way that include files and statics go at the top. (In our sample code we'll just show the two blocks next to each other.)
es: Si es la primera vez que ese módulo o clase se utiliza con Argument Clinic en este archivo C, debe declarar el módulo o la clase. La higiene de la clínica de argumentos apropiados prefiere declararlos en un bloque separado en algún lugar cerca de la parte superior del archivo C, de la misma manera que los archivos de inclusión y las estadísticas van en la parte superior. (En nuestro código de muestra, solo mostraremos los dos bloques uno al lado del otro).

source: The name of the class and module should be the same as the one seen by Python. Check the name defined in the :c:type:`PyModuleDef` or :c:type:`PyTypeObject` as appropriate.
es: El nombre de la clase y el módulo debe ser el mismo que el visto por Python. Compruebe el nombre definido en :c:type:`PyModuleDef` o :c:type:`PyTypeObject` según corresponda.

source: When you declare a class, you must also specify two aspects of its type in C: the type declaration you'd use for a pointer to an instance of this class, and a pointer to the :c:type:`PyTypeObject` for this class.
es: Cuando declaras una clase, también debes especificar dos aspectos de su tipo en C: la declaración de tipo que usarías para un puntero a una instancia de esta clase y un puntero a :c:type:`PyTypeObject` para esto clase.

source: Declare each of the parameters to the function. Each parameter should get its own line. All the parameter lines should be indented from the function name and the docstring.
es: Declare cada uno de los parámetros a la función. Cada parámetro debe tener su propia línea. Todas las líneas de parámetros deben tener sangría del nombre de la función y el docstring.

source: The general form of these parameter lines is as follows:
es: La forma general de estas líneas de parámetros es la siguiente:

source: If the parameter has a default value, add that after the converter:
es: Si el parámetro tiene un valor predeterminado, agréguelo después del convertidor:

source: Argument Clinic's support for "default values" is quite sophisticated; please see :ref:`the section below on default values <default_values>` for more information.
es: El soporte de Argument Clinic para "valores predeterminados" es bastante sofisticado; por favor vea :ref:`la sección a continuación sobre valores predeterminados <default_values>` para más información.

source: Add a blank line below the parameters.
es: Agrega una línea en blanco debajo de los parámetros.

source: What's a "converter"? It establishes both the type of the variable used in C, and the method to convert the Python value into a C value at runtime. For now you're going to use what's called a "legacy converter"—a convenience syntax intended to make porting old code into Argument Clinic easier.
es: ¿Qué es un "convertidor"? Establece tanto el tipo de variable utilizada en C como el método para convertir el valor de Python en un valor de C en tiempo de ejecución. Por ahora, va a utilizar lo que se llama un "convertidor heredado", una sintaxis conveniente destinada a facilitar la migración del código antiguo a Argument Clinic.

source: For each parameter, copy the "format unit" for that parameter from the ``PyArg_Parse()`` format argument and specify *that* as its converter, as a quoted string. ("format unit" is the formal name for the one-to-three character substring of the ``format`` parameter that tells the argument parsing function what the type of the variable is and how to convert it. For more on format units please see :ref:`arg-parsing`.)
es: Para cada parámetro, copie la "unidad de formato" para ese parámetro del argumento de formato ``PyArg_Parse()`` y especifique *eso* como su convertidor, como una cadena entre comillas. ("unidad de formato" es el nombre formal de la subcadena de caracteres de uno a tres caracteres del parámetro ``format`` que le dice a la función de análisis de argumentos cuál es el tipo de variable y cómo convertirla. Para más información sobre las unidades de formato por favor vea :ref:`arg-parsing`.)

source: For multicharacter format units like ``z#``, use the entire two-or-three character string.
es: Para unidades de formato de caracteres múltiples como ``z#``, use la cadena completa de dos o tres caracteres.

source: If your function has ``|`` in the format string, meaning some parameters have default values, you can ignore it. Argument Clinic infers which parameters are optional based on whether or not they have default values.
es: Si su función tiene ``|`` en la cadena de formato, lo que significa que algunos parámetros tienen valores predeterminados, puede ignorarlo. Argument Clinic infiere qué parámetros son opcionales en función de si tienen o no valores predeterminados.

source: If your function has ``$`` in the format string, meaning it takes keyword-only arguments, specify ``*`` on a line by itself before the first keyword-only argument, indented the same as the parameter lines.
es: Si su función tiene ``$`` en la cadena de caracteres de formato, lo que significa que toma argumentos de solo palabras clave, especifique ``*`` en una línea antes del primer argumento de solo palabras clave, con la misma indentación que las líneas de parámetros.

source: (``_pickle.Pickler.dump`` has neither, so our sample is unchanged.)
es: (``_pickle.Pickler.dump`` no tiene ninguno, por lo que nuestro ejemplo no ha cambiado.)

source: If the existing C function calls :c:func:`PyArg_ParseTuple` (as opposed to :c:func:`PyArg_ParseTupleAndKeywords`), then all its arguments are positional-only.
es: Si la función C existente llama a :c:func:`PyArg_ParseTuple` (a diferencia de :c:func:`PyArg_ParseTupleAndKeywords`), entonces todos sus argumentos son solo posicionales.

source: To mark all parameters as positional-only in Argument Clinic, add a ``/`` on a line by itself after the last parameter, indented the same as the parameter lines.
es: Para marcar todos los parámetros como solo posicionales en Argument Clinic, agregue un ``/`` en una línea después del último parámetro, con la misma sangría que las líneas de parámetros.

source: Currently this is all-or-nothing; either all parameters are positional-only, or none of them are. (In the future Argument Clinic may relax this restriction.)
es: Actualmente esto es todo o nada; o todos los parámetros son solo posicionales o ninguno de ellos lo es. (En el futuro, Argument Clinic puede relajar esta restricción).

source: It's helpful to write a per-parameter docstring for each parameter. But per-parameter docstrings are optional; you can skip this step if you prefer.
es: Es útil escribir una cadena de documentos por parámetro para cada parámetro. Pero los docstrings por parámetro son opcionales; puede omitir este paso si lo prefiere.
