Repository: python/python-docs-es
Catalog: howto/clinic.po
Languages: es

source: In the future we may have a new argument parsing library that isn't restricted to what :c:func:`PyArg_ParseTuple` supports; this flexibility won't be available to parameters using legacy converters.
es: En el futuro, es posible que tengamos una nueva biblioteca de análisis de argumentos que no esté restringida a lo que :c:func:`PyArg_ParseTuple` admite; esta flexibilidad no estará disponible para los parámetros que utilizan convertidores heredados.

source: Therefore, if you don't mind a little extra effort, please use the normal converters instead of legacy converters.
es: Por lo tanto, si no le importa un poco de esfuerzo adicional, utilice los convertidores normales en lugar de los convertidores heredados.

source: In a nutshell, the syntax for Argument Clinic (non-legacy) converters looks like a Python function call. However, if there are no explicit arguments to the function (all functions take their default values), you may omit the parentheses. Thus ``bool`` and ``bool()`` are exactly the same converters.
es: En pocas palabras, la sintaxis de los convertidores de Argument Clinic (no heredados) parece una llamada a una función de Python. Sin embargo, si no hay argumentos explícitos para la función (todas las funciones toman sus valores predeterminados), puede omitir los paréntesis. Por tanto, ``bool`` y ``bool()`` son exactamente los mismos convertidores.

source: All arguments to Argument Clinic converters are keyword-only. All Argument Clinic converters accept the following arguments:
es: Todos los argumentos para los convertidores de Argument Clinic son solo de palabras clave. Todos los convertidores de Argument Clinic aceptan los siguientes argumentos:

source: The default value for this parameter when defined in C. Specifically, this will be the initializer for the variable declared in the "parse function". See :ref:`the section on default values <default_values>` for how to use this. Specified as a string.
es: El valor predeterminado para este parámetro cuando se define en C. Específicamente, será el inicializador de la variable declarada en la "función de análisis". Consulte :ref:`la sección sobre valores predeterminados <default_values>` para saber cómo usar esto. Especificado como una cadena de caracteres.

source: The annotation value for this parameter. Not currently supported, because :pep:`8` mandates that the Python library may not use annotations.
es: El valor de anotación para este parámetro. Actualmente no es compatible, porque :pep:`8` exige que la biblioteca de Python no use anotaciones.

source: In addition, some converters accept additional arguments. Here is a list of these arguments, along with their meanings:
es: Además, algunos convertidores aceptan argumentos adicionales. Aquí hay una lista de estos argumentos, junto con sus significados:

source: A set of Python types (and possibly pseudo-types); this restricts the allowable Python argument to values of these types. (This is not a general-purpose facility; as a rule it only supports specific lists of types as shown in the legacy converter table.)
es: Un conjunto de tipos de Python (y posiblemente pseudo-tipos); esto restringe el argumento permitido de Python a valores de estos tipos. (Esta no es una infraestructura de propósito general; por regla general, solo admite listas específicas de tipos como se muestra en la tabla de convertidores heredados).

source: To accept ``None``, add ``NoneType`` to this set.
es: Para aceptar ``None``, agregue ``NoneType`` a este conjunto.

source: Only supported for unsigned integers. The native integer value of this Python argument will be written to the parameter without any range checking, even for negative values.
es: Solo se admite para enteros sin signo. El valor entero nativo de este argumento de Python se escribirá en el parámetro sin ninguna verificación de rango, incluso para valores negativos.

source: Only supported by the ``object`` converter. Specifies the name of a :ref:`C "converter function" <o_ampersand>` to use to convert this object to a native type.
es: Solo compatible con el convertidor de ``objetos``. Especifica el nombre de una :ref:`"función de conversión" C <o_ampersand>` para convertir este objeto en un tipo nativo.

source: Only supported for strings. Specifies the encoding to use when converting this string from a Python str (Unicode) value into a C ``char *`` value.
es: Solo compatible con cadenas de caracteres. Especifica la codificación que se utilizará al convertir esta cadena de un valor Python str (Unicode) en un valor ``char *`` de C.

source: Only supported for the ``object`` converter. Requires that the Python value be a subclass of a Python type, as expressed in C.
es: Solo compatible con el convertidor de ``objetos``. Requiere que el valor de Python sea una subclase de un tipo de Python, como se expresa en C.

source: Only supported for the ``object`` and ``self`` converters. Specifies the C type that will be used to declare the variable. Default value is ``"PyObject *"``.
es: Solo compatible con los convertidores de ``object`` y ``self``. Especifica el tipo C que se utilizará para declarar la variable. El valor predeterminado es ``"PyObject *"``.

source: Only supported for strings. If true, embedded NUL bytes (``'\\0'``) are permitted inside the value. The length of the string will be passed in to the impl function, just after the string parameter, as a parameter named ``<parameter_name>_length``.
es: Solo compatible con cadenas. Si es verdadero, se permiten bytes NUL incrustados (``'\\0'``) dentro del valor. La longitud de la cadena se pasará a la función impl, justo después del parámetro de cadena, como un parámetro llamado ``<parameter_name>_length``.

source: Please note, not every possible combination of arguments will work. Usually these arguments are implemented by specific ``PyArg_ParseTuple`` *format units*, with specific behavior. For example, currently you cannot call ``unsigned_short`` without also specifying ``bitwise=True``. Although it's perfectly reasonable to think this would work, these semantics don't map to any existing format unit. So Argument Clinic doesn't support it. (Or, at least, not yet.)
es: Tenga en cuenta que no todas las combinaciones posibles de argumentos funcionarán. Por lo general, estos argumentos se implementan mediante *unidades de formato* ``PyArg_ParseTuple`` específicas, con un comportamiento específico. Por ejemplo, actualmente no puede llamar a ``unsigned_short`` sin especificar también ``bitwise=True``. Aunque es perfectamente razonable pensar que esto funcionaría, esta semántica no se asigna a ninguna unidad de formato existente. Entonces, Argument Clinic no lo admite. (O, al menos, todavía no).

source: Below is a table showing the mapping of legacy converters into real Argument Clinic converters. On the left is the legacy converter, on the right is the text you'd replace it with.
es: A continuación se muestra una tabla que muestra el mapeo de convertidores heredados en convertidores de Argument Clinic reales. A la izquierda está el convertidor heredado, a la derecha está el texto con el que lo reemplazaría.

source: As an example, here's our sample ``pickle.Pickler.dump`` using the proper converter::
es: Como ejemplo, aquí está nuestro ejemplo ``pickle.Pickler.dump`` usando el convertidor adecuado:

source: One advantage of real converters is that they're more flexible than legacy converters. For example, the ``unsigned_int`` converter (and all the ``unsigned_`` converters) can be specified without ``bitwise=True``. Their default behavior performs range checking on the value, and they won't accept negative numbers. You just can't do that with a legacy converter!
es: Una ventaja de los convertidores reales es que son más flexibles que los convertidores heredados. Por ejemplo, el convertidor ``unsigned_int`` (y todos los convertidores ``unsigned_``) se pueden especificar sin ``bitwise=True``. Su comportamiento predeterminado realiza una verificación de rango en el valor y no aceptarán números negativos. ¡No puedes hacer eso con un convertidor heredado!

source: Argument Clinic will show you all the converters it has available. For each converter it'll show you all the parameters it accepts, along with the default value for each parameter. Just run ``Tools/clinic/clinic.py --converters`` to see the full list.
es: Argument Clinic le mostrará todos los convertidores que tiene disponibles. Para cada convertidor, le mostrará todos los parámetros que acepta, junto con el valor predeterminado para cada parámetro. Simplemente ejecute ``Tools/clinic/clinic.py --converters`` para ver la lista completa.

source: When using the ``Py_buffer`` converter (or the ``'s*'``, ``'w*'``, ``'*y'``, or ``'z*'`` legacy converters), you *must* not call :c:func:`PyBuffer_Release` on the provided buffer. Argument Clinic generates code that does it for you (in the parsing function).
es: Cuando se utiliza el convertidor ``Py_buffer`` (o los convertidores heredados ``'s*'``, ``'w*'``, ``'*y'`` o ``'z*'`` ), *no* debes llamar a :c: func:`PyBuffer_Release` en el búfer provisto. Argument Clinic genera código que lo hace por usted (en la función de análisis).

source: Advanced converters
es: Convertidores avanzados

source: Remember those format units you skipped for your first time because they were advanced? Here's how to handle those too.
es: ¿Recuerda esas unidades de formato que omitió por primera vez porque eran avanzadas? Aquí le mostramos cómo manejarlos también.

source: The trick is, all those format units take arguments—either conversion functions, or types, or strings specifying an encoding. (But "legacy converters" don't support arguments. That's why we skipped them for your first function.) The argument you specified to the format unit is now an argument to the converter; this argument is either ``converter`` (for ``O&``), ``subclass_of`` (for ``O!``), or ``encoding`` (for all the format units that start with ``e``).
es: El truco es que todas esas unidades de formato toman argumentos, ya sean funciones de conversión o tipos, o cadenas que especifican una codificación. (Pero los "convertidores heredados" no admiten argumentos. Por eso los omitimos para su primera función). El argumento que especificó para la unidad de formato ahora es un argumento para el convertidor; este argumento es ``converter`` (para ``O&``), ``subclass_of`` (para ``O!``) o ``encoding`` (para todas las unidades de formato que comienzan con ``e``).

source: When using ``subclass_of``, you may also want to use the other custom argument for ``object()``: ``type``, which lets you set the type actually used for the parameter. For example, if you want to ensure that the object is a subclass of ``PyUnicode_Type``, you probably want to use the converter ``object(type='PyUnicodeObject *', subclass_of='&PyUnicode_Type')``.
es: Al usar ``subclass_of``, es posible que también desee usar el otro argumento personalizado para ``object()``: ``type``, que le permite establecer el tipo que realmente se usa para el parámetro. Por ejemplo, si desea asegurarse de que el objeto es una subclase de ``PyUnicode_Type``, probablemente desee utilizar el convertidor ``object(type='PyUnicodeObject *', subclass_of='&PyUnicode_Type')``.

source: One possible problem with using Argument Clinic: it takes away some possible flexibility for the format units starting with ``e``. When writing a ``PyArg_Parse`` call by hand, you could theoretically decide at runtime what encoding string to pass in to :c:func:`PyArg_ParseTuple`. But now this string must be hard-coded at Argument-Clinic-preprocessing-time. This limitation is deliberate; it made supporting this format unit much easier, and may allow for future optimizations. This restriction doesn't seem unreasonable; CPython itself always passes in static hard-coded encoding strings for parameters whose format units start with ``e``.
es: Un posible problema con el uso de Argument Clinic: elimina cierta flexibilidad posible para las unidades de formato que comienzan con ``e``. Al escribir una llamada ``PyArg_Parse`` a mano, teóricamente podrías decidir en tiempo de ejecución qué cadena de codificación pasar a :c:func:`PyArg_ParseTuple`. Pero ahora esta cadena debe estar codificada en tiempo de preprocesamiento de Argument-Clinic. Esta limitación es deliberada; hizo que el soporte de esta unidad de formato fuera mucho más fácil y puede permitir futuras optimizaciones. Esta restricción no parece irrazonable; el propio CPython siempre pasa cadenas de codificación estáticas codificadas para parámetros cuyas unidades de formato comienzan con ``e``.

source: Parameter default values
es: Valores predeterminados de los parámetros

source: Default values for parameters can be any of a number of values. At their simplest, they can be string, int, or float literals:
es: Los valores predeterminados de los parámetros pueden ser cualquiera de varios valores. En su forma más simple, pueden ser literales string, int o float:

source: They can also use any of Python's built-in constants:
es: También pueden usar cualquiera de las constantes incorporadas de Python:

source: There's also special support for a default value of ``NULL``, and for simple expressions, documented in the following sections.
es: También hay soporte especial para un valor predeterminado de ``NULL`` y para expresiones simples, documentadas en las siguientes secciones.

source: The ``NULL`` default value
es: El valor predeterminado ``NULL``

source: For string and object parameters, you can set them to ``None`` to indicate that there's no default. However, that means the C variable will be initialized to ``Py_None``. For convenience's sakes, there's a special value called ``NULL`` for just this reason: from Python's perspective it behaves like a default value of ``None``, but the C variable is initialized with ``NULL``.
es: Para los parámetros de cadena de caracteres y objeto, puede establecerlos en ``None`` para indicar que no hay ningún valor predeterminado. Sin embargo, eso significa que la variable C se inicializará en ``Py_None``. Por conveniencia, hay un valor especial llamado ``NULL`` solo por esta razón: desde la perspectiva de Python se comporta como un valor predeterminado de ``None``, pero la variable C se inicializa con ``NULL``.

source: Expressions specified as default values
es: Expresiones especificadas como valores predeterminados

source: The default value for a parameter can be more than just a literal value. It can be an entire expression, using math operators and looking up attributes on objects. However, this support isn't exactly simple, because of some non-obvious semantics.
es: El valor predeterminado de un parámetro puede ser más que un valor literal. Puede ser una expresión completa, utilizando operadores matemáticos y buscando atributos en objetos. Sin embargo, este soporte no es exactamente simple, debido a una semántica no obvia.

source: Consider the following example:
es: Considere el siguiente ejemplo:

source: ``sys.maxsize`` can have different values on different platforms. Therefore Argument Clinic can't simply evaluate that expression locally and hard-code it in C. So it stores the default in such a way that it will get evaluated at runtime, when the user asks for the function's signature.
es: ``sys.maxsize`` puede tener diferentes valores en diferentes plataformas. Por lo tanto, Argument Clinic no puede simplemente evaluar esa expresión localmente y codificarla en C. Por lo tanto, almacena el valor predeterminado de tal manera que se evaluará en tiempo de ejecución, cuando el usuario solicite la firma de la función.

source: What namespace is available when the expression is evaluated? It's evaluated in the context of the module the builtin came from. So, if your module has an attribute called "``max_widgets``", you may simply use it:
es: ¿Qué espacio de nombres está disponible cuando se evalúa la expresión? Se evalúa en el contexto del módulo del que procede el incorporado. Entonces, si su módulo tiene un atributo llamado "``max_widgets``", simplemente puede usarlo:

source: If the symbol isn't found in the current module, it fails over to looking in ``sys.modules``. That's how it can find ``sys.maxsize`` for example. (Since you don't know in advance what modules the user will load into their interpreter, it's best to restrict yourself to modules that are preloaded by Python itself.)
es: Si el símbolo no se encuentra en el módulo actual, falla para buscar en ``sys.modules``. Así es como puede encontrar ``sys.maxsize``, por ejemplo. (Dado que no sabe de antemano qué módulos cargará el usuario en su intérprete, es mejor limitarse a los módulos que están precargados por el propio Python).

source: Evaluating default values only at runtime means Argument Clinic can't compute the correct equivalent C default value. So you need to tell it explicitly. When you use an expression, you must also specify the equivalent expression in C, using the ``c_default`` parameter to the converter:
es: La evaluación de los valores predeterminados solo en tiempo de ejecución significa que Argument Clinic no puede calcular el valor predeterminado de C equivalente correcto. Entonces necesitas decirlo explícitamente. Cuando usa una expresión, también debe especificar la expresión equivalente en C, usando el parámetro ``c_default`` para el convertidor:

source: Another complication: Argument Clinic can't know in advance whether or not the expression you supply is valid. It parses it to make sure it looks legal, but it can't *actually* know. You must be very careful when using expressions to specify values that are guaranteed to be valid at runtime!
es: Otra complicación: Argument Clinic no puede saber de antemano si la expresión que proporciona es válida o no. Lo analiza para asegurarse de que parece legal, pero no puede *realmente* saberlo. ¡Debe tener mucho cuidado al usar expresiones para especificar valores que están garantizados para ser válidos en tiempo de ejecución!

source: Finally, because expressions must be representable as static C values, there are many restrictions on legal expressions. Here's a list of Python features you're not permitted to use:
es: Finalmente, dado que las expresiones deben ser representables como valores C estáticos, existen muchas restricciones sobre las expresiones legales. Aquí hay una lista de funciones de Python que no está autorizado a usar:

source: Function calls.
es: Llamadas a funciones.

source: Inline if statements (``3 if foo else 5``).
es: Declaraciones if en línea (``3 if foo else 5``).

source: Automatic sequence unpacking (``*[1, 2, 3]``).
es: Desempaque automático de secuencia (``*[1, 2, 3]``).

source: List/set/dict comprehensions and generator expressions.
es: Comprensiones de list/set/dict y expresiones generadoras.

source: Tuple/list/set/dict literals.
es: Literales tuple/list/set/dict.

source: Using a return converter
es: Usando un convertidor de retorno

source: By default the impl function Argument Clinic generates for you returns ``PyObject *``. But your C function often computes some C type, then converts it into the ``PyObject *`` at the last moment. Argument Clinic handles converting your inputs from Python types into native C types—why not have it convert your return value from a native C type into a Python type too?
es: De forma predeterminada, la función implícita Argument Clinic genera para usted devuelve ``PyObject *``. Pero su función C a menudo calcula algún tipo de C, luego lo convierte en el ``PyObject *`` en el último momento. Argument Clinic se encarga de convertir sus entradas de tipos de Python en tipos C nativos; ¿por qué no convertir su valor de retorno de un tipo C nativo en un tipo Python también?

source: That's what a "return converter" does. It changes your impl function to return some C type, then adds code to the generated (non-impl) function to handle converting that value into the appropriate ``PyObject *``.
es: Eso es lo que hace un "convertidor de retorno". Cambia su función *impl* para devolver algún tipo de C, luego agrega código a la función generada (no implícita) para manejar la conversión de ese valor en el ``PyObject *`` apropiado.

source: The syntax for return converters is similar to that of parameter converters. You specify the return converter like it was a return annotation on the function itself. Return converters behave much the same as parameter converters; they take arguments, the arguments are all keyword-only, and if you're not changing any of the default arguments you can omit the parentheses.
es: La sintaxis de los convertidores de retorno es similar a la de los convertidores de parámetros. Especifica el convertidor de retorno como si fuera una anotación de retorno en la función en sí. Los convertidores de retorno se comportan de la misma manera que los convertidores de parámetros; aceptan argumentos, todos los argumentos son solo palabras clave y, si no está cambiando ninguno de los argumentos predeterminados, puede omitir los paréntesis.

source: (If you use both ``"as"`` *and* a return converter for your function, the ``"as"`` should come before the return converter.)
es: (Si utiliza tanto ``"as" `` *y* un convertidor de retorno para su función, el ``"as"`` debe aparecer antes del convertidor de retorno.)

source: There's one additional complication when using return converters: how do you indicate an error has occurred? Normally, a function returns a valid (non-``NULL``) pointer for success, and ``NULL`` for failure. But if you use an integer return converter, all integers are valid. How can Argument Clinic detect an error? Its solution: each return converter implicitly looks for a special value that indicates an error. If you return that value, and an error has been set (``PyErr_Occurred()`` returns a true value), then the generated code will propagate the error. Otherwise it will encode the value you return like normal.
es: Hay una complicación adicional al usar convertidores de retorno: ¿cómo indica que se ha producido un error? Normalmente, una función devuelve un puntero válido (no ``NULL``) para el éxito y ``NULL`` para el error. Pero si usa un convertidor de retorno de enteros, todos los enteros son válidos. ¿Cómo puede Argument Clinic detectar un error? Su solución: cada convertidor de retorno busca implícitamente un valor especial que indica un error. Si devuelve ese valor y se ha establecido un error (``PyErr_Occurred()`` retorna un valor verdadero), el código generado propagará el error. De lo contrario, codificará el valor que devuelva como de costumbre.

source: Currently Argument Clinic supports only a few return converters:
es: Actualmente, Argument Clinic solo admite unos pocos convertidores de retorno:

source: None of these take parameters. For the first three, return -1 to indicate error. For ``DecodeFSDefault``, the return type is ``const char *``; return a ``NULL`` pointer to indicate an error.
es: Ninguno de estos toma parámetros. Para los tres primeros, retorna -1 para indicar error. Para ``DecodeFSDefault``, el tipo de retorno es ``const char *``; retorna un puntero ``NULL`` para indicar un error.

source: (There's also an experimental ``NoneType`` converter, which lets you return ``Py_None`` on success or ``NULL`` on failure, without having to increment the reference count on ``Py_None``. I'm not sure it adds enough clarity to be worth using.)
es: (También hay un convertidor experimental ``NoneType``, que le permite devolver ``Py_None`` en caso de éxito o ``NULL`` en caso de falla, sin tener que incrementar el recuento de referencias en ``Py_None``. seguro que agrega suficiente claridad para que valga la pena usarlo)
