Repository: python/python-docs-es
Catalog: howto/curses.po
Languages: es

source: Attributes allow displaying text in highlighted forms such as boldface, underline, reverse code, or in color. They'll be explained in more detail in the next subsection.
es: Los atributos permiten mostrar texto en formas resaltadas como negrita, subrayado, código inverso o en color. Se explicarán con más detalle en la siguiente subsección.

source: The :meth:`~curses.window.addstr` method takes a Python string or bytestring as the value to be displayed. The contents of bytestrings are sent to the terminal as-is. Strings are encoded to bytes using the value of the window's :attr:`encoding` attribute; this defaults to the default system encoding as returned by :func:`locale.getpreferredencoding`.
es: El método :meth:`~curses.window.addstr` toma una cadena de Python o una cadena de bytes como el valor que se mostrará. El contenido de las cadenas de bytes se envía al terminal tal como está. Las cadenas se codifican en bytes utilizando el valor del atributo de la ventana :attr:`encoding`; Esto se establece de manera predeterminada en la codificación predeterminada del sistema que devuelve :func:`locale.getpreferredencoding`.

source: The :meth:`~curses.window.addch` methods take a character, which can be either a string of length 1, a bytestring of length 1, or an integer.
es: Los métodos :meth:`~curses.window.addch` toman un carácter, que puede ser una cadena de longitud 1, una cadena de bytes de longitud 1 o un entero.

source: Constants are provided for extension characters; these constants are integers greater than 255. For example, :const:`ACS_PLMINUS` is a +/- symbol, and :const:`ACS_ULCORNER` is the upper left corner of a box (handy for drawing borders). You can also use the appropriate Unicode character.
es: Se proporcionan constantes para los caracteres de extensión; estas constantes son enteros mayores que 255. Por ejemplo :const:`ACS_PLMINUS` es un símbolo +/-, y :const:`ACS_ULCORNER` es la esquina superior izquierda de un cuadro (útil para dibujar bordes). También puede usar el carácter Unicode apropiado.

source: Windows remember where the cursor was left after the last operation, so if you leave out the *y,x* coordinates, the string or character will be displayed wherever the last operation left off. You can also move the cursor with the ``move(y,x)`` method. Because some terminals always display a flashing cursor, you may want to ensure that the cursor is positioned in some location where it won't be distracting; it can be confusing to have the cursor blinking at some apparently random location.
es: Windows recuerda dónde se dejó el cursor después de la última operación, por lo que si deja de lado las coordenadas *y, x*, la cadena o el carácter se mostrarán donde se haya quedado la última operación. También puede mover el cursor con el método ``move(y, x)``. Debido a que algunos terminales siempre muestran un cursor parpadeante, es posible que desee asegurarse de que el cursor esté ubicado en algún lugar donde no distraiga; Puede ser confuso tener el cursor parpadeando en alguna ubicación aparentemente aleatoria.

source: If your application doesn't need a blinking cursor at all, you can call ``curs_set(False)`` to make it invisible. For compatibility with older curses versions, there's a ``leaveok(bool)`` function that's a synonym for :func:`~curses.curs_set`. When *bool* is true, the curses library will attempt to suppress the flashing cursor, and you won't need to worry about leaving it in odd locations.
es: Si su aplicación no necesita un cursor parpadeante, puede llamar a ``curs_set (False)`` para hacerla invisible. Para compatibilidad con versiones anteriores de curses, hay una función ``jeaveok (bool)`` que es sinónimo de :func:`~curses.curs_set`. Cuando *bool* es verdadero, la biblioteca curses intentará suprimir el cursor parpadeante, y no tendrá que preocuparse por dejarlo en ubicaciones extrañas.

source: Attributes and Color
es: Atributos y color

source: Characters can be displayed in different ways. Status lines in a text-based application are commonly shown in reverse video, or a text viewer may need to highlight certain words. curses supports this by allowing you to specify an attribute for each cell on the screen.
es: Los caracteres se pueden mostrar de diferentes maneras. Las líneas de estado en una aplicación basada en texto se muestran comúnmente en video inverso, o un visor de texto puede necesitar resaltar ciertas palabras. curses admite esto al permitirle especificar un atributo para cada celda en la pantalla.

source: An attribute is an integer, each bit representing a different attribute. You can try to display text with multiple attribute bits set, but curses doesn't guarantee that all the possible combinations are available, or that they're all visually distinct. That depends on the ability of the terminal being used, so it's safest to stick to the most commonly available attributes, listed here.
es: Un atributo es un entero, cada bit representa un atributo diferente. Puede intentar mostrar texto con múltiples conjuntos de bits de atributos, pero curses no garantizan que todas las combinaciones posibles estén disponibles, o que todas sean visualmente distintas. Eso depende de la capacidad del terminal que se utilice, por lo que es más seguro apegarse a los atributos más comúnmente disponibles, enumerados aquí.

source: Attribute
es: Atributo

source: Blinking text
es: Texto parpadeante

source: Extra bright or bold text
es: Texto extra brillante o en negrita

source: Half bright text
es: Texto medio brillante

source: Reverse-video text
es: Texto de video inverso

source: The best highlighting mode available
es: El mejor modo de resaltado disponible

source: Underlined text
es: Texto subrayado

source: So, to display a reverse-video status line on the top line of the screen, you could code::
es: Entonces, para mostrar una línea de estado de video inverso en la línea superior de la pantalla, puede codificar::

source: The curses library also supports color on those terminals that provide it. The most common such terminal is probably the Linux console, followed by color xterms.
es: La biblioteca curses también admite color en los terminales que lo proporcionen. El terminal más común es probablemente la consola de Linux, seguido de *xterms* en color.

source: To use color, you must call the :func:`~curses.start_color` function soon after calling :func:`~curses.initscr`, to initialize the default color set (the :func:`curses.wrapper` function does this automatically). Once that's done, the :func:`~curses.has_colors` function returns TRUE if the terminal in use can actually display color. (Note: curses uses the American spelling 'color', instead of the Canadian/British spelling 'colour'. If you're used to the British spelling, you'll have to resign yourself to misspelling it for the sake of these functions.)
es: Para usar el color, debe llamar a la función :func:`~curses.start_color` poco después de llamar :func:`~curses.initscr`, para inicializar el conjunto de colores predeterminado (la función :func:`curses.wrapper` hace esto automáticamente). Una vez hecho esto, la función :func:`~curses.has_colors` devuelve TRUE si el terminal en uso realmente puede mostrar color. (Nota: curses usa el ‘color’ de la ortografía estadounidense, en lugar del ‘color’ de la ortografía canadiense/británica. Si está acostumbrado a la ortografía británica, tendrá que resignarse a escribir mal por el bien de estas funciones. )

source: The curses library maintains a finite number of color pairs, containing a foreground (or text) color and a background color. You can get the attribute value corresponding to a color pair with the :func:`~curses.color_pair` function; this can be bitwise-OR'ed with other attributes such as :const:`A_REVERSE`, but again, such combinations are not guaranteed to work on all terminals.
es: La biblioteca curses mantiene un número finito de pares de colores, que contienen un color de primer plano (o texto) y un color de fondo. Puede obtener el valor del atributo correspondiente a un par de colores con la función :func:`~curses.color_pair`; esto puede ser operado bit a bit con otros atributos como :const:`A_REVERSE`, pero nuevamente, no se garantiza que tales combinaciones funcionen en todos los terminales.

source: An example, which displays a line of text using color pair 1::
es: Un ejemplo, que muestra una línea de texto usando el par de colores 1 ::

source: As I said before, a color pair consists of a foreground and background color. The ``init_pair(n, f, b)`` function changes the definition of color pair *n*, to foreground color f and background color b. Color pair 0 is hard-wired to white on black, and cannot be changed.
es: Como dije antes, un par de colores consiste en un color de primer plano y de fondo. La función ``init_pair (n, f, b)`` cambia la definición del par de colores *n*, a color de primer plano f y color de fondo b. El par de colores 0 está cableado a blanco sobre negro, y no se puede cambiar.

source: Colors are numbered, and :func:`start_color` initializes 8 basic colors when it activates color mode. They are: 0:black, 1:red, 2:green, 3:yellow, 4:blue, 5:magenta, 6:cyan, and 7:white. The :mod:`curses` module defines named constants for each of these colors: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED`, and so forth.
es: Los colores están numerados y :func:`start_color` inicializa 8 colores básicos cuando activa el modo de color. Son: 0:negro, 1:rojo, 2:verde, 3:amarillo, 4:azul, 5:magenta, 6:cian y 7:blanco. El módulo :mod:`curses` define constantes con nombre para cada uno de estos colores: :const:`curses.COLOR_BLACK`, :const:`curses.COLOR_RED`, y así sucesivamente.

source: Let's put all this together. To change color 1 to red text on a white background, you would call::
es: Pongamos todo esto juntos. Para cambiar el color 1 al texto rojo sobre un fondo blanco, debe llamar a::

source: When you change a color pair, any text already displayed using that color pair will change to the new colors. You can also display new text in this color with::
es: Cuando cambia un par de colores, cualquier texto que ya se muestre usando ese par de colores cambiará a los nuevos colores. También puede mostrar texto nuevo en este color con::

source: Very fancy terminals can change the definitions of the actual colors to a given RGB value. This lets you change color 1, which is usually red, to purple or blue or any other color you like. Unfortunately, the Linux console doesn't support this, so I'm unable to try it out, and can't provide any examples. You can check if your terminal can do this by calling :func:`~curses.can_change_color`, which returns ``True`` if the capability is there. If you're lucky enough to have such a talented terminal, consult your system's man pages for more information.
es: Los terminales muy elegantes pueden cambiar las definiciones de los colores reales a un valor RGB dado. Esto le permite cambiar el color 1, que generalmente es rojo, a púrpura o azul o cualquier otro color que desee. Desafortunadamente, la consola de Linux no admite esto, por lo que no puedo probarlo y no puedo proporcionar ningún ejemplo. Puede verificar si su terminal puede hacer esto llamando a :func:`~curses.can_change_color`, que devuelve ``Verdadero`` si la capacidad está ahí. Si tiene la suerte de tener un terminal tan talentoso, consulte las páginas de manual de su sistema para obtener más información.

source: User Input
es: *Input* del usuario

source: The C curses library offers only very simple input mechanisms. Python's :mod:`curses` module adds a basic text-input widget. (Other libraries such as `Urwid <https://pypi.org/project/urwid/>`_ have more extensive collections of widgets.)
es: La biblioteca C curses ofrece solo mecanismos de entrada muy simples. El módulo Python :mod:`curses` agrega un widget básico de entrada de texto. (Otras bibliotecas como `Urwid <https://pypi.org/project/urwid/>`_ tienen colecciones más extensas de widgets).

source: There are two methods for getting input from a window:
es: Hay dos métodos para obtener información desde una ventana:

source: :meth:`~curses.window.getch` refreshes the screen and then waits for the user to hit a key, displaying the key if :func:`~curses.echo` has been called earlier. You can optionally specify a coordinate to which the cursor should be moved before pausing.
es: :meth:`~curses.window.getch` actualiza la pantalla y luego espera a que el usuario presione una tecla, mostrando la tecla si :func:`~curses.echo` ha sido llamado anteriormente. Opcionalmente, puede especificar una coordenada a la que se debe mover el cursor antes de pausar.

source: :meth:`~curses.window.getkey` does the same thing but converts the integer to a string. Individual characters are returned as 1-character strings, and special keys such as function keys return longer strings containing a key name such as ``KEY_UP`` or ``^G``.
es: :meth:`~curses.window.getkey` hace lo mismo pero convierte el entero en una cadena. Los caracteres individuales se devuelven como cadenas de 1 carácter, y las teclas especiales como las teclas de función devuelven cadenas más largas que contienen un nombre de tecla como ``KEY_UP`` o ``^ G``.

source: It's possible to not wait for the user using the :meth:`~curses.window.nodelay` window method. After ``nodelay(True)``, :meth:`getch` and :meth:`getkey` for the window become non-blocking. To signal that no input is ready, :meth:`getch` returns ``curses.ERR`` (a value of -1) and :meth:`getkey` raises an exception. There's also a :func:`~curses.halfdelay` function, which can be used to (in effect) set a timer on each :meth:`getch`; if no input becomes available within a specified delay (measured in tenths of a second), curses raises an exception.
es: Es posible no esperar al usuario utilizando el método de ventana :meth:`~ curses.window.nodelay`. Después de ``nodelay(True)``, :meth:`getch` y :meth:`getkey` para que la ventana no se bloquee. Para indicar que no hay ninguna entrada lista, :meth:`getch` devuelve ``curses.ERR`` (un valor de -1) y :meth:`getkey` genera una excepción. También hay una función :func:`~curses.halfdelay`, que se puede usar para (en efecto) establecer un temporizador en cada :meth:`getch`; Si no hay entrada disponible dentro de un retraso especificado (medido en décimas de segundo), curses generan una excepción.

source: The :meth:`getch` method returns an integer; if it's between 0 and 255, it represents the ASCII code of the key pressed. Values greater than 255 are special keys such as Page Up, Home, or the cursor keys. You can compare the value returned to constants such as :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME`, or :const:`curses.KEY_LEFT`. The main loop of your program may look something like this::
es: El método :meth:`getch` devuelve un entero; si está entre 0 y 255, representa el código ASCII de la tecla presionada. Los valores superiores a 255 son teclas especiales como Re Pág, Inicio o las teclas del cursor. Puede comparar el valor devuelto a constantes como :const:`curses.KEY_PPAGE`, :const:`curses.KEY_HOME`, o :const:`curses.KEY_LEFT`. El bucle principal de su programa puede verse así::

source: The :mod:`curses.ascii` module supplies ASCII class membership functions that take either integer or 1-character string arguments; these may be useful in writing more readable tests for such loops. It also supplies conversion functions that take either integer or 1-character-string arguments and return the same type. For example, :func:`curses.ascii.ctrl` returns the control character corresponding to its argument.
es: El módulo :mod:`curses.ascii` proporciona funciones de membresía de clase ASCII que toman argumentos de cadena de entero o de 1 carácter; Estos pueden ser útiles para escribir pruebas más legibles para dichos bucles. También proporciona funciones de conversión que toman argumentos enteros o de cadena de 1 carácter y devuelven el mismo tipo. Por ejemplo, :func:`curses.ascii.ctrl` devuelve el carácter de control correspondiente a su argumento.

source: There's also a method to retrieve an entire string, :meth:`~curses.window.getstr`. It isn't used very often, because its functionality is quite limited; the only editing keys available are the backspace key and the Enter key, which terminates the string. It can optionally be limited to a fixed number of characters. ::
es: También hay un método para recuperar una cadena completa, :meth:`~curses.window.getstr`. No se usa con mucha frecuencia, porque su funcionalidad es bastante limitada; Las únicas teclas de edición disponibles son la tecla de retroceso y la tecla Intro, que termina la cadena. Opcionalmente, puede limitarse a un número fijo de caracteres. ::

source: The :mod:`curses.textpad` module supplies a text box that supports an Emacs-like set of keybindings. Various methods of the :class:`~curses.textpad.Textbox` class support editing with input validation and gathering the edit results either with or without trailing spaces. Here's an example::
es: El módulo :mod:`curses.textpad` proporciona un cuadro de texto que admite un conjunto de teclas tipo Emacs. Varios métodos de la clase :class:`~curses.textpad.Textbox` admiten la edición con validación de entrada y recopilan los resultados de edición con o sin espacios finales. Aquí hay un ejemplo::

source: See the library documentation on :mod:`curses.textpad` for more details.
es: Consulte la documentación de la biblioteca sobre :mod:`curses.textpad` para más detalles.

source: For More Information
es: Para más información

source: This HOWTO doesn't cover some advanced topics, such as reading the contents of the screen or capturing mouse events from an xterm instance, but the Python library page for the :mod:`curses` module is now reasonably complete. You should browse it next.
es: Este CÓMO no cubre algunos temas avanzados, como leer el contenido de la pantalla o capturar eventos del mouse desde una instancia de xterm, pero la página de la biblioteca de Python para el módulo :mod:`curses` ahora está razonablemente completa. Deberías buscarlo posteriormente.

source: If you're in doubt about the detailed behavior of the curses functions, consult the manual pages for your curses implementation, whether it's ncurses or a proprietary Unix vendor's. The manual pages will document any quirks, and provide complete lists of all the functions, attributes, and :const:`ACS_\*` characters available to you.
es: Si tiene dudas sobre el comportamiento detallado de las funciones de curses, consulte las páginas del manual para su implementación de curses, ya sea ncurses o un proveedor exclusivo de Unix. Las páginas del manual documentarán cualquier peculiaridad y proporcionarán listas completas de todas las funciones, atributos y caracteres :const:`ACS_\*` disponibles para usted.

source: Because the curses API is so large, some functions aren't supported in the Python interface. Often this isn't because they're difficult to implement, but because no one has needed them yet. Also, Python doesn't yet support the menu library associated with ncurses. Patches adding support for these would be welcome; see `the Python Developer's Guide <https://devguide.python.org/>`_ to learn more about submitting patches to Python.
es: Debido a que la API de curses es tan grande, algunas funciones no son compatibles con la interfaz de Python. A menudo, esto no se debe a que sean difíciles de implementar, sino a que nadie los ha necesitado todavía. Además, Python aún no admite la biblioteca de menús asociada con ncurses. Los parches que agregan soporte para estos serían bienvenidos; consulte `la Guía del desarrollador de Python <https://devguide.python.org/>`_ para obtener más información sobre cómo enviar parches a Python.

source: `Writing Programs with NCURSES <http://invisible-island.net/ncurses/ncurses-intro.html>`_: a lengthy tutorial for C programmers.
es: `Escribir programas con NCURSES <http://invisible-island.net/ncurses/ncurses-intro.html>`_: un extenso tutoría para programadores de C.

source: `The ncurses man page <https://linux.die.net/man/3/ncurses>`_
es: `La página web con el manual de ncurses <https://linux.die.net/man/3/ncurses>`_

source: `The ncurses FAQ <http://invisible-island.net/ncurses/ncurses.faq.html>`_
es: `Preguntas y respuestas frecuentes de ncurses <http://invisible-island.net/ncurses/ncurses.faq.html>`_

source: `"Use curses... don't swear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: video of a PyCon 2013 talk on controlling terminals using curses or Urwid.
es: `"Use curses… don’t swear" <https://www.youtube.com/watch?v=eN1eZtjLEnU>`_: video de una charla de PyCon 2013 sobre el control de terminales usando curses o Urwid.

source: `"Console Applications with Urwid" <http://www.pyvideo.org/video/1568/console-applications-with-urwid>`_: video of a PyCon CA 2012 talk demonstrating some applications written using Urwid.
es: `"Console Applications with Urwid" <http://www.pyvideo.org/video/1568/console-applications-with-urwid>`_: video de una charla de PyCon CA 2012 que muestra algunas aplicaciones escritas con Urwid.
