Repository: python/python-docs-es
Catalog: howto/curses.po
Languages: es

source: Curses Programming with Python
es: Programación de Curses con Python

source: Author
es: Autor

source: Release
es: Versión

source: Abstract
es: Resumen

source: This document describes how to use the :mod:`curses` extension module to control text-mode displays.
es: Este documento describe cómo usar el módulo de extensión :mod:`curses` para controlar las pantallas en modo texto.

source: What is curses?
es: Qué es curses?

source: The curses library supplies a terminal-independent screen-painting and keyboard-handling facility for text-based terminals; such terminals include VT100s, the Linux console, and the simulated terminal provided by various programs. Display terminals support various control codes to perform common operations such as moving the cursor, scrolling the screen, and erasing areas. Different terminals use widely differing codes, and often have their own minor quirks.
es: La biblioteca curses proporciona una instalación independiente del terminal para manejo de teclado e impresión de pantalla en terminales basados en texto; tales terminales incluyen VT100, la consola de Linux y el terminal simulado proporcionado por varios programas. Los terminales de pantalla admiten varios códigos de control para realizar operaciones comunes, como mover el cursor, desplazar la pantalla y borrar áreas. Diferentes terminales utilizan códigos muy diferentes y, a menudo, tienen sus propias peculiaridades menores.

source: In a world of graphical displays, one might ask "why bother"? It's true that character-cell display terminals are an obsolete technology, but there are niches in which being able to do fancy things with them are still valuable. One niche is on small-footprint or embedded Unixes that don't run an X server. Another is tools such as OS installers and kernel configurators that may have to run before any graphical support is available.
es: En un mundo de pantallas gráficas, uno podría preguntarse « ¿por qué molestarse »? Es cierto que los terminales de pantalla de celdas de caracteres son una tecnología obsoleta, pero hay nichos en los que poder hacer cosas elegantes con ellos sigue siendo valioso. Un nicho está en pequeños *Unix* incrustados o pequeñas marcas que no ejecutan un servidor X. Por otro lado herramientas como los instaladores del sistema operativo y los configuradores de kernel que pueden tener que ejecutarse antes de que haya soporte gráfico disponible.

source: The curses library provides fairly basic functionality, providing the programmer with an abstraction of a display containing multiple non-overlapping windows of text. The contents of a window can be changed in various ways---adding text, erasing it, changing its appearance---and the curses library will figure out what control codes need to be sent to the terminal to produce the right output. curses doesn't provide many user-interface concepts such as buttons, checkboxes, or dialogs; if you need such features, consider a user interface library such as `Urwid <https://pypi.org/project/urwid/>`_.
es: La biblioteca curses proporciona una funcionalidad bastante básica, proporcionando al programador una abstracción de una pantalla que contiene múltiples ventanas de texto no superpuestas. El contenido de una ventana se puede cambiar de varias maneras (agregando texto, borrándolo, cambiando su apariencia) y la biblioteca curses descubrirá que códigos de control deben enviarse al terminal para producir la salida correcta. curses no proporciona muchos conceptos de interfaz de usuario como botones, casillas de verificación o cuadros de diálogo; Si necesita tales funciones, considere una biblioteca de interfaz de usuario como `Urwid <https://pypi.org/project/urwid/>` _.

source: The curses library was originally written for BSD Unix; the later System V versions of Unix from AT&T added many enhancements and new functions. BSD curses is no longer maintained, having been replaced by ncurses, which is an open-source implementation of the AT&T interface. If you're using an open-source Unix such as Linux or FreeBSD, your system almost certainly uses ncurses. Since most current commercial Unix versions are based on System V code, all the functions described here will probably be available. The older versions of curses carried by some proprietary Unixes may not support everything, though.
es: La biblioteca curses se escribió originalmente para BSD Unix; Las versiones posteriores de Unix de *System V* de AT&T agregaron muchas mejoras y nuevas funciones. BSD curses ya no se mantiene, ya que ha sido reemplazado por ncurses, que es una implementación de código abierto de la interfaz AT&T. Si está utilizando un Unix de código abierto como Linux o FreeBSD, su sistema casi seguro usa ncurses. Como la mayoría de las versiones comerciales actuales de Unix se basan en el código del Sistema V, todas las funciones descritas aquí probablemente estarán disponibles. Sin embargo, las versiones anteriores de curses llevadas por algunos Unix propietarios no pueden admitir todo.

source: The Windows version of Python doesn't include the :mod:`curses` module. A ported version called `UniCurses <https://pypi.org/project/UniCurses>`_ is available. You could also try `the Console module <http://effbot.org/zone/console-index.htm>`_ written by Fredrik Lundh, which doesn't use the same API as curses but provides cursor-addressable text output and full support for mouse and keyboard input.
es: La versión de Python para Windows no incluye el módulo :mod:`curses`. Una versión portada llamada `UniCurses <https://pypi.org/project/UniCurses>`_ está disponible. También puede probar `el módulo de consola <http://effbot.org/zone/console-index.htm>`_ escrito por *Fredrik Lundh*, que no utiliza la misma API que curses pero proporciona salida de texto *direccionable* por el cursor y soporte completo para entrada de mouse y teclado.

source: The Python curses module
es: El módulo curses de Python

source: The Python module is a fairly simple wrapper over the C functions provided by curses; if you're already familiar with curses programming in C, it's really easy to transfer that knowledge to Python. The biggest difference is that the Python interface makes things simpler by merging different C functions such as :c:func:`addstr`, :c:func:`mvaddstr`, and :c:func:`mvwaddstr` into a single :meth:`~curses.window.addstr` method. You'll see this covered in more detail later.
es: El módulo Python es un envoltorio bastante simple sobre las funciones C proporcionadas por curses; si ya está familiarizado con la programación de curses en C, es muy fácil transferir ese conocimiento a Python. La mayor diferencia es que la interfaz de Python simplifica las cosas al combinar diferentes funciones de C como :c:func:`addtr` , :c:func:`mvaddstr` , y :c:func:`mvwaddstr` en un solo método :meth:`~curses.window.addstr`. Verá esto cubierto con más detalle más adelante.

source: This HOWTO is an introduction to writing text-mode programs with curses and Python. It doesn't attempt to be a complete guide to the curses API; for that, see the Python library guide's section on ncurses, and the C manual pages for ncurses. It will, however, give you the basic ideas.
es: Este HOWTO es una introducción a la escritura de programas en modo texto con curses y Python. No intenta ser una guía completa de la API de curses; para eso, vea la sección de la guía de la biblioteca de Python sobre ncurses, y las páginas del manual de C para ncurses. Sin embargo, le dará las ideas básicas.

source: Starting and ending a curses application
es: Iniciar y finalizar una aplicación de curses

source: Before doing anything, curses must be initialized. This is done by calling the :func:`~curses.initscr` function, which will determine the terminal type, send any required setup codes to the terminal, and create various internal data structures. If successful, :func:`initscr` returns a window object representing the entire screen; this is usually called ``stdscr`` after the name of the corresponding C variable. ::
es: Antes de hacer cualquier cosa, curses deben ser inicializadas. Esto se realiza llamando a la función :func:`~curses.initscr`, que determinará el tipo de terminal, enviará los códigos de configuración necesarios al terminal y creará varias estructuras de datos internas. Si tiene éxito, :func:`initscr` devuelve un objeto de ventana que representa la pantalla completa; Esto generalmente se llama ``stdscr`` después del nombre de la variable C correspondiente. ::

source: Usually curses applications turn off automatic echoing of keys to the screen, in order to be able to read keys and only display them under certain circumstances. This requires calling the :func:`~curses.noecho` function. ::
es: Por lo general, las aplicaciones de curses desactivan el eco automático de las teclas en la pantalla, para poder leer las teclas y solo mostrarlas bajo ciertas circunstancias. Esto requiere llamar a la función :func:`~curses.noecho` function. ::

source: Applications will also commonly need to react to keys instantly, without requiring the Enter key to be pressed; this is called cbreak mode, as opposed to the usual buffered input mode. ::
es: Las aplicaciones también tendrán que reaccionar a las teclas al instante, sin necesidad de presionar la tecla Intro; Esto se llama modo cbreak, en oposición al modo de entrada almacenado en memoria intermedia habitual. ::

source: Terminals usually return special keys, such as the cursor keys or navigation keys such as Page Up and Home, as a multibyte escape sequence. While you could write your application to expect such sequences and process them accordingly, curses can do it for you, returning a special value such as :const:`curses.KEY_LEFT`. To get curses to do the job, you'll have to enable keypad mode. ::
es: Los terminales generalmente devuelven teclas especiales, como las teclas del cursor o las teclas de navegación, como Re Pág e Inicio, como una secuencia de escape multibyte. Si bien puede escribir su aplicación para esperar tales secuencias y procesarlas en consecuencia, curses pueden hacerlo por usted, retornando un valor especial como :const:`curses.KEY_LEFT`. Para obtener que curses haga el trabajo, deberá habilitar el modo de teclado. ::

source: Terminating a curses application is much easier than starting one. You'll need to call::
es: Terminar una aplicación de curses es mucho más fácil que iniciar una. Tendrás que llamar a ::

source: to reverse the curses-friendly terminal settings. Then call the :func:`~curses.endwin` function to restore the terminal to its original operating mode. ::
es: para revertir la configuración de terminal amigable de curses. Llame luego a la función :func:`~curses.endwin` para restaurar el terminal a su modo operativo original. ::

source: A common problem when debugging a curses application is to get your terminal messed up when the application dies without restoring the terminal to its previous state. In Python this commonly happens when your code is buggy and raises an uncaught exception. Keys are no longer echoed to the screen when you type them, for example, which makes using the shell difficult.
es: Un problema común al depurar una aplicación curses es hacer que su terminal se estropee cuando la aplicación muere sin restaurar el terminal a su estado anterior. En Python, esto ocurre comúnmente cuando su código tiene errores y genera una excepción no detectada. Las teclas ya no se repiten en la pantalla cuando las escribe, por ejemplo, lo que dificulta el uso del shell.

source: In Python you can avoid these complications and make debugging much easier by importing the :func:`curses.wrapper` function and using it like this::
es: En Python puede evitar estas complicaciones y facilitar la depuración importando la función :func:`curses.wrapper` y usándola así::

source: The :func:`~curses.wrapper` function takes a callable object and does the initializations described above, also initializing colors if color support is present. :func:`wrapper` then runs your provided callable. Once the callable returns, :func:`wrapper` will restore the original state of the terminal. The callable is called inside a :keyword:`try`...\ :keyword:`except` that catches exceptions, restores the state of the terminal, and then re-raises the exception. Therefore your terminal won't be left in a funny state on exception and you'll be able to read the exception's message and traceback.
es: La función :func:`~curses.wrapper` toma un objeto invocable y realiza las inicializaciones descritas anteriormente, también inicializa los colores si hay soporte de color. :func:`wrapper` luego ejecuta su invocable proporcionado. Una vez que vuelve a llamarse, :func:`wrapper` restaurará el estado original del terminal. El invocable se llama dentro de :keyword:`try`…\ :keyword:`except` que captura excepciones, restaura el estado del terminal y luego vuelve a generar la excepción. Por lo tanto, su terminal no se quedará en un estado extraño de excepción y podrá leer el mensaje de la excepción y el rastreo.

source: Windows and Pads
es: Ventanas y pads

source: Windows are the basic abstraction in curses. A window object represents a rectangular area of the screen, and supports methods to display text, erase it, allow the user to input strings, and so forth.
es: Las ventanas son la abstracción básica en curses. Un objeto de ventana representa un área rectangular de la pantalla y admite métodos para mostrar texto, borrarlo, permitir al usuario ingresar cadenas, etc.

source: The ``stdscr`` object returned by the :func:`~curses.initscr` function is a window object that covers the entire screen. Many programs may need only this single window, but you might wish to divide the screen into smaller windows, in order to redraw or clear them separately. The :func:`~curses.newwin` function creates a new window of a given size, returning the new window object. ::
es: El objeto ``stdscr`` devuelto por la función :func:`~curses.initscr` es un objeto de ventana que cubre toda la pantalla. Es posible que muchos programas solo necesiten esta única ventana, pero es posible que desee dividir la pantalla en ventanas más pequeñas para volver a dibujarlas o borrarlas por separado. La función :func:`~curses.newwin` crea una nueva ventana de un tamaño dado, retornando el nuevo objeto de ventana. ::

source: Note that the coordinate system used in curses is unusual. Coordinates are always passed in the order *y,x*, and the top-left corner of a window is coordinate (0,0). This breaks the normal convention for handling coordinates where the *x* coordinate comes first. This is an unfortunate difference from most other computer applications, but it's been part of curses since it was first written, and it's too late to change things now.
es: Tenga en cuenta que el sistema de coordenadas utilizado en curses es inusual. Las coordenadas siempre se pasan en el orden *y,x*, y la esquina superior izquierda de una ventana es la coordenada (0,0). Esto rompe la convención normal para manejar coordenadas donde la coordenada *x* es lo primero. Esta es una desafortunada diferencia de la mayoría de las otras aplicaciones informáticas, pero ha sido parte de curses desde que se escribió por primera vez, y ahora es demasiado tarde para cambiar las cosas.

source: Your application can determine the size of the screen by using the :data:`curses.LINES` and :data:`curses.COLS` variables to obtain the *y* and *x* sizes. Legal coordinates will then extend from ``(0,0)`` to ``(curses.LINES - 1, curses.COLS - 1)``.
es: Su aplicación puede determinar el tamaño de la pantalla utilizando las variables :data:`curses.LINES` y :data:`curses.COLS` para obtener los tamaños *y* y *x*. Las coordenadas legales se extenderán de ``(0,0)`` a ``(curses.LINES - 1, curses.COLS - 1)``.

source: When you call a method to display or erase text, the effect doesn't immediately show up on the display. Instead you must call the :meth:`~curses.window.refresh` method of window objects to update the screen.
es: Cuando llama a un método para mostrar o borrar texto, el efecto no aparece inmediatamente en la pantalla. En su lugar, debe llamar al método :meth:`~curses.window.refresh` de los objetos de ventana para actualizar la pantalla.

source: This is because curses was originally written with slow 300-baud terminal connections in mind; with these terminals, minimizing the time required to redraw the screen was very important. Instead curses accumulates changes to the screen and displays them in the most efficient manner when you call :meth:`refresh`. For example, if your program displays some text in a window and then clears the window, there's no need to send the original text because they're never visible.
es: Esto se debe a que curses se escribieron originalmente teniendo en cuenta las conexiones de terminales lentas de 300 baudios; con estos terminales, era muy importante minimizar el tiempo requerido para volver a dibujar la pantalla. En cambio, curses acumula cambios en la pantalla y los muestra de la manera más eficiente cuando llama :meth:`refresh`. Por ejemplo, si su programa muestra algo de texto en una ventana y luego borra la ventana, no hay necesidad de enviar el texto original porque nunca son visibles.

source: In practice, explicitly telling curses to redraw a window doesn't really complicate programming with curses much. Most programs go into a flurry of activity, and then pause waiting for a keypress or some other action on the part of the user. All you have to do is to be sure that the screen has been redrawn before pausing to wait for user input, by first calling ``stdscr.refresh()`` or the :meth:`refresh` method of some other relevant window.
es: En la práctica, decirle explícitamente a curses que vuelva a dibujar una ventana no complica mucho la programación con curses. La mayoría de los programas entran en una gran cantidad de actividad y luego se detienen a la espera de que se presione una tecla u otra acción por parte del usuario. Todo lo que tiene que hacer es asegurarse de que la pantalla se haya re-dibujado antes de hacer una pausa para esperar la entrada del usuario, llamando primero a ``stdscr.refresh()`` o al método :meth:`refresh` de alguna otra ventana relevante.

source: A pad is a special case of a window; it can be larger than the actual display screen, and only a portion of the pad displayed at a time. Creating a pad requires the pad's height and width, while refreshing a pad requires giving the coordinates of the on-screen area where a subsection of the pad will be displayed. ::
es: Un pad es un caso especial de una ventana; puede ser más grande que la pantalla de visualización real, y solo se muestra una parte del pad a la vez. La creación de un pad requiere la altura y el ancho del pad, mientras que la actualización de un pad requiere dar las coordenadas del área en pantalla donde se mostrará una subsección del pad. ::

source: The :meth:`refresh` call displays a section of the pad in the rectangle extending from coordinate (5,5) to coordinate (20,75) on the screen; the upper left corner of the displayed section is coordinate (0,0) on the pad. Beyond that difference, pads are exactly like ordinary windows and support the same methods.
es: La llamada :meth:`refresh` muestra una sección del pad en el rectángulo que se extiende desde la coordenada (5,5) hasta la coordenada (20,75) en la pantalla; la esquina superior izquierda de la sección mostrada es la coordenada (0,0) en el pad. Más allá de esa diferencia, los pads son exactamente como las ventanas normales y admiten los mismos métodos.

source: If you have multiple windows and pads on screen there is a more efficient way to update the screen and prevent annoying screen flicker as each part of the screen gets updated. :meth:`refresh` actually does two things:
es: Si tiene varias ventanas y almohadillas en la pantalla, hay una manera más eficiente de actualizar la pantalla y evitar el molesto parpadeo de la pantalla a medida que se actualiza cada parte de la pantalla. :meth:`refresh` en realidad hace dos cosas:

source: Calls the :meth:`~curses.window.noutrefresh` method of each window to update an underlying data structure representing the desired state of the screen.
es: Llama al método :meth:`~curses.window.noutrefresh` de cada ventana para actualizar una estructura de datos subyacente que representa el estado deseado de la pantalla.

source: Calls the function :func:`~curses.doupdate` function to change the physical screen to match the desired state recorded in the data structure.
es: Llama a la función :func:`~curses.doupdate` para cambiar la pantalla física para que coincida con el estado deseado registrado en la estructura de datos.

source: Instead you can call :meth:`noutrefresh` on a number of windows to update the data structure, and then call :func:`doupdate` to update the screen.
es: En su lugar, puede llamar a :meth:`noutrefresh` en varias ventanas para actualizar la estructura de datos, y luego llamar a :func:`doupdate` para actualizar la pantalla.

source: Displaying Text
es: Mostrando el texto

source: From a C programmer's point of view, curses may sometimes look like a twisty maze of functions, all subtly different. For example, :c:func:`addstr` displays a string at the current cursor location in the ``stdscr`` window, while :c:func:`mvaddstr` moves to a given y,x coordinate first before displaying the string. :c:func:`waddstr` is just like :c:func:`addstr`, but allows specifying a window to use instead of using ``stdscr`` by default. :c:func:`mvwaddstr` allows specifying both a window and a coordinate.
es: Desde el punto de vista de un programador en C, curses a veces puede parecer un laberinto retorcido de funciones, todas sutilmente diferentes. Por ejemplo, :c:func:`addtr` muestra una cadena en la ubicación actual del cursor en la ventana ``stdscr``, mientras que :c:func:`mvaddstr` se mueve a una determinada coordenada y, x primero antes de mostrar la cadena . :c:func:`waddstr` es como :c:func:`addtr`, pero permite especificar una ventana para usar en lugar de usar ``stdscr`` por defecto. :c:func:`mvwaddstr` permite especificar tanto una ventana como una coordenada.

source: Fortunately the Python interface hides all these details. ``stdscr`` is a window object like any other, and methods such as :meth:`~curses.window.addstr` accept multiple argument forms. Usually there are four different forms.
es: Afortunadamente, la interfaz de Python oculta todos estos detalles. ``stdscr`` es un objeto de ventana como cualquier otro, y métodos como :meth:`~curses.window.addstr` aceptan múltiples formas de argumento. Por lo general, hay cuatro formas diferentes.

source: Form
es: Formas

source: Description
es: Descripción

source: *str* or *ch*
es: *str* o *ch*

source: Display the string *str* or character *ch* at the current position
es: Mostrar la cadena *str* o el carácter *ch* en la posición actual

source: *str* or *ch*, *attr*
es: *str* o *ch*, *attr*

source: Display the string *str* or character *ch*, using attribute *attr* at the current position
es: Muestra la cadena *str* o el carácter *ch*, utilizando el atributo *attr* en la posición actual

source: *y*, *x*, *str* or *ch*
es: *y*, *x*, *str* o *ch*

source: Move to position *y,x* within the window, and display *str* or *ch*
es: Moverse a la posición *y,x* dentro de la ventana, y mostrar *st* o *ch*

source: *y*, *x*, *str* or *ch*, *attr*
es: *y*, *x*, *str* o *ch*, *attr*

source: Move to position *y,x* within the window, and display *str* or *ch*, using attribute *attr*
es: Muévase a la posición *y, x* dentro de la ventana y muestre *str* o *ch*, usando el atributo *attr*
