Repository: python/python-docs-es
Catalog: howto/functional.po
Languages: es

source: We've already seen how lists and tuples support iterators. In fact, any Python sequence type, such as strings, will automatically support creation of an iterator.
es: Ya hemos visto cómo las listas y tuplas soportan iteradores. De hecho, cualquier tipo de secuencia de Python, como cadenas de caracteres, automáticamente soportará la creación de un iterador.

source: Calling :func:`iter` on a dictionary returns an iterator that will loop over the dictionary's keys::
es: Llamar a :func:`iter` en un diccionario retornará un iterador que recorrerá sobre las claves del diccionario::

source: Note that starting with Python 3.7, dictionary iteration order is guaranteed to be the same as the insertion order. In earlier versions, the behaviour was unspecified and could vary between implementations.
es: Note que a partir de Python 3.7, se garantiza que el orden de iteración del diccionario es el mismo que el orden de inserción. En versiones anteriores, el comportamiento no estaba especificado y podía variar entre implementaciones.

source: Applying :func:`iter` to a dictionary always loops over the keys, but dictionaries have methods that return other iterators. If you want to iterate over values or key/value pairs, you can explicitly call the :meth:`~dict.values` or :meth:`~dict.items` methods to get an appropriate iterator.
es: Aplicar :func:`iter` a un diccionario siempre recorre sobre las claves, pero los diccionarios tienen métodos que retornan otros iteradores. Si quiere iterar sobre valores o pares clave/valor, puede explícitamente llamar a los métodos :meth:`~dict.values` o :meth:`~dict.items` para obtener un iterador apropiado.

source: The :func:`dict` constructor can accept an iterator that returns a finite stream of ``(key, value)`` tuples:
es: El constructor :func:`dict` puede aceptar un iterador que retorna un flujo finito de tuplas ``(key, value)``:

source: Files also support iteration by calling the :meth:`~io.TextIOBase.readline` method until there are no more lines in the file. This means you can read each line of a file like this::
es: Los archivos también soportan iteración llamando al método :meth:`~io.TextIOBase.readline` hasta que no haya más líneas en el archivo. Esto significa que puede leer cada línea de un archivo de esta forma::

source: Sets can take their contents from an iterable and let you iterate over the set's elements::
es: Los conjuntos pueden recibir sus contenidos de un iterable y le permiten iterar sobre los elementos del conjunto::

source: Generator expressions and list comprehensions
es: Expresiones generadoras y listas por comprensión

source: Two common operations on an iterator's output are 1) performing some operation for every element, 2) selecting a subset of elements that meet some condition. For example, given a list of strings, you might want to strip off trailing whitespace from each line or extract all the strings containing a given substring.
es: Dos operaciones comunes en la salida de un iterador son 1) realizar alguna operación para cada elemento, 2) elegir un subconjunto de elementos que reúnen alguna condición. Por ejemplo, dada una lista de cadena de caracteres, podría querer remover los espacios finales de cada línea o extraer todas las cadenas de caracteres que contienen una subcadena de caracteres dada.

source: List comprehensions and generator expressions (short form: "listcomps" and "genexps") are a concise notation for such operations, borrowed from the functional programming language Haskell (https://www.haskell.org/). You can strip all the whitespace from a stream of strings with the following code::
es: Las listas por comprensión y las expresiones generadoras (forma abreviada: "listcomps" y "genexps") son una notación concisa para tales operaciones, prestadas del lenguaje de programación funcional Haskell (https://www.haskell.org/). Puede remover todos los espacios de un flujo de cadena de caracteres con el siguiente código::

source: You can select only certain elements by adding an ``"if"`` condition::
es: Puede seleccionar solo ciertos elementos agregando una condición ``"if"``::

source: With a list comprehension, you get back a Python list; ``stripped_list`` is a list containing the resulting lines, not an iterator. Generator expressions return an iterator that computes the values as necessary, not needing to materialize all the values at once. This means that list comprehensions aren't useful if you're working with iterators that return an infinite stream or a very large amount of data. Generator expressions are preferable in these situations.
es: Con una lista por comprensión, obtiene una lista de Python; ``stripped_list`` es una lista que contiene las líneas resultantes, no un iterador. Las expresiones generadoras retornan un iterador que calcula los valores cuando es necesario, sin necesidad de materializar todos los valores a la vez. Esto significa que las listas por comprensión son inútiles si está trabajando con iteradores que retornan un flujo infinito o una gran cantidad de datos. En estas situaciones son preferibles las expresiones generadoras.

source: Generator expressions are surrounded by parentheses ("()") and list comprehensions are surrounded by square brackets ("[]"). Generator expressions have the form::
es: Las expresiones generadoras están rodeadas por paréntesis ("()") y las listas por comprensión están rodeadas por corchetes ("[]"). Las expresiones generadoras tienen la forma::

source: Again, for a list comprehension only the outside brackets are different (square brackets instead of parentheses).
es: Nuevamente, para una lista por comprensión solo los corchetes exteriores son diferentes (corchetes en lugar de paréntesis).

source: The elements of the generated output will be the successive values of ``expression``. The ``if`` clauses are all optional; if present, ``expression`` is only evaluated and added to the result when ``condition`` is true.
es: Los elementos de la salida generada serán valores sucesivos de ``expression``. Las cláusulas ``if`` son todas opcionales; si está presente, ``expression`` es solo evaluado y añadido al resultado cuando ``condition`` es verdadero.

source: Generator expressions always have to be written inside parentheses, but the parentheses signalling a function call also count. If you want to create an iterator that will be immediately passed to a function you can write::
es: Las expresiones generadoras siempre se tienen que escribir dentro de paréntesis, pero los paréntesis que indican la llamada a una función también cuentan. Si quiere crear un iterador que se pase inmediatamente a una función puede escribir::

source: The ``for...in`` clauses contain the sequences to be iterated over. The sequences do not have to be the same length, because they are iterated over from left to right, **not** in parallel. For each element in ``sequence1``, ``sequence2`` is looped over from the beginning. ``sequence3`` is then looped over for each resulting pair of elements from ``sequence1`` and ``sequence2``.
es: Las cláusulas ``for...in`` contienen las secuencias sobre las que se itera. Las secuencias no tienen que tener la misma longitud, porque son iteradas de izquierda a derecha, **no** en paralelo. Por cada elemento en ``sequence1``, se recorre ``sequence2`` desde el inicio. Luego se recorre ``sequence3`` por cada par de elementos resultante de ``sequence1`` y ``sequence2``.

source: To put it another way, a list comprehension or generator expression is equivalent to the following Python code::
es: Para ponerlo en otra forma, una lista por comprensión o expresión generadora es equivalente al siguiente código Python::

source: This means that when there are multiple ``for...in`` clauses but no ``if`` clauses, the length of the resulting output will be equal to the product of the lengths of all the sequences. If you have two lists of length 3, the output list is 9 elements long:
es: Esto significa que cuando hay múltiples cláusulas ``for...in`` pero no cláusulas ``if``, la longitud de la salida resultante será igual al producto de las longitudes de todas las secuencias. Si tiene dos listas de longitud 3, la lista de salida tendrá 9 elementos:

source: To avoid introducing an ambiguity into Python's grammar, if ``expression`` is creating a tuple, it must be surrounded with parentheses. The first list comprehension below is a syntax error, while the second one is correct::
es: Para evitar introducir una ambigüedad en la gramática de Python, si ``expression`` está creando una tupla, debe estar rodeada de paréntesis. La primera lista por comprensión de abajo tiene un error de sintaxis, mientras que la segunda es correcta::

source: Generators
es: Generadores

source: Generators are a special class of functions that simplify the task of writing iterators. Regular functions compute a value and return it, but generators return an iterator that returns a stream of values.
es: Los generadores son una clase especial de funciones que simplifican la tarea de escribir iteradores. Las funciones regulares calculan un valor y lo retornan, pero los generadores retornan un iterador que retorna un flujo de valores.

source: You're doubtless familiar with how regular function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a ``return`` statement, the local variables are destroyed and the value is returned to the caller. A later call to the same function creates a new private namespace and a fresh set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
es: Sin duda está relacionado con cómo funcionan las llamadas a funciones regulares en Python o C. Cuando llama a una función, esta obtiene su espacio de nombres privado donde se crean sus variables locales. Cuando la función alcanza una sentencia ``return``, las variables locales son destruidas y el valor se retorna al llamador. Una llamada posterior a la misma función crea un nuevo espacio de nombres privado y un conjunto limpio de variables locales. Pero, ¿qué pasa si las variables locales no fueron desechadas en la salida de una función? ¿Qué pasa si más tarde podría reanudar la función desde donde quedó? Esto es lo que proveen los generadores; se pueden pensar como funciones que se reanudan.

source: Here's the simplest example of a generator function:
es: Este es el ejemplo más simple de una función generadora:

source: Any function containing a :keyword:`yield` keyword is a generator function; this is detected by Python's :term:`bytecode` compiler which compiles the function specially as a result.
es: Cualquier función que contiene una palabra clave :keyword:`yield` es una función generadora; esto es detectado por el compilador :term:`bytecode` de Python que compila la función de forma especial como resultado.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the ``yield`` expression, the generator outputs the value of ``i``, similar to a ``return`` statement. The big difference between ``yield`` and a ``return`` statement is that on reaching a ``yield`` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's :meth:`~generator.__next__` method, the function will resume executing.
es: Cuando llama a una función generadora, no retorna un solo valor; en lugar de eso retorna un objeto generador que soporta el protocolo iterador. Al ejecutar la expresión ``yield``, el generador produce el valor de ``i``, de forma similar a una sentencia ``return``. La gran diferencia entre una sentencia ``yield`` y un ``return`` es que al alcanzar un ``yield`` se suspende el estado de ejecución del generador y se preservan las variables locales. En la próxima llamada al método :meth:`~generator.__next__` del generador, la función reanudará la ejecución.

source: Here's a sample usage of the ``generate_ints()`` generator:
es: Este es un ejemplo de uso del generador ``generate_ints()``:

source: You could equally write ``for i in generate_ints(5)``, or ``a, b, c = generate_ints(3)``.
es: De igual forma podría escribir ``for i in generate_ints(5)``, o ``a, b, c = generate_ints(3)``.

source: Inside a generator function, ``return value`` causes ``StopIteration(value)`` to be raised from the :meth:`~generator.__next__` method. Once this happens, or the bottom of the function is reached, the procession of values ends and the generator cannot yield any further values.
es: Dentro de una función generadora, ``return value`` causa que se lance ``StopIteration(value)`` del método :meth:`~generator.__next__`\. Una vez que esto pase, o que se alcance el final de la función, termina la procesión de valores y el generador no puede producir más valores.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`~iterator.__next__` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class can be much messier.
es: Podría lograr el efecto de los generadores manualmente escribiendo su propia clase y guardando todas las variables locales del generador como variables de instancia. Por ejemplo, retornar una lista de enteros se podría hacer estableciendo ``self.count`` a 0, y teniendo el método :meth:`~iterator.__next__` que incrementa ``self.count`` y lo retorna. Sin embargo, para un generador moderadamente complicado, escribir una clase correspondiente puede ser mucho más confuso.

source: The test suite included with Python's library, :source:`Lib/test/test_generators.py`, contains a number of more interesting examples. Here's one generator that implements an in-order traversal of a tree using generators recursively. ::
es: El banco de pruebas incluido con la librería de Python, :source:`Lib/test/test_generators.py`, contiene un número de ejemplos más interesantes. Este es un generador que implementa un recorrido inorden de un árbol usando generadores recursivamente. ::

source: Two other examples in ``test_generators.py`` produce solutions for the N-Queens problem (placing N queens on an NxN chess board so that no queen threatens another) and the Knight's Tour (finding a route that takes a knight to every square of an NxN chessboard without visiting any square twice).
es: Otros dos ejemplos en ``test_generators.py`` producen soluciones al problema de N-reinas (ubicar N reinas en un tablero de ajedrez de NxN de forma que ninguna reina amenace a otra) y el problema del caballo (encontrar una ruta que lleve a un caballo a cada cuadro de un tablero de ajedrez de NxN sin visitar ningún cuadro dos veces).

source: Passing values into a generator
es: Pasar valores a un generador

source: In Python 2.4 and earlier, generators only produced output. Once a generator's code was invoked to create an iterator, there was no way to pass any new information into the function when its execution is resumed. You could hack together this ability by making the generator look at a global variable or by passing in some mutable object that callers then modify, but these approaches are messy.
es: En Python 2.4 y anteriores, los generadores solo producían salida. Una vez que el código de un generador era invocado para crear un iterador, no había forma de pasar ninguna información nueva a la función cuando se reanuda su ejecución. Podría lograr esta habilidad haciendo que el generador mire una variable global o pasando en algún objeto mutable que el llamador luego modifica, pero estos enfoques son confusos.

source: In Python 2.5 there's a simple way to pass values into a generator. :keyword:`yield` became an expression, returning a value that can be assigned to a variable or otherwise operated on::
es: En Python 2.5 hay una forma más simple de pasar valores a un generador. :keyword:`yield` se convirtió en una expresión, retornando un valor que se puede asignar a una variable o sobre el que se puede operar::

source: I recommend that you **always** put parentheses around a ``yield`` expression when you're doing something with the returned value, as in the above example. The parentheses aren't always necessary, but it's easier to always add them instead of having to remember when they're needed.
es: Recomiendo que **siempre** ponga paréntesis alrededor de una expresión ``yield`` cuando esté haciendo algo con el valor retornado, como en el ejemplo de arriba. Los paréntesis no siempre son necesarios, pero siempre es más fácil agregarlos en lugar de tener que recordar cuándo son necesarios.

source: (:pep:`342` explains the exact rules, which are that a ``yield``-expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` but have to use parentheses when there's an operation, as in ``val = (yield i) + 12``.)
es: (:pep:`342` explica las reglas exactas, que son que una expresión ``yield`` siempre debe estar entre paréntesis excepto cuando se encuentra en la expresión de primer nivel en el lado derecho de una asignación. Esto significa que puede escribir ``val = yield i`` pero tiene que usar paréntesis cuando hay una operación, como en ``val = (yield i) + 12``.)

source: Values are sent into a generator by calling its :meth:`send(value) <generator.send>` method. This method resumes the generator's code and the ``yield`` expression returns the specified value. If the regular :meth:`~generator.__next__` method is called, the ``yield`` returns ``None``.
es: Los valores son enviados a un generador llamando a su método :meth:`send(value) <generator.send>`. Este método reanuda el código del generador y la expresión ``yield`` retorna el valor especificado. Si se llama al método regular :meth:`~generator.__next__`, ``yield`` retorna ``None``.

source: Here's a simple counter that increments by 1 and allows changing the value of the internal counter.
es: Este es un simple contador que incrementa por 1 y permite cambiar los valores del contador interno.

source: And here's an example of changing the counter:
es: Y este es un ejemplo del cambio del contador:

source: Because ``yield`` will often be returning ``None``, you should always check for this case. Don't just use its value in expressions unless you're sure that the :meth:`~generator.send` method will be the only method used to resume your generator function.
es: Como ``yield`` a menudo retornará ``None``, siempre debería comprobar este caso. No use simplemente su valor en expresiones a menos que esté seguro que el método :meth:`~generator.send` será el único método utilizado para reanudar su función generadora.

source: In addition to :meth:`~generator.send`, there are two other methods on generators:
es: Además del método :meth:`~generator.send`, hay otros dos métodos para generadores:

source: :meth:`~generator.close` raises a :exc:`GeneratorExit` exception inside the generator to terminate the iteration. On receiving this exception, the generator's code must either raise :exc:`GeneratorExit` or :exc:`StopIteration`; catching the exception and doing anything else is illegal and will trigger a :exc:`RuntimeError`. :meth:`~generator.close` will also be called by Python's garbage collector when the generator is garbage-collected.
es: :meth:`~generator.close` lanza una excepción :exc:`GeneratorExit` dentro del generador para terminar la iteración. Al recibir esta excepción, el código del generador debe lanzar :exc:`GeneratorExit` o :exc:`StopIteration`; capturar la excepción y hacer cualquier otra cosa es ilegal y disparará un :exc:`RuntimeError`. :meth:`~generator.close` también se llamará por el recolector de basura de Python cuando se recolecte el generador.

source: If you need to run cleanup code when a :exc:`GeneratorExit` occurs, I suggest using a ``try: ... finally:`` suite instead of catching :exc:`GeneratorExit`.
es: Si necesita ejecutar un código de limpieza cuando ocurre un :exc:`GeneratorExit`, sugiero usar un ``try: ... finally:`` en lugar de capturar :exc:`GeneratorExit`.

source: The cumulative effect of these changes is to turn generators from one-way producers of information into both producers and consumers.
es: El efecto acumulativo de estos cambios es convertir a los generadores de productores de información unidireccionales en productores y consumidores.

source: Generators also become **coroutines**, a more generalized form of subroutines. Subroutines are entered at one point and exited at another point (the top of the function, and a ``return`` statement), but coroutines can be entered, exited, and resumed at many different points (the ``yield`` statements).
es: Los generadores también se convierten en **corrutinas**, una forma más generalizada de subrutinas. Las subrutinas inician en un punto y salen en otro punto (el inicio de la función, y la sentencia ``return``), pero las corrutinas pueden iniciar, salir, y reanudarse en muchos puntos diferentes (las sentencias ``yield``).

source: Built-in functions
es: Funciones incorporadas

source: Let's look in more detail at built-in functions often used with iterators.
es: Veamos con más detalle las funciones incorporadas usadas a menudo con iteradores.

source: Two of Python's built-in functions, :func:`map` and :func:`filter` duplicate the features of generator expressions:
es: Dos de las funciones incorporadas de Python, :func:`map` y :func:`filter` duplican las características de las expresiones generadoras:

source: :func:`map(f, iterA, iterB, ...) <map>` returns an iterator over the sequence
es: :func:`map(f, iterA, iterB, ...) <map>` retorna un iterador sobre la secuencia

source: You can of course achieve the same effect with a list comprehension.
es: Por supuesto puede lograr el mismo efecto con una lista por comprensión.

source: :func:`filter(predicate, iter) <filter>` returns an iterator over all the sequence elements that meet a certain condition, and is similarly duplicated by list comprehensions. A **predicate** is a function that returns the truth value of some condition; for use with :func:`filter`, the predicate must take a single value.
es: :func:`filter(predicate, iter) <filter>` retorna un iterador sobre todos los elementos de la secuencia que reúnen cierta condición, y de forma similar está duplicado por las listas por comprensión. Un **predicado** es una función que retorna un valor de verdad de alguna condición; para usarlo con :func:`filter`, el predicado debe recibir un solo valor.

source: This can also be written as a list comprehension:
es: Esto también se puede escribir como una lista por comprensión:

source: :func:`enumerate(iter, start=0) <enumerate>` counts off the elements in the iterable returning 2-tuples containing the count (from *start*) and each element. ::
es: :func:`enumerate(iter, start=0) <enumerate>` enumera los elementos en el iterable retornando 2-tuplas que contienen la enumeración (desde *start*) y cada elemento. ::

source: :func:`enumerate` is often used when looping through a list and recording the indexes at which certain conditions are met::
es: :func:`enumerate` a menudo se usa cuando se recorre una lista y se registran los índices en los que se reúnen una cierta condición::
