Repository: python/python-docs-es
Catalog: howto/functional.po
Languages: es

source: :func:`sorted(iterable, key=None, reverse=False) <sorted>` collects all the elements of the iterable into a list, sorts the list, and returns the sorted result. The *key* and *reverse* arguments are passed through to the constructed list's :meth:`~list.sort` method. ::
es: :func:`sorted(iterable, key=None, reverse=False) <sorted>` reúne todos los elementos de un iterable en una lista, ordena la lista, y retorna el resultado ordenado. Los argumentos *key* y *reverse* se pasan a través del método :meth:`~list.sort` de la lista construida. ::

source: (For a more detailed discussion of sorting, see the :ref:`sortinghowto`.)
es: (Para un tratamiento más detallado del ordenamiento, ver :ref:`sortinghowto`.)

source: The :func:`any(iter) <any>` and :func:`all(iter) <all>` built-ins look at the truth values of an iterable's contents. :func:`any` returns ``True`` if any element in the iterable is a true value, and :func:`all` returns ``True`` if all of the elements are true values:
es: Las funciones incorporadas :func:`any(iter) <any>` y :func:`all(iter) <all>` ven los valores de verdad de los contenidos de un iterable. :func:`any` retorna ``True`` si algún elemento en el iterable es un valor verdadero, y :func:`all` retorna ``True`` si todos los elementos son valores verdaderos:

source: :func:`zip(iterA, iterB, ...) <zip>` takes one element from each iterable and returns them in a tuple::
es: :func:`zip(iterA, iterB, ...) <zip>` toma un elemento de cada iterable y los retorna en una tupla::

source: It doesn't construct an in-memory list and exhaust all the input iterators before returning; instead tuples are constructed and returned only if they're requested. (The technical term for this behaviour is `lazy evaluation <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)
es: Esto no construye una lista en memoria y consume todos los iteradores de entrada antes de ejecutar; en lugar de eso, las tuplas se construyen y retornan solo si son requeridas. (El término técnico para este comportamiento es `evaluación perezosa <https://es.wikipedia.org/wiki/Evaluaci%C3%B3n_perezosa>`__.)

source: This iterator is intended to be used with iterables that are all of the same length. If the iterables are of different lengths, the resulting stream will be the same length as the shortest iterable. ::
es: Se pretende que el iterador se use con iterables que tengan todos la misma longitud. Si los iterables son de diferentes longitudes, el flujo resultante tendrá la misma longitud que el iterable más corto. ::

source: You should avoid doing this, though, because an element may be taken from the longer iterators and discarded. This means you can't go on to use the iterators further because you risk skipping a discarded element.
es: Sin embargo, debería evitar hacer esto, porque se puede tomar un elemento de los iteradores más largos y descartarlo. Esto significa que ya no puede seguir usando los iteradores porque corre el riesgo de saltarse un elemento descartado.

source: The itertools module
es: El módulo itertools

source: The module's functions fall into a few broad classes:
es: Las funciones del módulo caen en unas pocas clases generales:

source: Functions that create a new iterator based on an existing iterator.
es: Funciones que crean un nuevo iterador basado en un iterador existente.

source: Functions for treating an iterator's elements as function arguments.
es: Funciones para tratar los elementos de un iterador como argumentos de función.

source: Functions for selecting portions of an iterator's output.
es: Funciones para seleccionar porciones de la salida de un iterador.

source: A function for grouping an iterator's output.
es: Una función para agrupar la salida de un iterador.

source: Creating new iterators
es: Crear nuevos iteradores

source: :func:`itertools.count(start, step) <itertools.count>` returns an infinite stream of evenly spaced values. You can optionally supply the starting number, which defaults to 0, and the interval between numbers, which defaults to 1::
es: :func:`itertools.count(start, step) <itertools.count>` retorna un flujo infinito de valores equiespaciados. Opcionalmente puede suministrar el número de inicio, que por defecto es 0, y el intervalo entre números, que por defecto es 1::

source: :func:`itertools.cycle(iter) <itertools.cycle>` saves a copy of the contents of a provided iterable and returns a new iterator that returns its elements from first to last. The new iterator will repeat these elements infinitely. ::
es: :func:`itertools.cycle(iter) <itertools.cycle>` guarda una copia de los contenidos de un iterable provisto y retorna un nuevo iterador que retorna sus elementos del primero al último. El nuevo iterador repetirá estos elementos infinitamente. ::

source: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` returns the provided element *n* times, or returns the element endlessly if *n* is not provided. ::
es: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` retorna el elemento provisto *n* veces, o retorna el elemento indefinidamente si no se provee *n*. ::

source: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` takes an arbitrary number of iterables as input, and returns all the elements of the first iterator, then all the elements of the second, and so on, until all of the iterables have been exhausted. ::
es: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` recibe un número arbitrario de iterables como entrada, y retorna todos los elementos del primer iterador, luego todos los elementos del segundo, y así sucesivamente, hasta que hayan sido agotados todos los iterables. ::

source: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` returns a stream that's a slice of the iterator. With a single *stop* argument, it will return the first *stop* elements. If you supply a starting index, you'll get *stop-start* elements, and if you supply a value for *step*, elements will be skipped accordingly. Unlike Python's string and list slicing, you can't use negative values for *start*, *stop*, or *step*. ::
es: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` retorna un flujo que es un segmento del iterador. Con solo un argumento *stop*, retornará los primeros *stop* elementos. Si suministra un índice de inicio, obtendrá los elementos *stop-start*, y si suministra un valor para *step*, los elementos se saltarán en consecuencia. A diferencia de la segmentación de listas y cadenas de caracteres de Python, no puede usar valores negativos para *start*, *stop* o *step*. ::

source: :func:`itertools.tee(iter, [n]) <itertools.tee>` replicates an iterator; it returns *n* independent iterators that will all return the contents of the source iterator. If you don't supply a value for *n*, the default is 2. Replicating iterators requires saving some of the contents of the source iterator, so this can consume significant memory if the iterator is large and one of the new iterators is consumed more than the others. ::
es: :func:`itertools.tee(iter, [n]) <itertools.tee>` replica un iterador; retorna *n* iteradores independientes que retornarán los contenidos del iterador fuente. Si no suministra un valor para *n*, por defecto es 2. Replicar iteradores requiere guardar algunos de los contenidos del iterador fuente, esto puede consumir memoria significativa si el iterador es grande y uno de los nuevos iteradores se consume más que los otros. ::

source: Calling functions on elements
es: Aplicar funciones a los elementos

source: The :mod:`operator` module contains a set of functions corresponding to Python's operators. Some examples are :func:`operator.add(a, b) <operator.add>` (adds two values), :func:`operator.ne(a, b) <operator.ne>` (same as ``a != b``), and :func:`operator.attrgetter('id') <operator.attrgetter>` (returns a callable that fetches the ``.id`` attribute).
es: El módulo :mod:`operator` contiene un conjunto de funciones correspondientes a los operadores de Python. Algunos ejemplos son :func:`operator.add(a, b) <operator.add>` (suma dos valores), :func:`operator.ne(a, b) <operator.ne>` (lo mismo que ``a != b``) y :func:`operator.attrgetter('id') <operator.attrgetter>` (retorna un invocable que obtiene el atributo ``.id``).

source: :func:`itertools.starmap(func, iter) <itertools.starmap>` assumes that the iterable will return a stream of tuples, and calls *func* using these tuples as the arguments::
es: :func:`itertools.starmap(func, iter) <itertools.starmap>` asume que el iterable retornará un flujo de tuplas, y llama a *func* usando estas tuplas como los argumentos::

source: Selecting elements
es: Seleccionar elementos

source: Another group of functions chooses a subset of an iterator's elements based on a predicate.
es: Otro grupo de funciones elige un subconjunto de elementos de un iterador basado en un predicado dado.

source: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` is the opposite of :func:`filter`, returning all elements for which the predicate returns false::
es: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` es el opuesto de :func:`filter`, retornando todos los elementos para los que el predicado retorna falso::

source: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` returns elements for as long as the predicate returns true. Once the predicate returns false, the iterator will signal the end of its results. ::
es: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` retorna los elementos mientras el predicado retorne verdadero. Una vez que el predicado retorna falso, el iterador indicará el final de sus resultados. ::

source: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` discards elements while the predicate returns true, and then returns the rest of the iterable's results. ::
es: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` descarta los elementos mientras el predicado retorne verdadero, y luego retorna el resto de los resultados del iterable. ::

source: :func:`itertools.compress(data, selectors) <itertools.compress>` takes two iterators and returns only those elements of *data* for which the corresponding element of *selectors* is true, stopping whenever either one is exhausted::
es: :func:`itertools.compress(data, selectors) <itertools.compress>` recibe dos iteradores y retorna solo aquellos elementos de *data* para los cuales el elemento correspondiente de *selectors* es verdadero, deteniéndose cuando alguno se termine::

source: Combinatoric functions
es: Funciones combinatorias

source: The :func:`itertools.combinations(iterable, r) <itertools.combinations>` returns an iterator giving all possible *r*-tuple combinations of the elements contained in *iterable*. ::
es: La función :func:`itertools.combinations(iterable, r) <itertools.combinations>` retorna un iterador proporcionando todas las combinaciones de *r*-tuplas de los elementos contenidos en *iterable*. ::

source: The elements within each tuple remain in the same order as *iterable* returned them. For example, the number 1 is always before 2, 3, 4, or 5 in the examples above. A similar function, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, removes this constraint on the order, returning all possible arrangements of length *r*::
es: Los elementos dentro de cada tupla permanecen en el mismo orden en el que *iterable* los retornó. Por ejemplo, el número 1 siempre está antes que 2, 3, 4 o 5 en los ejemplos de arriba. Una función similar, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, remueve esta restricción en el orden, retornando todas las disposiciones posibles de longitud *r*::

source: If you don't supply a value for *r* the length of the iterable is used, meaning that all the elements are permuted.
es: Si no suministra un valor para *r* se usa la longitud del iterable, lo que significa que se permutan todos los elementos.

source: Note that these functions produce all of the possible combinations by position and don't require that the contents of *iterable* are unique::
es: Note que estas funciones producen todas las combinaciones posibles por posición y no requieren que los contenidos de *iterable* sean únicos::

source: The identical tuple ``('a', 'a', 'b')`` occurs twice, but the two 'a' strings came from different positions.
es: La tupla idéntica ``('a', 'a', 'b')`` aparece dos veces, pero las dos cadenas de caracteres 'a' provienen de diferentes posiciones.

source: The :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` function relaxes a different constraint: elements can be repeated within a single tuple. Conceptually an element is selected for the first position of each tuple and then is replaced before the second element is selected. ::
es: La función :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` relaja una restricción diferente: los elementos se pueden repetir dentro de una misma tupla. Conceptualmente un elemento se elige para la primera posición de cada tupla y luego se reemplaza antes de que se elija el segundo elemento. ::

source: Grouping elements
es: Agrupar elementos

source: The last function I'll discuss, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, is the most complicated. ``key_func(elem)`` is a function that can compute a key value for each element returned by the iterable. If you don't supply a key function, the key is simply each element itself.
es: La última función que trataré, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, es la más complicada. ``key_func(elem)`` es una función que calcula un valor clave para cada elemento retornado por el iterable. Si no suministra una función de clave, la clave será simplemente el elemento mismo.

source: :func:`~itertools.groupby` collects all the consecutive elements from the underlying iterable that have the same key value, and returns a stream of 2-tuples containing a key value and an iterator for the elements with that key.
es: :func:`~itertools.groupby` reúne todos los elementos consecutivos del iterable subyacente que tienen el mismo valor clave, y retorna un flujo de 2-tuplas que contienen un valor clave y un iterador para los elementos con esa clave.

source: :func:`~itertools.groupby` assumes that the underlying iterable's contents will already be sorted based on the key. Note that the returned iterators also use the underlying iterable, so you have to consume the results of iterator-1 before requesting iterator-2 and its corresponding key.
es: :func:`~itertools.groupby` asume que los contenidos del iterable subyacente ya se ordenó basado en la clave. Note que los iteradores retornados también usan el iterable subyacente, así que tiene que consumir los resultados de iterador-1 antes de solicitar iterador-2 y su clave correspondiente.

source: The functools module
es: El módulo functools

source: For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you may wish to create a new function ``g(b, c)`` that's equivalent to ``f(1, b, c)``; you're filling in a value for one of ``f()``'s parameters. This is called "partial function application".
es: Para programas escritos en un estilo funcional, a veces querrá construir variantes de funciones existentes que tienen algunos de los parámetros predefinidos. Considere una función de Python ``f(a, b, c)``; puede querer crear una nueva función ``g(b, c)`` que sea equivalente a ``f(1, b, c)``; está completando un valor para uno de los parámetros de ``f()``. Esto se llama "aplicación parcial de funciones".

source: The constructor for :func:`~functools.partial` takes the arguments ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke ``function`` with the filled-in arguments.
es: El constructor para :func:`~functools.partial` recibe los argumentos ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. El objeto resultante es invocable, por lo que puede invocar a ``function`` con los argumentos rellenados.

source: Here's a small but realistic example::
es: Aquí hay un ejemplo pequeño pero realista::

source: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` cumulatively performs an operation on all the iterable's elements and, therefore, can't be applied to infinite iterables. *func* must be a function that takes two elements and returns a single value. :func:`functools.reduce` takes the first two elements A and B returned by the iterator and calculates ``func(A, B)``. It then requests the third element, C, calculates ``func(func(A, B), C)``, combines this result with the fourth element returned, and continues until the iterable is exhausted. If the iterable returns no values at all, a :exc:`TypeError` exception is raised. If the initial value is supplied, it's used as a starting point and ``func(initial_value, A)`` is the first calculation. ::
es: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` realiza acumulativamente una operación en todos los elementos del iterable y, por lo tanto, no se puede aplicar a infinitos iterables. *func* debe ser una función que recibe dos elementos y retorna un solo valor. :func:`functools.reduce` recibe los primeros dos elementos A y B retornados por el iterador y calcula ``func(A, B)``. Luego pide el tercer elemento, C, calcula ``func(func(A, B), C)``, combina este resultado con el cuarto elemento retornado, y continua hasta que se agote el iterable. Si el iterable no retorna ningún valor, se lanza una excepción :exc:`TypeError`. Si se suministra el valor inicial, se usa como punto inicial y ``func(initial_value, A)`` es el primer cálculo. ::

source: If you use :func:`operator.add` with :func:`functools.reduce`, you'll add up all the elements of the iterable. This case is so common that there's a special built-in called :func:`sum` to compute it:
es: Si usa :func:`operator.add` con :func:`functools.reduce`, sumará todos los elementos del iterable. Este caso es tan común que hay una función incorporada especial llamada :func:`sum` para calcularla:

source: For many uses of :func:`functools.reduce`, though, it can be clearer to just write the obvious :keyword:`for` loop::
es: Sin embargo, para muchos usos de :func:`functools.reduce` puede ser mas claro simplemente escribir el ciclo :keyword:`for`::

source: The operator module
es: El módulo operator

source: The :mod:`operator` module was mentioned earlier. It contains a set of functions corresponding to Python's operators. These functions are often useful in functional-style code because they save you from writing trivial functions that perform a single operation.
es: El módulo :mod:`operator` se mencionó anteriormente. Contiene un conjunto de funciones que corresponden a los operadores de Python. Estas funciones a menudo son útiles en código en estilo funcional porque le salvan de escribir funciones triviales que realizan una sola operación.

source: Some of the functions in this module are:
es: Algunas de las funciones en este módulo son:

source: Math operations: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...
es: Operaciones matemáticas: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...

source: Logical operations: ``not_()``, ``truth()``.
es: Operaciones lógicas: ``not_()``, ``truth()``.

source: Bitwise operations: ``and_()``, ``or_()``, ``invert()``.
es: Operaciones bit a bit: ``and_()``, ``or_()``, ``invert()``.

source: Comparisons: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, and ``ge()``.
es: Comparaciones: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()`` y ``ge()``.

source: Object identity: ``is_()``, ``is_not()``.
es: Identidad de objeto: ``is_()``, ``is_not()``.

source: Consult the operator module's documentation for a complete list.
es: Consulte la documentación del módulo operator para una lista completa.

source: Small functions and the lambda expression
es: Funciones pequeñas y la expresión lambda

source: When writing functional-style programs, you'll often need little functions that act as predicates or that combine elements in some way.
es: Cuando se escriben programas en estilo funcional, a menudo necesitará pequeñas funciones que actúen como predicados o que combinen elementos de alguna manera.

source: If there's a Python built-in or a module function that's suitable, you don't need to define a new function at all::
es: Si hay una función incorporada o un módulo de Python, no necesita definir una nueva función en absoluto::

source: If the function you need doesn't exist, you need to write it. One way to write small functions is to use the :keyword:`lambda` expression. ``lambda`` takes a number of parameters and an expression combining these parameters, and creates an anonymous function that returns the value of the expression::
es: Si la función que necesita no existe, necesita escribirla. Una forma de escribir funciones pequeñas es usar la expresión :keyword:`lambda`. ``lambda`` recibe un número de parámetros y una expresión que combina estos parámetros, y crea una función anónima que retorna el valor de la expresión::

source: An alternative is to just use the ``def`` statement and define a function in the usual way::
es: Una alternativa es simplemente usar la sentencia ``def`` y definir una función en la forma usual::

source: Which alternative is preferable? That's a style question; my usual course is to avoid using ``lambda``.
es: ¿Qué alternativa es preferible? Esa es una pregunta de estilo; mi rumbo usual es evitar usar ``lambda``.

source: One reason for my preference is that ``lambda`` is quite limited in the functions it can define. The result has to be computable as a single expression, which means you can't have multiway ``if... elif... else`` comparisons or ``try... except`` statements. If you try to do too much in a ``lambda`` statement, you'll end up with an overly complicated expression that's hard to read. Quick, what's the following code doing? ::
es: Una razón para mi preferencia es que ``lambda`` es muy limitado en las funciones que puede definir. El resultado tiene que ser calculable como una sola expresión, que significa que no tiene comparaciones multivía ``if... elif... else`` o sentencias ``try... except``. Si intenta hacer mucho en una sentencia ``lambda``, terminará con una expresión demasiado complicada que es difícil de leer. Rápido, ¿qué hace el siguiente código? ::

source: You can figure it out, but it takes time to disentangle the expression to figure out what's going on. Using a short nested ``def`` statements makes things a little bit better::
es: Puede averiguarlo, pero toma tiempo desenredar la expresión para averiguar que está pasando. Usar una corta sentencia ``def`` anidada hace las cosas un poco mejor::

source: But it would be best of all if I had simply used a ``for`` loop::
es: Pero lo mejor de todo sería si simplemente hubiese usado un ciclo ``for``::

source: Or the :func:`sum` built-in and a generator expression::
es: O la función incorporada :func:`sum` y una expresión generadora::

source: Many uses of :func:`functools.reduce` are clearer when written as ``for`` loops.
es: Muchos usos de :func:`functools.reduce` son más claros cuando se escriben como ciclos ``for``.

source: Fredrik Lundh once suggested the following set of rules for refactoring uses of ``lambda``:
es: Fredrik Lundh una vez sugirió el siguiente conjunto de reglas para refactorizar los usos de ``lambda``:

source: Write a lambda function.
es: Escribir una función lambda.
