Repository: python/python-docs-es
Catalog: howto/functional.po
Languages: es

source: Write a comment explaining what the heck that lambda does.
es: Escribir un comentario explicando qué demonios hace esa lambda.

source: Study the comment for a while, and think of a name that captures the essence of the comment.
es: Estudiar el comentario por un momento, y pensar en un nombre que capture la esencia del comentario.

source: Convert the lambda to a def statement, using that name.
es: Convertir la lambda a una sentencia def, usando ese nombre.

source: Remove the comment.
es: Remover el comentario.

source: I really like these rules, but you're free to disagree about whether this lambda-free style is better.
es: Me gustan mucho estas reglas, pero es libre de disentir acerca de si este estilo libre de lambda es mejor.

source: Revision History and Acknowledgements
es: Historia de revisiones y reconocimientos

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.
es: Al autor le gustaría agradecer a las siguientes personar por ofrecer sugerencias, correcciones y asistencia con varios borradores de este articulo: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.

source: Version 0.1: posted June 30 2006.
es: Versión 0.1: publicada el 30 de junio de 2006.

source: Version 0.11: posted July 1 2006. Typo fixes.
es: Versión 0.11: publicada el 1 de julio de 2006. Errores tipográficos arreglados.

source: Version 0.2: posted July 10 2006. Merged genexp and listcomp sections into one. Typo fixes.
es: Versión 0.2: publicada el 10 de julio de 2006. Secciones genexp y listcomp unidas en una sola. Errores tipográficos arreglados.

source: Version 0.21: Added more references suggested on the tutor mailing list.
es: Versión 0.21: Agregadas mas referencias sugeridas en la lista de correos tutor.

source: Version 0.30: Adds a section on the ``functional`` module written by Collin Winter; adds short section on the operator module; a few other edits.
es: Versión 0.30: Agrega una sección sobre el módulo ``functional`` escrito por Collin Winter; agrega una sección corta sobre el módulo operator; y unas pocas otras ediciones.

source: References
es: Referencias

source: General
es: Generales

source: https://en.wikipedia.org/wiki/Functional_programming: General Wikipedia entry describing functional programming.
es: https://es.wikipedia.org/wiki/Programaci%C3%B3n_funcional: Entrada general de Wikipedia que describe la programación funcional.

source: https://en.wikipedia.org/wiki/Coroutine: Entry for coroutines.
es: https://es.wikipedia.org/wiki/Corrutina: Entrada para corrutinas.

source: https://en.wikipedia.org/wiki/Currying: Entry for the concept of currying.
es: https://es.wikipedia.org/wiki/Currificaci%C3%B3n: Entrada para el concepto de currificación.

source: Python-specific
es: Específicas de Python

source: Mertz also wrote a 3-part series of articles on functional programming for IBM's DeveloperWorks site; see `part 1 <https://developer.ibm.com/articles/l-prog/>`__, `part 2 <https://developer.ibm.com/tutorials/l-prog2/>`__, and `part 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,
es: Mertz también escribió una serie de artículos de 3 partes sobre programación funcional para el sitio DeveloperWorks de IBM; ver `parte 1 <https://developer.ibm.com/articles/l-prog/>`__, `parte 2 <https://developer.ibm.com/tutorials/l-prog2/>`__, y `parte 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,

source: Python documentation
es: Documentación de Python

source: Documentation for the :mod:`itertools` module.
es: Documentación del módulo :mod:`itertools`.

source: Documentation for the :mod:`functools` module.
es: Documentación del módulo :mod:`functools`.

source: Documentation for the :mod:`operator` module.
es: Documentación del módulo :mod:`operator`.

source: :pep:`289`: "Generator Expressions"
es: :pep:`289`: "Expresiones generadoras"

source: :pep:`342`: "Coroutines via Enhanced Generators" describes the new generator features in Python 2.5.
es: :pep:`342`: "Corrutinas a través de generadores mejorados" describe las características del nuevo generador en Python 2.5.
