Repository: python/python-docs-es
Catalog: howto/logging.po
Languages: es_us

source: By default, no destination is set for any logging messages. You can specify a destination (such as console or file) by using :func:`basicConfig` as in the tutorial examples. If you call the functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`, they will check to see if no destination is set; and if one is not set, they will set a destination of the console (``sys.stderr``) and a default format for the displayed message before delegating to the root logger to do the actual message output.
es_us: Por defecto, no se establece ningún destino para los mensajes de registro. Puede especificar un destino (como consola o archivo) usando :func:`basicConfig` como en los ejemplos del tutorial. Si llama a las funciones :func:`debug`, :func:`info`, :func:`warning`, :func:`error` y :func:`critical`, ellas comprobarán si no hay ningún destino establecido; y si no hay ninguno establecido, establecerán un destino de la consola (``sys.stderr``) y un formato por defecto para el mensaje mostrado antes de delegar en el registrador root para hacer la salida real del mensaje.

source: The default format set by :func:`basicConfig` for messages is:
es_us: El formato por defecto establecido por :func:`basicConfig` para los mensajes es:

source: You can change this by passing a format string to :func:`basicConfig` with the *format* keyword argument. For all options regarding how a format string is constructed, see :ref:`formatter-objects`.
es_us: Puedes cambiar esto pasando una cadena de formato a :func:`basicConfig` con el argumento de la palabra clave *format*. Para todas las opciones relativas a cómo se construye una cadena de formato, ver :ref:`formatter-objects`.

source: Logging Flow
es_us: Flujo de Registro

source: The flow of log event information in loggers and handlers is illustrated in the following diagram.
es_us: En el siguiente diagrama se ilustra el flujo de información de los eventos de registro en los registradores y manipuladores.

source: Loggers
es_us: Registradores

source: :class:`Logger` objects have a threefold job. First, they expose several methods to application code so that applications can log messages at runtime. Second, logger objects determine which log messages to act upon based upon severity (the default filtering facility) or filter objects. Third, logger objects pass along relevant log messages to all interested log handlers.
es_us: Los objetos de :class:`Logger` tienen un trabajo triple. Primero, exponen varios métodos al código de la aplicación para que las aplicaciones puedan registrar mensajes en tiempo de ejecución. Segundo, los objetos logger determinan sobre qué mensajes de registro actuar en base de la severidad (la facilidad de filtrado por defecto) o los objetos de filtro. Tercero, los objetos registradores pasan los mensajes de registro relevantes a todos los manejadores de registro interesados.

source: The most widely used methods on logger objects fall into two categories: configuration and message sending.
es_us: Los métodos más utilizados en los objetos de registro se dividen en dos categorías: configuración y envío de mensajes.

source: These are the most common configuration methods:
es_us: Estos son los métodos de configuración más comunes:

source: Handlers
es_us: Manipuladores

source: :meth:`~Handler.setFormatter` selects a Formatter object for this handler to use.
es_us: :meth:`~Handler.setFormatter` selecciona un objeto Formatter para que este handler lo use.

source: :meth:`~Handler.addFilter` and :meth:`~Handler.removeFilter` respectively configure and deconfigure filter objects on handlers.
es_us: :meth:`~Handler.addFilter` y :meth:`~Handler.removeFilter` respectivamente configuran y desconfiguran los objetos del filtro en los handlers.

source: with the milliseconds tacked on at the end. The ``style`` is one of `%`, '{' or '$'. If one of these is not specified, then '%' will be used.
es_us: con los milisegundos clavados al final. El "estilo" es uno de "%", "{" o "$". Si uno de estos no se especifica, entonces se usará "%".

source: Configuring Logging
es_us: Configuración del registro

source: Here is the logging.conf file:
es_us: Aquí está el archivo logging.conf:

source: In Python 3.2 and later, the behaviour is as follows:
es_us: En Python 3.2 y posteriores, el comportamiento es el siguiente:

source: To obtain the pre-3.2 behaviour, ``logging.lastResort`` can be set to ``None``.
es_us: Para obtener el comportamiento anterior a la 3.2, ``logging.lastResort`` se puede configurar como ``None``.

source: Configuring Logging for a Library
es_us: Configuración del registro para una Librería

source: should have the desired effect. If an organisation produces a number of libraries, then the logger name specified can be 'orgname.foo' rather than just 'foo'.
es_us: debería tener el efecto deseado. Si una organización produce varias librerías, el nombre del registrador especificado puede ser ‘orgname.foo’ en lugar de sólo ‘foo’.

source: Logging Levels
es_us: Niveles de registro

source: Numeric value
es_us: Valor numérico

source: Custom Levels
es_us: Niveles personalizados

source: Useful Handlers
es_us: Manipuladores útiles

source: In addition to the base :class:`Handler` class, many useful subclasses are provided:
es_us: Además de la base :class:`Handler` class, se proporcionan muchas subclases útiles:

source: :class:`StreamHandler` instances send messages to streams (file-like objects).
es_us: :class:`StreamHandler` instancias envían mensajes a los streams (objetos como de tipo archivo).

source: :class:`FileHandler` instances send messages to disk files.
es_us: :class:`FileHandler` instancias enviar mensajes a los archivos del disco.

source: :class:`~handlers.SocketHandler` instances send messages to TCP/IP sockets. Since 3.4, Unix domain sockets are also supported.
es_us: Las instancias de :class:`~handlers.SocketHandler` envían mensajes a los sockets TCP/IP. Desde la versión 3.4, los sockets de dominio Unix también están soportados.

source: :class:`~handlers.DatagramHandler` instances send messages to UDP sockets. Since 3.4, Unix domain sockets are also supported.
es_us: Instancias de :class:`~handlers.DatagramHandler` envían mensajes a los sockets UDP. Desde la versión 3.4, los sockets de dominio Unix también están soportados.

source: :class:`~handlers.SMTPHandler` instances send messages to a designated email address.
es_us: Las instancias de :class:`~handlers.SMTPHandler` envían mensajes a una dirección de correo electrónico designada.

source: :class:`~handlers.SysLogHandler` instances send messages to a Unix syslog daemon, possibly on a remote machine.
es_us: Las instancias de :class:`~handlers.SysLogHandler` envían mensajes a un demonio del syslog de Unix, posiblemente en una máquina remota.

source: :class:`~handlers.NTEventLogHandler` instances send messages to a Windows NT/2000/XP event log.
es_us: Las instancias de :class:`~handlers.NTEventLogHandler` envian mensajes a un registro de eventos de Windows NT/2000/XP.

source: :class:`~handlers.MemoryHandler` instances send messages to a buffer in memory, which is flushed whenever specific criteria are met.
es_us: Las instancias de :class:`~handlers.MemoryHandler` envían mensajes a un buffer en la memoria, que es limpiado cuando se cumplen ciertos criterios.

source: :class:`~handlers.HTTPHandler` instances send messages to an HTTP server using either ``GET`` or ``POST`` semantics.
es_us: Las instancias de :class:`~handlers.HTTPHandler` envían mensajes a un servidor HTTP usando la semántica de "GET" o "POST".

source: :class:`~handlers.WatchedFileHandler` instances watch the file they are logging to. If the file changes, it is closed and reopened using the file name. This handler is only useful on Unix-like systems; Windows does not support the underlying mechanism used.
es_us: Las instancias de :class:`~handlers.WatchedFileHandler` ven el archivo al que están accediendo. Si el archivo cambia, se cierra y se vuelve a abrir usando el nombre del archivo. Este manejador sólo es útil en sistemas tipo Unix; Windows no soporta el mecanismo subyacente utilizado.

source: :class:`~handlers.QueueHandler` instances send messages to a queue, such as those implemented in the :mod:`queue` or :mod:`multiprocessing` modules.
es_us: Las instancias de :class:`~handlers.QueueHandler` envían mensajes a una cola, como los implementados en los módulos :mod:`queue` or :mod:`multiprocessing`.

source: The :class:`NullHandler` class.
es_us: La clase de `NullHandler`.

source: Optimization
es_us: Optimización

source: Formatting of message arguments is deferred until it cannot be avoided. However, computing the arguments passed to the logging method can also be expensive, and you may want to avoid doing it if the logger will just throw away your event. To decide what to do, you can call the :meth:`~Logger.isEnabledFor` method which takes a level argument and returns true if the event would be created by the Logger for that level of call. You can write code like this::
es_us: El formato de los argumentos del mensaje se aplaza hasta que no se pueda evitar. Sin embargo, el cálculo de los argumentos pasados al método de registro también puede ser costoso, y puede que quieras evitar hacerlo si el registrador simplemente tirará tu evento. Para decidir qué hacer, puedes llamar al método :meth:`~Logger.isEnabledFor` que toma un argumento de nivel y devuelve true si el evento sería creado por el Logger para ese nivel de llamada. Puedes escribir código como este::

source: so that if the logger's threshold is set above ``DEBUG``, the calls to :func:`expensive_func1` and :func:`expensive_func2` are never made.
es_us: de modo que si el umbral del registrador se establece por encima de ``DEBUG``, las llamadas a :func:`expensive_func1` y :func:`expensive_func2` nunca se hacen.

source: In some cases, :meth:`~Logger.isEnabledFor` can itself be more expensive than you'd like (e.g. for deeply nested loggers where an explicit level is only set high up in the logger hierarchy). In such cases (or if you want to avoid calling a method in tight loops), you can cache the result of a call to :meth:`~Logger.isEnabledFor` in a local or instance variable, and use that instead of calling the method each time. Such a cached value would only need to be recomputed when the logging configuration changes dynamically while the application is running (which is not all that common).
es_us: En algunos casos, :meth:`~Logger.isEnabledFor` puede ser en sí mismo más caro de lo que te gustaría (por ejemplo, para los loggers profundamente anidados donde un nivel explícito sólo se establece en lo alto de la jerarquía de loggers). En estos casos (o si quieres evitar llamar a un método en bucles estrechos), puedes guardar en caché el resultado de una llamada a :meth:`~Logger.isEnabledFor` en una variable local o de instancia, y usarla en lugar de llamar al método cada vez. Tal valor en caché sólo necesitaría ser recalculado cuando la configuración de registro cambie dinámicamente mientras la aplicación se está ejecutando (lo cual no es tan común).

source: There are other optimizations which can be made for specific applications which need more precise control over what logging information is collected. Here's a list of things you can do to avoid processing during logging which you don't need:
es_us: Hay otras optimizaciones que pueden hacerse para aplicaciones específicas que necesitan un control más preciso sobre la información de registro que se recoge. Aquí hay una lista de cosas que puede hacer para evitar el procesamiento durante el registro que no necesita:

source: What you don't want to collect
es_us: Lo que no quieres colectar

source: How to avoid collecting it
es_us: Cómo evitar coleccionarlo

source: Information about where calls were made from.
es_us: Información sobre dónde se hicieron las llamadas.

source: Set ``logging._srcfile`` to ``None``. This avoids calling :func:`sys._getframe`, which may help to speed up your code in environments like PyPy (which can't speed up code that uses :func:`sys._getframe`), if and when PyPy supports Python 3.x.
es_us: Ponga ``logging._srcfile`` a ``None``. Esto evita llamar a :func:`sys._getframe`, lo que puede ayudar a acelerar tu código en entornos como PyPy (cual no puede acelerar el código que usa :func:`sys._getframe`), siempre y cuando PyPy soporte Python 3.x.

source: Threading information.
es_us: Información sobre código enhebrado.

source: Set ``logging.logThreads`` to ``0``.
es_us: Ponga ``logging.logThreads`` en ``0``.

source: Process information.
es_us: Procesar la información.

source: Set ``logging.logProcesses`` to ``0``.
es_us: Ponga ``logging.logProcesses`` en ``0``.

source: Also note that the core logging module only includes the basic handlers. If you don't import :mod:`logging.handlers` and :mod:`logging.config`, they won't take up any memory.
es_us: Obsérve también que el módulo de registro del núcleo sólo incluye los manipuladores básicos. Si no importas :mod:`logging.handlers` y :mod:`logging.config`, no ocuparán ninguna memoria.

source: Module :mod:`logging`
es_us: Módulo :mod:`logging`

source: API reference for the logging module.
es_us: Referencia API para el módulo de registro.

source: Module :mod:`logging.config`
es_us: Módulo :mod:`logging.config`

source: Configuration API for the logging module.
es_us: API de configuración para el módulo de registro.

source: Module :mod:`logging.handlers`
es_us: Módulo :mod:``logging.handlers``

source: Useful handlers included with the logging module.
es_us: Manipuladores útiles incluidos en el módulo de registro.

source: :ref:`A logging cookbook <logging-cookbook>`
es_us: :ref:`Un libro de recetas </logging-cookbook>`
