Repository: python/python-docs-es
Catalog: howto/logging-cookbook.po
Languages: es

source: To illustrate how you can send log messages via email, so that a set number of messages are sent per email, you can subclass :class:`~logging.handlers.BufferingHandler`. In the following example, which you can adapt to suit your specific needs, a simple test harness is provided which allows you to run the script with command line arguments specifying what you typically need to send things via SMTP. (Run the downloaded script with the ``-h`` argument to see the required and optional arguments.)
es: Para ilustrar cómo puede enviar mensajes de logging por correo electrónico, de modo que se envíe un número determinado de mensajes, puede usar la subclase :class:`~logging.handlers.BufferingHandler`. En el siguiente ejemplo, que puedes adaptar a tus necesidades específicas, se proporciona un sencillo arnés de pruebas que permite ejecutar el script con argumentos de línea de comandos especificando lo que normalmente necesitas para enviar cosas por SMTP. (Ejecute el script descargado con el argumento ``-h`` para ver los argumentos necesarios y opcionales).

source: If you run this script and your SMTP server is correctly set up, you should find that it sends eleven emails to the addressee you specify. The first ten emails will each have ten log messages, and the eleventh will have two messages. That makes up 102 messages as specified in the script.
es: Si ejecuta este script y su servidor SMTP está correctamente configurado, debería ver que envía once correos electrónicos al destinatario que usted especifique. Los primeros diez correos electrónicos tendrán cada uno diez mensajes de log, y el undécimo tendrá dos mensajes. Eso hace 102 mensajes como se especifica en el script.

source: Formatting times using UTC (GMT) via configuration
es: Formateo de horas usando UTC (GMT) a través de la configuración

source: Sometimes you want to format times using UTC, which can be done using a class such as ``UTCFormatter``, shown below::
es: A veces desea formatear las horas usando UTC, lo que se puede hacer usando una clase como ``UTCFormatter``, como se muestra a continuación::

source: and you can then use the ``UTCFormatter`` in your code instead of :class:`~logging.Formatter`. If you want to do that via configuration, you can use the :func:`~logging.config.dictConfig` API with an approach illustrated by the following complete example::
es: y luego puede usar el ``UTCFormatter`` en su código en lugar de :class:`~logging.Formatter`. Si desea hacer eso a través de la configuración, puede usar la API :func:`~logging.config.dictConfig` con un enfoque ilustrado por el siguiente ejemplo completo::

source: When this script is run, it should print something like:
es: Cuando se ejecuta este script, debería imprimir algo como:

source: showing how the time is formatted both as local time and UTC, one for each handler.
es: mostrando cómo se formatea la hora como hora local y UTC, una para cada gestor.

source: Using a context manager for selective logging
es: Usar un administrador de contexto para logging selectivo

source: There are times when it would be useful to temporarily change the logging configuration and revert it back after doing something. For this, a context manager is the most obvious way of saving and restoring the logging context. Here is a simple example of such a context manager, which allows you to optionally change the logging level and add a logging handler purely in the scope of the context manager::
es: Hay ocasiones en las que sería útil cambiar temporalmente la configuración de logging y revertir esto después de hacer algo. Para ello, un administrador de contexto es la forma más obvia de guardar y restaurar el contexto de logging. Aquí hay un ejemplo simple de un administrador de contexto de este tipo, que le permite cambiar opcionalmente el nivel de logging y agregar un gestor de logging exclusivamente en el alcance del administrador de contexto::

source: If you specify a level value, the logger's level is set to that value in the scope of the with block covered by the context manager. If you specify a handler, it is added to the logger on entry to the block and removed on exit from the block. You can also ask the manager to close the handler for you on block exit - you could do this if you don't need the handler any more.
es: Si especifica un valor de nivel, el nivel del registrador se establece en ese valor en el alcance del bloque *with* cubierto por el administrador de contexto. Si especifica un gestor, se agrega al registrador al entrar al bloque y se elimina al salir del bloque. También puede pedirle al administrador que cierre el gestor por usted al salir del bloque si ya no lo necesita.

source: To illustrate how it works, we can add the following block of code to the above::
es: Para ilustrar cómo funciona, podemos agregar el siguiente bloque de código al anterior::

source: We initially set the logger's level to ``INFO``, so message #1 appears and message #2 doesn't. We then change the level to ``DEBUG`` temporarily in the following ``with`` block, and so message #3 appears. After the block exits, the logger's level is restored to ``INFO`` and so message #4 doesn't appear. In the next ``with`` block, we set the level to ``DEBUG`` again but also add a handler writing to ``sys.stdout``. Thus, message #5 appears twice on the console (once via ``stderr`` and once via ``stdout``). After the ``with`` statement's completion, the status is as it was before so message #6 appears (like message #1) whereas message #7 doesn't (just like message #2).
es: Inicialmente configuramos el nivel del registrador en ``INFO``, por lo que aparece el mensaje #1 y el mensaje #2 no. Luego cambiamos el nivel a ``DEBUG`` temporalmente en el siguiente bloque ``with``, y aparece el mensaje #3. Una vez que se sale del bloque, el nivel del registrador se restaura a ``INFO`` y, por lo tanto, el mensaje #4 no aparece. En el siguiente bloque ``with``, configuramos el nivel en ``DEBUG`` nuevamente, pero también agregamos un gestor que escribe en ``sys.stdout``. Por lo tanto, el mensaje #5 aparece dos veces en la consola (una vez a través de ``stderr`` y una vez a través de ``stdout``). Después de la finalización de la declaración ``with``, se vuelve al estado anterior, por lo que aparece el mensaje #6 (como el mensaje #1) mientras que el mensaje #7 no (como el mensaje #2).

source: If we run the resulting script, the result is as follows:
es: Si ejecutamos el script resultante, el resultado es el siguiente:

source: If we run it again, but pipe ``stderr`` to ``/dev/null``, we see the following, which is the only message written to ``stdout``:
es: Si lo ejecutamos de nuevo, pero dirigimos ``stderr`` a ``/dev/null``, vemos lo siguiente, que es el único mensaje escrito en ``stdout``:

source: Once again, but piping ``stdout`` to ``/dev/null``, we get:
es: Una vez más, pero canalizando ``stdout`` a ``/dev/null``, obtenemos:

source: In this case, the message #5 printed to ``stdout`` doesn't appear, as expected.
es: En este caso, el mensaje #5 impreso en ``stdout`` no aparece, como se esperaba.

source: Of course, the approach described here can be generalised, for example to attach logging filters temporarily. Note that the above code works in Python 2 as well as Python 3.
es: Por supuesto, el enfoque descrito aquí puede generalizarse, por ejemplo, para adjuntar filtros de logging temporalmente. Tenga en cuenta que el código anterior funciona tanto en Python 2 como en Python 3.

source: A CLI application starter template
es: Una plantilla de inicio de aplicación CLI

source: Here's an example which shows how you can:
es: Aquí hay un ejemplo que muestra cómo puede:

source: Use a logging level based on command-line arguments
es: Utilizar un nivel de logging basado en argumentos de la línea de comandos

source: Dispatch to multiple subcommands in separate files, all logging at the same level in a consistent way
es: Enviar a varios subcomandos en archivos separados, todos registrando en el mismo nivel de forma coherente

source: Make use of simple, minimal configuration
es: Utilizar una configuración mínima y sencilla

source: Suppose we have a command-line application whose job is to stop, start or restart some services. This could be organised for the purposes of illustration as a file ``app.py`` that is the main script for the application, with individual commands implemented in ``start.py``, ``stop.py`` and ``restart.py``. Suppose further that we want to control the verbosity of the application via a command-line argument, defaulting to ``logging.INFO``. Here's one way that ``app.py`` could be written::
es: Supongamos que tenemos una aplicación de línea de comandos cuyo trabajo es detener, iniciar o reiniciar algunos servicios. Esto podría organizarse con fines ilustrativos como un archivo ``app.py`` que es el script principal de la aplicación, con comandos individuales implementados en ``start.py``, ``stop.py`` y ``restart.py``. Supongamos además que queremos controlar la verbosidad de la aplicación a través de un argumento de línea de comandos, por defecto en ``logging.INFO``. Aquí hay una forma en que se podría escribir ``app.py``::

source: And the ``start``, ``stop`` and ``restart`` commands can be implemented in separate modules, like so for starting::
es: Y los comandos ``start``, ``stop`` y ``reiniciar`` se pueden implementar en módulos separados, como para iniciar::

source: and thus for stopping::
es: y así para detener::

source: and similarly for restarting::
es: y de manera similar para reiniciar::

source: If we run this application with the default log level, we get output like this:
es: Si ejecutamos esta aplicación con el nivel de log predeterminado, obtenemos un resultado como este:

source: The first word is the logging level, and the second word is the module or package name of the place where the event was logged.
es: La primera palabra es el nivel de logging y la segunda palabra es el nombre del módulo o paquete del lugar donde se registró el evento.

source: If we change the logging level, then we can change the information sent to the log. For example, if we want more information:
es: Si cambiamos el nivel de logging, podemos cambiar la información enviada al log. Por ejemplo, si queremos más información:

source: And if we want less:
es: Y si queremos menos:

source: In this case, the commands don't print anything to the console, since nothing at ``WARNING`` level or above is logged by them.
es: En este caso, los comandos no imprimen nada en la consola, ya que no registran nada en el nivel de ``WARNING`` o superior.

source: A Qt GUI for logging
es: Una GUI de Qt para logging

source: A question that comes up from time to time is about how to log to a GUI application. The `Qt <https://www.qt.io/>`_ framework is a popular cross-platform UI framework with Python bindings using `PySide2 <https://pypi.org/project/PySide2/>`_ or `PyQt5 <https://pypi.org/project/PyQt5/>`_ libraries.
es: Una pregunta que surge de vez en cuando es sobre cómo *loggear* en una aplicación GUI. El *framework* `Qt <https://www.qt.io/>`_ es un *framework* popular multiplataforma con bindings de Python que usan `PySide2 <https://pypi.org/project/PySide2/>`_ o librerías `PyQt5 <https://pypi.org/project/PyQt5/>`_.

source: The following example shows how to log to a Qt GUI. This introduces a simple ``QtHandler`` class which takes a callable, which should be a slot in the main thread that does GUI updates. A worker thread is also created to show how you can log to the GUI from both the UI itself (via a button for manual logging) as well as a worker thread doing work in the background (here, just logging messages at random levels with random short delays in between).
es: El siguiente ejemplo muestra cómo iniciar sesión en una GUI de Qt. Esto introduce una clase simple ``QtHandler`` que toma un invocable, que debería ser un slot en el hilo principal que realiza actualizaciones de la GUI. También se crea un hilo de trabajo para mostrar cómo puede iniciar sesión en la GUI tanto desde la propia interfaz de usuario (a través de un botón para el logging manual) como desde un hilo de trabajo que trabaja en segundo plano (aquí, simplemente registrando mensajes en niveles aleatorios con aleatorio breves retrasos intermedios).

source: The worker thread is implemented using Qt's ``QThread`` class rather than the :mod:`threading` module, as there are circumstances where one has to use ``QThread``, which offers better integration with other ``Qt`` components.
es: El hilo *worker* se implementa usando la clase ``QThread`` de Qt en lugar del módulo :mod:`threading`, ya que hay circunstancias en las que uno tiene que usar ``QThread``, que ofrece una mejor integración con otros componentes ``Qt``.

source: The code should work with recent releases of either ``PySide2`` or ``PyQt5``. You should be able to adapt the approach to earlier versions of Qt. Please refer to the comments in the code snippet for more detailed information.
es: El código debería funcionar con versiones recientes de ``PySide2`` o ``PyQt5``. Debería poder adaptar el enfoque a versiones anteriores de Qt. Consulte los comentarios en el fragmento de código para obtener información más detallada.

source: Logging to syslog with RFC5424 support
es: Logging en syslog con soporte RFC5424

source: RFC 5424 contains some useful features such as support for structured data, and if you need to be able to log to a syslog server with support for it, you can do so with a subclassed handler which looks something like this::
es: El RFC 5424 contiene algunas características útiles como el soporte para datos estructurados, y si necesitas poder registrar en un servidor syslog con soporte para ello, puedes hacerlo con una subclase *handler* que se parezca a esto::

source: You'll need to be familiar with RFC 5424 to fully understand the above code, and it may be that you have slightly different needs (e.g. for how you pass structural data to the log). Nevertheless, the above should be adaptable to your speciric needs. With the above handler, you'd pass structured data using something like this::
es: Tendrá que estar familiarizado con el RFC 5424 para entender completamente el código anterior, y puede ser que tenga necesidades ligeramente diferentes (por ejemplo, para la forma de pasar los datos estructurales al log). No obstante, lo anterior debería poder adaptarse a sus necesidades específicas. Con el gestor anterior, usted pasaría datos estructurados usando algo como esto::

source: How to treat a logger like an output stream
es: Cómo tratar un logger como una salida stream

source: Sometimes, you need to interface to a third-party API which expects a file-like object to write to, but you want to direct the API's output to a logger. You can do this using a class which wraps a logger with a file-like API. Here's a short script illustrating such a class:
es: A veces, necesitas interactuar con una API de terceros que espera un objeto tipo archivo para escribir, pero quieres dirigir la salida de la API a un logger. Puedes hacer esto usando una clase que envuelva un logger con una API tipo archivo. Aquí hay un pequeño script que ilustra tal clase:

source: When this script is run, it prints
es: Cuando se ejecuta este script, se imprime

source: You could also use ``LoggerWriter`` to redirect ``sys.stdout`` and ``sys.stderr`` by doing something like this:
es: También puedes usar ``LoggerWriter`` para redirigir ``sys.stdout`` y ``sys.stderr`` haciendo algo así:

source: You should do this *after* configuring logging for your needs. In the above example, the :func:`~logging.basicConfig` call does this (using the ``sys.stderr`` value *before* it is overwritten by a ``LoggerWriter`` instance). Then, you'd get this kind of result:
es: Debería hacer esto *después* de configurar logging para sus necesidades. En el ejemplo anterior, la llamada :func:`~logging.basicConfig` hace esto (utilizando el valor de ``sys.stderr`` *antes* de que sea sobrescrito por una instancia de ``LoggerWriter``). Entonces, obtendrías este tipo de resultado:

source: Of course, the examples above show output according to the format used by :func:`~logging.basicConfig`, but you can use a different formatter when you configure logging.
es: Por supuesto, los ejemplos anteriores muestran la salida según el formato utilizado por :func:`~logging.basicConfig`, pero puede utilizar un formateador diferente cuando configure logging.

source: Note that with the above scheme, you are somewhat at the mercy of buffering and the sequence of write calls which you are intercepting. For example, with the definition of ``LoggerWriter`` above, if you have the snippet
es: Ten en cuenta que con el esquema anterior, estás un poco a merced del buffering y de la secuencia de llamadas de escritura que estás interceptando. Por ejemplo, con la definición de ``LoggerWriter`` anterior, si tienes el fragmento

source: then running the script results in
es: entonces la ejecución del script da como resultado

source: This just buffers up stuff until a newline is seen, and then logs complete lines. With this approach, you get better output:
es: Esto sólo almacena cosas hasta que se ve una nueva línea, y luego registra las líneas completas. Con este enfoque, se obtiene una mejor salida:

source: Patterns to avoid
es: Patrones para evitar

source: Although the preceding sections have described ways of doing things you might need to do or deal with, it is worth mentioning some usage patterns which are *unhelpful*, and which should therefore be avoided in most cases. The following sections are in no particular order.
es: Aunque las secciones anteriores han descrito formas de hacer las cosas que podría necesitar hacer o con las que tratar, vale la pena mencionar algunos patrones de uso que son *inútiles* y que, por lo tanto, deben evitarse en la mayoría de los casos. Las siguientes secciones no están en ningún orden en particular.

source: Opening the same log file multiple times
es: Abrir el mismo archivo de registro varias veces

source: On Windows, you will generally not be able to open the same file multiple times as this will lead to a "file is in use by another process" error. However, on POSIX platforms you'll not get any errors if you open the same file multiple times. This could be done accidentally, for example by:
es: En Windows, por lo general, no podrá abrir el mismo archivo varias veces, ya que esto lanzará un error de "otro proceso está usando el archivo". Sin embargo, en las plataformas POSIX no obtendrá ningún error si abre el mismo archivo varias veces. Esto podría hacerse accidentalmente, por ejemplo:

source: Adding a file handler more than once which references the same file (e.g. by a copy/paste/forget-to-change error).
es: Agregar un controlador de archivos más de una vez que hace referencia al mismo archivo (por ejemplo, mediante un error de copiar/pegar/olvidar-cambiar).

source: Opening two files that look different, as they have different names, but are the same because one is a symbolic link to the other.
es: Abrir dos archivos que se ven diferentes, ya que tienen diferentes nombres, pero son iguales porque uno es un enlace simbólico al otro.

source: Forking a process, following which both parent and child have a reference to the same file. This might be through use of the :mod:`multiprocessing` module, for example.
es: Bifurcar un proceso, después del cual tanto el padre como el hijo tienen una referencia al mismo archivo. Esto podría ser mediante el uso del módulo :mod:`multiprocessing`, por ejemplo.

source: Opening a file multiple times might *appear* to work most of the time, but can lead to a number of problems in practice:
es: Abrir un archivo varias veces puede *parecer* que funciona la mayor parte del tiempo, pero puede dar lugar a una serie de problemas en la práctica:

source: Logging output can be garbled because multiple threads or processes try to write to the same file. Although logging guards against concurrent use of the same handler instance by multiple threads, there is no such protection if concurrent writes are attempted by two different threads using two different handler instances which happen to point to the same file.
es: La salida del registro se puede distorsionar porque varios subprocesos o procesos intentan escribir en el mismo archivo. Aunque el registro se protege de el uso simultáneo de la misma instancia de controlador por varios subprocesos, no existe tal protección si dos subprocesos diferentes intentan escrituras simultáneas utilizando dos instancias de controlador diferentes que apunten al mismo archivo.

source: An attempt to delete a file (e.g. during file rotation) silently fails, because there is another reference pointing to it. This can lead to confusion and wasted debugging time - log entries end up in unexpected places, or are lost altogether. Or a file that was supposed to be moved remains in place, and grows in size unexpectedly despite size-based rotation being supposedly in place.
es: Un intento de eliminar un archivo (por ejemplo, durante la rotación de archivos) falla silenciosamente, porque hay otra referencia que apunta a él. Esto puede generar confusión y una pérdida de tiempo de depuración: las entradas del registro terminan en lugares inesperados o se pierden por completo. O un archivo que debía ser movido permanece en su lugar, y crece en tamaño inesperadamente a pesar de que la rotación basada en el tamaño está supuestamente en su lugar.

source: Use the techniques outlined in :ref:`multiple-processes` to circumvent such issues.
es: Utilice las técnicas descritas en :ref:`multiple-processes` para evitar estos problemas.

source: Using loggers as attributes in a class or passing them as parameters
es: Usar registradores como atributos en una clase o pasarlos como parámetros

source: While there might be unusual cases where you'll need to do this, in general there is no point because loggers are singletons. Code can always access a given logger instance by name using ``logging.getLogger(name)``, so passing instances around and holding them as instance attributes is pointless. Note that in other languages such as Java and C#, loggers are often static class attributes. However, this pattern doesn't make sense in Python, where the module (and not the class) is the unit of software decomposition.
es: Si bien puede haber casos inusuales en los que deba hacer esto, en general no tiene sentido porque los registradores son singletons. El código siempre puede acceder a una instancia de registrador dada por su nombre usando ``logging.getLogger(name)``, por lo que pasar instancias y mantenerlas como atributos de instancia no tiene sentido. Tenga en cuenta que en otros lenguajes como Java y C#, los registradores suelen ser atributos de clase estáticos. Sin embargo, este patrón no tiene sentido en Python, donde el módulo (y no la clase) es la unidad de descomposición del software.

source: Configuring logging by adding handlers, formatters and filters is the responsibility of the application developer, not the library developer. If you are maintaining a library, ensure that you don't add handlers to any of your loggers other than a :class:`~logging.NullHandler` instance.
es: La configuración del registro agregando controladores, formateadores y filtros es responsabilidad del desarrollador de la aplicación, no del desarrollador de la biblioteca. Si mantiene una biblioteca, asegúrese de no agregar controladores a ninguno de sus registradores que no sean una instancia :class:`~logging.NullHandler`.

source: Creating a lot of loggers
es: Crear muchos registradores (*loggers*)
