Repository: python/python-docs-es
Catalog: howto/logging.po
Languages: es_us

source: Logging HOWTO
es_us: CÓMO Hacer Registros o Logging

source: Author
es_us: Autor

source: Basic Logging Tutorial
es_us: Tutorial Básico de Logging

source: Logging is a means of tracking events that happen when some software runs. The software's developer adds logging calls to their code to indicate that certain events have occurred. An event is described by a descriptive message which can optionally contain variable data (i.e. data that is potentially different for each occurrence of the event). Events also have an importance which the developer ascribes to the event; the importance can also be called the *level* or *severity*.
es_us: Logging es un medio de rastrear los eventos que ocurren cuando se ejecuta algún software. El desarrollador del software agrega llamadas de registro a su código para indicar que ciertos eventos han ocurrido. Un evento se describe mediante un mensaje descriptivo que puede contener opcionalmente datos variables (es decir, datos que son potencialmente diferentes para cada ocurrencia del evento). Los eventos también tienen una importancia que el desarrollador atribuye al evento; la importancia también puede llamarse el *nivel* o la *severidad*.

source: When to use logging
es_us: Cuándo usar logging

source: Logging provides a set of convenience functions for simple logging usage. These are :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`. To determine when to use logging, see the table below, which states, for each of a set of common tasks, the best tool to use for it.
es_us: Logging proporciona un conjunto de funciones convenientes para un uso sencillo de registro. Estas son :func:`debug`, :func:`info`, :func:`warning`, :func:`error` y :func:`critical`. Para determinar cuándo usar el registro, vea la tabla de abajo, que indica, para cada una de las tareas comunes, la mejor herramienta a usar para ello.

source: Task you want to perform
es_us: La tarea que quieres realizar

source: The best tool for the task
es_us: La mejor herramienta para la tarea

source: Display console output for ordinary usage of a command line script or program
es_us: Mostrar salidas de la consola para el uso ordinario de un programa o guión (script) de línea de comandos

source: Report events that occur during normal operation of a program (e.g. for status monitoring or fault investigation)
es_us: Reportar eventos que ocurren durante el funcionamiento normal de un programa (por ejemplo, para la supervisión del estado o la investigación de fallos)

source: :func:`logging.info` (or :func:`logging.debug` for very detailed output for diagnostic purposes)
es_us: :func:`logging.info` (o :func:`logging.debug` para salidas de registro muy detalladas con fines de diagnóstico)

source: Issue a warning regarding a particular runtime event
es_us: Emitir una advertencia con respecto a un evento de tiempo de ejecución en particular

source: :func:`warnings.warn` in library code if the issue is avoidable and the client application should be modified to eliminate the warning
es_us: :func:`warnings.warn` en el código de la librería si el problema es evitable y la aplicación cliente debe ser modificada para eliminar la advertencia

source: :func:`logging.warning` if there is nothing the client application can do about the situation, but the event should still be noted
es_us: :func:`logging.warning` si no hay nada que la aplicación cliente pueda hacer sobre la situación, pero el evento debe ser anotado

source: Report an error regarding a particular runtime event
es_us: Reportar un error con respecto a un evento particular al tiempo de ejecución

source: Raise an exception
es_us: Invocar una excepción

source: Report suppression of an error without raising an exception (e.g. error handler in a long-running server process)
es_us: Reporta la supresión de un error sin invocar una excepción (por ejemplo, el manejador de errores en un proceso de servidor de larga duración)

source: :func:`logging.error`, :func:`logging.exception` or :func:`logging.critical` as appropriate for the specific error and application domain
es_us: :func:`logging.error`, :func:`logging.exception` o :func:`logging.critical` según sea apropiado para el error específico y el dominio de la aplicación

source: The logging functions are named after the level or severity of the events they are used to track. The standard levels and their applicability are described below (in increasing order of severity):
es_us: Las funciones de registro se denominan según el nivel o la gravedad de los eventos que se utilizan para rastrear. A continuación se describen los niveles estándar y su aplicabilidad (en orden creciente de gravedad):

source: Level
es_us: Nivel

source: When it's used
es_us: Cuando se usa

source: Detailed information, typically of interest only when diagnosing problems.
es_us: Información detallada, típicamente de interés sólo durante el diagnóstico de problemas.

source: Confirmation that things are working as expected.
es_us: Confirmación de que las cosas están funcionando como se esperaba.

source: An indication that something unexpected happened, or indicative of some problem in the near future (e.g. 'disk space low'). The software is still working as expected.
es_us: Un indicio de que algo inesperado sucedió, o indicativo de algún problema en el futuro cercano (por ejemplo, "espacio de disco bajo"). El software sigue funcionando como se esperaba.

source: Due to a more serious problem, the software has not been able to perform some function.
es_us: Debido a un problema más grave, el software no ha sido capaz de realizar alguna función.

source: A serious error, indicating that the program itself may be unable to continue running.
es_us: Un grave error, que indica que el programa en sí mismo puede ser incapaz de seguir funcionando.

source: The default level is ``WARNING``, which means that only events of this level and above will be tracked, unless the logging package is configured to do otherwise.
es_us: El nivel por defecto es ``WARNING``, lo que significa que sólo los eventos de este nivel y superiores serán rastreados, a menos que el paquete de registro esté configurado para hacer lo contrario.

source: Events that are tracked can be handled in different ways. The simplest way of handling tracked events is to print them to the console. Another common way is to write them to a disk file.
es_us: Los eventos que se rastrean pueden ser manejados en diferentes maneras. La forma más simple de manejar los eventos rastreados es imprimirlos en la consola o terminal. Otra forma común es escribirlos en un archivo de disco.

source: A simple example
es_us: Un simple ejemplo

source: A very simple example is::
es_us: Un ejemplo muy simple es::

source: If you type these lines into a script and run it, you'll see:
es_us: Si escribes estas líneas en un script y lo ejecutas, verás:

source: printed out on the console. The ``INFO`` message doesn't appear because the default level is ``WARNING``. The printed message includes the indication of the level and the description of the event provided in the logging call, i.e. 'Watch out!'. Don't worry about the 'root' part for now: it will be explained later. The actual output can be formatted quite flexibly if you need that; formatting options will also be explained later.
es_us: impreso en la consola. El mensaje ``INFO`` no aparece porque el nivel por defecto es ``WARNING``. El mensaje impreso incluye la indicación del nivel y la descripción del evento proporcionado en la llamada de registro, es decir, "¡Cuidado!". No te preocupes por la parte de la ‘root’ por ahora: se explicará más adelante. La salida real puede ser formateada con bastante flexibilidad si lo necesita; las opciones de formato también se explicarán más adelante.

source: Logging to a file
es_us: Logging a un archivo

source: A very common situation is that of recording logging events in a file, so let's look at that next. Be sure to try the following in a newly-started Python interpreter, and don't just continue from the session described above::
es_us: Una situación muy común es la de registrar archivos de log, así que veamos eso a continuación. Asegúrese de intentar lo siguiente en un intérprete de Python recién iniciado, y no sólo continúe de la sesión descrita anteriormente::

source: And now if we open the file and look at what we have, we should find the log messages:
es_us: Y ahora si abrimos el archivo y miramos lo que tenemos, deberíamos encontrar los mensajes de registro:

source: This example also shows how you can set the logging level which acts as the threshold for tracking. In this case, because we set the threshold to ``DEBUG``, all of the messages were printed.
es_us: Este ejemplo también muestra cómo se puede establecer el nivel de registro que actúa como umbral para el rastreo. En este caso, como establecimos el umbral en ``DEBUG``, todos los mensajes fueron impresos.

source: If you want to set the logging level from a command-line option such as:
es_us: Si quieres establecer el nivel de registro desde una opción de línea de comandos como:

source: and you have the value of the parameter passed for ``--log`` in some variable *loglevel*, you can use::
es_us: y tienes el valor del parámetro pasado por ``--log`` en alguna variable *loglevel*, puedes usar::

source: to get the value which you'll pass to :func:`basicConfig` via the *level* argument. You may want to error check any user input value, perhaps as in the following example::
es_us: para obtener el valor que pasarás a :func:`basicConfig` mediante el argumento *level*. Puede que quieras comprobar un error por cualquier valor de entrada del usuario, quizás como en el siguiente ejemplo::

source: The call to :func:`basicConfig` should come *before* any calls to :func:`debug`, :func:`info` etc. As it's intended as a one-off simple configuration facility, only the first call will actually do anything: subsequent calls are effectively no-ops.
es_us: La llamada a :func:`basicConfig` debería venir *antes* de cualquier llamada a :func:`debug`, :func:`info` etc. Como se pretende hacer una simple facilidad de configuración única, sólo la primera llamada hará realmente algo: las llamadas subsiguientes son efectivamente no-ops.

source: If you run the above script several times, the messages from successive runs are appended to the file *example.log*. If you want each run to start afresh, not remembering the messages from earlier runs, you can specify the *filemode* argument, by changing the call in the above example to::
es_us: Si ejecutas el script anterior varias veces, los mensajes de las ejecuciones sucesivas se añaden al archivo *example.log*. Si quieres que cada ejecución se inicie de nuevo, sin recordar los mensajes de ejecuciones anteriores, puedes especificar el argumento *filemode*, cambiando la llamada en el ejemplo anterior a::

source: The output will be the same as before, but the log file is no longer appended to, so the messages from earlier runs are lost.
es_us: La impresión será la misma que antes, pero el archivo de registro ya no se adjunta, por lo que los mensajes de las ejecuciones anteriores se pierden.

source: Logging from multiple modules
es_us: Logging de múltiples módulos

source: If your program consists of multiple modules, here's an example of how you could organize logging in it::
es_us: Si su programa consiste de múltiples módulos, aquí hay un ejemplo de cómo podría organizar el inicio de sesión en él::

source: If you run *myapp.py*, you should see this in *myapp.log*:
es_us: Si ejecutas *myapp.py*, deberías ver esto en *myapp.log*:

source: which is hopefully what you were expecting to see. You can generalize this to multiple modules, using the pattern in *mylib.py*. Note that for this simple usage pattern, you won't know, by looking in the log file, *where* in your application your messages came from, apart from looking at the event description. If you want to track the location of your messages, you'll need to refer to the documentation beyond the tutorial level -- see :ref:`logging-advanced-tutorial`.
es_us: que es lo que esperabas ver. Puedes generalizar esto a múltiples módulos, usando el modelo en *mylib.py*. Ten en cuenta que para este simple patrón de uso, no sabrás, mirando en el archivo de registro, *donde* en tu aplicación vinieron tus mensajes, aparte de mirar la descripción del evento. Si quieres rastrear la ubicación de tus mensajes, tendrás que consultar la documentación más allá del nivel del tutorial -- ver :ref:`logging-advanced-tutorial`.

source: Logging variable data
es_us: Registrar datos de variables

source: To log variable data, use a format string for the event description message and append the variable data as arguments. For example::
es_us: Para registrar los datos de variables, utilice una cadena de formato para el mensaje de descripción del evento y añada los datos variables como argumentos. Por ejemplo::

source: will display:
es_us: se mostrará:

source: As you can see, merging of variable data into the event description message uses the old, %-style of string formatting. This is for backwards compatibility: the logging package pre-dates newer formatting options such as :meth:`str.format` and :class:`string.Template`. These newer formatting options *are* supported, but exploring them is outside the scope of this tutorial: see :ref:`formatting-styles` for more information.
es_us: Como puedes ver, la fusión de datos de variables en el mensaje de descripción de eventos utiliza el viejo estilo % de formato de cadena de caracteres. Esto es para compatibilidad retrospectiva : el paquete de registro precede las nuevas opciones de formato como :meth:`str.format` y :class:`string.Template`. Estas nuevas opciones de formato *son* compatibles, pero explorarlas está fuera del alcance de este tutorial: ver :ref:`formatting-styles` para más información.

source: Changing the format of displayed messages
es_us: Cambiar el formato de los mensajes mostrados

source: To change the format which is used to display messages, you need to specify the format you want to use::
es_us: Para cambiar el formato que se utiliza para visualizar los mensajes, es necesario especificar el formato que se desea utilizar::

source: which would print:
es_us: que se imprimirá:

source: Notice that the 'root' which appeared in earlier examples has disappeared. For a full set of things that can appear in format strings, you can refer to the documentation for :ref:`logrecord-attributes`, but for simple usage, you just need the *levelname* (severity), *message* (event description, including variable data) and perhaps to display when the event occurred. This is described in the next section.
es_us: Noten que la ‘root’ que aparecía en los ejemplos anteriores ha desaparecido. Para un conjunto completo de cosas que pueden aparecer en formato de cadenas, puede consultar la documentación de :ref:`logrecord-attributes`, pero para un uso sencillo, sólo necesita el *levelname* (gravedad), *message* (descripción del evento, incluyendo los datos variables) y tal vez mostrar cuándo ocurrió el evento. Esto se describe en la siguiente sección.

source: Displaying the date/time in messages
es_us: Visualización de la fecha/hora en los mensajes

source: To display the date and time of an event, you would place '%(asctime)s' in your format string::
es_us: Para mostrar la fecha y la hora de un evento, usted colocaría '%(asctime)s' en su cadena de formato::

source: which should print something like this:
es_us: que debería imprimir algo como esto:

source: The default format for date/time display (shown above) is like ISO8601 or :rfc:`3339`. If you need more control over the formatting of the date/time, provide a *datefmt* argument to ``basicConfig``, as in this example::
es_us: El formato por defecto para la visualización de la fecha/hora (mostrado arriba) es como ISO8601 o :rfc:`3339`. Si necesita más control sobre el formato de la fecha/hora, proporcione un argumento *datefmt* a ``basicConfig``, como en este ejemplo::

source: which would display something like this:
es_us: que mostraría algo como esto:

source: The format of the *datefmt* argument is the same as supported by :func:`time.strftime`.
es_us: El formato del argumento *datefmt* es el mismo que el soportado por :func:`time.strftime`.

source: Next Steps
es_us: Próximos pasos

source: That concludes the basic tutorial. It should be enough to get you up and running with logging. There's a lot more that the logging package offers, but to get the best out of it, you'll need to invest a little more of your time in reading the following sections. If you're ready for that, grab some of your favourite beverage and carry on.
es_us: Eso concluye el tutorial básico. Debería ser suficiente para ponerte en marcha con el registro. Hay mucho más que el paquete de registro ofrece, pero para obtener lo mejor de él, tendrá que invertir un poco más de su tiempo en la lectura de las siguientes secciones. Si estás listo para eso, toma un poco de tu bebida favorita y sigue adelante.

source: If your logging needs are simple, then use the above examples to incorporate logging into your own scripts, and if you run into problems or don't understand something, please post a question on the comp.lang.python Usenet group (available at https://groups.google.com/forum/#!forum/comp.lang.python) and you should receive help before too long.
es_us: Si sus necesidades de registro son sencillas, utilice los ejemplos previos para incorporar el registro en sus propios scripts, y si tiene problemas o no entiende algo, por favor publique una pregunta en el grupo Usenet de comp.lang.python (disponible en https://groups.google.com/forum/#!forum/comp.lang.python) y debería recibir ayuda antes de que transcurra demasiado tiempo.

source: Still here? You can carry on reading the next few sections, which provide a slightly more advanced/in-depth tutorial than the basic one above. After that, you can take a look at the :ref:`logging-cookbook`.
es_us: ¿Todavía esta aquí? Puedes seguir leyendo las siguientes secciones, que proporcionan un tutorial un poco más avanzado y profundo que el básico de arriba. Después de eso, puedes echar un vistazo al :ref:`logging-cookbook`.

source: Advanced Logging Tutorial
es_us: Tutorial de registro avanzado

source: The logging library takes a modular approach and offers several categories of components: loggers, handlers, filters, and formatters.
es_us: La librería de registro adopta un enfoque modular y ofrece varias categorías de componentes: registradores, manejadores, filtros y formateadores.

source: Loggers expose the interface that application code directly uses.
es_us: Los registradores exponen la interfaz que el código de la aplicación utiliza directamente.

source: Handlers send the log records (created by loggers) to the appropriate destination.
es_us: Los manipuladores envían los registros de log(creados por los registradores) al destino apropiado.

source: Filters provide a finer grained facility for determining which log records to output.
es_us: Los filtros proporcionan una instalación de grano más fino para determinar qué registros de log se deben producir.

source: Formatters specify the layout of log records in the final output.
es_us: Los formatos especifican la disposición de los archivos de log en el resultado final.

source: Log event information is passed between loggers, handlers, filters and formatters in a :class:`LogRecord` instance.
es_us: La información de los eventos de registro se pasa entre los registradores, manejadores, filtros y formateadores en una instancia :class:`LogRecord`.

source: Logging is performed by calling methods on instances of the :class:`Logger` class (hereafter called :dfn:`loggers`). Each instance has a name, and they are conceptually arranged in a namespace hierarchy using dots (periods) as separators. For example, a logger named 'scan' is the parent of loggers 'scan.text', 'scan.html' and 'scan.pdf'. Logger names can be anything you want, and indicate the area of an application in which a logged message originates.
es_us: El registro se realiza llamando a métodos en instancias de la clase :class:`Logger` (de aquí en adelante llamada :dfn:`loggers`). Cada instancia tiene un nombre, y se organizan conceptualmente en una jerarquía de espacios de nombres utilizando puntos (puntos) como separadores. Por ejemplo, un registrador llamado "scan" es el padre de los registradores "scan.text", "scan.html" y "scan.pdf". Los nombres de los registradores pueden ser cualquier cosa que se desee, e indican el área de una aplicación en la que se origina un mensaje registrado.

source: A good convention to use when naming loggers is to use a module-level logger, in each module which uses logging, named as follows::
es_us: Una buena convención que se puede utilizar para nombrar a los registradores es utilizar un registrador a nivel de módulo, en cada módulo que utilice el registro, llamado de la siguiente manera::

source: This means that logger names track the package/module hierarchy, and it's intuitively obvious where events are logged just from the logger name.
es_us: Esto significa que los nombres de los registradores rastrean la jerarquía de paquetes/módulos, y es intuitivamente obvio donde se registran los eventos sólo a partir del nombre del registrador.

source: The root of the hierarchy of loggers is called the root logger. That's the logger used by the functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`, which just call the same-named method of the root logger. The functions and the methods have the same signatures. The root logger's name is printed as 'root' in the logged output.
es_us: La raíz de la jerarquía de los registradores se llama root logger. Ese es el registrador usado por las funciones :func:`debug`, :func:`info`, :func:`warning`, :func:`error` y :func:`critícal`, que sólo llaman al mismo método del registrador raíz. Las funciones y los métodos tienen las mismas firmas. El nombre del root logger se imprime como ‘root’ en la salida registrada.

source: It is, of course, possible to log messages to different destinations. Support is included in the package for writing log messages to files, HTTP GET/POST locations, email via SMTP, generic sockets, queues, or OS-specific logging mechanisms such as syslog or the Windows NT event log. Destinations are served by :dfn:`handler` classes. You can create your own log destination class if you have special requirements not met by any of the built-in handler classes.
es_us: Por supuesto, es posible registrar mensajes a diferentes destinos. El paquete incluye soporte para escribir mensajes de registro en archivos, ubicaciones HTTP GET/POST, correo electrónico a través de SMTP, sockets genéricos, colas o mecanismos de registro específicos del sistema operativo como syslog o el registro de eventos de Windows NT. Los destinos son servidos por clases :dfn:`handler`. Puedes crear tu propia clase de destino de registro si tienes requisitos especiales que no se cumplen con ninguna de las clases de manejador incorporadas.
