Repository: python/python-docs-es
Catalog: howto/logging-cookbook.po
Languages: es

source: Logging calls (``logger.debug()``, ``logger.info()`` etc.) only take positional parameters for the actual logging message itself, with keyword parameters used only for determining options for how to handle the actual logging call (e.g. the ``exc_info`` keyword parameter to indicate that traceback information should be logged, or the ``extra`` keyword parameter to indicate additional contextual information to be added to the log). So you cannot directly make logging calls using :meth:`str.format` or :class:`string.Template` syntax, because internally the logging package uses %-formatting to merge the format string and the variable arguments. There would be no changing this while preserving backward compatibility, since all logging calls which are out there in existing code will be using %-format strings.
es: Las llamadas de Logging (``logger.debug()``, ``logger.info()``, etc.) solo toman parámetros posicionales para el mensaje de logging real en sí, los parámetros de palabras clave se usan solo para determinar opciones sobre cómo gestionar la llamada propiamente a Logging (por ejemplo, el parámetro de palabra clave ``exc_info`` para indicar que la información de rastreo debe registrarse, o el parámetro de palabra clave ``extra`` para indicar información contextual adicional que se agregará al log). Por lo tanto, no puede realizar llamadas de logging directamente usando la sintaxis :meth:`str.format` o :class:`string.Template`, porque internamente el paquete de logging usa formato % para fusionar la cadena de formato y los argumentos de las variables. No habría ningún cambio en esto mientras se conserva la compatibilidad con versiones anteriores, ya que todas las llamadas de logging que están en el código existente usarán cadenas de formato %.

source: There is, however, a way that you can use {}- and $- formatting to construct your individual log messages. Recall that for a message you can use an arbitrary object as a message format string, and that the logging package will call ``str()`` on that object to get the actual format string. Consider the following two classes::
es: Sin embargo, existe una forma en la que puede usar el formato {} - y $ - para construir sus mensajes de log individuales. Recuerde que para un mensaje puede usar un objeto arbitrario como una cadena de caracteres de formato de mensaje, y que el paquete logging llamará a ``str()`` en ese objeto para obtener la cadena de caracteres de formato real. Considere las siguientes dos clases::

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of "%(message)s" or "{message}" or "$message". It's a little unwieldy to use the class names whenever you want to log something, but it's quite palatable if you use an alias such as __ (double underscore --- not to be confused with _, the single underscore used as a synonym/alias for :func:`gettext.gettext` or its brethren).
es: Cualquiera de estos puede usarse en lugar de una cadena de formato, para permitir que se use el formato {} - o $ - para construir la parte del "mensaje" real que aparece en la salida del log en lugar de "%(message)s" o "{message}" o "$message". Es un poco difícil de manejar usar los nombres de las clases siempre que quieras registrar algo, pero es bastante aceptable si usas un alias como __ (doble subrayado --- no confundir con _, el subrayado simple usado como sinónimo/alias para :func:`gettext.gettext` o sus hermanos).

source: The above classes are not included in Python, though they're easy enough to copy and paste into your own code. They can be used as follows (assuming that they're declared in a module called ``wherever``):
es: Las clases anteriores no están incluidas en Python, aunque son bastante fáciles de copiar y pegar en su propio código. Se pueden usar de la siguiente manera (asumiendo que están declaradas en un módulo llamado ``wherever``):

source: While the above examples use ``print()`` to show how the formatting works, you would of course use ``logger.debug()`` or similar to actually log using this approach.
es: Si bien los ejemplos anteriores usan ``print()`` para mostrar cómo funciona el formateo, por supuesto usaría ``logger.debug()`` o similar para realmente registrar usando este enfoque.

source: If you prefer, you can use a :class:`LoggerAdapter` to achieve a similar effect to the above, as in the following example::
es: Si lo prefiere, puede usar :class:`LoggerAdapter` para lograr un efecto similar al anterior, como en el siguiente ejemplo::

source: The above script should log the message ``Hello, world!`` when run with Python 3.2 or later.
es: El script anterior debería registrar el mensaje ``Hello, world!`` Cuando se ejecuta con Python 3.2 o posterior.

source: Customizing ``LogRecord``
es: Personalización de ``LogRecord``

source: Every logging event is represented by a :class:`LogRecord` instance. When an event is logged and not filtered out by a logger's level, a :class:`LogRecord` is created, populated with information about the event and then passed to the handlers for that logger (and its ancestors, up to and including the logger where further propagation up the hierarchy is disabled). Before Python 3.2, there were only two places where this creation was done:
es: Cada evento logging está representado por una instancia :class:`LogRecord`. Cuando se registra un evento y no se filtra por el nivel de un registrador, se crea :class:`LogRecord`, se llena con información sobre el evento y luego se pasa a los gestores de ese registrador (y sus antepasados, hasta (e incluyéndolo) el registrador donde se deshabilita una mayor propagación en la jerarquía). Antes de Python 3.2, solo había dos lugares donde se realizaba esta creación:

source: :meth:`Logger.makeRecord`, which is called in the normal process of logging an event. This invoked :class:`LogRecord` directly to create an instance.
es: :meth:`Logger.makeRecord`, que se llama en el proceso normal de logging de un evento. Esto invoca :class:`LogRecord` directamente para crear una instancia.

source: :func:`makeLogRecord`, which is called with a dictionary containing attributes to be added to the LogRecord. This is typically invoked when a suitable dictionary has been received over the network (e.g. in pickle form via a :class:`~handlers.SocketHandler`, or in JSON form via an :class:`~handlers.HTTPHandler`).
es: :func:`makeLogRecord`, que se llama con un diccionario que contiene atributos que se agregarán al *LogRecord*. Esto se suele invocar cuando se ha recibido un diccionario adecuado a través de la red (por ejemplo, en forma de *pickle* a través de :class:`~handlers.SocketHandler`, o en formato JSON a través de :class:`~handlers.HTTPHandler`).

source: This has usually meant that if you need to do anything special with a :class:`LogRecord`, you've had to do one of the following.
es: Por lo general, esto significa que si necesita hacer algo especial con :class:`LogRecord`, debe hacer una de las siguientes cosas.

source: Create your own :class:`Logger` subclass, which overrides :meth:`Logger.makeRecord`, and set it using :func:`~logging.setLoggerClass` before any loggers that you care about are instantiated.
es: Cree su propia subclase :class:`Logger`, que anula :meth:`Logger.makeRecord`, y configúrelo usando :func:`~logging.setLoggerClass` antes de que se creen instancias de los registradores que le interesan.

source: Add a :class:`Filter` to a logger or handler, which does the necessary special manipulation you need when its :meth:`~Filter.filter` method is called.
es: Agrega un :class:`Filter` a un registrador o gestor, que realiza la manipulación especial necesaria que necesita cuando se llama a su método :meth:`~Filter.filter`.

source: The first approach would be a little unwieldy in the scenario where (say) several different libraries wanted to do different things. Each would attempt to set its own :class:`Logger` subclass, and the one which did this last would win.
es: El primer enfoque sería un poco difícil de manejar en el escenario en el que (digamos) varias bibliotecas diferentes quisieran hacer cosas diferentes. Cada uno intentaría establecer su propia subclase :class:`Logger`, y el que hiciera esto último ganaría.

source: The second approach works reasonably well for many cases, but does not allow you to e.g. use a specialized subclass of :class:`LogRecord`. Library developers can set a suitable filter on their loggers, but they would have to remember to do this every time they introduced a new logger (which they would do simply by adding new packages or modules and doing ::
es: El segundo enfoque funciona razonablemente bien en muchos casos, pero no le permite, por ejemplo, usar una subclase especializada de :class:`LogRecord`. Los desarrolladores de bibliotecas pueden establecer un filtro adecuado en sus registradores, pero tendrían que recordar hacerlo cada vez que introduzcan un nuevo registrador (lo que harían simplemente agregando nuevos paquetes o módulos y haciendo ::

source: at module level). It's probably one too many things to think about. Developers could also add the filter to a :class:`~logging.NullHandler` attached to their top-level logger, but this would not be invoked if an application developer attached a handler to a lower-level library logger --- so output from that handler would not reflect the intentions of the library developer.
es: a nivel de módulo). Probablemente sean demasiadas cosas en las que pensar. Los desarrolladores también podrían agregar el filtro a :class:`~logging.NullHandler` adjunto a su registrador de nivel superior, pero esto no se invocaría si un desarrollador de aplicaciones adjuntara un controlador a un registrador de biblioteca de nivel inferior --- así que la salida de ese gestor no reflejaría las intenciones del desarrollador de la biblioteca.

source: In Python 3.2 and later, :class:`~logging.LogRecord` creation is done through a factory, which you can specify. The factory is just a callable you can set with :func:`~logging.setLogRecordFactory`, and interrogate with :func:`~logging.getLogRecordFactory`. The factory is invoked with the same signature as the :class:`~logging.LogRecord` constructor, as :class:`LogRecord` is the default setting for the factory.
es: En Python 3.2 y posteriores, la creación de :class:`~logging.LogRecord` se realiza a través de una fábrica, que puede especificar. La fábrica es simplemente un invocable que puede configurar con :func:`~logging.setLogRecordFactory`, e interrogar con :func:`~logging.getLogRecordFactory`. La fábrica se invoca con la misma firma que el constructor :class:`~logging.LogRecord`, ya que :class:`LogRecord` es la configuración predeterminada de la fábrica.

source: This approach allows a custom factory to control all aspects of LogRecord creation. For example, you could return a subclass, or just add some additional attributes to the record once created, using a pattern similar to this::
es: Este enfoque permite que una fábrica personalizada controle todos los aspectos de la creación de *LogRecord*. Por ejemplo, podría devolver una subclase, o simplemente agregar algunos atributos adicionales al registro una vez creado, usando un patrón similar a este::

source: This pattern allows different libraries to chain factories together, and as long as they don't overwrite each other's attributes or unintentionally overwrite the attributes provided as standard, there should be no surprises. However, it should be borne in mind that each link in the chain adds run-time overhead to all logging operations, and the technique should only be used when the use of a :class:`Filter` does not provide the desired result.
es: Este patrón permite que diferentes bibliotecas encadenen fábricas juntas, y siempre que no sobrescriban los atributos de las demás o sobrescriban involuntariamente los atributos proporcionados como estándar, no debería haber sorpresas. Sin embargo, debe tenerse en cuenta que cada eslabón de la cadena agrega una sobrecarga de tiempo de ejecución a todas las operaciones de logging, y la técnica solo debe usarse cuando el uso de :class:`Filter` no proporciona el resultado deseado.

source: Subclassing QueueHandler - a ZeroMQ example
es: Subclasificación QueueHandler - un ejemplo de ZeroMQ

source: You can use a :class:`QueueHandler` subclass to send messages to other kinds of queues, for example a ZeroMQ 'publish' socket. In the example below,the socket is created separately and passed to the handler (as its 'queue')::
es: Puede usar una subclase :class:`QueueHandler` para enviar mensajes a otros tipos de colas, por ejemplo, un socket de 'publicación' ZeroMQ. En el siguiente ejemplo, el socket se crea por separado y se pasa al gestor (como su 'cola')::

source: Of course there are other ways of organizing this, for example passing in the data needed by the handler to create the socket::
es: Por supuesto, hay otras formas de organizar esto, por ejemplo, pasando los datos que necesita el gestor para crear el socket::

source: Subclassing QueueListener - a ZeroMQ example
es: Subclasificación QueueListener - un ejemplo de ZeroMQ

source: You can also subclass :class:`QueueListener` to get messages from other kinds of queues, for example a ZeroMQ 'subscribe' socket. Here's an example::
es: También puede subclasificar :class:`QueueListener` para obtener mensajes de otros tipos de colas, por ejemplo, un socket de 'suscripción' de ZeroMQ. Aquí tienes un ejemplo::

source: Module :mod:`logging`
es: Módulo :mod:`logging`

source: API reference for the logging module.
es: Referencia de API para el módulo logging.

source: Module :mod:`logging.config`
es: Módulo :mod:`logging.config`

source: Configuration API for the logging module.
es: API de configuración para el módulo logging.

source: Module :mod:`logging.handlers`
es: Módulo :mod:`logging.handlers`

source: Useful handlers included with the logging module.
es: Gestores útiles incluidos con el módulo logging.

source: :ref:`A basic logging tutorial <logging-basic-tutorial>`
es: :ref:`Un tutorial básico de logging <logging-basic-tutorial>`

source: :ref:`A more advanced logging tutorial <logging-advanced-tutorial>`
es: :ref:`Un tutorial de logging más avanzado <logging-advanced-tutorial>`

source: An example dictionary-based configuration
es: Una configuración de ejemplo basada en diccionario

source: Below is an example of a logging configuration dictionary - it's taken from the `documentation on the Django project <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_. This dictionary is passed to :func:`~config.dictConfig` to put the configuration into effect::
es: A continuación se muestra un ejemplo de un diccionario de configuración de logging, tomado de la `documentación del proyecto Django <https://docs.djangoproject.com/en/1.9/topics/logging/#configuring-logging>`_. Este diccionario se pasa a :func:`~config.dictConfig` para poner en efecto la configuración::

source: For more information about this configuration, you can see the `relevant section <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_ of the Django documentation.
es: Para obtener más información sobre esta configuración, puede ver la `sección correspondiente <https://docs.djangoproject.com/en/1.9/topics/logging/#configuring-logging>`_ de la documentación de Django.

source: Using a rotator and namer to customize log rotation processing
es: Usar un rotador y un nombre para personalizar el procesamiento de rotación de log

source: A more elaborate multiprocessing example
es: Un ejemplo de multiprocesamiento más elaborado

source: The following working example shows how logging can be used with multiprocessing using configuration files. The configurations are fairly simple, but serve to illustrate how more complex ones could be implemented in a real multiprocessing scenario.
es: El siguiente ejemplo de trabajo muestra cómo logging se puede usar con multiprocesamiento usando archivos de configuración. Las configuraciones son bastante simples, pero sirven para ilustrar cómo se podrían implementar las más complejas en un escenario real de multiprocesamiento.

source: In the example, the main process spawns a listener process and some worker processes. Each of the main process, the listener and the workers have three separate configurations (the workers all share the same configuration). We can see logging in the main process, how the workers log to a QueueHandler and how the listener implements a QueueListener and a more complex logging configuration, and arranges to dispatch events received via the queue to the handlers specified in the configuration. Note that these configurations are purely illustrative, but you should be able to adapt this example to your own scenario.
es: En el ejemplo, el proceso principal genera un proceso de escucha y algunos procesos de trabajo. Cada uno de los procesos principales, el oyente y los trabajadores tienen tres configuraciones separadas (todos los trabajadores comparten la misma configuración). Podemos ver el registro en el proceso principal, cómo los trabajadores se registran en un QueueHandler y cómo el oyente implementa un QueueListener y una configuración de registro más compleja, y organiza el envío de eventos recibidos a través de la cola a los controladores especificados en la configuración. Tenga en cuenta que estas configuraciones son puramente ilustrativas, pero debería poder adaptar este ejemplo a su propio escenario.

source: Here's the script - the docstrings and the comments hopefully explain how it works::
es: Aquí está el script, el docstrings y los comentarios, esperemos, expliquen cómo funciona::

source: Inserting a BOM into messages sent to a SysLogHandler
es: Insertar BOM en mensajes enviados a SysLogHandler

source: :rfc:`5424` requires that a Unicode message be sent to a syslog daemon as a set of bytes which have the following structure: an optional pure-ASCII component, followed by a UTF-8 Byte Order Mark (BOM), followed by Unicode encoded using UTF-8. (See the :rfc:`relevant section of the specification <5424#section-6>`.)
es: :rfc:`5424` requiere que se envíe un mensaje Unicode a un demonio syslog como un conjunto de bytes que tienen la siguiente estructura: un componente opcional ASCII puro, seguido de una marca de orden de bytes UTF-8 (BOM), seguida de Codificado en Unicode usando UTF-8. (Ver sección relevante de la especificación :rfc:`5424#section-6`.)

source: In Python 3.1, code was added to :class:`~logging.handlers.SysLogHandler` to insert a BOM into the message, but unfortunately, it was implemented incorrectly, with the BOM appearing at the beginning of the message and hence not allowing any pure-ASCII component to appear before it.
es: En Python 3.1, se agregó código a :class:`~logging.handlers.SysLogHandler` para insertar BOM en el mensaje, pero desafortunadamente, se implementó incorrectamente, BOM aparece al principio del mensaje y, por lo tanto, no permite ningún componente ASCII puro para que aparezca antes.

source: As this behaviour is broken, the incorrect BOM insertion code is being removed from Python 3.2.4 and later. However, it is not being replaced, and if you want to produce :rfc:`5424`-compliant messages which include a BOM, an optional pure-ASCII sequence before it and arbitrary Unicode after it, encoded using UTF-8, then you need to do the following:
es: Como este comportamiento no funciona, el código de inserción BOM incorrecto se elimina de Python 3.2.4 y versiones posteriores. Sin embargo, no se está reemplazando, y si desea producir mensajes compatibles con :rfc:`5424` que incluyan BOM, una secuencia opcional de ASCII puro antes y Unicode arbitrario después, codificados usando UTF-8; entonces necesita hacer lo siguiente:

source: Attach a :class:`~logging.Formatter` instance to your :class:`~logging.handlers.SysLogHandler` instance, with a format string such as::
es: Adjunte una instancia de :class:`~logging.Formatter` a su instancia :class:`~logging.handlers.SysLogHandler`, con una cadena de caracteres de formato como::

source: The Unicode code point U+FEFF, when encoded using UTF-8, will be encoded as a UTF-8 BOM -- the byte-string ``b'\xef\xbb\xbf'``.
es: El punto de código Unicode U+ FEFF, cuando se codifica usando UTF-8, se codificará como una BOM UTF-8, la cadena de bytes ``b'\xef\xbb\xbf'``.

source: Replace the ASCII section with whatever placeholders you like, but make sure that the data that appears in there after substitution is always ASCII (that way, it will remain unchanged after UTF-8 encoding).
es: Reemplace la sección ASCII con los marcadores de posición que desee, pero asegúrese de que los datos que aparecen allí después de la sustitución sean siempre ASCII (de esa manera, permanecerán sin cambios después de la codificación UTF-8).

source: Replace the Unicode section with whatever placeholders you like; if the data which appears there after substitution contains characters outside the ASCII range, that's fine -- it will be encoded using UTF-8.
es: Reemplace la sección Unicode con los marcadores de posición que desee; si los datos que aparecen allí después de la sustitución contienen caracteres fuera del rango ASCII, está bien: se codificarán usando UTF-8.

source: The formatted message *will* be encoded using UTF-8 encoding by ``SysLogHandler``. If you follow the above rules, you should be able to produce :rfc:`5424`-compliant messages. If you don't, logging may not complain, but your messages will not be RFC 5424-compliant, and your syslog daemon may complain.
es: El mensaje formateado *se* codificará utilizando la codificación UTF-8 por ``SysLogHandler``. Si sigue las reglas anteriores, debería poder producir mensajes compatibles con :rfc:`5424`. Si no lo hace, es posible que el logging no se queje, pero sus mensajes no serán compatibles con RFC 5424 y su demonio syslog puede quejarse.

source: Implementing structured logging
es: Implementar logging estructurado

source: Although most logging messages are intended for reading by humans, and thus not readily machine-parseable, there might be circumstances where you want to output messages in a structured format which *is* capable of being parsed by a program (without needing complex regular expressions to parse the log message). This is straightforward to achieve using the logging package. There are a number of ways in which this could be achieved, but the following is a simple approach which uses JSON to serialise the event in a machine-parseable manner::
es: Aunque la mayoría de los mensajes de registro están destinados a ser leídos por humanos y, por lo tanto, no se pueden analizar fácilmente mediante una máquina, puede haber circunstancias en las que desee generar mensajes en un formato estructurado que *sea* capaz de ser analizado por un programa (sin necesidad de expresiones regulares complejas para analizar el mensaje de registro). Esto es sencillo de lograr utilizando el paquete de registro. Hay varias formas de lograr esto, pero el siguiente es un enfoque simple que usa JSON para serializar el evento de una manera analizable por máquina:

source: If the above script is run, it prints:
es: Si se ejecuta el script anterior, se imprime:

source: Note that the order of items might be different according to the version of Python used.
es: Tenga en cuenta que el orden de los elementos puede ser diferente según la versión de Python utilizada.

source: If you need more specialised processing, you can use a custom JSON encoder, as in the following complete example::
es: Si necesita un procesamiento más especializado, puede utilizar un codificador JSON personalizado, como en el siguiente ejemplo completo::
