Repository: python/python-docs-es
Catalog: howto/logging-cookbook.po
Languages: es

source: When the above script is run, it prints:
es: Cuando se ejecuta el script anterior, se imprime:

source: Customizing handlers with :func:`dictConfig`
es: Personalización de gestores con :func:`dictConfig`

source: There are times when you want to customize logging handlers in particular ways, and if you use :func:`dictConfig` you may be able to do this without subclassing. As an example, consider that you may want to set the ownership of a log file. On POSIX, this is easily done using :func:`shutil.chown`, but the file handlers in the stdlib don't offer built-in support. You can customize handler creation using a plain function such as::
es: Hay ocasiones en las que desea personalizar los gestores de logging de formas particulares, y si usa :func:`dictConfig` puede hacerlo sin subclases. Como ejemplo, considere que es posible que desee establecer la propiedad de un archivo de log. En POSIX, esto se hace fácilmente usando :func:`shutil.chown`, pero los gestores de archivos en stdlib no ofrecen soporte integrado. Puede personalizar la creación de gestores usando una función simple como::

source: You can then specify, in a logging configuration passed to :func:`dictConfig`, that a logging handler be created by calling this function::
es: Luego puede especificar, en una configuración de logging pasada a :func:`dictConfig`, que se cree un gestor de logging llamando a esta función::

source: In this example I am setting the ownership using the ``pulse`` user and group, just for the purposes of illustration. Putting it together into a working script, ``chowntest.py``::
es: En este ejemplo, se establece la propiedad utilizando el usuario y el grupo ``pulse``, solo con fines ilustrativos. Poniéndolo junto en un script de trabajo, ``chowntest.py``::

source: To run this, you will probably need to run as ``root``:
es: Para ejecutar esto, probablemente se necesite ejecutarlo como ``root``:

source: Note that this example uses Python 3.3 because that's where :func:`shutil.chown` makes an appearance. This approach should work with any Python version that supports :func:`dictConfig` - namely, Python 2.7, 3.2 or later. With pre-3.3 versions, you would need to implement the actual ownership change using e.g. :func:`os.chown`.
es: Tenga en cuenta que este ejemplo usa Python 3.3 porque ahí es donde :func:`shutil.chown` aparece. Este enfoque debería funcionar con cualquier versión de Python que admita :func:`dictConfig`, es decir, Python 2.7, 3.2 o posterior. Con las versiones anteriores a 3.3, necesitaría implementar el cambio de propiedad real usando, por ejemplo, :func:`os.chown`.

source: In practice, the handler-creating function may be in a utility module somewhere in your project. Instead of the line in the configuration::
es: En la práctica, la función de creación de gestores puede estar en un módulo de utilidad en algún lugar de su proyecto. En lugar de la línea en la configuración::

source: you could use e.g.::
es: podrías usar, por ejemplo,::

source: where ``project.util`` can be replaced with the actual name of the package where the function resides. In the above working script, using ``'ext://__main__.owned_file_handler'`` should work. Here, the actual callable is resolved by :func:`dictConfig` from the ``ext://`` specification.
es: donde ``project.util`` se puede reemplazar con el nombre real del paquete donde reside la función. En el script de trabajo anterior, el uso de ``'ext://__main__.owned_file_handler'`` debería funcionar. Aquí, el invocable real se resuelve mediante :func:`dictConfig` de la especificación ``ext://``.

source: This example hopefully also points the way to how you could implement other types of file change - e.g. setting specific POSIX permission bits - in the same way, using :func:`os.chmod`.
es: Por fortuna, este ejemplo también indica el camino hacia cómo podría implementar otros tipos de cambio de archivo, por ejemplo, configurando de la misma manera bits de permisos POSIX específicos, usando :func:`os.chmod`.

source: Of course, the approach could also be extended to types of handler other than a :class:`~logging.FileHandler` - for example, one of the rotating file handlers, or a different type of handler altogether.
es: Por supuesto, el enfoque también podría extenderse a tipos de gestores distintos a :class:`~logging.FileHandler` - por ejemplo, uno de los gestores de archivos rotativos, o un tipo diferente por completo.

source: Using particular formatting styles throughout your application
es: Usar estilos de formato particulares en toda su aplicación

source: In Python 3.2, the :class:`~logging.Formatter` gained a ``style`` keyword parameter which, while defaulting to ``%`` for backward compatibility, allowed the specification of ``{`` or ``$`` to support the formatting approaches supported by :meth:`str.format` and :class:`string.Template`. Note that this governs the formatting of logging messages for final output to logs, and is completely orthogonal to how an individual logging message is constructed.
es: En Python 3.2, :class:`~logging.Formatter` obtuvo un parámetro de palabra clave ``estilo`` que, aunque por defecto era ``%`` para compatibilidad con versiones anteriores, permitía la especificación de ``{`` o ``$`` para permitir los enfoques de formato admitidos por :meth:`str.format` y :class:`string.Template`. Tenga en cuenta que esto rige el formato de los mensajes de logging para la salida final a los logging y es completamente ortogonal a cómo se construye un mensaje de logging individual.

source: There have been suggestions to associate format styles with specific loggers, but that approach also runs into backward compatibility problems because any existing code could be using a given logger name and using %-formatting.
es: Ha habido sugerencias para asociar estilos de formato con *loggers* específicos, pero ese enfoque también tiene problemas de compatibilidad con versiones anteriores porque cualquier código existente podría estar usando un nombre de *logger* dado y usando formato %.

source: For logging to work interoperably between any third-party libraries and your code, decisions about formatting need to be made at the level of the individual logging call. This opens up a couple of ways in which alternative formatting styles can be accommodated.
es: Para que logging funcione de manera interoperable entre cualquier biblioteca de terceros y su código, las decisiones sobre el formato deben tomarse a nivel de la llamada de logging individual. Esto abre un par de formas en las que se pueden acomodar estilos de formato alternativos.

source: Using LogRecord factories
es: Uso de fábricas de LogRecord

source: In Python 3.2, along with the :class:`~logging.Formatter` changes mentioned above, the logging package gained the ability to allow users to set their own :class:`LogRecord` subclasses, using the :func:`setLogRecordFactory` function. You can use this to set your own subclass of :class:`LogRecord`, which does the Right Thing by overriding the :meth:`~LogRecord.getMessage` method. The base class implementation of this method is where the ``msg % args`` formatting happens, and where you can substitute your alternate formatting; however, you should be careful to support all formatting styles and allow %-formatting as the default, to ensure interoperability with other code. Care should also be taken to call ``str(self.msg)``, just as the base implementation does.
es: En Python 3.2, junto con los cambios de :class:`~logging.Formatter` mencionados anteriormente, el paquete logging ganó la capacidad de permitir a los usuarios establecer sus propias subclases :class:`LogRecord`, usando la función :func:`setLogRecordFactory`. Puede usar esto para configurar su propia subclase de :class:`LogRecord`, que hace lo correcto al anular el método :meth:`~LogRecord.getMessage`. La implementación de la clase base de este método es donde ocurre el formato ``msg % args`` y donde puede sustituir su formato alternativo; sin embargo, debe tener cuidado de admitir todos los estilos de formato y permitir formato % como predeterminado, para garantizar la interoperabilidad con otro código. También se debe tener cuidado de llamar a ``str(self.msg)``, tal como lo hace la implementación base.

source: Refer to the reference documentation on :func:`setLogRecordFactory` and :class:`LogRecord` for more information.
es: Consulte la documentación de referencia en :func:`setLogRecordFactory` y :class:`LogRecord` para obtener más información.

source: Using custom message objects
es: Usar objetos de mensaje personalizados

source: There is another, perhaps simpler way that you can use {}- and $- formatting to construct your individual log messages. You may recall (from :ref:`arbitrary-object-messages`) that when logging you can use an arbitrary object as a message format string, and that the logging package will call :func:`str` on that object to get the actual format string. Consider the following two classes::
es: Existe otra forma, quizás más sencilla, de usar el formato {} - y $ - para construir sus mensajes de log individuales. Al iniciar sesión, recuerde que puede usar cualquier objeto como una cadena de caracteres de formato de mensaje (:ref:`arbitrary-object-messages`) que al iniciar sesión puede usar un objeto arbitrario como una cadena de formato de mensaje, y que el paquete de logging llamará :func:`str` en ese objeto para obtener el cadena de formato real. Considere las siguientes dos clases:

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of “%(message)s” or “{message}” or “$message”. If you find it a little unwieldy to use the class names whenever you want to log something, you can make it more palatable if you use an alias such as ``M`` or ``_`` for the message (or perhaps ``__``, if you are using ``_`` for localization).
es: Cualquiera de estos puede usarse en lugar de una cadena de formato, para permitir que se use el formato {} - o $ - para construir la parte del "mensaje" real que aparece en la salida del log formateado en lugar de “%(message)s” or “{message}” or “$message”. Si le resulta un poco difícil de manejar usar los nombres de las clases cada vez que desea registrar algo, puede hacerlo más tolerable si usa un alias como ``M`` o ``_`` para el mensaje (o quizás ``__``, si está utilizando ``_`` para localización).

source: Examples of this approach are given below. Firstly, formatting with :meth:`str.format`::
es: A continuación se dan ejemplos de este enfoque. En primer lugar, formatear con :meth:`str.format`::

source: Secondly, formatting with :class:`string.Template`::
es: En segundo lugar, formatear con :class:`string.Template`::

source: Configuring filters with :func:`dictConfig`
es: Configurar filtros con :func:`dictConfig`

source: You *can* configure filters using :func:`~logging.config.dictConfig`, though it might not be obvious at first glance how to do it (hence this recipe). Since :class:`~logging.Filter` is the only filter class included in the standard library, and it is unlikely to cater to many requirements (it's only there as a base class), you will typically need to define your own :class:`~logging.Filter` subclass with an overridden :meth:`~logging.Filter.filter` method. To do this, specify the ``()`` key in the configuration dictionary for the filter, specifying a callable which will be used to create the filter (a class is the most obvious, but you can provide any callable which returns a :class:`~logging.Filter` instance). Here is a complete example::
es: *Puedes* configurar filtros usando :func:`~logging.config.dictConfig`, aunque a primera vista es posible que no sea obvio cómo hacerlo (de ahí esta receta). Dado que :class:`~logging.Filter` es la única clase de filtro incluida en la biblioteca estándar, y es poco probable que satisfaga muchos requisitos (solo está allí como clase base), normalmente necesitarás definir tu propia subclase :class:`~logging.Filter` con un método :meth:`~logging.Filter.filter` sobreescrito. Para hacer esto, especifique la clave ``()`` en el diccionario de configuración para el filtro, especificando un invocable que se usará para crear el filtro (una clase es la más obvia, pero puede proporcionar cualquier invocable que retorne una instancia :class:`~logging.Filter`). Aquí hay un ejemplo completo:

source: This example shows how you can pass configuration data to the callable which constructs the instance, in the form of keyword parameters. When run, the above script will print:
es: Este ejemplo muestra cómo puede pasar datos de configuración al invocable que construye la instancia, en forma de parámetros de palabras clave. Cuando se ejecuta, se imprimirá el script anterior:

source: which shows that the filter is working as configured.
es: que muestra que el filtro está funcionando según lo configurado.

source: A couple of extra points to note:
es: Un par de puntos adicionales a tener en cuenta:

source: If you can't refer to the callable directly in the configuration (e.g. if it lives in a different module, and you can't import it directly where the configuration dictionary is), you can use the form ``ext://...`` as described in :ref:`logging-config-dict-externalobj`. For example, you could have used the text ``'ext://__main__.MyFilter'`` instead of ``MyFilter`` in the above example.
es: Si no puede hacer referencia al invocable directamente en la configuración (por ejemplo, si vive en un módulo diferente y no puede importarlo directamente donde está el diccionario de configuración), puede usar el formulario ``ext://...`` como se describe en :ref:`logging-config-dict-externalobj`. Por ejemplo, podría haber usado el texto ``'ext://__main__.MyFilter'`` en lugar de ``MyFilter`` en el ejemplo anterior.

source: As well as for filters, this technique can also be used to configure custom handlers and formatters. See :ref:`logging-config-dict-userdef` for more information on how logging supports using user-defined objects in its configuration, and see the other cookbook recipe :ref:`custom-handlers` above.
es: Además de los filtros, esta técnica también se puede utilizar para configurar gestores y formateadores personalizados. Consultar :ref:`logging-config-dict-userdef` para obtener más información sobre cómo logging admite el uso de objetos definidos por el usuario en su configuración, y ver arriba la otra receta :ref:`custom-handlers`.

source: Customized exception formatting
es: Formato de excepción personalizado

source: There might be times when you want to do customized exception formatting - for argument's sake, let's say you want exactly one line per logged event, even when exception information is present. You can do this with a custom formatter class, as shown in the following example::
es: Puede haber ocasiones en las que desee personalizar un formato de excepción; por el bien del argumento, digamos que desea exactamente una línea por evento registrado, incluso cuando la información de la excepción está presente. Puede hacer esto con una clase de formateador personalizada, como se muestra en el siguiente ejemplo::

source: When run, this produces a file with exactly two lines:
es: Cuando se ejecuta, esto produce un archivo con exactamente dos líneas:

source: While the above treatment is simplistic, it points the way to how exception information can be formatted to your liking. The :mod:`traceback` module may be helpful for more specialized needs.
es: Si bien el tratamiento anterior es simplista, señala el camino hacia cómo se puede formatear la información de excepción a su gusto. El módulo :mod:`traceback` puede resultar útil para necesidades más especializadas.

source: Speaking logging messages
es: Mensajes de logging hablantes

source: There might be situations when it is desirable to have logging messages rendered in an audible rather than a visible format. This is easy to do if you have text-to-speech (TTS) functionality available in your system, even if it doesn't have a Python binding. Most TTS systems have a command line program you can run, and this can be invoked from a handler using :mod:`subprocess`. It's assumed here that TTS command line programs won't expect to interact with users or take a long time to complete, and that the frequency of logged messages will be not so high as to swamp the user with messages, and that it's acceptable to have the messages spoken one at a time rather than concurrently, The example implementation below waits for one message to be spoken before the next is processed, and this might cause other handlers to be kept waiting. Here is a short example showing the approach, which assumes that the ``espeak`` TTS package is available::
es: Puede haber situaciones en las que sea deseable que los mensajes de logging se presenten en un formato audible en lugar de visible. Esto es fácil de hacer si tiene la funcionalidad de texto a voz (*TTS* por sus siglas en inglés) disponible en su sistema, incluso si no tiene un *binding* Python. La mayoría de los sistemas TTS tienen un programa de línea de comandos que puede ejecutar, y esto puede invocarse desde un gestor usando :mod:`subprocess`. Aquí se asume que los programas de línea de comando TTS no esperarán interactuar con los usuarios o tardarán mucho en completarse, y que la frecuencia de los mensajes registrados no será tan alta como para inundar al usuario con mensajes, y que es aceptable que los mensajes se reproducen uno a la vez en lugar de todos al mismo tiempo. La implementación de ejemplo a continuación espera a que se pronuncie un mensaje antes de que se procese el siguiente, y esto puede hacer que otros gestores se mantengan esperando. Aquí hay un breve ejemplo que muestra el enfoque, que asume que el paquete TTS ``espeak`` está disponible::

source: When run, this script should say "Hello" and then "Goodbye" in a female voice.
es: Cuando se ejecute, este script debería decir "Hola" y luego "Adiós" con voz femenina.

source: The above approach can, of course, be adapted to other TTS systems and even other systems altogether which can process messages via external programs run from a command line.
es: El enfoque anterior puede, por supuesto, adaptarse a otros sistemas TTS e incluso a otros sistemas que pueden procesar mensajes a través de programas externos ejecutados desde una línea de comando.

source: Buffering logging messages and outputting them conditionally
es: Almacenamiento en búfer de mensajes de logging y su salida condicional

source: There might be situations where you want to log messages in a temporary area and only output them if a certain condition occurs. For example, you may want to start logging debug events in a function, and if the function completes without errors, you don't want to clutter the log with the collected debug information, but if there is an error, you want all the debug information to be output as well as the error.
es: Puede haber situaciones en las que desee registrar mensajes en un área temporal y solo mostrarlos si se produce una determinada condición. Por ejemplo, es posible que desee comenzar a registrar eventos de depuración en una función, y si la función se completa sin errores, no desea saturar el log con la información de depuración recopilada; pero si hay un error, desea toda la información de depuración información así como el error.

source: Here is an example which shows how you could do this using a decorator for your functions where you want logging to behave this way. It makes use of the :class:`logging.handlers.MemoryHandler`, which allows buffering of logged events until some condition occurs, at which point the buffered events are ``flushed`` - passed to another handler (the ``target`` handler) for processing. By default, the ``MemoryHandler`` flushed when its buffer gets filled up or an event whose level is greater than or equal to a specified threshold is seen. You can use this recipe with a more specialised subclass of ``MemoryHandler`` if you want custom flushing behavior.
es: Aquí hay un ejemplo que muestra cómo puede hacer esto usando un decorador para sus funciones donde desea que el logging se comporte de esta manera. Hace uso de :class:`logging.handlers.MemoryHandler`, que permite el almacenamiento en búfer de eventos registrados hasta que se produzca alguna condición, momento en el que los eventos almacenados en búfer se ``flushed`` y se pasan a otro gestor (el gestor ``target``) para su procesamiento. De forma predeterminada, el ``MemoryHandler`` se vacía cuando su búfer se llena o se ve un evento cuyo nivel es mayor o igual a un umbral especificado. Puede usar esta receta con una subclase más especializada de ``MemoryHandler`` si desea un comportamiento de descarga personalizado.

source: The example script has a simple function, ``foo``, which just cycles through all the logging levels, writing to ``sys.stderr`` to say what level it's about to log at, and then actually logging a message at that level. You can pass a parameter to ``foo`` which, if true, will log at ERROR and CRITICAL levels - otherwise, it only logs at DEBUG, INFO and WARNING levels.
es: El script de ejemplo tiene una función simple, ``foo``, que recorre todos los niveles de logging, escribiendo en ``sys.stderr`` para decir en qué nivel está a punto de *loguear* y luego registrar un mensaje en ese nivel. Puede pasar un parámetro a ``foo`` que, si es verdadero, se registrará en los niveles ERROR y CRITICAL; de lo contrario, solo registrará en los niveles DEBUG, INFO y WARNING.

source: The script just arranges to decorate ``foo`` with a decorator which will do the conditional logging that's required. The decorator takes a logger as a parameter and attaches a memory handler for the duration of the call to the decorated function. The decorator can be additionally parameterised using a target handler, a level at which flushing should occur, and a capacity for the buffer (number of records buffered). These default to a :class:`~logging.StreamHandler` which writes to ``sys.stderr``, ``logging.ERROR`` and ``100`` respectively.
es: El script simplemente dispone decorar ``foo`` con un decorador que hará el logging condicional que se requiere. El decorador toma un registrador como parámetro y adjunta un gestor de memoria durante la duración de la llamada a la función decorada. El decorador se puede parametrizar adicionalmente utilizando un gestor *target*, un nivel en el que debe producirse el vaciado y una capacidad para el búfer (número de registros almacenados en búfer). Estos están predeterminados a :class:`~logging.StreamHandler` que escribe en ``sys.stderr``, ``logging.ERROR`` y ``100`` respectivamente.

source: Here's the script::
es: Aquí está el script::

source: When this script is run, the following output should be observed:
es: Cuando se ejecuta este script, se debe observar el siguiente resultado::

source: As you can see, actual logging output only occurs when an event is logged whose severity is ERROR or greater, but in that case, any previous events at lower severities are also logged.
es: Como puede ver, la salida real de logging solo ocurre cuando se registra un evento cuya gravedad es ERROR o mayor, pero en ese caso, también se registra cualquier evento anterior con una gravedad menor.

source: You can of course use the conventional means of decoration::
es: Por supuesto, puede utilizar las formas de decoración convencionales::

source: Sending logging messages to email, with buffering
es: Enviando mensajes de logging al correo electrónico, con almacenamiento en búfer
