Repository: python/python-docs-es
Catalog: howto/logging-cookbook.po
Languages: es

source: Logging Cookbook
es: Libro de recetas de Logging

source: Author
es: Autor

source: This page contains a number of recipes related to logging, which have been found useful in the past. For links to tutorial and reference information, please see :ref:`cookbook-ref-links`.
es: Esta página contiene un número de recetas sobre *logging*, que han sido útiles en el pasado. Para obtener enlaces al tutorial e información de referencia, consulte :ref:`cookbook-ref-links`.

source: Using logging in multiple modules
es: Usar logging en múltiples módulos

source: Multiple calls to ``logging.getLogger('someLogger')`` return a reference to the same logger object. This is true not only within the same module, but also across modules as long as it is in the same Python interpreter process. It is true for references to the same object; additionally, application code can define and configure a parent logger in one module and create (but not configure) a child logger in a separate module, and all logger calls to the child will pass up to the parent. Here is a main module::
es: Múltiples llamadas a ``logging.getLogger('someLogger')`` retornan una referencia al mismo objeto logger. Esto es cierto no solo dentro del mismo módulo, sino también en todos los módulos siempre que estén ejecutándose en el mismo proceso del intérprete de Python. Es válido para las referencias al mismo objeto. Además, el código de la aplicación puede definir y configurar un logger primario en un módulo y crear (pero no configurar) un logger secundario en un módulo separado, y todas las llamadas al secundario pasarán al principal. A continuación un módulo principal::

source: Here is the auxiliary module::
es: Y aquí un módulo auxiliar::

source: The output looks like this:
es: El resultado se ve así:

source: Logging from multiple threads
es: Logging desde múltiples hilos

source: Logging from multiple threads requires no special effort. The following example shows logging from the main (initial) thread and another thread::
es: Realizar *logging* desde múltiples hilos (*threads*) no requiere ningún esfuerzo especial. El siguiente ejemplo muestra el logging desde el hilo principal (inicial) y otro hilo::

source: When run, the script should print something like the following:
es: Cuando se ejecuta, el script debe imprimir algo como lo siguiente:

source: This shows the logging output interspersed as one might expect. This approach works for more threads than shown here, of course.
es: Esto muestra la salida de logging intercalada como cabría esperar. Por supuesto, este enfoque funciona para más hilos de lo que se muestran aquí.

source: Multiple handlers and formatters
es: Múltiples gestores y formateadores

source: Loggers are plain Python objects. The :meth:`~Logger.addHandler` method has no minimum or maximum quota for the number of handlers you may add. Sometimes it will be beneficial for an application to log all messages of all severities to a text file while simultaneously logging errors or above to the console. To set this up, simply configure the appropriate handlers. The logging calls in the application code will remain unchanged. Here is a slight modification to the previous simple module-based configuration example::
es: Los *loggers* son simples objetos Python. El método :meth:`~Logger.addHandler` no tiene una cuota mínima o máxima para la cantidad de gestores (*handlers*) que puede agregar. A veces será beneficioso para una aplicación registrar todos los mensajes de todas las prioridades en un archivo de texto mientras se registran simultáneamente los errores o más en la consola. Para configurar esto, simplemente configure los gestores apropiados. Las llamadas de logging en el código de la aplicación permanecerán sin cambios. Aquí hay una ligera modificación al ejemplo de configuración simple anterior basado en módulo::

source: Notice that the 'application' code does not care about multiple handlers. All that changed was the addition and configuration of a new handler named *fh*.
es: Tenga en cuenta que el código de la 'aplicación' no se preocupa por los gestores múltiples. Todo lo que cambió fue la adición y configuración de un nuevo gestor llamado *fh*.

source: The ability to create new handlers with higher- or lower-severity filters can be very helpful when writing and testing an application. Instead of using many ``print`` statements for debugging, use ``logger.debug``: Unlike the print statements, which you will have to delete or comment out later, the logger.debug statements can remain intact in the source code and remain dormant until you need them again. At that time, the only change that needs to happen is to modify the severity level of the logger and/or handler to debug.
es: La capacidad de crear nuevos gestores con filtros de mayor o menor prioridad puede ser muy útil al escribir y probar una aplicación. En lugar de usar muchas declaraciones ``print`` para la depuración, use ``logger.debug``: a diferencia de las declaraciones de impresión, que tendrá que eliminar o comentar más tarde, las declaraciones de *logger.debug* pueden permanecer intactas en el código fuente y permanecen inactivas hasta que las necesite nuevamente. En ese momento, el único cambio que debe realizar es modificar el nivel de prioridad del *logger* y/o gestor para depurar.

source: Logging to multiple destinations
es: Logging en múltiples destinos

source: Let's say you want to log to console and file with different message formats and in differing circumstances. Say you want to log messages with levels of DEBUG and higher to file, and those messages at level INFO and higher to the console. Let's also assume that the file should contain timestamps, but the console messages should not. Here's how you can achieve this::
es: Supongamos que desea que la consola y un archivo tengan diferentes formatos de mensaje y salida de log para diferentes situaciones. Por ejemplo, desea registrar mensajes con un nivel DEBUG y superiores en un archivo y enviar mensajes con nivel INFO y superior a la consola. Además, suponga que desea grabar una marca de tiempo en el archivo y no imprimirlo en la consola. Puede lograr este comportamiento haciendo lo siguiente::

source: When you run this, on the console you will see
es: Cuando ejecute esto, en la consola verá

source: and in the file you will see something like
es: y en el archivo verá algo como

source: As you can see, the DEBUG message only shows up in the file. The other messages are sent to both destinations.
es: Como se puede ver, el mensaje DEBUG sólo se muestra en el archivo. Los otros mensajes se envían a los dos destinos.

source: This example uses console and file handlers, but you can use any number and combination of handlers you choose.
es: Este ejemplo usa gestores de consola y archivos, pero puede usar cualquier número y combinación de los gestores que elija.

source: Note that the above choice of log filename ``/tmp/myapp.log`` implies use of a standard location for temporary files on POSIX systems. On Windows, you may need to choose a different directory name for the log - just ensure that the directory exists and that you have the permissions to create and update files in it.
es: Tenga en cuenta que la elección anterior del nombre del archivo de registro ``/tmp/myapp.log`` implica el uso de una ubicación estándar para los archivos temporales en los sistemas POSIX. En Windows, es posible que tenga que elegir un nombre de directorio diferente para el registro - sólo asegúrese de que el directorio existe y que tiene los permisos para crear y actualizar archivos en él.

source: Custom handling of levels
es: Gestión personalizada de niveles

source: Sometimes, you might want to do something slightly different from the standard handling of levels in handlers, where all levels above a threshold get processed by a handler. To do this, you need to use filters. Let's look at a scenario where you want to arrange things as follows:
es: A veces, es posible que desee hacer algo ligeramente diferente del manejo estándar de niveles, donde todos los niveles por encima de un umbral son procesados por un gestor. Para ello, es necesario utilizar filtros. Veamos un escenario en el que se desea organizar las cosas de la siguiente manera:

source: Send messages of severity ``INFO`` and ``WARNING`` to ``sys.stdout``
es: Enviar mensajes de gravedad ``INFO`` y ``WARNING`` a ``sys.stdout``

source: Send messages of severity ``ERROR`` and above to ``sys.stderr``
es: Enviar mensajes de gravedad ``ERROR`` y superiores a ``sys.stderr``

source: Send messages of severity ``DEBUG`` and above to file ``app.log``
es: Envía los mensajes de gravedad ``DEBUG`` y superiores al archivo ``app.log``

source: Suppose you configure logging with the following JSON:
es: Supongamos que se configura el registro con el siguiente JSON:

source: This configuration does *almost* what we want, except that ``sys.stdout`` would show messages of severity ``ERROR`` and above as well as ``INFO`` and ``WARNING`` messages. To prevent this, we can set up a filter which excludes those messages and add it to the relevant handler. This can be configured by adding a ``filters`` section parallel to ``formatters`` and ``handlers``:
es: Esta configuración hace *casi* lo que queremos, excepto que ``sys.stdout`` mostraría mensajes de gravedad ``ERROR`` y superiores, así como mensajes ``INFO`` y ``WARNING``. Para evitarlo, podemos configurar un filtro que excluya esos mensajes y añadirlo al gestor correspondiente. Esto se puede configurar añadiendo una sección ``filters`` paralela a ``formatters`` y ``handlers``:

source: and changing the section on the ``stdout`` handler to add it:
es: y cambiando la sección del gestor ``stdout`` para añadirlo:

source: A filter is just a function, so we can define the ``filter_maker`` (a factory function) as follows:
es: Un filtro no es más que una función, por lo que podemos definir el ``filter_maker`` (una función de fábrica) como sigue:

source: This converts the string argument passed in to a numeric level, and returns a function which only returns ``True`` if the level of the passed in record is at or below the specified level. Note that in this example I have defined the ``filter_maker`` in a test script ``main.py`` that I run from the command line, so its module will be ``__main__`` - hence the ``__main__.filter_maker`` in the filter configuration. You will need to change that if you define it in a different module.
es: Esto convierte el argumento de la cadena de caracteres pasada en un nivel numérico, y retorna una función que sólo retorna ``True`` si el nivel del registro pasado está en o por debajo del nivel especificado. Ten en cuenta que en este ejemplo se ha definido el ``filter_maker`` en un script de prueba ``main.py`` que se ejecuta desde la línea de comandos, por lo que su módulo será ``__main__`` - de ahí el ``__main__.filter_maker`` en la configuración del filtro. Tendrás que cambiar eso si lo defines en un módulo diferente.

source: With the filter added, we can run ``main.py``, which in full is:
es: Con el filtro añadido, podemos ejecutar ``main.py``, que en su totalidad es:

source: And after running it like this:
es: Y después de ejecutarlo de esta manera:

source: We can see the results are as expected:
es: Podemos ver que los resultados son los esperados:

source: Configuration server example
es: Ejemplo de servidor de configuración

source: Here is an example of a module using the logging configuration server::
es: Aquí hay un ejemplo de un módulo que usa el servidor de configuración logging::

source: And here is a script that takes a filename and sends that file to the server, properly preceded with the binary-encoded length, as the new logging configuration::
es: Y aquí hay un script que toma un nombre de archivo y envía ese archivo al servidor, precedido adecuadamente con la longitud codificada en binario, como la nueva configuración de logging::

source: Dealing with handlers that block
es: Tratar con gestores que bloquean

source: Sometimes you have to get your logging handlers to do their work without blocking the thread you're logging from. This is common in web applications, though of course it also occurs in other scenarios.
es: A veces tiene que hacer que sus gestores de registro hagan su trabajo sin bloquear el hilo desde el que está iniciando sesión. Esto es común en las aplicaciones web, aunque, por supuesto, también ocurre en otros escenarios.

source: A common culprit which demonstrates sluggish behaviour is the :class:`SMTPHandler`: sending emails can take a long time, for a number of reasons outside the developer's control (for example, a poorly performing mail or network infrastructure). But almost any network-based handler can block: Even a :class:`SocketHandler` operation may do a DNS query under the hood which is too slow (and this query can be deep in the socket library code, below the Python layer, and outside your control).
es: Un responsable habitual que ejemplifica un comportamiento lento es la :class:`SMTPHandler`: el envío de correos electrónicos puede llevar mucho tiempo, por varias razones fuera del control del desarrollador (por ejemplo, una infraestructura de red o correo de bajo rendimiento). Pero casi cualquier controlador basado en red puede bloquear: incluso una operación :class:`SocketHandler` puede estar haciendo a bajo nivel una consulta DNS que es demasiado lenta (y esta consulta puede estar en el código de la biblioteca de socket, debajo de la capa de Python, y fuera de su control).

source: One solution is to use a two-part approach. For the first part, attach only a :class:`QueueHandler` to those loggers which are accessed from performance-critical threads. They simply write to their queue, which can be sized to a large enough capacity or initialized with no upper bound to their size. The write to the queue will typically be accepted quickly, though you will probably need to catch the :exc:`queue.Full` exception as a precaution in your code. If you are a library developer who has performance-critical threads in their code, be sure to document this (together with a suggestion to attach only ``QueueHandlers`` to your loggers) for the benefit of other developers who will use your code.
es: Una solución es utilizar un enfoque de dos partes. Para la primera parte, adjunte solo una :class:`QueueHandler` a los loggers que se acceden desde subprocesos críticos de rendimiento. Simplemente escriben en su cola, que puede dimensionarse a una capacidad lo suficientemente grande o inicializarse sin límite superior a su tamaño. La escritura en la cola generalmente se aceptará rápidamente, aunque es probable que deba atrapar la excepción :exc:`queue.Full` como precaución en su código. Si usted es un desarrollador de bibliotecas que tiene subprocesos críticos de rendimiento en su código, asegúrese de documentar esto (junto con una sugerencia de adjuntar solo ``QueueHandlers`` a sus loggers) para el beneficio de otros desarrolladores que usarán su código.

source: The second part of the solution is :class:`QueueListener`, which has been designed as the counterpart to :class:`QueueHandler`. A :class:`QueueListener` is very simple: it's passed a queue and some handlers, and it fires up an internal thread which listens to its queue for LogRecords sent from ``QueueHandlers`` (or any other source of ``LogRecords``, for that matter). The ``LogRecords`` are removed from the queue and passed to the handlers for processing.
es: La segunda parte de la solución es :class:`QueueListener`, que fue designado como la contraparte de :class:`QueueHandler`. Un :class:`QueueListener` es muy simple: ha pasado una cola y algunos gestores, y activa un hilo interno que escucha su cola para *LogRecords* enviados desde ``QueueHandlers`` (o cualquier otra fuente de ``LogRecords``, para el caso). Los ``LogRecords`` se eliminan de la cola y se pasan a los gestores para su procesamiento.

source: The advantage of having a separate :class:`QueueListener` class is that you can use the same instance to service multiple ``QueueHandlers``. This is more resource-friendly than, say, having threaded versions of the existing handler classes, which would eat up one thread per handler for no particular benefit.
es: La ventaja de tener una clase separada :class:`QueueListener` es que puede usar la misma instancia para dar servicio a múltiples ``QueueHandlers``. Esto es más amigable con los recursos que, por ejemplo, tener versiones enhebradas de las clases de gestores existentes, que consumirían un hilo por gestor sin ningún beneficio particular.

source: An example of using these two classes follows (imports omitted)::
es: Un ejemplo del uso de estas dos clases a continuación (se omiten *imports*)::

source: which, when run, will produce:
es: que, cuando se ejecuta, producirá:

source: Although the earlier discussion wasn't specifically talking about async code, but rather about slow logging handlers, it should be noted that when logging from async code, network and even file handlers could lead to problems (blocking the event loop) because some logging is done from :mod:`asyncio` internals. It might be best, if any async code is used in an application, to use the above approach for logging, so that any blocking code runs only in the ``QueueListener`` thread.
es: Aunque la discusión anterior no se refería específicamente al código asíncrono, sino más bien a los gestores de logging lentos, hay que tener en cuenta que cuando se realiza logging desde código asíncrono, los gestores de red e incluso de archivos podrían dar problemas (bloqueo del bucle de eventos) porque parte del logging se realiza desde los internos de :mod:`asyncio`. Podría ser mejor, si se utiliza cualquier código asíncrono en una aplicación, utilizar el enfoque anterior para el logging, de modo que cualquier código de bloqueo se ejecute sólo en el hilo ``QueueListener``.

source: Prior to Python 3.5, the :class:`QueueListener` always passed every message received from the queue to every handler it was initialized with. (This was because it was assumed that level filtering was all done on the other side, where the queue is filled.) From 3.5 onwards, this behaviour can be changed by passing a keyword argument ``respect_handler_level=True`` to the listener's constructor. When this is done, the listener compares the level of each message with the handler's level, and only passes a message to a handler if it's appropriate to do so.
es: Antes de Python 3.5, :class:`QueueListener` siempre pasaba cada mensaje recibido de la cola a cada controlador con el que se inicializaba. (Esto se debió a que se asumió que el filtrado de nivel se realizó en el otro lado, donde se llena la cola). A partir de 3.5, este comportamiento se puede cambiar pasando un argumento de palabra clave ``respect_handler_level=True`` al constructor del oyente . Cuando se hace esto, el oyente compara el nivel de cada mensaje con el nivel del controlador y solo pasa un mensaje a un controlador si es apropiado hacerlo.

source: Sending and receiving logging events across a network
es: Enviar y recibir eventos logging a través de una red

source: Let's say you want to send logging events across a network, and handle them at the receiving end. A simple way of doing this is attaching a :class:`SocketHandler` instance to the root logger at the sending end::
es: Supongamos que desea enviar eventos de registro a través de una red y gestionarlos en el extremo receptor. Una forma sencilla de hacer esto es adjuntar una instancia de :class:`SocketHandler` al registrador raíz en el extremo de envío::

source: At the receiving end, you can set up a receiver using the :mod:`socketserver` module. Here is a basic working example::
es: En el extremo receptor, puede configurar un receptor usando el módulo :mod:`socketserver`. Aquí hay un ejemplo básico de trabajo:

source: First run the server, and then the client. On the client side, nothing is printed on the console; on the server side, you should see something like:
es: Primero ejecuta el servidor, y luego el cliente. Del lado del cliente, nada se imprime en la consola; del lado del servidor, se debería ver algo como esto:

source: Running a logging socket listener in production
es: Ejecutando un logging de socket oyente en producción

source: Adding contextual information to your logging output
es: Agregar información contextual a su salida de logging

source: Sometimes you want logging output to contain contextual information in addition to the parameters passed to the logging call. For example, in a networked application, it may be desirable to log client-specific information in the log (e.g. remote client's username, or IP address). Although you could use the *extra* parameter to achieve this, it's not always convenient to pass the information in this way. While it might be tempting to create :class:`Logger` instances on a per-connection basis, this is not a good idea because these instances are not garbage collected. While this is not a problem in practice, when the number of :class:`Logger` instances is dependent on the level of granularity you want to use in logging an application, it could be hard to manage if the number of :class:`Logger` instances becomes effectively unbounded.
es: A veces, desea que la salida de logging contenga información contextual además de los parámetros pasados a la llamada del logging. Por ejemplo, en una aplicación en red, puede ser conveniente registrar información específica del cliente en el logging (por ejemplo, el nombre de usuario del cliente remoto o la dirección IP). Aunque puede usar el parámetro *extra* para lograr esto, no siempre es conveniente pasar la información de esta manera. Si bien puede resultar tentador crear instancias :class:`Logger` por conexión, esta no es una buena idea porque estas instancias no se liberan de memoria vía el recolector de basura (*garbage collector*). Si bien esto no es un problema en la práctica, cuando el número de instancias de :class:`Logger` depende del nivel de granularidad que desea usar para hacer el logging de una aplicación, podría ser difícil de administrar si el número de instancias :class:`Logger` se vuelven efectivamente ilimitadas.

source: Using LoggerAdapters to impart contextual information
es: Uso de LoggerAdapters para impartir información contextual

source: An easy way in which you can pass contextual information to be output along with logging event information is to use the :class:`LoggerAdapter` class. This class is designed to look like a :class:`Logger`, so that you can call :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`exception`, :meth:`critical` and :meth:`log`. These methods have the same signatures as their counterparts in :class:`Logger`, so you can use the two types of instances interchangeably.
es: Una manera fácil de pasar información contextual para que se genere junto con la información de eventos logging es usar la clase :class:`LoggerAdapter`. Esta clase está diseñada para parecerse a :class:`Logger`, de modo que pueda llamar :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`excepción`, :meth:`critical` y :meth:`log`. Estos métodos tienen las mismas signaturas que sus contrapartes en :class:`Logger`, por lo que puede usar los dos tipos de instancias indistintamente.
