Repository: python/python-docs-es
Catalog: howto/logging-cookbook.po
Languages: es

source: Loggers are singletons that are never freed during a script execution, and so creating lots of loggers will use up memory which can't then be freed. Rather than create a logger per e.g. file processed or network connection made, use the :ref:`existing mechanisms <context-info>` for passing contextual information into your logs and restrict the loggers created to those describing areas within your application (generally modules, but occasionally slightly more fine-grained than that).
es: Los registradores son singletons que nunca se liberan durante la ejecución de un script, por lo que la creación de muchos registradores consumirá memoria que luego no se puede liberar. En lugar de crear un registrador por ej. archivo procesado o conexión de red realizada, use los :ref:`mecanismos existentes <context-info>` para pasar información contextual a sus registros y restringir los registradores creados a aquellos que describen áreas dentro de su aplicación (generalmente módulos, pero ocasionalmente un poco más detallado que eso).

source: Other resources
es: Otros recursos

source: :ref:`Basic Tutorial <logging-basic-tutorial>`
es: :ref:`Tutorial Básico <logging-basic-tutorial>`

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
es: :ref:`Tutorial Avanzado <logging-advanced-tutorial>`
