Repository: python/python-docs-es
Catalog: howto/logging-cookbook.po
Languages: es

source: When you create an instance of :class:`LoggerAdapter`, you pass it a :class:`Logger` instance and a dict-like object which contains your contextual information. When you call one of the logging methods on an instance of :class:`LoggerAdapter`, it delegates the call to the underlying instance of :class:`Logger` passed to its constructor, and arranges to pass the contextual information in the delegated call. Here's a snippet from the code of :class:`LoggerAdapter`::
es: Cuando creas una instancia de :class:`LoggerAdapter`, le pasas una instancia de :class:`Logger` y un objeto similar a un dict que contiene tu información contextual. Cuando llamas a uno de los métodos de registro en una instancia de :class:`LoggerAdapter`, delega la llamada a la instancia subyacente de :class:`Logger` pasada a su constructor, y se arregla para pasar la información contextual en la llamada delegada . Aquí hay un fragmento del código de :class:`LoggerAdapter`::

source: The :meth:`~LoggerAdapter.process` method of :class:`LoggerAdapter` is where the contextual information is added to the logging output. It's passed the message and keyword arguments of the logging call, and it passes back (potentially) modified versions of these to use in the call to the underlying logger. The default implementation of this method leaves the message alone, but inserts an 'extra' key in the keyword argument whose value is the dict-like object passed to the constructor. Of course, if you had passed an 'extra' keyword argument in the call to the adapter, it will be silently overwritten.
es: El método :meth:`~LoggerAdapter.process` de :class:`LoggerAdapter` es donde la información contextual se agrega a la salida del logging. Se pasa el mensaje y los argumentos de palabra clave de la llamada logging, y retorna versiones (potencialmente) modificadas de estos para usar en la llamada al logging subyacente. La implementación predeterminada de este método deja el mensaje solo, pero inserta una clave 'extra' en el argumento de palabra clave cuyo valor es el objeto tipo dict pasado al constructor. Por supuesto, si ha pasado un argumento de palabra clave 'extra' en la llamada al adaptador, se sobrescribirá silenciosamente.

source: The advantage of using 'extra' is that the values in the dict-like object are merged into the :class:`LogRecord` instance's __dict__, allowing you to use customized strings with your :class:`Formatter` instances which know about the keys of the dict-like object. If you need a different method, e.g. if you want to prepend or append the contextual information to the message string, you just need to subclass :class:`LoggerAdapter` and override :meth:`~LoggerAdapter.process` to do what you need. Here is a simple example::
es: La ventaja de usar 'extra' es que los valores en el objeto dict se combinan en la instancia :class:`LogRecord` __dict__, lo que le permite usar cadenas personalizadas con sus instancias :class:`Formatter` que conocen las claves del objeto dict. Si necesita un método diferente, por ejemplo, si desea anteponer o agregar la información contextual a la cadena del mensaje, solo necesita la subclase :class:`LoggerAdapter` y anular :meth:`~LoggerAdapter.process` para hacer lo que necesita. Aquí hay un ejemplo simple:

source: which you can use like this::
es: que puede usar así::

source: Then any events that you log to the adapter will have the value of ``some_conn_id`` prepended to the log messages.
es: Luego, cualquier evento que registre en el adaptador tendrá el valor de ``some_conn_id`` antepuesto a los mensajes de logging.

source: Using objects other than dicts to pass contextual information
es: Usar objetos distintos a los diccionarios para transmitir información contextual

source: You don't need to pass an actual dict to a :class:`LoggerAdapter` - you could pass an instance of a class which implements ``__getitem__`` and ``__iter__`` so that it looks like a dict to logging. This would be useful if you want to generate values dynamically (whereas the values in a dict would be constant).
es: No es necesario pasar un diccionario real a la :class:`LoggerAdapter` - puedes pasar una instancia de una clase que implemente ``__getitem__`` y ``__iter__`` de modo que parezca un diccionario para el logging. Esto es útil si quieres generar valores dinámicamente (mientras que los valores en un diccionario son constantes).

source: Using Filters to impart contextual information
es: Usar filtros para impartir información contextual

source: You can also add contextual information to log output using a user-defined :class:`Filter`. ``Filter`` instances are allowed to modify the ``LogRecords`` passed to them, including adding additional attributes which can then be output using a suitable format string, or if needed a custom :class:`Formatter`.
es: También puedes agregar información contextual a la salida del log utilizando un :class:`Filter` definido por el usuario. Las instancias de ``Filter`` pueden modificar los ``LogRecords`` que se les pasan, incluido el agregado de atributos adicionales que luego se pueden generar utilizando cadena de caracteres con el formato adecuado, o si es necesario, un :class:`Formatter` personalizado.

source: For example in a web application, the request being processed (or at least, the interesting parts of it) can be stored in a threadlocal (:class:`threading.local`) variable, and then accessed from a ``Filter`` to add, say, information from the request - say, the remote IP address and remote user's username - to the ``LogRecord``, using the attribute names 'ip' and 'user' as in the ``LoggerAdapter`` example above. In that case, the same format string can be used to get similar output to that shown above. Here's an example script::
es: Por ejemplo, en una aplicación web, la solicitud que se está procesando (o al menos, las partes interesantes de la misma) se pueden almacenar en una variable *threadlocal* (:class:`threading.local`) y luego se puede acceder a ella desde ``Filter`` para agregar información de la solicitud, - digamos, la dirección IP remota y el nombre de usuario-, al ``LogRecord``, usando los nombres de atributo 'ip' y 'user' como en el ejemplo anterior de ``LoggerAdapter``. En ese caso, se puede usar el mismo formato de cadena de caracteres para obtener un resultado similar al que se muestra arriba. Aquí hay un script de ejemplo::

source: which, when run, produces something like:
es: que cuando se ejecuta, produce algo como:

source: Use of ``contextvars``
es: Uso de ``contextvars``

source: Since Python 3.7, the :mod:`contextvars` module has provided context-local storage which works for both :mod:`threading` and :mod:`asyncio` processing needs. This type of storage may thus be generally preferable to thread-locals. The following example shows how, in a multi-threaded environment, logs can populated with contextual information such as, for example, request attributes handled by web applications.
es: Desde la versión 3.7 de Python, el módulo :mod:`contextvars` ha proporcionado almacenamiento local de contexto que funciona tanto para las necesidades de procesamiento de :mod:`threading` como de :mod:`asyncio`. Este tipo de almacenamiento puede ser, por tanto, preferible a los hilos locales. El siguiente ejemplo muestra cómo, en un entorno multihilo, los logs pueden rellenarse con información contextual como, por ejemplo, los atributos de las peticiones gestionadas por las aplicaciones web.

source: For the purposes of illustration, say that you have different web applications, each independent of the other but running in the same Python process and using a library common to them. How can each of these applications have their own log, where all logging messages from the library (and other request processing code) are directed to the appropriate application's log file, while including in the log additional contextual information such as client IP, HTTP request method and client username?
es: A modo de ilustración, digamos que tienes diferentes aplicaciones web, cada una de ellas independiente de la otra, pero que se ejecutan en el mismo proceso de Python y utilizan una biblioteca común a todas ellas. ¿Cómo puede cada una de estas aplicaciones tener su propio registro, donde todos los mensajes de logging de la biblioteca (y otro código de procesamiento de solicitudes) se dirigen al archivo de registro de la aplicación apropiada, mientras se incluye en el registro información contextual adicional como la IP del cliente, el método de solicitud HTTP y el nombre de usuario del cliente?

source: Let's assume that the library can be simulated by the following code:
es: Supongamos que la biblioteca se puede simular con el siguiente código:

source: We can simulate the multiple web applications by means of two simple classes, ``Request`` and ``WebApp``. These simulate how real threaded web applications work - each request is handled by a thread:
es: Podemos simular las aplicaciones web múltiples mediante dos clases simples, ``Request`` y ``WebApp``. Éstas simulan cómo funcionan las aplicaciones web reales con hilos, cada petición es manejada por un hilo:

source: If you run the above, you should find that roughly half the requests go into :file:`app1.log` and the rest into :file:`app2.log`, and the all the requests are logged to :file:`app.log`. Each webapp-specific log will contain only log entries for only that webapp, and the request information will be displayed consistently in the log (i.e. the information in each dummy request will always appear together in a log line). This is illustrated by the following shell output:
es: Si ejecuta lo anterior, debería encontrar que aproximadamente la mitad de las peticiones van a :file:`app1.log` y el resto a :file:`app2.log`, y las todas las peticiones se registran en :file:`app.log`. Cada registro específico de la aplicación web contendrá únicamente entradas de log para esa aplicación web, y la información de las peticiones se mostrará de forma consistente en el registro (es decir, la información de cada petición ficticia aparecerá siempre junta en una línea de log). Esto se ilustra con la siguiente salida del shell:

source: Imparting contextual information in handlers
es: Impartir información contextual en los gestores

source: Each :class:`~Handler` has its own chain of filters. If you want to add contextual information to a :class:`LogRecord` without leaking it to other handlers, you can use a filter that returns a new :class:`~LogRecord` instead of modifying it in-place, as shown in the following script::
es: Cada :class:`~Handler` tiene su propia cadena de filtros. Si quieres añadir información contextual a una :class:`LogRecord` sin filtrarla a otros gestores, puedes utilizar un filtro que retorna una nueva :class:`~LogRecord` en lugar de modificarlo in situ, como se muestra en el siguiente script::

source: Logging to a single file from multiple processes
es: Logging a un sólo archivo desde múltiples procesos

source: Although logging is thread-safe, and logging to a single file from multiple threads in a single process *is* supported, logging to a single file from *multiple processes* is *not* supported, because there is no standard way to serialize access to a single file across multiple processes in Python. If you need to log to a single file from multiple processes, one way of doing this is to have all the processes log to a :class:`~handlers.SocketHandler`, and have a separate process which implements a socket server which reads from the socket and logs to file. (If you prefer, you can dedicate one thread in one of the existing processes to perform this function.) :ref:`This section <network-logging>` documents this approach in more detail and includes a working socket receiver which can be used as a starting point for you to adapt in your own applications.
es: Aunque logging es seguro para hilos, y el logging a un solo archivo desde múltiples hilos en un solo proceso *es* compatible, el logging en un solo archivo desde *múltiples procesos* *no* es compatible, porque no existe una forma estándar de serializar el acceso a un solo archivo en múltiples procesos en Python. Si necesita hacer esto último, una forma de abordarlo es hacer que todos los procesos se registren en una :class:`~handlers.SocketHandler`, y tener un proceso separado que implemente un servidor de socket que lee del socket y los loggings para archivar. (Si lo prefiere, puede dedicar un hilo en uno de los procesos existentes para realizar esta función.) :ref:`Esta sección <network-logging>` documenta este enfoque con más detalle e incluye un receptor socket que funciona que se puede utilizar como punto de partida para que se adapte a sus propias aplicaciones.

source: You could also write your own handler which uses the :class:`~multiprocessing.Lock` class from the :mod:`multiprocessing` module to serialize access to the file from your processes. The existing :class:`FileHandler` and subclasses do not make use of :mod:`multiprocessing` at present, though they may do so in the future. Note that at present, the :mod:`multiprocessing` module does not provide working lock functionality on all platforms (see https://bugs.python.org/issue3770).
es: También puedes escribir tu propio gestor que use la clase :class:`~multiprocessing.Lock` del módulo :mod:`multiprocessing` para serializar el acceso al archivo desde tus procesos. La existente :class:`FileHandler` y las subclases no hacen uso de :mod:`multiprocessing` en la actualidad, aunque pueden hacerlo en el futuro. Tenga en cuenta que, en la actualidad, el módulo :mod:`multiprocessing` no proporciona la funcionalidad de bloqueo de trabajo en todas las plataformas (ver https://bugs.python.org/issue3770).

source: Alternatively, you can use a ``Queue`` and a :class:`QueueHandler` to send all logging events to one of the processes in your multi-process application. The following example script demonstrates how you can do this; in the example a separate listener process listens for events sent by other processes and logs them according to its own logging configuration. Although the example only demonstrates one way of doing it (for example, you may want to use a listener thread rather than a separate listener process -- the implementation would be analogous) it does allow for completely different logging configurations for the listener and the other processes in your application, and can be used as the basis for code meeting your own specific requirements::
es: Alternativamente, puede usar una ``Queue`` y :class:`QueueHandler` para enviar todos los logging a uno de los procesos en su aplicación multi-proceso. El siguiente script de ejemplo demuestra cómo puede hacer esto; en el ejemplo, un proceso de escucha independiente escucha los eventos enviados por otros procesos y los registra de acuerdo con su propia configuración de logging. Aunque el ejemplo solo demuestra una forma de hacerlo (por ejemplo, es posible que desee utilizar un hilo de escucha en lugar de un proceso de escucha separado; la implementación sería análoga), permite configuraciones de logging completamente diferentes para el oyente y los otros procesos en su aplicación. Y se puede utilizar como base para el código que cumpla con sus propios requisitos específicos::

source: A variant of the above script keeps the logging in the main process, in a separate thread::
es: Una variante del script anterior mantiene el logging en el proceso principal, en un hilo separado::

source: This variant shows how you can e.g. apply configuration for particular loggers - e.g. the ``foo`` logger has a special handler which stores all events in the ``foo`` subsystem in a file ``mplog-foo.log``. This will be used by the logging machinery in the main process (even though the logging events are generated in the worker processes) to direct the messages to the appropriate destinations.
es: Esta variante muestra cómo puede, por ejemplo, aplicar la configuración para logging particulares: el registrador ``foo`` tiene un gestor especial que almacena todos los eventos en el subsistema ``foo`` en un archivo ``mplog-foo.log``. Esto será utilizado por la maquinaria de logging en el proceso principal (aunque los eventos logging se generen en los procesos de trabajo) para dirigir los mensajes a los destinos apropiados.

source: Using concurrent.futures.ProcessPoolExecutor
es: Usando concurrent.futures.ProcessPoolExecutor

source: If you want to use :class:`concurrent.futures.ProcessPoolExecutor` to start your worker processes, you need to create the queue slightly differently. Instead of
es: Si desea utilizar :class:`concurrent.futures.ProcessPoolExecutor` para iniciar sus procesos de trabajo, debe crear la cola de manera ligeramente diferente. En vez de

source: you should use
es: debería usar

source: and you can then replace the worker creation from this::
es: y luego puede reemplazar la creación del trabajador de esto::

source: to this (remembering to first import :mod:`concurrent.futures`)::
es: a esto (recuerda el primer *import* :mod:`concurrent.futures`)::

source: Deploying Web applications using Gunicorn and uWSGI
es: Despliegue de aplicaciones web con Gunicorn y uWSGI

source: When deploying Web applications using `Gunicorn <https://gunicorn.org/>`_ or `uWSGI <https://uwsgi-docs.readthedocs.io/en/latest/>`_ (or similar), multiple worker processes are created to handle client requests. In such environments, avoid creating file-based handlers directly in your web application. Instead, use a :class:`SocketHandler` to log from the web application to a listener in a separate process. This can be set up using a process management tool such as Supervisor - see `Running a logging socket listener in production`_ for more details.
es: Cuando se despliegan aplicaciones web utilizando `Gunicorn <https://gunicorn.org/>`_ o `uWSGI <https://uwsgi-docs.readthedocs.io/en/latest/>`_ (o similares), se crean múltiples procesos de trabajo para gestionar las peticiones de los clientes. En estos entornos, evite crear gestores basados directamente en archivos en su aplicación web. En su lugar, utilice un :class:`SocketHandler` para registrar desde la aplicación web al oyente en un proceso separado. Esto puede configurarse usando una herramienta de gestión de procesos como Supervisor - vea `Running a logging socket listener in production`_ para más detalles.

source: Using file rotation
es: Usando rotación de archivos

source: The result should be 6 separate files, each with part of the log history for the application:
es: El resultado debe ser 6 archivos separados, cada uno con parte del historial de log de la aplicación:

source: The most current file is always :file:`logging_rotatingfile_example.out`, and each time it reaches the size limit it is renamed with the suffix ``.1``. Each of the existing backup files is renamed to increment the suffix (``.1`` becomes ``.2``, etc.) and the ``.6`` file is erased.
es: El archivo más actual siempre es :file:`logging_rotatingfile_example.out`, y cada vez que alcanza el límite de tamaño, se le cambia el nombre con el sufijo ``.1``. Se cambia el nombre de cada uno de los archivos de respaldo existentes para incrementar el sufijo (``.1`` se convierte en ``.2``, etc.) y se borra el archivo ``.6``.

source: Obviously this example sets the log length much too small as an extreme example. You would want to set *maxBytes* to an appropriate value.
es: Obviamente, este ejemplo establece la longitud del log demasiado pequeña como un ejemplo extremo. Se querrá establecer *maxBytes* en un valor apropiado.

source: Use of alternative formatting styles
es: Uso de estilos de formato alternativos

source: When logging was added to the Python standard library, the only way of formatting messages with variable content was to use the %-formatting method. Since then, Python has gained two new formatting approaches: :class:`string.Template` (added in Python 2.4) and :meth:`str.format` (added in Python 2.6).
es: Cuando se agregó logging a la biblioteca estándar de Python, la única forma de formatear mensajes con contenido variable era usar el método de formateo %. Desde entonces, Python ha ganado dos nuevos enfoques de formato: :class:`string.Template` (agregado en Python 2.4) y :meth:`str.format` (agregado en Python 2.6).

source: Logging (as of 3.2) provides improved support for these two additional formatting styles. The :class:`Formatter` class been enhanced to take an additional, optional keyword parameter named ``style``. This defaults to ``'%'``, but other possible values are ``'{'`` and ``'$'``, which correspond to the other two formatting styles. Backwards compatibility is maintained by default (as you would expect), but by explicitly specifying a style parameter, you get the ability to specify format strings which work with :meth:`str.format` or :class:`string.Template`. Here's an example console session to show the possibilities:
es: Logging (a partir de la versión 3.2) proporciona un soporte mejorado para estos dos estilos de formato adicionales. La clase :class:`Formatter` ha sido mejorada para tomar un parámetro de palabra clave adicional llamado ``style``. El valor predeterminado es ``'%'``, pero otros valores posibles son ``'{'`` y ``'$'``, que corresponden a los otros dos estilos de formato. La compatibilidad con versiones anteriores se mantiene de forma predeterminada (como era de esperar), pero al especificar explícitamente un parámetro de estilo, tiene la capacidad de especificar cadenas de formato que funcionan con :meth:`str.format` o :class:`string.Template`. Aquí hay una sesión de consola de ejemplo para mostrar las posibilidades:

source: Note that the formatting of logging messages for final output to logs is completely independent of how an individual logging message is constructed. That can still use %-formatting, as shown here::
es: Tenga en cuenta que el formato de logging para la salida final a los logs es completamente independiente de cómo se construye un mensaje de logging individual. Para eso todavía puede usar el formateo %, como se muestra aquí:
