Repository: python/python-docs-es
Catalog: howto/pyporting.po
Languages: es

source: Porting Python 2 Code to Python 3
es: Portando código de Python 2 a Python 3

source: author
es: autor

source: Abstract
es: Resumen

source: With Python 3 being the future of Python while Python 2 is still in active use, it is good to have your project available for both major releases of Python. This guide is meant to help you figure out how best to support both Python 2 & 3 simultaneously.
es: Dado que Python 3 es el futuro de Python mientras Python 2 todavía está en uso activo, es bueno tener su proyecto disponible para ambas versiones principales de Python. Esta guía está diseñada para ayudarle a averiguar la mejor manera de admitir Python 2 y 3 simultáneamente.

source: If you are looking to port an extension module instead of pure Python code, please see :ref:`cporting-howto`.
es: Si está buscando portar un módulo de extensión en lugar de código Python puro, consulte :ref:`cporting-howto`.

source: If you would like to read one core Python developer's take on why Python 3 came into existence, you can read Nick Coghlan's `Python 3 Q & A`_ or Brett Cannon's `Why Python 3 exists`_.
es: Si desea leer la versión de un desarrollador de Python fundamental sobre por qué Python 3 surgió, puede leer `Python 3 Q & A`_ de Nick Coghlan o `Why Python 3 exists`_ de Brett Cannon

source: For help with porting, you can email the python-porting_ mailing list with questions.
es: Para obtener ayuda con la migración, puede enviar un correo electrónico a la lista de correo de python-porting_ con preguntas.

source: The Short Explanation
es: La breve explicación

source: To make your project be single-source Python 2/3 compatible, the basic steps are:
es: Para que su proyecto sea compatible con Python 2/3 de una sola fuente, los pasos básicos son:

source: Only worry about supporting Python 2.7
es: Sólo preocúpate por admitir Python 2.7

source: Make sure you have good test coverage (coverage.py_ can help; ``pip install coverage``)
es: Asegúrese de tener una buena cobertura de prueba (coverage.py_ puede ayudar; ``pip install coverage``)

source: Learn the differences between Python 2 & 3
es: Aprende las diferencias entre Python 2 & 3

source: Use Futurize_ (or Modernize_) to update your code (e.g. ``pip install future``)
es: Utilice Futurize_ (o Modernize_) para actualizar el código (por ejemplo, ``pip install future``)

source: Use Pylint_ to help make sure you don't regress on your Python 3 support (``pip install pylint``)
es: Utilice Pylint_ para asegurarse de que no retrocede en la compatibilidad con Python 3 (``pip install pylint``)

source: Use caniusepython3_ to find out which of your dependencies are blocking your use of Python 3 (``pip install caniusepython3``)
es: Utilice caniusepython3_ para averiguar cuáles de sus dependencias están bloqueando el uso de Python 3 (``pip install caniusepython3``)

source: Once your dependencies are no longer blocking you, use continuous integration to make sure you stay compatible with Python 2 & 3 (tox_ can help test against multiple versions of Python; ``pip install tox``)
es: Una vez que sus dependencias ya no le estén bloqueando, utilice la integración continua para asegurarse de que sigue siendo compatible con Python 2 & 3 (tox_ puede ayudar a probar con varias versiones de Python; ``pip install tox``)

source: Consider using optional static type checking to make sure your type usage works in both Python 2 & 3 (e.g. use mypy_ to check your typing under both Python 2 & Python 3).
es: Considere la posibilidad de usar la comprobación de tipos estáticos opcional para asegurarse de que el uso de tipos funciona tanto en Python 2 como 3 (por ejemplo, utilice mypy_ para comprobar la escritura en Python 2 y Python 3).

source: Details
es: Detalles

source: A key point about supporting Python 2 & 3 simultaneously is that you can start **today**! Even if your dependencies are not supporting Python 3 yet that does not mean you can't modernize your code **now** to support Python 3. Most changes required to support Python 3 lead to cleaner code using newer practices even in Python 2 code.
es: Un punto clave sobre el soporte de Python 2 & 3 simultáneamente es que se puede empezar **hoy**! Incluso si sus dependencias no son compatibles con Python 3 todavía eso no significa que no puede modernizar el código **ahora** para admitir Python 3. La mayoría de los cambios necesarios para admitir Python 3 conducen a código más limpio utilizando prácticas más recientes incluso en código Python 2.

source: Another key point is that modernizing your Python 2 code to also support Python 3 is largely automated for you. While you might have to make some API decisions thanks to Python 3 clarifying text data versus binary data, the lower-level work is now mostly done for you and thus can at least benefit from the automated changes immediately.
es: Otro punto clave es que la modernización del código de Python 2 para que también admita Python 3 está en gran medida automatizada para usted. Si bien es posible que tenga que tomar algunas decisiones de API gracias a python 3 aclarando los datos de texto frente a los datos binarios, el trabajo de nivel inferior ahora se realiza principalmente por usted y, por lo tanto, al menos puede beneficiarse de los cambios automatizados inmediatamente.

source: Keep those key points in mind while you read on about the details of porting your code to support Python 2 & 3 simultaneously.
es: Tenga en cuenta esos puntos clave mientras lee sobre los detalles de la migración del código para admitir Python 2 & 3 simultáneamente.

source: Drop support for Python 2.6 and older
es: Compatibilidad con Python 2.6 y versiones anteriores

source: While you can make Python 2.5 work with Python 3, it is **much** easier if you only have to work with Python 2.7. If dropping Python 2.5 is not an option then the six_ project can help you support Python 2.5 & 3 simultaneously (``pip install six``). Do realize, though, that nearly all the projects listed in this HOWTO will not be available to you.
es: Aunque puede hacer que Python 2.5 funcione con Python 3, es **mucho** más fácil si solo tiene que trabajar con Python 2.7. Si soltar Python 2.5 no es una opción, el proyecto de six_ puede ayudarlo a admitir Python 2.5 & 3 simultáneamente (``pip install six``). Sin embargo, tenga en cuenta que casi todos los proyectos enumerados en este HOWTO no estarán disponibles para usted.

source: If you are able to skip Python 2.5 and older, then the required changes to your code should continue to look and feel like idiomatic Python code. At worst you will have to use a function instead of a method in some instances or have to import a function instead of using a built-in one, but otherwise the overall transformation should not feel foreign to you.
es: Si puede omitir Python 2.5 y versiones anteriores, los cambios necesarios en el código deben seguir pareciendo código Python idiomático. En el peor de los casos tendrá que utilizar una función en lugar de un método en algunos casos o tendrá que importar una función en lugar de usar una integrada, pero de lo contrario la transformación general no debería sentirse ajena a usted.

source: But you should aim for only supporting Python 2.7. Python 2.6 is no longer freely supported and thus is not receiving bugfixes. This means **you** will have to work around any issues you come across with Python 2.6. There are also some tools mentioned in this HOWTO which do not support Python 2.6 (e.g., Pylint_), and this will become more commonplace as time goes on. It will simply be easier for you if you only support the versions of Python that you have to support.
es: Pero usted debe apuntar a sólo apoyar Python 2.7. Python 2.6 ya no se admite libremente y, por lo tanto, no recibe correcciones de errores. Esto significa que **usted** tendrá que solucionar cualquier problema que encuentre con Python 2.6. También hay algunas herramientas mencionadas en este HOWTO que no son compatibles con Python 2.6 (por ejemplo, Pylint_), y esto se volverá más común a medida que pasa el tiempo. Simplemente será más fácil para usted si sólo admite las versiones de Python que tiene que admitir.

source: Make sure you specify the proper version support in your ``setup.py`` file
es: Asegúrese de especificar el soporte de versión adecuado en su archivo ``setup.py``

source: In your ``setup.py`` file you should have the proper `trove classifier`_ specifying what versions of Python you support. As your project does not support Python 3 yet you should at least have ``Programming Language :: Python :: 2 :: Only`` specified. Ideally you should also specify each major/minor version of Python that you do support, e.g. ``Programming Language :: Python :: 2.7``.
es: En su archivo ``setup.py`` debe tener el `trove classifier`_ adecuado especificando qué versiones de Python admite. Como su proyecto no es compatible con Python 3, al menos debe tener ``Programming Language :: Python :: 2 :: Only`` especificado. Idealmente también debe especificar cada versión principal/menor de Python que admita, por ejemplo, ``Programming Language :: Python :: 2.7``.

source: Have good test coverage
es: Tener una buena cobertura de prueba

source: Once you have your code supporting the oldest version of Python 2 you want it to, you will want to make sure your test suite has good coverage. A good rule of thumb is that if you want to be confident enough in your test suite that any failures that appear after having tools rewrite your code are actual bugs in the tools and not in your code. If you want a number to aim for, try to get over 80% coverage (and don't feel bad if you find it hard to get better than 90% coverage). If you don't already have a tool to measure test coverage then coverage.py_ is recommended.
es: Una vez que tenga el código que admita la versión más antigua de Python 2 que desee, querrá asegurarse de que su conjunto de pruebas tenga una buena cobertura. Una buena regla general es que si desea tener la confianza suficiente en el conjunto de pruebas que los errores que aparecen después de tener herramientas reescriben el código son errores reales en las herramientas y no en el código. Si desea que un número para apuntar, trate de obtener más del 80% de cobertura (y no se sienta mal si le resulta difícil obtener una cobertura superior al 90%). Si aún no tiene una herramienta para medir la cobertura de la prueba, se recomienda coverage.py_.

source: Once you have your code well-tested you are ready to begin porting your code to Python 3! But to fully understand how your code is going to change and what you want to look out for while you code, you will want to learn what changes Python 3 makes in terms of Python 2. Typically the two best ways of doing that is reading the :ref:`"What's New" <whatsnew-index>` doc for each release of Python 3 and the `Porting to Python 3`_ book (which is free online). There is also a handy `cheat sheet`_ from the Python-Future project.
es: Una vez que tenga su código bien probado, ¡está listo para comenzar a migrar su código a Python 3! Pero para comprender completamente cómo va a cambiar el código y qué desea tener en cuenta mientras codifica, querrá aprender qué cambios produce Python 3 en términos de Python 2. Típicamente las dos mejores maneras de hacer eso es leer la documentación :ref:`"What's New" <whatsnew-index>` para cada versión de Python 3 y el libro `Porting to Python 3`_ (que es gratis en línea). También hay una práctica `cheat sheet`_ del proyecto Python-Future.</whatsnew-index>.

source: Update your code
es: Actualiza tu código

source: Once you feel like you know what is different in Python 3 compared to Python 2, it's time to update your code! You have a choice between two tools in porting your code automatically: Futurize_ and Modernize_. Which tool you choose will depend on how much like Python 3 you want your code to be. Futurize_ does its best to make Python 3 idioms and practices exist in Python 2, e.g. backporting the ``bytes`` type from Python 3 so that you have semantic parity between the major versions of Python. Modernize_, on the other hand, is more conservative and targets a Python 2/3 subset of Python, directly relying on six_ to help provide compatibility. As Python 3 is the future, it might be best to consider Futurize to begin adjusting to any new practices that Python 3 introduces which you are not accustomed to yet.
es: Una vez que sientas que sabes lo que es diferente en Python 3 en comparación con Python 2, ¡es hora de actualizar tu código! Puede elegir entre dos herramientas para migrar el código automáticamente: Futurize_ y Modernize_. La herramienta que elija dependerá de la cantidad similar a Python 3 que desea que sea el código. Futurize_ hace todo lo posible para que Python 3 modismos y prácticas existan en Python 2, por ejemplo, backporting el tipo ``bytes`` de Python 3 para que tenga paridad semántica entre las versiones principales de Python. Modernize_, por otro lado, es más conservador y se dirige a un subconjunto de Python 2/3 de Python, basándose directamente en six_ para ayudar a proporcionar compatibilidad. Como Python 3 es el futuro, podría ser mejor considerar Futurize para comenzar a adaptarse a cualquier nueva práctica que Python 3 introduce a la que aún no está acostumbrado.

source: Regardless of which tool you choose, they will update your code to run under Python 3 while staying compatible with the version of Python 2 you started with. Depending on how conservative you want to be, you may want to run the tool over your test suite first and visually inspect the diff to make sure the transformation is accurate. After you have transformed your test suite and verified that all the tests still pass as expected, then you can transform your application code knowing that any tests which fail is a translation failure.
es: Independientemente de la herramienta que elija, actualizarán el código para que se ejecute en Python 3 mientras se mantienen compatibles con la versión de Python 2 con la que comenzó. Dependiendo de lo conservador que desee ser, es posible que desee ejecutar la herramienta sobre el conjunto de pruebas primero e inspeccionar visualmente la diferencia para asegurarse de que la transformación es precisa. Después de transformar el conjunto de pruebas y comprobar que todas las pruebas siguen pasando según lo esperado, puede transformar el código de la aplicación sabiendo que cualquier prueba que falle es un error de traducción.

source: Unfortunately the tools can't automate everything to make your code work under Python 3 and so there are a handful of things you will need to update manually to get full Python 3 support (which of these steps are necessary vary between the tools). Read the documentation for the tool you choose to use to see what it fixes by default and what it can do optionally to know what will (not) be fixed for you and what you may have to fix on your own (e.g. using ``io.open()`` over the built-in ``open()`` function is off by default in Modernize). Luckily, though, there are only a couple of things to watch out for which can be considered large issues that may be hard to debug if not watched for.
es: Desafortunadamente, las herramientas no pueden automatizar todo para que su código funcione bajo Python 3 y por lo que hay un puñado de cosas que tendrá que actualizar manualmente para obtener soporte completo de Python 3 (cuáles de estos pasos son necesarios varían entre las herramientas). Lea la documentación de la herramienta que elige utilizar para ver lo que corrige de forma predeterminada y lo que puede hacer opcionalmente para saber lo que (no) se fijará para usted y lo que puede tener que corregir por su cuenta (por ejemplo, usando ``io.open()`` sobre la función incorporada ``open()`` está desactivada por defecto en Modernizar). Afortunadamente, sin embargo, sólo hay un par de cosas a tener en cuenta por las cuales se pueden considerar grandes problemas que pueden ser difíciles de depurar si no se observan.

source: Division
es: División

source: In Python 3, ``5 / 2 == 2.5`` and not ``2``; all division between ``int`` values result in a ``float``. This change has actually been planned since Python 2.2 which was released in 2002. Since then users have been encouraged to add ``from __future__ import division`` to any and all files which use the ``/`` and ``//`` operators or to be running the interpreter with the ``-Q`` flag. If you have not been doing this then you will need to go through your code and do two things:
es: En Python 3, ``5 / 2 == 2.5`` y no ``2``; toda división entre los valores ``int`` da lugar a un ``float``. Este cambio ha sido planeado desde Python 2.2, que fue lanzado en 2002. Desde entonces, se ha alentado a los usuarios a añadir ``from __future__ import division`` a todos y cada uno de los archivos que utilizan los operadores ``/`` y ``//`` o que ejecuten el intérprete con el indicador ``-Q``. Si no ha estado haciendo esto, entonces tendrá que ir a través de su código y hacer dos cosas:

source: Add ``from __future__ import division`` to your files
es: Añadir ``from __future__ import division`` a sus archivos

source: Update any division operator as necessary to either use ``//`` to use floor division or continue using ``/`` and expect a float
es: Actualice cualquier operador de división según sea necesario para utilizar ``//`` para usar la división de suelo o continuar usando ``/`` y esperar un número flotante

source: The reason that ``/`` isn't simply translated to ``//`` automatically is that if an object defines a ``__truediv__`` method but not ``__floordiv__`` then your code would begin to fail (e.g. a user-defined class that uses ``/`` to signify some operation but not ``//`` for the same thing or at all).
es: La razón por la que ``/`` no se traduce simplemente a ``//`` automáticamente es que si un objeto define un método ``__truediv__`` pero no ``__floordiv__`` entonces su código comenzaría a fallar (por ejemplo, una clase definida por el usuario que utiliza ``/`` para significar alguna operación pero no ``//`` para la misma cosa o en absoluto).

source: Text versus binary data
es: Texto frente a datos binarios

source: In Python 2 you could use the ``str`` type for both text and binary data. Unfortunately this confluence of two different concepts could lead to brittle code which sometimes worked for either kind of data, sometimes not. It also could lead to confusing APIs if people didn't explicitly state that something that accepted ``str`` accepted either text or binary data instead of one specific type. This complicated the situation especially for anyone supporting multiple languages as APIs wouldn't bother explicitly supporting ``unicode`` when they claimed text data support.
es: En Python 2 puede usar el tipo ``str`` tanto para texto como para datos binarios. Desafortunadamente, esta confluencia de dos conceptos diferentes podría conducir a código frágil que a veces funcionaba para cualquier tipo de datos, a veces no. También podría dar lugar a API confusas si las personas no declaraban explícitamente que algo que aceptaba ``str`` aceptaba datos binarios o de texto en lugar de un tipo específico. Esto complicó la situación especialmente para cualquier persona que admita varios idiomas, ya que las API no se molestarían explícitamente en admitir explícitamente ``Unicode`` cuando reclamaban compatibilidad con datos de texto.

source: To make the distinction between text and binary data clearer and more pronounced, Python 3 did what most languages created in the age of the internet have done and made text and binary data distinct types that cannot blindly be mixed together (Python predates widespread access to the internet). For any code that deals only with text or only binary data, this separation doesn't pose an issue. But for code that has to deal with both, it does mean you might have to now care about when you are using text compared to binary data, which is why this cannot be entirely automated.
es: Para hacer la distinción entre texto y datos binarios más claros y pronunciados, Python 3 hizo lo que la mayoría de los lenguajes creados en la era de Internet han hecho y ha hecho texto y datos binarios distintos tipos que no se pueden mezclar ciegamente (Python es anterior al acceso generalizado a Internet). Para cualquier código que se ocupe solo de texto o solo de datos binarios, esta separación no plantea un problema. Pero para el código que tiene que lidiar con ambos, significa que es posible que tenga que preocuparse ahora cuando está utilizando texto en comparación con los datos binarios, por lo que esto no se puede automatizar por completo.

source: To start, you will need to decide which APIs take text and which take binary (it is **highly** recommended you don't design APIs that can take both due to the difficulty of keeping the code working; as stated earlier it is difficult to do well). In Python 2 this means making sure the APIs that take text can work with ``unicode`` and those that work with binary data work with the ``bytes`` type from Python 3 (which is a subset of ``str`` in Python 2 and acts as an alias for ``bytes`` type in Python 2). Usually the biggest issue is realizing which methods exist on which types in Python 2 & 3 simultaneously (for text that's ``unicode`` in Python 2 and ``str`` in Python 3, for binary that's ``str``/``bytes`` in Python 2 and ``bytes`` in Python 3). The following table lists the **unique** methods of each data type across Python 2 & 3 (e.g., the ``decode()`` method is usable on the equivalent binary data type in either Python 2 or 3, but it can't be used by the textual data type consistently between Python 2 and 3 because ``str`` in Python 3 doesn't have the method). Do note that as of Python 3.5 the ``__mod__`` method was added to the bytes type.
es: Para empezar, tendrá que decidir qué API toman texto y cuáles toman binario (es **altamente** recomendado no diseñar API que pueden tomar ambos debido a la dificultad de mantener el código funcionando; como se indicó anteriormente es difícil hacerlo bien). En Python 2 esto significa asegurarse de que las API que toman texto pueden trabajar con ``unicode`` y las que funcionan con datos binarios funcionan con el tipo ``bytes`` de Python 3 (que es un subconjunto de ``str`` en Python 2 y actúa como un alias para ``bytes`` tipo en Python 2). Por lo general, el mayor problema es darse cuenta de qué métodos existen en qué tipos en Python 2 y 3 simultáneamente (para el texto que es ``Unicode`` en Python 2 y ``str`` en Python 3, para binario que es ``str``/``bytes`` en Python 2 y ``bytes`` en Python 3). En la tabla siguiente se enumeran los métodos **unicos** de cada tipo de datos en Python 2 y 3 (por ejemplo, el método ``decode()`` se puede utilizar en el tipo de datos binarios equivalente en Python 2 o 3, pero no puede ser utilizado por el tipo de datos textuales consistentemente entre Python 2 y 3 porque ``str`` en Python 3 no tiene el método). Tenga en cuenta que a partir de Python 3.5 se agregó el método ``__mod__`` al tipo bytes.

source: **Text data**
es: **Datos de texto**

source: **Binary data**
es: **Datos binarios**
