Repository: python/python-docs-es
Catalog: howto/pyporting.po
Languages: es

source: Making the distinction easier to handle can be accomplished by encoding and decoding between binary data and text at the edge of your code. This means that when you receive text in binary data, you should immediately decode it. And if your code needs to send text as binary data then encode it as late as possible. This allows your code to work with only text internally and thus eliminates having to keep track of what type of data you are working with.
es: La creación de la distinción más fácil de controlar se puede realizar mediante la codificación y descodificación entre datos binarios y texto en el borde del código. Esto significa que cuando reciba texto en datos binarios, debe descodificarlo inmediatamente. Y si el código necesita enviar texto como datos binarios, codificarlo lo más tarde posible. Esto permite que el código funcione solo con texto internamente y, por lo tanto, elimina tener que realizar un seguimiento del tipo de datos con los que está trabajando.

source: The next issue is making sure you know whether the string literals in your code represent text or binary data. You should add a ``b`` prefix to any literal that presents binary data. For text you should add a ``u`` prefix to the text literal. (there is a :mod:`__future__` import to force all unspecified literals to be Unicode, but usage has shown it isn't as effective as adding a ``b`` or ``u`` prefix to all literals explicitly)
es: El siguiente problema es asegurarse de saber si los literales de cadena en el código representan texto o datos binarios. Debe agregar un prefijo ``b`` a cualquier literal que presente datos binarios. Para el texto debe agregar un prefijo ``u`` al literal de texto. (hay una importación :mod:`__future__` para forzar que todos los literales no especificados sean Unicode, pero el uso ha demostrado que no es tan eficaz como agregar un prefijo ``b`` o ``u`` a todos los literales explícitamente)

source: As part of this dichotomy you also need to be careful about opening files. Unless you have been working on Windows, there is a chance you have not always bothered to add the ``b`` mode when opening a binary file (e.g., ``rb`` for binary reading). Under Python 3, binary files and text files are clearly distinct and mutually incompatible; see the :mod:`io` module for details. Therefore, you **must** make a decision of whether a file will be used for binary access (allowing binary data to be read and/or written) or textual access (allowing text data to be read and/or written). You should also use :func:`io.open` for opening files instead of the built-in :func:`open` function as the :mod:`io` module is consistent from Python 2 to 3 while the built-in :func:`open` function is not (in Python 3 it's actually :func:`io.open`). Do not bother with the outdated practice of using :func:`codecs.open` as that's only necessary for keeping compatibility with Python 2.5.
es: Como parte de esta dicotomía también hay que tener cuidado con la apertura de archivos. A menos que haya estado trabajando en Windows, existe la posibilidad de que no siempre se haya molestado en agregar el modo ``b`` al abrir un archivo binario (por ejemplo, ``rb`` para la lectura binaria). En Python 3, los archivos binarios y los archivos de texto son claramente distintos y mutuamente incompatibles; ver el módulo :mod:`io` para más detalles. Por lo tanto, **debe** tomar una decisión de si un archivo se utilizará para el acceso binario (permitiendo que los datos binarios se lean y/o escriban) o el acceso textual (permitiendo que los datos de texto sean leídos y/o escritos). También debe utilizar :func:`io.open` para abrir archivos en lugar de la función incorporada :func:`open` como el módulo :mod:`io` es consistente de Python 2 a 3, mientras que la función incorporada :func:`open` no es (en Python 3 es en realidad :func:`io.open`). No se moleste con la práctica obsoleta de usar :func:`codecs.open` ya que sólo es necesario para mantener la compatibilidad con Python 2.5.

source: The constructors of both ``str`` and ``bytes`` have different semantics for the same arguments between Python 2 & 3. Passing an integer to ``bytes`` in Python 2 will give you the string representation of the integer: ``bytes(3) == '3'``. But in Python 3, an integer argument to ``bytes`` will give you a bytes object as long as the integer specified, filled with null bytes: ``bytes(3) == b'\x00\x00\x00'``. A similar worry is necessary when passing a bytes object to ``str``. In Python 2 you just get the bytes object back: ``str(b'3') == b'3'``. But in Python 3 you get the string representation of the bytes object: ``str(b'3') == "b'3'"``.
es: Los constructores de ``str`` y ``bytes`` tienen una semántica diferente para los mismos argumentos entre Python 2 y 3. Pasar un entero a ``bytes`` en Python 2 le dará la representación de cadena de texto del entero: ``bytes(3) == '3'``. Pero en Python 3, un argumento entero para ''bytes'' le dará un objeto bytes siempre y cuando el entero especificado, lleno de bytes nulos: ``bytes(3) == b'\x00\x00\x00'``. Una preocupación similar es necesaria cuando se pasa un objeto bytes a ``str``. En Python 2, solo se obtiene el objeto bytes: ``str(b'3') == b'3'``. Pero en Python 3 se obtiene la representación de cadena de texto del objeto bytes: ``str(b'3') == "b'3'"``.

source: Finally, the indexing of binary data requires careful handling (slicing does **not** require any special handling). In Python 2, ``b'123'[1] == b'2'`` while in Python 3 ``b'123'[1] == 50``. Because binary data is simply a collection of binary numbers, Python 3 returns the integer value for the byte you index on. But in Python 2 because ``bytes == str``, indexing returns a one-item slice of bytes. The six_ project has a function named ``six.indexbytes()`` which will return an integer like in Python 3: ``six.indexbytes(b'123', 1)``.
es: Por último, la indexación de datos binarios requiere un control cuidadoso (el corte **no** requiere ningún control especial). En Python 2, ``b'123'[1] == b'2'`` mientras que en Python 3 ``b'123'[1] == 50``. Dado que los datos binarios son simplemente una colección de números binarios, Python 3 devuelve el valor entero para el byte en el que indexa. Pero en Python 2, ya que ``bytes == str``, la indexación devuelve un segmento de bytes de un solo elemento. El proyecto six_ tiene una función denominada ``six.indexbytes()`` que devolverá un entero como en Python 3: ``six.indexbytes(b'123', 1)``.

source: To summarize:
es: Para resumir:

source: Decide which of your APIs take text and which take binary data
es: Decida cuál de sus API toma texto y cuáles toman datos binarios

source: Make sure that your code that works with text also works with ``unicode`` and code for binary data works with ``bytes`` in Python 2 (see the table above for what methods you cannot use for each type)
es: Asegúrese de que el código que funciona con texto también funciona con ``unicode`` y el código para datos binarios funciona con ``bytes`` en Python 2 (consulte la tabla anterior para los métodos que no puede usar para cada tipo)

source: Mark all binary literals with a ``b`` prefix, textual literals with a ``u`` prefix
es: Marque todos los literales binarios con un prefijo ``b``, literales textuales con un prefijo ``u``

source: Decode binary data to text as soon as possible, encode text as binary data as late as possible
es: Descodificar datos binarios en texto tan pronto como sea posible, codificar texto como datos binarios tan tarde como sea posible

source: Open files using :func:`io.open` and make sure to specify the ``b`` mode when appropriate
es: Abra los archivos con :func:`io.open` y asegúrese de especificar el modo ``b`` cuando sea apropiado

source: Be careful when indexing into binary data
es: Tenga cuidado al indexar en datos binarios

source: Use feature detection instead of version detection
es: Utilice la detección de funciones en lugar de la detección de versiones

source: Inevitably you will have code that has to choose what to do based on what version of Python is running. The best way to do this is with feature detection of whether the version of Python you're running under supports what you need. If for some reason that doesn't work then you should make the version check be against Python 2 and not Python 3. To help explain this, let's look at an example.
es: Inevitablemente tendrá código que tiene que elegir qué hacer en función de qué versión de Python se está ejecutando. La mejor manera de hacerlo es con la detección de características de si la versión de Python en la que se ejecuta es compatible con lo que necesita. Si por alguna razón eso no funciona, entonces usted debe hacer que la comprobación de la versión sea contra Python 2 y no Python 3. Para ayudar a explicar esto, veamos un ejemplo.

source: Let's pretend that you need access to a feature of :mod:`importlib` that is available in Python's standard library since Python 3.3 and available for Python 2 through importlib2_ on PyPI. You might be tempted to write code to access e.g. the :mod:`importlib.abc` module by doing the following::
es: Supongamos que necesita acceso a una característica de :mod:`importlib` que está disponible en la biblioteca estándar de Python desde Python 3.3 y disponible para Python 2 a través de importlib2_ en PyPI. Es posible que tenga la tentación de escribir código para acceder, por ejemplo, al módulo :mod:`importlib.abc` haciendo lo siguiente:

source: The problem with this code is what happens when Python 4 comes out? It would be better to treat Python 2 as the exceptional case instead of Python 3 and assume that future Python versions will be more compatible with Python 3 than Python 2::
es: El problema con este código es ¿qué sucede cuando sale Python 4? Sería mejor tratar Python 2 como el caso excepcional en lugar de Python 3 y asumir que las futuras versiones de Python serán más compatibles con Python 3 que Python 2::

source: The best solution, though, is to do no version detection at all and instead rely on feature detection. That avoids any potential issues of getting the version detection wrong and helps keep you future-compatible::
es: La mejor solución, sin embargo, es no hacer ninguna detección de versiones en absoluto y en su lugar confiar en la detección de características. Esto evita cualquier problema potencial de conseguir la detección de la versión incorrecta y le ayuda a mantenerse compatible con el futuro:

source: Prevent compatibility regressions
es: Evitar regresiones de compatibilidad

source: Once you have fully translated your code to be compatible with Python 3, you will want to make sure your code doesn't regress and stop working under Python 3. This is especially true if you have a dependency which is blocking you from actually running under Python 3 at the moment.
es: Una vez que haya traducido completamente el código para que sea compatible con Python 3, querrá asegurarse de que el código no retroceda y deje de funcionar bajo Python 3. Esto es especialmente cierto si tiene una dependencia que le está bloqueando para que no se ejecute realmente en Python 3 en este momento.

source: To help with staying compatible, any new modules you create should have at least the following block of code at the top of it::
es: Para ayudar a mantenerse compatible, los módulos nuevos que cree deben tener al menos el siguiente bloque de código en la parte superior del misma::

source: You can also run Python 2 with the ``-3`` flag to be warned about various compatibility issues your code triggers during execution. If you turn warnings into errors with ``-Werror`` then you can make sure that you don't accidentally miss a warning.
es: También puede ejecutar Python 2 con el indicador ``-3`` para recibir una advertencia sobre varios problemas de compatibilidad que el código desencadena durante la ejecución. Si convierte las advertencias en errores con ``-Werror``, puede asegurarse de que no se pierda accidentalmente una advertencia.

source: You can also use the Pylint_ project and its ``--py3k`` flag to lint your code to receive warnings when your code begins to deviate from Python 3 compatibility. This also prevents you from having to run Modernize_ or Futurize_ over your code regularly to catch compatibility regressions. This does require you only support Python 2.7 and Python 3.4 or newer as that is Pylint's minimum Python version support.
es: También puede usar el proyecto de Pylint_ y su indicador ``--py3k`` para lintar el código para recibir advertencias cuando el código comienza a desviarse de la compatibilidad con Python 3. Esto también evita que tenga que ejecutar Modernize_ o Futurize_ sobre el código con regularidad para detectar las regresiones de compatibilidad. Esto requiere que solo admita Python 2.7 y Python 3.4 o posterior, ya que es la compatibilidad mínima de la versión mínima de Python de Pylint.

source: Check which dependencies block your transition
es: Compruebe qué dependencias bloquean la transición

source: **After** you have made your code compatible with Python 3 you should begin to care about whether your dependencies have also been ported. The caniusepython3_ project was created to help you determine which projects -- directly or indirectly -- are blocking you from supporting Python 3. There is both a command-line tool as well as a web interface at https://caniusepython3.com.
es: **Después** de que haya hecho que su código sea compatible con Python 3, debe empezar a preocuparse por si sus dependencias también se han portado. El proyecto caniusepython3_ se creó para ayudarle a determinar qué proyectos -- directa o indirectamente -- le impiden admitir Python 3. Hay una herramienta de línea de comandos, así como una interfaz web en https://caniusepython3.com.

source: The project also provides code which you can integrate into your test suite so that you will have a failing test when you no longer have dependencies blocking you from using Python 3. This allows you to avoid having to manually check your dependencies and to be notified quickly when you can start running on Python 3.
es: El proyecto también proporciona código que puede integrar en el conjunto de pruebas para que tenga una prueba con errores cuando ya no tenga dependencias que le impidan usar Python 3. Esto le permite evitar tener que comprobar manualmente sus dependencias y recibir notificaciones rápidamente cuando puede empezar a ejecutarse en Python 3.

source: Update your ``setup.py`` file to denote Python 3 compatibility
es: Actualice su archivo ``setup.py`` para denotar compatibilidad con Python 3

source: Once your code works under Python 3, you should update the classifiers in your ``setup.py`` to contain ``Programming Language :: Python :: 3`` and to not specify sole Python 2 support. This will tell anyone using your code that you support Python 2 **and** 3. Ideally you will also want to add classifiers for each major/minor version of Python you now support.
es: Una vez que el código funciona en Python 3, debe actualizar los clasificadores en su ``setup.py`` para que contenga ``Programming Language :: Python :: 3`` y no especificar solo compatibilidad con Python 2. Esto le dirá a cualquier persona que use su código que admite Python 2 **y** 3. Lo ideal es que también desee agregar clasificadores para cada versión principal/menor de Python que ahora admita.

source: Use continuous integration to stay compatible
es: Utilice la integración continua para seguir siendo compatible

source: Once you are able to fully run under Python 3 you will want to make sure your code always works under both Python 2 & 3. Probably the best tool for running your tests under multiple Python interpreters is tox_. You can then integrate tox with your continuous integration system so that you never accidentally break Python 2 or 3 support.
es: Una vez que pueda ejecutar completamente bajo Python 3, querrá asegurarse de que el código siempre funciona en Python 2 y 3. Probablemente la mejor herramienta para ejecutar las pruebas en varios intérpretes de Python es tox_. A continuación, puede integrar tox con su sistema de integración continua para que nunca interrumpa accidentalmente la compatibilidad con Python 2 o 3.

source: You may also want to use the ``-bb`` flag with the Python 3 interpreter to trigger an exception when you are comparing bytes to strings or bytes to an int (the latter is available starting in Python 3.5). By default type-differing comparisons simply return ``False``, but if you made a mistake in your separation of text/binary data handling or indexing on bytes you wouldn't easily find the mistake. This flag will raise an exception when these kinds of comparisons occur, making the mistake much easier to track down.
es: También es posible que desee utilizar el indicador ``-bb`` con el intérprete de Python 3 para desencadenar una excepción cuando se comparan bytes con cadenas o bytes con un int (este último está disponible a partir de Python 3.5). De forma predeterminada, las comparaciones de tipos diferentes simplemente devuelven ``False``, pero si cometió un error en la separación del control de datos de texto/binario o la indexación en bytes, no encontraría fácilmente el error. Esta marca generará una excepción cuando se produzcan este tipo de comparaciones, lo que hace que el error sea mucho más fácil de rastrear.

source: And that's mostly it! At this point your code base is compatible with both Python 2 and 3 simultaneously. Your testing will also be set up so that you don't accidentally break Python 2 or 3 compatibility regardless of which version you typically run your tests under while developing.
es: ¡Y eso es sobre todo! En este punto, la base de código es compatible con Python 2 y 3 simultáneamente. Las pruebas también se configurarán para que no interrumpa accidentalmente la compatibilidad de Python 2 o 3, independientemente de la versión en la que ejecute normalmente las pruebas durante el desarrollo.

source: Consider using optional static type checking
es: Considere la posibilidad de usar la comprobación de tipos estáticos opcionales

source: Another way to help port your code is to use a static type checker like mypy_ or pytype_ on your code. These tools can be used to analyze your code as if it's being run under Python 2, then you can run the tool a second time as if your code is running under Python 3. By running a static type checker twice like this you can discover if you're e.g. misusing binary data type in one version of Python compared to another. If you add optional type hints to your code you can also explicitly state whether your APIs use textual or binary data, helping to make sure everything functions as expected in both versions of Python.
es: Otra forma de ayudar a transferir el código es usar un comprobador de tipos estáticos como mypy_ o pytype_ en el código. Estas herramientas se pueden utilizar para analizar el código como si se estuviera ejecutando en Python 2, puede ejecutar la herramienta por segunda vez como si el código se ejecutara en Python 3. Al ejecutar un comprobador de tipos estáticos dos veces como este, puede descubrir si, por ejemplo, está usando incorrectamente el tipo de datos binarios en una versión de Python en comparación con otra. Si agrega sugerencias de tipo opcionales al código, también puede indicar explícitamente si las API usan datos textuales o binarios, lo que ayuda a asegurarse de que todo funciona según lo esperado en ambas versiones de Python.
