Repository: python/python-docs-es
Catalog: howto/regex.po
Languages: es

source: Usually ``^`` matches only at the beginning of the string, and ``$`` matches only at the end of the string and immediately before the newline (if any) at the end of the string. When this flag is specified, ``^`` matches at the beginning of the string and at the beginning of each line within the string, immediately following each newline. Similarly, the ``$`` metacharacter matches either at the end of the string and at the end of each line (immediately preceding each newline).
es: Por lo general, ``^`` coincide solo al principio de la cadena de caracteres, y ``$`` solo coincide con el final de la cadena de caracteres e inmediatamente antes del salto de línea (si existe) al final de la cadena de caracteres. Cuando se especifica esta bandera, ``^`` coincide al principio de la cadena y al comienzo de cada línea dentro de la cadena, inmediatamente después de cada nueva línea. De manera similar, el metacarácter ``$`` coincide al final de la cadena de caracteres y al final de cada línea (inmediatamente antes de cada nueva línea).

source: Makes the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
es: Hace que el carácter especial ``'.'`` coincida con cualquier carácter, incluida una nueva línea; sin esta bandera, ``'.'`` coincidirá con cualquier cosa *except* una nueva línea.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns.
es: Haga que ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` y ``\S`` realicen una coincidencia solo en ASCII en lugar de una coincidencia Unicode completa. Esto solo es significativo para los patrones Unicode y se ignora para los patrones de bytes.

source: This flag allows you to write regular expressions that are more readable by granting you more flexibility in how you can format them. When this flag has been specified, whitespace within the RE string is ignored, except when the whitespace is in a character class or preceded by an unescaped backslash; this lets you organize and indent the RE more clearly. This flag also lets you put comments within a RE that will be ignored by the engine; comments are marked by a ``'#'`` that's neither in a character class or preceded by an unescaped backslash.
es: Esta flag le permite escribir expresiones regulares que son más legibles al otorgarle más flexibilidad en cómo puede formatearlas. Cuando se ha especificado esta flag, los espacios en blanco dentro de la cadena de caracteres de la RE se ignoran, excepto cuando el espacio en blanco está en una clase de caracteres o está precedido por una barra invertida sin escape; esto le permite organizar e indentar la RE más claramente. Esta flag también le permite poner comentarios dentro de una RE que serán ignorados por el motor (*engine*); los comentarios están marcados con un ``'#'`` que no está en una clase de carácter ni está precedido por una barra invertida sin escape.

source: For example, here's a RE that uses :const:`re.VERBOSE`; see how much easier it is to read? ::
es: Por ejemplo, aquí hay una RE que usa :const:`re.VERBOSE`; ¿Ves lo fácil que es leer? ::

source: Without the verbose setting, the RE would look like this::
es: Sin la configuración detallada, la RE se vería así::

source: In the above example, Python's automatic concatenation of string literals has been used to break up the RE into smaller pieces, but it's still more difficult to understand than the version using :const:`re.VERBOSE`.
es: En el ejemplo anterior, la concatenación automática de cadenas de caracteres literales de Python se ha utilizado para dividir la RE en partes más pequeñas, pero aún es más difícil de entender que la versión que usa :const:`re.VERBOSE`.

source: More Pattern Power
es: Más poder de patrones

source: So far we've only covered a part of the features of regular expressions. In this section, we'll cover some new metacharacters, and how to use groups to retrieve portions of the text that was matched.
es: Hasta ahora solo hemos cubierto una parte de las características de las expresiones regulares. En esta sección, cubriremos algunos metacaracteres nuevos y cómo usar grupos para recuperar partes del texto que coincidió.

source: More Metacharacters
es: Más metacaracteres

source: There are some metacharacters that we haven't covered yet. Most of them will be covered in this section.
es: Hay algunos metacaracteres que aún no hemos cubierto. La mayoría de ellos se tratarán en esta sección.

source: Some of the remaining metacharacters to be discussed are :dfn:`zero-width assertions`. They don't cause the engine to advance through the string; instead, they consume no characters at all, and simply succeed or fail. For example, ``\b`` is an assertion that the current position is located at a word boundary; the position isn't changed by the ``\b`` at all. This means that zero-width assertions should never be repeated, because if they match once at a given location, they can obviously be matched an infinite number of times.
es: Algunos de los metacaracteres restantes que se discutirán son :dfn:`zero-width assertions`. No hacen que el motor avance a través de la cadena de caracteres; en cambio, no consumen caracteres en absoluto y simplemente tienen éxito o fracasan. Por ejemplo, ``\b`` es una flag de que la posición actual se encuentra en el límite de una palabra; la posición no cambia por la ``\b`` en absoluto. Esto significa que las aserciones de ancho cero nunca deben repetirse, porque si coinciden una vez en una ubicación determinada, obviamente pueden coincidir un número infinito de veces.

source: Alternation, or the "or" operator. If *A* and *B* are regular expressions, ``A|B`` will match any string that matches either *A* or *B*. ``|`` has very low precedence in order to make it work reasonably when you're alternating multi-character strings. ``Crow|Servo`` will match either ``'Crow'`` or ``'Servo'``, not ``'Cro'``, a ``'w'`` or an ``'S'``, and ``'ervo'``.
es: Alternancia, o el operador "or". Si *A* y *B* son expresiones regulares, ``A|B`` coincidirá con cualquier cadena de caracteres que coincida con *A* o *B*. ``|`` tiene una precedencia muy baja para que funcione razonablemente cuando está alternando cadenas de varios caracteres. ``Crow|Servo`` coincidirá con ``'Crow'`` o ``'Servo'``, no ``'Cro'``, un ``'w'`` o un ``'S'``, y ``'ervo'``.

source: To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
es: Para hacer coincidir un literal ``'|'``, use ``\|``, o enciérrelo dentro de una clase de carácter, como en ``[|]``.

source: Matches at the beginning of lines. Unless the :const:`MULTILINE` flag has been set, this will only match at the beginning of the string. In :const:`MULTILINE` mode, this also matches immediately after each newline within the string.
es: Coincide con el comienzo de las líneas. A menos que se haya establecido la flag :const:`MULTILINE` , esto solo coincidirá al principio de la cadena de caracteres. En modo :const:`MULTILINE` , esto también coincide inmediatamente después de cada nueva línea dentro de la cadena.

source: For example, if you wish to match the word ``From`` only at the beginning of a line, the RE to use is ``^From``. ::
es: Por ejemplo, si desea hacer coincidir la palabra ``From`` solo al principio de una línea, la RE que debe usar es ``^From``. ::

source: To match a literal ``'^'``, use ``\^``.
es: Para una coincidencia literal ``'^'``, usar ``\^``.

source: Matches at the end of a line, which is defined as either the end of the string, or any location followed by a newline character. ::
es: Coincide con el final de una línea, que se define como el final de la cadena o cualquier ubicación seguida de un carácter de nueva línea. ::

source: To match a literal ``'$'``, use ``\$`` or enclose it inside a character class, as in ``[$]``.
es: Para hacer coincidir un literal ``'$'``, usar ``\$`` o enciérrelo dentro de una clase de carácter, como en ``[$]``.

source: Matches only at the start of the string. When not in :const:`MULTILINE` mode, ``\A`` and ``^`` are effectively the same. In :const:`MULTILINE` mode, they're different: ``\A`` still matches only at the beginning of the string, but ``^`` may match at any location inside the string that follows a newline character.
es: Coincide solo al comienzo de la cadena de caracteres. Cuando no está en el modo :const:`MULTILINE`,``\A`` y ``^`` son efectivamente lo mismo. En el modo :const:`MULTILINE`, son diferentes: ``\A`` todavía coincide solo al principio de la cadena, pero ``^`` puede coincidir en cualquier ubicación dentro de la cadena de caracteres que sigue a un carácter de nueva línea.

source: Matches only at the end of the string.
es: Coincidencias solo al final de la cadena de caracteres.

source: Word boundary. This is a zero-width assertion that matches only at the beginning or end of a word. A word is defined as a sequence of alphanumeric characters, so the end of a word is indicated by whitespace or a non-alphanumeric character.
es: Límite de palabra. Esta es una aserción de ancho cero que coincide solo al principio o al final de una palabra. Una palabra se define como una secuencia de caracteres alfanuméricos, por lo que el final de una palabra se indica mediante un espacio en blanco o un carácter no alfanumérico.

source: The following example matches ``class`` only when it's a complete word; it won't match when it's contained inside another word. ::
es: El siguiente ejemplo coincide con ``class`` solo cuando es una palabra completa; no coincidirá cuando esté contenido dentro de otra palabra. ::

source: There are two subtleties you should remember when using this special sequence. First, this is the worst collision between Python's string literals and regular expression sequences. In Python's string literals, ``\b`` is the backspace character, ASCII value 8. If you're not using raw strings, then Python will convert the ``\b`` to a backspace, and your RE won't match as you expect it to. The following example looks the same as our previous RE, but omits the ``'r'`` in front of the RE string. ::
es: Hay dos sutilezas que debe recordar al usar esta secuencia especial. Primero, esta es la peor colisión entre las cadenas literales de caracteres de Python y las secuencias de expresiones regulares. En las cadenas de caracteres literales de Python, ``\b`` es el carácter de retroceso (*backspace*), valor ASCII 8. Si no está utilizando cadenas de caracteres sin procesar, Python convertirá la ``\b`` en una linea de retroceso, y su RE no lo hará coincidir como lo espera. El siguiente ejemplo tiene el mismo aspecto que nuestra RE anterior, pero omite la ``'r'`` delante de la cadena de caracteres de RE. ::

source: Second, inside a character class, where there's no use for this assertion, ``\b`` represents the backspace character, for compatibility with Python's string literals.
es: En segundo lugar, dentro de una clase de caracteres, donde no hay uso para esta aserción, ``\b`` representa el carácter de retroceso, por compatibilidad con las cadenas de caracteres literales de Python.

source: Another zero-width assertion, this is the opposite of ``\b``, only matching when the current position is not at a word boundary.
es: Otra flag de ancho cero, esto es lo opuesto a ``\b``, solo coincide cuando la posición actual no está en el límite de una palabra.

source: Grouping
es: Agrupando

source: Frequently you need to obtain more information than just whether the RE matched or not. Regular expressions are often used to dissect strings by writing a RE divided into several subgroups which match different components of interest. For example, an RFC-822 header line is divided into a header name and a value, separated by a ``':'``, like this:
es: Con frecuencia, necesita obtener más información que solo si la RE coincide o no. Las expresiones regulares se utilizan a menudo para diseccionar cadenas de caracteres escribiendo una RE dividido en varios subgrupos que coinciden con diferentes componentes de interés. Por ejemplo, una línea de encabezado RFC-822 se divide en un nombre de encabezado y un valor, separados por un ``':'``, así:

source: This can be handled by writing a regular expression which matches an entire header line, and has one group which matches the header name, and another group which matches the header's value.
es: Esto se puede manejar escribiendo una expresión regular que coincida con una línea de encabezado completa y que tenga un grupo que coincida con el nombre del encabezado y otro grupo que coincida con el valor del encabezado.

source: Groups are marked by the ``'('``, ``')'`` metacharacters. ``'('`` and ``')'`` have much the same meaning as they do in mathematical expressions; they group together the expressions contained inside them, and you can repeat the contents of a group with a quantifier, such as ``*``, ``+``, ``?``, or ``{m,n}``. For example, ``(ab)*`` will match zero or more repetitions of ``ab``. ::
es: Los grupos se marcan con los metacaracteres ``'('`` y ``')'``. ``'('`` y ``')'`` tienen prácticamente el mismo significado que en las expresiones matemáticas; agrupan las expresiones contenidas dentro de ellos, y puedes repetir el contenido de un grupo con un cuantificador, como ``*``, ``+``, ``?``, o ``{m,n}``. Por ejemplo, ``(ab)*`` coincidirá con cero o más repeticiones de ``ab``. ::

source: Groups indicated with ``'('``, ``')'`` also capture the starting and ending index of the text that they match; this can be retrieved by passing an argument to :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, and :meth:`~re.Match.span`. Groups are numbered starting with 0. Group 0 is always present; it's the whole RE, so :ref:`match object <match-objects>` methods all have group 0 as their default argument. Later we'll see how to express groups that don't capture the span of text that they match. ::
es: Los grupos indicados con ``'('``, ``')'`` también capturan el índice inicial y final del texto que coinciden; esto se puede recuperar pasando un argumento a :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, y :meth:`~re.Match.span`. Los grupos se numeran empezando por 0. El grupo 0 siempre está presente; es todo las RE, entonces todos los métodos :ref:`match object <match-objects>` tienen el grupo 0 como argumento predeterminado. Más adelante veremos cómo expresar grupos que no capturan el espacio de texto que coinciden. ::

source: Subgroups are numbered from left to right, from 1 upward. Groups can be nested; to determine the number, just count the opening parenthesis characters, going from left to right. ::
es: Los subgrupos están numerados de izquierda a derecha, de 1 en adelante. Los grupos se pueden anidar; para determinar el número, simplemente cuente los caracteres del paréntesis de apertura, de izquierda a derecha. ::

source: :meth:`~re.Match.group` can be passed multiple group numbers at a time, in which case it will return a tuple containing the corresponding values for those groups. ::
es: :meth:`~re.Match.group` se pueden pasar varios números de grupo a la vez, en cuyo caso retornará una tupla que contiene los valores correspondientes para esos grupos. ::

source: The :meth:`~re.Match.groups` method returns a tuple containing the strings for all the subgroups, from 1 up to however many there are. ::
es: El método :meth:`~re.Match.groups` retorna una tupla que contiene las cadenas de caracteres de todos los subgrupos, desde 1 hasta la cantidad que haya. ::

source: Backreferences in a pattern allow you to specify that the contents of an earlier capturing group must also be found at the current location in the string. For example, ``\1`` will succeed if the exact contents of group 1 can be found at the current position, and fails otherwise. Remember that Python's string literals also use a backslash followed by numbers to allow including arbitrary characters in a string, so be sure to use a raw string when incorporating backreferences in a RE.
es: Las referencias inversas en un patrón le permiten especificar que el contenido de un grupo de captura anterior también debe encontrarse en la ubicación actual en la cadena. Por ejemplo,``\1`` tendrá éxito si el contenido exacto del grupo 1 se puede encontrar en la posición actual y falla en caso contrario. Recuerde que las cadenas de caracteres literales de Python también usan una barra invertida seguida de números para permitir la inclusión de caracteres arbitrarios en una cadena de caracteres, así que asegúrese de usar una cadena de caracteres sin procesar al incorporar referencias inversas en una RE.

source: For example, the following RE detects doubled words in a string. ::
es: Por ejemplo, la siguiente RE detecta palabras duplicadas en una cadena. ::

source: Backreferences like this aren't often useful for just searching through a string --- there are few text formats which repeat data in this way --- but you'll soon find out that they're *very* useful when performing string substitutions.
es: Las referencias inversas como esta no suelen ser útiles para buscar a través de una cadena --- hay pocos formatos de texto que repiten datos de esta manera --- pero pronto descubrirá que son *muy* útiles al realizar sustituciones de cadenas de caracteres.

source: Non-capturing and Named Groups
es: Grupos con nombre y sin captura

source: Elaborate REs may use many groups, both to capture substrings of interest, and to group and structure the RE itself. In complex REs, it becomes difficult to keep track of the group numbers. There are two features which help with this problem. Both of them use a common syntax for regular expression extensions, so we'll look at that first.
es: Las RE elaboradas pueden utilizar muchos grupos, tanto para capturar subcadenas de caracteres de interés como para agrupar y estructurar la propia RE. En las RE complejas, resulta difícil realizar un seguimiento de los números de los grupos. Hay dos funciones que ayudan con este problema. Ambos usan una sintaxis común para las extensiones de expresiones regulares, así que veremos eso primero.

source: Perl 5 is well known for its powerful additions to standard regular expressions. For these new features the Perl developers couldn't choose new single-keystroke metacharacters or new special sequences beginning with ``\`` without making Perl's regular expressions confusingly different from standard REs. If they chose ``&`` as a new metacharacter, for example, old expressions would be assuming that ``&`` was a regular character and wouldn't have escaped it by writing ``\&`` or ``[&]``.
es: Perl 5 es bien conocido por sus poderosas adiciones a las expresiones regulares estándar. Para estas nuevas características, los desarrolladores de Perl no podían elegir nuevos metacaracteres de una sola pulsación de tecla o nuevas secuencias especiales que comienzan con ``\`` sin hacer que las expresiones regulares de Perl sean confusamente diferentes de las RE estándar. Si eligieran ``&`` como un nuevo metacarácter, por ejemplo, las expresiones antiguas supondrían que ``&`` era un carácter regular y no se habría escapado escribiendo ``\&`` o ``[&]``.

source: The solution chosen by the Perl developers was to use ``(?...)`` as the extension syntax. ``?`` immediately after a parenthesis was a syntax error because the ``?`` would have nothing to repeat, so this didn't introduce any compatibility problems. The characters immediately after the ``?`` indicate what extension is being used, so ``(?=foo)`` is one thing (a positive lookahead assertion) and ``(?:foo)`` is something else (a non-capturing group containing the subexpression ``foo``).
es: La solución elegida por los desarrolladores de Perl fue utilizar ``(?...)`` como sintaxis de extensión. ``?`` inmediatamente después de un paréntesis había un error de sintaxis porque el ``?`` no tendría nada que repetir, por lo que esto no introdujo ningún problema de compatibilidad. Los caracteres inmediatamente después de ``?`` Indican qué extensión se está utilizando, por lo que ``(?=foo)`` es una cosa (una flag de anticipación positiva) y ``(?:foo)`` es otra cosa (un grupo de no captura que contiene la subexpresión ``foo``).

source: Python supports several of Perl's extensions and adds an extension syntax to Perl's extension syntax. If the first character after the question mark is a ``P``, you know that it's an extension that's specific to Python.
es: Python admite varias de las extensiones de Perl y agrega una sintaxis de extensión a la sintaxis de extensión de Perl. Si el primer carácter después del signo de interrogación es una ``P``, sabrá que es una extensión específica de Python.

source: Now that we've looked at the general extension syntax, we can return to the features that simplify working with groups in complex REs.
es: Ahora que hemos visto la sintaxis de la extensión general, podemos volver a las características que simplifican el trabajo con grupos en RE complejos.

source: Sometimes you'll want to use a group to denote a part of a regular expression, but aren't interested in retrieving the group's contents. You can make this fact explicit by using a non-capturing group: ``(?:...)``, where you can replace the ``...`` with any other regular expression. ::
es: A veces querrá usar un grupo para denotar una parte de una expresión regular, pero no está interesado en recuperar el contenido del grupo. Puede hacer que este hecho sea explícito utilizando un grupo de no captura: ``(?:...)``, donde puede reemplazar el ``...`` con cualquier otra expresión regular. ::

source: Except for the fact that you can't retrieve the contents of what the group matched, a non-capturing group behaves exactly the same as a capturing group; you can put anything inside it, repeat it with a repetition metacharacter such as ``*``, and nest it within other groups (capturing or non-capturing). ``(?:...)`` is particularly useful when modifying an existing pattern, since you can add new groups without changing how all the other groups are numbered. It should be mentioned that there's no performance difference in searching between capturing and non-capturing groups; neither form is any faster than the other.
es: Excepto por el hecho de que no puede recuperar el contenido de lo que coincide con el grupo, un grupo que no captura se comporta exactamente igual que un grupo que captura; puede poner cualquier cosa dentro de él, repetirlo con un metacarácter de repetición como ``*`` y anidarlo dentro de otros grupos (capturando o no capturando). ``(?:...)`` es particularmente útil cuando se modifica un patrón existente, ya que puede agregar nuevos grupos sin cambiar cómo se numeran todos los demás grupos. Cabe mencionar que no hay diferencia de rendimiento en la búsqueda entre grupos de captura y no captura; ninguna forma es más rápida que la otra.

source: A more significant feature is named groups: instead of referring to them by numbers, groups can be referenced by a name.
es: Una característica más significativa son los grupos nombrados: en lugar de referirse a ellos por números, los grupos pueden ser referenciados por un nombre.
