Repository: python/python-docs-es
Catalog: howto/regex.po
Languages: es

source: Another common task is deleting every occurrence of a single character from a string or replacing it with another single character. You might do this with something like ``re.sub('\n', ' ', S)``, but :meth:`~str.translate` is capable of doing both tasks and will be faster than any regular expression operation can be.
es: Otra tarea común es eliminar cada aparición de un solo carácter de una cadena o reemplazarlo con otro solo carácter. Puede hacer esto con algo como ``re.sub('\n', ' ', S)``, pero :meth:`~str.translate` es capaz de realizar ambas tareas y será más rápido que cualquier expresión regular la operación puede ser.

source: In short, before turning to the :mod:`re` module, consider whether your problem can be solved with a faster and simpler string method.
es: En resumen, antes de pasar al módulo :mod:`re`, considere si su problema puede resolverse con un método de cadena de caracteres más rápido y simple.

source: The :func:`~re.match` function only checks if the RE matches at the beginning of the string while :func:`~re.search` will scan forward through the string for a match. It's important to keep this distinction in mind. Remember, :func:`!match` will only report a successful match which will start at 0; if the match wouldn't start at zero, :func:`!match` will *not* report it. ::
es: La función :func:`~re.match` solo verifica si la RE coincide con el comienzo de la cadena de caracteres, mientras que :func:`~re.search` buscará una coincidencia en la cadena de caracteres. Es importante tener en cuenta esta distinción. Recuerde :func:`!match` solo informará una coincidencia exitosa que comenzará en 0; si la coincidencia no comienza en cero, :func:`!match` *no* lo informará. ::

source: On the other hand, :func:`~re.search` will scan forward through the string, reporting the first match it finds. ::
es: Por otro lado, :func:`~re.search` escaneará hacia adelante a través de la cadena de caracteres, informando la primera coincidencia que encuentre. ::

source: Sometimes you'll be tempted to keep using :func:`re.match`, and just add ``.*`` to the front of your RE. Resist this temptation and use :func:`re.search` instead. The regular expression compiler does some analysis of REs in order to speed up the process of looking for a match. One such analysis figures out what the first character of a match must be; for example, a pattern starting with ``Crow`` must match starting with a ``'C'``. The analysis lets the engine quickly scan through the string looking for the starting character, only trying the full match if a ``'C'`` is found.
es: A veces, tendrá la tentación de seguir usando :func:`re.match`, y simplemente agregar ``.*`` al frente de su RE. Resista esta tentación y use :func:`re.search` en su lugar. El compilador de expresiones regulares realiza un análisis de las RE para acelerar el proceso de búsqueda de coincidencias. Uno de esos análisis determina cuál debe ser el primer carácter de una coincidencia; por ejemplo, un patrón que comienza con ``Crow`` debe coincidir con una ``'C'``.El análisis permite que el motor escanee rápidamente a través de la cadena en busca del carácter inicial, solo probando la coincidencia completa si se encuentra una ``'C'``.

source: Adding ``.*`` defeats this optimization, requiring scanning to the end of the string and then backtracking to find a match for the rest of the RE. Use :func:`re.search` instead.
es: Agregar ``.*`` anula esta optimización, lo que requiere escanear hasta el final de la cadena y luego retroceder para encontrar una coincidencia para el resto de la RE. Utilice :func:`re.search` en su lugar.

source: Greedy versus Non-Greedy
es: Codiciosa versus no codiciosa (*Greedy versus Non-Greedy*)

source: When repeating a regular expression, as in ``a*``, the resulting action is to consume as much of the pattern as possible. This fact often bites you when you're trying to match a pair of balanced delimiters, such as the angle brackets surrounding an HTML tag. The naive pattern for matching a single HTML tag doesn't work because of the greedy nature of ``.*``. ::
es: Al repetir una expresión regular, como en ``a*``, la acción resultante es consumir la mayor cantidad posible del patrón. Este hecho suele molestarle cuando intenta hacer coincidir un par de delimitadores equilibrados, como los corchetes angulares que rodean una etiqueta HTML. El patrón ingenuo para hacer coincidir una sola etiqueta HTML no funciona debido a la naturaleza codiciosa de ``.*``. ::

source: The RE matches the ``'<'`` in ``'<html>'``, and the ``.*`` consumes the rest of the string. There's still more left in the RE, though, and the ``>`` can't match at the end of the string, so the regular expression engine has to backtrack character by character until it finds a match for the ``>``. The final match extends from the ``'<'`` in ``'<html>'`` to the ``'>'`` in ``'</title>'``, which isn't what you want.
es: La RE coincide con el ``'<'`` en ``'<html>'``, y el ``.*`` consume el resto de la cadena de caracteres. Sin embargo, aún queda más en la RE y el ``>`` no puede coincidir al final de la cadena de caracteres, por lo que el motor de la expresión regular tiene que retroceder carácter por carácter hasta que encuentre una coincidencia para el ``>``. La coincidencia final se extiende desde el ``'<'`` en ``'<html>'`` al ``'>'`` en ``'</title>'``, que no es lo que queremos.

source: In this case, the solution is to use the non-greedy quantifiers ``*?``, ``+?``, ``??``, or ``{m,n}?``, which match as *little* text as possible. In the above example, the ``'>'`` is tried immediately after the first ``'<'`` matches, and when it fails, the engine advances a character at a time, retrying the ``'>'`` at every step. This produces just the right result::
es: En este caso, la solución es utilizar los cuantificadores no codiciosos ``*?``, ``+?``, ``??``, o ``{m,n}?``, que coinciden con la *menor* cantidad de texto posible. En el ejemplo anterior, el ``'>'`` se prueba inmediatamente después de que el primer ``'<'`` coincida, y cuando falla, el motor avanza un carácter a la vez, volviendo a intentar el ``'>'`` en cada paso. Esto produce el resultado correcto::

source: (Note that parsing HTML or XML with regular expressions is painful. Quick-and-dirty patterns will handle common cases, but HTML and XML have special cases that will break the obvious regular expression; by the time you've written a regular expression that handles all of the possible cases, the patterns will be *very* complicated. Use an HTML or XML parser module for such tasks.)
es: (Tenga en cuenta que analizar HTML o XML con expresiones regulares es doloroso. Los patrones rápidos y sucios manejarán casos comunes, pero HTML y XML tienen casos especiales que romperán la expresión regular obvia; para cuando haya escrito una expresión regular que maneja todos los casos posibles, los patrones serán *muy* complicados. Utilice un módulo analizador HTML o XML para tales tareas.)

source: Using re.VERBOSE
es: Usando re.VERBOSE

source: By now you've probably noticed that regular expressions are a very compact notation, but they're not terribly readable. REs of moderate complexity can become lengthy collections of backslashes, parentheses, and metacharacters, making them difficult to read and understand.
es: Probablemente ya haya notado que las expresiones regulares son una notación muy compacta, pero no son muy legibles. Las RE de complejidad moderada pueden convertirse en largas colecciones de barras invertidas, paréntesis y metacarácteres, lo que dificulta su lectura y comprensión.

source: For such REs, specifying the :const:`re.VERBOSE` flag when compiling the regular expression can be helpful, because it allows you to format the regular expression more clearly.
es: Para tales RE, especificar el flag :const:`re.VERBOSE` al compilar la expresión regular puede ser útil, porque le permite formatear la expresión regular con mayor claridad.

source: The ``re.VERBOSE`` flag has several effects. Whitespace in the regular expression that *isn't* inside a character class is ignored. This means that an expression such as ``dog | cat`` is equivalent to the less readable ``dog|cat``, but ``[a b]`` will still match the characters ``'a'``, ``'b'``, or a space. In addition, you can also put comments inside a RE; comments extend from a ``#`` character to the next newline. When used with triple-quoted strings, this enables REs to be formatted more neatly::
es: La flag ``re.VERBOSE`` tiene varios efectos. Los espacios en blanco en la expresión regular que *no están* dentro de una clase de caracteres se ignoran. Esto significa que una expresión como ``dog | cat`` es equivalente al menos legible ``dog | cat``, pero ``[a b]`` seguirá coincidiendo con los caracteres ``'a'``, ``'b'`` o un espacio. Además, también puede poner comentarios dentro de una RE; los comentarios se extienden desde un carácter ``#`` hasta la siguiente línea nueva. Cuando se usa con cadenas entre comillas triples, esto permite que las REs sean formateados de manera más ordenada:

source: This is far more readable than::
es: Esto es mas legible que::

source: Regular expressions are a complicated topic. Did this document help you understand them? Were there parts that were unclear, or Problems you encountered that weren't covered here? If so, please send suggestions for improvements to the author.
es: Las expresiones regulares son un tema complicado. ¿Le ayudó este documento a comprenderlas? ¿Hubo partes que no estaban claras o problemas que encontró que no se trataron aquí? Si es así, envíe sugerencias de mejora al autor.

source: The most complete book on regular expressions is almost certainly Jeffrey Friedl's Mastering Regular Expressions, published by O'Reilly. Unfortunately, it exclusively concentrates on Perl and Java's flavours of regular expressions, and doesn't contain any Python material at all, so it won't be useful as a reference for programming in Python. (The first edition covered Python's now-removed :mod:`!regex` module, which won't help you much.) Consider checking it out from your library.
es: El libro más completo sobre expresiones regulares es casi con certeza *Mastering Regular Expressions de Jeffrey Friedl*, publicado por *O'Reilly*. Desafortunadamente, se concentra exclusivamente en los tipos de expresiones regulares de Perl y Java, y no contiene ningún material de Python, por lo que no será útil como referencia para la programación en Python. (La primera edición cubría el módulo :mod:`!regex` de Python, ahora eliminado, que no le ayudará mucho.) Considere sacarlo de su biblioteca.
