Repository: python/python-docs-es
Catalog: howto/regex.po
Languages: es

source: :func:`re.compile` also accepts an optional *flags* argument, used to enable various special features and syntax variations. We'll go over the available settings later, but for now a single example will do::
es: :func:`re.compile` también acepta un argumento opcional *flags*, usado para habilitar varias características especiales y variaciones de sintaxis. Repasaremos las configuraciones disponibles más adelante, pero por ahora un solo ejemplo servirá:

source: The RE is passed to :func:`re.compile` as a string. REs are handled as strings because regular expressions aren't part of the core Python language, and no special syntax was created for expressing them. (There are applications that don't need REs at all, so there's no need to bloat the language specification by including them.) Instead, the :mod:`re` module is simply a C extension module included with Python, just like the :mod:`socket` or :mod:`zlib` modules.
es: La RE se pasa a :func:`re.compile` como una cadena de caracteres. Las RE se manejan como cadenas de caracteres porque las expresiones regulares no son parte del lenguaje central de Python y no se creó una sintaxis especial para expresarlas. (Hay aplicaciones que no necesitan RE en absoluto, por lo que no hay necesidad de aumentar la especificación del lenguaje incluyéndolas). En cambio, el módulo :mod:`re` es simplemente un módulo de extensión C incluido en Python, al igual que los módulos :mod:`socket` o :mod:`zlib`.

source: Putting REs in strings keeps the Python language simpler, but has one disadvantage which is the topic of the next section.
es: Poner RE en cadenas de caracteres mantiene el lenguaje Python más simple, pero tiene una desventaja que es el tema de la siguiente sección.

source: The Backslash Plague
es: La plaga de la barra invertida (*The Backslash Plague*)

source: As stated earlier, regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This conflicts with Python's usage of the same character for the same purpose in string literals.
es: Como se indicó anteriormente, las expresiones regulares usan el carácter de barra invertida (``'\'``) para indicar formas especiales o para permitir que se usen caracteres especiales sin invocar su significado especial. Esto entra en conflicto con el uso de Python del mismo carácter para el mismo propósito en cadenas literales.

source: Let's say you want to write a RE that matches the string ``\section``, which might be found in a LaTeX file. To figure out what to write in the program code, start with the desired string to be matched. Next, you must escape any backslashes and other metacharacters by preceding them with a backslash, resulting in the string ``\\section``. The resulting string that must be passed to :func:`re.compile` must be ``\\section``. However, to express this as a Python string literal, both backslashes must be escaped *again*.
es: Supongamos que desea escribir una RE que coincida con la cadena de caracteres ``\section``, que podría encontrarse en un archivo LaTeX. Para averiguar qué escribir en el código del programa, comience con la cadena deseada para que coincida. A continuación, debe escapar de las barras invertidas y otros metacaracteres precediéndolos con una barra invertida, lo que da como resultado la cadena ``\\section``. La cadena resultante que debe pasarse a :func:`re.compile` debe ser ``\\section``. Sin embargo, para expresar esto como una cadena literal de Python, ambas barras invertidas deben escaparse *nuevamente*.

source: Characters
es: Caracteres

source: Stage
es: Explicación

source: Text string to be matched
es: Cadena de texto que debe coincidir

source: Escaped backslash for :func:`re.compile`
es: Barra invertida de escape para :func:`re.compile`

source: Escaped backslashes for a string literal
es: Barra invertida de escape para un literal de cadena de caracteres

source: In short, to match a literal backslash, one has to write ``'\\\\'`` as the RE string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. In REs that feature backslashes repeatedly, this leads to lots of repeated backslashes and makes the resulting strings difficult to understand.
es: En resumen, para hacer coincidir una barra invertida literal, uno tiene que escribir ``'\\\\'`` como la cadena RE, porque la expresión regular debe ser ``\\``, y cada barra invertida debe expresarse como ``\\`` dentro de un literal de cadena Python normal. En las RE que presentan barras invertidas repetidamente, esto genera muchas barras invertidas repetidas y dificulta la comprensión de las cadenas resultantes.

source: The solution is to use Python's raw string notation for regular expressions; backslashes are not handled in any special way in a string literal prefixed with ``'r'``, so ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Regular expressions will often be written in Python code using this raw string notation.
es: La solución es utilizar la notación de cadena de caracteres sin formato de Python para expresiones regulares; las barras invertidas no se manejan de ninguna manera especial en una cadena literal con el prefijo ``'r'``, por lo que ``r"\n"`` es una cadena de dos caracteres que contiene ``'\'`` y ``'n'``, mientras que ``"\n"`` es una cadena de un carácter que contiene una nueva línea. Las expresiones regulares a menudo se escribirán en código Python utilizando esta notación de cadena sin formato.

source: In addition, special escape sequences that are valid in regular expressions, but not valid as Python string literals, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`, which means the sequences will be invalid if raw string notation or escaping the backslashes isn't used.
es: Además, las secuencias de escape especiales que son válidas en expresiones regulares, pero no válidas como literales de cadena de Python, ahora dan como resultado :exc:`DeprecationWarning` y eventualmente se convertirán en :exc:`SyntaxError`, lo que significa que las secuencias no serán válidas. si no se utiliza la notación de cadena sin formato o el escape de las barras invertidas.

source: Regular String
es: Cadena de caracteres regulares

source: Raw string
es: Cadena de caracteres crudas (*Raw string*)

source: Performing Matches
es: Realizando coincidencias

source: Once you have an object representing a compiled regular expression, what do you do with it? Pattern objects have several methods and attributes. Only the most significant ones will be covered here; consult the :mod:`re` docs for a complete listing.
es: Una vez que tiene un objeto que representa una expresión regular compilada, ¿qué hace con él? Los objetos de patrón tienen varios métodos y atributos. Aquí solo se cubrirán los más importantes; consulte los documentos :mod:`re` para obtener una lista completa.

source: Method/Attribute
es: Método/atributo

source: Purpose
es: Objetivo

source: Determine if the RE matches at the beginning of the string.
es: Determina si la RE coincide con el comienzo de la cadena de caracteres.

source: Scan through a string, looking for any location where this RE matches.
es: Escanea una cadena, buscando cualquier ubicación donde coincida este RE.

source: Find all substrings where the RE matches, and returns them as a list.
es: Encuentra todas las subcadenas de caracteres donde coincide la RE y las retorna como una lista.

source: Find all substrings where the RE matches, and returns them as an :term:`iterator`.
es: Encuentra todas las subcadenas donde la RE coincide y las retorna como un término iterado :term:`iterator`.

source: :meth:`~re.Pattern.match` and :meth:`~re.Pattern.search` return ``None`` if no match can be found. If they're successful, a :ref:`match object <match-objects>` instance is returned, containing information about the match: where it starts and ends, the substring it matched, and more.
es: :meth:`~re.Pattern.match` y :meth:`~re.Pattern.search` retornan ``None`` si la coincidencia no puede ser encontrada. Si tienen éxito, se retorna una instancia :ref:`match object <match-objects>`, que contiene información sobre la coincidencia: dónde comienza y termina, la subcadena de caracteres con la que coincidió, y más.

source: You can learn about this by interactively experimenting with the :mod:`re` module.
es: Puedes aprender sobre esto experimentando de forma interactiva con el módulo :mod:`re`.

source: This HOWTO uses the standard Python interpreter for its examples. First, run the Python interpreter, import the :mod:`re` module, and compile a RE::
es: Este CÓMO (*HOWTO*) utiliza el intérprete estándar de Python para sus ejemplos. Primero, ejecute el intérprete de Python, importe el módulo :mod:`re` y compile en RE::

source: Now, you can try matching various strings against the RE ``[a-z]+``. An empty string shouldn't match at all, since ``+`` means 'one or more repetitions'. :meth:`~re.Pattern.match` should return ``None`` in this case, which will cause the interpreter to print no output. You can explicitly print the result of :meth:`!match` to make this clear. ::
es: Ahora, puede intentar hacer coincidir varias cadenas con la RE ``[a-z]+``. Una cadena de caracteres vacía no debería coincidir en absoluto, ya que ``+`` significa que 'una o más repeticiones'. :meth:`~re.Pattern.match` debería retornar ``None`` en este caso, lo que hará que el intérprete no imprima ningún resultado. Puede imprimir explícitamente el resultado de :meth:`!match` para aclarar esto. ::

source: Now, let's try it on a string that it should match, such as ``tempo``. In this case, :meth:`~re.Pattern.match` will return a :ref:`match object <match-objects>`, so you should store the result in a variable for later use. ::
es: Ahora, intentémoslo en una cadena de caracteres que debería coincidir, como ``tempo``.En este caso , :meth:`~re.Pattern.match` retornará un :ref:`match object <match-objects>`, por lo que debe almacenar el resultado en una variable para su posterior uso. ::

source: Now you can query the :ref:`match object <match-objects>` for information about the matching string. Match object instances also have several methods and attributes; the most important ones are:
es: Ahora puede consultar :ref:`match object <match-objects>` para obtener información sobre la cadena coincidente. Las instancias de objetos coincidentes también tienen varios métodos y atributos; los más importantes son:

source: Return the string matched by the RE
es: Retorna la cadena de caracteres que coincide con la RE

source: Return the starting position of the match
es: Retorna la posición de inicio de la coincidencia

source: Return the ending position of the match
es: Retorna la posición final de la coincidencia

source: Return a tuple containing the (start, end) positions of the match
es: Retorna una tupla que contiene (inicio, final) las posiciones de coincidencia

source: Trying these methods will soon clarify their meaning::
es: Probando estos métodos pronto aclarará sus significados::

source: :meth:`~re.Match.group` returns the substring that was matched by the RE. :meth:`~re.Match.start` and :meth:`~re.Match.end` return the starting and ending index of the match. :meth:`~re.Match.span` returns both start and end indexes in a single tuple. Since the :meth:`~re.Pattern.match` method only checks if the RE matches at the start of a string, :meth:`!start` will always be zero. However, the :meth:`~re.Pattern.search` method of patterns scans through the string, so the match may not start at zero in that case. ::
es: :meth:`~re.Match.group` retorna la subcadena de caracteres que coincide con la RE. :meth:`~re.Match.start` y :meth:`~re.Match.end` retornan el índice inicial y final de la coincidencia. :meth:`~re.Match.span` retorna el índice inicial y final en una única tupla. Dado que el método :meth:`~re.Pattern.match` solo verifica si la RE coincide al comienzo de una cadena de caracteres, :meth:`!start` siempre será cero. Sin embargo, el método de patrones :meth:`~re.Pattern.search` escanea a través de la cadena de caracteres, por lo que es posible que la coincidencia no comience en cero en ese caso. ::

source: In actual programs, the most common style is to store the :ref:`match object <match-objects>` in a variable, and then check if it was ``None``. This usually looks like::
es: En programas reales, el estilo más común es almacenar :ref:`match object <match-objects>` en una variable, y luego verificar si era ``None``. Esto generalmente se ve así::

source: Two pattern methods return all of the matches for a pattern. :meth:`~re.Pattern.findall` returns a list of matching strings::
es: Dos métodos de patrón retornan todas las coincidencias de un patrón. :meth:`~re.Pattern.findall` retorna una lista de cadenas de caracteres coincidentes::

source: The ``r`` prefix, making the literal a raw string literal, is needed in this example because escape sequences in a normal "cooked" string literal that are not recognized by Python, as opposed to regular expressions, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`. See :ref:`the-backslash-plague`.
es: El prefijo ``r``, que convierte al literal en una cadena de caracteres literal sin formato, es necesario en este ejemplo porque las secuencias de escape en un cadena de caracteres literal "cocinado" normal que no son reconocidas por Python, a diferencia de las expresiones regulares, ahora dan como resultado :exc:`DeprecationWarning` y eventualmente se convertirá en :exc:`SyntaxError`. Ver :ref:`the-backslash-plague`.

source: :meth:`~re.Pattern.findall` has to create the entire list before it can be returned as the result. The :meth:`~re.Pattern.finditer` method returns a sequence of :ref:`match object <match-objects>` instances as an :term:`iterator`::
es: :meth:`~re.Pattern.findall` tiene que crear la lista completa antes de que pueda retornarse como resultado. El método :meth:`~re.Pattern.finditer` retorna una secuencia de :ref:`match object <match-objects>` instancias como iterados :term:`iterator`::

source: Module-Level Functions
es: Funciones a nivel de módulo

source: You don't have to create a pattern object and call its methods; the :mod:`re` module also provides top-level functions called :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, and so forth. These functions take the same arguments as the corresponding pattern method with the RE string added as the first argument, and still return either ``None`` or a :ref:`match object <match-objects>` instance. ::
es: No es necesario crear un objeto patrón y llamar a sus métodos; el módulo :mod:`re` también proporciona funciones de nivel superior llamadas :func:`~re.match` , :func:`~re.search` , :func:`~re.findall` , :func:`~re.sub`, y así sucesivamente. Estas funciones toman los mismos argumentos que el método de patrón correspondiente con la cadena de RE agregada como primer argumento, y aún así retornan una instancia de ``None`` o :ref:`match object <match-objects>`. ::

source: Under the hood, these functions simply create a pattern object for you and call the appropriate method on it. They also store the compiled object in a cache, so future calls using the same RE won't need to parse the pattern again and again.
es: Bajo el capó (*hood*), estas funciones simplemente crean un objeto patrón para usted y llaman al método apropiado en él. También almacenan el objeto compilado en un caché, por lo que las futuras llamadas que usen el mismo RE no necesitarán analizar el patrón una y otra vez.

source: Should you use these module-level functions, or should you get the pattern and call its methods yourself? If you're accessing a regex within a loop, pre-compiling it will save a few function calls. Outside of loops, there's not much difference thanks to the internal cache.
es: ¿Debería utilizar estas funciones a nivel de módulo o debería obtener el patrón y llamar a sus métodos usted mismo? Si está accediendo a una expresión regular dentro de un bucle, la compilación previa guardará algunas llamadas a funciones. Fuera de los bucles, no hay mucha diferencia gracias al caché interno.

source: Compilation Flags
es: Los flags de compilación

source: Compilation flags let you modify some aspects of how regular expressions work. Flags are available in the :mod:`re` module under two names, a long name such as :const:`IGNORECASE` and a short, one-letter form such as :const:`I`. (If you're familiar with Perl's pattern modifiers, the one-letter forms use the same letters; the short form of :const:`re.VERBOSE` is :const:`re.X`, for example.) Multiple flags can be specified by bitwise OR-ing them; ``re.I | re.M`` sets both the :const:`I` and :const:`M` flags, for example.
es: Las flags de compilación le permiten modificar algunos aspectos de cómo funcionan las expresiones regulares. Las flags están disponibles en el módulo :mod:`re` con dos nombres, un nombre largo como :const:`IGNORECASE` y una forma corta de una letra como :const:`I`. (Si está familiarizado con los modificadores de patrones de Perl, las formas de una letra usan las mismas letras; la forma corta de :const:`re.VERBOSE` es :const:`re.X`, por ejemplo).Se pueden especificar varios indicadores uniéndolos con *OR* bit a bit; ``re.I | re.M`` establece los flags :const:`I` and :const:`M`, por ejemplo.

source: Here's a table of the available flags, followed by a more detailed explanation of each one.
es: Aquí hay una tabla de las flags disponibles, seguida de una explicación más detallada de cada una.

source: Meaning
es: Significado

source: Makes several escapes like ``\w``, ``\b``, ``\s`` and ``\d`` match only on ASCII characters with the respective property.
es: Hace que varios escapes como ``\w``, ``\b``, ``\s`` y ``\d`` coincidan solo en caracteres ASCII con la propiedad respectiva.

source: Make ``.`` match any character, including newlines.
es: Hace que ``.`` coincida con cualquier caracter, incluidas las nuevas líneas.

source: Do case-insensitive matches.
es: Hace coincidencias que no distingan entre mayúsculas y minúsculas.

source: Do a locale-aware match.
es: Hace una coincidencia con reconocimiento de configuración regional.

source: Multi-line matching, affecting ``^`` and ``$``.
es: Coincidencia de varias líneas, que afecta a ``^`` y ``$``.

source: Enable verbose REs, which can be organized more cleanly and understandably.
es: Habilite RE detallados, que se pueden organizar de manera más limpia y comprensible.

source: Perform case-insensitive matching; character class and literal strings will match letters by ignoring case. For example, ``[A-Z]`` will match lowercase letters, too. Full Unicode matching also works unless the :const:`ASCII` flag is used to disable non-ASCII matches. When the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). ``Spam`` will match ``'Spam'``, ``'spam'``, ``'spAM'``, or ``'ſpam'`` (the latter is matched only in Unicode mode). This lowercasing doesn't take the current locale into account; it will if you also set the :const:`LOCALE` flag.
es: Realiza una coincidencia que no distinga entre mayúsculas y minúsculas; la clase de caracteres y las cadenas de caracteres literales coincidirán con las letras ignorando las mayúsculas. Por ejemplo, ``[A-Z]`` también coincidirá con letras minúsculas. La coincidencia completa de Unicode también funciona a menos que se utilice la flag :const:`ASCII` para deshabilitar las coincidencias que no sean ASCII. Cuando los patrones Unicode ``[a-z]`` o ``[A-Z]`` se utilizan en combinación con el indicador :const:`IGNORECASE` , coincidirán con las 52 letras ASCII y 4 letras adicionales no ASCII 'İ' (U+0130, letra mayúscula latina I con un punto arriba), 'ı' (U+0131, letra minúscula latina sin punto i),'ſ' (U+017F, letra minúscula latina larga s) y 'K' (U+212A, signo de Kelvin). ``Spam`` coincidirá ``'Spam'``, ``'spam'``, ``'spAM'``, o ``'ſpam'`` (este último solo coincide en modo Unicode). Estas minúsculas no tiene en cuenta la configuración regional actual; lo hará si también establece la flag :const:`LOCALE` .

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale instead of the Unicode database.
es: Hace que ``\w``, ``\W``, ``\b``, ``\B`` y la coincidencia que no distinga entre mayúsculas y minúsculas dependan de la configuración regional actual en lugar de la base de datos Unicode.

source: Locales are a feature of the C library intended to help in writing programs that take account of language differences. For example, if you're processing encoded French text, you'd want to be able to write ``\w+`` to match words, but ``\w`` only matches the character class ``[A-Za-z]`` in bytes patterns; it won't match bytes corresponding to ``é`` or ``ç``. If your system is configured properly and a French locale is selected, certain C functions will tell the program that the byte corresponding to ``é`` should also be considered a letter. Setting the :const:`LOCALE` flag when compiling a regular expression will cause the resulting compiled object to use these C functions for ``\w``; this is slower, but also enables ``\w+`` to match French words as you'd expect. The use of this flag is discouraged in Python 3 as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages.
es: Las configuraciones regionales son una característica de la biblioteca C destinada a ayudar a escribir programas que tengan en cuenta las diferencias de idioma. Por ejemplo, si está procesando texto en francés codificado, querrá poder escribir ``\w+`` para que coincida con las palabras, pero ``\w`` solo coincide con la clase de caracteres ``[A-Za-z]`` en patrones de bytes; no coincidirá con los bytes correspondientes a ``é`` or ``ç``. Si su sistema está configurado correctamente y se selecciona una configuración regional francesa, ciertas funciones de C le dirán al programa que el byte correspondiente a ``é`` también debe considerarse una letra. Establecer el indicador :const:`LOCALE` al compilar una expresión regular hará que el objeto compilado resultante use estas funciones C para ``\w``; esto es más lento, pero también permite que ``\w+`` coincida con las palabras en francés como era de esperar. Se desaconseja el uso de esta flag en Python 3 ya que el mecanismo de configuración regional es muy poco confiable, solo maneja una "cultura" a la vez y solo funciona con configuraciones regionales de 8 bits. La coincidencia Unicode ya está habilitada de forma predeterminada en Python 3 para patrones Unicode (str), y puede manejar diferentes configuraciones regionales/idiomas.

source: (``^`` and ``$`` haven't been explained yet; they'll be introduced in section :ref:`more-metacharacters`.)
es: (``^`` y ``$`` aún no se han explicado; se presentarán en la sección :ref:`more-metacharacters`.)
