Repository: python/python-docs-es
Catalog: howto/regex.po
Languages: es

source: Regular Expression HOWTO
es: Expresiones regulares COMOS (*HOWTO*)

source: Author
es: Autor

source: Abstract
es: Resumen

source: This document is an introductory tutorial to using regular expressions in Python with the :mod:`re` module. It provides a gentler introduction than the corresponding section in the Library Reference.
es: Este documento es un tutorial de introducción al uso de expresiones regulares en Python con el módulo :mod:`re`. Proporciona una introducción más apacible que la sección correspondiente en la Referencia de la Biblioteca.

source: Introduction
es: Introducción

source: Regular expressions (called REs, or regexes, or regex patterns) are essentially a tiny, highly specialized programming language embedded inside Python and made available through the :mod:`re` module. Using this little language, you specify the rules for the set of possible strings that you want to match; this set might contain English sentences, or e-mail addresses, or TeX commands, or anything you like. You can then ask questions such as "Does this string match the pattern?", or "Is there a match for the pattern anywhere in this string?". You can also use REs to modify a string or to split it apart in various ways.
es: Las expresiones regulares (llamadas RE, o regex, o patrones de regex) son esencialmente en un lenguaje de programación diminuto y altamente especializado incrustado dentro de Python y disponible a través del módulo :mod:`re`. Usando este pequeño lenguaje, especificas las reglas para el conjunto de cadenas de caracteres posibles que deseas hacer coincidir; este conjunto puede contener frases en inglés, o direcciones de correo electrónico, o comandos TeX, o cualquier cosa que desee. A continuación, puede hacer preguntas como "¿Coincide esta cadena con el patrón?" o "¿Hay alguna coincidencia con el patrón en alguna parte de esta cadena?". También puede utilizar RE para modificar una cadena de caracteres o dividirla de varias formas.

source: Regular expression patterns are compiled into a series of bytecodes which are then executed by a matching engine written in C. For advanced use, it may be necessary to pay careful attention to how the engine will execute a given RE, and write the RE in a certain way in order to produce bytecode that runs faster. Optimization isn't covered in this document, because it requires that you have a good understanding of the matching engine's internals.
es: Los patrones de expresiones regulares se compilan en una serie de códigos de bytes que luego son ejecutados por un motor de coincidencia escrito en C. Para un uso avanzado, puede ser necesario prestar mucha atención a cómo el motor ejecutará una RE dado y escribir la RE en un de cierta manera para producir un código de bytes que se ejecute más rápido. La optimización no se trata en este documento, porque requiere que tenga un buen conocimiento de los componentes internos del motor de coincidencia.

source: The regular expression language is relatively small and restricted, so not all possible string processing tasks can be done using regular expressions. There are also tasks that *can* be done with regular expressions, but the expressions turn out to be very complicated. In these cases, you may be better off writing Python code to do the processing; while Python code will be slower than an elaborate regular expression, it will also probably be more understandable.
es: El lenguaje de expresiones regulares es relativamente pequeño y restringido, por lo que no todas las posibles tareas de procesamiento de cadenas de caracteres se pueden realizar utilizando expresiones regulares. También hay tareas que *se pueden* hacer con expresiones regulares, pero las expresiones resultan ser muy complicadas. En estos casos, es mejor que escriba código Python para realizar el procesamiento; Si bien el código Python será más lento que una expresión regular elaborada, probablemente también será más comprensible.

source: Simple Patterns
es: Patrones simples

source: We'll start by learning about the simplest possible regular expressions. Since regular expressions are used to operate on strings, we'll begin with the most common task: matching characters.
es: Comenzaremos aprendiendo sobre las expresiones regulares más simples posibles. Dado que las expresiones regulares se utilizan para operar en cadenas de caracteres, comenzaremos con la tarea más común: hacer coincidir caracteres.

source: For a detailed explanation of the computer science underlying regular expressions (deterministic and non-deterministic finite automata), you can refer to almost any textbook on writing compilers.
es: Para obtener una explicación detallada de la informática que subyace a las expresiones regulares (autómatas finitos deterministas y no deterministas), puede consultar casi cualquier libro de texto sobre la escritura de compiladores.

source: Matching Characters
es: Coincidencia de caracteres (*Matching Characters*)

source: Most letters and characters will simply match themselves. For example, the regular expression ``test`` will match the string ``test`` exactly. (You can enable a case-insensitive mode that would let this RE match ``Test`` or ``TEST`` as well; more about this later.)
es: La mayoría de letras y caracteres simplemente coincidirán. Por ejemplo, la expresión regular ``test`` coincidirá exactamente con la cadena ``test``. (Puede habilitar un modo que no distinga entre mayúsculas y minúsculas que permitiría que este RE coincida con ``test`` o ``TEST`` también; más sobre esto más adelante.)

source: There are exceptions to this rule; some characters are special :dfn:`metacharacters`, and don't match themselves. Instead, they signal that some out-of-the-ordinary thing should be matched, or they affect other portions of the RE by repeating them or changing their meaning. Much of this document is devoted to discussing various metacharacters and what they do.
es: Hay excepciones a esta regla; algunos caracteres son especiales :dfn:`metacharacters`, y no coinciden. En cambio, señalan que debe coincidir con algo fuera de lo común, o afectan otras partes de la RE repitiéndolos o cambiando su significado. Gran parte de este documento está dedicado a discutir varios metacaracteres y lo que hacen.

source: Here's a complete list of the metacharacters; their meanings will be discussed in the rest of this HOWTO.
es: Aquí hay una lista completa de los metacaracteres; sus significados se discutirán en el resto de este COMO (*HOWTO*).

source: The first metacharacters we'll look at are ``[`` and ``]``. They're used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a ``'-'``. For example, ``[abc]`` will match any of the characters ``a``, ``b``, or ``c``; this is the same as ``[a-c]``, which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be ``[a-z]``.
es: Los primeros metacaracteres que veremos son ``[`` and ``]``. Se utilizan para especificar una clase de carácter, que es un conjunto de caracteres que desea hacer coincidir. Los caracteres se pueden enumerar individualmente, o se puede indicar un rango de caracteres dando dos caracteres y separándolos con un ``'-'``. Por ejemplo, ``[abc]`` coincidirá con cualquiera de los caracteres ``a``, ``b`` o ``c``; esto es lo mismo que ``[a-c]``, que usa un rango para expresar el mismo conjunto de caracteres. Si quisiera hacer coincidir solo letras minúsculas, su RE sería ``[a-c]``.

source: Metacharacters (except ``\``) are not active inside classes. For example, ``[akm$]`` will match any of the characters ``'a'``, ``'k'``, ``'m'``, or ``'$'``; ``'$'`` is usually a metacharacter, but inside a character class it's stripped of its special nature.
es: Los metacaracteres (excepto ``\``) no están activos dentro de las clases. Por ejemplo, ``[akm$]`` coincidirá con cualquiera de los caracteres ``'a'``, ``'k'``, ``'m'``, o ``'$'``; ``'$'`` suele ser un metacarácter, pero dentro de una clase de carácter se le quita su naturaleza especial.

source: You can match the characters not listed within the class by :dfn:`complementing` the set. This is indicated by including a ``'^'`` as the first character of the class. For example, ``[^5]`` will match any character except ``'5'``. If the caret appears elsewhere in a character class, it does not have special meaning. For example: ``[5^]`` will match either a ``'5'`` or a ``'^'``.
es: Puede hacer coincidir los caracteres que no figuran en la clase mediante el conjunto :dfn:`complementing`. Esto se indica mediante la inclusión de un ``'^'`` como primer carácter de la clase. Por ejemplo, ``[^5]`` coincidirá con cualquier carácter excepto con ``'5'``. Si el símbolo de intercalación aparece en otra parte de una clase de caracter, no tiene un significado especial. Por ejemplo: ``[5^]`` coincidirá con un ``'5'`` o un ``'^'``.

source: Perhaps the most important metacharacter is the backslash, ``\``. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It's also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a ``[`` or ``\``, you can precede them with a backslash to remove their special meaning: ``\[`` or ``\\``.
es: Quizás el metacarácter más importante es la barra invertida, ``\``. Al igual que en los literales de cadena de Python, la barra invertida puede ir seguida de varios caracteres para señalar varias secuencias especiales. También se usa para escapar de todos los metacaracteres, de modo que aún pueda emparejarlos en patrones; por ejemplo, si necesita hacer coincidir un ``[`` o ``\``, puede precederlos con una barra invertida para eliminar su significado especial: ``\[`` o ``\\``.

source: Some of the special sequences beginning with ``'\'`` represent predefined sets of characters that are often useful, such as the set of digits, the set of letters, or the set of anything that isn't whitespace.
es: Algunas de las secuencias especiales que comienzan con ``'\'`` representan conjuntos predefinidos de caracteres que a menudo son útiles, como el conjunto de dígitos, el conjunto de letras o el conjunto de cualquier cosa que no sea un espacio en blanco.

source: Let's take an example: ``\w`` matches any alphanumeric character. If the regex pattern is expressed in bytes, this is equivalent to the class ``[a-zA-Z0-9_]``. If the regex pattern is a string, ``\w`` will match all the characters marked as letters in the Unicode database provided by the :mod:`unicodedata` module. You can use the more restricted definition of ``\w`` in a string pattern by supplying the :const:`re.ASCII` flag when compiling the regular expression.
es: Tomemos un ejemplo: ``\w`` coincide con cualquier carácter alfanumérico. Si el patrón de expresiones regulares se expresa en bytes, esto es equivalente a la clase ``[a-zA-Z0-9_]``. Si el patrón de expresiones regulares es una cadena de caracteres, ``\w`` coincidirá con todos los caracteres marcados como letras en la base de datos Unicode proporcionada por el módulo :mod:`unicodedata`. Puede usar la definición más restringida de ``\w`` en un patrón de cadena proporcionando el indicador :const:`re.ASCII` al compilar la expresión regular.

source: The following list of special sequences isn't complete. For a complete list of sequences and expanded class definitions for Unicode string patterns, see the last part of :ref:`Regular Expression Syntax <re-syntax>` in the Standard Library reference. In general, the Unicode versions match any character that's in the appropriate category in the Unicode database.
es: La siguiente lista de secuencias especiales no está completa. Para obtener una lista completa de secuencias y definiciones de clases expandidas para patrones de cadenas Unicode, consulte la última parte de :ref:`Regular Expression Syntax <re-syntax>` en la referencia de la biblioteca estándar. En general, las versiones Unicode coinciden con cualquier carácter que esté en la categoría apropiada en la base de datos Unicode.

source: Matches any decimal digit; this is equivalent to the class ``[0-9]``.
es: Coincide con cualquier dígito decimal; esto es equivalente a la clase ``[0-9]``.

source: Matches any non-digit character; this is equivalent to the class ``[^0-9]``.
es: Coincide con cualquier carácter que no sea un dígito; esto es equivalente a la clase ``[^0-9]``.

source: Matches any whitespace character; this is equivalent to the class ``[ \t\n\r\f\v]``.
es: Coincide con cualquier carácter de espacio en blanco; esto es equivalente a la clase ``[ \t\n\r\f\v]``.

source: Matches any non-whitespace character; this is equivalent to the class ``[^ \t\n\r\f\v]``.
es: Coincide con cualquier carácter que no sea un espacio en blanco; esto es equivalente a la clase ``[^ \t\n\r\f\v]``.

source: Matches any alphanumeric character; this is equivalent to the class ``[a-zA-Z0-9_]``.
es: Coincide con cualquier carácter alfanumérico; esto es equivalente a la clase ``[a-zA-Z0-9_]``.

source: Matches any non-alphanumeric character; this is equivalent to the class ``[^a-zA-Z0-9_]``.
es: Coincide con cualquier carácter no alfanumérico; esto es equivalente a la clase ``[^a-zA-Z0-9_]``.

source: These sequences can be included inside a character class. For example, ``[\s,.]`` is a character class that will match any whitespace character, or ``','`` or ``'.'``.
es: Estas secuencias se pueden incluir dentro de una clase de carácter. Por ejemplo, ``[\s,.]`` es una clase de carácter que coincidirá con cualquier carácter de espacio en blanco, o ``','`` o ``'.'``.

source: The final metacharacter in this section is ``.``. It matches anything except a newline character, and there's an alternate mode (:const:`re.DOTALL`) where it will match even a newline. ``.`` is often used where you want to match "any character".
es: El metacarácter final en esta sección es ``.``. Coincide con cualquier cosa excepto un carácter de nueva línea, y hay un modo alternativo (:const:`re.DOTALL`) donde coincidirá incluso con una nueva línea. ``.`` se usa a menudo cuando se desea hacer coincidir "cualquier carácter".

source: Repeating Things
es: Repitiendo cosas

source: Being able to match varying sets of characters is the first thing regular expressions can do that isn't already possible with the methods available on strings. However, if that was the only additional capability of regexes, they wouldn't be much of an advance. Another capability is that you can specify that portions of the RE must be repeated a certain number of times.
es: Ser capaz de hacer coincidir diferentes conjuntos de caracteres es lo primero que pueden hacer las expresiones regulares que ya no es posible con los métodos disponibles en cadenas de caracteres. Sin embargo, si esa fuera la única capacidad adicional de las expresiones regulares, no serían un gran avance. Otra capacidad es que puede especificar que partes de la RE deben repetirse un cierto número de veces.

source: The first metacharacter for repeating things that we'll look at is ``*``. ``*`` doesn't match the literal character ``'*'``; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.
es: El primer metacarácter para repetir cosas que veremos es ``*``. ``*`` no coincide con el carácter literal ``'*'``; en cambio, especifica que el carácter anterior puede coincidir cero o más veces, en lugar de exactamente una vez.

source: For example, ``ca*t`` will match ``'ct'`` (0 ``'a'`` characters), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` characters), and so forth.
es: Por ejemplo, ``ca*t`` coincidirá con ``'ct'`` (0 ``'a'`` caracteres), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` caracteres), etc.

source: Repetitions such as ``*`` are :dfn:`greedy`; when repeating a RE, the matching engine will try to repeat it as many times as possible. If later portions of the pattern don't match, the matching engine will then back up and try again with fewer repetitions.
es: Las repeticiones como ``*`` son :dfn:`greedy`; al repetir una RE, el motor de emparejamiento intentará repetirlo tantas veces como sea posible. Si las partes posteriores del patrón no coinciden, el motor de coincidencia hará una copia de seguridad y volverá a intentarlo con menos repeticiones.

source: A step-by-step example will make this more obvious. Let's consider the expression ``a[bcd]*b``. This matches the letter ``'a'``, zero or more letters from the class ``[bcd]``, and finally ends with a ``'b'``. Now imagine matching this RE against the string ``'abcbd'``.
es: Un ejemplo paso a paso hará que esto sea más obvio. Consideremos la expresión ``a[bcd]*b``. Esto coincide con la letra ``'a'``, cero o más letras de la clase ``[bcd]``, y finalmente termina con una ``'b'``. Ahora imagina hacer coincidir este RE con la cadena de caracteres ``'abcbd'``.

source: Step
es: Pasos

source: Matched
es: Coincidencias

source: Explanation
es: Explicación

source: The ``a`` in the RE matches.
es: La ``a`` en las RE coincide.

source: The engine matches ``[bcd]*``, going as far as it can, which is to the end of the string.
es: El motor coincide con ``[bcd]*``, yendo tan lejos como puede, que es hasta el final de la cadena de caracteres.

source: The engine tries to match ``b``, but the current position is at the end of the string, so it fails.
es: El motor intenta hacer coincidir ``b``, pero la posición actual está al final de la cadena de caracteres, por lo que falla.

source: Back up, so that ``[bcd]*`` matches one less character.
es: Hace una copia de seguridad para que ``[bcd]*`` coincida con un carácter menos.

source: Try ``b`` again, but the current position is at the last character, which is a ``'d'``.
es: Intente ``b`` de nuevo, pero la posición actual está en el último caracter, que es un ``'d'``.

source: Back up again, so that ``[bcd]*`` is only matching ``bc``.
es: Haga una copia de seguridad de nuevo, de modo que ``[bcd]*`` solo coincida con ``bc``.

source: Try ``b`` again. This time the character at the current position is ``'b'``, so it succeeds.
es: Intente ``b`` de nuevo. Esta vez, el carácter en la posición actual es ``'b'``, por lo que tiene éxito.

source: The end of the RE has now been reached, and it has matched ``'abcb'``. This demonstrates how the matching engine goes as far as it can at first, and if no match is found it will then progressively back up and retry the rest of the RE again and again. It will back up until it has tried zero matches for ``[bcd]*``, and if that subsequently fails, the engine will conclude that the string doesn't match the RE at all.
es: Se ha alcanzado el final de la RE y ha coincidido con ``'abcb'``. Esto demuestra cómo el motor de coincidencias llega tan lejos como puede al principio, y si no se encuentra ninguna coincidencia, retrocederá progresivamente y volverá a intentar de la RE una y otra vez. Hará una copia de seguridad hasta que haya probado cero coincidencias para ``[bcd]*``, y si eso falla posteriormente, el motor concluirá que la cadena no coincide con la RE en absoluto.

source: Another repeating metacharacter is ``+``, which matches one or more times. Pay careful attention to the difference between ``*`` and ``+``; ``*`` matches *zero* or more times, so whatever's being repeated may not be present at all, while ``+`` requires at least *one* occurrence. To use a similar example, ``ca+t`` will match ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), but won't match ``'ct'``.
es: Otro metacarácter que se repite es ``+``, que coincide una o más veces. Preste especial atención a la diferencia entre ``*`` and ``+``; coincide con *cero* o más veces, por lo que cualquier cosa que se repita puede no estar presente en absoluto, mientras que ``+`` requiere al menos *one* aparición. Para usar un ejemplo similar, ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), pero no coincidirá con ``'ct'``.

source: There are two more repeating operators or quantifiers. The question mark character, ``?``, matches either once or zero times; you can think of it as marking something as being optional. For example, ``home-?brew`` matches either ``'homebrew'`` or ``'home-brew'``.
es: Hay otros dos operadores de repetición o cuantificadores. El carácter de interrogación, ``?``, coincide una vez o cero veces; puede pensar en ello como marcar algo como opcional. Por ejemplo, ``home-?brew`` coincide con ``'homebrew'`` o ``'home-brew'``.

source: The most complicated quantifier is ``{m,n}``, where *m* and *n* are decimal integers. This quantifier means there must be at least *m* repetitions, and at most *n*. For example, ``a/{1,3}b`` will match ``'a/b'``, ``'a//b'``, and ``'a///b'``. It won't match ``'ab'``, which has no slashes, or ``'a////b'``, which has four.
es: El cuantificador más complicado es ``{m,n}``, donde *m* y *n* son enteros decimales. Este cuantificador significa que debe haber al menos *m* repeticiones y como máximo *n*. Por ejemplo, ``a/{1,3}b`` coincidirá con ``'a/b'``, ``'a//b'``, y ``'a///b'``. No coincidirá con ``'ab'``, que no tiene barras diagonales, ni con ``'a////b'``, que tiene cuatro.

source: You can omit either *m* or *n*; in that case, a reasonable value is assumed for the missing value. Omitting *m* is interpreted as a lower limit of 0, while omitting *n* results in an upper bound of infinity.
es: Puede omitir *m* o *n*; en ese caso, se asume un valor razonable para el valor faltante. Omitir *m* se interpreta como un límite inferior de 0, mientras que omitir *n* da como resultado un límite superior de infinito.

source: Readers of a reductionist bent may notice that the three other quantifiers can all be expressed using this notation. ``{0,}`` is the same as ``*``, ``{1,}`` is equivalent to ``+``, and ``{0,1}`` is the same as ``?``. It's better to use ``*``, ``+``, or ``?`` when you can, simply because they're shorter and easier to read.
es: Los lectores con una inclinación reduccionista pueden notar que los otros tres cuantificadores se pueden expresar todos utilizando esta notación. ``{0,}`` es lo mismo que ``*``, ``{1,}`` es equivalente a ``+``, y ``{0,1}`` es lo mismo que ``?``. Es mejor usar ``*``, ``+``, o ``?`` cuando sea posible, simplemente porque son más cortos y más fáciles de leer.

source: Using Regular Expressions
es: Usando expresiones regulares

source: Now that we've looked at some simple regular expressions, how do we actually use them in Python? The :mod:`re` module provides an interface to the regular expression engine, allowing you to compile REs into objects and then perform matches with them.
es: Ahora que hemos visto algunas expresiones regulares simples, ¿cómo las usamos realmente en Python? El módulo :mod:`re` proporciona una interfaz para el motor de expresiones regulares, lo que le permite compilar RE en objetos y luego realizar coincidencias con ellos.

source: Compiling Regular Expressions
es: Compilando expresiones regulares

source: Regular expressions are compiled into pattern objects, which have methods for various operations such as searching for pattern matches or performing string substitutions. ::
es: Las expresiones regulares se compilan en objetos de patrón, que tienen métodos para diversas operaciones, como buscar coincidencias de patrones o realizar sustituciones de cadenas de caracteres. ::
