Repository: python/python-docs-es
Catalog: howto/regex.po
Languages: es

source: The syntax for a named group is one of the Python-specific extensions: ``(?P<name>...)``. *name* is, obviously, the name of the group. Named groups behave exactly like capturing groups, and additionally associate a name with a group. The :ref:`match object <match-objects>` methods that deal with capturing groups all accept either integers that refer to the group by number or strings that contain the desired group's name. Named groups are still given numbers, so you can retrieve information about a group in two ways::
es: La sintaxis de un grupo con nombre es una de las extensiones específicas de Python: ``(?P<name>...)``. *name* es, obviamente, el nombre del grupo. Los grupos con nombre se comportan exactamente como los grupos de captura y, además, asocian un nombre con un grupo. Los métodos :ref:`match object <match-objects>` que tratan con la captura de grupos aceptan enteros que se refieren al grupo por número o cadenas de caracteres que contienen el nombre del grupo deseado. Los grupos con nombre todavía reciben números, por lo que puede recuperar información sobre un grupo de dos maneras:

source: Additionally, you can retrieve named groups as a dictionary with :meth:`~re.Match.groupdict`::
es: Además, puede recuperar grupos nombrados como un diccionario con :meth:`~re.Match.groupdict`::

source: Named groups are handy because they let you use easily remembered names, instead of having to remember numbers. Here's an example RE from the :mod:`imaplib` module::
es: Los grupos nombrados son útiles porque le permiten usar nombres fáciles de recordar en lugar de tener que recordar números. Aquí hay un ejemplo de una RE del módulo :mod:`imaplib`::

source: It's obviously much easier to retrieve ``m.group('zonem')``, instead of having to remember to retrieve group 9.
es: Obviamente, es mucho más fácil recuperar ``m.group('zonem')``, en lugar de tener que recordar recuperar el grupo 9.

source: The syntax for backreferences in an expression such as ``(...)\1`` refers to the number of the group. There's naturally a variant that uses the group name instead of the number. This is another Python extension: ``(?P=name)`` indicates that the contents of the group called *name* should again be matched at the current point. The regular expression for finding doubled words, ``\b(\w+)\s+\1\b`` can also be written as ``\b(?P<word>\w+)\s+(?P=word)\b``::
es: La sintaxis de las referencias inversas en una expresión como ``(...)\1`` se refiere al número del grupo. Naturalmente, existe una variante que usa el nombre del grupo en lugar del número. Esta es otra extensión de Python: ``(?P=name)`` indica que el contenido del grupo llamado *name* debe coincidir nuevamente en el punto actual. La expresión regular para encontrar palabras duplicadas, ``\b(\w+)\s+\1\b`` también se puede escribir como ``\b(?P<word>\w+)\s+(?P=word)\b``::

source: Lookahead Assertions
es: Aserciones anticipadas

source: Another zero-width assertion is the lookahead assertion. Lookahead assertions are available in both positive and negative form, and look like this:
es: Otra aserción de ancho cero es la aserción de anticipación. Las afirmaciones anticipadas están disponibles tanto en forma positiva como negativa, y tienen este aspecto:

source: Positive lookahead assertion. This succeeds if the contained regular expression, represented here by ``...``, successfully matches at the current location, and fails otherwise. But, once the contained expression has been tried, the matching engine doesn't advance at all; the rest of the pattern is tried right where the assertion started.
es: Aserción de anticipación positiva. Esto tiene éxito si la expresión regular contenida, representada aquí por ``...``, coincide con éxito en la ubicación actual y falla en caso contrario. Pero, una vez que se ha probado la expresión contenida, el motor de comparación no avanza en absoluto; el resto del patrón se intenta justo donde comenzó la aserción.

source: Negative lookahead assertion. This is the opposite of the positive assertion; it succeeds if the contained expression *doesn't* match at the current position in the string.
es: Aserción de anticipación negativa. Esto es lo opuesto a la flag positiva; tiene éxito si la expresión contenida *no* coincide con la posición actual en la cadena.

source: To make this concrete, let's look at a case where a lookahead is useful. Consider a simple pattern to match a filename and split it apart into a base name and an extension, separated by a ``.``. For example, in ``news.rc``, ``news`` is the base name, and ``rc`` is the filename's extension.
es: Para que esto sea concreto, veamos un caso en el que una búsqueda anticipada es útil. Considere un patrón simple para hacer coincidir un nombre de archivo y dividirlo en un nombre base y una extensión, separados por un ``.``. Por ejemplo, en ``news.rc``, ``news`` es el nombre base y ``rc`` es la extensión del nombre del archivo.

source: The pattern to match this is quite simple:
es: El patrón para que coincida con esto es bastante simple:

source: Notice that the ``.`` needs to be treated specially because it's a metacharacter, so it's inside a character class to only match that specific character. Also notice the trailing ``$``; this is added to ensure that all the rest of the string must be included in the extension. This regular expression matches ``foo.bar`` and ``autoexec.bat`` and ``sendmail.cf`` and ``printers.conf``.
es: Tenga en cuenta que el ``.`` Debe tratarse especialmente porque es un metacarácter, por lo que está dentro de una clase de carácter para coincidir solo con ese carácter específico. También observe el final ``$``; esto se agrega para garantizar que todo el resto de la cadena deba incluirse en la extensión. Esta expresión regular coincide con ``foo.bar`` y ``autoexec.bat`` y ``sendmail.cf`` y ``printers.conf``.

source: Now, consider complicating the problem a bit; what if you want to match filenames where the extension is not ``bat``? Some incorrect attempts:
es: Ahora, considere complicar un poco el problema; ¿Qué sucede si desea hacer coincidir los nombres de archivo donde la extensión no es ``bat``? Algunos intentos incorrectos:

source: ``.*[.][^b].*$`` The first attempt above tries to exclude ``bat`` by requiring that the first character of the extension is not a ``b``. This is wrong, because the pattern also doesn't match ``foo.bar``.
es: ``.*[.][^b].*$`` El primer intento anterior intenta excluir ``bat`` requiriendo que el primer carácter de la extensión no sea una ``b``. Esto está mal, porque el patrón tampoco coincide ``foo.bar``.

source: The expression gets messier when you try to patch up the first solution by requiring one of the following cases to match: the first character of the extension isn't ``b``; the second character isn't ``a``; or the third character isn't ``t``. This accepts ``foo.bar`` and rejects ``autoexec.bat``, but it requires a three-letter extension and won't accept a filename with a two-letter extension such as ``sendmail.cf``. We'll complicate the pattern again in an effort to fix it.
es: La expresión se vuelve más desordenada cuando intenta parchear la primera solución requiriendo que coincida uno de los siguientes casos: el primer carácter de la extensión no es ``b``; el segundo carácter no es ``a``; o el tercer carácter no es ``t``. Esto acepta ``foo.bar`` y rechaza ``autoexec.bat``, pero requiere una extensión de tres letras y no acepta un nombre de archivo con una extensión de dos letras como ``sendmail.cf``. Complicaremos el patrón nuevamente en un esfuerzo por arreglarlo.

source: In the third attempt, the second and third letters are all made optional in order to allow matching extensions shorter than three characters, such as ``sendmail.cf``.
es: En el tercer intento, la segunda y tercera letras se hacen opcionales para permitir extensiones coincidentes de menos de tres caracteres, como ``sendmail.cf``.

source: The pattern's getting really complicated now, which makes it hard to read and understand. Worse, if the problem changes and you want to exclude both ``bat`` and ``exe`` as extensions, the pattern would get even more complicated and confusing.
es: El patrón se está volviendo realmente complicado ahora, lo que dificulta su lectura y comprensión. Peor aún, si el problema cambia y desea excluir tanto ``bat`` y ``exe`` como extensiones, el patrón se volvería aún más complicado y confuso.

source: A negative lookahead cuts through all this confusion:
es: Una mirada anticipada negativa atraviesa toda esta confusión:

source: ``.*[.](?!bat$)[^.]*$`` The negative lookahead means: if the expression ``bat`` doesn't match at this point, try the rest of the pattern; if ``bat$`` does match, the whole pattern will fail. The trailing ``$`` is required to ensure that something like ``sample.batch``, where the extension only starts with ``bat``, will be allowed. The ``[^.]*`` makes sure that the pattern works when there are multiple dots in the filename.
es: ``.*[.](?!bat$)[^.]*$`` La búsqueda anticipada negativa significa: si la expresión ``bat`` no coincide en este punto, pruebe el resto del patrón; si ``bat$`` coincide, todo el patrón fallará. El ``$`` final es necesario para garantizar que se permita algo como ``sample.batch``, donde la extensión solo comienza con ``bat``. El ``[^.]*`` asegura que el patrón funcione cuando hay varios puntos en el nombre del archivo.

source: Excluding another filename extension is now easy; simply add it as an alternative inside the assertion. The following pattern excludes filenames that end in either ``bat`` or ``exe``:
es: Ahora es fácil excluir otra extensión de nombre de archivo; simplemente agréguelo como una alternativa dentro de la aserción. El siguiente patrón excluye los nombres de archivo que terminan en ``bat`` o ``exe``:

source: Modifying Strings
es: Modificando cadenas de caracteres

source: Up to this point, we've simply performed searches against a static string. Regular expressions are also commonly used to modify strings in various ways, using the following pattern methods:
es: Hasta este punto, simplemente hemos realizado búsquedas en una cadena de caracteres estática. Las expresiones regulares también se utilizan comúnmente para modificar cadenas de varias formas, utilizando los siguientes métodos de patrón:

source: Split the string into a list, splitting it wherever the RE matches
es: Divida la cadena de caracteres en una lista, dividiéndola donde coincida la RE

source: Find all substrings where the RE matches, and replace them with a different string
es: Encuentra todas las subcadenas de caracteres donde coincida la RE y las reemplaza con una cadena de caracteres diferente

source: Does the same thing as :meth:`!sub`, but returns the new string and the number of replacements
es: Hace lo mismo que :meth:`!sub`, pero retorna la nueva cadena de caracteres y el número de reemplazos

source: Splitting Strings
es: Separando cadenas de caracteres

source: The :meth:`~re.Pattern.split` method of a pattern splits a string apart wherever the RE matches, returning a list of the pieces. It's similar to the :meth:`~str.split` method of strings but provides much more generality in the delimiters that you can split by; string :meth:`!split` only supports splitting by whitespace or by a fixed string. As you'd expect, there's a module-level :func:`re.split` function, too.
es: El método :meth:`~re.Pattern.split` de un patrón que divide una cadena de caracteres donde la RE coincide, retornando una lista de las piezas. Es similar al método de cadenas de caracteres :meth:`~str.split` pero proporciona mucha más generalidad en los delimitadores por los que puede dividir; cadena de caracteres :meth:`!split` solo admite la división por espacios en blanco o por una cadena fija. Como era de esperar, también hay una función a nivel de módulo :func:`re.split`.

source: Split *string* by the matches of the regular expression. If capturing parentheses are used in the RE, then their contents will also be returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits are performed.
es: Dividir *string* por las coincidencias de la expresión regular. Si se utilizan paréntesis de captura en la RE, su contenido también se retornará como parte de la lista resultante. Si *maxsplit* es distinto de cero, se realizan como máximo divisiones *maxsplit* .

source: You can limit the number of splits made, by passing a value for *maxsplit*. When *maxsplit* is nonzero, at most *maxsplit* splits will be made, and the remainder of the string is returned as the final element of the list. In the following example, the delimiter is any sequence of non-alphanumeric characters. ::
es: Puede limitar el número de divisiones realizadas, pasando un valor para *maxsplit*. Cuando *maxsplit* es distinto de cero, se realizarán como máximo *maxsplit* divisiones, y el resto de la cadena de caracteres se retorna como el elemento final de la lista. En el siguiente ejemplo, el delimitador es cualquier secuencia de caracteres no alfanuméricos. ::

source: Sometimes you're not only interested in what the text between delimiters is, but also need to know what the delimiter was. If capturing parentheses are used in the RE, then their values are also returned as part of the list. Compare the following calls::
es: A veces, no solo le interesa cuál es el texto entre delimitadores, sino que también necesita saber cuál era el delimitador. Si se utilizan paréntesis de captura en la RE, sus valores también se retornan como parte de la lista. Compare las siguientes llamadas:

source: The module-level function :func:`re.split` adds the RE to be used as the first argument, but is otherwise the same. ::
es: La función de nivel de módulo :func:`re.split` agrega la RE que se usará como primer argumento, pero por lo demás es el mismo. ::

source: Search and Replace
es: Búsqueda y reemplazo

source: Another common task is to find all the matches for a pattern, and replace them with a different string. The :meth:`~re.Pattern.sub` method takes a replacement value, which can be either a string or a function, and the string to be processed.
es: Otra tarea común es encontrar todas las coincidencias para un patrón y reemplazarlas con una cadena de caracteres diferente. El método :meth:`~re.Pattern.sub` toma un valor de reemplazo, que puede ser una cadena de caracteres o una función, y la cadena de caracteres a procesar.

source: Returns the string obtained by replacing the leftmost non-overlapping occurrences of the RE in *string* by the replacement *replacement*. If the pattern isn't found, *string* is returned unchanged.
es: Retorna la cadena de caracteres obtenida al reemplazar las apariciones no superpuestas del extremo izquierdo de la RE en *string* por el reemplazo *replacement*. Si no se encuentra el patrón, el *string* se retorna sin cambios.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. The default value of 0 means to replace all occurrences.
es: El argumento opcional *count* es el número máximo de ocurrencias de patrones que se reemplazarán; *count* debe ser un número entero no negativo. El valor predeterminado de 0 significa reemplazar todas las ocurrencias.

source: Here's a simple example of using the :meth:`~re.Pattern.sub` method. It replaces colour names with the word ``colour``::
es: Aquí hay un ejemplo simple del uso del método :meth:`~re.Pattern.sub`. Reemplaza los nombres de los colores con la palabra ``colour``::

source: The :meth:`~re.Pattern.subn` method does the same work, but returns a 2-tuple containing the new string value and the number of replacements that were performed::
es: El método :meth:`~re.Pattern.subn` hace el mismo trabajo, pero retorna una tupla de 2 que contiene el nuevo valor de cadena de caracteres y el número de reemplazos que se realizaron::

source: Empty matches are replaced only when they're not adjacent to a previous empty match. ::
es: Las coincidencias vacías se reemplazan solo cuando no son adyacentes a una coincidencia vacía anterior. ::

source: If *replacement* is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by the corresponding group in the RE. This lets you incorporate portions of the original text in the resulting replacement string.
es: Si *replacement* es una cadena, se procesan los escapes de barra invertida que contenga. Es decir, ``\n`` se convierte en un solo carácter de nueva línea, ``\r`` se convierte en una REtorno de carro, y así sucesivamente. Los escapes desconocidos como ``\&`` se dejan en paz. Las referencias inversas, como ``\6``, se reemplazan con la subcadena de caracteres que coincide con el grupo correspondiente a la RE. Esto le permite incorporar partes del texto original en la cadena de reemplazo resultante.

source: This example matches the word ``section`` followed by a string enclosed in ``{``, ``}``, and changes ``section`` to ``subsection``::
es: Este ejemplo hace coincidir la palabra ``section`` seguida de una cadena encerrada entre ``{``, ``}``, y cambia ``section`` a ``subsection``::

source: There's also a syntax for referring to named groups as defined by the ``(?P<name>...)`` syntax. ``\g<name>`` will use the substring matched by the group named ``name``, and ``\g<number>`` uses the corresponding group number. ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement string such as ``\g<2>0``. (``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``.) The following substitutions are all equivalent, but use all three variations of the replacement string. ::
es: También hay una sintaxis para hacer referencia a grupos con nombre según lo definido por la sintaxis ``(?P<name>…)``. ``\g<name>`` usará la subcadena de caracteres que coincide con el grupo llamado ``name``, y ``\g<number>`` usa el número de grupo correspondiente. ``\g<2>`` es equivalente a ``\2``, pero no es ambiguo en una cadena de reemplazo como ``\g<2>0``. (``\20`` se interpretaría como una referencia al grupo 20, no como una referencia al grupo 2 seguido del carácter literal ``'0'``.) Las siguientes sustituciones son todas equivalentes, pero use las tres variaciones de la cadena de reemplazo. ::

source: *replacement* can also be a function, which gives you even more control. If *replacement* is a function, the function is called for every non-overlapping occurrence of *pattern*. On each call, the function is passed a :ref:`match object <match-objects>` argument for the match and can use this information to compute the desired replacement string and return it.
es: *replacement* también puede ser una función, lo que le brinda aún más control. Si *replacement* es una función, la función se llama para cada ocurrencia no superpuesta de *pattern*. En cada llamada, a la función se le pasa un argumento :ref:`match object <match-objects>` para la coincidencia y puede usar esta información para calcular la cadena de reemplazo deseada y retornarla.

source: In the following example, the replacement function translates decimals into hexadecimal::
es: En el siguiente ejemplo, la función de reemplazo traduce decimales a hexadecimales::

source: When using the module-level :func:`re.sub` function, the pattern is passed as the first argument. The pattern may be provided as an object or as a string; if you need to specify regular expression flags, you must either use a pattern object as the first parameter, or use embedded modifiers in the pattern string, e.g. ``sub("(?i)b+", "x", "bbbb BBBB")`` returns ``'x x'``.
es: Cuando se usa la función *module-level* :func:`re.sub`, el patrón se pasa como primer argumento. El patrón puede proporcionarse como un objeto o como una cuerda; Si necesita especificar marcas de expresión regular, debe usar un objeto de patrón como primer parámetro o usar modificadores incrustados en la cadena de patrón, por ejemplo ``sub("(?i)b+", "x", "bbbb BBBB")`` retorna ``'x x'``.

source: Common Problems
es: Problemas comunes

source: Regular expressions are a powerful tool for some applications, but in some ways their behaviour isn't intuitive and at times they don't behave the way you may expect them to. This section will point out some of the most common pitfalls.
es: Las expresiones regulares son una herramienta poderosa para algunas aplicaciones, pero de alguna manera su comportamiento no es intuitivo y, a veces, no se comportan de la forma esperada. Esta sección señalará algunos de los errores más comunes.

source: Use String Methods
es: Uso de métodos de cadenas de caracteres

source: Sometimes using the :mod:`re` module is a mistake. If you're matching a fixed string, or a single character class, and you're not using any :mod:`re` features such as the :const:`~re.IGNORECASE` flag, then the full power of regular expressions may not be required. Strings have several methods for performing operations with fixed strings and they're usually much faster, because the implementation is a single small C loop that's been optimized for the purpose, instead of the large, more generalized regular expression engine.
es: A veces, usar el módulo :mod:`re` es un error. Si está haciendo coincidir una cadena de caracteres fija, o una clase de un solo caracter, y no está usando ninguna característica :mod:`re` como la marca :const:`~re.IGNORECASE`, entonces todo el poder de las expresiones regulares puede que no sea necesario. Las cadenas tienen varios métodos para realizar operaciones con cadenas fijas y, por lo general, son mucho más rápidas, porque la implementación es un único bucle C pequeño que se ha optimizado para este propósito, en lugar del motor de expresión regular más grande y generalizado.

source: One example might be replacing a single fixed string with another one; for example, you might replace ``word`` with ``deed``. :func:`re.sub` seems like the function to use for this, but consider the :meth:`~str.replace` method. Note that :meth:`!replace` will also replace ``word`` inside words, turning ``swordfish`` into ``sdeedfish``, but the naive RE ``word`` would have done that, too. (To avoid performing the substitution on parts of words, the pattern would have to be ``\bword\b``, in order to require that ``word`` have a word boundary on either side. This takes the job beyond :meth:`!replace`'s abilities.)
es: Un ejemplo podría ser reemplazar una sola cadena fija por otra; por ejemplo, puede reemplazar ``word`` por ``deed``. :func:`re.sub` parece la función a utilizar para esto, pero considere el método :meth:`~str.replace`. Tenga en cuenta que :meth:`!replace` también reemplazará ``word`` dentro de las palabras, convirtiendo ``swordfish`` en ``sdeedfish``, pero la RE naíf ``word`` también lo habría hecho. (Para evitar realizar la sustitución en partes de palabras, el patrón tendría que ser ``\bword\b``, para requerir que ``word`` tenga un límite de palabra en cada lado. Esto lleva el trabajo más allá de las habilidades de :meth:`!replace`.)
