Repository: python/python-docs-es
Catalog: howto/sorting.po
Languages: es

source: Sorting HOW TO
es: HOW TO - Ordenar

source: Author
es: Autor

source: Release
es: Versión

source: Python lists have a built-in :meth:`list.sort` method that modifies the list in-place. There is also a :func:`sorted` built-in function that builds a new sorted list from an iterable.
es: Las listas de Python tienen un método incorporado :meth:`list.sort` que modifica la lista in situ. También hay una función incorporada :func:`sorted` que crea una nueva lista ordenada a partir de un iterable.

source: In this document, we explore the various techniques for sorting data using Python.
es: En este documento exploramos las distintas técnicas para ordenar datos usando Python.

source: Sorting Basics
es: Conceptos básicos de ordenación

source: A simple ascending sort is very easy: just call the :func:`sorted` function. It returns a new sorted list:
es: Una clasificación ascendente simple es muy fácil: simplemente llame a la función :func:`sorted`. Retorna una nueva lista ordenada:

source: You can also use the :meth:`list.sort` method. It modifies the list in-place (and returns ``None`` to avoid confusion). Usually it's less convenient than :func:`sorted` - but if you don't need the original list, it's slightly more efficient.
es: También puede usar el método :meth:`list.sort`. Modifica la lista in situ (y retorna ``None`` para evitar confusiones). Por lo general, es menos conveniente que :func:`sorted`, pero si no necesita la lista original, es un poco más eficiente.

source: Another difference is that the :meth:`list.sort` method is only defined for lists. In contrast, the :func:`sorted` function accepts any iterable.
es: Otra diferencia es que el método :meth:`list.sort` solo aplica para las listas. En contraste, la función :func:`sorted` acepta cualquier iterable.

source: Key Functions
es: Funciones clave

source: Both :meth:`list.sort` and :func:`sorted` have a *key* parameter to specify a function (or other callable) to be called on each list element prior to making comparisons.
es: Ambos :meth:`list.sort` y :func:`sorted` tienen un parámetro *key* para especificar una función (u otra invocable) que se llamará en cada elemento de la lista antes de hacer comparaciones.

source: For example, here's a case-insensitive string comparison:
es: Por ejemplo, aquí hay una comparación de cadenas que no distingue entre mayúsculas y minúsculas:

source: The value of the *key* parameter should be a function (or other callable) that takes a single argument and returns a key to use for sorting purposes. This technique is fast because the key function is called exactly once for each input record.
es: El valor del parámetro *key* debe ser una función (u otra invocable) que tome un solo argumento y retorne una clave para usar con fines de clasificación. Esta técnica es rápida porque la función de la tecla se llama exactamente una vez para cada registro de entrada.

source: A common pattern is to sort complex objects using some of the object's indices as keys. For example:
es: Un uso frecuente es ordenar objetos complejos utilizando algunos de los índices del objeto como claves. Por ejemplo:

source: The same technique works for objects with named attributes. For example:
es: La misma técnica funciona para objetos con atributos nombrados. Por ejemplo:

source: Operator Module Functions
es: Funciones del módulo *operator*

source: The key-function patterns shown above are very common, so Python provides convenience functions to make accessor functions easier and faster. The :mod:`operator` module has :func:`~operator.itemgetter`, :func:`~operator.attrgetter`, and a :func:`~operator.methodcaller` function.
es: Las funciones clave utilizadas anteriormente son muy comunes, por lo que Python proporciona funciones para facilitar y agilizar el uso de las funciones de acceso. El módulo :mod:`operator` contiene las funciones :func:`~operator.itemgetter`, :func:`~operator.attrgetter`, y :func:`~operator.methodcaller`.

source: Using those functions, the above examples become simpler and faster:
es: Usando esas funciones, los ejemplos anteriores se vuelven más simples y rápidos:

source: The operator module functions allow multiple levels of sorting. For example, to sort by *grade* then by *age*:
es: Las funciones del módulo *operator* permiten múltiples niveles de clasificación. Por ejemplo, para ordenar por *grade* y luego por *age*:

source: Ascending and Descending
es: Ascendente y descendente

source: Both :meth:`list.sort` and :func:`sorted` accept a *reverse* parameter with a boolean value. This is used to flag descending sorts. For example, to get the student data in reverse *age* order:
es: Ambos :meth:`list.sort` y :func:`sorted` aceptan un parámetro *reverse* con un valor booleano. Esto se usa para marcar tipos descendentes. Por ejemplo, para obtener los datos de los estudiantes en orden inverso de *edad*:

source: Sort Stability and Complex Sorts
es: Estabilidad de ordenamiento y ordenamientos complejos

source: Sorts are guaranteed to be `stable <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\. That means that when multiple records have the same key, their original order is preserved.
es: Se garantiza que las clasificaciones serán `estables <https://es.wikipedia.org/wiki/Algoritmo_de_ordenamiento#Estabilidad>`_\. Eso significa que cuando varios registros tienen la misma clave, se conserva su orden original.

source: Notice how the two records for *blue* retain their original order so that ``('blue', 1)`` is guaranteed to precede ``('blue', 2)``.
es: Observe cómo los dos registros para *blue* conservan su orden original de modo que se garantice que ``('blue', 1)`` preceda a ``('blue', 2)``.

source: This wonderful property lets you build complex sorts in a series of sorting steps. For example, to sort the student data by descending *grade* and then ascending *age*, do the *age* sort first and then sort again using *grade*:
es: Esta maravillosa propiedad le permite construir ordenamientos complejos en varias etapas. Por ejemplo, para ordenar los datos de estudiantes en orden descendente por *grade* y luego ascendente por *age*, ordene primero por *age* y luego por *grade*:

source: This can be abstracted out into a wrapper function that can take a list and tuples of field and order to sort them on multiple passes.
es: Esto se puede encapsular en una función que tome una lista y tuplas (atributo, orden) para ordenarlas por múltiples pases.

source: The `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ algorithm used in Python does multiple sorts efficiently because it can take advantage of any ordering already present in a dataset.
es: El algoritmo `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ utilizado en Python realiza múltiples ordenamientos de manera eficiente porque puede aprovechar cualquier orden ya presente en el conjunto de datos.

source: This idiom is called Decorate-Sort-Undecorate after its three steps:
es: Este patrón de implementación, llamado DSU (por sus siglas en inglés *Decorate-Sort-Undecorate*), se realiza en tres pasos:

source: First, the initial list is decorated with new values that control the sort order.
es: Primero, la lista inicial está "decorada" con nuevos valores que controlarán el orden en que se realizará el pedido.

source: Second, the decorated list is sorted.
es: En segundo lugar, se ordena la lista decorada.

source: Finally, the decorations are removed, creating a list that contains only the initial values in the new order.
es: Finalmente, los valores decorados se eliminan, creando una lista que contiene solo los valores iniciales en el nuevo orden.

source: For example, to sort the student data by *grade* using the DSU approach:
es: Por ejemplo, para ordenar los datos de los estudiantes por *grade* utilizando el enfoque DSU:

source: This idiom works because tuples are compared lexicographically; the first items are compared; if they are the same then the second items are compared, and so on.
es: Esta técnica funciona porque las tuplas se comparan en orden lexicográfico; se comparan los primeros objetos; si hay objetos idénticos, se compara el siguiente objeto, y así sucesivamente.

source: It is not strictly necessary in all cases to include the index *i* in the decorated list, but including it gives two benefits:
es: No es estrictamente necesario en todos los casos incluir el índice *i* en la lista decorada, pero incluirlo ofrece dos ventajas:

source: The sort is stable -- if two items have the same key, their order will be preserved in the sorted list.
es: El orden es estable: si dos elementos tienen la misma clave, su orden se conservará en la lista ordenada.

source: The original items do not have to be comparable because the ordering of the decorated tuples will be determined by at most the first two items. So for example the original list could contain complex numbers which cannot be sorted directly.
es: Los elementos originales no tienen que ser comparables porque el orden de las tuplas decoradas estará determinado por, como máximo, los dos primeros elementos. Entonces, por ejemplo, la lista original podría contener números complejos que no se pueden ordenar directamente.

source: Another name for this idiom is `Schwartzian transform <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, after Randal L. Schwartz, who popularized it among Perl programmers.
es: Otro nombre para esta técnica es `Transformación Schwartziana <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, después de que Randal L. Schwartz la popularizara entre los programadores de Perl.

source: Now that Python sorting provides key-functions, this technique is not often needed.
es: Ahora que la clasificación de Python proporciona funciones clave, esta técnica ya no se usa con frecuencia.

source: Comparison Functions
es: Funciones de comparación

source: Unlike key functions that return an absolute value for sorting, a comparison function computes the relative ordering for two inputs.
es: A diferencia de las funciones clave que devuelven un valor absoluto para la ordenación, una función de comparación calcula la ordenación relativa para dos entradas.

source: For example, a `balance scale <https://upload.wikimedia.org/wikipedia/commons/1/17/Balance_à_tabac_1850.JPG>`_ compares two samples giving a relative ordering: lighter, equal, or heavier. Likewise, a comparison function such as ``cmp(a, b)`` will return a negative value for less-than, zero if the inputs are equal, or a positive value for greater-than.
es: Por ejemplo, una `escala de balance <https://upload.wikimedia.org/wikipedia/commons/1/17/Balance_à_tabac_1850.JPG>`_ compara dos muestras dando un orden relativo: más ligero, igual o más pesado. Del mismo modo, una función de comparación como ``cmp(a, b)`` devolverá un valor negativo para menor que, cero si las entradas son iguales, o un valor positivo para mayor que.

source: It is common to encounter comparison functions when translating algorithms from other languages. Also, some libraries provide comparison functions as part of their API. For example, :func:`locale.strcoll` is a comparison function.
es: Es habitual encontrar funciones de comparación al traducir algoritmos de otros lenguajes. Además, algunas bibliotecas proporcionan funciones de comparación como parte de su API. Por ejemplo, :func:`locale.strcoll` es una función de comparación.

source: To accommodate those situations, Python provides :class:`functools.cmp_to_key` to wrap the comparison function to make it usable as a key function::
es: Para adaptarse a estas situaciones, Python proporciona :class:`functools.cmp_to_key` para envolver la función de comparación y hacerla utilizable como una función clave::

source: Odds and Ends
es: Curiosidades

source: For locale aware sorting, use :func:`locale.strxfrm` for a key function or :func:`locale.strcoll` for a comparison function. This is necessary because "alphabetical" sort orderings can vary across cultures even if the underlying alphabet is the same.
es: Para ordenar teniendo en cuenta la localización, utilice :func:`locale.strxfrm` para una función clave o :func:`locale.strcoll` para una función de comparación. Esto es necesario porque la ordenación "alfabética" puede variar entre culturas aunque el alfabeto subyacente sea el mismo.

source: The *reverse* parameter still maintains sort stability (so that records with equal keys retain the original order). Interestingly, that effect can be simulated without the parameter by using the builtin :func:`reversed` function twice:
es: El parámetro *reverse* aún mantiene estabilidad de ordenamiento (de modo que los registros con claves iguales conservan el orden original). Curiosamente, ese efecto se puede simular sin el parámetro utilizando la función incorporada :func:`reversed` dos veces:

source: The sort routines use ``<`` when making comparisons between two objects. So, it is easy to add a standard sort order to a class by defining an :meth:`__lt__` method:
es: Las rutinas de ordenación utilizan ``<`` cuando realizan comparaciones entre dos objetos. Por lo tanto, es fácil añadir una ordenación estándar a una clase definiendo un método :meth:`__lt__`:

source: However, note that ``<`` can fall back to using :meth:`__gt__` if :meth:`__lt__` is not implemented (see :func:`object.__lt__`).
es: Sin embargo, tenga en cuenta que ``<`` puede recurrir a usar :meth:`__gt__` si :meth:`__lt__` no está implementado (ver :func:`object.__lt__`).

source: Key functions need not depend directly on the objects being sorted. A key function can also access external resources. For instance, if the student grades are stored in a dictionary, they can be used to sort a separate list of student names:
es: Las funciones clave no necesitan depender directamente de los objetos que se ordenan. Una función clave también puede acceder a recursos externos. Por ejemplo, si las calificaciones de los estudiantes se almacenan en un diccionario, se pueden usar para ordenar una lista separada de nombres de estudiantes:
