Repository: python/python-docs-es
Catalog: howto/urllib2.po
Languages: es_ar

source: HOWTO Fetch Internet Resources Using The urllib Package
es_ar: HOWTO - Cómo obtener recursos de Internet con el paquete urllib

source: Author
es_ar: Autor

source: Introduction
es_ar: Introducción

source: You may also find useful the following article on fetching web resources with Python:
es_ar: También puedes encontrar útil el siguiente artículo sobre la obtención de recursos web con Python:

source: `Basic Authentication <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`_
es_ar: `Basic Authentication <http://www.voidspace.org.uk/python/articles/authentication.shtml>`_

source: A tutorial on *Basic Authentication*, with examples in Python.
es_ar: Un tutorial sobre *Autenticación Básica*, con ejemplos en Python.

source: **urllib.request** is a Python module for fetching URLs (Uniform Resource Locators). It offers a very simple interface, in the form of the *urlopen* function. This is capable of fetching URLs using a variety of different protocols. It also offers a slightly more complex interface for handling common situations - like basic authentication, cookies, proxies and so on. These are provided by objects called handlers and openers.
es_ar: **urllib.request** es un módulo Python para acceder y utilizar recursos de internet identificados por URLs (*Uniform Resource Locators*). Ofrece una interfaz muy simple, a través de la función *urlopen*. Esta función es capaz de acceder a URLs usando una variedad de protocolos diferentes. También ofrece una interfaz un poco más compleja para manejar situaciones comunes - como la autenticación básica, cookies y proxies, entre otros. Estos son proporcionados por los llamados objetos de apertura y gestores.

source: urllib.request supports fetching URLs for many "URL schemes" (identified by the string before the ``":"`` in URL - for example ``"ftp"`` is the URL scheme of ``"ftp://python.org/"``) using their associated network protocols (e.g. FTP, HTTP). This tutorial focuses on the most common case, HTTP.
es_ar: urllib.request soporta la obtención de recursos identificados por URLs para muchos "esquemas de URL" (identificados por la cadena de texto ubicada antes del ``":"`` en el URL - por ejemplo ``"ftp"`` es el esquema de URL de ``"ftp://python.org/"``) usando sus protocolos de red asociados (por ejemplo FTP, HTTP). Este tutorial se centra en el caso más común, HTTP.

source: For straightforward situations *urlopen* is very easy to use. But as soon as you encounter errors or non-trivial cases when opening HTTP URLs, you will need some understanding of the HyperText Transfer Protocol. The most comprehensive and authoritative reference to HTTP is :rfc:`2616`. This is a technical document and not intended to be easy to read. This HOWTO aims to illustrate using *urllib*, with enough detail about HTTP to help you through. It is not intended to replace the :mod:`urllib.request` docs, but is supplementary to them.
es_ar: Para situaciones sencillas *urlopen* es muy fácil de usar. Pero tan pronto como encuentres errores o casos no triviales al abrir URLs HTTP, necesitarás entender el Protocolo de Transferencia de Hipertexto. La referencia más completa y autorizada para HTTP es :rfc:`2616`. Este es un documento técnico y no pretende ser fácil de leer. Este HOWTO tiene como objetivo ilustrar el uso de la *urllib*, con suficientes detalles sobre HTTP para ayudarte a entenderlo. No pretende reemplazar los documentos :mod:`urllib.request`, pero es complementario a ellos.

source: Fetching URLs
es_ar: Obtención de URLs

source: The simplest way to use urllib.request is as follows::
es_ar: La forma más simple de usar urllib.request es la siguiente::

source: If you wish to retrieve a resource via URL and store it in a temporary location, you can do so via the :func:`shutil.copyfileobj` and :func:`tempfile.NamedTemporaryFile` functions::
es_ar: Si deseas recuperar un recurso a partir de la URL y almacenarlo en una ubicación temporal, puede hacerlo a través de las funciones :func:`shutil.copyfileobj` y :func:`tempfile.NamedTemporaryFile`::

source: Many uses of urllib will be that simple (note that instead of an 'http:' URL we could have used a URL starting with 'ftp:', 'file:', etc.). However, it's the purpose of this tutorial to explain the more complicated cases, concentrating on HTTP.
es_ar: Muchos usos de urllib serán así de sencillos (nótese que en lugar de una URL 'http:' podríamos haber usado una URL que empezara por 'ftp:', 'file:', etc.). Sin embargo, el propósito de este tutorial es explicar los casos más complicados, concentrándose en el HTTP.

source: HTTP is based on requests and responses - the client makes requests and servers send responses. urllib.request mirrors this with a ``Request`` object which represents the HTTP request you are making. In its simplest form you create a Request object that specifies the URL you want to fetch. Calling ``urlopen`` with this Request object returns a response object for the URL requested. This response is a file-like object, which means you can for example call ``.read()`` on the response::
es_ar: HTTP se basa en peticiones y respuestas - el cliente hace peticiones y los servidores envían respuestas. urllib.request refleja esto con un objeto ``Request`` que representa la petición HTTP que estás haciendo. En su forma más simple se crea un objeto Request que especifica la URL que se quiere obtener. Llamar a ``urlopen`` con este objeto Request retorna un objeto respuesta para la URL solicitada. Esta respuesta es un objeto tipo archivo, lo que significa que puedes por ejemplo llamar a ``.read()`` en la respuesta::

source: Note that urllib.request makes use of the same Request interface to handle all URL schemes. For example, you can make an FTP request like so::
es_ar: Tenga en cuenta que urllib.request utiliza la misma interfaz de Request para gestionar todos los esquemas de URL. Por ejemplo, puedes hacer una petición FTP de la siguiente manera::

source: In the case of HTTP, there are two extra things that Request objects allow you to do: First, you can pass data to be sent to the server. Second, you can pass extra information ("metadata") *about* the data or about the request itself, to the server - this information is sent as HTTP "headers". Let's look at each of these in turn.
es_ar: En el caso de HTTP, hay dos cosas adicionales que los objetos Request le permiten hacer: Primero, puede pasar datos para enviarlos al servidor. En segundo lugar, puede pasar información adicional ("metadatos") *about* los datos o sobre la solicitud en sí, al servidor; esta información se envía como "encabezados" HTTP. Veamos cada uno de estos por turno.

source: Data
es_ar: Datos

source: Sometimes you want to send data to a URL (often the URL will refer to a CGI (Common Gateway Interface) script or other web application). With HTTP, this is often done using what's known as a **POST** request. This is often what your browser does when you submit a HTML form that you filled in on the web. Not all POSTs have to come from forms: you can use a POST to transmit arbitrary data to your own application. In the common case of HTML forms, the data needs to be encoded in a standard way, and then passed to the Request object as the ``data`` argument. The encoding is done using a function from the :mod:`urllib.parse` library. ::
es_ar: A veces quieres enviar datos a una URL (a menudo la URL se referirá a un script CGI (Common Gateway Interface) u otra aplicación web). Con HTTP, esto se hace a menudo usando lo que se conoce como una petición **POST**. Esto es a menudo lo que su navegador hace cuando envías un formulario HTML que has rellenado en la web. No todos los POSTs tienen que provenir de formularios: puedes usar un POST para transmitir datos arbitrarios a tu propia aplicación. En el caso común de los formularios HTML, los datos tienen que ser codificados de forma estándar, y luego pasados al objeto Request como el argumento ``data``. La codificación se hace usando una función de la biblioteca :mod:`urllib.parse``. ::

source: Note that other encodings are sometimes required (e.g. for file upload from HTML forms - see `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ for more details).
es_ar: Ten en cuenta que a veces se requieren otras codificaciones (por ejemplo, para la carga de archivos desde formularios HTML - ver `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ para más detalles).

source: If you do not pass the ``data`` argument, urllib uses a **GET** request. One way in which GET and POST requests differ is that POST requests often have "side-effects": they change the state of the system in some way (for example by placing an order with the website for a hundredweight of tinned spam to be delivered to your door). Though the HTTP standard makes it clear that POSTs are intended to *always* cause side-effects, and GET requests *never* to cause side-effects, nothing prevents a GET request from having side-effects, nor a POST requests from having no side-effects. Data can also be passed in an HTTP GET request by encoding it in the URL itself.
es_ar: Si no pasas el argumento ``data``, urllib usa una petición **GET**. Una de las formas en la que las peticiones GET y POST difieren entre sí es que las peticiones POST a menudo tienen "efectos secundarios": cambian el estado del sistema de alguna manera (por ejemplo, haciendo una petición al sitio para que un centenar de spam chatarra sea entregado a tu dirección). Aunque el estándar HTTP deja claro que las solicitudes POST están *siempre* destinadas a causar efectos secundarios, y las solicitudes GET a *nunca* causar efectos secundarios, nada impide que una solicitud GET tenga efectos secundarios, ni que una solicitud POST no tenga efectos secundarios. Los datos también pueden ser pasados en una solicitud GET HTTP codificándolos en la propia URL.

source: This is done as follows::
es_ar: Esto se hace de la siguiente manera::

source: Notice that the full URL is created by adding a ``?`` to the URL, followed by the encoded values.
es_ar: Nota que la URL completa se crea añadiendo un ``?`` a la URL, seguido de los valores codificados.

source: Headers
es_ar: Encabezados (Headers)

source: We'll discuss here one particular HTTP header, to illustrate how to add headers to your HTTP request.
es_ar: Discutiremos aquí un encabezado HTTP en particular, para ilustrar cómo agregar encabezados a su solicitud HTTP.

source: Some websites [#]_ dislike being browsed by programs, or send different versions to different browsers [#]_. By default urllib identifies itself as ``Python-urllib/x.y`` (where ``x`` and ``y`` are the major and minor version numbers of the Python release, e.g. ``Python-urllib/2.5``), which may confuse the site, or just plain not work. The way a browser identifies itself is through the ``User-Agent`` header [#]_. When you create a Request object you can pass a dictionary of headers in. The following example makes the same request as above, but identifies itself as a version of Internet Explorer [#]_. ::
es_ar: A algunos sitios web [#]_ no les gusta ser navegados por programas, o envían diferentes versiones a diferentes navegadores [#]_. Por defecto urllib se identifica como ``Python-urllib/x.y`` (donde ``x`` y ``y`` son los números mayor y menor de la versión de Python, por ejemplo ``Python-urllib/2.5``), lo que puede confundir el sitio, o simplemente no funcionar. La forma en que un navegador se identifica a sí mismo es a través del encabezado ``User-Agent`` [#]_. Cuando creas un objeto Request puedes pasarle un diccionario de encabezados. El siguiente ejemplo hace la misma petición que arriba, pero se identifica como una versión de Internet Explorer [#]_. ::

source: The response also has two useful methods. See the section on `info and geturl`_ which comes after we have a look at what happens when things go wrong.
es_ar: La respuesta también tiene dos métodos útiles. Ver la sección de `info y geturl`_ que viene después de que echemos un vistazo a lo que pasa cuando las cosas van mal.

source: Handling Exceptions
es_ar: Gestión de excepciones

source: The exception classes are exported from the :mod:`urllib.error` module.
es_ar: Las clases de excepción se exportan desde el módulo :mod:`urllib.error`.

source: Often, URLError is raised because there is no network connection (no route to the specified server), or the specified server doesn't exist. In this case, the exception raised will have a 'reason' attribute, which is a tuple containing an error code and a text error message.
es_ar: A menudo, URLError se genera porque no hay conexión de red (no se encuentra ruta al servidor especificado), o el servidor especificado no existe. En este caso, la excepción generada tendrá un atributo "reason", que es una tupla que contiene un código de error y un mensaje de error de texto.

source: e.g. ::
es_ar: por ejemplo ::

source: See section 10 of :rfc:`2616` for a reference on all the HTTP error codes.
es_ar: Vea la sección 10 de :rfc:`2616` para una referencia sobre todos los códigos de error HTTP.

source: Error Codes
es_ar: Códigos de error

source: Because the default handlers handle redirects (codes in the 300 range), and codes in the 100--299 range indicate success, you will usually only see error codes in the 400--599 range.
es_ar: Debido a que los gestores por defecto gestionan redirecciones (códigos en el rango de 300), y que los códigos en el rango de 100--299 indican éxito, normalmente sólo verás códigos de error en el rango de 400--599.

source: :attr:`http.server.BaseHTTPRequestHandler.responses` is a useful dictionary of response codes in that shows all the response codes used by :rfc:`2616`. The dictionary is reproduced here for convenience ::
es_ar: :attr:`http.server.BaseHTTPRequestHandler.responses` es un diccionario útil de códigos de respuesta en el que se muestran todos los códigos de respuesta utilizados por :rfc:`2616`. El diccionario se reproduce aquí por conveniencia ::

source: Wrapping it Up
es_ar: Resumiéndolo

source: Number 1
es_ar: Número 1

source: Number 2
es_ar: Número 2

source: info and geturl
es_ar: info y geturl

source: **geturl** - this returns the real URL of the page fetched. This is useful because ``urlopen`` (or the opener object used) may have followed a redirect. The URL of the page fetched may not be the same as the URL requested.
es_ar: **geturl** - retorna la verdadera URL de la página obtenida. Esto es útil porque ``urlopen`` (o el objeto de apertura utilizado) puede haber seguido una redirección. El URL de la página obtenida puede no ser el mismo que el URL solicitado.

source: **info** - this returns a dictionary-like object that describes the page fetched, particularly the headers sent by the server. It is currently an :class:`http.client.HTTPMessage` instance.
es_ar: **info** - retorna un objeto parecido a un diccionario que describe la página consultada, particularmente los encabezados enviados por el servidor. Actualmente es una instancia :class:`http.client.HTTPMessage`.

source: Typical headers include 'Content-length', 'Content-type', and so on. See the `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ for a useful listing of HTTP headers with brief explanations of their meaning and use.
es_ar: Los encabezados típicos incluyen 'Content-length', 'Content-type' y así sucesivamente. Mira la `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ para un listado útil de encabezados de HTTP con breves explicaciones de su significado y uso.

source: Openers and Handlers
es_ar: Objetos de Apertura (Openers) y Gestores (Handlers)

source: When you fetch a URL you use an opener (an instance of the perhaps confusingly named :class:`urllib.request.OpenerDirector`). Normally we have been using the default opener - via ``urlopen`` - but you can create custom openers. Openers use handlers. All the "heavy lifting" is done by the handlers. Each handler knows how to open URLs for a particular URL scheme (http, ftp, etc.), or how to handle an aspect of URL opening, for example HTTP redirections or HTTP cookies.
es_ar: Cuando obtienes una URL utilizas una apertura (una instancia de la quizás confusamente llamada :class:`urllib.request.OpenerDirector`). Normalmente hemos estado usando la apertura por defecto - a través de ``urlopen`` - pero puedes crear aperturas personalizadas. Las aperturas utilizan manejadores. Todo el "trabajo pesado" lo hacen los manejadores. Cada manejador sabe cómo abrir URLs para un esquema de URL particular (http, ftp, etc.), o cómo manejar un aspecto de la apertura de URLs, por ejemplo redirecciones HTTP o cookies HTTP.

source: You will want to create openers if you want to fetch URLs with specific handlers installed, for example to get an opener that handles cookies, or to get an opener that does not handle redirections.
es_ar: Desearás crear objetos de apertura si deseas consultar URLs con gestores específicos instalados, por ejemplo para obtener un objeto de apertura que gestione cookies, o para obtener un objeto de apertura que no gestione redireccionamientos.

source: To create an opener, instantiate an ``OpenerDirector``, and then call ``.add_handler(some_handler_instance)`` repeatedly.
es_ar: Para crear un objeto de apertura, debes instanciar un ``OpenerDirector``, y luego llamar ``.add_handler(some_handler_instance)`` repetidamente.

source: Alternatively, you can use ``build_opener``, which is a convenience function for creating opener objects with a single function call. ``build_opener`` adds several handlers by default, but provides a quick way to add more and/or override the default handlers.
es_ar: Alternativamente, puedes usar ``build_opener``, que es una función conveniente para crear objetos de apertura con una sola llamada a la función. ``build_opener`` añade varios gestores por defecto, pero proporciona una forma rápida de añadir más y/o sobrescribir los gestores por defecto.

source: Other sorts of handlers you might want to can handle proxies, authentication, and other common but slightly specialised situations.
es_ar: Otros tipos de gestores que puedes querer permiten manejar proxies, autenticación, y otras situaciones comunes pero ligeramente especializadas.

source: ``install_opener`` can be used to make an ``opener`` object the (global) default opener. This means that calls to ``urlopen`` will use the opener you have installed.
es_ar: ``install_opener`` puede ser usado para hacer que un objeto ``opener`` sea el objeto de apertura (global) por defecto. Esto significa que las llamadas a ``urlopen`` usarán el objeto de apertura que has instalado.

source: Opener objects have an ``open`` method, which can be called directly to fetch urls in the same way as the ``urlopen`` function: there's no need to call ``install_opener``, except as a convenience.
es_ar: Los objetos de apertura tienen un método ``open``, que puede ser llamado directamente para consultar urls de la misma manera que la función "urlopen": no hay necesidad de llamar ``install_opener``, excepto por conveniencia.

source: Basic Authentication
es_ar: Autenticación básica

source: When authentication is required, the server sends a header (as well as the 401 error code) requesting authentication. This specifies the authentication scheme and a 'realm'. The header looks like: ``WWW-Authenticate: SCHEME realm="REALM"``.
es_ar: Cuando se requiere la autenticación, el servidor envía un encabezado (así como el código de error 401) solicitando la autenticación. Esto especifica el esquema de autenticación y un 'realm'. El encabezado tiene el siguiente aspecto: ``WWW-Authenticate: SCHEME realm="REALM"``.

source: e.g.
es_ar: por ejemplo.

source: The client should then retry the request with the appropriate name and password for the realm included as a header in the request. This is 'basic authentication'. In order to simplify this process we can create an instance of ``HTTPBasicAuthHandler`` and an opener to use this handler.
es_ar: El cliente debe entonces volver a intentar la solicitud con el nombre y la contraseña apropiados para el realm incluido como encabezamiento en la solicitud. Esto es 'autenticación básica'. Para simplificar este proceso podemos crear una instancia de ``HTTPBasicAuthHandler`` y un objeto de apertura para usar este manejador.

source: The ``HTTPBasicAuthHandler`` uses an object called a password manager to handle the mapping of URLs and realms to passwords and usernames. If you know what the realm is (from the authentication header sent by the server), then you can use a ``HTTPPasswordMgr``. Frequently one doesn't care what the realm is. In that case, it is convenient to use ``HTTPPasswordMgrWithDefaultRealm``. This allows you to specify a default username and password for a URL. This will be supplied in the absence of you providing an alternative combination for a specific realm. We indicate this by providing ``None`` as the realm argument to the ``add_password`` method.
es_ar: El ``HTTPBasicAuthHandler`` utiliza un objeto llamado administrador de contraseñas para gestionar el mapeo de URLs y realms con contraseñas y nombres de usuario. Si sabes cuál es el realm (por el encabezado de autenticación enviado por el servidor), entonces puedes usar un ``HTTPPasswordMgr``. Frecuentemente a uno no le importa cuál es el realm. En ese caso, es conveniente usar "HTTPPasswordMgrWithDefaultRealm". Esto te permite especificar un nombre de usuario y una contraseña por defecto para una URL. Esto será suministrado en caso de que no proporciones una combinación alternativa para un realm específico. Lo indicamos proporcionando ``None`` como el argumento del realm al método ``add_password``.

source: The top-level URL is the first URL that requires authentication. URLs "deeper" than the URL you pass to .add_password() will also match. ::
es_ar: La URL de primer nivel es la primera URL que requiere autenticación. Las URLs "más profundas" que la URL que pasas a .add_password() también coincidirán. ::

source: In the above example we only supplied our ``HTTPBasicAuthHandler`` to ``build_opener``. By default openers have the handlers for normal situations -- ``ProxyHandler`` (if a proxy setting such as an :envvar:`http_proxy` environment variable is set), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.
es_ar: En el ejemplo anterior sólo suministramos nuestro ``HTTPBasicAuthHandler`` a ``build_opener``. Por defecto, los objetos de apertura tienen los gestores para situaciones normales -- ``ProxyHandler`` (si un ajuste de proxy tal como una variable de entorno :envvar:`http_proxy` está establecida), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.
