Repository: python/python-docs-es
Catalog: howto/urllib2.po
Languages: es_ar

source: ``top_level_url`` is in fact *either* a full URL (including the 'http:' scheme component and the hostname and optionally the port number) e.g. ``"http://example.com/"`` *or* an "authority" (i.e. the hostname, optionally including the port number) e.g. ``"example.com"`` or ``"example.com:8080"`` (the latter example includes a port number). The authority, if present, must NOT contain the "userinfo" component - for example ``"joe:password@example.com"`` is not correct.
es_ar: ``top_level_url`` es de hecho *o* una URL completa (incluyendo el componente del esquema 'http:' y el nombre del host y opcionalmente el número de puerto) p.ej. ``"http://example.com/"`` *o* una "autoridad" (esto es, el nombre del host, incluyendo opcionalmente el número de puerto) por ejemplo ``"example.com"`` o ``"example.com:8080"`` (este último ejemplo incluye un número de puerto). La autoridad, si está presente, NO debe contener el componente "userinfo" - por ejemplo ``"joe:password@example.com"`` no es correcto.

source: **urllib** will auto-detect your proxy settings and use those. This is through the ``ProxyHandler``, which is part of the normal handler chain when a proxy setting is detected. Normally that's a good thing, but there are occasions when it may not be helpful [#]_. One way to do this is to setup our own ``ProxyHandler``, with no proxies defined. This is done using similar steps to setting up a `Basic Authentication`_ handler: ::
es_ar: **urllib** detectará automáticamente tu configuración de proxy y la utilizará. Esto es a través de ``ProxyHandler``, que es parte de la cadena de gestores normales cuando se detecta un ajuste de proxy. Normalmente esto es algo bueno, pero hay ocasiones en las que puede no ser útil [#]_. Una forma de hacerlo es configurar nuestro propio ``ProxyHandler``, sin proxies definidos. Esto se hace usando pasos similares a la configuración de un gestor `Basic Authentication`_: ::

source: Currently ``urllib.request`` *does not* support fetching of ``https`` locations through a proxy. However, this can be enabled by extending urllib.request as shown in the recipe [#]_.
es_ar: Actualmente ``urllib.request`` *no* soporta la consulta de ubicaciones ``https`` a través de un proxy. Sin embargo, esto puede ser habilitado extendiendo urllib.request como se muestra en la receta [#]_.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
es_ar: ``HTTP_PROXY`` será ignorado si se establece una variable ``REQUEST_METHOD``; ver la documentación en :func:`~urllib.request.getproxies``.

source: Sockets and Layers
es_ar: Sockets y capas

source: The Python support for fetching resources from the web is layered. urllib uses the :mod:`http.client` library, which in turn uses the socket library.
es_ar: El soporte de Python para obtener recursos de la web funciona en capas. urllib utiliza la biblioteca :mod:`http.client`, que a su vez utiliza la biblioteca de sockets.

source: As of Python 2.3 you can specify how long a socket should wait for a response before timing out. This can be useful in applications which have to fetch web pages. By default the socket module has *no timeout* and can hang. Currently, the socket timeout is not exposed at the http.client or urllib.request levels. However, you can set the default timeout globally for all sockets using ::
es_ar: A partir de Python 2.3 se puede especificar cuánto tiempo debe esperar un socket para obtener una respuesta antes de que se agote el tiempo de espera. Esto puede ser útil en aplicaciones que tienen que consultar páginas web. Por defecto, el módulo socket no tiene *tiempo de espera* y puede colgarse. Actualmente, el tiempo de espera de la conexión no se expone en los niveles http.client o urllib.request. Sin embargo, puede establecerse el tiempo de espera por defecto de forma global para todas los sockets usando ::

source: Footnotes
es_ar: Notas a pie de página

source: This document was reviewed and revised by John Lee.
es_ar: Este documento fue examinado y revisado por John Lee.

source: Google for example.
es_ar: Google por ejemplo.

source: Browser sniffing is a very bad practice for website design - building sites using web standards is much more sensible. Unfortunately a lot of sites still send different versions to different browsers.
es_ar: El rastreo de navegadores es una práctica muy mala para el diseño de sitios web - construir sitios usando estándares web es mucho más sensato. Desafortunadamente muchos sitios siguen enviando versiones diferentes a diferentes navegadores.

source: The user agent for MSIE 6 is *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*
es_ar: El agente de usuario para MSIE 6 es *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*

source: For details of more HTTP request headers, see `Quick Reference to HTTP Headers`_.
es_ar: Para detalles de más encabezados de peticiones HTTP, ver `Quick Reference to HTTP Headers`_.

source: In my case I have to use a proxy to access the internet at work. If you attempt to fetch *localhost* URLs through this proxy it blocks them. IE is set to use the proxy, which urllib picks up on. In order to test scripts with a localhost server, I have to prevent urllib from using the proxy.
es_ar: En mi caso tengo que usar un proxy para acceder a internet en el trabajo. Si intentas consultar URLs de *localhost* a través de este proxy, las bloquea. IE está configurado para usar el proxy, que urllib recoge. Para poder probar los scripts con un servidor localhost, tengo que evitar que urllib use el proxy.

source: urllib opener for SSL proxy (CONNECT method): `ASPN Cookbook Recipe <https://code.activestate.com/recipes/456195/>`_.
es_ar: objeto de apertura de urllib para proxy SSL (método CONNECT): `ASPN Cookbook Recipe <https://code.activestate.com/recipes/456195/>`_.
