Repository: python/python-docs-es
Catalog: c-api/arg.po
Languages: es

source: Parsing arguments and building values
es: Analizando argumentos y construyendo valores

source: These functions are useful when creating your own extensions functions and methods. Additional information and examples are available in :ref:`extending-index`.
es: Estas funciones son útiles al crear sus propias funciones y métodos de extensiones. Información y ejemplos adicionales están disponibles en :ref:`extending-index`.

source: The first three of these functions described, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, and :c:func:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
es: Las tres primeras de estas funciones descritas, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, y :c:func:`PyArg_Parse`, todas usan *cadenas de caracteres de formato* que se utilizan para contarle a la función sobre los argumentos esperados. Las cadenas de caracteres de formato utilizan la misma sintaxis para cada una de estas funciones.

source: Parsing arguments
es: Analizando argumentos

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
es: Una cadena de formato consta de cero o más "unidades de formato." Una unidad de formato describe un objeto Python; por lo general es un solo carácter o una secuencia de unidades formato entre paréntesis. Con unas pocas excepciones, una unidad de formato que no es una secuencia entre paréntesis normalmente corresponde a un único argumento de dirección de estas funciones. En la siguiente descripción, la forma citada es la unidad de formato; la entrada en paréntesis (redondos) es el tipo de objeto Python que coincida con la unidad de formato; y la entrada entre corchetes [cuadrados] es el tipo de la variable(s) C cuya dirección debe ser pasada.

source: Strings and buffers
es: Cadena de caracteres y búferes

source: These formats allow accessing an object as a contiguous chunk of memory. You don't have to provide raw storage for the returned unicode or bytes area.
es: Estos formatos permiten acceder a un objeto como un bloque contiguo de memoria. Usted no tiene que proporcionar almacenamiento en bruto para el Unicode o área de bytes retornada.

source: In general, when a format sets a pointer to a buffer, the buffer is managed by the corresponding Python object, and the buffer shares the lifetime of this object. You won't have to release any memory yourself. The only exceptions are ``es``, ``es#``, ``et`` and ``et#``.
es: En general, cuando un formato establece un puntero a un búfer, el búfer es gestionado por el objeto de Python correspondiente, y el búfer comparte la vida útil de este objeto. Usted no tendrá que liberar cualquier memoria usted mismo. Las únicas excepciones son ``es``, ``es#``, ``et`` y ``et#``.

source: However, when a :c:type:`Py_buffer` structure gets filled, the underlying buffer is locked so that the caller can subsequently use the buffer even inside a :c:type:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :c:func:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
es: Sin embargo, cuando una estructura :c:type:`Py_buffer` se llena, la memoria intermedia subyacente está bloqueada de manera que la persona que llama puede posteriormente utilizar la memoria intermedia incluso dentro de un bloque :c:type:`Py_BEGIN_ALLOW_THREADS` sin el riesgo de que los datos mutables sean redimensionados o destruidos. Como resultado, **usted tiene que llamar** :c:func:`PyBuffer_Release` después de haber terminado de procesar los datos (o en caso de aborto temprano).

source: Unless otherwise stated, buffers are not NUL-terminated.
es: A menos que se indique lo contrario, los búferes no son terminados en NULL (*NUL-terminated*).

source: Some formats require a read-only :term:`bytes-like object`, and set a pointer instead of a buffer structure. They work by checking that the object's :c:member:`PyBufferProcs.bf_releasebuffer` field is ``NULL``, which disallows mutable objects such as :class:`bytearray`.
es: Algunos formatos requieren :term:`bytes-like object` de sólo lectura, y establecen un puntero en lugar de una estructura de búfer. Trabajan comprobando que el campo del objeto :c:member:`PyBufferProcs.bf_releasebuffer` es ``NULL``, que no permite objetos mutables como :class:`bytearray`.

source: For all ``#`` variants of formats (``s#``, ``y#``, etc.), the type of the length argument (int or :c:type:`Py_ssize_t`) is controlled by defining the macro :c:macro:`PY_SSIZE_T_CLEAN` before including :file:`Python.h`. If the macro was defined, length is a :c:type:`Py_ssize_t` rather than an :c:type:`int`. This behavior will change in a future Python version to only support :c:type:`Py_ssize_t` and drop :c:type:`int` support. It is best to always define :c:macro:`PY_SSIZE_T_CLEAN`.
es: Para todas las variantes de formato de ``#`` ( ``s#``, ``y#``, etc.), el tipo del argumento *length* (int o :c:type:`Py_ssize_t`) es controlado por la definición de la macro :c:macro:`PY_SSIZE_T_CLEAN` antes de incluir :file:`Python.h`. Si se ha definido la macro, *lenght* es un :c:type:`Py_ssize_t` en lugar de un :c:type:`int`. Este comportamiento va a cambiar en futuras versiones de Python para soportar únicamente :c:type:`Py_ssize_t` y dejar el soporte de :c:type:`int`. Es mejor definir siempre :c:macro:`PY_SSIZE_T_CLEAN`.

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
es: Convierte un objeto Unicode a un puntero C a una cadena de caracteres. Un puntero a una cadena de caracteres existente se almacena en la variable puntero del carácter cuya dirección se pasa. La cadena de caracteres en C es terminada en NULL. La cadena de caracteres de Python no debe contener puntos de código incrustado nulos; si lo hace, se lanza una excepción :exc:`ValueError`. Los objetos Unicode se convierten en cadenas de caracteres de C utilizando codificación ``'utf-8'``. Si esta conversión fallase lanza un :exc:`UnicodeError`.

source: This format does not accept :term:`bytes-like objects <bytes-like object>`. If you want to accept filesystem paths and convert them to C character strings, it is preferable to use the ``O&`` format with :c:func:`PyUnicode_FSConverter` as *converter*.
es: Este formato no acepta :term:`objetos de tipo bytes <bytes-like object>`. Si desea aceptar los caminos del sistema de archivos y convertirlos en cadenas de caracteres C, es preferible utilizar el formato ``O&`` con :func:`PyUnicode_FSConverter` como convertidor.

source: Previously, :exc:`TypeError` was raised when embedded null code points were encountered in the Python string.
es: Anteriormente, :exc:`TypeError` se lanzó cuando se encontraron puntos de código nulos incrustados en la cadena de caracteres de Python.

source: ``s*`` (:class:`str` or :term:`bytes-like object`) [Py_buffer]
es: ``s*`` (:class:`str` o :term:`bytes-like object`) [Py_buffer]

source: This format accepts Unicode objects as well as bytes-like objects. It fills a :c:type:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
es: Este formato acepta objetos Unicode, así como objectos de tipo bytes. Llena una estructura :c:type:`Py_buffer` proporcionada por la persona que llama. En este caso la cadena de caracteres de C resultante puede contener bytes NUL embebidos. Los objetos Unicode se convierten en cadenas de caracteres C utilizando codificación ``'utf-8'``.

source: ``s#`` (:class:`str`, read-only :term:`bytes-like object`) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``s#`` (:class:`str`, :term:`bytes-like object` de sólo lectura) [const char \*, int o :c:type:`Py_ssize_t`]

source: Like ``s*``, except that it doesn't accept mutable objects. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
es: Como ``s*``, excepto que no acepta los objetos mutables. El resultado se almacena en dos variables de C, la primera un puntero a una cadena de caracteres C, el segundo es su longitud. La cadena de caracteres puede contener caracteres nulos incrustados. Los objetos Unicode se convierten en cadenas de caracteres C utilizando codificación ``'utf-8'``.

source: ``z`` (:class:`str` or ``None``) [const char \*]
es: ``z`` (:class:`str` o ``None``) [const char \*]

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
es: Como ``s``, pero el objeto Python también puede ser ``None``, en cuyo caso el puntero C se establece en ``NULL``.

source: ``z*`` (:class:`str`, :term:`bytes-like object` or ``None``) [Py_buffer]
es: ``z*`` (:class:`str`, :term:`bytes-like object` o ``None``) [Py_buffer]

source: Like ``s*``, but the Python object may also be ``None``, in which case the ``buf`` member of the :c:type:`Py_buffer` structure is set to ``NULL``.
es: Como ``s*``, pero el objeto Python también puede ser ``None``, en cuyo caso el miembro de ``buf`` de la estructura :c:type:`Py_buffer` se establece en ``NULL``.

source: ``z#`` (:class:`str`, read-only :term:`bytes-like object` or ``None``) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``z#`` (:class:`str`, :term:`bytes-like object` de sólo lectura o ``None``) [const char \*, int o :c:type:`Py_ssize_t`]

source: Like ``s#``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
es: Como ``s#``, pero el objeto Python también puede ser ``None``, en cuyo caso el puntero C se establece en ``NULL``.

source: ``y`` (read-only :term:`bytes-like object`) [const char \*]
es: ``y`` (:term:`bytes-like object` de sólo lectura) [const char \*]

source: This format converts a bytes-like object to a C pointer to a character string; it does not accept Unicode objects. The bytes buffer must not contain embedded null bytes; if it does, a :exc:`ValueError` exception is raised.
es: Este formato convierte un objecto de tipo bytes a un puntero C a una cadena de caracteres; no acepta objetos Unicode. El búfer de bytes no debe contener bytes nulos incrustados; si lo hace, se lanza una excepción :exc:`ValueError`.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes buffer.
es: Anteriormente, :exc:`TypeError` se lanzó cuando bytes nulos incrustados se encontraron en el buffer de bytes.

source: This variant on ``s*`` doesn't accept Unicode objects, only bytes-like objects. **This is the recommended way to accept binary data.**
es: Esta variante de ``s*`` no acepta objetos Unicode, solamente los objetos de tipo bytes. **Esta es la forma recomendada para aceptar datos binarios.**

source: ``y#`` (read-only :term:`bytes-like object`) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``y#`` (:term:`bytes-like object` de sólo lectura) [const char \*, int o :c:type:`Py_ssize_t`]

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
es: Esta variante en ``s#`` no acepta objetos Unicode, solo objetos similares a bytes.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :c:type:`PyObject\*`.
es: Requiere que el objeto Python es un objeto :class:`bytes`, sin intentar ninguna conversión. Lanza :exc:`TypeError` si el objeto no es un objeto bytes. La variable C también puede ser declarado como :c:type:`PyObject \*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :c:type:`PyObject\*`.
es: Requiere que el objeto Python es un objeto :class:`bytearray`, sin intentar ninguna conversión. Lanza :exc:`TypeError` si el objeto no es un objecto :class:`bytearray`. La variable C también puede ser declarado como :c:type:`PyObject \*`.

source: Convert a Python Unicode object to a C pointer to a NUL-terminated buffer of Unicode characters. You must pass the address of a :c:type:`Py_UNICODE` pointer variable, which will be filled with the pointer to an existing Unicode buffer. Please note that the width of a :c:type:`Py_UNICODE` character depends on compilation options (it is either 16 or 32 bits). The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised.
es: Convierte un objeto Unicode de Python a un puntero a un búfer C NUL terminado de caracteres Unicode. Debe pasar la dirección de una variable de puntero :c:type:`Py_UNICODE`, que se llena con el puntero a un búfer Unicode existente. Tenga en cuenta que el ancho de un carácter :c:type:`Py_UNICODE` depende de las opciones de compilación (que es 16 o 32 bits). La cadena de Python no debe contener puntos de código incrustado nulos; si lo hace, se lanza una excepción :exc:`ValueError`.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsWideCharString`.
es: Parte de la API de viejo estilo :c:type:`Py_UNICODE`; favor migrar al uso de :c:func:`PyUnicode_AsWideCharString`.

source: ``u#`` (:class:`str`) [const Py_UNICODE \*, int or :c:type:`Py_ssize_t`]
es: ``u#`` (:class:`str`) [const Py_UNICODE \*, int o :c:type:`Py_ssize_t`]

source: This variant on ``u`` stores into two C variables, the first one a pointer to a Unicode data buffer, the second one its length. This variant allows null code points.
es: Esta variante en ``u`` almacena en dos variables de C, el primero un puntero a un búfer de datos Unicode, el segundo de su longitud. Esta variante permite puntos de código nulos.

source: ``Z`` (:class:`str` or ``None``) [const Py_UNICODE \*]
es: ``Z`` (:class:`str` o ``None``) [const Py_UNICODE \*]

source: Like ``u``, but the Python object may also be ``None``, in which case the :c:type:`Py_UNICODE` pointer is set to ``NULL``.
es: Como ``u``, pero el objeto Python también puede ser ``None``, en cuyo caso el puntero :c:type:`Py_UNICODE` se establece en ``NULL``.

source: ``Z#`` (:class:`str` or ``None``) [const Py_UNICODE \*, int or :c:type:`Py_ssize_t`]
es: ``Z#`` (:class:`str` o ``None``) [const Py_UNICODE \*, int o :c:type:`Py_ssize_t`]

source: Like ``u#``, but the Python object may also be ``None``, in which case the :c:type:`Py_UNICODE` pointer is set to ``NULL``.
es: Al igual que ``u#``, pero el objeto Python también puede ser ``None``, en cuyo caso el puntero :c:type:`Py_UNICODE` se establece en ``NULL``.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :c:type:`PyObject\*`.
es: Requiere que el objeto Python es un objeto Unicode, sin intentar ninguna conversión. Lanza :exc:`TypeError` si el objeto no es un objeto Unicode. La variable C también puede ser declarado como :c:type:`PyObject\*`.

source: ``w*`` (read-write :term:`bytes-like object`) [Py_buffer]
es: ``w*`` (:term:`bytes-like object` de lectura y escritura) [Py_buffer]

source: This format accepts any object which implements the read-write buffer interface. It fills a :c:type:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :c:func:`PyBuffer_Release` when it is done with the buffer.
es: Este formato acepta cualquier objeto que implemente la interfaz del búfer de lectura-escritura. Llena la estructura :c:type:`Py_buffer` proporcionada por quien llama. El búfer puede contener bytes nulos incrustados. Quien llama tiene que llamar :c:func:`PyBuffer_Release` cuando termina con el búfer.

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
es: Esta variante en ``s`` se usa para codificar Unicode en un búfer de caracteres. Solo funciona para datos codificados sin bytes NUL integrados.

source: This format requires two arguments. The first is only used as input, and must be a :c:type:`const char\*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:type:`char\*\*`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
es: Este formato requiere dos argumentos. El primero solo se usa como entrada, y debe ser :c:type:`const char\*` que apunta al nombre de una codificación como una cadena de caracteres terminada en NUL, o ``NULL``, en cuyo caso se utiliza la codificación ``'utf-8'``. Se lanza una excepción si Python no conoce la codificación con nombre. El segundo argumento debe ser :c:type:`char\*\*`; el valor del puntero al que hace referencia se establecerá en un búfer con el contenido del texto del argumento. El texto se codificará en la codificación especificada por el primer argumento.

source: :c:func:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after use.
es: :c:func:`PyArg_ParseTuple` asignará un búfer del tamaño necesitado, copiará los datos codificados en este búfer y ajustará *\*buffer* para referenciar el nuevo almacenamiento asignado. Quien llama es responsable para llamar :c:func:`PyMem_Free` para liberar el búfer asignado después de su uso.

source: ``et`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer]
es: ``et`` (:class:`str`, :class:`bytes` o :class:`bytearray`) [const char \*encoding, char \*\*buffer]

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
es: Igual que ``es``, excepto que los objetos de cadena de caracteres de bytes se pasan sin recodificarlos. En cambio, la implementación supone que el objeto de cadena de caracteres de bytes utiliza la codificación que se pasa como parámetro.

source: ``es#`` (:class:`str`) [const char \*encoding, char \*\*buffer, int or :c:type:`Py_ssize_t` \*buffer_length]
es: ``es#`` (:class:`str`) [const char \*encoding, char \*\*buffer, int o :c:type:`Py_ssize_t` \*buffer_length]

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
es: Esta variante en ``s#`` se usa para codificar Unicode en un búfer de caracteres. A diferencia del formato ``es``, esta variante permite datos de entrada que contienen caracteres NUL.

source: It requires three arguments. The first is only used as input, and must be a :c:type:`const char\*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:type:`char\*\*`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
es: Requiere tres argumentos. El primero solo se usa como entrada, y debe ser :c:type:`const char \*` que apunta al nombre de una codificación como una cadena terminada en NUL, o ``NULL``, en cuyo caso ``Se utiliza la codificación 'utf-8'``. Se lanza una excepción si Python no conoce la codificación con nombre. El segundo argumento debe ser :c:type:`char\*\*`; El valor del puntero al que hace referencia se establecerá en un búfer con el contenido del texto del argumento. El texto se codificará en la codificación especificada por el primer argumento. El tercer argumento debe ser un puntero a un entero; el número entero referenciado se establecerá en el número de bytes en el búfer de salida.

source: There are two modes of operation:
es: Hay dos modos de operación:

source: If *\*buffer* points a ``NULL`` pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after usage.
es: Si *\*buffer* señala un puntero ``NULL``, la función asignará un búfer del tamaño necesario, copiará los datos codificados en este búfer y configurará *\*buffer* para hacer referencia al almacenamiento recién asignado. Quien llama es responsable de llamar a :c:func:`PyMem_Free` para liberar el búfer asignado después del uso.

source: If *\*buffer* points to a non-``NULL`` pointer (an already allocated buffer), :c:func:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
es: Si *\*buffer* apunta a un puntero no ``NULL`` (un búfer ya asignado), :c:func:`PyArg_ParseTuple` usará esta ubicación como el búfer e interpretará el valor inicial de *\*buffer_length* como el tamaño del búfer. Luego copiará los datos codificados en el búfer y los terminará en NUL. Si el búfer no es lo suficientemente grande, se establecerá a :exc:`ValueError`.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
es: En ambos casos, *\*buffer_length* se establece a la longitud de los datos codificados sin el byte NUL final.

source: ``et#`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer, int or :c:type:`Py_ssize_t` \*buffer_length]
es: ``et#`` (:class:`str`, :class:`bytes` o :class:`bytearray`) [const char \*encoding, char \*\*buffer, int o :c:type:`Py_ssize_t` \*buffer_length]
