Repository: python/python-docs-es
Catalog: c-api/arg.po
Languages: es

source: This converts a C string to a Python :class:`bytes` object. If the C string pointer is ``NULL``, ``None`` is returned.
es: Esto convierte una cadena de caracteres de C en un objeto Python :class:`bytes`. Si el puntero de la cadena de caracteres de C es ``NULL``, se retorna ``None``.

source: ``y#`` (:class:`bytes`) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``y#`` (:class:`bytes`) [const char \*, int o :c:type:`Py_ssize_t`]

source: This converts a C string and its lengths to a Python object. If the C string pointer is ``NULL``, ``None`` is returned.
es: Esto convierte una cadena de caracteres de C y sus longitudes en un objeto Python. Si el puntero de la cadena de caracteres de C es ``NULL``, se retorna ``None``.

source: Same as ``s``.
es: Igual que ``s``.

source: ``z#`` (:class:`str` or ``None``) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``z#`` (:class:`str` o ``None``) [const char \*, int o :c:type:`Py_ssize_t`]

source: Same as ``s#``.
es: Igual que ``s#``.

source: Convert a null-terminated :c:type:`wchar_t` buffer of Unicode (UTF-16 or UCS-4) data to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, ``None`` is returned.
es: Convierte un búfer :c:type:`wchar_t` de datos Unicode (UTF-16 o UCS-4) en un objeto Python Unicode. Si el puntero del búfer Unicode es ``NULL``, se retorna ``None``.

source: ``u#`` (:class:`str`) [const wchar_t \*, int or :c:type:`Py_ssize_t`]
es: ``u#`` (:class:`str`) [const wchar_t \*, int o :c:type:`Py_ssize_t`]

source: Convert a Unicode (UTF-16 or UCS-4) data buffer and its length to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, the length is ignored and ``None`` is returned.
es: Convierte un búfer de datos Unicode (UTF-16 o UCS-4) y su longitud en un objeto Python Unicode. Si el puntero del búfer Unicode es ``NULL``, la longitud se ignora y se retorna ``None``.

source: ``U`` (:class:`str` or ``None``) [const char \*]
es: ``U`` (:class:`str` o ``None``) [const char \*]

source: ``U#`` (:class:`str` or ``None``) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``U#`` (:class:`str` o ``None``) [const char \*, int o :c:type:`Py_ssize_t`]

source: Convert a plain C :c:type:`int` to a Python integer object.
es: Convierte un :c:type:`int` plano de C a un objeto entero de Python.

source: Convert a plain C :c:type:`char` to a Python integer object.
es: Convierte un :c:type:`char` plano de C a un objeto entero de Python.

source: Convert a plain C :c:type:`short int` to a Python integer object.
es: Convierte un :c:type:`short int` plano de C a un objeto entero de Python.

source: Convert a C :c:type:`long int` to a Python integer object.
es: Convierta un :c:type:`long int` de C en un objeto entero de Python.

source: Convert a C :c:type:`unsigned char` to a Python integer object.
es: Convierte un :c:type:`unsigned char` de C a un entero de Python.

source: Convert a C :c:type:`unsigned short int` to a Python integer object.
es: Convierte un :c:type:`unsigned short int` de C a un entero de Python.

source: Convert a C :c:type:`unsigned int` to a Python integer object.
es: Convierte un :c:type:`unsigned int` de C a un entero de Python.

source: Convert a C :c:type:`unsigned long` to a Python integer object.
es: Convierte un :c:type:`unsigned long` de C a un entero de Python.

source: Convert a C :c:type:`long long` to a Python integer object.
es: Convierte un :c:type:`long long` de C en un objeto entero de Python.

source: Convert a C :c:type:`unsigned long long` to a Python integer object.
es: Convierte un :c:type:`unsigned long long` de C a un entero de Python.

source: Convert a C :c:type:`Py_ssize_t` to a Python integer.
es: Convierte un :c:type:`Py_ssize_t` de C a un entero de Python.

source: ``c`` (:class:`bytes` of length 1) [char]
es: ``c`` (:class:`bytes` de largo 1) [char]

source: Convert a C :c:type:`int` representing a byte to a Python :class:`bytes` object of length 1.
es: Convierte un :c:type:`int` de C representando un byte a un objecto :class:`bytes` de Python de largo 1.

source: Convert a C :c:type:`int` representing a character to Python :class:`str` object of length 1.
es: Convierte un :c:type:`int` de C representando un carácter a un objecto :class:`str` de Python de largo 1.

source: Convert a C :c:type:`double` to a Python floating point number.
es: Convierte un :c:type:`double` de C a un número de punto flotante de Python.

source: Convert a C :c:type:`float` to a Python floating point number.
es: Convierte un :c:type:`float` de C a un número de punto flotante de Python.

source: Convert a C :c:type:`Py_complex` structure to a Python complex number.
es: Convierte una estructura :c:type:`Py_complex` de C en un número complejo de Python.

source: Pass a Python object untouched (except for its reference count, which is incremented by one). If the object passed in is a ``NULL`` pointer, it is assumed that this was caused because the call producing the argument found an error and set an exception. Therefore, :c:func:`Py_BuildValue` will return ``NULL`` but won't raise an exception. If no exception has been raised yet, :exc:`SystemError` is set.
es: Pasa un objeto Python sin tocarlo (excepto por su recuento de referencia, que se incrementa en uno). Si el objeto pasado es un puntero ``NULL``, se supone que esto fue causado porque la llamada que produjo el argumento encontró un error y estableció una excepción. Por lo tanto, :c:func:`Py_BuildValue` retornará ``NULL`` pero no lanzará una excepción. Si aún no se ha producido ninguna excepción, se establece :exc:`SystemError`.

source: Same as ``O``.
es: Igual que ``O``.

source: Same as ``O``, except it doesn't increment the reference count on the object. Useful when the object is created by a call to an object constructor in the argument list.
es: Igual que ``O``, excepto que no incrementa el recuento de referencia en el objeto. Útil cuando el objeto se crea mediante una llamada a un constructor de objetos en la lista de argumentos.

source: Convert *anything* to a Python object through a *converter* function. The function is called with *anything* (which should be compatible with :c:type:`void \*`) as its argument and should return a "new" Python object, or ``NULL`` if an error occurred.
es: Convierte *anything* a un objeto Python a través de una función *converter*. La función se llama con *anything* (que debería ser compatible con :c:type:`void \*`) como argumento y debería retornar un "nuevo" objeto de Python, o ``NULL`` si se produjo un error.

source: Convert a sequence of C values to a Python tuple with the same number of items.
es: Convierta una secuencia de valores C en una tupla de Python con el mismo número de elementos.

source: Convert a sequence of C values to a Python list with the same number of items.
es: Convierte una secuencia de valores C en una lista de Python con el mismo número de elementos.

source: Convert a sequence of C values to a Python dictionary. Each pair of consecutive C values adds one item to the dictionary, serving as key and value, respectively.
es: Convierte una secuencia de valores C en un diccionario Python. Cada par de valores C consecutivos agrega un elemento al diccionario, que sirve como clave y valor, respectivamente.

source: If there is an error in the format string, the :exc:`SystemError` exception is set and ``NULL`` returned.
es: Si hay un error en la cadena de formato, se establece la excepción :exc:`SystemError` y se retorna ``NULL``.

source: Identical to :c:func:`Py_BuildValue`, except that it accepts a va_list rather than a variable number of arguments.
es: Idéntico a :c:func:`Py_BuildValue`, excepto que acepta una *va_list* en lugar de un número variable de argumentos.
