Repository: python/python-docs-es
Catalog: c-api/arg.po
Languages: es

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
es: Igual que ``es#``, excepto que los objetos de cadena de caracteres de bytes se pasan sin recodificarlos. En cambio, la implementación supone que el objeto de cadena de caracteres de bytes utiliza la codificación que se pasa como parámetro.

source: Numbers
es: Números

source: Convert a nonnegative Python integer to an unsigned tiny int, stored in a C :c:type:`unsigned char`.
es: Convierte un entero de Python no negativo en un pequeño int sin signo, almacenado en un :c:type:`unsigned char` de C.

source: Convert a Python integer to a tiny int without overflow checking, stored in a C :c:type:`unsigned char`.
es: Convierte un entero de Python en un pequeño int sin comprobación de desbordamiento, almacenado en un :c:type:`unsigned char` de C.

source: Convert a Python integer to a C :c:type:`short int`.
es: Convierte un entero de Python a un :c:type:`short int` de C.

source: Convert a Python integer to a C :c:type:`unsigned short int`, without overflow checking.
es: Convierte un entero de Python a un :c:type:`unsigned short int` de C, sin verificación de desbordamiento.

source: Convert a Python integer to a plain C :c:type:`int`.
es: Convierte un entero Python a un :c:type:`int` de C plano.

source: Convert a Python integer to a C :c:type:`unsigned int`, without overflow checking.
es: Convierte un entero de Python a un :c:type:`unsigned int` de C, sin verificación de desbordamiento.

source: Convert a Python integer to a C :c:type:`long int`.
es: Convierte un entero Python a un :c:type:`long int` de C.

source: Convert a Python integer to a C :c:type:`unsigned long` without overflow checking.
es: Convierte un entero de Python a un :c:type:`unsigned long` de C, sin verificación de desbordamiento.

source: Convert a Python integer to a C :c:type:`long long`.
es: Convierte un entero de Python a un :c:type:`long long` de C.

source: Convert a Python integer to a C :c:type:`unsigned long long` without overflow checking.
es: Convierte un entero de Python a un :c:type:`unsigned long long` de C, sin verificación de desbordamiento.

source: Convert a Python integer to a C :c:type:`Py_ssize_t`.
es: Convierte un entero de Python a un :c:type:`Py_ssize_t` de C.

source: ``c`` (:class:`bytes` or :class:`bytearray` of length 1) [char]
es: ``c`` (:class:`bytes` o :class:`bytearray` de largo 1) [char]

source: Convert a Python byte, represented as a :class:`bytes` or :class:`bytearray` object of length 1, to a C :c:type:`char`.
es: Convierte un byte de Python, representado como un objeto :class:`bytes` o :class:`bytearray` de longitud 1, a un :c:type:`char` de C.

source: Allow :class:`bytearray` objects.
es: Permite objetos :class:`bytearray`.

source: ``C`` (:class:`str` of length 1) [int]
es: ``C`` (:class:`str` de largo 1) [int]

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :c:type:`int`.
es: Convierte un carácter Python, representado como un objeto :class:`str` de longitud 1, a un tipo :c:type:`int` de C.

source: Convert a Python floating point number to a C :c:type:`float`.
es: Convierte un número de punto flotante de Python a un :c:type:`float` de C.

source: Convert a Python floating point number to a C :c:type:`double`.
es: Convierte un número de punto flotante de Python a un :c:type:`double` de C.

source: Convert a Python complex number to a C :c:type:`Py_complex` structure.
es: Convierte un número complejo de Python en una estructura :c:type:`Py_complex` de C.

source: Other objects
es: Otros objetos

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. The object's reference count is not increased. The pointer stored is not ``NULL``.
es: Almacena un objeto Python (sin ninguna conversión) en un puntero de objeto C. El programa C recibe así el objeto real que se pasó. El recuento de referencia del objeto no aumenta. El puntero almacenado no es ``NULL``.

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :c:type:`PyObject\*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
es: Almacena un objeto Python en un puntero de objeto C. Esto es similar a ``O``, pero toma dos argumentos C: el primero es la dirección de un objeto de tipo Python, el segundo es la dirección de la variable C (de tipo :c:type:`PyObject\*`) en el que se almacena el puntero del objeto. Si el objeto Python no tiene el tipo requerido, se lanza :exc:`TypeError`.

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :c:type:`void \*`. The *converter* function in turn is called as follows::
es: Convierte un objeto Python en una variable C a través de una función *converter*. Esto requiere dos argumentos: el primero es una función, el segundo es la dirección de una variable C (de tipo arbitrario), convertida a :c:type:`void \*`. La función *converter* a su vez se llama de la siguiente manera::

source: where *object* is the Python object to be converted and *address* is the :c:type:`void\*` argument that was passed to the :c:func:`PyArg_Parse\*` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
es: donde *object* es el objeto de Python a convertir y *address* es el argumento :c:type:`void\*` que se pasó a la función :c:func:`PyArg_Parse\*`. El *status* retornado debe ser ``1`` para una conversión exitosa y ``0`` si la conversión ha fallado. Cuando la conversión falla, la función *converter* debería generar una excepción y dejar el contenido de *addres* sin modificar.

source: If the *converter* returns ``Py_CLEANUP_SUPPORTED``, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be ``NULL``; *address* will have the same value as in the original call.
es: Si el *converter* retorna ``Py_CLEANUP_SUPPORTED``, se puede llamar por segunda vez si el análisis del argumento finalmente falla, dando al convertidor la oportunidad de liberar cualquier memoria que ya haya asignado. En esta segunda llamada, el parámetro *object* será ``NULL``; *address* tendrá el mismo valor que en la llamada original.

source: ``Py_CLEANUP_SUPPORTED`` was added.
es: ``Py_CLEANUP_SUPPORTED`` fue agregada.

source: Tests the value passed in for truth (a boolean **p**\ redicate) and converts the result to its equivalent C true/false integer value. Sets the int to ``1`` if the expression was true and ``0`` if it was false. This accepts any valid Python value. See :ref:`truth` for more information about how Python tests values for truth.
es: Prueba el valor pasado por verdad (un booleano predicado **p**) y convierte el resultado a su valor entero C verdadero/falso entero equivalente. Establece int en ``1`` si la expresión era verdadera y ``0`` si era falsa. Esto acepta cualquier valor válido de Python. Consulte :ref:`truth` para obtener más información sobre cómo Python prueba los valores por verdad.

source: The object must be a Python sequence whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
es: El objeto debe ser una secuencia de Python cuya longitud es el número de unidades de formato en *items*. Los argumentos C deben corresponder a las unidades de formato individuales en *items*. Las unidades de formato para secuencias pueden estar anidadas.

source: It is possible to pass "long" integers (integers whose value exceeds the platform's :const:`LONG_MAX`) however no proper range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value (actually, the semantics are inherited from downcasts in C --- your mileage may vary).
es: Es posible pasar enteros "largos" (enteros cuyo valor excede el de la plataforma :const:`LONG_MAX`), sin embargo, no se realiza una verificación de rango adecuada --- los bits más significativos se truncan silenciosamente cuando el campo receptor es demasiado pequeño para recibir el valor (en realidad, la semántica se hereda de las descargas en C --- su kilometraje puede variar).

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
es: Algunos otros caracteres tienen un significado en una cadena de formato. Esto puede no ocurrir dentro de paréntesis anidados. Son:

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :c:func:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
es: Indica que los argumentos restantes en la lista de argumentos de Python son opcionales. Las variables C correspondientes a argumentos opcionales deben inicializarse a su valor predeterminado --- cuando no se especifica un argumento opcional, :c:func:`PyArg_ParseTuple` no toca el contenido de las variables C correspondientes.

source: :c:func:`PyArg_ParseTupleAndKeywords` only: Indicates that the remaining arguments in the Python argument list are keyword-only. Currently, all keyword-only arguments must also be optional arguments, so ``|`` must always be specified before ``$`` in the format string.
es: :c:func:`PyArg_ParseTupleAndKeywords` solamente: indica que los argumentos restantes en la lista de argumentos de Python son solo palabras clave. Actualmente, todos los argumentos de solo palabras clave también deben ser argumentos opcionales, por lo que ``|`` siempre debe especificarse antes de ``$`` en la cadena de formato.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :c:func:`PyArg_ParseTuple` raises).
es: La lista de unidades de formato termina aquí; la cadena después de los dos puntos se usa como el nombre de la función en los mensajes de error (el "valor asociado" de la excepción que :c:func:`PyArg_ParseTuple` lanza).

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
es: La lista de unidades de formato termina aquí; la cadena después del punto y coma se usa como mensaje de error *en lugar de* del mensaje de error predeterminado. ``:`` y ``;`` se excluyen mutuamente.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
es: Tenga en cuenta que las referencias de objetos de Python que se proporcionan a la persona que llama son referencias *prestadas* (*borrowed*); ¡no disminuya su conteo de referencias!

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
es: Los argumentos adicionales pasados a estas funciones deben ser direcciones de variables cuyo tipo está determinado por la cadena de formato; Estos se utilizan para almacenar valores de la tupla de entrada. Hay algunos casos, como se describe en la lista de unidades de formato anterior, donde estos parámetros se utilizan como valores de entrada; deben coincidir con lo especificado para la unidad de formato correspondiente en ese caso.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the :c:func:`PyArg_Parse\*` functions return true, otherwise they return false and raise an appropriate exception. When the :c:func:`PyArg_Parse\*` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
es: Para que la conversión tenga éxito, el objeto *arg* debe coincidir con el formato y el formato debe estar agotado. En caso de éxito, las funciones :c:func:`PyArg_Parse\*` retornan verdadero; de lo contrario, retornan falso y generan una excepción apropiada. Cuando las funciones :c:func:`PyArg_Parse\*` fallan debido a un error de conversión en una de las unidades de formato, las variables en las direcciones correspondientes y las siguientes unidades de formato quedan intactas.

source: API Functions
es: Funciones API

source: Parse the parameters of a function that takes only positional parameters into local variables. Returns true on success; on failure, it returns false and raises the appropriate exception.
es: Analiza los parámetros de una función que solo toma parámetros posicionales en variables locales. Retorna verdadero en el éxito; en caso de fallo, retorna falso y genera la excepción apropiada.

source: Identical to :c:func:`PyArg_ParseTuple`, except that it accepts a va_list rather than a variable number of arguments.
es: Idéntico a :c:func:`PyArg_ParseTuple`, excepto que acepta una *va_list* en lugar de un número variable de argumentos .

source: Parse the parameters of a function that takes both positional and keyword parameters into local variables. The *keywords* argument is a ``NULL``-terminated array of keyword parameter names. Empty names denote :ref:`positional-only parameters <positional-only_parameter>`. Returns true on success; on failure, it returns false and raises the appropriate exception.
es: Analiza los parámetros de una función que toma parámetros posicionales y de palabras clave en variables locales. El argumento *keywords* es un arreglo terminado en ``NULL`` de nombres de parámetros de palabras clave. Los nombres vacíos denotan :ref:`parámetros solo posicionales <positional-only_parameter>`. Retorna verdadero cuando hay éxito; en caso de fallo, retorna falso y genera la excepción apropiada.

source: Added support for :ref:`positional-only parameters <positional-only_parameter>`.
es: Soporte agregado para :ref:`sólo parámetros posicionales <positional-only_parameter>`.

source: Identical to :c:func:`PyArg_ParseTupleAndKeywords`, except that it accepts a va_list rather than a variable number of arguments.
es: Idéntico a :c:func:`PyArg_ParseTupleAndKeywords`, excepto que acepta una *va_list* en lugar de un número variable de argumentos.

source: Ensure that the keys in the keywords argument dictionary are strings. This is only needed if :c:func:`PyArg_ParseTupleAndKeywords` is not used, since the latter already does this check.
es: Asegúrese de que las claves en el diccionario de argumentos de palabras clave son cadenas. Esto solo es necesario si :c:func:`PyArg_ParseTupleAndKeywords` no se utiliza, ya que este último ya hace esta comprobación.

source: Function used to deconstruct the argument lists of "old-style" functions --- these are functions which use the :const:`METH_OLDARGS` parameter parsing method, which has been removed in Python 3. This is not recommended for use in parameter parsing in new code, and most code in the standard interpreter has been modified to no longer use this for that purpose. It does remain a convenient way to decompose other tuples, however, and may continue to be used for that purpose.
es: Función utilizada para deconstruir las listas de argumentos de las funciones de "estilo antiguo" --- estas son funciones que usan el método de análisis de parámetros :const:`METH_OLDARGS`, que se ha eliminado en Python 3. No se recomienda su uso en el análisis de parámetros en código nuevo, y la mayoría del código en el intérprete estándar se ha modificado para que ya no se use para ese propósito. Sin embargo, sigue siendo una forma conveniente de descomponer otras tuplas, y puede continuar usándose para ese propósito.

source: A simpler form of parameter retrieval which does not use a format string to specify the types of the arguments. Functions which use this method to retrieve their parameters should be declared as :const:`METH_VARARGS` in function or method tables. The tuple containing the actual parameters should be passed as *args*; it must actually be a tuple. The length of the tuple must be at least *min* and no more than *max*; *min* and *max* may be equal. Additional arguments must be passed to the function, each of which should be a pointer to a :c:type:`PyObject\*` variable; these will be filled in with the values from *args*; they will contain borrowed references. The variables which correspond to optional parameters not given by *args* will not be filled in; these should be initialized by the caller. This function returns true on success and false if *args* is not a tuple or contains the wrong number of elements; an exception will be set if there was a failure.
es: Una forma más simple de recuperación de parámetros que no utiliza una cadena de formato para especificar los tipos de argumentos. Las funciones que utilizan este método para recuperar sus parámetros deben declararse como :const:`METH_VARARGS` en las tablas de funciones o métodos. La tupla que contiene los parámetros reales debe pasarse como *args*; en realidad debe ser una tupla. La longitud de la tupla debe ser al menos *min* y no más de *max*; *min* y *max* pueden ser iguales. Se deben pasar argumentos adicionales a la función, cada uno de los cuales debe ser un puntero a una variable :c:type:`PyObject\*`; estos se completarán con los valores de *args*; contendrán referencias prestadas. Las variables que corresponden a parámetros opcionales no dados por *args* no se completarán; estos deben ser inicializados por quien llama. Esta función retorna verdadero en caso de éxito y falso si *args* no es una tupla o contiene el número incorrecto de elementos; se establecerá una excepción si hubo una falla.

source: This is an example of the use of this function, taken from the sources for the :mod:`_weakref` helper module for weak references::
es: Este es un ejemplo del uso de esta función, tomado de las fuentes del módulo auxiliar :mod:`_weakref` para referencias débiles::

source: The call to :c:func:`PyArg_UnpackTuple` in this example is entirely equivalent to this call to :c:func:`PyArg_ParseTuple`::
es: La llamada a :c:func:`PyArg_UnpackTuple` en este ejemplo es completamente equivalente a esta llamada a :c:func:`PyArg_ParseTuple`::

source: Building values
es: Construyendo valores

source: Create a new value based on a format string similar to those accepted by the :c:func:`PyArg_Parse\*` family of functions and a sequence of values. Returns the value or ``NULL`` in the case of an error; an exception will be raised if ``NULL`` is returned.
es: Crea un nuevo valor basado en una cadena de formato similar a los aceptados por la familia de funciones :c:func:`PyArg_Parse\*` y una secuencia de valores. Retorna el valor o ``NULL`` en caso de error; se generará una excepción si se retorna ``NULL``.

source: :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
es: :c:func:`Py_BuildValue` no siempre genera una tupla. Construye una tupla solo si su cadena de formato contiene dos o más unidades de formato. Si la cadena de formato está vacía, retorna ``None``; si contiene exactamente una unidad de formato, retorna el objeto que describa esa unidad de formato. Para forzarlo a retornar una tupla de tamaño 0 o uno, paréntesis la cadena de formato.

source: When memory buffers are passed as parameters to supply data to build objects, as for the ``s`` and ``s#`` formats, the required data is copied. Buffers provided by the caller are never referenced by the objects created by :c:func:`Py_BuildValue`. In other words, if your code invokes :c:func:`malloc` and passes the allocated memory to :c:func:`Py_BuildValue`, your code is responsible for calling :c:func:`free` for that memory once :c:func:`Py_BuildValue` returns.
es: Cuando los búfer de memoria se pasan como parámetros para suministrar datos para construir objetos, como para los formatos ``s`` y ``s#``, los datos requeridos se copian. Las memorias intermedias proporcionadas por quien llama nunca son referenciadas por los objetos creados por :c:func:`Py_BuildValue`. En otras palabras, si su código invoca :c:func:`malloc` y pasa la memoria asignada a :c:func:`Py_BuildValue`, su código es responsable de llamar a :c:func:`free` para esa memoria una vez retorna :c:func:`Py_BuildValue`.

source: In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that the format unit will return; and the entry in [square] brackets is the type of the C value(s) to be passed.
es: En la siguiente descripción, la cadena de caracteres entre comillas, `así`, es la unidad de formato; la entrada entre paréntesis (redondos) es el tipo de objeto Python que retornará la unidad de formato; y la entrada entre corchetes [cuadrados] es el tipo de los valores C que se pasarán.

source: The characters space, tab, colon and comma are ignored in format strings (but not within format units such as ``s#``). This can be used to make long format strings a tad more readable.
es: Los caracteres espacio, tabulación, dos puntos y coma se ignoran en las cadenas de formato (pero no dentro de las unidades de formato como ``s#``). Esto se puede usar para hacer que las cadenas de formato largo sean un poco más legibles.

source: ``s`` (:class:`str` or ``None``) [const char \*]
es: ``s`` (:class:`str` o ``None``) [const char \*]

source: Convert a null-terminated C string to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, ``None`` is used.
es: Convierte una cadena de caracteres C terminada en nulo en un objeto Python :class:`str` usando la codificación ``'utf-8'``. Si el puntero de la cadena de caracteres C es ``NULL``, se usa ``None``.

source: ``s#`` (:class:`str` or ``None``) [const char \*, int or :c:type:`Py_ssize_t`]
es: ``s#`` (:class:`str` o ``None``) [const char \*, int o :c:type:`Py_ssize_t`]

source: Convert a C string and its length to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, the length is ignored and ``None`` is returned.
es: Convierte una cadena de caracteres de C y su longitud en un objeto Python :class:`str` utilizando la codificación ``'utf-8'``. Si el puntero de la cadena de caracteres de C es ``NULL``, la longitud se ignora y se retorna ``None``.
