Repository: python/python-docs-es
Catalog: c-api/buffer.po
Languages: es

source: Buffer Protocol
es: Protocolo búfer

source: Certain objects available in Python wrap access to an underlying memory array or *buffer*. Such objects include the built-in :class:`bytes` and :class:`bytearray`, and some extension types like :class:`array.array`. Third-party libraries may define their own types for special purposes, such as image processing or numeric analysis.
es: Ciertos objetos disponibles en Python ajustan el acceso a un arreglo de memoria subyacente o *buffer*. Dichos objetos incluyen el incorporado :class:`bytes` y :class:`bytearray`, y algunos tipos de extensión como :class:`array.array`. Las bibliotecas de terceros pueden definir sus propios tipos para fines especiales, como el procesamiento de imágenes o el análisis numérico.

source: While each of these types have their own semantics, they share the common characteristic of being backed by a possibly large memory buffer. It is then desirable, in some situations, to access that buffer directly and without intermediate copying.
es: Si bien cada uno de estos tipos tiene su propia semántica, comparten la característica común de estar respaldados por un búfer de memoria posiblemente grande. Es deseable, en algunas situaciones, acceder a ese búfer directamente y sin copia intermedia.

source: Python provides such a facility at the C level in the form of the :ref:`buffer protocol <bufferobjects>`. This protocol has two sides:
es: Python proporciona una instalación de este tipo en el nivel C en la forma de :ref:`protocolo búfer <bufferobjects>`. Este protocolo tiene dos lados:

source: on the producer side, a type can export a "buffer interface" which allows objects of that type to expose information about their underlying buffer. This interface is described in the section :ref:`buffer-structs`;
es: en el lado del productor, un tipo puede exportar una "interfaz de búfer" que permite a los objetos de ese tipo exponer información sobre su búfer subyacente. Esta interfaz se describe en la sección :ref:`buffer-structs`;

source: on the consumer side, several means are available to obtain a pointer to the raw underlying data of an object (for example a method parameter).
es: en el lado del consumidor, hay varios medios disponibles para obtener un puntero a los datos subyacentes sin procesar de un objeto (por ejemplo, un parámetro de método).

source: Simple objects such as :class:`bytes` and :class:`bytearray` expose their underlying buffer in byte-oriented form. Other forms are possible; for example, the elements exposed by an :class:`array.array` can be multi-byte values.
es: Los objetos simples como :class:`bytes` y :class:`bytearray` exponen su búfer subyacente en forma orientada a bytes. Otras formas son posibles; por ejemplo, los elementos expuestos por un :class:`array.array` pueden ser valores de varios bytes.

source: There are two ways for a consumer of the buffer interface to acquire a buffer over a target object:
es: Hay dos formas para que un consumidor de la interfaz del búfer adquiera un búfer sobre un objeto de destino:

source: call :c:func:`PyObject_GetBuffer` with the right parameters;
es: llamar :c:func:`PyObject_GetBuffer` con los parámetros correctos;

source: call :c:func:`PyArg_ParseTuple` (or one of its siblings) with one of the ``y*``, ``w*`` or ``s*`` :ref:`format codes <arg-parsing>`.
es: llamar :c:func:`PyArg_ParseTuple` (o uno de sus hermanos) con uno de los ``y*``, ``w*`` o ``s*`` :ref:`códigos de formato <arg-parsing>`.

source: In both cases, :c:func:`PyBuffer_Release` must be called when the buffer isn't needed anymore. Failure to do so could lead to various issues such as resource leaks.
es: En ambos casos, se debe llamar a :c:func:`PyBuffer_Release` cuando ya no se necesita el búfer. De lo contrario, podrían surgir varios problemas, como pérdidas de recursos.

source: Buffer structure
es: Estructura de búfer

source: Buffer structures (or simply "buffers") are useful as a way to expose the binary data from another object to the Python programmer. They can also be used as a zero-copy slicing mechanism. Using their ability to reference a block of memory, it is possible to expose any data to the Python programmer quite easily. The memory could be a large, constant array in a C extension, it could be a raw block of memory for manipulation before passing to an operating system library, or it could be used to pass around structured data in its native, in-memory format.
es: Las estructuras de búfer (o simplemente "búferes") son útiles como una forma de exponer los datos binarios de otro objeto al programador de Python. También se pueden usar como un mecanismo de corte de copia cero. Usando su capacidad para hacer referencia a un bloque de memoria, es posible exponer cualquier información al programador Python con bastante facilidad. La memoria podría ser una matriz grande y constante en una extensión C, podría ser un bloque de memoria sin procesar para su manipulación antes de pasar a una biblioteca del sistema operativo, o podría usarse para pasar datos estructurados en su formato nativo en memoria .

source: Contrary to most data types exposed by the Python interpreter, buffers are not :c:type:`PyObject` pointers but rather simple C structures. This allows them to be created and copied very simply. When a generic wrapper around a buffer is needed, a :ref:`memoryview <memoryview-objects>` object can be created.
es: Contrariamente a la mayoría de los tipos de datos expuestos por el intérprete de Python, los búferes no son punteros :c:type:`PyObject` sino estructuras C simples. Esto les permite ser creados y copiados de manera muy simple. Cuando se necesita un contenedor genérico alrededor de un búfer, un objeto :ref:`memoryview <memoryview-objects>` puede ser creado.

source: For short instructions how to write an exporting object, see :ref:`Buffer Object Structures <buffer-structs>`. For obtaining a buffer, see :c:func:`PyObject_GetBuffer`.
es: Para obtener instrucciones breves sobre cómo escribir un objeto de exportación, consulte :ref:`Estructuras de objetos búfer <buffer-structs>`. Para obtener un búfer, consulte :c:func:`PyObject_GetBuffer`.

source: A pointer to the start of the logical structure described by the buffer fields. This can be any location within the underlying physical memory block of the exporter. For example, with negative :c:member:`~Py_buffer.strides` the value may point to the end of the memory block.
es: Un puntero al inicio de la estructura lógica descrita por los campos del búfer. Puede ser cualquier ubicación dentro del bloque de memoria física subyacente del exportador. Por ejemplo, con negativo :c:member:`~Py_buffer.strides` el valor puede apuntar al final del bloque de memoria.

source: For :term:`contiguous` arrays, the value points to the beginning of the memory block.
es: Para arreglos :term:`contiguous`, el valor apunta al comienzo del bloque de memoria.

source: As a special case, for *temporary* buffers that are wrapped by :c:func:`PyMemoryView_FromBuffer` or :c:func:`PyBuffer_FillInfo` this field is ``NULL``. In general, exporting objects MUST NOT use this scheme.
es: Como un caso especial, para los búferes *temporary* que están envueltos por :c:func:`PyMemoryView_FromBuffer` o :c:func:`PyBuffer_FillInfo` este campo es ``NULL``. En general, los objetos de exportación NO DEBEN usar este esquema.

source: ``product(shape) * itemsize``. For contiguous arrays, this is the length of the underlying memory block. For non-contiguous arrays, it is the length that the logical structure would have if it were copied to a contiguous representation.
es: ``product(shape) * itemize``. Para arreglos contiguos, esta es la longitud del bloque de memoria subyacente. Para arreglos no contiguos, es la longitud que tendría la estructura lógica si se copiara en una representación contigua.

source: Accessing ``((char *)buf)[0] up to ((char *)buf)[len-1]`` is only valid if the buffer has been obtained by a request that guarantees contiguity. In most cases such a request will be :c:macro:`PyBUF_SIMPLE` or :c:macro:`PyBUF_WRITABLE`.
es: Accede a ``((char *)buf)[0] hasta ((char *)buf)[len-1]`` solo es válido si el búfer se ha obtenido mediante una solicitud que garantiza la contigüidad. En la mayoría de los casos, dicha solicitud será :c:macro:`PyBUF_SIMPLE` o :c:macro:`PyBUF_WRITABLE`.

source: An indicator of whether the buffer is read-only. This field is controlled by the :c:macro:`PyBUF_WRITABLE` flag.
es: Un indicador de si el búfer es de solo lectura. Este campo está controlado por el indicador :c:macro:`PyBUF_WRITABLE`.

source: Item size in bytes of a single element. Same as the value of :func:`struct.calcsize` called on non-``NULL`` :c:member:`~Py_buffer.format` values.
es: Tamaño del elemento en bytes de un solo elemento. Igual que el valor de :func:`struct.calcsize` invocado en valores no ``NULL`` :c:member:`~Py_buffer.format`.

source: Important exception: If a consumer requests a buffer without the :c:macro:`PyBUF_FORMAT` flag, :c:member:`~Py_buffer.format` will be set to ``NULL``, but :c:member:`~Py_buffer.itemsize` still has the value for the original format.
es: Excepción importante: si un consumidor solicita un búfer sin el indicador :c:macro:`PyBUF_FORMAT`, :c:member:`~Py_buffer.format` se establecerá en ``NULL``, pero :c:member:`~Py_buffer.itemsize` todavía tiene el valor para el formato original.

source: If :c:member:`~Py_buffer.shape` is present, the equality ``product(shape) * itemsize == len`` still holds and the consumer can use :c:member:`~Py_buffer.itemsize` to navigate the buffer.
es: Si :c:member:`~Py_buffer.shape` está presente, la igualdad ``product(shape) * itemsize == len`` aún se mantiene y el consumidor puede usar :c:member:`~Py_buffer.itemsize` para navegar el búfer.

source: If :c:member:`~Py_buffer.shape` is ``NULL`` as a result of a :c:macro:`PyBUF_SIMPLE` or a :c:macro:`PyBUF_WRITABLE` request, the consumer must disregard :c:member:`~Py_buffer.itemsize` and assume ``itemsize == 1``.
es: Si :c:member:`~Py_buffer.shape` es ``NULL`` como resultado de un :c:macro:`PyBUF_SIMPLE` o un :c:macro:`PyBUF_WRITABLE`, el consumidor debe ignorar :c:member:`~Py_buffer.itemsize` y asume ``itemsize == 1``.

source: A *NUL* terminated string in :mod:`struct` module style syntax describing the contents of a single item. If this is ``NULL``, ``"B"`` (unsigned bytes) is assumed.
es: Una cadena de caracteres terminada en *NUL* en sintaxis de estilo del modulo :mod:`struct` que describe el contenido de un solo elemento. Si esto es ``NULL``, se supone ``"B"`` (bytes sin signo).

source: This field is controlled by the :c:macro:`PyBUF_FORMAT` flag.
es: Este campo está controlado por el indicador :c:macro:`PyBUF_FORMAT`.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim` indicating the shape of the memory as an n-dimensional array. Note that ``shape[0] * ... * shape[ndim-1] * itemsize`` MUST be equal to :c:member:`~Py_buffer.len`.
es: Un arreglo de :c:type:`Py_ssize_t` de longitud :c:member:`~Py_buffer.ndim` que indica la forma de la memoria como un arreglo n-dimensional. Tenga en cuenta que ``shape[0] * ... * shape[ndim-1] * itemsize`` DEBE ser igual a :c:member:`~Py_buffer.len`.

source: Shape values are restricted to ``shape[n] >= 0``. The case ``shape[n] == 0`` requires special attention. See `complex arrays`_ for further information.
es: Los valores de forma están restringidos a ``shape[n] >= 0``. El caso ``shape[n] == 0`` requiere atención especial. Vea arreglos complejos (`complex arrays`_) para más información.

source: The shape array is read-only for the consumer.
es: El arreglo de formas es de sólo lectura para el consumidor.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim` giving the number of bytes to skip to get to a new element in each dimension.
es: Un arreglo de :c:type:`Py_ssize_t` de longitud :c:member:`~Py_buffer.ndim` que proporciona el número de bytes que se omiten para llegar a un nuevo elemento en cada dimensión.

source: Stride values can be any integer. For regular arrays, strides are usually positive, but a consumer MUST be able to handle the case ``strides[n] <= 0``. See `complex arrays`_ for further information.
es: Los valores de *stride* pueden ser cualquier número entero. Para los arreglos regulares, los pasos son generalmente positivos, pero un consumidor DEBE ser capaz de manejar el caso ``strides[n] <= 0``. Ver `complex arrays`_ para más información.

source: The strides array is read-only for the consumer.
es: El arreglo *strides* es de sólo lectura para el consumidor.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim`. If ``suboffsets[n] >= 0``, the values stored along the nth dimension are pointers and the suboffset value dictates how many bytes to add to each pointer after de-referencing. A suboffset value that is negative indicates that no de-referencing should occur (striding in a contiguous memory block).
es: Un arreglo de :c:type:`Py_ssize_t` de longitud :c:member:`~Py_buffer.ndim`. Si ``suboffsets[n] >= 0``, los valores almacenados a lo largo de la enésima dimensión son punteros y el valor del *suboffsets* dicta cuántos bytes agregar a cada puntero después de desreferenciarlos. Un valor de *suboffsets* negativo indica que no debe producirse una desreferenciación (*striding* en un bloque de memoria contiguo).

source: If all suboffsets are negative (i.e. no de-referencing is needed), then this field must be ``NULL`` (the default value).
es: Si todos los *suboffsets* son negativos (es decir, no se necesita desreferenciar), entonces este campo debe ser ``NULL`` (el valor predeterminado).

source: This type of array representation is used by the Python Imaging Library (PIL). See `complex arrays`_ for further information how to access elements of such an array.
es: *Python Imaging Library (PIL)* utiliza este tipo de representación de arreglos. Consulte `complex arrays`_ para obtener más información sobre cómo acceder a los elementos de dicho arreglo.

source: The suboffsets array is read-only for the consumer.
es: El arreglo de *suboffsets* es de sólo lectura para el consumidor.

source: This is for use internally by the exporting object. For example, this might be re-cast as an integer by the exporter and used to store flags about whether or not the shape, strides, and suboffsets arrays must be freed when the buffer is released. The consumer MUST NOT alter this value.
es: Esto es para uso interno del objeto exportador. Por ejemplo, el exportador podría volver a emitirlo como un número entero y utilizarlo para almacenar indicadores sobre si las matrices de forma, *strides* y *suboffsets* deben liberarse cuando se libera el búfer. El consumidor NO DEBE alterar este valor.

source: Buffer request types
es: Tipos de solicitud búfer

source: Buffers are usually obtained by sending a buffer request to an exporting object via :c:func:`PyObject_GetBuffer`. Since the complexity of the logical structure of the memory can vary drastically, the consumer uses the *flags* argument to specify the exact buffer type it can handle.
es: Los búferes obtienen generalmente enviando una solicitud de búfer a un objeto de exportación a través de :c:func:`PyObject_GetBuffer`. Dado que la complejidad de la estructura lógica de la memoria puede variar drásticamente, el consumidor usa el argumento *flags* para especificar el tipo de búfer exacto que puede manejar.

source: request-independent fields
es: campos independientes de solicitud

source: The following fields are not influenced by *flags* and must always be filled in with the correct values: :c:member:`~Py_buffer.obj`, :c:member:`~Py_buffer.buf`, :c:member:`~Py_buffer.len`, :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`.
es: Los siguientes campos no están influenciados por *flags* y siempre deben completarse con los valores correctos: :c:member:`~Py_buffer.obj`, :c:member:`~Py_buffer.buf`, :c:member:`~Py_buffer.len`, :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`.

source: readonly, format
es: formato de sólo lectura

source: Controls the :c:member:`~Py_buffer.readonly` field. If set, the exporter MUST provide a writable buffer or else report failure. Otherwise, the exporter MAY provide either a read-only or writable buffer, but the choice MUST be consistent for all consumers.
es: Controla el campo :c:member:`~Py_buffer.readonly`. Si se establece, el exportador DEBE proporcionar un búfer de escritura o, de lo contrario, informar de un error. De lo contrario, el exportador PUEDE proporcionar un búfer de solo lectura o de escritura, pero la elección DEBE ser coherente para todos los consumidores.

source: Controls the :c:member:`~Py_buffer.format` field. If set, this field MUST be filled in correctly. Otherwise, this field MUST be ``NULL``.
es: Controla el campo :c:member:`~Py_buffer.format`. Si se establece, este campo DEBE completarse correctamente. De lo contrario, este campo DEBE ser ``NULL``.

source: :c:macro:`PyBUF_WRITABLE` can be \|'d to any of the flags in the next section. Since :c:macro:`PyBUF_SIMPLE` is defined as 0, :c:macro:`PyBUF_WRITABLE` can be used as a stand-alone flag to request a simple writable buffer.
es: :c:macro:`PyBUF_WRITABLE` puede ser \|'d a cualquiera de las banderas en la siguiente sección. Dado que :c:macro:`PyBUF_SIMPLE` se define como 0, :c:macro:`PyBUF_WRITABLE` puede usarse como un indicador independiente para solicitar un búfer de escritura simple.

source: :c:macro:`PyBUF_FORMAT` can be \|'d to any of the flags except :c:macro:`PyBUF_SIMPLE`. The latter already implies format ``B`` (unsigned bytes).
es: :c:macro:`PyBUF_FORMAT` puede ser \|'d para cualquiera de las banderas excepto :c:macro:`PyBUF_SIMPLE`. Este último ya implica el formato ``B`` (bytes sin signo).

source: shape, strides, suboffsets
es: formas, *strides*, *suboffsets*

source: The flags that control the logical structure of the memory are listed in decreasing order of complexity. Note that each flag contains all bits of the flags below it.
es: Las banderas que controlan la estructura lógica de la memoria se enumeran en orden decreciente de complejidad. Tenga en cuenta que cada bandera contiene todos los bits de las banderas debajo de ella.

source: Request
es: Solicitud

source: shape
es: forma

source: yes
es: sí

source: if needed
es: si es necesario

source: contiguity requests
es: solicitudes de contigüidad

source: C or Fortran :term:`contiguity <contiguous>` can be explicitly requested, with and without stride information. Without stride information, the buffer must be C-contiguous.
es: La :term:`contigüidad <contiguous>` C o Fortran se puede solicitar explícitamente, con y sin información de paso. Sin información de paso, el búfer debe ser C-contiguo.

source: C or F
es: C o F

source: compound requests
es: solicitudes compuestas

source: All possible requests are fully defined by some combination of the flags in the previous section. For convenience, the buffer protocol provides frequently used combinations as single flags.
es: Todas las solicitudes posibles están completamente definidas por alguna combinación de las banderas en la sección anterior. Por conveniencia, el protocolo de memoria intermedia proporciona combinaciones de uso frecuente como indicadores únicos.

source: In the following table *U* stands for undefined contiguity. The consumer would have to call :c:func:`PyBuffer_IsContiguous` to determine contiguity.
es: En la siguiente tabla *U* significa contigüidad indefinida. El consumidor tendría que llamar a :c:func:`PyBuffer_IsContiguous` para determinar la contigüidad.

source: readonly
es: sólo lectura

source: format
es: formato

source: 1 or 0
es: 1 o 0

source: Complex arrays
es: Arreglos complejos

source: NumPy-style: shape and strides
es: Estilo NumPy: forma y *strides*

source: The logical structure of NumPy-style arrays is defined by :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`, :c:member:`~Py_buffer.shape` and :c:member:`~Py_buffer.strides`.
es: La estructura lógica de las matrices de estilo NumPy está definida por :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`, :c:member:`~Py_buffer.shape` y :c:member:`~Py_buffer.strides`.

source: If ``ndim == 0``, the memory location pointed to by :c:member:`~Py_buffer.buf` is interpreted as a scalar of size :c:member:`~Py_buffer.itemsize`. In that case, both :c:member:`~Py_buffer.shape` and :c:member:`~Py_buffer.strides` are ``NULL``.
es: Si ``ndim == 0``, la ubicación de memoria señalada por :c:member:`~Py_buffer.buf` se interpreta como un escalar de tamaño :c:member:`~Py_buffer.itemsize`. En ese caso, tanto :c:member:`~Py_buffer.shape` como :c:member:`~Py_buffer.strides` son ``NULL``.

source: If :c:member:`~Py_buffer.strides` is ``NULL``, the array is interpreted as a standard n-dimensional C-array. Otherwise, the consumer must access an n-dimensional array as follows:
es: Si :c:member:`~Py_buffer.strides` es ``NULL``, el arreglo se interpreta como un arreglo C n-dimensional estándar. De lo contrario, el consumidor debe acceder a un arreglo n-dimensional de la siguiente manera:

source: As noted above, :c:member:`~Py_buffer.buf` can point to any location within the actual memory block. An exporter can check the validity of a buffer with this function:
es: Como se señaló anteriormente, :c:member:`~Py_buffer.buf` puede apuntar a cualquier ubicación dentro del bloque de memoria real. Un exportador puede verificar la validez de un búfer con esta función:

source: PIL-style: shape, strides and suboffsets
es: Estilo PIL: forma, *strides* y *suboffsets*

source: In addition to the regular items, PIL-style arrays can contain pointers that must be followed in order to get to the next element in a dimension. For example, the regular three-dimensional C-array ``char v[2][2][3]`` can also be viewed as an array of 2 pointers to 2 two-dimensional arrays: ``char (*v[2])[2][3]``. In suboffsets representation, those two pointers can be embedded at the start of :c:member:`~Py_buffer.buf`, pointing to two ``char x[2][3]`` arrays that can be located anywhere in memory.
es: Además de los elementos normales, los arreglos de estilo PIL pueden contener punteros que deben seguirse para llegar al siguiente elemento en una dimensión. Por ejemplo, el arreglo C tridimensional regular ``char v[2][2][3]`` también se puede ver como un arreglo de 2 punteros a 2 arreglos bidimensionales: ``char (*v[2])[2][3]``. En la representación de *suboffsets*, esos dos punteros pueden incrustarse al comienzo de :c:member:`~Py_buffer.buf`, apuntando a dos matrices ``char x[2][3]`` que pueden ubicarse en cualquier lugar de la memoria.

source: Here is a function that returns a pointer to the element in an N-D array pointed to by an N-dimensional index when there are both non-``NULL`` strides and suboffsets::
es: Aquí hay una función que retorna un puntero al elemento en un arreglo N-D a la que apunta un índice N-dimensional cuando hay *strides* y *suboffsets* no ``NULL``:

source: Buffer-related functions
es: Funciones relacionadas a búfer

source: Return ``1`` if *obj* supports the buffer interface otherwise ``0``. When ``1`` is returned, it doesn't guarantee that :c:func:`PyObject_GetBuffer` will succeed. This function always succeeds.
es: Retorna ``1`` si *obj* admite la interfaz de búfer; de lo contrario, ``0`` cuando se retorna ``1``, no garantiza que :c:func:`PyObject_GetBuffer` tenga éxito. Esta función siempre finaliza con éxito.
