Repository: python/python-docs-es
Catalog: c-api/buffer.po
Languages: es

source: On success, fill in *view*, set ``view->obj`` to a new reference to *exporter* and return 0. In the case of chained buffer providers that redirect requests to a single object, ``view->obj`` MAY refer to this object instead of *exporter* (See :ref:`Buffer Object Structures <buffer-structs>`).
es: Si tiene éxito, completa *view*, establece ``view->obj`` en una nueva referencia a *exporter* y retorna 0. En el caso de proveedores de búfer encadenados que redirigen las solicitudes a un solo objeto, ``view->obj`` PUEDE referirse a este objeto en lugar de *exporter* (Ver :ref:`Estructuras de objetos de búfer <buffer-structs>`).

source: Successful calls to :c:func:`PyObject_GetBuffer` must be paired with calls to :c:func:`PyBuffer_Release`, similar to :c:func:`malloc` and :c:func:`free`. Thus, after the consumer is done with the buffer, :c:func:`PyBuffer_Release` must be called exactly once.
es: Las llamadas exitosas a :c:func:`PyObject_GetBuffer` deben combinarse con las llamadas a :c:func:`PyBuffer_Release`, similar a :c:func:`malloc` y :c:func:`free`. Por lo tanto, después de que el consumidor haya terminado con el búfer, :c:func:`PyBuffer_Release` debe llamarse exactamente una vez.

source: It is an error to call this function on a buffer that was not obtained via :c:func:`PyObject_GetBuffer`.
es: Es un error llamar a esta función en un búfer que no se obtuvo a través de :c:func:`PyObject_GetBuffer`.

source: Return ``1`` if the memory defined by the *view* is C-style (*order* is ``'C'``) or Fortran-style (*order* is ``'F'``) :term:`contiguous` or either one (*order* is ``'A'``). Return ``0`` otherwise. This function always succeeds.
es: Retorna ``1`` si la memoria definida por *view* es de estilo C (*order* es ``'C'``) o de estilo Fortran (*order* es ``'F'``) :term:`contiguous` o uno cualquiera (*order* es ``'A'``). Retorna ``0`` de lo contrario. Esta función siempre finaliza con éxito.

source: Get the memory area pointed to by the *indices* inside the given *view*. *indices* must point to an array of ``view->ndim`` indices.
es: Obtiene el área de memoria señalada por los *indices* dentro del *view* dado. *indices* deben apuntar a un arreglo de índices ``view->ndim``.

source: Copy contiguous *len* bytes from *buf* to *view*. *fort* can be ``'C'`` or ``'F'`` (for C-style or Fortran-style ordering). ``0`` is returned on success, ``-1`` on error.
es: Copia *len* bytes contiguos de *buf* a *view*. *fort* puede ser ``'C'`` o ``'F'`` (para pedidos al estilo C o al estilo Fortran). ``0`` se retorna en caso de éxito, ``-1`` en caso de error.

source: Copy *len* bytes from *src* to its contiguous representation in *buf*. *order* can be ``'C'`` or ``'F'`` or ``'A'`` (for C-style or Fortran-style ordering or either one). ``0`` is returned on success, ``-1`` on error.
es: Copia *len* bytes de *src* a su representación contigua en *buf*. *order* puede ser ``'C'`` o ``'F'`` o ``''A'`` (para pedidos al estilo C o al estilo Fortran o cualquiera) ``0`` se retorna en caso de éxito, ``-1`` en caso de error.

source: This function fails if *len* != *src->len*.
es: Esta función falla si *len* != *src->len*.

source: Copy data from *src* to *dest* buffer. Can convert between C-style and or Fortran-style buffers.
es: Copiar datos del búfer *src* al *dest*. Puede convertir entre búferes de estilo C o Fortran.

source: ``0`` is returned on success, ``-1`` on error.
es: Se retorna ``0`` en caso de éxito, ``-1`` en caso de error.

source: Fill the *strides* array with byte-strides of a :term:`contiguous` (C-style if *order* is ``'C'`` or Fortran-style if *order* is ``'F'``) array of the given shape with the given number of bytes per element.
es: Rellena el arreglo *strides* con bytes de paso de un :term:`contiguous` (estilo C si *order* es ``'C'`` o estilo Fortran si *order* es ``'F '`` ) arreglo de la forma dada con el número dado de bytes por elemento.

source: Handle buffer requests for an exporter that wants to expose *buf* of size *len* with writability set according to *readonly*. *buf* is interpreted as a sequence of unsigned bytes.
es: Maneje las solicitudes de búfer para un exportador que quiera exponer *buf* de tamaño *len* con capacidad de escritura establecida de acuerdo con *readonly*. *buf* se interpreta como una secuencia de bytes sin signo.

source: The *flags* argument indicates the request type. This function always fills in *view* as specified by flags, unless *buf* has been designated as read-only and :c:macro:`PyBUF_WRITABLE` is set in *flags*.
es: El argumento *flags* indica el tipo de solicitud. Esta función siempre llena *view* según lo especificado por *flags*, a menos que *buf* haya sido designado como solo lectura y :c:macro:`PyBUF_WRITABLE` esté configurado en *flags*.

source: If this function is used as part of a :ref:`getbufferproc <buffer-structs>`, *exporter* MUST be set to the exporting object and *flags* must be passed unmodified. Otherwise, *exporter* MUST be ``NULL``.
es: Si esta función se usa como parte de a :ref:`getbufferproc <buffer-structs>`, *exporter* DEBE establecerse en el objeto exportador y *flags* deben pasarse sin modificaciones. De lo contrario, *exporter* DEBE ser ``NULL``.
