Repository: python/python-docs-es
Catalog: c-api/bytearray.po
Languages: es

source: Byte Array Objects
es: Objetos de arreglos de bytes (*bytearrays*)

source: This subtype of :c:type:`PyObject` represents a Python bytearray object.
es: Este subtipo de :c:type:`PyObject` representa un objeto arreglo de bytes de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python bytearray type; it is the same object as :class:`bytearray` in the Python layer.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo arreglo de bytes de Python; es el mismo objeto que :class:`bytearray` en la capa de Python.

source: Type check macros
es: Macros de verificación de tipos

source: Return true if the object *o* is a bytearray object or an instance of a subtype of the bytearray type.
es: Retorna verdadero si el objeto *o* es un objeto de arreglo de bytes o una instancia de un subtipo del tipo arreglo de bytes.

source: Return true if the object *o* is a bytearray object, but not an instance of a subtype of the bytearray type.
es: Retorna verdadero si el objeto *o* es un objeto de arreglo de bytes, pero no una instancia de un subtipo del tipo arreglo de bytes.

source: Direct API functions
es: Funciones API directas

source: Return a new bytearray object from any object, *o*, that implements the :ref:`buffer protocol <bufferobjects>`.
es: Retorna un nuevo objeto de arreglo de bytes de cualquier objeto, *o*, que implementa el :ref:`buffer protocol <bufferobjects>`.

source: Create a new bytearray object from *string* and its length, *len*. On failure, ``NULL`` is returned.
es: Crea un nuevo objeto de arreglo de bytes a partir de *string* y su longitud, *len*. En caso de fallo, se retorna ``NULL``.

source: Concat bytearrays *a* and *b* and return a new bytearray with the result.
es: Une los arreglos de bytes (*bytearrays*) *a* y *b* y retorna un nuevo arreglo de bytes (*bytearray*) con el resultado.

source: Return the size of *bytearray* after checking for a ``NULL`` pointer.
es: Retorna el tamaño de *bytearray* después de buscar un puntero ``NULL``.

source: Return the contents of *bytearray* as a char array after checking for a ``NULL`` pointer. The returned array always has an extra null byte appended.
es: Retorna el contenido de *bytearray* como un arreglo de caracteres después de verificar un puntero ``NULL``. La arreglo retornado siempre tiene un byte nulo adicional agregado.

source: Resize the internal buffer of *bytearray* to *len*.
es: Cambia el tamaño del búfer interno de *bytearray* a *len*.

source: These macros trade safety for speed and they don't check pointers.
es: Estos macros intercambian seguridad por velocidad y no comprueban punteros.

source: Macro version of :c:func:`PyByteArray_AsString`.
es: Versión macro de :c:func:`PyByteArray_AsString`.

source: Macro version of :c:func:`PyByteArray_Size`.
es: Versión macro de :c:func:`PyByteArray_Size`.
