Repository: python/python-docs-es
Catalog: c-api/call.po
Languages: es

source: Call Protocol
es: Protocolo de llamada

source: CPython supports two different calling protocols: *tp_call* and vectorcall.
es: CPython admite dos protocolos de llamada diferentes: *tp_call* y vectorcall.

source: The *tp_call* Protocol
es: El protocolo *tp_call*

source: Instances of classes that set :c:member:`~PyTypeObject.tp_call` are callable. The signature of the slot is::
es: Las instancias de clases que establecen :c:member:`~PyTypeObject.tp_call` son invocables. La firma del slot es:

source: A call is made using a tuple for the positional arguments and a dict for the keyword arguments, similarly to ``callable(*args, **kwargs)`` in Python code. *args* must be non-NULL (use an empty tuple if there are no arguments) but *kwargs* may be *NULL* if there are no keyword arguments.
es: Se realiza una llamada usando una tupla para los argumentos posicionales y un dict para los argumentos de palabras clave, de manera similar a ``callable(*args, **kwargs)`` en el código Python. *args* debe ser no NULL (use una tupla vacía si no hay argumentos) pero *kwargs* puede ser *NULL* si no hay argumentos de palabra clave.

source: This convention is not only used by *tp_call*: :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_init` also pass arguments this way.
es: Esta convención no solo es utilizada por *tp_call*: :c:member:`~PyTypeObject.tp_new` y :c:member:`~PyTypeObject.tp_init` también pasan argumentos de esta manera.

source: The Vectorcall Protocol
es: El protocolo vectorcall

source: The vectorcall protocol was introduced in :pep:`590` as an additional protocol for making calls more efficient.
es: El protocolo vectorcall se introdujo en :pep:`590` como un protocolo adicional para hacer que las llamadas sean más eficientes.

source: As rule of thumb, CPython will prefer the vectorcall for internal calls if the callable supports it. However, this is not a hard rule. Additionally, some third-party extensions use *tp_call* directly (rather than using :c:func:`PyObject_Call`). Therefore, a class supporting vectorcall must also implement :c:member:`~PyTypeObject.tp_call`. Moreover, the callable must behave the same regardless of which protocol is used. The recommended way to achieve this is by setting :c:member:`~PyTypeObject.tp_call` to :c:func:`PyVectorcall_Call`. This bears repeating:
es: Como regla general, CPython preferirá el vectorcall para llamadas internas si el invocable lo admite. Sin embargo, esta no es una regla estricta. Además, algunas extensiones de terceros usan *tp_call* directamente (en lugar de usar :c:func:`PyObject_Call`). Por lo tanto, una clase que admita vectorcall también debe implementar :c:member:`~PyTypeObject.tp_call`. Además, el invocable debe comportarse de la misma manera independientemente del protocolo que se utilice. La forma recomendada de lograr esto es configurando :c:member:`~PyTypeObject.tp_call` en :c:func:`PyVectorcall_Call`. Vale la pena repetirlo:

source: A class supporting vectorcall **must** also implement :c:member:`~PyTypeObject.tp_call` with the same semantics.
es: Una clase que admita vectorcall **debe** también implementar :c:member:`~PyTypeObject.tp_call` con la misma semántica.

source: A class should not implement vectorcall if that would be slower than *tp_call*. For example, if the callee needs to convert the arguments to an args tuple and kwargs dict anyway, then there is no point in implementing vectorcall.
es: Una clase no debería implementar vectorcall si eso fuera más lento que *tp_call*. Por ejemplo, si el destinatario de la llamada necesita convertir los argumentos a una tupla args y un dict kwargs de todos modos, entonces no tiene sentido implementar vectorcall.

source: *callable* is the object being called.
es: *callable* es el objeto siendo invocado.

source: *args* is a C array consisting of the positional arguments followed by the
es: *args* es un arreglo en C que consta de los argumentos posicionales seguidos por el

source: values of the keyword arguments. This can be *NULL* if there are no arguments.
es: valores de los argumentos de la palabra clave. Puede ser *NULL* si no hay argumentos.

source: *nargsf* is the number of positional arguments plus possibly the
es: *nargsf* es el número de argumentos posicionales más posiblemente el

source: *kwnames* is a tuple containing the names of the keyword arguments;
es: *kwnames* es una tupla que contiene los nombres de los argumentos de la palabra clave;

source: in other words, the keys of the kwargs dict. These names must be strings (instances of ``str`` or a subclass) and they must be unique. If there are no keyword arguments, then *kwnames* can instead be *NULL*.
es: en otras palabras, las claves del diccionario kwargs. Estos nombres deben ser cadenas (instancias de ``str`` o una subclase) y deben ser únicos. Si no hay argumentos de palabras clave, entonces *kwnames* puede ser *NULL*.

source: If this flag is set in a vectorcall *nargsf* argument, the callee is allowed to temporarily change ``args[-1]``. In other words, *args* points to argument 1 (not 0) in the allocated vector. The callee must restore the value of ``args[-1]`` before returning.
es: Si este flag se establece en un argumento vectorcall *nargsf*, el destinatario de la llamada puede cambiar temporalmente ``args[-1]``. En otras palabras, *args* apunta al argumento 1 (no 0) en el vector asignado. El destinatario de la llamada debe restaurar el valor de ``args[-1]`` antes de regresar.

source: For :c:func:`PyObject_VectorcallMethod`, this flag means instead that ``args[0]`` may be changed.
es: Para :c:func:`PyObject_VectorcallMethod`, este flag significa en cambio que ``args[0]`` puede cambiarse.

source: To call an object that implements vectorcall, use a :ref:`call API <capi-call>` function as with any other callable. :c:func:`PyObject_Vectorcall` will usually be most efficient.
es: Para llamar a un objeto que implementa vectorcall, use una función :ref:`call API <capi-call>` como con cualquier otro invocable. :c:func:`PyObject_Vectorcall` normalmente será más eficiente.

source: In CPython 3.8, the vectorcall API and related functions were available provisionally under names with a leading underscore: ``_PyObject_Vectorcall``, ``_Py_TPFLAGS_HAVE_VECTORCALL``, ``_PyObject_VectorcallMethod``, ``_PyVectorcall_Function``, ``_PyObject_CallOneArg``, ``_PyObject_CallMethodNoArgs``, ``_PyObject_CallMethodOneArg``. Additionally, ``PyObject_VectorcallDict`` was available as ``_PyObject_FastCallDict``. The old names are still defined as aliases of the new, non-underscored names.
es: En CPython 3.8, la API de vectorcall y las funciones relacionadas estaban disponibles provisionalmente bajo nombres con un guión bajo inicial: ``_PyObject_Vectorcall``, ``_Py_TPFLAGS_HAVE_VECTORCALL``, ``_PyObject_VectorcallMethod``, ``_PyVectorcall_Function``, ``_PyObject_CallMethodNoArgs``, ``_PyObject_CallMethodOneArg``. Además, ``PyObject_VectorcallDict`` estaba disponible como ``_PyObject_FastCallDict``. Los nombres antiguos todavía se definen como alias de los nuevos nombres no subrayados.

source: Recursion Control
es: Control de recursión

source: When using *tp_call*, callees do not need to worry about :ref:`recursion <recursion>`: CPython uses :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` for calls made using *tp_call*.
es: Cuando se usa *tp_call*, los destinatarios no necesitan preocuparse por :ref:`recursividad <recursion>`: CPython usa :c:func:`Py_EnterRecursiveCall` y :c:func:`Py_LeaveRecursiveCall` para llamadas realizadas usando *tp_call*.

source: For efficiency, this is not the case for calls done using vectorcall: the callee should use *Py_EnterRecursiveCall* and *Py_LeaveRecursiveCall* if needed.
es: Por eficiencia, este no es el caso de las llamadas realizadas mediante vectorcall: el destinatario de la llamada debe utilizar *Py_EnterRecursiveCall* y *Py_LeaveRecursiveCall* si es necesario.

source: Vectorcall Support API
es: API de soporte para vectorcall

source: Given a vectorcall *nargsf* argument, return the actual number of arguments. Currently equivalent to::
es: Dado un argumento vectorcall *nargsf*, retorna el número real de argumentos. Actualmente equivalente a:

source: However, the function ``PyVectorcall_NARGS`` should be used to allow for future extensions.
es: Sin embargo, la función ``PyVectorcall_NARGS`` debe usarse para permitir futuras extensiones.

source: If *op* does not support the vectorcall protocol (either because the type does not or because the specific instance does not), return *NULL*. Otherwise, return the vectorcall function pointer stored in *op*. This function never raises an exception.
es: Si *op* no admite el protocolo vectorcall (ya sea porque el tipo no lo hace o porque la instancia específica no lo hace), retorna *NULL*. De lo contrario, retorna el puntero de la función vectorcall almacenado en *op*. Esta función nunca lanza una excepción.

source: This is mostly useful to check whether or not *op* supports vectorcall, which can be done by checking ``PyVectorcall_Function(op) != NULL``.
es: Esto es principalmente útil para verificar si *op* admite vectorcall, lo cual se puede hacer marcando ``PyVectorcall_Function(op) != NULL``.

source: Call *callable*'s :c:type:`vectorcallfunc` with positional and keyword arguments given in a tuple and dict, respectively.
es: Llama a la :c:type:`vectorcallfunc` de *callable* con argumentos posicionales y de palabras clave dados en una tupla y dict, respectivamente.

source: Object Calling API
es: API para invocar objetos

source: Various functions are available for calling a Python object. Each converts its arguments to a convention supported by the called object – either *tp_call* or vectorcall. In order to do as little conversion as possible, pick one that best fits the format of data you have available.
es: Hay varias funciones disponibles para llamar a un objeto Python. Cada una convierte sus argumentos a una convención respaldada por el objeto llamado, ya sea *tp_call* o vectorcall. Para realizar la menor conversión posible, elija la que mejor se adapte al formato de datos que tiene disponible.

source: The following table summarizes the available functions; please see individual documentation for details.
es: La siguiente tabla resume las funciones disponibles; consulte la documentación individual para obtener más detalles.

source: Function
es: Función

source: callable
es: invocable

source: tuple
es: tupla

source: 1 object
es: 1 objeto

source: format
es: formato

source: variadic
es: variadica

source: obj + name
es: obj + nombre

source: arg + name
es: arg + nombre

source: Call a callable Python object *callable*, with arguments given by the tuple *args*, and named arguments given by the dictionary *kwargs*.
es: Llama a un objeto de Python invocable *callable*, con argumentos dados por la tupla *args*, y argumentos con nombre dados por el diccionario *kwargs*.

source: *args* must not be *NULL*; use an empty tuple if no arguments are needed. If no named arguments are needed, *kwargs* can be *NULL*.
es: *args* no debe ser *NULL*; use una tupla vacía si no se necesitan argumentos. Si no se necesitan argumentos con nombre, *kwargs* puede ser *NULL*.

source: Return the result of the call on success, or raise an exception and return *NULL* on failure.
es: Retorna el resultado de la llamada en caso de éxito o lanza una excepción y retorna *NULL* en caso de error.

source: This is the equivalent of the Python expression: ``callable(*args, **kwargs)``.
es: Este es el equivalente de la expresión de Python: ``callable(*args, **kwargs)``.

source: Call a callable Python object *callable* without any arguments. It is the most efficient way to call a callable Python object without any argument.
es: Llama a un objeto de Python invocable *callable* sin ningún argumento. Es la forma más eficiente de llamar a un objeto Python invocable sin ningún argumento.

source: Call a callable Python object *callable* with exactly 1 positional argument *arg* and no keyword arguments.
es: Llama a un objeto de Python invocable *callable* con exactamente 1 argumento posicional *arg* y sin argumentos de palabra clave.

source: Call a callable Python object *callable*, with arguments given by the tuple *args*. If no arguments are needed, then *args* can be *NULL*.
es: Llama a un objeto de Python invocable *callable*, con argumentos dados por la tupla *args*. Si no se necesitan argumentos, entonces *args* puede ser *NULL*.

source: This is the equivalent of the Python expression: ``callable(*args)``.
es: Este es el equivalente de la expresión de Python: ``callable(*args)``.

source: Call a callable Python object *callable*, with a variable number of C arguments. The C arguments are described using a :c:func:`Py_BuildValue` style format string. The format can be *NULL*, indicating that no arguments are provided.
es: Llama a un objeto de Python invocable *callable*, con un número variable de argumentos C. Los argumentos de C se describen usando una cadena de caracteres de formato de estilo :c:func:`Py_BuildValue`. El formato puede ser *NULL*, lo que indica que no se proporcionan argumentos.

source: The type of *format* was changed from ``char *``.
es: El tipo de *format* se cambió desde ``char *``.

source: Call the method named *name* of object *obj* with a variable number of C arguments. The C arguments are described by a :c:func:`Py_BuildValue` format string that should produce a tuple.
es: Llama al método llamado *name* del objeto *obj* con un número variable de argumentos en C. Los argumentos de C se describen mediante una cadena de formato :c:func:`Py_BuildValue` que debería producir una tupla.

source: The format can be *NULL*, indicating that no arguments are provided.
es: El formato puede ser *NULL*, lo que indica que no se proporcionan argumentos.

source: This is the equivalent of the Python expression: ``obj.name(arg1, arg2, ...)``.
es: Este es el equivalente de la expresión de Python: ``obj.name(arg1, arg2, ...)``.

source: The types of *name* and *format* were changed from ``char *``.
es: Los tipos de *name* y *format* se cambiaron desde ``char *``.

source: This is the equivalent of the Python expression: ``callable(arg1, arg2, ...)``.
es: Este es el equivalente de la expresión de Python: ``callable(arg1, arg2, ...)``.

source: Call a method of the Python object *obj* without arguments, where the name of the method is given as a Python string object in *name*.
es: Llama a un método del objeto de Python *obj* sin argumentos, donde el nombre del método se da como un objeto de cadena de caracteres de Python en *name*.

source: Call a method of the Python object *obj* with a single positional argument *arg*, where the name of the method is given as a Python string object in *name*.
es: Llame a un método del objeto de Python *obj* con un único argumento posicional *arg*, donde el nombre del método se proporciona como un objeto de cadena de caracteres de Python en *name*.

source: Call a callable Python object *callable*. The arguments are the same as for :c:type:`vectorcallfunc`. If *callable* supports vectorcall_, this directly calls the vectorcall function stored in *callable*.
es: Llama a un objeto de Python invocable *callable*. Los argumentos son los mismos que para :c:type:`vectorcallfunc`. Si *callable* admite vectorcall_, esto llama directamente a la función vectorcall almacenada en *callable*.

source: Call *callable* with positional arguments passed exactly as in the vectorcall_ protocol, but with keyword arguments passed as a dictionary *kwdict*. The *args* array contains only the positional arguments.
es: Llamada *invocable* con argumentos posicionales pasados exactamente como en el protocolo vectorcall_, pero con argumentos de palabras clave pasados como un diccionario *kwdict*. El arreglo *args* contiene solo los argumentos posicionales.

source: Regardless of which protocol is used internally, a conversion of arguments needs to be done. Therefore, this function should only be used if the caller already has a dictionary ready to use for the keyword arguments, but not a tuple for the positional arguments.
es: Independientemente del protocolo que se utilice internamente, es necesario realizar una conversión de argumentos. Por lo tanto, esta función solo debe usarse si la persona que llama ya tiene un diccionario listo para usar para los argumentos de palabras clave, pero no una tupla para los argumentos posicionales.

source: Call Support API
es: API de soporte de llamadas

source: Determine if the object *o* is callable. Return ``1`` if the object is callable and ``0`` otherwise. This function always succeeds.
es: Determina si el objeto *o* es invocable. Retorna ``1`` si el objeto es invocable y ``0`` en caso contrario. Esta función siempre finaliza con éxito.
