Repository: python/python-docs-es
Catalog: c-api/concrete.po
Languages: es

source: Concrete Objects Layer
es: Capa de objetos concretos

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :c:func:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
es: Las funciones de este capítulo son específicas de ciertos tipos de objetos de Python. Pasarles un objeto del tipo incorrecto no es una buena idea; si recibe un objeto de un programa Python y no está seguro de que tenga el tipo correcto, primero debe realizar una verificación de tipo; por ejemplo, para verificar que un objeto es un diccionario, utilice :c:func:`PyDict_Check`. El capítulo está estructurado como el "árbol genealógico" de los tipos de objetos Python.

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for ``NULL`` being passed instead of a valid object. Allowing ``NULL`` to be passed in can cause memory access violations and immediate termination of the interpreter.
es: Si bien las funciones descritas en este capítulo verifican cuidadosamente el tipo de objetos que se pasan, muchos de ellos no verifican si se pasa ``NULL`` en lugar de un objeto válido. Permitir que se pase ``NULL`` puede causar violaciones de acceso a la memoria y la terminación inmediata del intérprete.

source: Fundamental Objects
es: Objetos fundamentales

source: This section describes Python type objects and the singleton object ``None``.
es: Esta sección describe los objetos de tipo Python y el objeto singleton ``None``.

source: Numeric Objects
es: Objetos numéricos

source: Sequence Objects
es: Objetos de secuencia

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
es: Las operaciones genéricas en los objetos de secuencia se discutieron en el capítulo anterior; Esta sección trata sobre los tipos específicos de objetos de secuencia que son intrínsecos al lenguaje Python.

source: Container Objects
es: Objetos contenedor

source: Function Objects
es: Objetos de función

source: Other Objects
es: Otros objetos
