Repository: python/python-docs-es
Catalog: c-api/dict.po
Languages: es

source: Dictionary Objects
es: Objetos Diccionarios

source: This subtype of :c:type:`PyObject` represents a Python dictionary object.
es: Este subtipo de :c:type:`PyObject` representa un objeto diccionario de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python dictionary type. This is the same object as :class:`dict` in the Python layer.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo diccionario de Python. Este es el mismo objeto que :class:`dict` en la capa de Python.

source: Return true if *p* is a dict object or an instance of a subtype of the dict type.
es: Retorna verdadero si *p* es un objeto ``dict`` o una instancia de un subtipo del tipo ``dict``.

source: Return true if *p* is a dict object, but not an instance of a subtype of the dict type.
es: Retorna verdadero si *p* es un objeto ``dict``, pero no una instancia de un subtipo del tipo ``dict``.

source: Return a new empty dictionary, or ``NULL`` on failure.
es: Retorna un nuevo diccionario vacío, o ``NULL`` en caso de falla.

source: Return a :class:`types.MappingProxyType` object for a mapping which enforces read-only behavior. This is normally used to create a view to prevent modification of the dictionary for non-dynamic class types.
es: Retorna un objeto a :class:`types.MappingProxyType` para una asignación que imponga un comportamiento de solo lectura. Esto normalmente se usa para crear una vista para evitar la modificación del diccionario para los tipos de clase no dinámicos.

source: Empty an existing dictionary of all key-value pairs.
es: Vacía un diccionario existente de todos los pares clave-valor (*key-value*).

source: Determine if dictionary *p* contains *key*. If an item in *p* is matches *key*, return ``1``, otherwise return ``0``. On error, return ``-1``. This is equivalent to the Python expression ``key in p``.
es: Determine si el diccionario *p* contiene *key*. Si un elemento en *p* coincide con la clave *key*, retorna ``1``; de lo contrario, retorna ``0``. En caso de error, retorna ``-1``. Esto es equivalente a la expresión de Python ``key in p``.

source: Return a new dictionary that contains the same key-value pairs as *p*.
es: Retorna un nuevo diccionario que contiene los mismos pares clave-valor (*key-value*) que *p*.

source: Insert *val* into the dictionary *p* with a key of *key*. *key* must be :term:`hashable`; if it isn't, :exc:`TypeError` will be raised. Return ``0`` on success or ``-1`` on failure. This function *does not* steal a reference to *val*.
es: Inserta *val* en el diccionario *p* con una clave *key*. *key* debe ser :term:`hashable`; si no lo es, se lanzará :exc:`TypeError`. Retorna ``0`` en caso de éxito o ``-1`` en caso de error. Esta función *no* roba una referencia a *val*.

source: Insert *val* into the dictionary *p* using *key* as a key. *key* should be a :c:type:`const char\*`. The key object is created using ``PyUnicode_FromString(key)``. Return ``0`` on success or ``-1`` on failure. This function *does not* steal a reference to *val*.
es: Inserta *val* en el diccionario *p* usando *key* como clave. *key* debe ser un :c:type:`const char\*`. El objeto clave se crea usando ``PyUnicode_FromString(key)``. Retorna ``0`` en caso de éxito o ``-1`` en caso de error. Esta función *no* roba una referencia a *val*.

source: Remove the entry in dictionary *p* with key *key*. *key* must be hashable; if it isn't, :exc:`TypeError` is raised. Return ``0`` on success or ``-1`` on failure.
es: Elimina la entrada en el diccionario *p* con la clave *key*. *key* debe ser *hashable*; si no lo está, :exc:`TypeError` se lanza. Retorna ``0`` en caso de éxito o ``-1`` en caso de error.

source: Remove the entry in dictionary *p* which has a key specified by the string *key*. Return ``0`` on success or ``-1`` on failure.
es: Elimina la entrada en el diccionario *p* que tiene una clave especificada por la cadena de caracteres *key*. Retorna ``0`` en caso de éxito o ``-1`` en caso de error.

source: Return the object from dictionary *p* which has a key *key*. Return ``NULL`` if the key *key* is not present, but *without* setting an exception.
es: Retorna el objeto del diccionario *p* que tiene una clave *key*. Retorna ``NULL`` si la clave *key* no está presente, pero *sin* lanzar una excepción.

source: Note that exceptions which occur while calling :meth:`__hash__` and :meth:`__eq__` methods will get suppressed. To get error reporting use :c:func:`PyDict_GetItemWithError()` instead.
es: Tenga en cuenta que las excepciones que se producen al llamar :meth:`__hash__` y :meth:`__eq__` se suprimirán los métodos. Para obtener informes de errores, utilice :c:func:`PyDict_GetItemWithError ()` en su lugar.

source: Variant of :c:func:`PyDict_GetItem` that does not suppress exceptions. Return ``NULL`` **with** an exception set if an exception occurred. Return ``NULL`` **without** an exception set if the key wasn't present.
es: Variante de :c:func:`PyDict_GetItem` que no suprime las excepciones. Retorna ``NULL`` **con** una excepción establecida si se produjo una excepción. Retorna ``NULL`` **sin** una excepción establecida si la clave no estaba presente.

source: This is the same as :c:func:`PyDict_GetItem`, but *key* is specified as a :c:type:`const char\*`, rather than a :c:type:`PyObject\*`.
es: Esto es lo mismo que :c:func:`PyDict_GetItem`, pero *key* se especifica como un :c:type:`const char\*`, en lugar de un :c:type:`PyObject\*`.

source: Note that exceptions which occur while calling :meth:`__hash__` and :meth:`__eq__` methods and creating a temporary string object will get suppressed. To get error reporting use :c:func:`PyDict_GetItemWithError()` instead.
es: Tenga en cuenta que las excepciones que se producen al llamar a :meth:`__hash__` y :meth:`__eq__` y al crear un objeto de cadena de caracteres temporal se suprimirán. Para obtener informes de errores, utilice :c:func:`PyDict_GetItemWithError()` en su lugar.

source: This is the same as the Python-level :meth:`dict.setdefault`. If present, it returns the value corresponding to *key* from the dictionary *p*. If the key is not in the dict, it is inserted with value *defaultobj* and *defaultobj* is returned. This function evaluates the hash function of *key* only once, instead of evaluating it independently for the lookup and the insertion.
es: Esto es lo mismo al nivel de Python :meth:`dict.setdefault`. Si está presente, retorna el valor correspondiente a *key* del diccionario *p*. Si la clave no está en el ``dict``, se inserta con el valor *defaultobj* y se retorna *defaultobj*. Esta función evalúa la función *hash* de *key* solo una vez, en lugar de evaluarla independientemente para la búsqueda y la inserción.

source: Return a :c:type:`PyListObject` containing all the items from the dictionary.
es: Retorna un :c:type:`PyListObject` que contiene todos los elementos del diccionario.

source: Return a :c:type:`PyListObject` containing all the keys from the dictionary.
es: Retorna un :c:type:`PyListObject` que contiene todas las claves del diccionario.

source: Return a :c:type:`PyListObject` containing all the values from the dictionary *p*.
es: Retorna un :c:type:`PyListObject` que contiene todos los valores del diccionario *p*.

source: Return the number of items in the dictionary. This is equivalent to ``len(p)`` on a dictionary.
es: Retorna el número de elementos en el diccionario. Esto es equivalente a ``len(p)`` en un diccionario.

source: Iterate over all key-value pairs in the dictionary *p*. The :c:type:`Py_ssize_t` referred to by *ppos* must be initialized to ``0`` prior to the first call to this function to start the iteration; the function returns true for each pair in the dictionary, and false once all pairs have been reported. The parameters *pkey* and *pvalue* should either point to :c:type:`PyObject\*` variables that will be filled in with each key and value, respectively, or may be ``NULL``. Any references returned through them are borrowed. *ppos* should not be altered during iteration. Its value represents offsets within the internal dictionary structure, and since the structure is sparse, the offsets are not consecutive.
es: Itera sobre todos los pares clave-valor en el diccionario *p*. El :c:type:`Py_ssize_t` al que se refiere *ppos* debe inicializarse a ``0`` antes de la primera llamada a esta función para iniciar la iteración; la función retorna verdadero para cada par en el diccionario y falso una vez que todos los pares han sido reportados. Los parámetros *pkey* y *pvalue* deben apuntar a :c:type:`PyObject\*` variables que se completarán con cada clave y valor, respectivamente, o pueden ser ``NULL``. Cualquier referencia retornada a través de ellos es prestada. *ppos* no debe modificarse durante la iteración. Su valor representa desplazamientos dentro de la estructura interna del diccionario, y dado que la estructura es escasa, los desplazamientos no son consecutivos.

source: For example::
es: Por ejemplo::

source: The dictionary *p* should not be mutated during iteration. It is safe to modify the values of the keys as you iterate over the dictionary, but only so long as the set of keys does not change. For example::
es: El diccionario *p* no debe mutarse durante la iteración. Es seguro modificar los valores de las claves a medida que recorre el diccionario, pero solo mientras el conjunto de claves no cambie. Por ejemplo::

source: Iterate over mapping object *b* adding key-value pairs to dictionary *a*. *b* may be a dictionary, or any object supporting :c:func:`PyMapping_Keys` and :c:func:`PyObject_GetItem`. If *override* is true, existing pairs in *a* will be replaced if a matching key is found in *b*, otherwise pairs will only be added if there is not a matching key in *a*. Return ``0`` on success or ``-1`` if an exception was raised.
es: Itera sobre el objeto de mapeo *b* agregando pares clave-valor al diccionario *a*. *b* puede ser un diccionario o cualquier objeto que soporte :c:func:`PyMapping_Keys` y :c:func:`PyObject_GetItem`. Si *override* es verdadero, los pares existentes en *a* se reemplazarán si se encuentra una clave coincidente en *b*, de lo contrario, los pares solo se agregarán si no hay una clave coincidente en *a*. Retorna ``0`` en caso de éxito o ``-1`` si se lanza una excepción.

source: This is the same as ``PyDict_Merge(a, b, 1)`` in C, and is similar to ``a.update(b)`` in Python except that :c:func:`PyDict_Update` doesn't fall back to the iterating over a sequence of key value pairs if the second argument has no "keys" attribute. Return ``0`` on success or ``-1`` if an exception was raised.
es: Esto es lo mismo que ``PyDict_Merge(a, b, 1)`` en C, y es similar a ``a.update(b)`` en Python excepto que :c:func:`PyDict_Update` no vuelve a la iteración sobre una secuencia de pares de valores clave si el segundo argumento no tiene el atributo "claves". Retorna ``0`` en caso de éxito o ``-1`` si se produjo una excepción.

source: Update or merge into dictionary *a*, from the key-value pairs in *seq2*. *seq2* must be an iterable object producing iterable objects of length 2, viewed as key-value pairs. In case of duplicate keys, the last wins if *override* is true, else the first wins. Return ``0`` on success or ``-1`` if an exception was raised. Equivalent Python (except for the return value)::
es: Actualiza o combina en el diccionario *a*, desde los pares clave-valor en *seq2*. *seq2* debe ser un objeto iterable que produzca objetos iterables de longitud 2, vistos como pares clave-valor. En el caso de claves duplicadas, el último gana si *override* es verdadero, de lo contrario, el primero gana. Retorna ``0`` en caso de éxito o ``-1`` si se produjo una excepción. El equivalente en Python (excepto el valor de retorno) ::

source: Clear the free list. Return the total number of freed items.
es: Borra la lista libre. Retorna el número total de artículos liberados.
