Repository: python/python-docs-es
Catalog: c-api/file.po
Languages: es

source: File Objects
es: Objetos archivo

source: Create a Python file object from the file descriptor of an already opened file *fd*. The arguments *name*, *encoding*, *errors* and *newline* can be ``NULL`` to use the defaults; *buffering* can be *-1* to use the default. *name* is ignored and kept for backward compatibility. Return ``NULL`` on failure. For a more comprehensive description of the arguments, please refer to the :func:`io.open` function documentation.
es: Crea un objeto archivo Python a partir del descriptor de archivo de un archivo ya abierto *fd*. Los argumentos *name*, *encoding*, *errors* y *newline* pueden ser ``NULL`` para usar los valores predeterminados; *buffering* puede ser *-1* para usar el valor predeterminado. *name* se ignora y se mantiene por compatibilidad con versiones anteriores. Retorna ``NULL`` en caso de error. Para obtener una descripción más completa de los argumentos, consulte la documentación de la función :func:`io.open`.

source: Since Python streams have their own buffering layer, mixing them with OS-level file descriptors can produce various issues (such as unexpected ordering of data).
es: Dado que las transmisiones (*streams*) de Python tienen su propia capa de almacenamiento en búfer, combinarlas con descriptores de archivos a nivel del sistema operativo puede producir varios problemas (como un pedido inesperado de datos).

source: Ignore *name* attribute.
es: Ignora el atributo *name*.

source: Equivalent to ``p.readline([n])``, this function reads one line from the object *p*. *p* may be a file object or any object with a :meth:`~io.IOBase.readline` method. If *n* is ``0``, exactly one line is read, regardless of the length of the line. If *n* is greater than ``0``, no more than *n* bytes will be read from the file; a partial line can be returned. In both cases, an empty string is returned if the end of the file is reached immediately. If *n* is less than ``0``, however, one line is read regardless of length, but :exc:`EOFError` is raised if the end of the file is reached immediately.
es: Equivalente a ``p.readline([n])``, esta función lee una línea del objeto *p*. *p* puede ser un objeto archivo o cualquier objeto con un método :meth:`~io.IOBase.readline`. Si *n* es ``0``, se lee exactamente una línea, independientemente de la longitud de la línea. Si *n* es mayor que ``0``, no se leerán más de *n* bytes del archivo; se puede retornar una línea parcial. En ambos casos, se retorna una cadena de caracteres vacía si se llega al final del archivo de inmediato. Si *n* es menor que ``0``, sin embargo, se lee una línea independientemente de la longitud, pero :exc:`EOFError` se lanza si se llega al final del archivo de inmediato.

source: Overrides the normal behavior of :func:`io.open_code` to pass its parameter through the provided handler.
es: Sobrescribe el comportamiento normal de :func:`io.open_code` para pasar su parámetro a través del controlador proporcionado.

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
es: El puntero *userData* se pasa a la función de enlace. Dado que las funciones de enlace pueden llamarse desde diferentes tiempos de ejecución, este puntero no debe referirse directamente al estado de Python.

source: As this hook is intentionally used during import, avoid importing new modules during its execution unless they are known to be frozen or available in ``sys.modules``.
es: Como este *hook* se usa intencionalmente durante la importación, evite importar nuevos módulos durante su ejecución a menos que se sepa que están congelados o disponibles en ``sys.modules``.

source: Once a hook has been set, it cannot be removed or replaced, and later calls to :c:func:`PyFile_SetOpenCodeHook` will fail. On failure, the function returns -1 and sets an exception if the interpreter has been initialized.
es: Una vez que se ha establecido un *hook*, no se puede quitar ni reemplazar, y luego llamadas a :c:func:`PyFile_SetOpenCodeHook` fallarán. En caso de error, la función retorna -1 y establece una excepción si el intérprete se ha inicializado.

source: This function is safe to call before :c:func:`Py_Initialize`.
es: Es seguro llamar a esta función antes de :c:func:`Py_Initialize`.

source: Raises an :ref:`auditing event <auditing>` ``setopencodehook`` with no arguments.
es: Genera un :ref:`evento de auditoría <auditing>` ``setopencodehook`` sin argumentos.

source: Write string *s* to file object *p*. Return ``0`` on success or ``-1`` on failure; the appropriate exception will be set.
es: Escribe la cadena *s* en el objeto archivo *p*. Retorna ``0`` en caso de éxito o ``-1`` en caso de error; se establecerá la excepción apropiada.
