Repository: python/python-docs-es
Catalog: c-api/float.po
Languages: es

source: Floating Point Objects
es: Objetos de punto flotante

source: This subtype of :c:type:`PyObject` represents a Python floating point object.
es: Este subtipo de :c:type:`PyObject` representa un objeto de punto flotante de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python floating point type. This is the same object as :class:`float` in the Python layer.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de punto flotante de Python. Este es el mismo objeto que :class:`float` en la capa de Python.

source: Return true if its argument is a :c:type:`PyFloatObject` or a subtype of :c:type:`PyFloatObject`. This function always succeeds.
es: Retorna verdadero si su argumento es un :c:type:`PyFloatObject` o un subtipo de :c:type:`PyFloatObject`. Esta función siempre finaliza con éxito.

source: Return true if its argument is a :c:type:`PyFloatObject`, but not a subtype of :c:type:`PyFloatObject`. This function always succeeds.
es: Retorna verdadero si su argumento es un :c:type:`PyFloatObject`, pero no un subtipo de :c:type:`PyFloatObject`. Esta función siempre finaliza con éxito.

source: Create a :c:type:`PyFloatObject` object based on the string value in *str*, or ``NULL`` on failure.
es: Crea un objeto :c:type:`PyFloatObject` basado en la cadena de caracteres en *str*, o ``NULL`` en caso de error.

source: Create a :c:type:`PyFloatObject` object from *v*, or ``NULL`` on failure.
es: Crea un objeto :c:type:`PyFloatObject` a partir de *v*, o ``NULL`` en caso de error.

source: Return a C :c:expr:`double` representation of the contents of *pyfloat*. If *pyfloat* is not a Python floating point object but has a :meth:`__float__` method, this method will first be called to convert *pyfloat* into a float. If ``__float__()`` is not defined then it falls back to :meth:`__index__`. This method returns ``-1.0`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
es: Retorna una representación de una estructura C :c:type:`double` de los contenidos de *pyfloat*. Si *pyfloat* no es un objeto de punto flotante de Python pero tiene un método :meth:`__float__`, primero se llamará a este método para convertir *pyfloat* en un flotante. Si ``__float __()`` no está definido, entonces recurre a :meth:`__index__`. Este método retorna ``-1.0`` en caso de falla, por lo que se debe llamar a :c:func:`PyErr_Occurred` para verificar si hay errores.

source: Use :meth:`__index__` if available.
es: Utilice :meth:`__index__` si está disponible.

source: Return a C :c:expr:`double` representation of the contents of *pyfloat*, but without error checking.
es: Retorna una representación C :c:type:`double` de los contenidos de *pyfloat*, pero sin verificación de errores.

source: Return a structseq instance which contains information about the precision, minimum and maximum values of a float. It's a thin wrapper around the header file :file:`float.h`.
es: Retorna una instancia de *structseq* que contiene información sobre la precisión, los valores mínimos y máximos de un flotante. Es un contenedor reducido alrededor del archivo de encabezado :file:`float.h`.

source: Return the maximum representable finite float *DBL_MAX* as C :c:expr:`double`.
es: Retorna el máximo flotante finito representable *DBL_MAX* como C :c:type:`double`.

source: Return the minimum normalized positive float *DBL_MIN* as C :c:expr:`double`.
es: Retorna el flotante positivo normalizado mínimo *DBL_MIN* como C :c:type:`double`.

source: Pack and Unpack functions
es: Funciones de Empaquetado y Desempaquetado

source: The pack and unpack functions provide an efficient platform-independent way to store floating-point values as byte strings. The Pack routines produce a bytes string from a C :c:expr:`double`, and the Unpack routines produce a C :c:expr:`double` from such a bytes string. The suffix (2, 4 or 8) specifies the number of bytes in the bytes string.
es: Las funciones empaquetar y desempaquetar proporcionan una forma eficiente e independiente de la plataforma para almacenar valores de coma flotante como cadenas de bytes. Las rutinas de empaquetar producen una cadena de bytes a partir de una cadena de bytes de C:c:expr:'double', y las de desempaquetar producen una cadena de bytes de C:c:expr:'double' a partir de dicha cadena de bytes. El sufijo (2, 4 o 8) especifica el número de bytes de la cadena de bytes.

source: On platforms that appear to use IEEE 754 formats these functions work by copying bits. On other platforms, the 2-byte format is identical to the IEEE 754 binary16 half-precision format, the 4-byte format (32-bit) is identical to the IEEE 754 binary32 single precision format, and the 8-byte format to the IEEE 754 binary64 double precision format, although the packing of INFs and NaNs (if such things exist on the platform) isn't handled correctly, and attempting to unpack a bytes string containing an IEEE INF or NaN will raise an exception.
es: En plataformas que parecen usar formatos IEEE 754, estas funciones actuan copiando los bits. En otras plataformas, el formato 2-byte es idéntico al formato de media precision IEEE 754 binary16, el formato de 4-byte (32 bits) es idéntico al formato de precisión simple binario IEEE 754 binary32, y el formato de 8-byte al formato de doble precisión binario IEEE 754 binary64, aunque el empaquetado de INFs y NaNs (si existen en la plataforma) no se maneja correctamente, mientras que intentar desempaquetar una cadena de bytes que contenga un IEEE INF o NaN generará una excepción.

source: On non-IEEE platforms with more precision, or larger dynamic range, than IEEE 754 supports, not all values can be packed; on non-IEEE platforms with less precision, or smaller dynamic range, not all values can be unpacked. What happens in such cases is partly accidental (alas).
es: En plataformas que no son IEEE con más precisión, o mayor rango dinámico, que el IEEE 754 admite, no se pueden empaquetar todos los valores; en plataformas que no son IEEE con menos precisión o con un rango dinámico más pequeño, no se pueden desempaquetar todos los valores. Lo que sucede en tales casos es en parte accidental (desafortunadamente).

source: Pack functions
es: Funciones de Empaquetado

source: The pack routines write 2, 4 or 8 bytes, starting at *p*. *le* is an :c:expr:`int` argument, non-zero if you want the bytes string in little-endian format (exponent last, at ``p+1``, ``p+3``, or ``p+6`` ``p+7``), zero if you want big-endian format (exponent first, at *p*). The :c:data:`PY_BIG_ENDIAN` constant can be used to use the native endian: it is equal to ``1`` on big endian processor, or ``0`` on little endian processor.
es: Las rutinas de empaquedato escriben 2, 4 o 8 bytes, comenzando en *p*. *le* es un argumento :c:expr:`int`, distinto de cero si desea la cadena bytes con criterio little-endian (exponente al final, en ``p+1``, ``p+3``, or ``p+6`` ``p+7``), cero si se necesita el criterio big-endian (exponente primero, en *p*). La constante :c:data:`PY_BIG_ENDIAN` se puede usar para usar el endian nativo: es igual a ``1`` en el procesador big endian, o ``0`` en el procesador little endian.

source: Return value: ``0`` if all is OK, ``-1`` if error (and an exception is set, most likely :exc:`OverflowError`).
es: Valor devuelto: ``0`` si todo está bien, ``-1`` si hay error (y se establece una excepción, probablemente :exc:`OverflowError`).

source: There are two problems on non-IEEE platforms:
es: Hay dos problemas en plataformas que no son IEEE:

source: What this does is undefined if *x* is a NaN or infinity.
es: Lo que esto hace es indefinido si *x* es un NaN o infinito.

source: ``-0.0`` and ``+0.0`` produce the same bytes string.
es: ``-0.0`` and ``+0.0`` produce la misma cadena de bytes.

source: Pack a C double as the IEEE 754 binary16 half-precision format.
es: Empaqueta una estructura C:c:expr:'double' como el formato de media precision IEEE 754 binario16.

source: Pack a C double as the IEEE 754 binary32 single precision format.
es: Empaqueta una estructura C:c:expr:'double' como el formato de precisión única IEEE 754 binario32.

source: Pack a C double as the IEEE 754 binary64 double precision format.
es: Empaqueta una estructure C:c:expr:'double' como el formato de doble precision IEEE 754 binario64.

source: Unpack functions
es: Funciones de Desempaquetado

source: The unpack routines read 2, 4 or 8 bytes, starting at *p*. *le* is an :c:expr:`int` argument, non-zero if the bytes string is in little-endian format (exponent last, at ``p+1``, ``p+3`` or ``p+6`` and ``p+7``), zero if big-endian (exponent first, at *p*). The :c:data:`PY_BIG_ENDIAN` constant can be used to use the native endian: it is equal to ``1`` on big endian processor, or ``0`` on little endian processor.
es: Las rutinas de desempaquetado leen 2, 4 o 8 bytes, comenzando en *p*. *le* es un argumento :c:expr:`int` , distinto de cero si la cadena bytes usa el criterio little-endian (exponente al final, en ``p+1``, ``p+3`` or ``p+6`` and ``p+7``), cero si usa el criterio big-endian (exponente primero, en *p*). La constante :c:data:`PY_BIG_ENDIAN` se puede usar para usar el endian: es igual a `1`` en el procesador big endian, o ``0`` en el procesador little endian.

source: Return value: The unpacked double. On error, this is ``-1.0`` and :c:func:`PyErr_Occurred` is true (and an exception is set, most likely :exc:`OverflowError`).
es: Valor devuelto: Doble desempaquedado. Si hay error, ``-1.0`` y :c:func:`PyErr_Occurred` es verdadero (y se establece una excepción, probablemente :exc:`OverflowError`).

source: Note that on a non-IEEE platform this will refuse to unpack a bytes string that represents a NaN or infinity.
es: Hay que tener en cuenta que en una plataforma que no sea IEEE, esto se negará el desempaquetado de una cadena de bytes que representa un NaN o infinito.

source: Unpack the IEEE 754 binary16 half-precision format as a C double.
es: Desempaqueta el formato de media precisión IEEE 754 binario16 como C:c:expr:'double'.

source: Unpack the IEEE 754 binary32 single precision format as a C double.
es: Desempaqueta el formato de precisión única IEEE 754 binario32 como C:c:expr:'double'.

source: Unpack the IEEE 754 binary64 double precision format as a C double.
es: Desempaqueta el formato de doble precisión IEEE 754 binario64 como C:c:expr:'double'.
