Repository: python/python-docs-es
Catalog: c-api/frame.po
Languages: es

source: Frame Objects
es: Objetos frame

source: The C structure of the objects used to describe frame objects.
es: La estructura C de los objetos utilizados para describir los objetos del frame.

source: There are no public members in this structure.
es: No hay miembros públicos en esta estructura.

source: The members of this structure were removed from the public C API. Refer to the :ref:`What's New entry <pyframeobject-3.11-hiding>` for details.
es: Los miembros de esta estructura se han eliminado de la API pública de C. Consulte la entrada :ref:`Novedades <pyframeobject-3.11-hiding>` para más detalles.

source: The :c:func:`PyEval_GetFrame` and :c:func:`PyThreadState_GetFrame` functions can be used to get a frame object.
es: Las funciones :c:func:`PyEval_GetFrame` y :c:func:`PyThreadState_GetFrame` pueden utilizarse para obtener un objeto frame.

source: See also :ref:`Reflection <reflection>`.
es: Véase también :ref:`Reflexión <reflection>`.

source: Get the *frame* next outer frame.
es: Obtiene el *frame* exterior siguiente.

source: Return a :term:`strong reference`, or ``NULL`` if *frame* has no outer frame.
es: Retorna una :term:`strong reference`, o ``NULL`` si *frame* no tiene frame exterior.

source: Get the *frame*'s ``f_builtins`` attribute.
es: Obtiene el atributo ``f_builtins`` del *frame*.

source: Return a :term:`strong reference`. The result cannot be ``NULL``.
es: Retorna una :term:`strong reference`, o ``NULL`` si *frame* no tiene frame exterior.

source: Get the *frame* code.
es: Obtenga el código *frame*.

source: Return a :term:`strong reference`.
es: Retorna un :term:`strong reference`.

source: The result (frame code) cannot be ``NULL``.
es: El resultado (frame code) no puede ser ``NULL``.

source: Get the generator, coroutine, or async generator that owns this frame, or ``NULL`` if this frame is not owned by a generator. Does not raise an exception, even if the return value is ``NULL``.
es: Obtiene el generador, rutina o generador asíncrono al que pertenece este frame, o ``NULL`` si este frame no es propiedad de un generador. No lanza una excepción, incluso si el valor de retorno es ``NULL``.

source: Return a :term:`strong reference`, or ``NULL``.
es: Retorna un :term:`strong reference`, o ``NULL``.

source: Get the *frame*'s ``f_globals`` attribute.
es: Obtiene el atributo ``f_globals`` del *frame*.

source: Get the *frame*'s ``f_lasti`` attribute.
es: Obtiene el atributo ``f_lasti`` del *frame*.

source: Returns -1 if ``frame.f_lasti`` is ``None``.
es: Retorna -1 si ``frame.f_lasti`` es ``None``.

source: Get the *frame*'s ``f_locals`` attribute (:class:`dict`).
es: Obtiene el atributo ``f_locals`` del *frame* (:class:`dict`).

source: Return the line number that *frame* is currently executing.
es: Retorna el número de línea en la que se está ejecutando el *frame*.
