Repository: python/python-docs-es
Catalog: c-api/import.po
Languages: es

source: Importing Modules
es: Importando módulos

source: This is a simplified interface to :c:func:`PyImport_ImportModuleEx` below, leaving the *globals* and *locals* arguments set to ``NULL`` and *level* set to 0. When the *name* argument contains a dot (when it specifies a submodule of a package), the *fromlist* argument is set to the list ``['*']`` so that the return value is the named module rather than the top-level package containing it as would otherwise be the case. (Unfortunately, this has an additional side effect when *name* in fact specifies a subpackage instead of a submodule: the submodules specified in the package's ``__all__`` variable are loaded.) Return a new reference to the imported module, or ``NULL`` with an exception set on failure. A failing import of a module doesn't leave the module in :data:`sys.modules`.
es: Esta es una interfaz simplificada para :c:func:`PyImport_ImportModuleEx` a continuación, dejando los argumentos *globals* y *locals* establecidos en ``NULL`` y *level* establecidos en 0. Cuando el argumento *name* contiene un punto (cuando especifica un submódulo de un paquete), el argumento *fromlist* se establece en la lista ``['*']`` para que el valor de retorno sea el módulo con nombre en lugar del paquete de nivel superior que lo contiene como lo haría de lo contrario sea el caso. (Desafortunadamente, esto tiene un efecto secundario adicional cuando *name* de hecho especifica un subpaquete en lugar de un submódulo: los submódulos especificados en la variable ``__all__`` del paquete están cargados). Retorna una nueva referencia al módulo importado, o ``NULL`` con una excepción establecida en caso de error. Una importación fallida de un módulo no deja el módulo en :data:`sys.modules`.

source: This function always uses absolute imports.
es: Esta función siempre usa importaciones absolutas.

source: This function is a deprecated alias of :c:func:`PyImport_ImportModule`.
es: Esta función es un alias obsoleto de :c:func:`PyImport_ImportModule`.

source: This function used to fail immediately when the import lock was held by another thread. In Python 3.3 though, the locking scheme switched to per-module locks for most purposes, so this function's special behaviour isn't needed anymore.
es: Esta función solía fallar inmediatamente cuando el bloqueo de importación era retenido por otro hilo. Sin embargo, en Python 3.3, el esquema de bloqueo cambió a bloqueos por módulo para la mayoría de los propósitos, por lo que el comportamiento especial de esta función ya no es necesario.

source: Import a module. This is best described by referring to the built-in Python function :func:`__import__`.
es: Importa un módulo. Esto se describe mejor haciendo referencia a la función Python incorporada :func:`__import__`.

source: The return value is a new reference to the imported module or top-level package, or ``NULL`` with an exception set on failure. Like for :func:`__import__`, the return value when a submodule of a package was requested is normally the top-level package, unless a non-empty *fromlist* was given.
es: El valor de retorno es una nueva referencia al módulo importado o paquete de nivel superior, o ``NULL`` con una excepción establecida en caso de error. Al igual que para :func:`__import__`, el valor de retorno cuando se solicitó un submódulo de un paquete normalmente es el paquete de nivel superior, a menos que se proporcione un *fromlist* no vacío.

source: Failing imports remove incomplete module objects, like with :c:func:`PyImport_ImportModule`.
es: Las importaciones que fallan eliminan objetos de módulo incompletos, como con :c:func:`PyImport_ImportModule`.

source: Import a module. This is best described by referring to the built-in Python function :func:`__import__`, as the standard :func:`__import__` function calls this function directly.
es: Importa un módulo. Esto se describe mejor haciendo referencia a la función Python incorporada :func:`__import__`, ya que la función estándar :func:`__import__` llama a esta función directamente.

source: Similar to :c:func:`PyImport_ImportModuleLevelObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
es: Similar a :c:func:`PyImport_ImportModuleLevelObject`, pero el nombre es una cadena de caracteres codificada UTF-8 en lugar de un objeto Unicode.

source: Negative values for *level* are no longer accepted.
es: Los valores negativos para *level* ya no se aceptan.

source: This is a higher-level interface that calls the current "import hook function" (with an explicit *level* of 0, meaning absolute import). It invokes the :func:`__import__` function from the ``__builtins__`` of the current globals. This means that the import is done using whatever import hooks are installed in the current environment.
es: Esta es una interfaz de nivel superior que llama a la "función de enlace de importación" actual (con un nivel explícito de 0, que significa importación absoluta). Invoca la función :func:`__import__` de las ``__builtins__`` de los globales (*globals*) actuales. Esto significa que la importación se realiza utilizando los ganchos de importación instalados en el entorno actual.

source: Reload a module. Return a new reference to the reloaded module, or ``NULL`` with an exception set on failure (the module still exists in this case).
es: Recarga un módulo. Retorna una nueva referencia al módulo recargado, o ``NULL`` con una excepción establecida en caso de error (el módulo todavía existe en este caso).

source: Return the module object corresponding to a module name. The *name* argument may be of the form ``package.module``. First check the modules dictionary if there's one there, and if not, create a new one and insert it in the modules dictionary. Return ``NULL`` with an exception set on failure.
es: Retorna el objeto módulo correspondiente a un nombre de módulo. El argumento *name* puede tener la forma ``package.module``. Primero revise el diccionario de módulos si hay uno allí, y si no, crea uno nuevo y lo agrega al diccionario de módulos. Retorna ``NULL`` con una excepción establecida en caso de error.

source: This function does not load or import the module; if the module wasn't already loaded, you will get an empty module object. Use :c:func:`PyImport_ImportModule` or one of its variants to import a module. Package structures implied by a dotted name for *name* are not created if not already present.
es: Esta función no carga ni importa el módulo; si el módulo no estaba cargado, obtendrá un objeto de módulo vacío. Utilice :c:func:`PyImport_ImportModule` o una de sus variantes para importar un módulo. Las estructuras de paquete implicadas por un nombre punteado para *name* no se crean si aún no están presentes.

source: Similar to :c:func:`PyImport_AddModuleObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
es: Similar a :c:func:`PyImport_AddModuleObject`, pero el nombre es una cadena de caracteres codificada UTF-8 en lugar de un objeto Unicode.

source: This function will reload the module if it was already imported. See :c:func:`PyImport_ReloadModule` for the intended way to reload a module.
es: Esta función volverá a cargar el módulo si ya se importó. Consulte :c:func:`PyImport_ReloadModule` para conocer la forma prevista de volver a cargar un módulo.

source: If *name* points to a dotted name of the form ``package.module``, any package structures not already created will still not be created.
es: Si *name* apunta a un nombre punteado de la forma ``package.module``, cualquier estructura de paquete que no se haya creado aún no se creará.

source: See also :c:func:`PyImport_ExecCodeModuleEx` and :c:func:`PyImport_ExecCodeModuleWithPathnames`.
es: Ver también :c:func:`PyImport_ExecCodeModuleEx` y :c:func:`PyImport_ExecCodeModuleWithPathnames`.

source: Like :c:func:`PyImport_ExecCodeModule`, but the :attr:`__file__` attribute of the module object is set to *pathname* if it is non-``NULL``.
es: Como :c:func:`PyImport_ExecCodeModule`, pero el atributo :attr:`__file__` del objeto del módulo se establece en *pathname* si no es ``NULL``.

source: See also :c:func:`PyImport_ExecCodeModuleWithPathnames`.
es: Ver también :c:func:`PyImport_ExecCodeModuleWithPathnames`.

source: Like :c:func:`PyImport_ExecCodeModuleEx`, but the :attr:`__cached__` attribute of the module object is set to *cpathname* if it is non-``NULL``. Of the three functions, this is the preferred one to use.
es: Como :c:func:`PyImport_ExecCodeModuleEx`, pero el atributo :attr:`__cached__` del objeto módulo se establece en *cpathname* si no es ``NULL``. De las tres funciones, esta es la recomendada para usar.

source: Like :c:func:`PyImport_ExecCodeModuleObject`, but *name*, *pathname* and *cpathname* are UTF-8 encoded strings. Attempts are also made to figure out what the value for *pathname* should be from *cpathname* if the former is set to ``NULL``.
es: Como :c:func:`PyImport_ExecCodeModuleObject`, pero *name*, *pathname* y *cpathname* son cadenas de caracteres codificadas UTF-8. También se intenta averiguar cuál debe ser el valor de *pathname* de *cpathname* si el primero se establece en ``NULL``.

source: Return the magic number for Python bytecode files (a.k.a. :file:`.pyc` file). The magic number should be present in the first four bytes of the bytecode file, in little-endian byte order. Returns ``-1`` on error.
es: Retorna el número mágico para los archivos de *bytecode* de Python (también conocido como archivos :file:`.pyc`). El número mágico debe estar presente en los primeros cuatro bytes del archivo de código de bytes, en orden de bytes *little-endian*. Retorna ``-1`` en caso de error.

source: Return value of ``-1`` upon failure.
es: Retorna un valor de ``-1`` en caso de error.

source: Return the magic tag string for :pep:`3147` format Python bytecode file names. Keep in mind that the value at ``sys.implementation.cache_tag`` is authoritative and should be used instead of this function.
es: Retorna la cadena de caracteres de etiqueta mágica para nombres de archivo de código de bytes Python en formato :pep:`3147`. Tenga en cuenta que el valor en ``sys.implementation.cache_tag`` es autoritario y debe usarse en lugar de esta función.

source: Return the dictionary used for the module administration (a.k.a. ``sys.modules``). Note that this is a per-interpreter variable.
es: Retorna el diccionario utilizado para la administración del módulo (también conocido como ``sys.modules``). Tenga en cuenta que esta es una variable por intérprete.

source: Return the already imported module with the given name. If the module has not been imported yet then returns ``NULL`` but does not set an error. Returns ``NULL`` and sets an error if the lookup failed.
es: Retorna el módulo ya importado con el nombre dado. Si el módulo aún no se ha importado, retorna ``NULL`` pero no establece un error. Retorna ``NULL`` y establece un error si falla la búsqueda.

source: Load a frozen module named *name*. Return ``1`` for success, ``0`` if the module is not found, and ``-1`` with an exception set if the initialization failed. To access the imported module on a successful load, use :c:func:`PyImport_ImportModule`. (Note the misnomer --- this function would reload the module if it was already imported.)
es: Carga un módulo congelado llamado *name*. Retorna ``1`` para el éxito, ``0`` si no se encuentra el módulo y ``-1`` con una excepción establecida si falla la inicialización. Para acceder al módulo importado con una carga exitosa, use :c:func:`PyImport_ImportModule`. (Tenga en cuenta el nombre inapropiado --- esta función volvería a cargar el módulo si ya se importó).

source: The ``__file__`` attribute is no longer set on the module.
es: El atributo ``__file__`` ya no está establecido en el módulo.

source: Similar to :c:func:`PyImport_ImportFrozenModuleObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
es: Similar a :c:func:`PyImport_ImportFrozenModuleObject`, pero el nombre es una cadena de caracteres codificada UTF-8 en lugar de un objeto Unicode.

source: This is the structure type definition for frozen module descriptors, as generated by the :program:`freeze` utility (see :file:`Tools/freeze/` in the Python source distribution). Its definition, found in :file:`Include/import.h`, is::
es: Esta es la definición del tipo de estructura para los descriptores de módulos congelados, según lo generado con la herramienta :program:`freeze` (ver :file:`Tools/freeze` en la distribución de código fuente de Python). Su definición, que se encuentra en :file:`Include/import.h`, es::

source: The new ``is_package`` field indicates whether the module is a package or not. This replaces setting the ``size`` field to a negative value.
es: El nuevo campo ``is_package`` indica si el módulo es un paquete o no. Esto sustituye a la configuración del campo ``size`` con un valor negativo.

source: This pointer is initialized to point to an array of :c:struct:`_frozen` records, terminated by one whose members are all ``NULL`` or zero. When a frozen module is imported, it is searched in this table. Third-party code could play tricks with this to provide a dynamically created collection of frozen modules.
es: Este puntero se inicializa para apuntar a un arreglo de registros :c:struct:`_frozen`, terminado por uno cuyos registros son todos ``NULL`` o cero. Cuando se importa un módulo congelado, se busca en esta tabla. El código de terceros podría jugar con esto para proporcionar una colección de módulos congelados creada dinámicamente.

source: Add a single module to the existing table of built-in modules. This is a convenience wrapper around :c:func:`PyImport_ExtendInittab`, returning ``-1`` if the table could not be extended. The new module can be imported by the name *name*, and uses the function *initfunc* as the initialization function called on the first attempted import. This should be called before :c:func:`Py_Initialize`.
es: Agrega un solo módulo a la tabla existente de módulos incorporados. Este es un contenedor conveniente :c:func:`PyImport_ExtendInittab`, que retorna ``-1`` si la tabla no se puede extender. El nuevo módulo se puede importar con el nombre *name*, y utiliza la función *initfunc* como la función de inicialización llamada en el primer intento de importación. Esto debería llamarse antes de :c:func:`Py_Initialize`.

source: If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
es: Si Python es inicializado múltiples veces, se debe llamar :c:func:`PyImport_AppendInittab` o :c:func:`PyImport_ExtendInittab` antes de cada inicialización de Python.
