Repository: python/python-docs-es
Catalog: c-api/init_config.po
Languages: es

source: Python Initialization Configuration
es: Configuración de inicialización de Python

source: Python can be initialized with :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure. It can be preinitialized with :c:func:`Py_PreInitialize` and the :c:type:`PyPreConfig` structure.
es: Python se puede inicializar con :c:func:`Py_InitializeFromConfig` y la estructura :c:type:`PyConfig`. Se puede preinicializar con :c:func:`Py_PreInitialize` y la estructura :c:type:`PyPreConfig`.

source: There are two kinds of configuration:
es: Hay dos tipos de configuración:

source: The :ref:`Python Configuration <init-python-config>` can be used to build a customized Python which behaves as the regular Python. For example, environments variables and command line arguments are used to configure Python.
es: El :ref:`Python Configuration <init-python-config>` se puede utilizar para crear un Python personalizado que se comporte como el Python normal. Por ejemplo, las variables de entorno y los argumentos de la línea de comandos se utilizan para configurar Python.

source: The :ref:`Isolated Configuration <init-isolated-conf>` can be used to embed Python into an application. It isolates Python from the system. For example, environments variables are ignored, the LC_CTYPE locale is left unchanged and no signal handler is registered.
es: El :ref:`Isolated Configuration <init-isolated-conf>` se puede utilizar para incrustar Python en una aplicación. Aísla a Python del sistema. Por ejemplo, las variables de entorno se ignoran, la configuración regional LC_CTYPE se deja sin cambios y no se registra ningún manejador de señales.

source: The :c:func:`Py_RunMain` function can be used to write a customized Python program.
es: La función :c:func:`Py_RunMain` se puede utilizar para escribir un programa Python personalizado.

source: See also :ref:`Initialization, Finalization, and Threads <initialization>`.
es: Consulte también :ref:`Inicialización, finalización y subprocesos <initialization>`.

source: :pep:`587` "Python Initialization Configuration".
es: :pep:`587` "Configuración de inicialización de Python".

source: Example
es: Ejemplo

source: Example of customized Python always running in isolated mode::
es: Ejemplo de Python personalizado que siempre se ejecuta en modo aislado::

source: List of ``wchar_t*`` strings.
es: Lista de cadenas de caracteres ``wchar_t*``.

source: If *length* is non-zero, *items* must be non-``NULL`` and all strings must be non-``NULL``.
es: Si *length* no es cero, *items* no deben ser ``NULL`` y todas las cadenas de caracteres deben ser no ``NULL``.

source: Methods:
es: Métodos:

source: Append *item* to *list*.
es: Agregar *item* a *list*.

source: Python must be preinitialized to call this function.
es: Python debe estar preinicializado para llamar a esta función.

source: Insert *item* into *list* at *index*.
es: Inserta *item* en *list* en *index*.

source: If *index* is greater than or equal to *list* length, append *item* to *list*.
es: Si *index* es mayor o igual que el largo de *list*, agrega *item* a *list*.

source: *index* must be greater than or equal to 0.
es: *index* debe ser mayor o igual que 0.

source: Structure fields:
es: Campos de estructura:

source: List length.
es: Longitud de la lista.

source: List items.
es: Elementos de la lista.

source: Structure to store an initialization function status: success, error or exit.
es: Estructura para almacenar el estado de una función de inicialización: éxito, error o salida.

source: For an error, it can store the C function name which created the error.
es: Para un error, puede almacenar el nombre de la función C que creó el error.

source: Exit code. Argument passed to ``exit()``.
es: Código de salida El argumento pasó a ``exit()``.

source: Error message.
es: Mensaje de error.

source: Name of the function which created an error, can be ``NULL``.
es: El nombre de la función que creó un error puede ser ``NULL``.

source: Functions to create a status:
es: Funciones para crear un estado:

source: Success.
es: Éxito.

source: Initialization error with a message.
es: Error de inicialización con un mensaje.

source: *err_msg* must not be ``NULL``.
es: *err_msg* no debe ser ``NULL``.

source: Memory allocation failure (out of memory).
es: Error de asignación de memoria (sin memoria).

source: Exit Python with the specified exit code.
es: Sale de Python con el código de salida especificado.

source: Functions to handle a status:
es: Funciones para manejar un estado:

source: Is the status an error or an exit? If true, the exception must be handled; by calling :c:func:`Py_ExitStatusException` for example.
es: ¿Es el estado un error o una salida? Si es verdadero, la excepción debe ser manejada; por ejemplo llamando a :c:func:`Py_ExitStatusException`.

source: Is the result an error?
es: ¿Es el resultado un error?

source: Is the result an exit?
es: ¿El resultado es una salida?

source: Call ``exit(exitcode)`` if *status* is an exit. Print the error message and exit with a non-zero exit code if *status* is an error. Must only be called if ``PyStatus_Exception(status)`` is non-zero.
es: Llama a ``exit(exitcode)`` si *status* es una salida. Imprime el mensaje de error y sale con un código de salida distinto de cero si *status* es un error. Solo se debe llamar si ``PyStatus_Exception(status)`` no es cero.

source: Internally, Python uses macros which set ``PyStatus.func``, whereas functions to create a status set ``func`` to ``NULL``.
es: Internamente, Python usa macros que establecen ``PyStatus.func``, mientras que las funciones para crear un estado establecen ``func`` en ``NULL``.

source: Example::
es: Ejemplo::

source: Structure used to preinitialize Python.
es: Estructura utilizada para preinicializar Python.

source: Function to initialize a preconfiguration:
es: Función para inicializar una preconfiguración:

source: Initialize the preconfiguration with :ref:`Python Configuration <init-python-config>`.
es: Inicializa la preconfiguración con :ref:`Configuración de Python <init-python-config>`.

source: Initialize the preconfiguration with :ref:`Isolated Configuration <init-isolated-conf>`.
es: Inicializa la preconfiguración con :ref:`Configuración aislada <init-isolated-conf>`.

source: Name of the Python memory allocators:
es: Nombre de los asignadores de memoria de Python:

source: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): don't change memory allocators (use defaults).
es: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): no cambia asignadores de memoria (use los valores predeterminados)

source: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` with :ref:`debug hooks <pymem-debug-hooks>`.
es: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` con :ref:`debug hooks <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): use ``malloc()`` of the C library.
es: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): use ``malloc()`` de la biblioteca C.

source: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): force usage of ``malloc()`` with :ref:`debug hooks <pymem-debug-hooks>`.
es: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): fuerza el uso de ``malloc()`` con :ref:`debug hooks <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`Python pymalloc memory allocator <pymalloc>`.
es: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`asignador de memoria pymalloc de Python <pymalloc>`

source: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` with :ref:`debug hooks <pymem-debug-hooks>`.
es: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`asignador de memoria pymalloc de Python <pymalloc>` con :ref:`ganchos de depuración <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` and ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-pymalloc <--without-pymalloc>`.
es: ``PYMEM_ALLOCATOR_PYMALLOC`` y ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` no son compatibles si Python es :option:`configured using --without-pymalloc <--without-pymalloc>`.

source: See :ref:`Memory Management <memory>`.
es: Ver :ref:`Administración de memorias <memory>`.

source: Default: ``PYMEM_ALLOCATOR_NOT_SET``.
es: Predeterminado: ``PYMEM_ALLOCATOR_NOT_SET``.

source: Set the LC_CTYPE locale to the user preferred locale?
es: ¿Establecer la configuración regional LC_CTYPE en la configuración regional preferida del usuario?

source: If equals to 0, set :c:member:`~PyPreConfig.coerce_c_locale` and :c:member:`~PyPreConfig.coerce_c_locale_warn` members to 0.
es: Si es igual a 0, establezca los miembros :c:member:`~PyPreConfig.coerce_c_locale` y :c:member:`~PyPreConfig.coerce_c_locale_warn` en 0.

source: See the :term:`locale encoding`.
es: Vea el :term:`locale encoding`.

source: Default: ``1`` in Python config, ``0`` in isolated config.
es: Predeterminado: ``1`` en la configuración de Python, ``0`` en la configuración aislada.

source: If equals to 2, coerce the C locale.
es: Si es igual a 2, imponga la configuración regional C.

source: If equals to 1, read the LC_CTYPE locale to decide if it should be coerced.
es: Si es igual a 1, lea la configuración regional LC_CTYPE para decidir si debe ser coaccionado.

source: Default: ``-1`` in Python config, ``0`` in isolated config.
es: Predeterminado: ``-1`` en la configuración de Python, ``0`` en la configuración aislada.

source: If non-zero, emit a warning if the C locale is coerced.
es: Si no es cero, emita una advertencia si la configuración regional C está coaccionada.

source: If non-zero, enables the :ref:`Python Development Mode <devmode>`: see :c:member:`PyConfig.dev_mode`.
es: Si es distinto de cero, habilita el :ref:`Python Development Mode <devmode>`: consulte :c:member:`PyConfig.dev_mode`.

source: Default: ``-1`` in Python mode, ``0`` in isolated mode.
es: Por defecto: ``-1`` en modo Python, ``0`` en modo aislado.

source: Isolated mode: see :c:member:`PyConfig.isolated`.
es: Modo aislado: consulte :c:member:`PyConfig.isolated`.

source: Default: ``0`` in Python mode, ``1`` in isolated mode.
es: Por defecto: ``0`` en modo Python, ``1`` en modo aislado.

source: If non-zero:
es: Si no es cero:

source: Set :c:member:`PyPreConfig.utf8_mode` to ``0``,
es: Establezca :c:member:`PyPreConfig.utf8_mode` en ``0``,

source: Set :c:member:`PyConfig.filesystem_encoding` to ``"mbcs"``,
es: Establezca :c:member:`PyConfig.filesystem_encoding` en ``"mbcs"``,

source: Set :c:member:`PyConfig.filesystem_errors` to ``"replace"``.
es: Establezca :c:member:`PyConfig.filesystem_errors` en ``"replace"``.

source: Initialized the from :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable value.
es: Inicializó el valor de la variable de entorno de :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: Only available on Windows. ``#ifdef MS_WINDOWS`` macro can be used for Windows specific code.
es: Solo disponible en Windows. La macro ``#ifdef MS_WINDOWS`` se puede usar para el código específico de Windows.

source: Default: ``0``.
es: Predeterminado: ``0``.

source: If non-zero, :c:func:`Py_PreInitializeFromArgs` and :c:func:`Py_PreInitializeFromBytesArgs` parse their ``argv`` argument the same way the regular Python parses command line arguments: see :ref:`Command Line Arguments <using-on-cmdline>`.
es: Si no es cero, :c:func:`Py_PreInitializeFromArgs` y :c:func:`Py_PreInitializeFromBytesArgs` analizan su argumento ``argv`` de la misma manera que Python analiza los argumentos de la línea de comandos: ver :ref:`Argumentos de línea de comandos <using-on-cmdline>`.

source: Use :ref:`environment variables <using-on-envvars>`? See :c:member:`PyConfig.use_environment`.
es: ¿Utiliza :ref:`environment variables <using-on-envvars>`? Consulte :c:member:`PyConfig.use_environment`.

source: Default: ``1`` in Python config and ``0`` in isolated config.
es: Predeterminado: ``1`` en la configuración de Python y ``0`` en la configuración aislada.

source: If non-zero, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
es: Si es distinto de cero, habilite :ref:`Python UTF-8 Mode <utf8-mode>`.

source: Set by the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
es: Establecido por la opción de línea de comando :option:`-X utf8 <-X>` y la variable de entorno :envvar:`PYTHONUTF8`.

source: Default: ``-1`` in Python config and ``0`` in isolated config.
es: Predeterminado: ``-1`` en la configuración de Python y ``0`` en la configuración aislada.

source: Preinitialize Python with PyPreConfig
es: Preinicialización de Python con PyPreConfig

source: The preinitialization of Python:
es: La preinicialización de Python:

source: Set the Python memory allocators (:c:member:`PyPreConfig.allocator`)
es: Establecer los asignadores de memoria de Python (:c:member:`PyPreConfig.allocator`)

source: Configure the LC_CTYPE locale (:term:`locale encoding`)
es: Configurar la configuración regional LC_CTYPE (:term:`locale encoding`)

source: Set the :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)
es: Establecer el :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)

source: The current preconfiguration (``PyPreConfig`` type) is stored in ``_PyRuntime.preconfig``.
es: La preconfiguración actual (tipo ``PyPreConfig``) se almacena en ``_PyRuntime.preconfig``.

source: Functions to preinitialize Python:
es: Funciones para preinicializar Python:

source: Preinitialize Python from *preconfig* preconfiguration.
es: Preinicializa Python desde la preconfiguración *preconfig*.

source: *preconfig* must not be ``NULL``.
es: *preconfig* no debe ser ``NULL``.

source: Parse *argv* command line arguments (bytes strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
es: Analice los argumentos de la línea de comando *argv* (cadenas de bytes) si :c:member:`~PyPreConfig.parse_argv` de *preconfig* no es cero.

source: Parse *argv* command line arguments (wide strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
es: Analice los argumentos de la línea de comando *argv* (cadenas anchas) si :c:member:`~PyPreConfig.parse_argv` de *preconfig* no es cero.

source: The caller is responsible to handle exceptions (error or exit) using :c:func:`PyStatus_Exception` and :c:func:`Py_ExitStatusException`.
es: La persona que llama es responsable de manejar las excepciones (error o salida) usando :c:func:`PyStatus_Exception` y :c:func:`Py_ExitStatusException`.

source: For :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), if Python is initialized with command line arguments, the command line arguments must also be passed to preinitialize Python, since they have an effect on the pre-configuration like encodings. For example, the :option:`-X utf8 <-X>` command line option enables the :ref:`Python UTF-8 Mode <utf8-mode>`.
es: Para :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), si Python se inicializa con argumentos de línea de comando, los argumentos de la línea de comando también deben pasarse para preinicializar Python, ya que tienen un efecto en la preconfiguración como codificaciones. Por ejemplo, la opción de línea de comando :option:`-X utf8 <-X>` habilita el :ref:`Python UTF-8 Mode <utf8-mode>`.

source: ``PyMem_SetAllocator()`` can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. It can be called before :c:func:`Py_PreInitialize` if :c:member:`PyPreConfig.allocator` is set to ``PYMEM_ALLOCATOR_NOT_SET``.
es: ``PyMem_SetAllocator()`` se puede llamar después de :c:func:`Py_PreInitialize` y antes :c:func:`Py_InitializeFromConfig` para instalar un asignador de memoria personalizado. Se puede llamar antes :c:func:`Py_PreInitialize` si :c:member:`PyPreConfig.allocator` está configurado en ``PYMEM_ALLOCATOR_NOT_SET``.

source: Python memory allocation functions like :c:func:`PyMem_RawMalloc` must not be used before the Python preinitialization, whereas calling directly ``malloc()`` and ``free()`` is always safe. :c:func:`Py_DecodeLocale` must not be called before the Python preinitialization.
es: Las funciones de asignación de memoria de Python como :c:func:`PyMem_RawMalloc` no deben usarse antes de la preinicialización de Python, mientras que llamar directamente a ``malloc()`` y ``free()`` siempre es seguro. No se debe llamar a :c:func:`Py_DecodeLocale` antes de la preinicialización de Python.

source: Example using the preinitialization to enable the :ref:`Python UTF-8 Mode <utf8-mode>`::
es: Ejemplo usando la preinicialización para habilitar el :ref:`Python UTF-8 Mode <utf8-mode>` ::

source: Structure containing most parameters to configure Python.
es: Estructura que contiene la mayoría de los parámetros para configurar Python.

source: When done, the :c:func:`PyConfig_Clear` function must be used to release the configuration memory.
es: Cuando termine, se debe utilizar la función :c:func:`PyConfig_Clear` para liberar la memoria de configuración.

source: Structure methods:
es: Métodos de estructura:

source: Initialize configuration with the :ref:`Python Configuration <init-python-config>`.
es: Inicialice la configuración con el :ref:`Python Configuration <init-python-config>`.

source: Initialize configuration with the :ref:`Isolated Configuration <init-isolated-conf>`.
es: Inicialice la configuración con el :ref:`Isolated Configuration <init-isolated-conf>`.

source: Copy the wide character string *str* into ``*config_str``.
es: Copia la cadena de caracteres anchos *str* en ``*config_str``.

source: :ref:`Preinitialize Python <c-preinit>` if needed.
es: :ref:`Preinicializa Python <c-preinit>` si es necesario.

source: Decode *str* using :c:func:`Py_DecodeLocale` and set the result into ``*config_str``.
es: Decodifique *str* usando :c:func:`Py_DecodeLocale` y establezca el resultado en ``*config_str``.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of wide character strings.
es: Configure los argumentos de la línea de comando (miembro :c:member:`~PyConfig.argv` de *config*) de la lista *argv* de cadenas de caracteres anchas.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of bytes strings. Decode bytes using :c:func:`Py_DecodeLocale`.
es: Establezca argumentos de línea de comando (miembro :c:member:`~PyConfig.argv` de *config*) de la lista *argv* de cadenas de bytes. Decodifica bytes usando :c:func:`Py_DecodeLocale`.

source: Set the list of wide strings *list* to *length* and *items*.
es: Establece la lista de cadenas de caracteres anchas *list* a *length* y *items*.

source: Read all Python configuration.
es: Lee toda la configuración de Python.

source: Fields which are already initialized are left unchanged.
es: Los campos que ya están inicializados no se modifican.

source: The :c:func:`PyConfig_Read` function only parses :c:member:`PyConfig.argv` arguments once: :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed. Since Python arguments are strippped from :c:member:`PyConfig.argv`, parsing arguments twice would parse the application options as Python options.
es: La función :c:func:`PyConfig_Read` solo analiza los argumentos :c:member:`PyConfig.argv` una vez: :c:member:`PyConfig.parse_argv` se establece en ``2`` después de analizar los argumentos. Dado que los argumentos de Python se eliminan de :c:member:`PyConfig.argv`, analizar los argumentos dos veces analizaría las opciones de la aplicación como opciones de Python.

source: The :c:member:`PyConfig.argv` arguments are now only parsed once, :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed, and arguments are only parsed if :c:member:`PyConfig.parse_argv` equals ``1``.
es: Los argumentos :c:member:`PyConfig.argv` ahora solo se analizan una vez, :c:member:`PyConfig.parse_argv` se establece en ``2`` después de analizar los argumentos y los argumentos solo se analizan si :c:member:`PyConfig.parse_argv` es igual a ``1``.

source: Release configuration memory.
es: Libera memoria de configuración.

source: Most ``PyConfig`` methods :ref:`preinitialize Python <c-preinit>` if needed. In that case, the Python preinitialization configuration (:c:type:`PyPreConfig`) in based on the :c:type:`PyConfig`. If configuration fields which are in common with :c:type:`PyPreConfig` are tuned, they must be set before calling a :c:type:`PyConfig` method:
es: La mayoría de ``PyConfig`` métodos :ref:`preinitialize Python <c-preinit>` si es necesario. En ese caso, la configuración de preinicialización de Python (:c:type:`PyPreConfig`) se basa en :c:type:`PyConfig`. Si se ajustan los campos de configuración que son comunes con :c:type:`PyPreConfig`, deben establecerse antes de llamar a un método :c:type:`PyConfig`:

source: Moreover, if :c:func:`PyConfig_SetArgv` or :c:func:`PyConfig_SetBytesArgv` is used, this method must be called before other methods, since the preinitialization configuration depends on command line arguments (if :c:member:`parse_argv` is non-zero).
es: Además, si se usa :c:func:`PyConfig_SetArgv` o :c:func:`PyConfig_SetBytesArgv`, este método debe llamarse antes que otros métodos, ya que la configuración de preinicialización depende de los argumentos de la línea de comando (si :c:member:`parse_argv` no es cero).

source: The caller of these methods is responsible to handle exceptions (error or exit) using ``PyStatus_Exception()`` and ``Py_ExitStatusException()``.
es: Quien llama de estos métodos es responsable de manejar las excepciones (error o salida) usando ``PyStatus_Exception()`` y ``Py_ExitStatusException()``.

source: Command line arguments: :data:`sys.argv`.
es: Argumentos de la línea de comando: :data:`sys.argv`.

source: Set :c:member:`~PyConfig.parse_argv` to ``1`` to parse :c:member:`~PyConfig.argv` the same way the regular Python parses Python command line arguments and then to strip Python arguments from :c:member:`~PyConfig.argv`.
es: Configure :c:member:`~PyConfig.parse_argv` en ``1`` para analizar :c:member:`~PyConfig.argv` de la misma manera que Python normal analiza los argumentos de la línea de comandos de Python y luego quita los argumentos de Python de :c:member:`~PyConfig.argv`.

source: If :c:member:`~PyConfig.argv` is empty, an empty string is added to ensure that :data:`sys.argv` always exists and is never empty.
es: Si :c:member:`~PyConfig.argv` está vacío, se agrega una cadena vacía para garantizar que :data:`sys.argv` siempre exista y nunca esté vacío.

source: Default: ``NULL``.
es: Valor predeterminado: ``NULL``.

source: See also the :c:member:`~PyConfig.orig_argv` member.
es: Consulte también el miembro :c:member:`~PyConfig.orig_argv`.

source: Part of the :ref:`Python Path Configuration <init-path-config>` output.
es: Parte de la salida :ref:`Python Path Configuration <init-path-config>`.

source: Python base executable: :data:`sys._base_executable`.
es: Ejecutable base de Python: :data:`sys._base_executable`.

source: Set by the :envvar:`__PYVENV_LAUNCHER__` environment variable.
es: Establecido por la variable de entorno :envvar:`__PYVENV_LAUNCHER__`.

source: Set from :c:member:`PyConfig.executable` if ``NULL``.
es: Establecer desde :c:member:`PyConfig.executable` si ``NULL``.

source: If equals to 0 and :c:member:`~PyConfig.configure_c_stdio` is non-zero, disable buffering on the C streams stdout and stderr.
es: Si es igual a 0 y :c:member:`~PyConfig.configure_c_stdio` no es cero, deshabilite el almacenamiento en búfer en las secuencias C stdout y stderr.
