Repository: python/python-docs-es
Catalog: c-api/init_config.po
Languages: es

source: Encoding and encoding errors of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` (but :data:`sys.stderr` always uses ``"backslashreplace"`` error handler).
es: Codificación y errores de codificación de :data:`sys.stdin`, :data:`sys.stdout` y :data:`sys.stderr` (pero :data:`sys.stderr` siempre usa el controlador de errores ``"backslashreplace"``).

source: If :c:func:`Py_SetStandardStreamEncoding` has been called, use its *error* and *errors* arguments if they are not ``NULL``.
es: Si se ha llamado a :c:func:`Py_SetStandardStreamEncoding`, utilice sus argumentos *error* y *errors* si no son ``NULL``.

source: Use the :envvar:`PYTHONIOENCODING` environment variable if it is non-empty.
es: Utilice la variable de entorno :envvar:`PYTHONIOENCODING` si no está vacía.

source: Default encoding:
es: Codificación predeterminada:

source: ``"UTF-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
es: ``"UTF-8"`` si :c:member:`PyPreConfig.utf8_mode` es distinto de cero.

source: Otherwise, use the :term:`locale encoding`.
es: De lo contrario, use el :term:`locale encoding`.

source: Default error handler:
es: Manejador de errores predeterminado:

source: On Windows: use ``"surrogateescape"``.
es: En Windows: use ``"surrogateescape"``.

source: ``"surrogateescape"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero, or if the LC_CTYPE locale is "C" or "POSIX".
es: ``"surrogateescape"`` si :c:member:`PyPreConfig.utf8_mode` no es cero o si la configuración regional LC_CTYPE es "C" o "POSIX".

source: ``"strict"`` otherwise.
es: ``"strict"`` de lo contrario.

source: Enable tracemalloc?
es: ¿Habilitar tracemalloc?

source: If non-zero, call :func:`tracemalloc.start` at startup.
es: Si no es cero, llama a :func:`tracemalloc.start` al inicio.

source: Set by :option:`-X tracemalloc=N <-X>` command line option and by the :envvar:`PYTHONTRACEMALLOC` environment variable.
es: Establecido por la opción de línea de comando :option:`-X tracemalloc=N <-X>` y por la variable de entorno :envvar:`PYTHONTRACEMALLOC`.

source: Use :ref:`environment variables <using-on-envvars>`?
es: ¿Utiliza :ref:`environment variables <using-on-envvars>`?

source: If equals to zero, ignore the :ref:`environment variables <using-on-envvars>`.
es: Si es igual a cero, ignore el :ref:`environment variables <using-on-envvars>`.

source: If non-zero, add the user site directory to :data:`sys.path`.
es: Si es distinto de cero, agregue el directorio del sitio del usuario a :data:`sys.path`.

source: Set to ``0`` by the :option:`-s` and :option:`-I` command line options.
es: Establecido en ``0`` por las opciones de línea de comando :option:`-s` y :option:`-I`.

source: Set to ``0`` by the :envvar:`PYTHONNOUSERSITE` environment variable.
es: Establecido en ``0`` por la variable de entorno :envvar:`PYTHONNOUSERSITE`.

source: Verbose mode. If greater than 0, print a message each time a module is imported, showing the place (filename or built-in module) from which it is loaded.
es: Modo detallado. Si es mayor que 0, imprima un mensaje cada vez que se importe un módulo, mostrando el lugar (nombre de archivo o módulo integrado) desde el que se carga.

source: If greater or equal to 2, print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
es: Si es mayor o igual a 2, imprima un mensaje para cada archivo que se compruebe al buscar un módulo. También proporciona información sobre la limpieza del módulo al salir.

source: Incremented by the :option:`-v` command line option.
es: Incrementado por la opción de línea de comando :option:`-v`.

source: Set to the :envvar:`PYTHONVERBOSE` environment variable value.
es: Establecido en el valor de la variable de entorno :envvar:`PYTHONVERBOSE`.

source: Options of the :mod:`warnings` module to build warnings filters, lowest to highest priority: :data:`sys.warnoptions`.
es: Opciones del módulo :mod:`warnings` para crear filtros de advertencias, de menor a mayor prioridad: :data:`sys.warnoptions`.

source: The :mod:`warnings` module adds :data:`sys.warnoptions` in the reverse order: the last :c:member:`PyConfig.warnoptions` item becomes the first item of :data:`warnings.filters` which is checked first (highest priority).
es: El módulo :mod:`warnings` agrega :data:`sys.warnoptions` en el orden inverso: el último elemento :c:member:`PyConfig.warnoptions` se convierte en el primer elemento de :data:`warnings.filters` que es verificado primero (máxima prioridad).

source: The :option:`-W` command line options adds its value to :c:member:`~PyConfig.warnoptions`, it can be used multiple times.
es: Las opciones de la línea de comando :option:`-W` agregan su valor a :c:member:`~PyConfig.warnoptions`, se puede usar varias veces.

source: The :envvar:`PYTHONWARNINGS` environment variable can also be used to add warning options. Multiple options can be specified, separated by commas (``,``).
es: La variable de entorno :envvar:`PYTHONWARNINGS` también se puede utilizar para agregar opciones de advertencia. Se pueden especificar varias opciones, separadas por comas (``,``).

source: If equal to 0, Python won't try to write ``.pyc`` files on the import of source modules.
es: Si es igual a 0, Python no intentará escribir archivos ``.pyc`` en la importación de módulos fuente.

source: Set to ``0`` by the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable.
es: Establecido en ``0`` por la opción de línea de comando :option:`-B` y la variable de entorno :envvar:`PYTHONDONTWRITEBYTECODE`.

source: :data:`sys.dont_write_bytecode` is initialized to the inverted value of :c:member:`~PyConfig.write_bytecode`.
es: :data:`sys.dont_write_bytecode` se inicializa al valor invertido de :c:member:`~PyConfig.write_bytecode`.

source: Values of the :option:`-X` command line options: :data:`sys._xoptions`.
es: Valores de las opciones de la línea de comando :option:`-X`: :data:`sys._xoptions`.

source: If :c:member:`~PyConfig.parse_argv` is non-zero, :c:member:`~PyConfig.argv` arguments are parsed the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and Python arguments are stripped from :c:member:`~PyConfig.argv`.
es: Si :c:member:`~PyConfig.parse_argv` no es cero, los argumentos de :c:member:`~PyConfig.argv` se analizan de la misma forma que Python normal analiza :ref:`command line arguments <using-on-cmdline>`, y los argumentos de Python se eliminan de :c:member:`~PyConfig.argv`.

source: The :c:member:`~PyConfig.xoptions` options are parsed to set other options: see the :option:`-X` command line option.
es: Las opciones de :c:member:`~PyConfig.xoptions` se analizan para establecer otras opciones: consulte la opción de línea de comando :option:`-X`.

source: The ``show_alloc_count`` field has been removed.
es: El campo ``show_alloc_count`` fue removido.

source: Initialization with PyConfig
es: Inicialización con PyConfig

source: Function to initialize Python:
es: Función para inicializar Python:

source: Initialize Python from *config* configuration.
es: Inicializa Python desde la configuración *config*.

source: If :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` are used, they must be set or called after Python preinitialization and before the Python initialization. If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
es: Si se utilizan :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` o :c:func:`PyImport_ExtendInittab`, deben establecerse o llamarse después de la preinicialización de Python y antes de la inicialización de Python. Si Python se inicializa varias veces, se debe llamar a :c:func:`PyImport_AppendInittab` o :c:func:`PyImport_ExtendInittab` antes de cada inicialización de Python.

source: The current configuration (``PyConfig`` type) is stored in ``PyInterpreterState.config``.
es: La configuración actual (tipo ``PyConfig``) se almacena en ``PyInterpreterState.config``.

source: Example setting the program name::
es: Ejemplo de configuración del nombre del programa::

source: More complete example modifying the default configuration, read the configuration, and then override some parameters::
es: Ejemplo más completo que modifica la configuración predeterminada, lee la configuración y luego anula algunos parámetros ::

source: Isolated Configuration
es: Configuración aislada

source: :c:func:`PyPreConfig_InitIsolatedConfig` and :c:func:`PyConfig_InitIsolatedConfig` functions create a configuration to isolate Python from the system. For example, to embed Python into an application.
es: :c:func:`PyPreConfig_InitIsolatedConfig` y las funciones :c:func:`PyConfig_InitIsolatedConfig` crean una configuración para aislar Python del sistema. Por ejemplo, para incrustar Python en una aplicación.

source: This configuration ignores global configuration variables, environments variables, command line arguments (:c:member:`PyConfig.argv` is not parsed) and user site directory. The C standard streams (ex: ``stdout``) and the LC_CTYPE locale are left unchanged. Signal handlers are not installed.
es: Esta configuración ignora las variables de configuración global, las variables de entorno, los argumentos de la línea de comandos (:c:member:`PyConfig.argv` no se analiza) y el directorio del sitio del usuario. Las transmisiones estándar C (por ejemplo, ``stdout``) y el entorno local LC_CTYPE no se modifican. Los manejadores de señal no están instalados.

source: Configuration files are still used with this configuration. Set the :ref:`Python Path Configuration <init-path-config>` ("output fields") to ignore these configuration files and avoid the function computing the default path configuration.
es: Los archivos de configuración todavía se utilizan con esta configuración. Configure el :ref:`Python Path Configuration <init-path-config>` ("campos de salida") para ignorar estos archivos de configuración y evitar que la función calcule la configuración de ruta predeterminada.

source: Python Configuration
es: Configuración de Python

source: :c:func:`PyPreConfig_InitPythonConfig` and :c:func:`PyConfig_InitPythonConfig` functions create a configuration to build a customized Python which behaves as the regular Python.
es: :c:func:`PyPreConfig_InitPythonConfig` y las funciones :c:func:`PyConfig_InitPythonConfig` crean una configuración para construir un Python personalizado que se comporta como el Python normal.

source: Environments variables and command line arguments are used to configure Python, whereas global configuration variables are ignored.
es: Las variables de entorno y los argumentos de la línea de comandos se utilizan para configurar Python, mientras que las variables de configuración global se ignoran.

source: This function enables C locale coercion (:pep:`538`) and :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) depending on the LC_CTYPE locale, :envvar:`PYTHONUTF8` and :envvar:`PYTHONCOERCECLOCALE` environment variables.
es: Esta función habilita la coerción de configuración regional C (:pep:`538`) y :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) según la configuración regional LC_CTYPE, las variables de entorno :envvar:`PYTHONUTF8` y :envvar:`PYTHONCOERCECLOCALE`.

source: Python Path Configuration
es: Configuración de la ruta de Python

source: :c:type:`PyConfig` contains multiple fields for the path configuration:
es: :c:type:`PyConfig` contiene múltiples campos para la configuración de ruta:

source: Path configuration inputs:
es: Entradas de configuración de ruta:

source: current working directory: to get absolute paths
es: directorio de trabajo actual: para obtener rutas absolutas

source: ``PATH`` environment variable to get the program full path (from :c:member:`PyConfig.program_name`)
es: Variable de entorno ``PATH`` para obtener la ruta completa del programa (de :c:member:`PyConfig.program_name`)

source: ``__PYVENV_LAUNCHER__`` environment variable
es: Variable de entorno ``__PYVENV_LAUNCHER__``

source: (Windows only) Application paths in the registry under "Software\Python\PythonCore\X.Y\PythonPath" of HKEY_CURRENT_USER and HKEY_LOCAL_MACHINE (where X.Y is the Python version).
es: (Solo Windows) Rutas de aplicación en el registro en "Software\Python\PythonCore\X.Y\PythonPath" de HKEY_CURRENT_USER y HKEY_LOCAL_MACHINE (donde X.Y es la versión de Python).

source: Path configuration output fields:
es: Campos de salida de configuración de ruta:

source: If at least one "output field" is not set, Python calculates the path configuration to fill unset fields. If :c:member:`~PyConfig.module_search_paths_set` is equal to 0, :c:member:`~PyConfig.module_search_paths` is overridden and :c:member:`~PyConfig.module_search_paths_set` is set to 1.
es: Si no se establece al menos un "campo de salida", Python calcula la configuración de la ruta para completar los campos no definidos. Si :c:member:`~PyConfig.module_search_paths_set` es igual a 0, :c:member:`~PyConfig.module_search_paths` se reemplaza y :c:member:`~PyConfig.module_search_paths_set` se establece en 1.

source: It is possible to completely ignore the function calculating the default path configuration by setting explicitly all path configuration output fields listed above. A string is considered as set even if it is non-empty. ``module_search_paths`` is considered as set if ``module_search_paths_set`` is set to 1. In this case, path configuration input fields are ignored as well.
es: Es posible ignorar por completo la función que calcula la configuración de ruta predeterminada al establecer explícitamente todos los campos de salida de configuración de ruta enumerados anteriormente. Una cadena de caracteres se considera como un conjunto, incluso si no está vacía. ``module_search_paths`` se considera como establecido si ``module_search_paths_set`` se establece en 1. En este caso, los campos de entrada de configuración de ruta también se ignoran.

source: Set :c:member:`~PyConfig.pathconfig_warnings` to 0 to suppress warnings when calculating the path configuration (Unix only, Windows does not log any warning).
es: Establezca :c:member:`~PyConfig.pathconfig_warnings` en 0 para suprimir las advertencias al calcular la configuración de la ruta (solo Unix, Windows no registra ninguna advertencia).

source: If :c:member:`~PyConfig.base_prefix` or :c:member:`~PyConfig.base_exec_prefix` fields are not set, they inherit their value from :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` respectively.
es: Si :c:member:`~PyConfig.base_prefix` o los campos :c:member:`~PyConfig.base_exec_prefix` no están establecidos, heredan su valor de :c:member:`~PyConfig.prefix` y :c:member:`~PyConfig.exec_prefix` respectivamente.

source: :c:func:`Py_RunMain` and :c:func:`Py_Main` modify :data:`sys.path`:
es: :c:func:`Py_RunMain` y :c:func:`Py_Main` modifican :data:`sys.path`:

source: If :c:member:`~PyConfig.run_filename` is set and is a directory which contains a ``__main__.py`` script, prepend :c:member:`~PyConfig.run_filename` to :data:`sys.path`.
es: Si :c:member:`~PyConfig.run_filename` está configurado y es un directorio que contiene un script ``__main__.py``, anteponga :c:member:`~PyConfig.run_filename` a :data:`sys.path`.

source: If :c:member:`~PyConfig.isolated` is zero:
es: Si :c:member:`~PyConfig.isolated` es cero:

source: If :c:member:`~PyConfig.run_module` is set, prepend the current directory to :data:`sys.path`. Do nothing if the current directory cannot be read.
es: Si :c:member:`~PyConfig.run_module` está configurado, anteponga el directorio actual a :data:`sys.path`. No haga nada si el directorio actual no se puede leer.

source: If :c:member:`~PyConfig.run_filename` is set, prepend the directory of the filename to :data:`sys.path`.
es: Si :c:member:`~PyConfig.run_filename` está configurado, anteponga el directorio del nombre del archivo a :data:`sys.path`.

source: Otherwise, prepend an empty string to :data:`sys.path`.
es: De lo contrario, anteponga una cadena de caracteres vacía a :data:`sys.path`.

source: If :c:member:`~PyConfig.site_import` is non-zero, :data:`sys.path` can be modified by the :mod:`site` module. If :c:member:`~PyConfig.user_site_directory` is non-zero and the user's site-package directory exists, the :mod:`site` module appends the user's site-package directory to :data:`sys.path`.
es: Si :c:member:`~PyConfig.site_import` no es cero, :data:`sys.path` puede ser modificado por el módulo :mod:`site`. Si :c:member:`~PyConfig.user_site_directory` no es cero y el directorio del paquete del sitio del usuario existe, el módulo :mod:`site` agrega el directorio del paquete del sitio del usuario a :data:`sys.path`.

source: The following configuration files are used by the path configuration:
es: La configuración de ruta utiliza los siguientes archivos de configuración:

source: ``python._pth`` (Windows only)
es: ``python._pth`` (sólo Windows)

source: ``pybuilddir.txt`` (Unix only)
es: ``pybuilddir.txt`` (sólo Unix)

source: The ``__PYVENV_LAUNCHER__`` environment variable is used to set :c:member:`PyConfig.base_executable`
es: La variable de entorno ``__PYVENV_LAUNCHER__`` se usa para establecer :c:member:`PyConfig.base_executable`

source: Execute the command (:c:member:`PyConfig.run_command`), the script (:c:member:`PyConfig.run_filename`) or the module (:c:member:`PyConfig.run_module`) specified on the command line or in the configuration.
es: Ejecuta el comando (:c:member:`PyConfig.run_command`), el script (:c:member:`PyConfig.run_filename`) o el módulo (:c:member:`PyConfig.run_module`) especificado en la línea de comando o en la configuración.

source: By default and when if :option:`-i` option is used, run the REPL.
es: Por defecto y cuando se usa la opción :option:`-i`, ejecuta el REPL.

source: Finally, finalizes Python and returns an exit status that can be passed to the ``exit()`` function.
es: Finalmente, finaliza Python y retorna un estado de salida que se puede pasar a la función ``exit()``.

source: See :ref:`Python Configuration <init-python-config>` for an example of customized Python always running in isolated mode using :c:func:`Py_RunMain`.
es: Consulte :ref:`Configuración de Python <init-python-config>` para ver un ejemplo de Python personalizado que siempre se ejecuta en modo aislado usando :c:func:`Py_RunMain`.

source: Get the original command line arguments, before Python modified them.
es: Obtiene los argumentos originales de la línea de comandos, antes de que Python los modificara.

source: See also :c:member:`PyConfig.orig_argv` member.
es: Ver también el miembro :c:member:`PyConfig.orig_argv`.

source: Multi-Phase Initialization Private Provisional API
es: API Provisional Privada de Inicialización Multifásica

source: This section is a private provisional API introducing multi-phase initialization, the core feature of the :pep:`432`:
es: Esta sección es una API provisional privada que presenta la inicialización de múltiples fases, la característica principal de :pep:`432`:

source: "Core" initialization phase, "bare minimum Python":
es: Fase de inicialización "Core", "Python mínimo":

source: Builtin types;
es: Tipos incorporados;

source: Builtin exceptions;
es: Excepciones incorporadas;

source: Builtin and frozen modules;
es: Módulos incorporados y congelados;

source: The :mod:`sys` module is only partially initialized (ex: :data:`sys.path` doesn't exist yet).
es: El módulo :mod:`sys` solo se inicializa parcialmente (por ejemplo :data:`sys.path` aún no existe).

source: "Main" initialization phase, Python is fully initialized:
es: Fase de inicialización "principal", Python está completamente inicializado:

source: Install and configure :mod:`importlib`;
es: Instala y configura :mod:`importlib`;

source: Apply the :ref:`Path Configuration <init-path-config>`;
es: Aplique la :ref:`Configuración de ruta <init-path-config>`;

source: Install signal handlers;
es: Instala manejadores de señal;

source: Finish :mod:`sys` module initialization (ex: create :data:`sys.stdout` and :data:`sys.path`);
es: Finaliza la inicialización del módulo :mod:`sys` (por ejemplo: crea :data:`sys.stdout` y :data:`sys.path`);

source: Enable optional features like :mod:`faulthandler` and :mod:`tracemalloc`;
es: Habilita características opcionales como :mod:`faulthandler` y :mod:`tracemalloc`;

source: Import the :mod:`site` module;
es: Importe el módulo :mod:`site`;

source: Private provisional API:
es: API provisional privada:

source: :c:member:`PyConfig._init_main`: if set to 0, :c:func:`Py_InitializeFromConfig` stops at the "Core" initialization phase.
es: :c:member:`PyConfig._init_main`: si se establece en 0, :c:func:`Py_InitializeFromConfig` se detiene en la fase de inicialización "Core".

source: :c:member:`PyConfig._isolated_interpreter`: if non-zero, disallow threads, subprocesses and fork.
es: :c:member:`PyConfig._isolated_interpreter`: si no es cero, no permite hilos, subprocesos y bifurcaciones.

source: Move to the "Main" initialization phase, finish the Python initialization.
es: Vaya a la fase de inicialización "Principal", finalice la inicialización de Python.

source: No module is imported during the "Core" phase and the ``importlib`` module is not configured: the :ref:`Path Configuration <init-path-config>` is only applied during the "Main" phase. It may allow to customize Python in Python to override or tune the :ref:`Path Configuration <init-path-config>`, maybe install a custom :data:`sys.meta_path` importer or an import hook, etc.
es: No se importa ningún módulo durante la fase "Core" y el módulo ``importlib`` no está configurado: la :ref:`Configuración de ruta <init-path-config>` solo se aplica durante la fase "Principal". Puede permitir personalizar Python en Python para anular o ajustar :ref:`Configuración de ruta <init-path-config>`, tal vez instale un importador personalizado :data:`sys.meta_path` o un enlace de importación, etc.

source: It may become possible to calculatin the :ref:`Path Configuration <init-path-config>` in Python, after the Core phase and before the Main phase, which is one of the :pep:`432` motivation.
es: Puede ser posible calcular :ref:`Configuración de ruta <init-path-config>` en Python, después de la fase Core y antes de la fase Main, que es una de las motivaciones :pep:`432`.

source: The "Core" phase is not properly defined: what should be and what should not be available at this phase is not specified yet. The API is marked as private and provisional: the API can be modified or even be removed anytime until a proper public API is designed.
es: La fase "Núcleo" no está definida correctamente: lo que debería estar y lo que no debería estar disponible en esta fase aún no se ha especificado. La API está marcada como privada y provisional: la API se puede modificar o incluso eliminar en cualquier momento hasta que se diseñe una API pública adecuada.

source: Example running Python code between "Core" and "Main" initialization phases::
es: Ejemplo de ejecución de código Python entre las fases de inicialización "Core" y "Main"::
