Repository: python/python-docs-es
Catalog: c-api/init_config.po
Languages: es

source: Set to 0 by the :option:`-u` command line option and the :envvar:`PYTHONUNBUFFERED` environment variable.
es: Establecido en 0 por la opción de línea de comando :option:`-u` y la variable de entorno :envvar:`PYTHONUNBUFFERED`.

source: stdin is always opened in buffered mode.
es: stdin siempre se abre en modo de búfer.

source: Default: ``1``.
es: Predeterminado: ``1``.

source: If equals to 1, issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str`, or comparing :class:`bytes` with :class:`int`.
es: Si es igual a 1, emita una advertencia al comparar :class:`bytes` o :class:`bytearray` con :class:`str`, o al comparar :class:`bytes` con :class:`int`.

source: If equal or greater to 2, raise a :exc:`BytesWarning` exception in these cases.
es: Si es igual o mayor a 2, genere una excepción :exc:`BytesWarning` en estos casos.

source: Incremented by the :option:`-b` command line option.
es: Incrementado por la opción de línea de comando :option:`-b`.

source: If non-zero, emit a :exc:`EncodingWarning` warning when :class:`io.TextIOWrapper` uses its default encoding. See :ref:`io-encoding-warning` for details.
es: Si no es cero, emite una advertencia :exc:`EncodingWarning` cuando :class:`io.TextIOWrapper` usa su codificación predeterminada. Consulte :ref:`io-encoding-warning` para obtener más detalles.

source: Control the validation behavior of hash-based ``.pyc`` files: value of the :option:`--check-hash-based-pycs` command line option.
es: Controle el comportamiento de validación de archivos ``.pyc`` basados ​​en hash: valor de la opción de línea de comando :option:`--check-hash-based-pycs`.

source: Valid values:
es: Valores válidos:

source: ``L"always"``: Hash the source file for invalidation regardless of value of the 'check_source' flag.
es: ``L"always"``: Hash el archivo fuente para invalidación independientemente del valor de la marca 'check_source'.

source: ``L"never"``: Assume that hash-based pycs always are valid.
es: ``L"never"``: suponga que los pycs basados ​​en hash siempre son válidos.

source: ``L"default"``: The 'check_source' flag in hash-based pycs determines invalidation.
es: ``L"default"``: El indicador 'check_source' en pycs basados ​​en hash determina la invalidación.

source: Default: ``L"default"``.
es: Predeterminado: ``L"default"``.

source: See also :pep:`552` "Deterministic pycs".
es: Consulte también :pep:`552` "Pycs deterministas".

source: If non-zero, configure C standard streams:
es: Si es distinto de cero, configure los flujos estándar de C:

source: On Windows, set the binary mode (``O_BINARY``) on stdin, stdout and stderr.
es: En Windows, configure el modo binario (``O_BINARY``) en stdin, stdout y stderr.

source: If :c:member:`~PyConfig.buffered_stdio` equals zero, disable buffering of stdin, stdout and stderr streams.
es: Si :c:member:`~PyConfig.buffered_stdio` es igual a cero, deshabilite el almacenamiento en búfer de los flujos stdin, stdout y stderr.

source: If :c:member:`~PyConfig.interactive` is non-zero, enable stream buffering on stdin and stdout (only stdout on Windows).
es: Si :c:member:`~PyConfig.interactive` no es cero, habilite el almacenamiento en búfer de flujo en stdin y stdout (solo stdout en Windows).

source: If non-zero, enable the :ref:`Python Development Mode <devmode>`.
es: Si es distinto de cero, habilita :ref:`Modo de desarrollo de Python <devmode>`.

source: Dump Python refererences?
es: ¿Volcar referencias de Python?

source: If non-zero, dump all objects which are still alive at exit.
es: Si no es cero, volcar todos los objetos que aún están vivos en la salida.

source: Set to ``1`` by the :envvar:`PYTHONDUMPREFS` environment variable.
es: Establecido en ``1`` por la variable de entorno :envvar:`PYTHONDUMPREFS`.

source: Need a special build of Python with the ``Py_TRACE_REFS`` macro defined: see the :option:`configure --with-trace-refs option <--with-trace-refs>`.
es: Necesita una compilación especial de Python con la macro ``Py_TRACE_REFS`` definida: consulte :option:`configure --with-trace-refs option <--with-trace-refs>`.

source: The site-specific directory prefix where the platform-dependent Python files are installed: :data:`sys.exec_prefix`.
es: El prefijo de directorio específico del sitio donde se instalan los archivos Python dependientes de la plataforma: :data:`sys.exec_prefix`.

source: The absolute path of the executable binary for the Python interpreter: :data:`sys.executable`.
es: La ruta absoluta del binario ejecutable para el intérprete de Python: :data:`sys.executable`.

source: Enable faulthandler?
es: ¿Habilitar administrador de fallas?

source: If non-zero, call :func:`faulthandler.enable` at startup.
es: Si no es cero, llama a :func:`faulthandler.enable` al inicio.

source: Set to ``1`` by :option:`-X faulthandler <-X>` and the :envvar:`PYTHONFAULTHANDLER` environment variable.
es: Establecido en ``1`` por :option:`-X faulthandler <-X>` y la variable de entorno :envvar:`PYTHONFAULTHANDLER`.

source: On macOS, Android and VxWorks: use ``"utf-8"`` by default.
es: En macOS, Android y VxWorks: use ``"utf-8"`` de forma predeterminada.

source: On Windows: use ``"utf-8"`` by default, or ``"mbcs"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
es: En Windows: utilice ``"utf-8"`` de forma predeterminada o ``"mbcs"`` si :c:member:`~PyPreConfig.legacy_windows_fs_encoding` de :c:type:`PyPreConfig` no es cero.

source: Default encoding on other platforms:
es: Codificación predeterminada en otras plataformas:

source: ``"utf-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
es: ``"utf-8"`` si :c:member:`PyPreConfig.utf8_mode` es distinto de cero.

source: ``"ascii"`` if Python detects that ``nl_langinfo(CODESET)`` announces the ASCII encoding (or Roman8 encoding on HP-UX), whereas the ``mbstowcs()`` function decodes from a different encoding (usually Latin1).
es: ``"ascii"`` si Python detecta que ``nl_langinfo(CODESET)`` anuncia la codificación ASCII (o la codificación Roman8 en HP-UX), mientras que la función ``mbstowcs()`` descodifica a partir de una codificación diferente (generalmente Latin1).

source: ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string.
es: ``"utf-8"`` si ``nl_langinfo(CODESET)`` devuelve una cadena vacía.

source: Otherwise, use the :term:`locale encoding`: ``nl_langinfo(CODESET)`` result.
es: De lo contrario, utilice el resultado :term:`locale encoding`: ``nl_langinfo(CODESET)``.

source: At Python startup, the encoding name is normalized to the Python codec name. For example, ``"ANSI_X3.4-1968"`` is replaced with ``"ascii"``.
es: Al inicio de Python, el nombre de codificación se normaliza al nombre del códec de Python. Por ejemplo, ``"ANSI_X3.4-1968"`` se reemplaza por ``"ascii"``.

source: See also the :c:member:`~PyConfig.filesystem_errors` member.
es: Consulte también el miembro :c:member:`~PyConfig.filesystem_errors`.

source: On Windows: use ``"surrogatepass"`` by default, or ``"replace"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
es: En Windows: utilice ``"surrogatepass"`` de forma predeterminada o ``"replace"`` si :c:member:`~PyPreConfig.legacy_windows_fs_encoding` de :c:type:`PyPreConfig` no es cero.

source: On other platforms: use ``"surrogateescape"`` by default.
es: En otras plataformas: utilice ``"surrogateescape"`` de forma predeterminada.

source: Supported error handlers:
es: Controladores de errores admitidos:

source: ``"surrogatepass"`` (only supported with the UTF-8 encoding)
es: ``"surrogatepass"`` (solo compatible con la codificación UTF-8)

source: See also the :c:member:`~PyConfig.filesystem_encoding` member.
es: Consulte también el miembro :c:member:`~PyConfig.filesystem_encoding`.

source: Randomized hash function seed.
es: Funciones de semillas aleatorias hash.

source: If :c:member:`~PyConfig.use_hash_seed` is zero, a seed is chosen randomly at Python startup, and :c:member:`~PyConfig.hash_seed` is ignored.
es: Si :c:member:`~PyConfig.use_hash_seed` es cero, se elige una semilla al azar en el inicio de Python y se ignora :c:member:`~PyConfig.hash_seed`.

source: Set by the :envvar:`PYTHONHASHSEED` environment variable.
es: Establecido por la variable de entorno :envvar:`PYTHONHASHSEED`.

source: Default *use_hash_seed* value: ``-1`` in Python mode, ``0`` in isolated mode.
es: Valor predeterminado de *use_hash_seed*: ``-1`` en modo Python, ``0`` en modo aislado.

source: Python home directory.
es: Directorio de inicio de Python.

source: If :c:func:`Py_SetPythonHome` has been called, use its argument if it is not ``NULL``.
es: Si se ha llamado a :c:func:`Py_SetPythonHome`, use su argumento si no es ``NULL``.

source: Set by the :envvar:`PYTHONHOME` environment variable.
es: Establecido por la variable de entorno :envvar:`PYTHONHOME`.

source: Part of the :ref:`Python Path Configuration <init-path-config>` input.
es: Parte de la entrada :ref:`Python Path Configuration <init-path-config>`.

source: If non-zero, profile import time.
es: Si no es cero, el tiempo de importación del perfil.

source: Set the ``1`` by the :option:`-X importtime <-X>` option and the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable.
es: Configure el ``1`` mediante la opción :option:`-X importtime <-X>` y la variable de entorno :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Enter interactive mode after executing a script or a command.
es: Ingresa al modo interactivo después de ejecutar un script o un comando.

source: If greater than 0, enable inspect: when a script is passed as first argument or the -c option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal.
es: Si es mayor que 0, habilite inspeccionar: cuando se pasa una secuencia de comandos como primer argumento o se usa la opción -c, ingrese al modo interactivo después de ejecutar la secuencia de comandos o el comando, incluso cuando :data:`sys.stdin` no parezca ser una terminal.

source: Incremented by the :option:`-i` command line option. Set to ``1`` if the :envvar:`PYTHONINSPECT` environment variable is non-empty.
es: Incrementado por la opción de línea de comando :option:`-i`. Establecido en ``1`` si la variable de entorno :envvar:`PYTHONINSPECT` no está vacía.

source: Install Python signal handlers?
es: ¿Instalar controladores de señales de Python?

source: Default: ``1`` in Python mode, ``0`` in isolated mode.
es: Por defecto: ``1`` en modo Python, ``0`` en modo aislado.

source: If greater than 0, enable the interactive mode (REPL).
es: Si es mayor que 0, habilita el modo interactivo (REPL).

source: Incremented by the :option:`-i` command line option.
es: Incrementado por la opción de línea de comando :option:`-i`.

source: If greater than 0, enable isolated mode:
es: Si es mayor que 0, habilite el modo aislado:

source: :data:`sys.path` contains neither the script's directory (computed from ``argv[0]`` or the current directory) nor the user's site-packages directory.
es: :data:`sys.path` no contiene ni el directorio del script (calculado a partir de ``argv[0]`` o el directorio actual) ni el directorio de paquetes del sitio del usuario.

source: Python REPL doesn't import :mod:`readline` nor enable default readline configuration on interactive prompts.
es: Python REPL no importa :mod:`readline` ni habilita la configuración predeterminada de readline en mensajes interactivos.

source: Set :c:member:`~PyConfig.use_environment` and :c:member:`~PyConfig.user_site_directory` to 0.
es: Establece :c:member:`~PyConfig.use_environment` y :c:member:`~PyConfig.user_site_directory` en 0.

source: See also :c:member:`PyPreConfig.isolated`.
es: Ver también :c:member:`PyPreConfig.isolated`.

source: If non-zero, use :class:`io.FileIO` instead of :class:`io.WindowsConsoleIO` for :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr`.
es: Si no es cero, usa :class:`io.FileIO` en lugar de :class:`io.WindowsConsoleIO` para :data:`sys.stdin`, :data:`sys.stdout` y :data:`sys.stderr`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSSTDIO` environment variable is set to a non-empty string.
es: Establece en ``1`` si la variable de entorno :envvar:`PYTHONLEGACYWINDOWSSTDIO` está establecida en una cadena no vacía.

source: See also the :pep:`528` (Change Windows console encoding to UTF-8).
es: Consulte también :pep:`528` (Cambiar la codificación de la consola de Windows a UTF-8).

source: If non-zero, dump statistics on :ref:`Python pymalloc memory allocator <pymalloc>` at exit.
es: Si no es cero, volcar las estadísticas en :ref:`Asignador de memoria Python pymalloc <pymalloc>` en la salida.

source: Set to ``1`` by the :envvar:`PYTHONMALLOCSTATS` environment variable.
es: Establecido en ``1`` por la variable de entorno :envvar:`PYTHONMALLOCSTATS`.

source: The option is ignored if Python is :option:`configured using the --without-pymalloc option <--without-pymalloc>`.
es: La opción se ignora si Python es :option:`configured using the --without-pymalloc option <--without-pymalloc>`.

source: Platform library directory name: :data:`sys.platlibdir`.
es: Nombre del directorio de la biblioteca de la plataforma: :data:`sys.platlibdir`.

source: Set by the :envvar:`PYTHONPLATLIBDIR` environment variable.
es: Establecido por la variable de entorno :envvar:`PYTHONPLATLIBDIR`.

source: Default: value of the ``PLATLIBDIR`` macro which is set by the :option:`configure --with-platlibdir option <--with-platlibdir>` (default: ``"lib"``).
es: Predeterminado: valor de la macro ``PLATLIBDIR`` que establece el :option:`configure --with-platlibdir option <--with-platlibdir>` (predeterminado: ``"lib"``).

source: Module search paths (:data:`sys.path`) as a string separated by ``DELIM`` (:data:`os.path.pathsep`).
es: Rutas de búsqueda de módulos (:data:`sys.path`) como una cadena separada por ``DELIM`` (:data:`os.path.pathsep`).

source: Set by the :envvar:`PYTHONPATH` environment variable.
es: Establecido por la variable de entorno :envvar:`PYTHONPATH`.

source: Module search paths: :data:`sys.path`.
es: Rutas de búsqueda del módulo: :data:`sys.path`.

source: If :c:member:`~PyConfig.module_search_paths_set` is equal to 0, the function calculating the :ref:`Python Path Configuration <init-path-config>` overrides the :c:member:`~PyConfig.module_search_paths` and sets :c:member:`~PyConfig.module_search_paths_set` to ``1``.
es: Si :c:member:`~PyConfig.module_search_paths_set` es igual a 0, la función que calcula :ref:`Python Path Configuration <init-path-config>` anula :c:member:`~PyConfig.module_search_paths` y establece :c:member:`~PyConfig.module_search_paths_set` en ``1``.

source: Default: empty list (``module_search_paths``) and ``0`` (``module_search_paths_set``).
es: Por defecto: lista vacía (``module_search_paths``) y ``0`` (``module_search_paths_set``).

source: Compilation optimization level:
es: Nivel de optimización de compilación:

source: ``0``: Peephole optimizer, set ``__debug__`` to ``True``.
es: ``0``: Optimizador de mirilla, configure ``__debug__`` en ``True``.

source: ``1``: Level 0, remove assertions, set ``__debug__`` to ``False``.
es: ``1``: Level 0, elimina las aserciones, establece ``__debug__`` en ``False``.

source: ``2``: Level 1, strip docstrings.
es: ``2``: Level 1, elimina docstrings.

source: Incremented by the :option:`-O` command line option. Set to the :envvar:`PYTHONOPTIMIZE` environment variable value.
es: Incrementado por la opción de línea de comando :option:`-O`. Establecido en el valor de la variable de entorno :envvar:`PYTHONOPTIMIZE`.

source: The list of the original command line arguments passed to the Python executable: :data:`sys.orig_argv`.
es: La lista de los argumentos originales de la línea de comandos pasados ​​al ejecutable de Python: :data:`sys.orig_argv`.

source: If :c:member:`~PyConfig.orig_argv` list is empty and :c:member:`~PyConfig.argv` is not a list only containing an empty string, :c:func:`PyConfig_Read` copies :c:member:`~PyConfig.argv` into :c:member:`~PyConfig.orig_argv` before modifying :c:member:`~PyConfig.argv` (if :c:member:`~PyConfig.parse_argv` is non-zero).
es: Si la lista :c:member:`~PyConfig.orig_argv` está vacía y :c:member:`~PyConfig.argv` no es una lista que solo contiene una cadena vacía, :c:func:`PyConfig_Read` copia :c:member:`~PyConfig.argv` en :c:member:`~PyConfig.orig_argv` antes de modificar :c:member:`~PyConfig.argv` (si :c:member:`~PyConfig.parse_argv` no es cero).

source: See also the :c:member:`~PyConfig.argv` member and the :c:func:`Py_GetArgcArgv` function.
es: Consulte también el miembro :c:member:`~PyConfig.argv` y la función :c:func:`Py_GetArgcArgv`.

source: Default: empty list.
es: Predeterminado: lista vacía.

source: Parse command line arguments?
es: ¿Analizar los argumentos de la línea de comando?

source: If equals to ``1``, parse :c:member:`~PyConfig.argv` the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and strip Python arguments from :c:member:`~PyConfig.argv`.
es: Si es igual a ``1``, analice :c:member:`~PyConfig.argv` de la misma forma que Python normal analiza :ref:`command line arguments <using-on-cmdline>` y elimine los argumentos de Python de :c:member:`~PyConfig.argv`.

source: The :c:member:`PyConfig.argv` arguments are now only parsed if :c:member:`PyConfig.parse_argv` equals to ``1``.
es: Los argumentos :c:member:`PyConfig.argv` ahora solo se analizan si :c:member:`PyConfig.parse_argv` es igual a ``1``.

source: Parser debug mode. If greater than 0, turn on parser debugging output (for expert only, depending on compilation options).
es: Modo de depuración del analizador. Si es mayor que 0, active la salida de depuración del analizador (solo para expertos, según las opciones de compilación).

source: Incremented by the :option:`-d` command line option. Set to the :envvar:`PYTHONDEBUG` environment variable value.
es: Incrementado por la opción de línea de comando :option:`-d`. Establecido en el valor de la variable de entorno :envvar:`PYTHONDEBUG`.

source: On Unix, if non-zero, calculating the :ref:`Python Path Configuration <init-path-config>` can log warnings into ``stderr``. If equals to 0, suppress these warnings.
es: En Unix, si es distinto de cero, el cálculo de :ref:`Python Path Configuration <init-path-config>` puede registrar advertencias en ``stderr``. Si es igual a 0, suprima estas advertencias.

source: It has no effect on Windows.
es: No tiene ningún efecto en Windows.

source: The site-specific directory prefix where the platform independent Python files are installed: :data:`sys.prefix`.
es: El prefijo de directorio específico del sitio donde se instalan los archivos Python independientes de la plataforma: :data:`sys.prefix`.

source: Program name used to initialize :c:member:`~PyConfig.executable` and in early error messages during Python initialization.
es: Nombre del programa utilizado para inicializar :c:member:`~PyConfig.executable` y en los primeros mensajes de error durante la inicialización de Python.

source: If :func:`Py_SetProgramName` has been called, use its argument.
es: Si se ha llamado a :func:`Py_SetProgramName`, use su argumento.

source: On macOS, use :envvar:`PYTHONEXECUTABLE` environment variable if set.
es: En macOS, use la variable de entorno :envvar:`PYTHONEXECUTABLE` si está configurada.

source: If the ``WITH_NEXT_FRAMEWORK`` macro is defined, use :envvar:`__PYVENV_LAUNCHER__` environment variable if set.
es: Si se define la macro ``WITH_NEXT_FRAMEWORK``, utilice la variable de entorno :envvar:`__PYVENV_LAUNCHER__` si está configurada.

source: Use ``argv[0]`` of :c:member:`~PyConfig.argv` if available and non-empty.
es: Utilice ``argv[0]`` de :c:member:`~PyConfig.argv` si está disponible y no está vacío.

source: Otherwise, use ``L"python"`` on Windows, or ``L"python3"`` on other platforms.
es: De lo contrario, utilice ``L"python"`` en Windows o ``L"python3"`` en otras plataformas.

source: Directory where cached ``.pyc`` files are written: :data:`sys.pycache_prefix`.
es: Directorio donde se escriben los archivos ``.pyc`` almacenados en caché: :data:`sys.pycache_prefix`.

source: Set by the :option:`-X pycache_prefix=PATH <-X>` command line option and the :envvar:`PYTHONPYCACHEPREFIX` environment variable.
es: Establecido por la opción de línea de comando :option:`-X pycache_prefix=PATH <-X>` y la variable de entorno :envvar:`PYTHONPYCACHEPREFIX`.

source: If ``NULL``, :data:`sys.pycache_prefix` is set to ``None``.
es: Si ``NULL``, :data:`sys.pycache_prefix` es establecido a ``None``.

source: Quiet mode. If greater than 0, don't display the copyright and version at Python startup in interactive mode.
es: Modo silencioso. Si es mayor que 0, no muestre los derechos de autor y la versión al inicio de Python en modo interactivo.

source: Incremented by the :option:`-q` command line option.
es: Incrementado por la opción de línea de comando :option:`-q`.

source: Value of the :option:`-c` command line option.
es: Valor de la opción de línea de comando :option:`-c`.

source: Used by :c:func:`Py_RunMain`.
es: Usado por :c:func:`Py_RunMain`.

source: Filename passed on the command line: trailing command line argument without :option:`-c` or :option:`-m`.
es: Nombre de archivo pasado en la línea de comando: argumento de línea de comando final sin :option:`-c` o :option:`-m`.

source: For example, it is set to ``script.py`` by the ``python3 script.py arg`` command.
es: Por ejemplo, el comando ``python3 script.py arg`` lo establece en ``script.py``.

source: Value of the :option:`-m` command line option.
es: Valor de la opción de línea de comando :option:`-m`.

source: Show total reference count at exit?
es: ¿Mostrar el recuento de referencia total en la salida?

source: Set to 1 by :option:`-X showrefcount <-X>` command line option.
es: Establecido en 1 por la opción de línea de comandos :option:`-X showrefcount <-X>`.

source: Need a :ref:`debug build of Python <debug-build>` (the ``Py_REF_DEBUG`` macro must be defined).
es: Necesita un :ref:`debug build of Python <debug-build>` (se debe definir la macro ``Py_REF_DEBUG``).

source: Import the :mod:`site` module at startup?
es: ¿Importar el módulo :mod:`site` al inicio?

source: If equal to zero, disable the import of the module site and the site-dependent manipulations of :data:`sys.path` that it entails.
es: Si es igual a cero, desactive la importación del sitio del módulo y las manipulaciones dependientes del sitio de :data:`sys.path` que conlleva.

source: Also disable these manipulations if the :mod:`site` module is explicitly imported later (call :func:`site.main` if you want them to be triggered).
es: También deshabilite estas manipulaciones si el módulo :mod:`site` se importa explícitamente más tarde (llame a :func:`site.main` si desea que se activen).

source: Set to ``0`` by the :option:`-S` command line option.
es: Establecido en ``0`` mediante la opción de línea de comando :option:`-S`.

source: :data:`sys.flags.no_site` is set to the inverted value of :c:member:`~PyConfig.site_import`.
es: :data:`sys.flags.no_site` se establece en el valor invertido de :c:member:`~PyConfig.site_import`.

source: If non-zero, skip the first line of the :c:member:`PyConfig.run_filename` source.
es: Si no es cero, omita la primera línea de la fuente :c:member:`PyConfig.run_filename`.

source: It allows the usage of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
es: Permite el uso de formas de ``#!cmd`` que no son Unix. Esto está destinado únicamente a un truco específico de DOS.

source: Set to ``1`` by the :option:`-x` command line option.
es: Establecido en ``1`` mediante la opción de línea de comando :option:`-x`.
