Repository: python/python-docs-es
Catalog: c-api/long.po
Languages: es

source: Integer Objects
es: Objetos Enteros

source: All integers are implemented as "long" integer objects of arbitrary size.
es: Todos los enteros se implementan como objetos enteros "largos" (*long*) de tamaño arbitrario.

source: On error, most ``PyLong_As*`` APIs return ``(return type)-1`` which cannot be distinguished from a number. Use :c:func:`PyErr_Occurred` to disambiguate.
es: En caso de error, la mayoría de las API ``PyLong_As*`` retornan ``(tipo de retorno) -1`` que no se puede distinguir de un número. Use :c:func:`PyErr_Occurred` para desambiguar.

source: This subtype of :c:type:`PyObject` represents a Python integer object.
es: Este subtipo de :c:type:`PyObject` representa un objeto entero de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python integer type. This is the same object as :class:`int` in the Python layer.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo entero de Python. Este es el mismo objeto que :class:`int` en la capa de Python.

source: Return a new :c:type:`PyLongObject` object from *v*, or ``NULL`` on failure.
es: Retorna un objeto :c:type:`PyLongObject` nuevo desde *v*, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`unsigned long`, or ``NULL`` on failure.
es: Retorna un objeto :c:type:`PyLongObject` nuevo desde un C :c:type:`unsigned long`, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`Py_ssize_t`, or ``NULL`` on failure.
es: Retorna un objeto :c:type:`PyLongObject` nuevo desde un C :c:type:`Py_ssize_t`, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`size_t`, or ``NULL`` on failure.
es: Retorna un objeto :c:type:`PyLongObject` nuevo desde un C :c:type:`size_t`, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`long long`, or ``NULL`` on failure.
es: Retorna un objeto :c:type:`PyLongObject` nuevo desde un C :c:type:`long long`, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`unsigned long long`, or ``NULL`` on failure.
es: Retorna un objeto :c:type:`PyLongObject` nuevo desde un C :c:type:`unsigned long long`, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` object from the integer part of *v*, or ``NULL`` on failure.
es: Retorna un nuevo objeto :c:type:`PyLongObject` de la parte entera de *v*, o ``NULL`` en caso de error.

source: Return a new :c:type:`PyLongObject` based on the string value in *str*, which is interpreted according to the radix in *base*. If *pend* is non-``NULL``, *\*pend* will point to the first character in *str* which follows the representation of the number. If *base* is ``0``, *str* is interpreted using the :ref:`integers` definition; in this case, leading zeros in a non-zero decimal number raises a :exc:`ValueError`. If *base* is not ``0``, it must be between ``2`` and ``36``, inclusive. Leading spaces and single underscores after a base specifier and between digits are ignored. If there are no digits, :exc:`ValueError` will be raised.
es: Retorna un nuevo :c:type:`PyLongObject` basado en el valor de cadena de caracteres en *str*, que se interpreta de acuerdo con la raíz en *base*. Si *pend* no es ``NULL``, *\* pend* apuntará al primer carácter en *str* que sigue a la representación del número. Si *base* es ``0``, *str* se interpreta utilizando la definición :ref:`integers`; en este caso, los ceros a la izquierda en un número decimal distinto de cero lanzan un :exc:`ValueError`. Si *base* no es ``0``, debe estar entre ``2`` y ``36``, inclusive. Se ignoran los espacios iniciales y los guiones bajos individuales después de un especificador base y entre dígitos. Si no hay dígitos, se lanzará :exc:`ValueError`.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyLong_FromUnicodeObject`.
es: Parte de la API de viejo estilo :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyLong_FromUnicodeObject`.

source: Create a Python integer from the pointer *p*. The pointer value can be retrieved from the resulting value using :c:func:`PyLong_AsVoidPtr`.
es: Crea un entero de Python desde el puntero *p*. El valor del puntero se puede recuperar del valor resultante usando :c:func:`PyLong_AsVoidPtr`.

source: Return a C :c:type:`long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`__index__` or :meth:`__int__` method (if present) to convert it to a :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, primero llama a su método :meth:`__index__` o :meth:`__int__` (si está presente) para convertirlo en un :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *obj* is out of range for a :c:type:`long`.
es: Lanza :exc:`OverflowError` si el valor de *obj* está fuera de rango para un :c:type:`long`.

source: Returns ``-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``-1`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: Use :meth:`__index__` if available.
es: Use :meth:`__index__` si está disponible.

source: Using :meth:`__int__` is deprecated.
es: Usar :meth:`__int__` está deprecado.

source: If the value of *obj* is greater than :const:`LONG_MAX` or less than :const:`LONG_MIN`, set *\*overflow* to ``1`` or ``-1``, respectively, and return ``-1``; otherwise, set *\*overflow* to ``0``. If any other exception occurs set *\*overflow* to ``0`` and return ``-1`` as usual.
es: Si el valor de *obj* es mayor que :const:`LONG_MAX` o menor que :const:`LONG_MIN`, establece *\*overflow * en ``1`` o ``-1``, respectivamente, y retorna ``-1``; de lo contrario, establece *\*overflow* en ``0``. Si se produce alguna otra excepción, configura *\*overflow* en ``0`` y retorna ``-1`` como de costumbre.

source: Return a C :c:type:`long long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`__index__` or :meth:`__int__` method (if present) to convert it to a :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`long long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, primero llama a su método :meth:`__index__` o :meth:`__int__` (si está presente) para convertirlo en un :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *obj* is out of range for a :c:type:`long long`.
es: Lanza :exc:`OverflowError` si el valor de *obj* está fuera de rango para un :c:type:`long long`.

source: Return a C :c:type:`Py_ssize_t` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`Py_ssize_t` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`Py_ssize_t`.
es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`Py_ssize_t`.

source: Return a C :c:type:`unsigned long` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`unsigned long` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`unsigned long`.
es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`unsigned long`.

source: Returns ``(unsigned long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``(unsigned long)-1`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: Return a C :c:type:`size_t` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`size_t` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`size_t`.
es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`size_t`.

source: Returns ``(size_t)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``(size_t) -1`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: Return a C :c:type:`unsigned long long` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`unsigned long long` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for an :c:type:`unsigned long long`.
es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`unsigned long long`.

source: Returns ``(unsigned long long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``(unsigned long long) -1`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: A negative *pylong* now raises :exc:`OverflowError`, not :exc:`TypeError`.
es: Ahora un *pylong* negativo lanza un :exc:`OverflowError`, no :exc:`TypeError`.

source: Return a C :c:type:`unsigned long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`__index__` or :meth:`__int__` method (if present) to convert it to a :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`unsigned long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, primero llama a su método :meth:`__index__` o :meth:`__int__` (si está presente) para convertirlo en un :c:type:`PyLongObject`.

source: If the value of *obj* is out of range for an :c:type:`unsigned long`, return the reduction of that value modulo ``ULONG_MAX + 1``.
es: Si el valor de *obj* está fuera del rango para :c:type:`unsigned long`, retorna la reducción de ese valor módulo ``ULONG_MAX + 1``.

source: Returns ``(unsigned long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``(unsigned long)-1`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: Return a C :c:type:`unsigned long long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`__index__` or :meth:`__int__` method (if present) to convert it to a :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`unsigned long long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, primero llama a su método :meth:`__index__` o :meth:`__int__` (si está presente) para convertirlo en un :c:type:`PyLongObject`.

source: Returns ``(unsigned long long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``(unsigned long long) -1`` por error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: Return a C :c:type:`double` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es: Retorna una representación de C :c:type:`double` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`double`.
es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`double`.

source: Returns ``-1.0`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``-1.0`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.

source: Convert a Python integer *pylong* to a C :c:type:`void` pointer. If *pylong* cannot be converted, an :exc:`OverflowError` will be raised. This is only assured to produce a usable :c:type:`void` pointer for values created with :c:func:`PyLong_FromVoidPtr`.
es: Convierte un entero Python *pylong* en un puntero C :c:type:`void`. Si *pylong* no se puede convertir, se generará un :exc:`OverflowError`. Esto solo se garantiza para producir un puntero utilizable :c:type:`void` para valores creados con :c:func:`PyLong_FromVoidPtr`.

source: Returns ``NULL`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es: Retorna ``NULL`` en caso de error. Use :c:func:`PyErr_Occurred` para desambiguar.
