Repository: python/python-docs-es
Catalog: c-api/mapping.po
Languages: es

source: Mapping Protocol
es: Protocolo de mapeo

source: See also :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` and :c:func:`PyObject_DelItem`.
es: Consulte también :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` y :c:func:`PyObject_DelItem`.

source: Return ``1`` if the object provides mapping protocol or supports slicing, and ``0`` otherwise. Note that it returns ``1`` for Python classes with a :meth:`__getitem__` method since in general case it is impossible to determine what type of keys it supports. This function always succeeds.
es: Retorna ``1`` si el objeto proporciona el protocolo de mapeo o admite rebanado (*slicing*), y ``0`` de lo contrario. Tenga en cuenta que retorna ``1`` para las clases de Python con un método :meth:`__getitem__` ya que, en general, es imposible determinar qué tipo de claves admite. Esta función siempre tiene éxito.

source: Returns the number of keys in object *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
es: Retorna el número de claves en el objeto *o* en caso de éxito, y ``-1`` en caso de error. Esto es equivalente a la expresión de Python ``len(o)``.

source: Return element of *o* corresponding to the string *key* or ``NULL`` on failure. This is the equivalent of the Python expression ``o[key]``. See also :c:func:`PyObject_GetItem`.
es: Retorna el elemento de *o* correspondiente a la cadena de caracteres *key* o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o[key]``. Ver también :c:func:`PyObject_GetItem`.

source: Map the string *key* to the value *v* in object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``o[key] = v``. See also :c:func:`PyObject_SetItem`. This function *does not* steal a reference to *v*.
es: Asigna la cadena de caracteres *key* al valor *v* en el objeto *o*. Retorna ``-1`` en caso de falla. Este es el equivalente de la declaración de Python ``o[key] = v``. Ver también :c:func:`PyObject_SetItem`. Esta función *no* roba una referencia a *v*.

source: Remove the mapping for the object *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``. This is an alias of :c:func:`PyObject_DelItem`.
es: Elimina la asignación para el objeto *key* del objeto *o*. Retorna ``-1`` en caso de falla. Esto es equivalente a la declaración de Python ``del o[key]``. Este es un alias de :c:func:`PyObject_DelItem`.

source: Remove the mapping for the string *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``.
es: Elimina la asignación de la cadena de caracteres *key* del objeto *o*. Retorna ``-1`` en caso de falla. Esto es equivalente a la declaración de Python ``del o[key]``.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. This function always succeeds.
es: Retorna ``1`` si el objeto de mapeo tiene la clave *key* y ``0`` de lo contrario. Esto es equivalente a la expresión de Python ``key in o``. Esta función siempre tiene éxito.

source: Note that exceptions which occur while calling the :meth:`__getitem__` method will get suppressed. To get error reporting use :c:func:`PyObject_GetItem()` instead.
es: Tenga en cuenta que las excepciones que se producen al llamar al método :meth:`__getitem__` se suprimirán. Para obtener informes de errores, utilice :c:func:`PyObject_GetItem()` en su lugar.

source: Note that exceptions which occur while calling the :meth:`__getitem__` method and creating a temporary string object will get suppressed. To get error reporting use :c:func:`PyMapping_GetItemString()` instead.
es: Tenga en cuenta que las excepciones que se producen al llamar al método :meth:`__getitem__` y al crear un objeto de cadena de caracteres temporal se suprimirán. Para obtener informes de errores, utilice :c:func:`PyMapping_GetItemString()` en su lugar.

source: On success, return a list of the keys in object *o*. On failure, return ``NULL``.
es: En caso de éxito, retorna una lista de las claves en el objeto *o*. En caso de fallo, retorna ``NULL``.

source: Previously, the function returned a list or a tuple.
es: Anteriormente, la función retornaba una lista o una tupla.

source: On success, return a list of the values in object *o*. On failure, return ``NULL``.
es: En caso de éxito, retorna una lista de los valores en el objeto *o*. En caso de fallo, retorna ``NULL``.

source: On success, return a list of the items in object *o*, where each item is a tuple containing a key-value pair. On failure, return ``NULL``.
es: En caso de éxito, retorna una lista de los elementos en el objeto *o*, donde cada elemento es una tupla que contiene un par clave-valor (*key-value*). En caso de fallo, retorna ``NULL``.
