Repository: python/python-docs-es
Catalog: c-api/marshal.po
Languages: es

source: Data marshalling support
es: Soporte de empaquetado (*marshalling*) de datos

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
es: Estas rutinas permiten que el código C funcione con objetos serializados utilizando el mismo formato de datos que el módulo :mod:`marshal`. Hay funciones para escribir datos en el formato de serialización y funciones adicionales que se pueden usar para volver a leer los datos. Los archivos utilizados para almacenar datos ordenados deben abrirse en modo binario.

source: Numeric values are stored with the least significant byte first.
es: Los valores numéricos se almacenan con el byte menos significativo primero.

source: The module supports two versions of the data format: version 0 is the historical version, version 1 shares interned strings in the file, and upon unmarshalling. Version 2 uses a binary format for floating point numbers. ``Py_MARSHAL_VERSION`` indicates the current file format (currently 2).
es: El módulo admite dos versiones del formato de datos: la versión 0 es la versión histórica, la versión 1 comparte cadenas de caracteres internas en el archivo y al desempaquetar (*unmarshalling*). La versión 2 usa un formato binario para números de punto flotante. ``Py_MARSHAL_VERSION`` indica el formato de archivo actual (actualmente 2).

source: Marshal a :c:type:`long` integer, *value*, to *file*. This will only write the least-significant 32 bits of *value*; regardless of the size of the native :c:type:`long` type. *version* indicates the file format.
es: Empaqueta (*marshal*) un entero :c:type:`long`, *value*, a un archivo *file*. Esto solo escribirá los 32 bits menos significativos de *value*; independientemente del tamaño del tipo nativo :c:type:`long`. *version* indica el formato del archivo.

source: Marshal a Python object, *value*, to *file*. *version* indicates the file format.
es: Empaqueta (*marshal*) un objeto Python, *value*, a un archivo *file*. *version* indica el formato del archivo.

source: Return a bytes object containing the marshalled representation of *value*. *version* indicates the file format.
es: Retorna un objeto de bytes que contiene la representación empaquetada (*marshalled*) de *value*. *version* indica el formato del archivo.

source: The following functions allow marshalled values to be read back in.
es: Las siguientes funciones permiten volver a leer los valores empaquetados (*marshalled*).

source: Return a C :c:type:`long` from the data stream in a :c:type:`FILE\*` opened for reading. Only a 32-bit value can be read in using this function, regardless of the native size of :c:type:`long`.
es: Retorna un C :c:type:`long` del flujo de datos en un :c:type:`FILE\*` abierto para lectura. Solo se puede leer un valor de 32 bits con esta función, independientemente del tamaño nativo de :c:type:`long`.

source: On error, sets the appropriate exception (:exc:`EOFError`) and returns ``-1``.
es: En caso de error, establece la excepción apropiada (:exc:`EOFError`) y retorna ``-1``.

source: Return a C :c:type:`short` from the data stream in a :c:type:`FILE\*` opened for reading. Only a 16-bit value can be read in using this function, regardless of the native size of :c:type:`short`.
es: Retorna un C :c:type:`short` desde el flujo de datos en un :c:type:`FILE\*` abierto para lectura. Solo se puede leer un valor de 16 bits con esta función, independientemente del tamaño nativo de :c:type:`short`.

source: Return a Python object from the data stream in a :c:type:`FILE\*` opened for reading.
es: Retorna un objeto Python del flujo de datos en un :c:type:`FILE\*` abierto para lectura.

source: On error, sets the appropriate exception (:exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`) and returns ``NULL``.
es: En caso de error, establece la excepción apropiada (:exc:`EOFError`, :exc:`ValueError` o :exc:`TypeError`) y retorna ``NULL``.

source: Return a Python object from the data stream in a :c:type:`FILE\*` opened for reading. Unlike :c:func:`PyMarshal_ReadObjectFromFile`, this function assumes that no further objects will be read from the file, allowing it to aggressively load file data into memory so that the de-serialization can operate from data in memory rather than reading a byte at a time from the file. Only use these variant if you are certain that you won't be reading anything else from the file.
es: Retorna un objeto Python del flujo de datos en un :c:type:`FILE\*` abierto para lectura. A diferencia de :c:func:`PyMarshal_ReadObjectFromFile`, esta función asume que no se leerán más objetos del archivo, lo que le permite cargar agresivamente los datos del archivo en la memoria para que la deserialización pueda operar desde los datos en la memoria en lugar de leer un byte a la vez desde el archivo. Solo use esta variante si está seguro de que no leerá nada más del archivo.

source: Return a Python object from the data stream in a byte buffer containing *len* bytes pointed to by *data*.
es: Retorna un objeto Python del flujo de datos en un búfer de bytes que contiene *len* bytes a los que apunta *data*.
