Repository: python/python-docs-es
Catalog: c-api/memory.po
Languages: es

source: Memory Management
es: Gestión de la memoria

source: Overview
es: Visión general

source: Memory management in Python involves a private heap containing all Python objects and data structures. The management of this private heap is ensured internally by the *Python memory manager*. The Python memory manager has different components which deal with various dynamic storage management aspects, like sharing, segmentation, preallocation or caching.
es: La gestión de memoria en Python implica un montón privado que contiene todos los objetos de Python y estructuras de datos. El *administrador de memoria de Python* garantiza internamente la gestión de este montón privado. El administrador de memoria de Python tiene diferentes componentes que se ocupan de varios aspectos de la gestión dinámica del almacenamiento, como compartir, segmentación, asignación previa o almacenamiento en caché.

source: At the lowest level, a raw memory allocator ensures that there is enough room in the private heap for storing all Python-related data by interacting with the memory manager of the operating system. On top of the raw memory allocator, several object-specific allocators operate on the same heap and implement distinct memory management policies adapted to the peculiarities of every object type. For example, integer objects are managed differently within the heap than strings, tuples or dictionaries because integers imply different storage requirements and speed/space tradeoffs. The Python memory manager thus delegates some of the work to the object-specific allocators, but ensures that the latter operate within the bounds of the private heap.
es: En el nivel más bajo, un asignador de memoria sin procesar asegura que haya suficiente espacio en el montón privado para almacenar todos los datos relacionados con Python al interactuar con el administrador de memoria del sistema operativo. Además del asignador de memoria sin procesar, varios asignadores específicos de objeto operan en el mismo montón e implementan políticas de administración de memoria distintas adaptadas a las peculiaridades de cada tipo de objeto. Por ejemplo, los objetos enteros se administran de manera diferente dentro del montón que las cadenas, tuplas o diccionarios porque los enteros implican diferentes requisitos de almacenamiento y compensaciones de velocidad / espacio. El administrador de memoria de Python delega parte del trabajo a los asignadores específicos de objeto, pero asegura que este último opere dentro de los límites del montón privado.

source: It is important to understand that the management of the Python heap is performed by the interpreter itself and that the user has no control over it, even if they regularly manipulate object pointers to memory blocks inside that heap. The allocation of heap space for Python objects and other internal buffers is performed on demand by the Python memory manager through the Python/C API functions listed in this document.
es: Es importante comprender que la gestión del montón de Python la realiza el propio intérprete y que el usuario no tiene control sobre él, incluso si manipulan regularmente punteros de objetos a bloques de memoria dentro de ese montón. El administrador de memoria de Python realiza la asignación de espacio de almacenamiento dinámico para los objetos de Python y otros búferes internos a pedido a través de las funciones de API de Python/C enumeradas en este documento.

source: To avoid memory corruption, extension writers should never try to operate on Python objects with the functions exported by the C library: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`. This will result in mixed calls between the C allocator and the Python memory manager with fatal consequences, because they implement different algorithms and operate on different heaps. However, one may safely allocate and release memory blocks with the C library allocator for individual purposes, as shown in the following example::
es: Para evitar daños en la memoria, los escritores de extensiones nunca deberían intentar operar en objetos Python con las funciones exportadas por la biblioteca C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` y :c:func:`free`. Esto dará como resultado llamadas mixtas entre el asignador de C y el administrador de memoria de Python con consecuencias fatales, ya que implementan diferentes algoritmos y operan en diferentes montones. Sin embargo, uno puede asignar y liberar de forma segura bloques de memoria con el asignador de la biblioteca C para fines individuales, como se muestra en el siguiente ejemplo:

source: In this example, the memory request for the I/O buffer is handled by the C library allocator. The Python memory manager is involved only in the allocation of the bytes object returned as a result.
es: En este ejemplo, la solicitud de memoria para el búfer de E/S es manejada por el asignador de la biblioteca C. El administrador de memoria de Python solo participa en la asignación del objeto de bytes retornado como resultado.

source: In most situations, however, it is recommended to allocate memory from the Python heap specifically because the latter is under control of the Python memory manager. For example, this is required when the interpreter is extended with new object types written in C. Another reason for using the Python heap is the desire to *inform* the Python memory manager about the memory needs of the extension module. Even when the requested memory is used exclusively for internal, highly specific purposes, delegating all memory requests to the Python memory manager causes the interpreter to have a more accurate image of its memory footprint as a whole. Consequently, under certain circumstances, the Python memory manager may or may not trigger appropriate actions, like garbage collection, memory compaction or other preventive procedures. Note that by using the C library allocator as shown in the previous example, the allocated memory for the I/O buffer escapes completely the Python memory manager.
es: Sin embargo, en la mayoría de las situaciones, se recomienda asignar memoria del montón de Python específicamente porque este último está bajo el control del administrador de memoria de Python. Por ejemplo, esto es necesario cuando el intérprete se amplía con nuevos tipos de objetos escritos en C. Otra razón para usar el montón de Python es el deseo de *informar* al administrador de memoria de Python sobre las necesidades de memoria del módulo de extensión. Incluso cuando la memoria solicitada se usa exclusivamente para fines internos y altamente específicos, delegar todas las solicitudes de memoria al administrador de memoria de Python hace que el intérprete tenga una imagen más precisa de su huella de memoria en su conjunto. En consecuencia, bajo ciertas circunstancias, el administrador de memoria de Python puede o no desencadenar acciones apropiadas, como recolección de basura, compactación de memoria u otros procedimientos preventivos. Tenga en cuenta que al usar el asignador de la biblioteca C como se muestra en el ejemplo anterior, la memoria asignada para el búfer de E/S escapa completamente al administrador de memoria Python.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to configure the memory allocators used by Python.
es: La variable de entorno :envvar:`PYTHONMALLOC` puede usarse para configurar los asignadores de memoria utilizados por Python.

source: The :envvar:`PYTHONMALLOCSTATS` environment variable can be used to print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
es: La variable de entorno :envvar:`PYTHONMALLOCSTATS` se puede utilizar para imprimir estadísticas de :ref:`asignador de memoria pymalloc <pymalloc>` cada vez que se crea un nuevo escenario de objetos pymalloc, y en el apagado.

source: Allocator Domains
es: Dominios del asignador

source: All allocating functions belong to one of three different "domains" (see also :c:type:`PyMemAllocatorDomain`). These domains represent different allocation strategies and are optimized for different purposes. The specific details on how every domain allocates memory or what internal functions each domain calls is considered an implementation detail, but for debugging purposes a simplified table can be found at :ref:`here <default-memory-allocators>`. There is no hard requirement to use the memory returned by the allocation functions belonging to a given domain for only the purposes hinted by that domain (although this is the recommended practice). For example, one could use the memory returned by :c:func:`PyMem_RawMalloc` for allocating Python objects or the memory returned by :c:func:`PyObject_Malloc` for allocating memory for buffers.
es: Todas las funciones de asignación pertenecen a uno de los tres "dominios" diferentes (ver también :c:type:`PyMemAllocatorDomain`). Estos dominios representan diferentes estrategias de asignación y están optimizados para diferentes propósitos. Los detalles específicos sobre cómo cada dominio asigna memoria o qué funciones internas llama cada dominio se considera un detalle de implementación, pero para fines de depuración, se puede encontrar una tabla simplificada en :ref:`here <default-memory-allocators>`. No existe un requisito estricto para usar la memoria retornada por las funciones de asignación que pertenecen a un dominio dado solo para los propósitos sugeridos por ese dominio (aunque esta es la práctica recomendada). Por ejemplo, se podría usar la memoria retornada por :c:func:`PyMem_RawMalloc` para asignar objetos Python o la memoria retornada por :c:func:`PyObject_Malloc` para asignar memoria para búferes.

source: The three allocation domains are:
es: Los tres dominios de asignación son:

source: Raw domain: intended for allocating memory for general-purpose memory buffers where the allocation *must* go to the system allocator or where the allocator can operate without the :term:`GIL`. The memory is requested directly to the system.
es: Dominio sin formato: destinado a asignar memoria para búferes de memoria de uso general donde la asignación *debe* ir al asignador del sistema o donde el asignador puede operar sin el :term:`GIL`. La memoria se solicita directamente al sistema.

source: "Mem" domain: intended for allocating memory for Python buffers and general-purpose memory buffers where the allocation must be performed with the :term:`GIL` held. The memory is taken from the Python private heap.
es: Dominio "Mem": destinado a asignar memoria para búferes de Python y búferes de memoria de propósito general donde la asignación debe realizarse con el :term:`GIL` retenido. La memoria se toma del montículo privado de Python.

source: Object domain: intended for allocating memory belonging to Python objects. The memory is taken from the Python private heap.
es: Dominio de objeto: destinado a asignar memoria perteneciente a objetos de Python. La memoria se toma del montículo privado de Python.

source: When freeing memory previously allocated by the allocating functions belonging to a given domain,the matching specific deallocating functions must be used. For example, :c:func:`PyMem_Free` must be used to free memory allocated using :c:func:`PyMem_Malloc`.
es: Cuando se libera memoria previamente asignada por las funciones de asignación que pertenecen a un dominio dado, se deben utilizar las funciones de desasignación específicas coincidentes. Por ejemplo, :c:func:`PyMem_Free` debe usarse para liberar memoria asignada usando :c:func:`PyMem_Malloc`.

source: Raw Memory Interface
es: Interfaz de memoria sin procesar

source: The following function sets are wrappers to the system allocator. These functions are thread-safe, the :term:`GIL <global interpreter lock>` does not need to be held.
es: Los siguientes conjuntos de funciones son envoltorios para el asignador del sistema. Estas funciones son seguras para subprocesos, no es necesario mantener el :term:`GIL <global interpreter lock>`.

source: Allocates *n* bytes and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails.
es: Asigna *n* bytes y retorna un puntero de tipo :c:expr:`void*` a la memoria asignada, o ``NULL`` si la solicitud falla.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawMalloc(1)`` had been called instead. The memory will not have been initialized in any way.
es: Solicitar cero bytes retorna un puntero distinto que no sea ``NULL`` si es posible, como si en su lugar se hubiera llamado a ``PyMem_RawMalloc(1)``. La memoria no se habrá inicializado de ninguna manera.

source: Allocates *nelem* elements each whose size in bytes is *elsize* and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails. The memory is initialized to zeros.
es: Asigna *nelem* elementos cada uno cuyo tamaño en bytes es *elsize* y retorna un puntero de tipo :c:expr:`void*` a la memoria asignada, o ``NULL`` si la solicitud falla. La memoria se inicializa a ceros.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawCalloc(1, 1)`` had been called instead.
es: Solicitar elementos cero o elementos de tamaño cero bytes retorna un puntero distinto ``NULL`` si es posible, como si en su lugar se hubiera llamado ``PyMem_RawCalloc(1, 1)``.

source: Resizes the memory block pointed to by *p* to *n* bytes. The contents will be unchanged to the minimum of the old and the new sizes.
es: Cambia el tamaño del bloque de memoria señalado por *p* a *n* bytes. Los contenidos no se modificarán al mínimo de los tamaños antiguo y nuevo.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_RawMalloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
es: Si *p* es ``NULL``, la llamada es equivalente a ``PyMem_RawMalloc(n)``; de lo contrario, si *n* es igual a cero, el bloque de memoria cambia de tamaño pero no se libera, y el puntero retornado no es ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`.
es: A menos que *p* sea ``NULL``, debe haber sido retornado por una llamada previa a :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` o :c:func:`PyMem_RawCalloc`.

source: If the request fails, :c:func:`PyMem_RawRealloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
es: Si la solicitud falla, :c:func:`PyMem_RawRealloc` retorna ``NULL`` y *p* sigue siendo un puntero válido al área de memoria anterior.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`. Otherwise, or if ``PyMem_RawFree(p)`` has been called before, undefined behavior occurs.
es: Libera el bloque de memoria al que apunta *p*, que debe haber sido retornado por una llamada anterior a :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` o :c:func:`PyMem_RawCalloc`. De lo contrario, o si se ha llamado antes a ``PyMem_RawFree(p)``, se produce un comportamiento indefinido.

source: If *p* is ``NULL``, no operation is performed.
es: Si *p* es ``NULL``, no se realiza ninguna operación.

source: Memory Interface
es: Interfaz de memoria

source: The following function sets, modeled after the ANSI C standard, but specifying behavior when requesting zero bytes, are available for allocating and releasing memory from the Python heap.
es: Los siguientes conjuntos de funciones, modelados según el estándar ANSI C, pero que especifican el comportamiento cuando se solicitan cero bytes, están disponibles para asignar y liberar memoria del montón de Python.

source: The :ref:`default memory allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
es: El :ref:`asignador de memoria predeterminado <default-memory-allocators>` usa el :ref:`asignador de memorya pymalloc <pymalloc>`.

source: The :term:`GIL <global interpreter lock>` must be held when using these functions.
es: El :term:`GIL <global interpreter lock>` debe mantenerse cuando se utilizan estas funciones.

source: The default allocator is now pymalloc instead of system :c:func:`malloc`.
es: El asignador predeterminado ahora es pymalloc en lugar del :c:func:`malloc` del sistema.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
es: Solicitar cero bytes retorna un puntero distinto que no sea ``NULL`` si es posible, como si en su lugar se hubiera llamado a ``PyMem_Malloc(1)``. La memoria no se habrá inicializado de ninguna manera.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Calloc(1, 1)`` had been called instead.
es: Solicitar elementos cero o elementos de tamaño cero bytes retorna un puntero distinto ``NULL`` si es posible, como si en su lugar se hubiera llamado ``PyMem_Calloc(1, 1)``.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
es: Si *p* es ``NULL``, la llamada es equivalente a ``PyMem_Malloc(n)``; de lo contrario, si *n* es igual a cero, el bloque de memoria cambia de tamaño pero no se libera, y el puntero retornado no es ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`.
es: A menos que *p* sea ``NULL``, debe haber sido retornado por una llamada previa a :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` o :c:func:`PyMem_Calloc`.

source: If the request fails, :c:func:`PyMem_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
es: Si la solicitud falla, :c:func:`PyMem_Realloc` retorna ``NULL`` y *p* sigue siendo un puntero válido al área de memoria anterior.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`. Otherwise, or if ``PyMem_Free(p)`` has been called before, undefined behavior occurs.
es: Libera el bloque de memoria señalado por *p*, que debe haber sido retornado por una llamada anterior a :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` o :c:func:`PyMem_Calloc`. De lo contrario, o si se ha llamado antes a ``PyMem_Free(p)``, se produce un comportamiento indefinido.

source: The following type-oriented macros are provided for convenience. Note that *TYPE* refers to any C type.
es: Las siguientes macros orientadas a tipos se proporcionan por conveniencia. Tenga en cuenta que *TYPE* se refiere a cualquier tipo de C.

source: Same as :c:func:`PyMem_Malloc`, but allocates ``(n * sizeof(TYPE))`` bytes of memory. Returns a pointer cast to :c:expr:`TYPE*`. The memory will not have been initialized in any way.
es: Igual que :c:func:`PyMem_Malloc`, pero asigna ``(n * sizeof(TYPE))`` bytes de memoria. Retorna una conversión de puntero a :c:expr:`TYPE*`. La memoria no se habrá inicializado de ninguna manera.

source: Same as :c:func:`PyMem_Realloc`, but the memory block is resized to ``(n * sizeof(TYPE))`` bytes. Returns a pointer cast to :c:expr:`TYPE*`. On return, *p* will be a pointer to the new memory area, or ``NULL`` in the event of failure.
es: Igual que :c:func:`PyMem_Realloc`, pero el bloque de memoria cambia de tamaño a ``(n * sizeof(TYPE))`` bytes. Retorna una conversión de puntero a :c:expr:`TYPE*`. Al retornar, *p* será un puntero a la nueva área de memoria, o ``NULL`` en caso de falla.

source: This is a C preprocessor macro; *p* is always reassigned. Save the original value of *p* to avoid losing memory when handling errors.
es: Esta es una macro de preprocesador C; *p* siempre se reasigna. Guarde el valor original de *p* para evitar perder memoria al manejar errores.

source: Same as :c:func:`PyMem_Free`.
es: La misma que :c:func:`PyMem_Free`.

source: In addition, the following macro sets are provided for calling the Python memory allocator directly, without involving the C API functions listed above. However, note that their use does not preserve binary compatibility across Python versions and is therefore deprecated in extension modules.
es: Además, se proporcionan los siguientes conjuntos de macros para llamar al asignador de memoria de Python directamente, sin involucrar las funciones de API de C mencionadas anteriormente. Sin embargo, tenga en cuenta que su uso no conserva la compatibilidad binaria entre las versiones de Python y, por lo tanto, está en desuso en los módulos de extensión.

source: Object allocators
es: Asignadores de objetos

source: There is no guarantee that the memory returned by these allocators can be successfully cast to a Python object when intercepting the allocating functions in this domain by the methods described in the :ref:`Customize Memory Allocators <customize-memory-allocators>` section.
es: No hay garantía de que la memoria retornada por estos asignadores se pueda convertir con éxito en un objeto Python al interceptar las funciones de asignación en este dominio mediante los métodos descritos en la sección :ref:`Personalizar Asignadores de Memoria <customize-memory-allocators>`.

source: The :ref:`default object allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
es: El :ref:`asignador predeterminado de objetos <default-memory-allocators>` usa el :ref:`asignador de memoria pymalloc <pymalloc>`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
es: Solicitar cero bytes retorna un puntero distinto que no sea ``NULL`` si es posible, como si en su lugar se hubiera llamado a ``PyObject_Malloc(1)``. La memoria no se habrá inicializado de ninguna manera.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Calloc(1, 1)`` had been called instead.
es: Solicitar elementos cero o elementos de tamaño cero bytes retorna un puntero distinto ``NULL`` si es posible, como si en su lugar se hubiera llamado ``PyObject_Calloc(1, 1)``.

source: If *p* is ``NULL``, the call is equivalent to ``PyObject_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
es: Si *p* es ``NULL``, la llamada es equivalente a ``PyObject_Malloc(n)``; de lo contrario, si *n* es igual a cero, el bloque de memoria cambia de tamaño pero no se libera, y el puntero retornado no es ``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`.
es: A menos que *p* sea ``NULL``, debe haber sido retornado por una llamada previa a :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` o :c:func:`PyObject_Calloc`.

source: If the request fails, :c:func:`PyObject_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
es: Si la solicitud falla, :c:func:`PyObject_Realloc` retorna ``NULL`` y *p* sigue siendo un puntero válido al área de memoria anterior.
