Repository: python/python-docs-es
Catalog: c-api/memory.po
Languages: es

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`. Otherwise, or if ``PyObject_Free(p)`` has been called before, undefined behavior occurs.
es: Libera el bloque de memoria al que apunta *p*, que debe haber sido retornado por una llamada anterior a :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` o :c:func:`PyObject_Calloc`. De lo contrario, o si se ha llamado antes a ``PyObject_Free(p)``, se produce un comportamiento indefinido.

source: Default Memory Allocators
es: Asignadores de memoria predeterminados

source: Default memory allocators:
es: Asignadores de memoria predeterminados:

source: Configuration
es: Configuración

source: Name
es: Nombre

source: Release build
es: Lanzamiento de compilación

source: ``pymalloc``
es: ``malloc`` + debug

source: Debug build
es: Compilación de depuración

source: Release build, without pymalloc
es: Lanzamiento de compilación, sin pymalloc

source: Debug build, without pymalloc
es: Compilación de depuración, sin pymalloc

source: Legend:
es: Leyenda:

source: Name: value for :envvar:`PYTHONMALLOC` environment variable.
es: Nombre: valor para variable de entorno :envvar:`PYTHONMALLOC`.

source: ``malloc``: system allocators from the standard C library, C functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`.
es: ``malloc``: asignadores del sistema de la biblioteca C estándar, funciones C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` y :c:func:`free`.

source: ``pymalloc``: :ref:`pymalloc memory allocator <pymalloc>`.
es: ``pymalloc``: :ref:`asignador de memoria pymalloc <pymalloc>`.

source: "+ debug": with :ref:`debug hooks on the Python memory allocators <pymem-debug-hooks>`.
es: "+ debug": con :ref:`enlaces de depuración en los asignadores de memoria de Python <pymem-debug-hooks>`.

source: "Debug build": :ref:`Python build in debug mode <debug-build>`.
es: "Debug build": :ref:`Compilación de Python en modo de depuración <debug-build>`.

source: Customize Memory Allocators
es: Personalizar asignadores de memoria

source: Structure used to describe a memory block allocator. The structure has the following fields:
es: Estructura utilizada para describir un asignador de bloque de memoria. La estructura tiene cuatro campos:

source: Field
es: Campo

source: Meaning
es: Significado

source: user context passed as first argument
es: contexto de usuario pasado como primer argumento

source: allocate a memory block
es: asignar un bloque de memoria

source: allocate a memory block initialized with zeros
es: asignar un bloque de memoria inicializado con ceros

source: allocate or resize a memory block
es: asignar o cambiar el tamaño de un bloque de memoria

source: free a memory block
es: liberar un bloque de memoria

source: Enum used to identify an allocator domain. Domains:
es: Enum se utiliza para identificar un dominio asignador. Dominios:

source: Functions:
es: Funciones:

source: Get the memory block allocator of the specified domain.
es: Obtenga el asignador de bloque de memoria del dominio especificado.

source: Set the memory block allocator of the specified domain.
es: Establece el asignador de bloque de memoria del dominio especificado.

source: The new allocator must return a distinct non-``NULL`` pointer when requesting zero bytes.
es: El nuevo asignador debe retornar un puntero distinto ``NULL`` al solicitar cero bytes.

source: If the new allocator is not a hook (does not call the previous allocator), the :c:func:`PyMem_SetupDebugHooks` function must be called to reinstall the debug hooks on top on the new allocator.
es: Si el nuevo asignador no es un enlace (no llama al asignador anterior), se debe llamar a la función :c:func:`PyMem_SetupDebugHooks` para reinstalar los enlaces de depuración en la parte superior del nuevo asignador.

source: See also :c:member:`PyPreConfig.allocator` and :ref:`Preinitialize Python with PyPreConfig <c-preinit>`.
es: Vea también :c:member:`PyPreConfig.allocator` y :ref:`Preinicialización de Python con PyPreConfig <c-preinit>`.

source: Setup :ref:`debug hooks in the Python memory allocators <pymem-debug-hooks>` to detect memory errors.
es: Configurar :ref:`enlaces de depuración en los asignadores de memoria de Python <pymem-debug-hooks>` para detectar errores de memoria.

source: Debug hooks on the Python memory allocators
es: Configurar enlaces para detectar errores en las funciones del asignador de memoria de Python

source: When :ref:`Python is built in debug mode <debug-build>`, the :c:func:`PyMem_SetupDebugHooks` function is called at the :ref:`Python preinitialization <c-preinit>` to setup debug hooks on Python memory allocators to detect memory errors.
es: Cuando :ref:`Python está construido en modo de depuración <debug-build>`, la función :c:func:`PyMem_SetupDebugHooks` se llama en :ref:`Preinicialización de Python <c-preinit>` para configurar los enlaces de depuración en Python asignadores de memoria para detectar errores de memoria.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to install debug hooks on a Python compiled in release mode (ex: ``PYTHONMALLOC=debug``).
es: La variable de entorno :envvar:`PYTHONMALLOC` se puede utilizar para instalar enlaces de depuración en un Python compilado en modo de lanzamiento (por ejemplo: ``PYTHONMALLOC=debug``).

source: The :c:func:`PyMem_SetupDebugHooks` function can be used to set debug hooks after calling :c:func:`PyMem_SetAllocator`.
es: La función :c:func:`PyMem_SetupDebugHooks` se puede utilizar para establecer enlaces de depuración después de llamar a :c:func:`PyMem_SetAllocator`.

source: These debug hooks fill dynamically allocated memory blocks with special, recognizable bit patterns. Newly allocated memory is filled with the byte ``0xCD`` (``PYMEM_CLEANBYTE``), freed memory is filled with the byte ``0xDD`` (``PYMEM_DEADBYTE``). Memory blocks are surrounded by "forbidden bytes" filled with the byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Strings of these bytes are unlikely to be valid addresses, floats, or ASCII strings.
es: Estos enlaces de depuración llenan bloques de memoria asignados dinámicamente con patrones de bits especiales y reconocibles. La memoria recién asignada se llena con el byte ``0xCD`` (``PYMEM_CLEANBYTE``), la memoria liberada se llena con el byte ``0xDD`` (``PYMEM_DEADBYTE``). Los bloques de memoria están rodeados por "bytes prohibidos" rellenos con el byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Es poco probable que las cadenas de estos bytes sean direcciones válidas, flotantes o cadenas ASCII.

source: Runtime checks:
es: Verificaciones de tiempo de ejecución:

source: Detect API violations. For example, detect if :c:func:`PyObject_Free` is called on a memory block allocated by :c:func:`PyMem_Malloc`.
es: Detecte violaciones de API, por ejemplo: :c:func:`PyObject_Free` llamado en un búfer asignado por :c:func:`PyMem_Malloc`.

source: Detect write before the start of the buffer (buffer underflow).
es: Detectar escritura antes del inicio del búfer (desbordamiento del búfer)

source: Detect write after the end of the buffer (buffer overflow).
es: Detectar escritura después del final del búfer (desbordamiento del búfer)

source: On error, the debug hooks use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated. The traceback is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and the memory block was traced.
es: En caso de error, los enlaces de depuración usan el módulo :mod:`tracemalloc` para obtener el rastreo donde se asignó un bloque de memoria. El rastreo solo se muestra si :mod:`tracemalloc` rastrea las asignaciones de memoria de Python y se rastrea el bloque de memoria.

source: Let *S* = ``sizeof(size_t)``. ``2*S`` bytes are added at each end of each block of *N* bytes requested. The memory layout is like so, where p represents the address returned by a malloc-like or realloc-like function (``p[i:j]`` means the slice of bytes from ``*(p+i)`` inclusive up to ``*(p+j)`` exclusive; note that the treatment of negative indices differs from a Python slice):
es: Sea *S* = ``sizeof(size_t)``. Se agregan ``2*S`` bytes en cada extremo de cada bloque de *N* bytes solicitados. El diseño de la memoria es así, donde p representa la dirección retornada por una función similar a malloc o realloc (``p[i:j]`` significa el segmento de bytes de ``*(p+i)`` inclusive hasta ``*(p+j)`` exclusivo; tenga en cuenta que el tratamiento de los índices negativos difiere de un segmento de Python):

source: Number of bytes originally asked for. This is a size_t, big-endian (easier to read in a memory dump).
es: Número de bytes solicitados originalmente. Este es un size_t, big-endian (más fácil de leer en un volcado de memoria).

source: API identifier (ASCII character):
es: Identificador de API (carácter ASCII):

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch under- writes and reads.
es: Copias de PYMEM_FORBIDDENBYTE. Se utiliza para detectar suscripciones y lecturas.

source: The requested memory, filled with copies of PYMEM_CLEANBYTE, used to catch reference to uninitialized memory. When a realloc-like function is called requesting a larger memory block, the new excess bytes are also filled with PYMEM_CLEANBYTE. When a free-like function is called, these are overwritten with PYMEM_DEADBYTE, to catch reference to freed memory. When a realloc- like function is called requesting a smaller memory block, the excess old bytes are also filled with PYMEM_DEADBYTE.
es: La memoria solicitada, llena de copias de PYMEM_CLEANBYTE, utilizada para capturar la referencia a la memoria no inicializada. Cuando se llama a una función similar a realloc solicitando un bloque de memoria más grande, los nuevos bytes en exceso también se llenan con PYMEM_CLEANBYTE. Cuando se llama a una función de tipo free, se sobrescriben con PYMEM_DEADBYTE, para captar la referencia a la memoria liberada. Cuando se llama a una función similar a la realloc solicitando un bloque de memoria más pequeño, los bytes antiguos sobrantes también se llenan con PYMEM_DEADBYTE.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch over- writes and reads.
es: Copias de PYMEM_FORBIDDENBYTE. Se utiliza para detectar sobrescrituras y lecturas.

source: Only used if the ``PYMEM_DEBUG_SERIALNO`` macro is defined (not defined by default).
es: Solo se utiliza si la macro ``PYMEM_DEBUG_SERIALNO`` está definida (no definida por defecto).

source: A realloc-like or free-like function first checks that the PYMEM_FORBIDDENBYTE bytes at each end are intact. If they've been altered, diagnostic output is written to stderr, and the program is aborted via Py_FatalError(). The other main failure mode is provoking a memory error when a program reads up one of the special bit patterns and tries to use it as an address. If you get in a debugger then and look at the object, you're likely to see that it's entirely filled with PYMEM_DEADBYTE (meaning freed memory is getting used) or PYMEM_CLEANBYTE (meaning uninitialized memory is getting used).
es: Una función de tipo realloc o de tipo free primero verifica que los bytes PYMEM_FORBIDDENBYTE en cada extremo estén intactos. Si se han modificado, la salida de diagnóstico se escribe en stderr y el programa se aborta mediante Py_FatalError(). El otro modo de falla principal es provocar un error de memoria cuando un programa lee uno de los patrones de bits especiales e intenta usarlo como una dirección. Si ingresa a un depurador y observa el objeto, es probable que vea que está completamente lleno de PYMEM_DEADBYTE (lo que significa que se está usando la memoria liberada) o PYMEM_CLEANBYTE (que significa que se está usando la memoria no inicializada).

source: Byte patterns ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) and ``0xFB`` (``PYMEM_FORBIDDENBYTE``) have been replaced with ``0xCD``, ``0xDD`` and ``0xFD`` to use the same values than Windows CRT debug ``malloc()`` and ``free()``.
es: Los patrones de bytes ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) y ``0xFB`` (``PYMEM_FORBIDDENBYTE``) se han reemplazado por ``0xCD``, ``0xDD`` y ``0xFD`` para usar los mismos valores que la depuración de Windows CRT ``malloc()`` y ``free()``.

source: The pymalloc allocator
es: El asignador pymalloc

source: Python has a *pymalloc* allocator optimized for small objects (smaller or equal to 512 bytes) with a short lifetime. It uses memory mappings called "arenas" with a fixed size of 256 KiB. It falls back to :c:func:`PyMem_RawMalloc` and :c:func:`PyMem_RawRealloc` for allocations larger than 512 bytes.
es: Python tiene un asignador *pymalloc* optimizado para objetos pequeños (más pequeños o iguales a 512 bytes) con una vida útil corta. Utiliza asignaciones de memoria llamadas "arenas" con un tamaño fijo de 256 KiB. Vuelve a :c:func:`PyMem_RawMalloc` y :c:func:`PyMem_RawRealloc` para asignaciones de más de 512 bytes.

source: The arena allocator uses the following functions:
es: El asignador de arena utiliza las siguientes funciones:

source: :c:func:`malloc` and :c:func:`free` otherwise.
es: :c:func:`malloc` y :c:func:`free` en caso contrario.

source: This allocator is disabled if Python is configured with the :option:`--without-pymalloc` option. It can also be disabled at runtime using the :envvar:`PYTHONMALLOC` environment variable (ex: ``PYTHONMALLOC=malloc``).
es: Este asignador está deshabilitado si Python está configurado con la opción :option:`--without-pymalloc`. También se puede deshabilitar en tiempo de ejecución usando la variable de entorno :envvar:`PYTHONMALLOC` (por ejemplo: ``PYTHONMALLOC=malloc``).

source: Customize pymalloc Arena Allocator
es: Personalizar asignador de arena de pymalloc

source: Structure used to describe an arena allocator. The structure has three fields:
es: Estructura utilizada para describir un asignador de arena. La estructura tiene tres campos:

source: allocate an arena of size bytes
es: asignar una arena de bytes de tamaño

source: free an arena
es: liberar la arena

source: Get the arena allocator.
es: Consigue el asignador de arena.

source: Set the arena allocator.
es: Establecer el asignador de arena.

source: Track an allocated memory block in the :mod:`tracemalloc` module.
es: Rastree un bloque de memoria asignado en el módulo :mod:`tracemalloc`.

source: Return ``0`` on success, return ``-1`` on error (failed to allocate memory to store the trace). Return ``-2`` if tracemalloc is disabled.
es: Retorna ``0`` en caso de éxito, retorna ``-1`` en caso de error (no se pudo asignar memoria para almacenar la traza). Retorna ``-2`` si tracemalloc está deshabilitado.

source: If memory block is already tracked, update the existing trace.
es: Si el bloque de memoria ya está rastreado, actualice el rastreo existente.

source: Untrack an allocated memory block in the :mod:`tracemalloc` module. Do nothing if the block was not tracked.
es: Descomprima un bloque de memoria asignado en el módulo :mod:`tracemalloc`. No haga nada si el bloque no fue rastreado.

source: Return ``-2`` if tracemalloc is disabled, otherwise return ``0``.
es: Retorna ``-2`` si tracemalloc está deshabilitado; de lo contrario, retorna ``0``.

source: Examples
es: Ejemplos

source: Here is the example from section :ref:`memoryoverview`, rewritten so that the I/O buffer is allocated from the Python heap by using the first function set::
es: Aquí está el ejemplo de la sección :ref:`memoryoverview`, reescrito para que el búfer de E/S se asigne desde el montón de Python utilizando el primer conjunto de funciones::

source: The same code using the type-oriented function set::
es: El mismo código que utiliza el conjunto de funciones orientado a tipos::

source: Note that in the two examples above, the buffer is always manipulated via functions belonging to the same set. Indeed, it is required to use the same memory API family for a given memory block, so that the risk of mixing different allocators is reduced to a minimum. The following code sequence contains two errors, one of which is labeled as *fatal* because it mixes two different allocators operating on different heaps. ::
es: Tenga en cuenta que en los dos ejemplos anteriores, el búfer siempre se manipula a través de funciones que pertenecen al mismo conjunto. De hecho, es necesario usar la misma familia de API de memoria para un bloque de memoria dado, de modo que el riesgo de mezclar diferentes asignadores se reduzca al mínimo. La siguiente secuencia de código contiene dos errores, uno de los cuales está etiquetado como *fatal* porque mezcla dos asignadores diferentes que operan en montones diferentes.::

source: These will be explained in the next chapter on defining and implementing new object types in C.
es: Esto se explicará en el próximo capítulo sobre cómo definir e implementar nuevos tipos de objetos en C.
