Repository: python/python-docs-es
Catalog: c-api/method.po
Languages: es

source: Instance Method Objects
es: Objetos de método de instancia

source: This instance of :c:type:`PyTypeObject` represents the Python instance method type. It is not exposed to Python programs.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de método de instancia de Python. No está expuesto a los programas de Python.

source: Return true if *o* is an instance method object (has type :c:data:`PyInstanceMethod_Type`). The parameter must not be ``NULL``. This function always succeeds.
es: Retorna verdadero si *o* es un objeto de método de instancia (tiene tipo :c:data:`PyInstanceMethod_Type`). El parámetro no debe ser ``NULL``. Esta función siempre finaliza con éxito.

source: Return the function object associated with the instance method *im*.
es: Retorna el objeto de función asociado con el método de instancia *im*.

source: Macro version of :c:func:`PyInstanceMethod_Function` which avoids error checking.
es: Versión macro de :c:func:`PyInstanceMethod_Function` que evita la comprobación de errores.

source: Method Objects
es: Objetos método

source: Methods are bound function objects. Methods are always bound to an instance of a user-defined class. Unbound methods (methods bound to a class object) are no longer available.
es: Los métodos son objetos de función enlazados. Los métodos siempre están vinculados a una instancia de una clase definida por el usuario. Los métodos no vinculados (métodos vinculados a un objeto de clase) ya no están disponibles.

source: This instance of :c:type:`PyTypeObject` represents the Python method type. This is exposed to Python programs as ``types.MethodType``.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de método Python. Esto está expuesto a los programas de Python como ``types.MethodType``.

source: Return true if *o* is a method object (has type :c:data:`PyMethod_Type`). The parameter must not be ``NULL``. This function always succeeds.
es: Retorna verdadero si *o* es un objeto de método (tiene tipo :c:data:`PyMethod_Type`). El parámetro no debe ser ``NULL``. Esta función siempre finaliza con éxito.

source: Return a new method object, with *func* being any callable object and *self* the instance the method should be bound. *func* is the function that will be called when the method is called. *self* must not be ``NULL``.
es: Retorna un nuevo objeto de método, con *func* como cualquier objeto invocable y *self* la instancia en la que se debe vincular el método. *func* es la función que se llamará cuando se llame al método. *self* no debe ser ``NULL``.

source: Return the function object associated with the method *meth*.
es: Retorna el objeto de función asociado con el método *meth*.

source: Macro version of :c:func:`PyMethod_Function` which avoids error checking.
es: Versión macro de :c:func:`PyMethod_Function` que evita la comprobación de errores.

source: Return the instance associated with the method *meth*.
es: Retorna la instancia asociada con el método *meth*.

source: Macro version of :c:func:`PyMethod_Self` which avoids error checking.
es: Versión macro de :c:func:`PyMethod_Self` que evita la comprobación de errores.
