Repository: python/python-docs-es
Catalog: c-api/number.po
Languages: es

source: Number Protocol
es: Protocolo de números

source: Returns ``1`` if the object *o* provides numeric protocols, and false otherwise. This function always succeeds.
es: Retorna ``1`` si el objeto *o* proporciona protocolos numéricos, y falso en caso contrario. Esta función siempre finaliza con éxito.

source: Returns ``1`` if *o* is an index integer.
es: Retorna ``1`` si *o* es un índice entero.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 + o2``.
es: Retorna el resultado de agregar *o1* y *o2*, o ``NULL`` en caso de falla. Este es el equivalente de la expresión de Python ``o1 + o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 - o2``.
es: Retorna el resultado de restar *o2* de *o1*, o ``NULL`` en caso de falla. Este es el equivalente de la expresión de Python ``o1 - o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 * o2``.
es: Retorna el resultado de multiplicar *o1* y *o2*, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 * o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 @ o2``.
es: Retorna el resultado de la multiplicación de matrices en *o1* y *o2*, o ``NULL`` en caso de falla. Este es el equivalente de la expresión de Python ``o1 @ o2``.

source: Return the floor of *o1* divided by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 // o2``.
es: Retorna el cociente de la división entera a la baja entre *o1* y *o2*, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 // o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating point value when passed two integers. This is the equivalent of the Python expression ``o1 / o2``.
es: Retorna una aproximación razonable para el valor matemático de *o1* dividido por *o2* o ``NULL`` en caso de falla. El valor de retorno es "aproximado" porque los números binarios de punto flotante son aproximados; No es posible representar todos los números reales en la base dos. Esta función puede retornar un valor de punto flotante cuando se pasan dos enteros. Es equivalente a la expresión de Python ``o1 / o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 % o2``.
es: Retorna el resto de la división entera a la baja entre *o1* y *o2*, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 % o2``.

source: See the built-in function :func:`divmod`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``divmod(o1, o2)``.
es: Vea la función incorporada :func:`divmod`. Retorna ``NULL`` en caso de falla. Este es el equivalente de la expresión de Python ``divmod (o1, o2)``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``pow(o1, o2, o3)``, where *o3* is optional. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
es: Consulte la función incorporada :func:`pow`. Retorna ``NULL`` en caso de falla. Este es el equivalente de la expresión de Python ``pow(o1, o2, o3)``, donde *o3* es opcional. Si se ignora *o3*, pase :c:data:`Py_None` en su lugar (pasar ``NULL`` por *o3* provocaría un acceso ilegal a la memoria).

source: Returns the negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``-o``.
es: Retorna la negación de *o* en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``-o``.

source: Returns *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``+o``.
es: Retorna *o* en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``+o``.

source: Returns the absolute value of *o*, or ``NULL`` on failure. This is the equivalent of the Python expression ``abs(o)``.
es: Retorna el valor absoluto de *o* o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``abs(o)``.

source: Returns the bitwise negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``~o``.
es: Retorna la negación bit a bit de *o* en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``~o``.

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 << o2``.
es: Retorna el resultado del desplazamiento a la izquierda *o1* por *o2* en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 << o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 >> o2``.
es: Retorna el resultado del desplazamiento a la derecha *o1* por *o2* en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 >> o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. This is the equivalent of the Python expression ``o1 & o2``.
es: Retorna el "bit a bit y" (*bitwise and*) de *o1* y *o2* en caso de éxito y ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 & o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 ^ o2``.
es: Retorna el "bit a bit o exclusivo" (*bitwise exclusive or*) de *o1* por *o2* en caso de éxito, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 ^ o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 | o2``.
es: Retorna el "bit a bit o" (*bitwise or*) de *o1* y *o2* en caso de éxito, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1 | o2``.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 += o2``.
es: Retorna el resultado de agregar *o1* y *o2*, o ``NULL`` en caso de falla. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 += o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 -= o2``.
es: Retorna el resultado de restar *o2* de *o1*, o ``NULL`` en caso de falla. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 -= o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 *= o2``.
es: Retorna el resultado de multiplicar *o1* y *o2*, o ``NULL`` en caso de error. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 *= o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 @= o2``.
es: Retorna el resultado de la multiplicación de matrices en *o1* y *o2*, o ``NULL`` en caso de falla. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 @= o2``.

source: Returns the mathematical floor of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 //= o2``.
es: Retorna el cociente de la división entera a la baja entre *o1* y *o2*, o ``NULL`` en caso de error. La operación se realiza in situ (*in-place*) cuando *o1* lo admite. Es el equivalente de la sentencia de Python ``o1 //= o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 %= o2``.
es: Retorna el resto de dividir *o1* entre *o2* o ``NULL`` en caso de error. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1%= o2``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 **= o2`` when o3 is :c:data:`Py_None`, or an in-place variant of ``pow(o1, o2, o3)`` otherwise. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
es: Consulte la función incorporada :func:`pow`. Retorna ``NULL`` en caso de falla. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 **= o2`` cuando *o3* es :c:data:`Py_None`, o una variante en su lugar (*in-place*) de ``pow (o1, o2, o3)`` de lo contrario. Si se ignora *o3*, pase :c:data:`Py_None` en su lugar (pasar ``NULL`` para *o3* provocaría un acceso ilegal a la memoria).

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 <<= o2``.
es: Retorna el resultado del desplazamiento a la izquierda *o1* por *o2* en caso de éxito o ``NULL`` en caso de error. La operación se realiza en su sitio (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 <<= o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 >>= o2``.
es: Retorna el resultado del desplazamiento a la derecha *o1* por *o2* en caso de éxito o ``NULL`` en caso de error. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 >>= o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 &= o2``.
es: Retorna el "bit a bit y" (*bitwise and*) de *o1* y *o2* en caso de éxito y ``NULL`` en caso de error. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 &= o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 ^= o2``.
es: Retorna el "bit a bit o exclusivo" (*bitwise exclusive or*) de *o1* por *o2* en caso de éxito, o ``NULL`` en caso de error. La operación se realiza en su lugar (*in-place*) cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 ^= o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 |= o2``.
es: Retorna el "bit a bit o" (*bitwise or*) de *o1* y *o2* en caso de éxito, o ``NULL`` en caso de error. La operación se realiza en su lugar *in-place* cuando *o1* lo admite. Este es el equivalente de la declaración de Python ``o1 |= o2``.

source: Returns the *o* converted to an integer object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``int(o)``.
es: Retorna el *o* convertido a un objeto entero en caso de éxito, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``int(o)``.

source: Returns the *o* converted to a float object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``float(o)``.
es: Retorna el *o* convertido a un objeto flotante en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``float(o)``.

source: Returns the *o* converted to a Python int on success or ``NULL`` with a :exc:`TypeError` exception raised on failure.
es: Retorna el *o* convertido aun entero de Python (*int*) en caso de éxito o ``NULL`` con una excepción :exc:`TypeError` lanzada en caso de error.

source: The result always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``.
es: El resultado siempre tiene el tipo exacto :class:`int`. Anteriormente, el resultado podía ser una instancia de una subclase de ``int``.

source: Returns the integer *n* converted to base *base* as a string. The *base* argument must be one of 2, 8, 10, or 16. For base 2, 8, or 16, the returned string is prefixed with a base marker of ``'0b'``, ``'0o'``, or ``'0x'``, respectively. If *n* is not a Python int, it is converted with :c:func:`PyNumber_Index` first.
es: Retorna el entero *n* convertido a base *base* como una cadena de caracteres. El argumento *base* debe ser uno de 2, 8, 10 o 16. Para la base 2, 8 o 16, la cadena retornada está prefijada con un marcador base de ``'0b'``', ``'0o'`` o ``'0x'``, respectivamente. Si *n* no es un entero (*int*) Python, primero se convierte con :c:func:`PyNumber_Index`.
