Repository: python/python-docs-es
Catalog: c-api/object.po
Languages: es

source: Object Protocol
es: Protocolo de objeto

source: The ``NotImplemented`` singleton, used to signal that an operation is not implemented for the given type combination.
es: El singleton ``NotImplemented``, se usa para indicar que una operación no está implementada para la combinación de tipos dada.

source: Properly handle returning :c:data:`Py_NotImplemented` from within a C function (that is, increment the reference count of NotImplemented and return it).
es: Maneja adecuadamente el retorno :c:data:`Py_NotImplemented` desde una función C (es decir, incremente el recuento de referencias de *NotImplemented* y lo retorna).

source: Print an object *o*, on file *fp*. Returns ``-1`` on error. The flags argument is used to enable certain printing options. The only option currently supported is :const:`Py_PRINT_RAW`; if given, the :func:`str` of the object is written instead of the :func:`repr`.
es: Imprime un objeto *o*, en el archivo *fp*. Retorna ``-1`` en caso de error. El argumento de las banderas se usa para habilitar ciertas opciones de impresión. La única opción actualmente admitida es :const:`Py_PRINT_RAW`; si se proporciona, se escribe :func:`str` del objeto en lugar de :func:`repr`.

source: Returns ``1`` if *o* has the attribute *attr_name*, and ``0`` otherwise. This is equivalent to the Python expression ``hasattr(o, attr_name)``. This function always succeeds.
es: Retorna ``1`` si *o* tiene el atributo *attr_name*, y ``0`` en caso contrario. Esto es equivalente a la expresión de Python ``hasattr(o, attr_name)``. Esta función siempre finaliza exitosamente.

source: Note that exceptions which occur while calling :meth:`__getattr__` and :meth:`__getattribute__` methods will get suppressed. To get error reporting use :c:func:`PyObject_GetAttr()` instead.
es: Tenga en cuenta que las excepciones que se producen al llamar a los métodos a :meth:`__getattr__` y :meth:`__getattribute__` se suprimirán. Para obtener informe de errores, utilice :c:func:`PyObject_GetAttr()` alternativamente.

source: Note that exceptions which occur while calling :meth:`__getattr__` and :meth:`__getattribute__` methods and creating a temporary string object will get suppressed. To get error reporting use :c:func:`PyObject_GetAttrString()` instead.
es: Tenga en cuenta que las excepciones que se producen al llamar a :meth:`__getattr__` y :meth:`__getattribute__` y al crear un objeto de cadena temporal se suprimirán. Para obtener informes de errores, utilice :c:func:`PyObject_GetAttrString()` en su lugar.

source: Retrieve an attribute named *attr_name* from object *o*. Returns the attribute value on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o.attr_name``.
es: Recupera un atributo llamado *attr_name* del objeto *o*. Retorna el valor del atributo en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o.attr_name``.

source: Retrieve an attribute named *attr_name* from object *o*. Returns the attribute value on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o.attr_name``.
es: Recupera un atributo llamado *attr_name* del objeto *o*. Retorna el valor del atributo en caso de éxito o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o.attr_name``.

source: Generic attribute getter function that is meant to be put into a type object's ``tp_getattro`` slot. It looks for a descriptor in the dictionary of classes in the object's MRO as well as an attribute in the object's :attr:`~object.__dict__` (if present). As outlined in :ref:`descriptors`, data descriptors take preference over instance attributes, while non-data descriptors don't. Otherwise, an :exc:`AttributeError` is raised.
es: Función *getter* de atributo genérico que debe colocarse en la ranura ``tp_getattro`` de un objeto tipo. Busca un descriptor en el diccionario de clases en el MRO del objeto, así como un atributo en el objeto :attr:`~object.__ dict__` (si está presente). Como se describe en :ref:`descriptors`, los descriptores de datos tienen preferencia sobre los atributos de instancia, mientras que los descriptores que no son de datos no lo hacen. De lo contrario, se genera un :exc:`AttributeError`.

source: Set the value of the attribute named *attr_name*, for object *o*, to the value *v*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o.attr_name = v``.
es: Establece el valor del atributo llamado *attr_name*, para el objeto *o*, en el valor *v*. Genera una excepción y retorna ``-1`` en caso de falla; retorna ``0`` en caso de éxito. Este es el equivalente de la declaración de Python ``o.attr_name = v``.

source: If *v* is ``NULL``, the attribute is deleted, however this feature is deprecated in favour of using :c:func:`PyObject_DelAttr`.
es: Si *v* es ``NULL``, el atributo se elimina, sin embargo, esta característica está obsoleta a favor de usar :c:func:`PyObject_DelAttr`.

source: If *v* is ``NULL``, the attribute is deleted, however this feature is deprecated in favour of using :c:func:`PyObject_DelAttrString`.
es: Si *v* es ``NULL``, el atributo se elimina, sin embargo, esta característica está obsoleta a favor de usar :c:func:`PyObject_DelAttrString`.

source: Generic attribute setter and deleter function that is meant to be put into a type object's :c:member:`~PyTypeObject.tp_setattro` slot. It looks for a data descriptor in the dictionary of classes in the object's MRO, and if found it takes preference over setting or deleting the attribute in the instance dictionary. Otherwise, the attribute is set or deleted in the object's :attr:`~object.__dict__` (if present). On success, ``0`` is returned, otherwise an :exc:`AttributeError` is raised and ``-1`` is returned.
es: Establecimiento de atributo genérico y función de eliminación que está destinada a colocarse en la ranura de un objeto tipo :c:member:`~PyTypeObject.tp_setattro`. Busca un descriptor de datos en el diccionario de clases en el MRO del objeto y, si se encuentra, tiene preferencia sobre la configuración o eliminación del atributo en el diccionario de instancias. De lo contrario, el atributo se establece o elimina en el objeto :attr:`~object.__dict__` (si está presente). En caso de éxito, se retorna ``0``; de lo contrario, se genera un :exc:`AttributeError` y se retorna ``-1``.

source: Delete attribute named *attr_name*, for object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o.attr_name``.
es: Elimina el atributo llamado *attr_name*, para el objeto *o*. Retorna ``-1`` en caso de falla. Este es el equivalente de la declaración de Python ``del o.attr_name``.

source: A generic implementation for the getter of a ``__dict__`` descriptor. It creates the dictionary if necessary.
es: Una implementación genérica para obtener un descriptor ``__dict__``. Crea el diccionario si es necesario.

source: A generic implementation for the setter of a ``__dict__`` descriptor. This implementation does not allow the dictionary to be deleted.
es: Una implementación genérica para el creador de un descriptor ``__dict__``. Esta implementación no permite que se elimine el diccionario.

source: Compare the values of *o1* and *o2* using the operation specified by *opid*, which must be one of :const:`Py_LT`, :const:`Py_LE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_GT`, or :const:`Py_GE`, corresponding to ``<``, ``<=``, ``==``, ``!=``, ``>``, or ``>=`` respectively. This is the equivalent of the Python expression ``o1 op o2``, where ``op`` is the operator corresponding to *opid*. Returns the value of the comparison on success, or ``NULL`` on failure.
es: Compara los valores de *o1* y *o2* utilizando la operación especificada por *opid*, que debe ser uno de los siguientes :const:`Py_LT`, :const:`Py_LE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_GT`, o :const:`Py_GE`, correspondiente a ``<``, ``<=``, ``==``, ``!=``, ``>`` o ``>=`` respectivamente. Este es el equivalente de la expresión de Python ``o1 op o2``, donde ``op`` es el operador correspondiente a *opid*. Retorna el valor de la comparación en caso de éxito o ``NULL`` en caso de error.

source: Compare the values of *o1* and *o2* using the operation specified by *opid*, which must be one of :const:`Py_LT`, :const:`Py_LE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_GT`, or :const:`Py_GE`, corresponding to ``<``, ``<=``, ``==``, ``!=``, ``>``, or ``>=`` respectively. Returns ``-1`` on error, ``0`` if the result is false, ``1`` otherwise. This is the equivalent of the Python expression ``o1 op o2``, where ``op`` is the operator corresponding to *opid*.
es: Compara los valores de *o1* y *o2* utilizando la operación especificada por *opid*, que debe ser uno de los siguientes :const:`Py_LT`, :const:`Py_LE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_GT`, o :const:`Py_GE`, correspondiente a ``<``, ``<=``, ``==``, ``!=``, ``>`` o ``>=`` respectivamente. Retorna ``-1`` en caso de error, ``0`` si el resultado es falso, ``1`` en caso contrario. Este es el equivalente de la expresión de Python ``o1 op o2``, donde ``op`` es el operador correspondiente a *opid*.

source: If *o1* and *o2* are the same object, :c:func:`PyObject_RichCompareBool` will always return ``1`` for :const:`Py_EQ` and ``0`` for :const:`Py_NE`.
es: Si *o1* y *o2* son el mismo objeto, :c:func:`PyObject_RichCompareBool` siempre retornará ``1`` para :const:`Py_EQ` y ``0`` para :const:`Py_NE`.

source: Compute a string representation of object *o*. Returns the string representation on success, ``NULL`` on failure. This is the equivalent of the Python expression ``repr(o)``. Called by the :func:`repr` built-in function.
es: Calcula una representación de cadena de caracteres del objeto *o*. Retorna la representación de cadena de caracteres en caso de éxito, ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``repr(o)``. Llamado por la función incorporada :func:`repr`.

source: This function now includes a debug assertion to help ensure that it does not silently discard an active exception.
es: Esta función ahora incluye una afirmación de depuración para ayudar a garantizar que no descarte silenciosamente una excepción activa.

source: As :c:func:`PyObject_Repr`, compute a string representation of object *o*, but escape the non-ASCII characters in the string returned by :c:func:`PyObject_Repr` with ``\x``, ``\u`` or ``\U`` escapes. This generates a string similar to that returned by :c:func:`PyObject_Repr` in Python 2. Called by the :func:`ascii` built-in function.
es: Como :c:func:`PyObject_Repr`, calcula una representación de cadena de caracteres del objeto *o*, pero escapa los caracteres no ASCII en la cadena de caracteres retornada por :c:func:`PyObject_Repr` con ``\x``, ``\u`` o ``\U`` escapa. Esto genera una cadena de caracteres similar a la que retorna :c:func:`PyObject_Repr` en Python 2. Llamado por la función incorporada :func:`ascii`.

source: Compute a string representation of object *o*. Returns the string representation on success, ``NULL`` on failure. This is the equivalent of the Python expression ``str(o)``. Called by the :func:`str` built-in function and, therefore, by the :func:`print` function.
es: Calcula una representación de cadena de caracteres del objeto *o*. Retorna la representación de cadena de caracteres en caso de éxito, ``NULL`` en caso de error. Llamado por la función incorporada :func:`str` y, por lo tanto, por la función :func:`print`.

source: Compute a bytes representation of object *o*. ``NULL`` is returned on failure and a bytes object on success. This is equivalent to the Python expression ``bytes(o)``, when *o* is not an integer. Unlike ``bytes(o)``, a TypeError is raised when *o* is an integer instead of a zero-initialized bytes object.
es: Calcula una representación de bytes del objeto *o*. ``NULL`` se retorna en caso de error y un objeto de bytes en caso de éxito. Esto es equivalente a la expresión de Python ``bytes(o)``, cuando *o* no es un número entero. A diferencia de ``bytes(o)``, se genera un :exc:`TypeError` cuando *o* es un entero en lugar de un objeto de bytes con inicialización cero.

source: Return ``1`` if the class *derived* is identical to or derived from the class *cls*, otherwise return ``0``. In case of an error, return ``-1``.
es: Retorna ``1`` si la clase *derived* es idéntica o derivada de la clase *cls*; de lo contrario, retorna ``0``. En caso de error, retorna ``-1``.

source: If *cls* is a tuple, the check will be done against every entry in *cls*. The result will be ``1`` when at least one of the checks returns ``1``, otherwise it will be ``0``.
es: Si *cls* es una tupla, la verificación se realizará con cada entrada en *cls*. El resultado será ``1`` cuando al menos una de las verificaciones retorne ``1``, de lo contrario será ``0``.

source: If *cls* has a :meth:`~class.__subclasscheck__` method, it will be called to determine the subclass status as described in :pep:`3119`. Otherwise, *derived* is a subclass of *cls* if it is a direct or indirect subclass, i.e. contained in ``cls.__mro__``.
es: Si *cls* tiene un método :meth:`~class.__subclasscheck__`, se llamará para determinar el estado de la subclase como se describe en :pep:`3119`. De lo contrario, *derived* es una subclase de *cls* si es una subclase directa o indirecta, es decir, contenida en ``cls.__ mro__``.

source: Normally only class objects, i.e. instances of :class:`type` or a derived class, are considered classes. However, objects can override this by having a :attr:`__bases__` attribute (which must be a tuple of base classes).
es: Normalmente, solo los objetos clase, es decir, las instancias de :class:`type` o una clase derivada, se consideran clases. Sin embargo, los objetos pueden anular esto al tener un atributo :attr:`__bases__` (que debe ser una tupla de clases base).

source: Return ``1`` if *inst* is an instance of the class *cls* or a subclass of *cls*, or ``0`` if not. On error, returns ``-1`` and sets an exception.
es: Retorna ``1`` si *inst* es una instancia de la clase *cls* o una subclase de *cls*, o ``0`` si no. En caso de error, retorna ``-1`` y establece una excepción.

source: If *cls* has a :meth:`~class.__instancecheck__` method, it will be called to determine the subclass status as described in :pep:`3119`. Otherwise, *inst* is an instance of *cls* if its class is a subclass of *cls*.
es: Si *cls* tiene un método :meth:`~class.__instancecheck__`, se llamará para determinar el estado de la subclase como se describe en :pep:`3119`. De lo contrario, *inst* es una instancia de *cls* si su clase es una subclase de *cls*.

source: An instance *inst* can override what is considered its class by having a :attr:`__class__` attribute.
es: Una instancia *inst* puede anular lo que se considera su clase al tener un atributo :attr:`__class__`.

source: An object *cls* can override if it is considered a class, and what its base classes are, by having a :attr:`__bases__` attribute (which must be a tuple of base classes).
es: Un objeto *cls* puede anular si se considera una clase y cuáles son sus clases base, al tener un atributo :attr:`__bases__` (que debe ser una tupla de clases base).

source: Determine if the object *o* is callable. Return ``1`` if the object is callable and ``0`` otherwise. This function always succeeds.
es: Determina si el objeto *o* es invocable. Retorna ``1`` si el objeto es invocable y ``0`` de lo contrario. Esta función siempre tiene éxito.

source: Call a callable Python object *callable*, with arguments given by the tuple *args*, and named arguments given by the dictionary *kwargs*.
es: Llama un objeto Python invocable *invocable*, con argumentos dados por la tupla *args*, y argumentos con nombre dados por el diccionario *kwargs*.

source: *args* must not be ``NULL``, use an empty tuple if no arguments are needed. If no named arguments are needed, *kwargs* can be ``NULL``.
es: *args* no debe ser ``NULL``, use una tupla vacía si no se necesitan argumentos. Si no se necesitan argumentos con nombre, *kwargs* puede ser ``NULL``.

source: Return the result of the call on success, or raise an exception and return ``NULL`` on failure.
es: Retorna el resultado de la llamada en caso de éxito o genera una excepción y retorna ``NULL`` en caso de error.

source: This is the equivalent of the Python expression: ``callable(*args, **kwargs)``.
es: Este es el equivalente de la expresión de Python: ``callable(*args, **kwargs)``.

source: Call a callable Python object *callable*, with arguments given by the tuple *args*. If no arguments are needed, then *args* can be ``NULL``.
es: Llama un objeto Python invocable *invocable*, con argumentos dados por la tupla *args*. Si no se necesitan argumentos, entonces *args* puede ser ``NULL``.

source: This is the equivalent of the Python expression: ``callable(*args)``.
es: Este es el equivalente de la expresión de Python: ``callable(*args)``.

source: Call a callable Python object *callable*, with a variable number of C arguments. The C arguments are described using a :c:func:`Py_BuildValue` style format string. The format can be ``NULL``, indicating that no arguments are provided.
es: Llama un objeto Python invocable *invocable*, con un número variable de argumentos C. Los argumentos de C se describen utilizando una cadena de caracteres de formato de estilo :c:func:`Py_BuildValue`. El formato puede ser ``NULL``, lo que indica que no se proporcionan argumentos.

source: Note that if you only pass :c:type:`PyObject \*` args, :c:func:`PyObject_CallFunctionObjArgs` is a faster alternative.
es: Tenga en cuenta que si solo pasa argumentos :c:type:`PyObject\*`, :c:func:`PyObject_CallFunctionObjArgs` es una alternativa más rápida.

source: The type of *format* was changed from ``char *``.
es: El tipo de *format* se cambió de ``char *``.

source: Call the method named *name* of object *obj* with a variable number of C arguments. The C arguments are described by a :c:func:`Py_BuildValue` format string that should produce a tuple.
es: Llama al método llamado *nombre* del objeto *obj* con un número variable de argumentos C. Los argumentos de C se describen mediante una cadena de caracteres de formato :c:func:`Py_BuildValue` que debería producir una tupla.

source: The format can be ``NULL``, indicating that no arguments are provided.
es: El formato puede ser ``NULL``, lo que indica que no se proporcionan argumentos.

source: This is the equivalent of the Python expression: ``obj.name(arg1, arg2, ...)``.
es: Este es el equivalente de la expresión de Python: ``obj.name(arg1, arg2, ...)``.

source: Note that if you only pass :c:type:`PyObject \*` args, :c:func:`PyObject_CallMethodObjArgs` is a faster alternative.
es: Tenga en cuenta que si solo pasa argumentos :c:type:`PyObject\*`, :c:func:`PyObject_CallMethodObjArgs` es una alternativa más rápida.

source: The types of *name* and *format* were changed from ``char *``.
es: Los tipos de *name* y *format* se cambiaron de ``char *``.

source: Call a callable Python object *callable*, with a variable number of :c:type:`PyObject\*` arguments. The arguments are provided as a variable number of parameters followed by ``NULL``.
es: Llama un objeto Python invocable *invocable*, con un número variable de argumentos :c:type:`PyObject\*`. Los argumentos se proporcionan como un número variable de parámetros seguido de ``NULL``.

source: This is the equivalent of the Python expression: ``callable(arg1, arg2, ...)``.
es: Este es el equivalente de la expresión de Python: ``callable(arg1, arg2, ...)``.

source: Calls a method of the Python object *obj*, where the name of the method is given as a Python string object in *name*. It is called with a variable number of :c:type:`PyObject\*` arguments. The arguments are provided as a variable number of parameters followed by ``NULL``.
es: Llama un método del objeto Python *obj*, donde el nombre del método se da como un objeto de cadena de caracteres Python en *nombre*. Se llama con un número variable de argumentos :c:type:`PyObject\*`. Los argumentos se proporcionan como un número variable de parámetros seguido de ``NULL``.

source: Call a callable Python object *callable*, using :c:data:`vectorcall <PyTypeObject.tp_vectorcall_offset>` if possible.
es: Llama un objeto Python invocable *invocable*, utilizando :c:data:`vectorcall <PyTypeObject.tp_vectorcall_offset>` si es posible.

source: *args* is a C array with the positional arguments.
es: *args* es una arreglo en C con los argumentos posicionales.

source: *nargsf* is the number of positional arguments plus optionally the flag :const:`PY_VECTORCALL_ARGUMENTS_OFFSET` (see below). To get actual number of arguments, use :c:func:`PyVectorcall_NARGS(nargsf) <PyVectorcall_NARGS>`.
es: *nargsf* es el número de argumentos posicionales más, opcionalmente, el indicador :const:`PY_VECTORCALL_ARGUMENTS_OFFSET` (ver más abajo). Para obtener el número real de argumentos, use :c:func:`PyVectorcall_NARGS(nargsf) <PyVectorcall_NARGS>`.

source: *kwnames* can be either ``NULL`` (no keyword arguments) or a tuple of keyword names. In the latter case, the values of the keyword arguments are stored in *args* after the positional arguments. The number of keyword arguments does not influence *nargsf*.
es: *kwnames* puede ser ``NULL`` (sin argumentos de palabras clave) o una tupla de nombres de palabras clave. En el último caso, los valores de los argumentos de palabras clave se almacenan en *args* después de los argumentos posicionales. El número de argumentos de palabras clave no influye en *nargsf*.

source: *kwnames* must contain only objects of type ``str`` (not a subclass), and all keys must be unique.
es: *kwnames* debe contener solo objetos de tipo ``str`` (no una subclase), y todas las claves deben ser únicas.

source: This uses the vectorcall protocol if the callable supports it; otherwise, the arguments are converted to use :c:member:`~PyTypeObject.tp_call`.
es: Esto usa el protocolo *vectorcall* si el invocable lo admite; de lo contrario, los argumentos se convierten para usar :c:member:`~PyTypeObject.tp_call`.

source: This function is provisional and expected to become public in Python 3.9, with a different name and, possibly, changed semantics. If you use the function, plan for updating your code for Python 3.9.
es: Esta función es provisional y se espera que se haga pública en Python 3.9, con un nombre diferente y, posiblemente, una semántica cambiada. Si usa la función, planifique actualizar su código para Python 3.9.

source: If set in a vectorcall *nargsf* argument, the callee is allowed to temporarily change ``args[-1]``. In other words, *args* points to argument 1 (not 0) in the allocated vector. The callee must restore the value of ``args[-1]`` before returning.
es: Si se establece en un argumento *vectorcall* *nargsf*, la persona que llama puede cambiar temporalmente ``args[-1]``. En otras palabras, *args* apunta al argumento 1 (no 0) en el vector asignado. La persona que llama debe restaurar el valor de ``args[-1]`` antes de retornar.

source: Whenever they can do so cheaply (without additional allocation), callers are encouraged to use :const:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Doing so will allow callables such as bound methods to make their onward calls (which include a prepended *self* argument) cheaply.
es: Siempre que puedan hacerlo a bajo costo (sin asignación adicional), se recomienda a las personas que llaman que utilicen :const:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Hacerlo permitirá que los invocables, como los métodos enlazados, realicen sus llamadas posteriores (que incluyen un argumento *self* antepuesto) a bajo precio.
