Repository: python/python-docs-es
Catalog: c-api/object.po
Languages: es

source: Given a vectorcall *nargsf* argument, return the actual number of arguments. Currently equivalent to ``nargsf & ~PY_VECTORCALL_ARGUMENTS_OFFSET``.
es: Dado un argumento *vectorcall* *nargsf*, retorna el número real de argumentos. Actualmente equivalente a ``nargsf & ~PY_VECTORCALL_ARGUMENTS_OFFSET``.

source: Same as :c:func:`_PyObject_Vectorcall` except that the keyword arguments are passed as a dictionary in *kwdict*. This may be ``NULL`` if there are no keyword arguments.
es: Igual que :c:func:`_PyObject_Vectorcall` excepto que los argumentos de palabras clave se pasan como un diccionario en *kwdict*. Esto puede ser ``NULL`` si no hay argumentos de palabras clave.

source: For callables supporting :c:data:`vectorcall <PyTypeObject.tp_vectorcall_offset>`, the arguments are internally converted to the vectorcall convention. Therefore, this function adds some overhead compared to :c:func:`_PyObject_Vectorcall`. It should only be used if the caller already has a dictionary ready to use.
es: Para llamadas que admiten :c:data:`vectorcall <PyTypeObject.tp_vectorcall_offset>`, los argumentos se convierten internamente a la convención *vectorcall*. Por lo tanto, esta función agrega algunos gastos generales en comparación con :c:func:`_PyObject_Vectorcall`. Solo debe usarse si la persona que llama ya tiene un diccionario listo para usar.

source: Compute and return the hash value of an object *o*. On failure, return ``-1``. This is the equivalent of the Python expression ``hash(o)``.
es: Calcula y retorna el valor hash de un objeto *o*. En caso de fallo, retorna ``-1``. Este es el equivalente de la expresión de Python ``hash(o)``.

source: The return type is now Py_hash_t. This is a signed integer the same size as Py_ssize_t.
es: El tipo de retorno ahora es *Py_hash_t*. Este es un entero con signo del mismo tamaño que *Py_ssize_t*.

source: Set a :exc:`TypeError` indicating that ``type(o)`` is not hashable and return ``-1``. This function receives special treatment when stored in a ``tp_hash`` slot, allowing a type to explicitly indicate to the interpreter that it is not hashable.
es: Establece un :exc:`TypeError` indicando que ``type(o)`` no es *hashable* y retorna ``-1``. Esta función recibe un tratamiento especial cuando se almacena en una ranura ``tp_hash``, lo que permite que un tipo indique explícitamente al intérprete que no es *hashable*.

source: Returns ``1`` if the object *o* is considered to be true, and ``0`` otherwise. This is equivalent to the Python expression ``not not o``. On failure, return ``-1``.
es: Retorna ``1`` si el objeto *o* se considera verdadero y ``0`` en caso contrario. Esto es equivalente a la expresión de Python ``not not o``. En caso de error, retorna ``-1``.

source: Returns ``0`` if the object *o* is considered to be true, and ``1`` otherwise. This is equivalent to the Python expression ``not o``. On failure, return ``-1``.
es: Retorna ``0`` si el objeto *o* se considera verdadero, y ``1`` de lo contrario. Esto es equivalente a la expresión de Python ``not o``. En caso de error, devuelva ``-1``.

source: When *o* is non-``NULL``, returns a type object corresponding to the object type of object *o*. On failure, raises :exc:`SystemError` and returns ``NULL``. This is equivalent to the Python expression ``type(o)``. This function increments the reference count of the return value. There's really no reason to use this function instead of the common expression ``o->ob_type``, which returns a pointer of type :c:type:`PyTypeObject\*`, except when the incremented reference count is needed.
es: Cuando *o* no es ``NULL``, retorna un objeto de tipo correspondiente al tipo de objeto del objeto *o*. En caso de error, genera :exc:`SystemError` y retorna ``NULL``. Esto es equivalente a la expresión de Python ``type(o)``. Esta función incrementa el conteo de referencia del valor de retorno. Realmente no hay ninguna razón para usar esta función en lugar de la expresión común ``o- ob_type``, que retorna un puntero de tipo :c:type:`PyTypeObject\*`, excepto cuando se necesita el recuento de referencia incrementado.

source: Return true if the object *o* is of type *type* or a subtype of *type*. Both parameters must be non-``NULL``.
es: Retorna verdadero si el objeto *o* es de tipo *type* o un subtipo de *type*. Ambos parámetros no deben ser ``NULL``.

source: Return the length of object *o*. If the object *o* provides either the sequence and mapping protocols, the sequence length is returned. On error, ``-1`` is returned. This is the equivalent to the Python expression ``len(o)``.
es: Retorna la longitud del objeto *o*. Si el objeto *o* proporciona los protocolos de secuencia y mapeo, se retorna la longitud de la secuencia. En caso de error, se retorna ``-1``. Este es el equivalente a la expresión de Python ``len(o)``.

source: Return an estimated length for the object *o*. First try to return its actual length, then an estimate using :meth:`~object.__length_hint__`, and finally return the default value. On error return ``-1``. This is the equivalent to the Python expression ``operator.length_hint(o, default)``.
es: Retorna una longitud estimada para el objeto *o*. Primero intenta retornar su longitud real, luego una estimación usando :meth:`~object.__length_hint__`, y finalmente retorna el valor predeterminado. En caso de error, retorna ``-1``. Este es el equivalente a la expresión de Python ``operator.length_hint (o, default)``.

source: Return element of *o* corresponding to the object *key* or ``NULL`` on failure. This is the equivalent of the Python expression ``o[key]``.
es: Retorna el elemento de *o* correspondiente a la clave *key* del objeto o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o[key]``.

source: Map the object *key* to the value *v*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o[key] = v``. This function *does not* steal a reference to *v*.
es: Asigna el objeto *key* al valor *v*. Genera una excepción y retorna ``-1`` en caso de error; retorna ``0`` en caso de éxito. Este es el equivalente de la declaración de Python ``o[key] = v``. Esta función *no* roba una referencia a *v*.

source: Remove the mapping for the object *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``.
es: Elimina la asignación para el objeto *key* del objeto *o*. Retorna ``-1`` en caso de falla. Esto es equivalente a la declaración de Python ``del o[key]``.

source: This is equivalent to the Python expression ``dir(o)``, returning a (possibly empty) list of strings appropriate for the object argument, or ``NULL`` if there was an error. If the argument is ``NULL``, this is like the Python ``dir()``, returning the names of the current locals; in this case, if no execution frame is active then ``NULL`` is returned but :c:func:`PyErr_Occurred` will return false.
es: Esto es equivalente a la expresión de Python ``dir(o)``, que retorna una lista (posiblemente vacía) de cadenas de caracteres apropiadas para el argumento del objeto, o ``NULL`` si hubo un error. Si el argumento es ``NULL``, es como el Python ``dir()``, que retorna los nombres de los locales actuales; en este caso, si no hay un marco de ejecución activo, se retorna ``NULL`` pero :c:func:`PyErr_Occurred` retornará falso.

source: This is equivalent to the Python expression ``iter(o)``. It returns a new iterator for the object argument, or the object itself if the object is already an iterator. Raises :exc:`TypeError` and returns ``NULL`` if the object cannot be iterated.
es: Esto es equivalente a la expresión de Python ``iter(o)``. Retorna un nuevo iterador para el argumento del objeto, o el propio objeto si el objeto ya es un iterador. Lanza :exc:`TypeError` y retorna ``NULL`` si el objeto no puede iterarse.
