Repository: python/python-docs-es
Catalog: c-api/reflection.po
Languages: es

source: Reflection
es: Reflexión

source: Return a dictionary of the builtins in the current execution frame, or the interpreter of the thread state if no frame is currently executing.
es: Retorna un diccionario de las construcciones en el marco de ejecución actual, o el intérprete del estado del hilo si no se está ejecutando ningún marco actualmente.

source: Return a dictionary of the local variables in the current execution frame, or ``NULL`` if no frame is currently executing.
es: Retorna un diccionario de las variables locales en el marco de ejecución actual, o ``NULL`` si actualmente no se está ejecutando ningún marco.

source: Return a dictionary of the global variables in the current execution frame, or ``NULL`` if no frame is currently executing.
es: Retorna un diccionario de las variables globales en el marco de ejecución actual, o ``NULL`` si actualmente no se está ejecutando ningún marco.

source: Return the current thread state's frame, which is ``NULL`` if no frame is currently executing.
es: Retorna el marco del estado del hilo actual, que es ``NULL`` si actualmente no se está ejecutando ningún marco.

source: See also :c:func:`PyThreadState_GetFrame`.
es: Vea también :c:func:`PyThreadState_GetFrame`.

source: Get the *frame* next outer frame.
es: Obtiene el *frame* siguiente marco (*frame*) exterior.

source: Return a strong reference, or ``NULL`` if *frame* has no outer frame.
es: Devuelve una referencia fuerte o ``NULL`` si *frame* no tiene un marco exterior.

source: *frame* must not be ``NULL``.
es: *frame* no debe ser ``NULL``.

source: Get the *frame* code.
es: Obtiene el código *frame*.

source: Return a strong reference.
es: Retorna una referencia fuerte.

source: *frame* must not be ``NULL``. The result (frame code) cannot be ``NULL``.
es: *frame* no debe ser ``NULL``. El resultado (código del marco) no puede ser ``NULL``.

source: Return the line number that *frame* is currently executing.
es: Retorna el número de línea que *frame* está ejecutando actualmente.

source: Return the name of *func* if it is a function, class or instance object, else the name of *func*\s type.
es: Retorna el nombre de *func* si es una función, clase u objeto de instancia; de lo contrario, el nombre del tipo *func*\s.

source: Return a description string, depending on the type of *func*. Return values include "()" for functions and methods, " constructor", " instance", and " object". Concatenated with the result of :c:func:`PyEval_GetFuncName`, the result will be a description of *func*.
es: Retorna una cadena de caracteres de descripción, según el tipo de *func*. Los valores de retorno incluyen "()" para funciones y métodos, "constructor", "instancia" y "objeto". Concatenado con el resultado de :c:func:`PyEval_GetFuncName`, el resultado será una descripción de *func*.
