Repository: python/python-docs-es
Catalog: c-api/sequence.po
Languages: es

source: Sequence Protocol
es: Protocolo de secuencia

source: Returns the number of objects in sequence *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
es: Retorna el número de objetos en secuencia *o* en caso de éxito y ``-1`` en caso de error. Esto es equivalente a la expresión de Python ``len(o)``.

source: Return the concatenation of *o1* and *o2* on success, and ``NULL`` on failure. This is the equivalent of the Python expression ``o1 + o2``.
es: Retorna la concatenación de *o1* y *o2* en caso de éxito, y ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o1+o2``.

source: Return the result of repeating sequence object *o* *count* times, or ``NULL`` on failure. This is the equivalent of the Python expression ``o * count``.
es: Retorna el resultado de repetir el objeto de secuencia *o* *count* veces, o ``NULL`` en caso de falla. Este es el equivalente de la expresión de Python ``o*count``.

source: Return the concatenation of *o1* and *o2* on success, and ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python expression ``o1 += o2``.
es: Retorna la concatenación de *o1* y *o2* en caso de éxito, y ``NULL`` en caso de error. La operación se realiza en su lugar *in-place* cuando *o1* lo admite. Este es el equivalente de la expresión de Python ``o1+=o2``.

source: Return the result of repeating sequence object *o* *count* times, or ``NULL`` on failure. The operation is done *in-place* when *o* supports it. This is the equivalent of the Python expression ``o *= count``.
es: Retorna el resultado de repetir el objeto de secuencia *o* *count* veces, o ``NULL`` en caso de falla. La operación se realiza en su lugar (*in-place*) cuando *o* lo admite. Este es el equivalente de la expresión de Python ``o*=count``.

source: Return the *i*\ th element of *o*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o[i]``.
es: Retorna el elemento *i*-ésimo de *o* o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o[i]``.

source: Return the slice of sequence object *o* between *i1* and *i2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o[i1:i2]``.
es: Retorna la rebanada del objeto secuencia *o* entre *i1* y *i2*, o ``NULL`` en caso de error. Este es el equivalente de la expresión de Python ``o[i1:i2]``.

source: Assign object *v* to the *i*\ th element of *o*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o[i] = v``. This function *does not* steal a reference to *v*.
es: Asigna el objeto *v* al elemento *i*-ésimo de *o*. Lanza una excepción y retorna ``-1`` en caso de falla; retorna ``0`` en caso de éxito. Este es el equivalente de la declaración de Python ``o[i]=v``. Esta función *no* roba una referencia a *v*.

source: Delete the *i*\ th element of object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o[i]``.
es: Elimina el elemento *i*-ésimo del objeto *o*. Retorna ``-1`` en caso de falla. Este es el equivalente de la declaración de Python ``del o[i]``.

source: Assign the sequence object *v* to the slice in sequence object *o* from *i1* to *i2*. This is the equivalent of the Python statement ``o[i1:i2] = v``.
es: Asigna el objeto secuencia *v* al segmento en el objeto secuencia *o* de *i1* a *i2*. Este es el equivalente de la declaración de Python ``o[i1:i2]=v``.

source: Delete the slice in sequence object *o* from *i1* to *i2*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o[i1:i2]``.
es: Elimina el segmento en el objeto secuencia *o* de *i1* a *i2*. Retorna ``-1`` en caso de falla. Este es el equivalente de la declaración de Python ``del o[i1:i2]``.

source: Return the number of occurrences of *value* in *o*, that is, return the number of keys for which ``o[key] == value``. On failure, return ``-1``. This is equivalent to the Python expression ``o.count(value)``.
es: Retorna el número de apariciones de *value* en *o*, es decir, retorna el número de claves para las que ``o[clave]==value``. En caso de fallo, retorna ``-1``. Esto es equivalente a la expresión de Python ``o.count(value)``.

source: Determine if *o* contains *value*. If an item in *o* is equal to *value*, return ``1``, otherwise return ``0``. On error, return ``-1``. This is equivalent to the Python expression ``value in o``.
es: Determine si *o* contiene *valor*. Si un elemento en *o* es igual a *value*, retorna ``1``; de lo contrario, retorna ``0``. En caso de error, retorna ``-1``. Esto es equivalente a la expresión de Python ``value in o``.

source: Return the first index *i* for which ``o[i] == value``. On error, return ``-1``. This is equivalent to the Python expression ``o.index(value)``.
es: Retorna el primer índice *i* para el que ``o[i]==value``. En caso de error, retorna ``-1``. Esto es equivalente a la expresión de Python ``o.index(value)``.

source: Return a list object with the same contents as the sequence or iterable *o*, or ``NULL`` on failure. The returned list is guaranteed to be new. This is equivalent to the Python expression ``list(o)``.
es: Retorna un objeto lista con el mismo contenido que la secuencia o iterable *o*, o ``NULL`` en caso de error. La lista retornada está garantizada como nueva. Esto es equivalente a la expresión de Python ``list(o)``.

source: Return a tuple object with the same contents as the sequence or iterable *o*, or ``NULL`` on failure. If *o* is a tuple, a new reference will be returned, otherwise a tuple will be constructed with the appropriate contents. This is equivalent to the Python expression ``tuple(o)``.
es: Retorna un objeto tupla con el mismo contenido que la secuencia o iterable *o*, o ``NULL`` en caso de error. Si *o* es una tupla, se retornará una nueva referencia; de lo contrario, se construirá una tupla con el contenido apropiado. Esto es equivalente a la expresión de Python ``tupla(o)``.

source: Return the sequence or iterable *o* as an object usable by the other ``PySequence_Fast*`` family of functions. If the object is not a sequence or iterable, raises :exc:`TypeError` with *m* as the message text. Returns ``NULL`` on failure.
es: Retorna la secuencia o iterable *o* como un objeto utilizable por la otra familia de funciones ``PySequence_Fast*``. Si el objeto no es una secuencia o no es iterable, lanza :exc:`TypeError` con *m* como texto del mensaje. Retorna ``NULL`` en caso de falla.

source: The ``PySequence_Fast*`` functions are thus named because they assume *o* is a :c:type:`PyTupleObject` or a :c:type:`PyListObject` and access the data fields of *o* directly.
es: Las funciones ``PySequence_Fast*`` se denominan así porque suponen que *o* es un :c:type:`PyTupleObject` o un :c:type:`PyListObject` y acceden a los campos de datos de *o* directamente.

source: As a CPython implementation detail, if *o* is already a sequence or list, it will be returned.
es: Como detalle de implementación de CPython, si *o* ya es una secuencia o lista, se retornará.

source: Return the *i*\ th element of *o*, assuming that *o* was returned by :c:func:`PySequence_Fast`, *o* is not ``NULL``, and that *i* is within bounds.
es: Retorna el elemento *i*-ésimo de *o*, suponiendo que *o* haya sido retornado por :c:func:`PySequence_Fast`, *o* no es ``NULL`` y que *i* está dentro de los límites.

source: Return the underlying array of PyObject pointers. Assumes that *o* was returned by :c:func:`PySequence_Fast` and *o* is not ``NULL``.
es: Retorna el arreglo subyacente de punteros `PyObject`. Asume que *o* fue retornado por :c:func:`PySequence_Fast` y *o* no es ``NULL``.

source: Note, if a list gets resized, the reallocation may relocate the items array. So, only use the underlying array pointer in contexts where the sequence cannot change.
es: Tenga en cuenta que si una lista cambia de tamaño, la reasignación puede reubicar el arreglo de elementos. Por lo tanto, solo use el puntero de arreglo subyacente en contextos donde la secuencia no puede cambiar.

source: Return the *i*\ th element of *o* or ``NULL`` on failure. Faster form of :c:func:`PySequence_GetItem` but without checking that :c:func:`PySequence_Check` on *o* is true and without adjustment for negative indices.
es: Retorna el elemento *i*-ésimo de *o* o ``NULL`` en caso de error. Es la forma más rápida de :c:func:`PySequence_GetItem` pero sin verificar que :c:func:`PySequence_Check` en *o* es verdadero y sin ajuste para índices negativos.
