Repository: python/python-docs-es
Catalog: c-api/sys.po
Languages: es

source: Operating System Utilities
es: Utilidades del sistema operativo

source: Function to prepare some internal state before a process fork. This should be called before calling :c:func:`fork` or any similar function that clones the current process. Only available on systems where :c:func:`fork` is defined.
es: Función para preparar algún estado interno antes de una bifurcación de proceso (*process fork*). Esto debería llamarse antes de llamar a :c:func:`fork` o cualquier función similar que clone el proceso actual. Solo disponible en sistemas donde :c:func:`fork` está definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_BeforeFork()``.
es: La llamada C :c:func:`fork` solo debe hacerse desde :ref:`hilo "principal" <fork-and-threads>` (del intérprete :ref:`"principal" <sub-interpreter-support>`). Lo mismo es cierto para ``PyOS_BeforeFork()``.

source: Function to update some internal state after a process fork. This should be called from the parent process after calling :c:func:`fork` or any similar function that clones the current process, regardless of whether process cloning was successful. Only available on systems where :c:func:`fork` is defined.
es: Función para actualizar algún estado interno después de una bifurcación de proceso. Se debe invocar desde el proceso principal después de llamar a :c:func:`fork` o cualquier función similar que clone el proceso actual, independientemente de si la clonación del proceso fue exitosa. Solo disponible en sistemas donde :c:func:`fork` está definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Parent()``.
es: La llamada C :c:func:`fork` solo debe hacerse desde :ref:`hilo "principal" <fork-and-threads>` (del intérprete :ref:`"principal" <sub-interpreter-support>`). Lo mismo es cierto para ``PyOS_AfterFork_Parent()``.

source: Function to update internal interpreter state after a process fork. This must be called from the child process after calling :c:func:`fork`, or any similar function that clones the current process, if there is any chance the process will call back into the Python interpreter. Only available on systems where :c:func:`fork` is defined.
es: Función para actualizar el estado del intérprete interno después de una bifurcación de proceso (*process fork*). Debe llamarse desde el proceso secundario después de llamar a :c:func:`fork`, o cualquier función similar que clone el proceso actual, si existe alguna posibilidad de que el proceso vuelva a llamar al intérprete de Python. Solo disponible en sistemas donde :c:func:`fork` está definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Child()``.
es: La llamada C :c:func:`fork` solo debe hacerse desde :ref:`hilo "principal" <fork-and-threads>` (del intérprete :ref:`"principal" <sub-interpreter-support>`). Lo mismo es cierto para ``PyOS_AfterFork_Child()``.

source: :func:`os.register_at_fork` allows registering custom Python functions to be called by :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
es: :func:`os.register_at_fork` permite registrar funciones personalizadas de Python a las que puede llamar :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` y :c:func:`PyOS_AfterFork_Child`.

source: Function to update some internal state after a process fork; this should be called in the new process if the Python interpreter will continue to be used. If a new executable is loaded into the new process, this function does not need to be called.
es: Función para actualizar algún estado interno después de una bifurcación de proceso (*process fork*); Esto debería llamarse en el nuevo proceso si el intérprete de Python continuará siendo utilizado. Si se carga un nuevo ejecutable en el nuevo proceso, no es necesario llamar a esta función.

source: This function is superseded by :c:func:`PyOS_AfterFork_Child()`.
es: Esta función es reemplazada por :c:func:`PyOS_AfterFork_Child()`.

source: This function should not be called directly: use the :c:type:`PyConfig` API with the :c:func:`PyConfig_SetBytesString` function which ensures that :ref:`Python is preinitialized <c-preinit>`.
es: Esta función no debe llamarse directamente: utilice la API :c:type:`PyConfig` con la función :c:func:`PyConfig_SetBytesString` que asegura que :ref:`Python está preinicializado <c-preinit>`.

source: This function must not be called before :ref:`Python is preinitialized <c-preinit>` and so that the LC_CTYPE locale is properly configured: see the :c:func:`Py_PreInitialize` function.
es: Esta función no debe llamarse antes de que :ref:`Python esté preinicializado <c-preinit>` y para que la configuración local LC_CTYPE esté correctamente configurada: véase la función :c:func:`Py_PreInitialize`.

source: Decode a byte string from the :term:`filesystem encoding and error handler`. If the error handler is :ref:`surrogateescape error handler <surrogateescape>`, undecodable bytes are decoded as characters in range U+DC80..U+DCFF; and if a byte sequence can be decoded as a surrogate character, the bytes are escaped using the surrogateescape error handler instead of decoding them.
es: Decodifica una cadena de bytes a partir del :term:`manejador de codificación y errores del sistema de archivos <filesystem encoding and error handler>`. Si el controlador de error es el :ref:`controlador de error surrogateescape <surrogateescape>`, los bytes no codificables se decodifican como caracteres en el rango U+DC80..U+DCFF; y si una secuencia de bytes se puede decodificar como un carácter sustituto, escape los bytes usando el controlador de error surrogateescape en lugar de decodificarlos.

source: Return a pointer to a newly allocated wide character string, use :c:func:`PyMem_RawFree` to free the memory. If size is not ``NULL``, write the number of wide characters excluding the null character into ``*size``
es: Retorna un puntero a una cadena de caracteres anchos recientemente asignada, use :c:func:`PyMem_RawFree` para liberar la memoria. Si el tamaño no es ``NULL``, escribe el número de caracteres anchos excluyendo el carácter nulo en ``*size``

source: Return ``NULL`` on decoding error or memory allocation error. If *size* is not ``NULL``, ``*size`` is set to ``(size_t)-1`` on memory error or set to ``(size_t)-2`` on decoding error.
es: Retorna ``NULL`` en caso de error de decodificación o error de asignación de memoria. Si *size* no es ``NULL``, ``*size`` se establece en ``(size_t) -1`` en caso de error de memoria o en ``(size_t) -2`` en caso de error de decodificación.

source: The :term:`filesystem encoding and error handler` are selected by :c:func:`PyConfig_Read`: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
es: El :term:`filesystem encoding and error handler` son seleccionados por :c:func:`PyConfig_Read`: ver :c:member:`~PyConfig.filesystem_encoding` y :c:member:`~PyConfig.filesystem_errors` que pertenecen a :c:type:`PyConfig`.

source: Decoding errors should never happen, unless there is a bug in the C library.
es: Los errores de decodificación nunca deberían ocurrir, a menos que haya un error en la biblioteca C.

source: Use the :c:func:`Py_EncodeLocale` function to encode the character string back to a byte string.
es: Utilice la función :c:func:`Py_EncodeLocale` para codificar la cadena de caracteres en una cadena de bytes.

source: The :c:func:`PyUnicode_DecodeFSDefaultAndSize` and :c:func:`PyUnicode_DecodeLocaleAndSize` functions.
es: Las funciones :c:func:`PyUnicode_DecodeFSDefaultAndSize` y :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: The function now uses the UTF-8 encoding in the :ref:`Python UTF-8 Mode <utf8-mode>`.
es: La función ahora utiliza la codificación UTF-8 en el :ref:`Modo Python UTF-8 <utf8-mode>`.

source: Encode a wide character string to the :term:`filesystem encoding and error handler`. If the error handler is :ref:`surrogateescape error handler <surrogateescape>`, surrogate characters in the range U+DC80..U+DCFF are converted to bytes 0x80..0xFF.
es: Codifica una cadena de caracteres amplios según el término :term:`filesystem encoding and error handler`. Si el gestor de errores es :ref:`surrogateescape error handler <surrogateescape>`, los caracteres sustituidos en el rango U+DC80..U+DCFF se convierten en bytes 0x80..0xFF.

source: Return a pointer to a newly allocated byte string, use :c:func:`PyMem_Free` to free the memory. Return ``NULL`` on encoding error or memory allocation error.
es: Retorna un puntero a una cadena de bytes recién asignada, usa :c:func:`PyMem_Free` para liberar la memoria. Retorna ``NULL`` si se genera un error de codificación o error de asignación de memoria.

source: If error_pos is not ``NULL``, ``*error_pos`` is set to ``(size_t)-1`` on success, or set to the index of the invalid character on encoding error.
es: Si *error_pos* no es ``NULL``, ``*error_pos`` se establece en ``(size_t)-1`` en caso de éxito, o se establece en el índice del carácter no válido en el error de codificación.

source: Use the :c:func:`Py_DecodeLocale` function to decode the bytes string back to a wide character string.
es: Use la función :c:func:`Py_DecodeLocale` para decodificar la cadena de bytes en una cadena de caracteres anchos.

source: The :c:func:`PyUnicode_EncodeFSDefault` and :c:func:`PyUnicode_EncodeLocale` functions.
es: Las funciones :c:func:`PyUnicode_EncodeFSDefault` y :c:func:`PyUnicode_EncodeLocale`.

source: System Functions
es: Funciones del Sistema

source: These are utility functions that make functionality from the :mod:`sys` module accessible to C code. They all work with the current interpreter thread's :mod:`sys` module's dict, which is contained in the internal thread state structure.
es: Estas son funciones de utilidad que hacen que la funcionalidad del módulo :mod:`sys` sea accesible para el código C. Todos funcionan con el diccionario del módulo :mod:`sys` del subproceso actual del intérprete, que está contenido en la estructura interna del estado del subproceso.

source: Return the object *name* from the :mod:`sys` module or ``NULL`` if it does not exist, without setting an exception.
es: Retorna el objeto *name* del módulo :mod:`sys` o ``NULL`` si no existe, sin establecer una excepción.

source: Set *name* in the :mod:`sys` module to *v* unless *v* is ``NULL``, in which case *name* is deleted from the sys module. Returns ``0`` on success, ``-1`` on error.
es: Establece *name* en el módulo :mod:`sys` en *v* a menos que *v* sea ``NULL``, en cuyo caso *name* se elimina del módulo *sys*. Retorna ``0`` en caso de éxito, ``-1`` en caso de error.

source: Reset :data:`sys.warnoptions` to an empty list. This function may be called prior to :c:func:`Py_Initialize`.
es: Restablece :data:`sys.warnoptions` a una lista vacía. Esta función puede llamarse antes de :c:func:`Py_Initialize`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.warnoptions` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
es: Esta API se mantiene para conservar compatibilidad con versiones anteriores, en su lugar se debe usar: :c:member:`PyConfig.warnoptions`, ver :ref:`Configuración de inicialización de Python <init-config>`.

source: Append *s* to :data:`sys.warnoptions`. This function must be called prior to :c:func:`Py_Initialize` in order to affect the warnings filter list.
es: Agrega *s* a :data:`sys.warnoptions`. Esta función debe llamarse antes de :c:func:`Py_Initialize` para afectar la lista de filtros de advertencias.

source: Append *unicode* to :data:`sys.warnoptions`.
es: Agrega *unicode* a :data:`sys.warnoptions`.

source: Note: this function is not currently usable from outside the CPython implementation, as it must be called prior to the implicit import of :mod:`warnings` in :c:func:`Py_Initialize` to be effective, but can't be called until enough of the runtime has been initialized to permit the creation of Unicode objects.
es: Nota: esta función no se puede utilizar actualmente desde fuera de la implementación de CPython, ya que debe llamarse antes de la importación implícita de :mod:`warnings` en :c:func:`Py_Initialize` para que sea efectiva, pero no se puede llamar hasta que se haya inicializado suficiente tiempo de ejecución para permitir la creación de objetos Unicode.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.module_search_paths` and :c:member:`PyConfig.module_search_paths_set` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
es: Esta API se mantiene para conservar compatibilidad con versiones anteriores, en su lugar se debe usar: :c:member:`PyConfig.module_search_paths` y :c:member:`PyConfig.module_search_paths_set`, ver :ref:`Python Initialization Configuration <init-config>`.

source: Set :data:`sys.path` to a list object of paths found in *path* which should be a list of paths separated with the platform's search path delimiter (``:`` on Unix, ``;`` on Windows).
es: Establece :data:`sys.path` en un objeto lista de rutas que se encuentra en *path*, que debería ser una lista de rutas separadas con el delimitador de ruta de búsqueda de la plataforma (``:`` en Unix, ``;`` en Windows )

source: Write the output string described by *format* to :data:`sys.stdout`. No exceptions are raised, even if truncation occurs (see below).
es: Escribe la cadena de caracteres de salida descrita por *format* en :data:`sys.stdout`. No se lanzan excepciones, incluso si se produce el truncamiento (ver más abajo).

source: *format* should limit the total size of the formatted output string to 1000 bytes or less -- after 1000 bytes, the output string is truncated. In particular, this means that no unrestricted "%s" formats should occur; these should be limited using "%.<N>s" where <N> is a decimal number calculated so that <N> plus the maximum size of other formatted text does not exceed 1000 bytes. Also watch out for "%f", which can print hundreds of digits for very large numbers.
es: *format* debe limitar el tamaño total de la cadena de caracteres de salida formateada a 1000 bytes o menos; después de 1000 bytes, la cadena de caracteres de salida se trunca. En particular, esto significa que no deben existir formatos "%s" sin restricciones; estos deben limitarse usando "%.<N>s" donde <N> es un número decimal calculado de modo que <N> más el tamaño máximo de otro texto formateado no exceda los 1000 bytes. También tenga cuidado con "%f", que puede imprimir cientos de dígitos para números muy grandes.

source: If a problem occurs, or :data:`sys.stdout` is unset, the formatted message is written to the real (C level) *stdout*.
es: Si ocurre un problema, o :data:`sys.stdout` no está configurado, el mensaje formateado se escribe en el real (nivel C) *stdout*.

source: As :c:func:`PySys_WriteStdout`, but write to :data:`sys.stderr` or *stderr* instead.
es: Como :c:func:`PySys_WriteStdout`, pero escribe a :data:`sys.stderr` o *stderr* en su lugar.

source: Function similar to PySys_WriteStdout() but format the message using :c:func:`PyUnicode_FromFormatV` and don't truncate the message to an arbitrary length.
es: Función similar a ``PySys_WriteStdout()`` pero formatea el mensaje usando :c:func:`PyUnicode_FromFormatV` y no trunca el mensaje a una longitud arbitraria.

source: As :c:func:`PySys_FormatStdout`, but write to :data:`sys.stderr` or *stderr* instead.
es: Como :c:func:`PySys_FormatStdout`, pero escribe a :data:`sys.stderr` o *stderr* en su lugar.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.xoptions` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
es: Esta API se mantiene para conservar compatibilidad con versiones anteriores, en su lugar se debe usar: :c:member:`PyConfig.xoptions`, ver :ref:`Configuración de inicialización de Python <init-config>`.

source: Parse *s* as a set of :option:`-X` options and add them to the current options mapping as returned by :c:func:`PySys_GetXOptions`. This function may be called prior to :c:func:`Py_Initialize`.
es: Analiza (*parse*) *s* como un conjunto de opciones :option:`-X` y los agrega a la asignación de opciones actual tal como lo retorna :c:func:`PySys_GetXOptions`. Esta función puede llamarse antes de :c:func:`Py_Initialize`.

source: Return the current dictionary of :option:`-X` options, similarly to :data:`sys._xoptions`. On error, ``NULL`` is returned and an exception is set.
es: Retorna el diccionario actual de opciones :option:`-X`, de manera similar a :data:`sys._xoptions`. En caso de error, se retorna ``NULL`` y se establece una excepción.

source: Raise an auditing event with any active hooks. Return zero for success and non-zero with an exception set on failure.
es: Lanza un evento de auditoría con cualquier gancho activo. Retorna cero para el éxito y no cero con una excepción establecida en caso de error.

source: If any hooks have been added, *format* and other arguments will be used to construct a tuple to pass. Apart from ``N``, the same format characters as used in :c:func:`Py_BuildValue` are available. If the built value is not a tuple, it will be added into a single-element tuple. (The ``N`` format option consumes a reference, but since there is no way to know whether arguments to this function will be consumed, using it may cause reference leaks.)
es: Si se han agregado ganchos, *format* y otros argumentos se utilizarán para construir una tupla para pasar. Además de ``N``, están disponibles los mismos caracteres de formato que los utilizados en :c:func:`Py_BuildValue`. Si el valor generado no es una tupla, se agregará a una tupla de un solo elemento. (La opción de formato ``N`` consume una referencia, pero dado que no hay forma de saber si se consumirán argumentos para esta función, su uso puede causar fugas de referencia).

source: Note that ``#`` format characters should always be treated as :c:type:`Py_ssize_t`, regardless of whether ``PY_SSIZE_T_CLEAN`` was defined.
es: Tenga en cuenta que los caracteres de formato ``#`` deben tratarse como :c:type:`Py_ssize_t`, independientemente de si se definió ``PY_SSIZE_T_CLEAN``.

source: :func:`sys.audit` performs the same function from Python code.
es: :func:`sys.audit` realiza la misma función del código Python.

source: Require :c:type:`Py_ssize_t` for ``#`` format characters. Previously, an unavoidable deprecation warning was raised.
es: Requiere :c:type:`Py_ssize_t` para los caracteres de formato ``#``. Anteriormente, se lanzaba una advertencia de deprecación inevitable.

source: Append the callable *hook* to the list of active auditing hooks. Return zero on success and non-zero on failure. If the runtime has been initialized, also set an error on failure. Hooks added through this API are called for all interpreters created by the runtime.
es: Agrega el *hook* invocable a la lista de hooks de auditoría activos. Retorna cero para el éxito y no cero en caso de error. Si el tiempo de ejecución se ha inicializado, también configura un error en caso de fallo. Los hooks agregados a través de esta API se llaman para todos los intérpretes creados por el tiempo de ejecución.

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
es: El puntero *userData* se pasa a la función gancho. Dado que las funciones de enlace pueden llamarse desde diferentes tiempos de ejecución, este puntero no debe referirse directamente al estado de Python.

source: This function is safe to call before :c:func:`Py_Initialize`. When called after runtime initialization, existing audit hooks are notified and may silently abort the operation by raising an error subclassed from :class:`Exception` (other errors will not be silenced).
es: Es seguro llamar a esta función antes de :c:func:`Py_Initialize`. Cuando se llama después de la inicialización del tiempo de ejecución, se notifican los enlaces de auditoría existentes y pueden anular silenciosamente la operación al generar un error subclasificado de :class:`Excepción` (otros errores no se silenciarán).

source: The hook function is of type :c:expr:`int (*)(const char *event, PyObject *args, void *userData)`, where *args* is guaranteed to be a :c:type:`PyTupleObject`. The hook function is always called with the GIL held by the Python interpreter that raised the event.
es: La función (*hook*) es de tipo :c:expr:`int (*)(const char *event, PyObject *args, void *userData)`, donde *args* está garantizado como un :c:type:`PyTupleObject`. La función hook siempre se llama con el GIL en poder del intérprete de Python que lanzó el evento.

source: See :pep:`578` for a detailed description of auditing. Functions in the runtime and standard library that raise events are listed in the :ref:`audit events table <audit-events>`. Details are in each function's documentation.
es: Ver :pep:`578` para una descripción detallada de la auditoría. Las funciones en el tiempo de ejecución y la biblioteca estándar que generan eventos se enumeran en :ref:`table de eventos de auditoria <audit-events>`. Los detalles se encuentran en la documentación de cada función.

source: Raises an :ref:`auditing event <auditing>` ``sys.addaudithook`` with no arguments.
es: Lanza un :ref:`evento de auditoria <auditing>` ``sys.addaudithook`` sin argumentos.

source: If the interpreter is initialized, this function raises a auditing event ``sys.addaudithook`` with no arguments. If any existing hooks raise an exception derived from :class:`Exception`, the new hook will not be added and the exception is cleared. As a result, callers cannot assume that their hook has been added unless they control all existing hooks.
es: Si el intérprete se inicializa, esta función lanza un evento de auditoría ``sys.addaudithook`` sin argumentos. Si algún enlace existente lanza una excepción derivada de :class:`Exception`, el nuevo gancho no se agregará y la excepción se borrará. Como resultado, las personas que llaman no pueden asumir que su gancho ha sido agregado a menos que controlen todos los ganchos existentes.

source: Process Control
es: Control de procesos

source: The ``Py_FatalError()`` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined.
es: La función ``Py_FatalError()`` se reemplaza con una macro que registra automáticamente el nombre de la función actual, a menos que se defina la macro ``Py_LIMITED_API``.

source: Log the function name automatically.
es: Registra el nombre de la función automáticamente.

source: Exit the current process. This calls :c:func:`Py_FinalizeEx` and then calls the standard C library function ``exit(status)``. If :c:func:`Py_FinalizeEx` indicates an error, the exit status is set to 120.
es: Sale del proceso actual. Esto llama :c:func:`Py_FinalizeEx` y luego llama a la función estándar de la biblioteca C ``exit(status)``. Si :c:func:`Py_FinalizeEx` indica un error, el estado de salida se establece en 120.

source: Errors from finalization no longer ignored.
es: Los errores de finalización ya no se ignoran.
