Repository: python/python-docs-es
Catalog: c-api/unicode.po
Languages: es

source: Unicode Objects and Codecs
es: Objetos y códecs Unicode

source: Unicode Objects
es: Objetos Unicode

source: Since the implementation of :pep:`393` in Python 3.3, Unicode objects internally use a variety of representations, in order to allow handling the complete range of Unicode characters while staying memory efficient. There are special cases for strings where all code points are below 128, 256, or 65536; otherwise, code points must be below 1114112 (which is the full Unicode range).
es: Desde la implementación del :pep:`393` en Python 3.3, los objetos Unicode utilizan internamente una variedad de representaciones, para permitir el manejo del rango completo de caracteres Unicode mientras se mantiene la eficiencia de memoria. Hay casos especiales para cadenas de caracteres donde todos los puntos de código están por debajo de 128, 256 o 65536; de lo contrario, los puntos de código deben estar por debajo de 1114112 (que es el rango completo de Unicode).

source: :c:type:`Py_UNICODE*` and UTF-8 representations are created on demand and cached in the Unicode object. The :c:type:`Py_UNICODE*` representation is deprecated and inefficient; it should be avoided in performance- or memory-sensitive situations.
es: :c:type:`Py_UNICODE *` y las representaciones UTF-8 se crean a pedido y se almacenan en caché en el objeto Unicode. La representación :c:type:`Py_UNICODE *` está en desuso y es ineficiente; debe evitarse en situaciones sensibles al rendimiento o la memoria.

source: Due to the transition between the old APIs and the new APIs, Unicode objects can internally be in two states depending on how they were created:
es: Debido a la transición entre las API antiguas y las API nuevas, los objetos Unicode pueden estar internamente en dos estados dependiendo de cómo se crearon:

source: "canonical" Unicode objects are all objects created by a non-deprecated Unicode API. They use the most efficient representation allowed by the implementation.
es: Los objetos Unicode "canónicos" son todos los objetos creados por una API Unicode no obsoleta. Utilizan la representación más eficiente permitida por la implementación.

source: "legacy" Unicode objects have been created through one of the deprecated APIs (typically :c:func:`PyUnicode_FromUnicode`) and only bear the :c:type:`Py_UNICODE*` representation; you will have to call :c:func:`PyUnicode_READY` on them before calling any other API.
es: Los objetos Unicode "heredados" se han creado a través de una de las API obsoletas (normalmente :c:func:`PyUnicode_FromUnicode`) y solo tienen la representación :c:type:`Py_UNICODE*`; Será necesario llamar a :c:func:`PyUnicode_READY` en ellos antes de llamar a cualquier otra API.

source: Unicode Type
es: Tipo Unicode

source: These are the basic Unicode object types used for the Unicode implementation in Python:
es: Estos son los tipos básicos de objetos Unicode utilizados para la implementación de Unicode en Python:

source: These types are typedefs for unsigned integer types wide enough to contain characters of 32 bits, 16 bits and 8 bits, respectively. When dealing with single Unicode characters, use :c:type:`Py_UCS4`.
es: Estos tipos son definiciones de tipo (*typedefs*) para los tipos 'enteros sin signo' (*unsigned int*) lo suficientemente anchos como para contener caracteres de 32 bits, 16 bits y 8 bits, respectivamente. Cuando se trate con caracteres Unicode individuales, use :c:type:`Py_UCS4`.

source: This is a typedef of :c:type:`wchar_t`, which is a 16-bit type or 32-bit type depending on the platform.
es: Este es una definición de tipo (*typedef*) de :c:type:`wchar_t`, que es un tipo de 16 bits o de 32 bits dependiendo de la plataforma.

source: In previous versions, this was a 16-bit type or a 32-bit type depending on whether you selected a "narrow" or "wide" Unicode version of Python at build time.
es: En versiones anteriores, este era un tipo de 16 bits o de 32 bits, dependiendo de si seleccionó una versión Unicode "estrecha" o "amplia" de Python en el momento de la compilación.

source: These subtypes of :c:type:`PyObject` represent a Python Unicode object. In almost all cases, they shouldn't be used directly, since all API functions that deal with Unicode objects take and return :c:type:`PyObject` pointers.
es: Estos subtipos de :c:type:`PyObject` representan un objeto Python Unicode. En casi todos los casos, no deben usarse directamente, ya que todas las funciones API que se ocupan de objetos Unicode toman y retornan punteros :c:type:`PyObject`.

source: This instance of :c:type:`PyTypeObject` represents the Python Unicode type. It is exposed to Python code as ``str``.
es: Esta instancia de :c:type:`PyTypeObject` representa el tipo Python Unicode. Está expuesto al código de Python como ``str``.

source: The following APIs are really C macros and can be used to do fast checks and to access internal read-only data of Unicode objects:
es: Las siguientes API son realmente macros de C y se pueden utilizar para realizar comprobaciones rápidas y acceder a datos internos de solo lectura de objetos Unicode:

source: Return true if the object *o* is a Unicode object or an instance of a Unicode subtype.
es: Retorna verdadero si el objeto *o* es un objeto Unicode o una instancia de un subtipo Unicode.

source: Return true if the object *o* is a Unicode object, but not an instance of a subtype.
es: Retorna verdadero (*True*) si el objeto *o* es un objeto Unicode, pero no una instancia de un subtipo.

source: Ensure the string object *o* is in the "canonical" representation. This is required before using any of the access macros described below.
es: Asegura que el objeto de cadena de caracteres *o* esté en la representación "canónica". Esto es necesario antes de usar cualquiera de las macros de acceso que se describen a continuación.

source: Returns ``0`` on success and ``-1`` with an exception set on failure, which in particular happens if memory allocation fails.
es: Retorna ``0`` en caso de éxito y ``-1`` con una excepción establecida en caso de error, que ocurre en particular si falla la asignación de memoria.

source: Return the length of the Unicode string, in code points. *o* has to be a Unicode object in the "canonical" representation (not checked).
es: Retorna la longitud de la cadena de caracteres Unicode, en puntos de código. *o* tiene que ser un objeto Unicode en la representación "canónica" (no marcada).

source: Return a pointer to the canonical representation cast to UCS1, UCS2 or UCS4 integer types for direct character access. No checks are performed if the canonical representation has the correct character size; use :c:func:`PyUnicode_KIND` to select the right macro. Make sure :c:func:`PyUnicode_READY` has been called before accessing this.
es: Retorna un puntero a la representación canónica emitida a los tipos enteros UCS1, UCS2 o UCS4 para el acceso directo a los caracteres. No se realizan verificaciones si la representación canónica tiene el tamaño de carácter correcto; use :c:func:`PyUnicode_KIND` para seleccionar el macro correcto. Asegúrese de que se haya llamado a :c:func:`PyUnicode_READY` antes de acceder a esto.

source: Return values of the :c:func:`PyUnicode_KIND` macro.
es: Retorna los valores de la macro :c:func:`PyUnicode_KIND`.

source: Return one of the PyUnicode kind constants (see above) that indicate how many bytes per character this Unicode object uses to store its data. *o* has to be a Unicode object in the "canonical" representation (not checked).
es: Retorna una de las constantes de tipo ``PyUnicode`` (ver arriba) que indican cuántos bytes por carácter utiliza este objeto Unicode para almacenar sus datos. *o* tiene que ser un objeto Unicode en la representación "canónica" (no marcada).

source: Return a void pointer to the raw Unicode buffer. *o* has to be a Unicode object in the "canonical" representation (not checked).
es: Retorna un puntero vacío al búfer Unicode sin formato. *o* tiene que ser un objeto Unicode en la representación "canónica" (no marcada).

source: Write into a canonical representation *data* (as obtained with :c:func:`PyUnicode_DATA`). This macro does not do any sanity checks and is intended for usage in loops. The caller should cache the *kind* value and *data* pointer as obtained from other macro calls. *index* is the index in the string (starts at 0) and *value* is the new code point value which should be written to that location.
es: Escribe en una representación canónica *data* (como se obtiene con :c:func:`PyUnicode_DATA`). Esta macro no realiza ninguna comprobación de cordura y está diseñado para su uso en bucles. La persona que llama debe almacenar en caché el valor *kind* y el puntero *data* como se obtiene de otras llamadas de la macro. *index* es el índice en la cadena de caracteres (comienza en 0) y *value* es el nuevo valor del punto de código que debe escribirse en esa ubicación.

source: Read a code point from a canonical representation *data* (as obtained with :c:func:`PyUnicode_DATA`). No checks or ready calls are performed.
es: Lee un punto de código de una representación canónica *data* (obtenido con :c:func:`PyUnicode_DATA`). No se realizan verificaciones ni llamadas preparadas.

source: Read a character from a Unicode object *o*, which must be in the "canonical" representation. This is less efficient than :c:func:`PyUnicode_READ` if you do multiple consecutive reads.
es: Lee un carácter de un objeto Unicode *o*, que debe estar en la representación "canónica". Esto es menos eficiente que :c:func:`PyUnicode_READ` si realiza varias lecturas consecutivas.

source: Return the maximum code point that is suitable for creating another string based on *o*, which must be in the "canonical" representation. This is always an approximation but more efficient than iterating over the string.
es: Retorna el punto de código máximo adecuado para crear otra cadena de caracteres basada en *o*, que debe estar en la representación "canónica". Esto siempre es una aproximación pero más eficiente que iterar sobre la cadena.

source: Clear the free list. Return the total number of freed items.
es: Borra la lista gratuita. Retorna el número total de artículos liberados.

source: Return the size of the deprecated :c:type:`Py_UNICODE` representation, in code units (this includes surrogate pairs as 2 units). *o* has to be a Unicode object (not checked).
es: Retorna el tamaño de la representación en desuso :c:type:`Py_UNICODE`, en unidades de código (esto incluye pares sustitutos como 2 unidades). *o* tiene que ser un objeto Unicode (no marcado).

source: Part of the old-style Unicode API, please migrate to using :c:func:`PyUnicode_GET_LENGTH`.
es: Parte de la API Unicode de estilo antiguo, por favor migrar para usar :c:func:`PyUnicode_GET_LENGTH`.

source: Return the size of the deprecated :c:type:`Py_UNICODE` representation in bytes. *o* has to be a Unicode object (not checked).
es: Retorna el tamaño de la representación en desuso :c:type:`Py_UNICODE` en bytes. *o* tiene que ser un objeto Unicode (no marcado).

source: Return a pointer to a :c:type:`Py_UNICODE` representation of the object. The returned buffer is always terminated with an extra null code point. It may also contain embedded null code points, which would cause the string to be truncated when used in most C functions. The ``AS_DATA`` form casts the pointer to :c:type:`const char *`. The *o* argument has to be a Unicode object (not checked).
es: Retorna un puntero a una representación :c:type:`Py_UNICODE` del objeto. El búfer retornado siempre termina con un punto de código nulo adicional. También puede contener puntos de código nulo incrustados, lo que provocaría que la cadena de caracteres se truncara cuando se usara en la mayoría de las funciones de C. La forma ``AS_DATA`` arroja el puntero a :c:type:`const char *`. El argumento *o* tiene que ser un objeto Unicode (no marcado).

source: This macro is now inefficient -- because in many cases the :c:type:`Py_UNICODE` representation does not exist and needs to be created -- and can fail (return ``NULL`` with an exception set). Try to port the code to use the new :c:func:`PyUnicode_nBYTE_DATA` macros or use :c:func:`PyUnicode_WRITE` or :c:func:`PyUnicode_READ`.
es: Esta macro ahora es ineficiente, porque en muchos casos la representación :c:type:`Py_UNICODE` no existe y necesita ser creada, y puede fallar (devolver ``NULL`` con un conjunto de excepciones). Intente portar el código para usar las nuevas macros :c:func:`PyUnicode_nBYTE_DATA` o use :c:func:`PyUnicode_WRITE` o :c:func:`PyUnicode_READ`.

source: Part of the old-style Unicode API, please migrate to using the :c:func:`PyUnicode_nBYTE_DATA` family of macros.
es: Parte de la antigua API Unicode, por favor migre para usar la familia de macros :c:func:`PyUnicode_nBYTE_DATA`.

source: Unicode Character Properties
es: Propiedades de caracteres Unicode

source: Unicode provides many different character properties. The most often needed ones are available through these macros which are mapped to C functions depending on the Python configuration.
es: Unicode proporciona muchas propiedades de caracteres diferentes. Los que se necesitan con mayor frecuencia están disponibles a través de estas macros que se asignan a las funciones de C según la configuración de Python.

source: Return ``1`` or ``0`` depending on whether *ch* is a whitespace character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter de espacio en blanco.

source: Return ``1`` or ``0`` depending on whether *ch* is a lowercase character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter en minúscula.

source: Return ``1`` or ``0`` depending on whether *ch* is an uppercase character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter en mayúscula.

source: Return ``1`` or ``0`` depending on whether *ch* is a titlecase character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter en caso de título (*titlecase*).

source: Return ``1`` or ``0`` depending on whether *ch* is a linebreak character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter de salto de línea.

source: Return ``1`` or ``0`` depending on whether *ch* is a decimal character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter decimal o no.

source: Return ``1`` or ``0`` depending on whether *ch* is a digit character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter de dígitos.

source: Return ``1`` or ``0`` depending on whether *ch* is a numeric character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter numérico.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphabetic character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter alfabético.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphanumeric character.
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter alfanumérico.

source: Return ``1`` or ``0`` depending on whether *ch* is a printable character. Nonprintable characters are those characters defined in the Unicode character database as "Other" or "Separator", excepting the ASCII space (0x20) which is considered printable. (Note that printable characters in this context are those which should not be escaped when :func:`repr` is invoked on a string. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.)
es: Retorna ``1`` o ``0`` dependiendo de si *ch* es un carácter imprimible. Los caracteres no imprimibles son aquellos definidos en la base de datos de caracteres Unicode como "Otro" o "Separador", excepto el espacio ASCII (0x20) que se considera imprimible. (Tenga en cuenta que los caracteres imprimibles en este contexto son aquellos a los que no se debe escapar cuando :func:`repr` se invoca en una cadena de caracteres. No tiene relación con el manejo de cadenas de caracteres escritas en :data:`sys.stdout` o :data:`sys.stderr`.)

source: These APIs can be used for fast direct character conversions:
es: Estas API se pueden usar para conversiones caracteres rápidas y directos:

source: Return the character *ch* converted to lower case.
es: Retorna el carácter *ch* convertido a minúsculas.

source: This function uses simple case mappings.
es: Esta función utiliza conversiones simples.

source: Return the character *ch* converted to upper case.
es: Retorna el carácter *ch* convertido a mayúsculas.

source: Return the character *ch* converted to title case.
es: Retorna el carácter *ch* convertido a formato de título (*titlecase*).

source: Return the character *ch* converted to a decimal positive integer. Return ``-1`` if this is not possible. This macro does not raise exceptions.
es: Retorna el carácter *ch* convertido a un entero positivo decimal. Retorna ``-1`` si esto no es posible. Esta macro no genera excepciones.

source: Return the character *ch* converted to a single digit integer. Return ``-1`` if this is not possible. This macro does not raise exceptions.
es: Retorna el carácter *ch* convertido a un entero de un solo dígito. Retorna ``-1`` si esto no es posible. Esta macro no genera excepciones.

source: Return the character *ch* converted to a double. Return ``-1.0`` if this is not possible. This macro does not raise exceptions.
es: Retorna el carácter *ch* convertido a doble. Devuelva ``-1.0`` si esto no es posible. Esta macro no genera excepciones.

source: These APIs can be used to work with surrogates:
es: Estas API se pueden usar para trabajar con sustitutos:

source: Check if *ch* is a surrogate (``0xD800 <= ch <= 0xDFFF``).
es: Comprueba si *ch* es un sustituto (``0xD800 <= ch <= 0xDFFF``).

source: Check if *ch* is a high surrogate (``0xD800 <= ch <= 0xDBFF``).
es: Comprueba si *ch* es un sustituto alto (``0xD800 <= ch <= 0xDFFF``).

source: Check if *ch* is a low surrogate (``0xDC00 <= ch <= 0xDFFF``).
es: Comprueba si *ch* es un sustituto bajo (``0xD800 <= ch <= 0xDFFF``).

source: Join two surrogate characters and return a single Py_UCS4 value. *high* and *low* are respectively the leading and trailing surrogates in a surrogate pair.
es: Une dos caracteres sustitutos y retorna un solo valor Py_UCS4. *high* y *low* son respectivamente los sustitutos iniciales y finales en un par sustituto.

source: Creating and accessing Unicode strings
es: Creando y accediendo a cadenas de caracteres Unicode

source: To create Unicode objects and access their basic sequence properties, use these APIs:
es: Para crear objetos Unicode y acceder a sus propiedades de secuencia básicas, use estas API:

source: Create a new Unicode object. *maxchar* should be the true maximum code point to be placed in the string. As an approximation, it can be rounded up to the nearest value in the sequence 127, 255, 65535, 1114111.
es: Crea un nuevo objeto Unicode. *maxchar* debe ser el punto de código máximo que se colocará en la cadena de caracteres. Como una aproximación, se puede redondear al valor más cercano en la secuencia 127, 255, 65535, 1114111.

source: This is the recommended way to allocate a new Unicode object. Objects created using this function are not resizable.
es: Esta es la forma recomendada de asignar un nuevo objeto Unicode. Los objetos creados con esta función no se pueden redimensionar.

source: Create a new Unicode object with the given *kind* (possible values are :c:macro:`PyUnicode_1BYTE_KIND` etc., as returned by :c:func:`PyUnicode_KIND`). The *buffer* must point to an array of *size* units of 1, 2 or 4 bytes per character, as given by the kind.
es: Crea un nuevo objeto Unicode con el tipo *kind* dado (los valores posibles son :c:macro:`PyUnicode_1BYTE_KIND` etc., según lo retornado por :c:func:`PyUnicode_KIND`). El *búfer* debe apuntar a un vector (*array*) de *tamaño* unidades de 1, 2 o 4 bytes por carácter, según el tipo.

source: Create a Unicode object from the char buffer *u*. The bytes will be interpreted as being UTF-8 encoded. The buffer is copied into the new object. If the buffer is not ``NULL``, the return value might be a shared object, i.e. modification of the data is not allowed.
es: Crea un objeto Unicode desde el búfer de caracteres *u*. Los bytes se interpretarán como codificados en UTF-8. El búfer se copia en el nuevo objeto. Si el búfer no es ``NULL``, el valor de retorno podría ser un objeto compartido, es decir, no se permite la modificación de los datos.

source: If *u* is ``NULL``, this function behaves like :c:func:`PyUnicode_FromUnicode` with the buffer set to ``NULL``. This usage is deprecated in favor of :c:func:`PyUnicode_New`.
es: Si *u* es ``NULL``, esta función se comporta como :c:func:`PyUnicode_FromUnicode` con el búfer establecido en ``NULL``. Este uso se considera obsoleto (*deprecated*) en favor de :c:func:`PyUnicode_New`.

source: Create a Unicode object from a UTF-8 encoded null-terminated char buffer *u*.
es: Crea un objeto Unicode a partir de un búfer *u* de caracteres terminado en nulo y codificado en UTF-8.

source: Take a C :c:func:`printf`\ -style *format* string and a variable number of arguments, calculate the size of the resulting Python Unicode string and return a string with the values formatted into it. The variable arguments must be C types and must correspond exactly to the format characters in the *format* ASCII-encoded string. The following format characters are allowed:
es: Toma una cadena de caracteres *format* con el estilo de :c:func:`printf` en C y un número variable de argumentos, calcula el tamaño de la cadena Python Unicode resultante y retorne una cadena de caracteres con los valores formateados. Los argumentos variables deben ser tipos de C y deben corresponder exactamente a los caracteres de formato en la cadena de caracteres *format* codificada en ASCII. Se permiten los siguientes caracteres de formato:

source: Format Characters
es: Formatear caracteres

source: Type
es: Tipo

source: Comment
es: Comentario

source: The literal % character.
es: El carácter literal %.

source: A single character, represented as a C int.
es: Un solo carácter, representado como un entero (*int*) de C.

source: Equivalent to ``printf("%d")``. [1]_
es: Equivalente a ``printf("%d")``. [1]_

source: Equivalent to ``printf("%u")``. [1]_
es: Equivalente a ``printf("%u")``. [1]_

source: Equivalent to ``printf("%ld")``. [1]_
es: Equivalente a ``printf("%ld")``. [1]_

source: Equivalent to ``printf("%li")``. [1]_
es: Equivalente a ``printf("%li")``. [1]_

source: Equivalent to ``printf("%lu")``. [1]_
es: Equivalente a ``printf("%lu")``. [1]_

source: Equivalent to ``printf("%lld")``. [1]_
es: Equivalente a ``printf("%lld")``. [1]_

source: Equivalent to ``printf("%lli")``. [1]_
es: Equivalente a ``printf("%lli")``. [1]_

source: Equivalent to ``printf("%llu")``. [1]_
es: Equivalente a ``printf("%llu")``. [1]_

source: Equivalent to ``printf("%zd")``. [1]_
es: Equivalente a ``printf("%zd")``. [1]_

source: Equivalent to ``printf("%zi")``. [1]_
es: Equivalente a ``printf("%zi")``. [1]_

source: Equivalent to ``printf("%zu")``. [1]_
es: Equivalente a ``printf("%zu")``. [1]_

source: Equivalent to ``printf("%i")``. [1]_
es: Equivalente a ``printf("%i")``. [1]_

source: Equivalent to ``printf("%x")``. [1]_
es: Equivalente a ``printf("%x")``. [1]_

source: A null-terminated C character array.
es: Un arreglo de caracteres de C terminada en nulo.

source: The hex representation of a C pointer. Mostly equivalent to ``printf("%p")`` except that it is guaranteed to start with the literal ``0x`` regardless of what the platform's ``printf`` yields.
es: La representación hexadecimal de un puntero en C. Principalmente equivalente a ``printf("%p")`` excepto que se garantiza que comience con el literal ``0x``, independiente de lo que produzca el ``printf`` de la plataforma.

source: The result of calling :func:`ascii`.
es: El resultado de llamar :func:`ascii`.
