Repository: python/python-docs-es
Catalog: c-api/unicode.po
Languages: es

source: A Unicode object.
es: Un objeto Unicode.

source: A Unicode object (which may be ``NULL``) and a null-terminated C character array as a second parameter (which will be used, if the first parameter is ``NULL``).
es: Un objeto Unicode (que puede ser ``NULL``) y un arreglo de caracteres de C terminada en nulo como segundo parámetro (que se utilizará, si el primer parámetro es ``NULL``).

source: The result of calling :c:func:`PyObject_Str`.
es: El resultado de llamar :c:func:`PyObject_Str`.

source: The result of calling :c:func:`PyObject_Repr`.
es: El resultado de llamar :c:func:`PyObject_Repr`.

source: An unrecognized format character causes all the rest of the format string to be copied as-is to the result string, and any extra arguments discarded.
es: Un carácter de formato no reconocido hace que todo el resto de la cadena de formato se copie tal cual a la cadena de resultado y se descartan los argumentos adicionales.

source: The width formatter unit is number of characters rather than bytes. The precision formatter unit is number of bytes for ``"%s"`` and ``"%V"`` (if the ``PyObject*`` argument is ``NULL``), and a number of characters for ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` and ``"%V"`` (if the ``PyObject*`` argument is not ``NULL``).
es: La unidad del formateador de ancho es el número de caracteres en lugar de bytes. La unidad del formateador de precisión es la cantidad de bytes para ``"%s"`` y ``"%V" `` (si el argumento ``PyObject*`` es ``NULL``), y una cantidad de caracteres para ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` y ``"%V"`` (si el argumento ``PyObject*`` no es ``NULL``).

source: For integer specifiers (d, u, ld, li, lu, lld, lli, llu, zd, zi, zu, i, x): the 0-conversion flag has effect even when a precision is given.
es: Para especificadores de enteros *(d, u, ld, li, lu, lld, lli, llu, zd, zi, zu, i, x)*: el indicador de conversión 0 tiene efecto incluso cuando se proporciona una precisión.

source: Support for ``"%lld"`` and ``"%llu"`` added.
es: Soporte agregado para ``"%lld"`` y ``"%llu"``.

source: Support for ``"%li"``, ``"%lli"`` and ``"%zi"`` added.
es: Soporte agregado para ``"%li"``, ``"%lli"`` y ``"%zi"``.

source: Support width and precision formatter for ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` added.
es: Soporte agregado para formateadores de anchura y precisión para ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"``.

source: Identical to :c:func:`PyUnicode_FromFormat` except that it takes exactly two arguments.
es: Idéntico a :c:func:`PyUnicode_FromFormat` excepto que toma exactamente dos argumentos.

source: Decode an encoded object *obj* to a Unicode object.
es: Decodifica un objeto codificado *obj* en un objeto Unicode.

source: :class:`bytes`, :class:`bytearray` and other :term:`bytes-like objects <bytes-like object>` are decoded according to the given *encoding* and using the error handling defined by *errors*. Both can be ``NULL`` to have the interface use the default values (see :ref:`builtincodecs` for details).
es: :class:`bytes`, :class:`bytearray` y otros :term:`los objetos similares a bytes <bytes-like object>` se decodifican de acuerdo con el *encoding* dado y utilizan el manejo de errores definido por *errors*. Ambos pueden ser ``NULL`` para que la interfaz use los valores predeterminados (ver :ref:`builtincodecs` para más detalles).

source: All other objects, including Unicode objects, cause a :exc:`TypeError` to be set.
es: Todos los demás objetos, incluidos los objetos Unicode, hacen que se establezca un :exc:`TypeError`.

source: The API returns ``NULL`` if there was an error. The caller is responsible for decref'ing the returned objects.
es: La API retorna ``NULL`` si hubo un error. La entidad que hace la llamadas es la responsable de desreferenciar los objetos retornados.

source: Return the length of the Unicode object, in code points.
es: Retorna la longitud del objeto Unicode, en puntos de código.

source: Copy characters from one Unicode object into another. This function performs character conversion when necessary and falls back to :c:func:`memcpy` if possible. Returns ``-1`` and sets an exception on error, otherwise returns the number of copied characters.
es: Copia caracteres de un objeto Unicode en otro. Esta función realiza la conversión de caracteres cuando es necesario y recurre a :c:func:`memcpy` si es posible. Retorna ``-1`` y establece una excepción en caso de error; de lo contrario, retorna el número de caracteres copiados.

source: Fill a string with a character: write *fill_char* into ``unicode[start:start+length]``.
es: Rellena una cadena con un carácter: escriba *fill_char* en ``unicode[inicio:inicio+longitud]``.

source: Fail if *fill_char* is bigger than the string maximum character, or if the string has more than 1 reference.
es: Falla si *fill_char* es más grande que el carácter máximo de la cadena, o si la cadena tiene más de 1 referencia.

source: Return the number of written character, or return ``-1`` and raise an exception on error.
es: Retorna el número de caracteres escritos o retorna ``-1`` y genera una excepción en caso de error.

source: Write a character to a string. The string must have been created through :c:func:`PyUnicode_New`. Since Unicode strings are supposed to be immutable, the string must not be shared, or have been hashed yet.
es: Escribe un carácter en una cadena de caracteres. La cadena debe haberse creado a través de :c:func:`PyUnicode_New`. Dado que se supone que las cadenas de caracteres Unicode son inmutables, la cadena no debe compartirse o no se ha cifrado todavía.

source: This function checks that *unicode* is a Unicode object, that the index is not out of bounds, and that the object can be modified safely (i.e. that it its reference count is one).
es: Esta función comprueba que *unicode* es un objeto Unicode, que el índice no está fuera de los límites y que el objeto se puede modificar de forma segura (es decir, si su número de referencia es uno).

source: Read a character from a string. This function checks that *unicode* is a Unicode object and the index is not out of bounds, in contrast to the macro version :c:func:`PyUnicode_READ_CHAR`.
es: Lee un carácter de una cadena de caracteres. Esta función verifica que *unicode* es un objeto Unicode y que el índice no está fuera de límites, en contraste con la versión de macro :c:func:`PyUnicode_READ_CHAR`.

source: Return a substring of *str*, from character index *start* (included) to character index *end* (excluded). Negative indices are not supported.
es: Retorna una subcadena de caracteres de *str*, desde el índice de caracteres *start* (incluido) al índice de caracteres *end* (excluido). Los índices negativos no son compatibles.

source: Copy the string *u* into a UCS4 buffer, including a null character, if *copy_null* is set. Returns ``NULL`` and sets an exception on error (in particular, a :exc:`SystemError` if *buflen* is smaller than the length of *u*). *buffer* is returned on success.
es: Copia la cadena de caracteres *u* en un búfer UCS4, incluido un carácter nulo, si *copy_null* está configurado. Retorna ``NULL`` y establece una excepción en caso de error (en particular, a :exc:`SystemError` si *buflen* es menor que la longitud de *u*). *buffer* se retorna en caso de éxito.

source: Copy the string *u* into a new UCS4 buffer that is allocated using :c:func:`PyMem_Malloc`. If this fails, ``NULL`` is returned with a :exc:`MemoryError` set. The returned buffer always has an extra null code point appended.
es: Copia la cadena de caracteres *u* en un nuevo búfer UCS4 que se asigna usando :c:func:`PyMem_Malloc`. Si esto falla, se retorna ``NULL`` con un :exc:`MemoryError` establecido. El búfer retornado siempre tiene un punto de código nulo adicional agregado.

source: Deprecated Py_UNICODE APIs
es: APIs de Py_UNICODE deprecadas

source: These API functions are deprecated with the implementation of :pep:`393`. Extension modules can continue using them, as they will not be removed in Python 3.x, but need to be aware that their use can now cause performance and memory hits.
es: Estas funciones API están en desuso con la implementación de :pep:`393`. Los módulos de extensión pueden continuar usándolos, ya que no se eliminarán en Python 3.x, pero deben ser conscientes de que su uso ahora puede causar problemas de rendimiento y memoria.

source: Create a Unicode object from the Py_UNICODE buffer *u* of the given size. *u* may be ``NULL`` which causes the contents to be undefined. It is the user's responsibility to fill in the needed data. The buffer is copied into the new object.
es: Crea un objeto Unicode desde el búfer Py_UNICODE *u* del tamaño dado. *u* puede ser ``NULL``, lo que hace que el contenido no esté definido. Es responsabilidad del usuario completar los datos necesarios. El búfer se copia en el nuevo objeto.

source: If the buffer is not ``NULL``, the return value might be a shared object. Therefore, modification of the resulting Unicode object is only allowed when *u* is ``NULL``.
es: Si el búfer no es ``NULL``, el valor de retorno podría ser un objeto compartido. Por lo tanto, la modificación del objeto Unicode resultante solo se permite cuando *u* es ``NULL``.

source: If the buffer is ``NULL``, :c:func:`PyUnicode_READY` must be called once the string content has been filled before using any of the access macros such as :c:func:`PyUnicode_KIND`.
es: Si el búfer es ``NULL``, se debe llamar a :c:func:`PyUnicode_READY` una vez que se haya llenado el contenido de la cadena de caracteres antes de usar cualquiera de las macros de acceso, como :c:func:`PyUnicode_KIND`.

source: Please migrate to using :c:func:`PyUnicode_FromKindAndData`, :c:func:`PyUnicode_FromWideChar` or :c:func:`PyUnicode_New`.
es: Por favor migrar para usar :c:func:`PyUnicode_FromKindAndData`, :c:func:`PyUnicode_FromWideChar` o :c:func:`PyUnicode_New`.

source: Return a read-only pointer to the Unicode object's internal :c:type:`Py_UNICODE` buffer, or ``NULL`` on error. This will create the :c:type:`Py_UNICODE*` representation of the object if it is not yet available. The buffer is always terminated with an extra null code point. Note that the resulting :c:type:`Py_UNICODE` string may also contain embedded null code points, which would cause the string to be truncated when used in most C functions.
es: Retorna un puntero de solo lectura al búfer :c:type:`Py_UNICODE` interno del objeto Unicode, o ``NULL`` en caso de error. Esto creará la representación :c:type:`Py_UNICODE*` del objeto si aún no está disponible. El búfer siempre termina con un punto de código nulo adicional. Tenga en cuenta que la cadena de caracteres resultante :c:type:`Py_UNICODE` también puede contener puntos de código nulo incrustados, lo que provocaría que la cadena se truncara cuando se usara en la mayoría de las funciones de C.

source: Please migrate to using :c:func:`PyUnicode_AsUCS4`, :c:func:`PyUnicode_AsWideChar`, :c:func:`PyUnicode_ReadChar` or similar new APIs.
es: Por favor migrar para usar :c:func:`PyUnicode_AsUCS4`, :c:func:`PyUnicode_AsWideChar`, :c:func:`PyUnicode_ReadChar` o API nuevas similares.

source: Create a Unicode object by replacing all decimal digits in :c:type:`Py_UNICODE` buffer of the given *size* by ASCII digits 0--9 according to their decimal value. Return ``NULL`` if an exception occurs.
es: Crea un objeto Unicode reemplazando todos los dígitos decimales en el búfer :c:type:`Py_UNICODE` del *size* dado por dígitos ASCII 0--9 de acuerdo con su valor decimal. Retorna ``NULL`` si ocurre una excepción.

source: Like :c:func:`PyUnicode_AsUnicode`, but also saves the :c:func:`Py_UNICODE` array length (excluding the extra null terminator) in *size*. Note that the resulting :c:type:`Py_UNICODE*` string may contain embedded null code points, which would cause the string to be truncated when used in most C functions.
es: Como :c:func:`PyUnicode_AsUnicode`, pero también guarda la longitud del arreglo :c:func:`Py_UNICODE` (excluyendo el terminador nulo adicional) en *size*. Tenga en cuenta que la cadena de caracteres resultante :c:type:`Py_UNICODE*` puede contener puntos de código nulo incrustados, lo que provocaría que la cadena se truncara cuando se usara en la mayoría de las funciones de C.

source: Create a copy of a Unicode string ending with a null code point. Return ``NULL`` and raise a :exc:`MemoryError` exception on memory allocation failure, otherwise return a new allocated buffer (use :c:func:`PyMem_Free` to free the buffer). Note that the resulting :c:type:`Py_UNICODE*` string may contain embedded null code points, which would cause the string to be truncated when used in most C functions.
es: Crea una copia de una cadena de caracteres Unicode que termina con un punto de código nulo. Retorna ``NULL`` y genera una excepción :exc:`MemoryError` en caso de fallo de asignación de memoria; de lo contrario, retorna un nuevo búfer asignado (use :c:func:`PyMem_Free` para liberar el búfer). Tenga en cuenta que la cadena de caracteres resultante :c:type:`Py_UNICODE*` puede contener puntos de código nulo incrustados, lo que provocaría que la cadena se truncara cuando se usara en la mayoría de las funciones de C.

source: Please migrate to using :c:func:`PyUnicode_AsUCS4Copy` or similar new APIs.
es: Por favor migrar para usar :c:func:`PyUnicode_AsUCS4Copy` o API nuevas similares.

source: Return the size of the deprecated :c:type:`Py_UNICODE` representation, in code units (this includes surrogate pairs as 2 units).
es: Retorna el tamaño de la representación en desuso :c:type:`Py_UNICODE`, en unidades de código (esto incluye pares sustitutos como 2 unidades).

source: Please migrate to using :c:func:`PyUnicode_GetLength`.
es: Por favor migrar para usar :c:func:`PyUnicode_GetLength`.

source: Copy an instance of a Unicode subtype to a new true Unicode object if necessary. If *obj* is already a true Unicode object (not a subtype), return the reference with incremented refcount.
es: Copia una instancia de un subtipo Unicode a un nuevo objeto Unicode verdadero si es necesario. Si *obj* ya es un verdadero objeto Unicode (no un subtipo), retorne la referencia con un recuento incrementado.

source: Objects other than Unicode or its subtypes will cause a :exc:`TypeError`.
es: Los objetos que no sean Unicode o sus subtipos causarán un :exc:`TypeError`.

source: Locale Encoding
es: Codificación regional

source: The current locale encoding can be used to decode text from the operating system.
es: La codificación local actual se puede utilizar para decodificar texto del sistema operativo.

source: Decode a string from UTF-8 on Android and VxWorks, or from the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The decoder uses ``"strict"`` error handler if *errors* is ``NULL``. *str* must end with a null character but cannot contain embedded null characters.
es: Decodifica una cadena de caracteres UTF-8 en Android y VxWorks, o de la codificación de configuración regional actual en otras plataformas. Los manejadores de errores admitidos son ``"estricto"`` y ``"subrogateescape"`` (:pep:`383`). El decodificador usa el controlador de errores ``"estricto"`` si *errors* es``NULL``. *str* debe terminar con un carácter nulo pero no puede contener caracteres nulos incrustados.

source: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` to decode a string from :c:data:`Py_FileSystemDefaultEncoding` (the locale encoding read at Python startup).
es: Utilice :c:func:`PyUnicode_DecodeFSDefaultAndSize` para decodificar una cadena de :c:data:`Py_FileSystemDefaultEncoding` (la codificación de la configuración regional leída al iniciar Python).

source: This function ignores the Python UTF-8 mode.
es: Esta función ignora el modo Python UTF-8.

source: The :c:func:`Py_DecodeLocale` function.
es: La función :c:func:`Py_DecodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_DecodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
es: La función ahora también usa la codificación de configuración regional actual para el controlador de errores ``subrogateescape``, excepto en Android. Anteriormente, :c:func:`Py_DecodeLocale` se usaba para el ``subrogateescape``, y la codificación local actual se usaba para ``estricto``.

source: Similar to :c:func:`PyUnicode_DecodeLocaleAndSize`, but compute the string length using :c:func:`strlen`.
es: Similar a :c:func:`PyUnicode_DecodeLocaleAndSize`, pero calcula la longitud de la cadena de caracteres usando :c:func:`strlen`.

source: Encode a Unicode object to UTF-8 on Android and VxWorks, or to the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The encoder uses ``"strict"`` error handler if *errors* is ``NULL``. Return a :class:`bytes` object. *unicode* cannot contain embedded null characters.
es: Codifica un objeto Unicode UTF-8 en Android y VxWorks, o en la codificación local actual en otras plataformas. Los manejadores de errores admitidos son ``"estricto" `` y ``"subrogateescape"`` (:pep:`383`). El codificador utiliza el controlador de errores ``"estricto"`` si *errors* es ``NULL``. Retorna un objeto :class:`bytes`. *unicode* no puede contener caracteres nulos incrustados.

source: Use :c:func:`PyUnicode_EncodeFSDefault` to encode a string to :c:data:`Py_FileSystemDefaultEncoding` (the locale encoding read at Python startup).
es: Utilice :c:func:`PyUnicode_EncodeFSDefault` para codificar una cadena de caracteres en :c:data:`Py_FileSystemDefaultEncoding` (la codificación de la configuración regional leída al iniciar Python).

source: The :c:func:`Py_EncodeLocale` function.
es: La función :c:func:`Py_EncodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_EncodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
es: La función ahora también usa la codificación de configuración regional actual para el controlador de errores ``subrogateescape``, excepto en Android. Anteriormente, :c:func:`Py_EncodeLocale` se usaba para el ``subrogateescape``, y la codificación local actual se usaba para ``estricto``.

source: File System Encoding
es: Codificación del sistema de archivos

source: To encode and decode file names and other environment strings, :c:data:`Py_FileSystemDefaultEncoding` should be used as the encoding, and :c:data:`Py_FileSystemDefaultEncodeErrors` should be used as the error handler (:pep:`383` and :pep:`529`). To encode file names to :class:`bytes` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`PyUnicode_FSConverter` as the conversion function:
es: Para codificar y decodificar nombres de archivo y otras cadenas de caracteres de entorno, :c:data:`Py_FileSystemDefaultEncoding` debe usarse como codificación, y :c:data:`Py_FileSystemDefaultEncodeErrors` debe usarse como controlador de errores (:pep:`383` y :pep:`529`). Para codificar nombres de archivo a :class:`bytes` durante el análisis de argumentos, se debe usar el convertidor ``"O&"``, pasando :c:func:`PyUnicode_FSConverter` como la función de conversión:

source: ParseTuple converter: encode :class:`str` objects -- obtained directly or through the :class:`os.PathLike` interface -- to :class:`bytes` using :c:func:`PyUnicode_EncodeFSDefault`; :class:`bytes` objects are output as-is. *result* must be a :c:type:`PyBytesObject*` which must be released when it is no longer used.
es: Convertidor *ParseTuple* : codificar objetos :class:`str` -- obtenidos directamente o mediante la interfaz :class:`os.PathLike` -- a :class:`bytes` usando :c:func:`PyUnicode_EncodeFSDefault`; los objetos :class:`bytes` se emiten tal cual. *result* debe ser un :c:type:`PyBytesObject*` que debe liberarse cuando ya no se use.

source: Accepts a :term:`path-like object`.
es: Acepta un objeto similar a una ruta (:term:`path-like object`).

source: To decode file names to :class:`str` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`PyUnicode_FSDecoder` as the conversion function:
es: Para decodificar nombres de archivo a :class:`str` durante el análisis de argumentos, se debe usar el convertidor ``"O&"``, pasando :c:func:`PyUnicode_FSDecoder` como la función de conversión:

source: ParseTuple converter: decode :class:`bytes` objects -- obtained either directly or indirectly through the :class:`os.PathLike` interface -- to :class:`str` using :c:func:`PyUnicode_DecodeFSDefaultAndSize`; :class:`str` objects are output as-is. *result* must be a :c:type:`PyUnicodeObject*` which must be released when it is no longer used.
es: Conversor ``ParseTuple``: decodifica objetos :class:`bytes` -- obtenidos directa o indirectamente a través de la interfaz :class:`os.PathLike` -- a :class:`str` usando :c:func:`PyUnicode_DecodeFSDefaultAndSize`; los objetos :class:`str` se generan tal cual. *result* debe ser :c:type:`PyUnicodeObject*` que debe liberarse cuando ya no se use.

source: Decode a string using :c:data:`Py_FileSystemDefaultEncoding` and the :c:data:`Py_FileSystemDefaultEncodeErrors` error handler.
es: Decodifica una cadena usando :c:data:`Py_FileSystemDefaultEncoding` y el controlador de errores :c:data:`Py_FileSystemDefaultEncodeErrors`.

source: If :c:data:`Py_FileSystemDefaultEncoding` is not set, fall back to the locale encoding.
es: Si :c:data:`Py_FileSystemDefaultEncoding` no está configurado, recurre a la codificación de configuración regional.

source: :c:data:`Py_FileSystemDefaultEncoding` is initialized at startup from the locale encoding and cannot be modified later. If you need to decode a string from the current locale encoding, use :c:func:`PyUnicode_DecodeLocaleAndSize`.
es: :c:data:`Py_FileSystemDefaultEncoding` se inicializa al inicio desde la codificación local y no se puede modificar más tarde. Si se necesita decodificar una cadena de caracteres de la codificación local actual, utilice :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: Use :c:data:`Py_FileSystemDefaultEncodeErrors` error handler.
es: Utilice el controlador de errores :c:data:`Py_FileSystemDefaultEncodeErrors`.

source: Decode a null-terminated string using :c:data:`Py_FileSystemDefaultEncoding` and the :c:data:`Py_FileSystemDefaultEncodeErrors` error handler.
es: Decodifique una cadena terminada en nulo usando :c:data:`Py_FileSystemDefaultEncoding` y el :c:data:`Py_FileSystemDefaultEncodeErrors` controlador de errores.

source: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` if you know the string length.
es: Utilice :c:func:`PyUnicode_DecodeFSDefaultAndSize` si conoce la longitud de la cadena.

source: Encode a Unicode object to :c:data:`Py_FileSystemDefaultEncoding` with the :c:data:`Py_FileSystemDefaultEncodeErrors` error handler, and return :class:`bytes`. Note that the resulting :class:`bytes` object may contain null bytes.
es: Codifica un objeto Unicode para :c:data:`Py_FileSystemDefaultEncoding` con el manejador de errores :c:data:`Py_FileSystemDefaultEncodeErrors`, y retorna :class:`bytes`. Tenga en cuenta que el objeto resultante :class:`bytes` puede contener bytes nulos.

source: :c:data:`Py_FileSystemDefaultEncoding` is initialized at startup from the locale encoding and cannot be modified later. If you need to encode a string to the current locale encoding, use :c:func:`PyUnicode_EncodeLocale`.
es: :c:data:`Py_FileSystemDefaultEncoding` se inicializa al inicio desde la codificación local y no se puede modificar más tarde. Si necesita codificar una cadena a la codificación local actual, utilice :c:func:`PyUnicode_EncodeLocale`.
