Repository: python/python-docs-es
Catalog: c-api/unicode.po
Languages: es

source: Create a Unicode object by decoding *size* bytes of the Raw-Unicode-Escape encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena de caracteres codificada Unicode escapada en bruto (*Raw-Unicode-Escape*) *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: Encode a Unicode object using Raw-Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando Unicode escapado en bruto (*Raw-Unicode-Escape*) y retorna el resultado como un objeto de bytes. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Encode the :c:type:`Py_UNICODE` buffer of the given *size* using Raw-Unicode-Escape and return a bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño *size* dado usando Unicode escapado en bruto (*Raw-Unicode-Escape*) y retorna un objeto de bytes. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsRawUnicodeEscapeString` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsRawUnicodeEscapeString` o :c:func:`PyUnicode_AsEncodedString`.

source: Latin-1 Codecs
es: Códecs Latin-1

source: These are the Latin-1 codec APIs: Latin-1 corresponds to the first 256 Unicode ordinals and only these are accepted by the codecs during encoding.
es: Estas son las API del códec Latin-1: Latin-1 corresponde a los primeros 256 ordinales Unicode y solo estos son aceptados por los códecs durante la codificación.

source: Create a Unicode object by decoding *size* bytes of the Latin-1 encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena de caracteres codificada en latin-1 *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: Encode a Unicode object using Latin-1 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando Latin-1 y retorne el resultado como un objeto de bytes Python. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Encode the :c:type:`Py_UNICODE` buffer of the given *size* using Latin-1 and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño *size* dado usando Latin-1 y retorna un objeto de bytes de Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsLatin1String` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsLatin1String` o :c:func:`PyUnicode_AsEncodedString`.

source: ASCII Codecs
es: Códecs ASCII

source: These are the ASCII codec APIs. Only 7-bit ASCII data is accepted. All other codes generate errors.
es: Estas son las API del códec ASCII. Solo se aceptan datos ASCII de 7 bits. Todos los demás códigos generan errores.

source: Create a Unicode object by decoding *size* bytes of the ASCII encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena de caracteres codificada ASCII *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: Encode a Unicode object using ASCII and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando ASCII y retorna el resultado como un objeto de bytes de Python. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Encode the :c:type:`Py_UNICODE` buffer of the given *size* using ASCII and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño *size* dado utilizando ASCII y retorna un objeto de bytes de Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsASCIIString` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsASCIIString` o :c:func:`PyUnicode_AsEncodedString`.

source: Character Map Codecs
es: Códecs de mapa de caracteres

source: This codec is special in that it can be used to implement many different codecs (and this is in fact what was done to obtain most of the standard codecs included in the :mod:`encodings` package). The codec uses mapping to encode and decode characters. The mapping objects provided must support the :meth:`__getitem__` mapping interface; dictionaries and sequences work well.
es: Este códec es especial porque puede usarse para implementar muchos códecs diferentes (y esto es lo que se hizo para obtener la mayoría de los códecs estándar incluidos en el paquete :mod:`encodings`). El códec utiliza mapeo para codificar y decodificar caracteres. Los objetos de mapeo provistos deben soportar la interfaz de mapeo :meth:`__getitem__`; Los diccionarios y las secuencias funcionan bien.

source: These are the mapping codec APIs:
es: Estos son las API de códec de mapeo:

source: Create a Unicode object by decoding *size* bytes of the encoded string *s* using the given *mapping* object. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena de caracteres codificada *s* usando el objeto *mapping* dado. Retorna ``NULL`` si el códec provocó una excepción.

source: If *mapping* is ``NULL``, Latin-1 decoding will be applied. Else *mapping* must map bytes ordinals (integers in the range from 0 to 255) to Unicode strings, integers (which are then interpreted as Unicode ordinals) or ``None``. Unmapped data bytes -- ones which cause a :exc:`LookupError`, as well as ones which get mapped to ``None``, ``0xFFFE`` or ``'\ufffe'``, are treated as undefined mappings and cause an error.
es: Si *mapping* es ``NULL``, se aplicará la decodificación Latin-1. De lo contrario, *mapping* debe asignar bytes ordinales (enteros en el rango de 0 a 255) a cadenas de caracteres Unicode, enteros (que luego se interpretan como ordinales Unicode) o ``None``. Los bytes de datos sin asignar - los que causan un :exc:`LookupError`, así como los que se asignan a ``None``, ``0xFFFE`` o ``'\ ufffe'``, se tratan como asignaciones indefinidas y causan un error

source: Encode a Unicode object using the given *mapping* object and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando el objeto *mapping* dado y retorna el resultado como un objeto de bytes. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: The *mapping* object must map Unicode ordinal integers to bytes objects, integers in the range from 0 to 255 or ``None``. Unmapped character ordinals (ones which cause a :exc:`LookupError`) as well as mapped to ``None`` are treated as "undefined mapping" and cause an error.
es: El objeto *mapping* debe asignar enteros ordinales Unicode a objetos de bytes, enteros en el rango de 0 a 255 o ``None``. Los ordinales de caracteres no asignados (los que causan un :exc:`LookupError`), así como los asignados a ``Ninguno``, se tratan como "mapeo indefinido" y causan un error.

source: Encode the :c:type:`Py_UNICODE` buffer of the given *size* using the given *mapping* object and return the result as a bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño *size* dado utilizando el objeto *mapping* dado y retorna el resultado como un objeto de bytes. Devuelve ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsCharmapString` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsCharmapString` o :c:func:`PyUnicode_AsEncodedString`.

source: The following codec API is special in that maps Unicode to Unicode.
es: La siguiente API de códec es especial en que asigna Unicode a Unicode.

source: Translate a Unicode object using the given *mapping* object and return the resulting Unicode object. Return ``NULL`` if an exception was raised by the codec.
es: Traduce un objeto Unicode utilizando el objeto *mapping* dado y retorne el objeto Unicode resultante. Retorna ``NULL`` si el códec provocó una excepción.

source: The *mapping* object must map Unicode ordinal integers to Unicode strings, integers (which are then interpreted as Unicode ordinals) or ``None`` (causing deletion of the character). Unmapped character ordinals (ones which cause a :exc:`LookupError`) are left untouched and are copied as-is.
es: El objeto *mapping* debe asignar enteros ordinales Unicode a cadenas de caracteres Unicode, enteros (que luego se interpretan como ordinales Unicode) o ``None`` (causando la eliminación del carácter). Los ordinales de caracteres no asignados (los que causan un :exc:`LookupError`) se dejan intactos y se copian tal cual.

source: Translate a :c:type:`Py_UNICODE` buffer of the given *size* by applying a character *mapping* table to it and return the resulting Unicode object. Return ``NULL`` when an exception was raised by the codec.
es: Traduce un búfer :c:type:`Py_UNICODE` del tamaño *size* dado al aplicarle una tabla de *mapping* de caracteres y devolver el objeto Unicode resultante. Devuelve ``NULL`` cuando el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_Translate`. or :ref:`generic codec based API <codec-registry>`
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_Translate`. o :ref:`generic codec based API <codec-registry>`

source: MBCS codecs for Windows
es: Códecs MBCS para Windows

source: These are the MBCS codec APIs. They are currently only available on Windows and use the Win32 MBCS converters to implement the conversions. Note that MBCS (or DBCS) is a class of encodings, not just one. The target encoding is defined by the user settings on the machine running the codec.
es: Estas son las API de códec MBCS. Actualmente solo están disponibles en Windows y utilizan los convertidores Win32 MBCS para implementar las conversiones. Tenga en cuenta que MBCS (o DBCS) es una clase de codificaciones, no solo una. La codificación de destino está definida por la configuración del usuario en la máquina que ejecuta el códec.

source: Create a Unicode object by decoding *size* bytes of the MBCS encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena de caracteres codificada con MBCS *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeMBCS`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` will not decode trailing lead byte and the number of bytes that have been decoded will be stored in *consumed*.
es: Si *consumed* es ``NULL``, se comporta como :c:func:`PyUnicode_DecodeMBCS`. Si *consumed* no es ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` no decodificará el byte inicial y el número de bytes que se han decodificado se almacenará en *consumed*.

source: Encode a Unicode object using MBCS and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando MBCS y retorne el resultado como un objeto de bytes de Python. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Encode the Unicode object using the specified code page and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec. Use :c:data:`CP_ACP` code page to get the MBCS encoder.
es: Codifica el objeto Unicode utilizando la página de códigos especificada y retorne un objeto de bytes de Python. Retorna ``NULL`` si el códec provocó una excepción. Use la página de códigos :c:data:`CP_ACP` para obtener el codificador MBCS.

source: Encode the :c:type:`Py_UNICODE` buffer of the given *size* using MBCS and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño *size* dado usando MBCS y retorna un objeto de bytes de Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsMBCSString`, :c:func:`PyUnicode_EncodeCodePage` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo :c:type:`Py_UNICODE` de la API; por favor migrar a :c:func:`PyUnicode_AsMBCSString`, :c:func:`PyUnicode_EncodeCodePage` o :c:func:`PyUnicode_AsEncodedString`.

source: Methods & Slots
es: Métodos & Ranuras (*Slots*)

source: Methods and Slot Functions
es: Métodos y funciones de ranura (*Slot*)

source: The following APIs are capable of handling Unicode objects and strings on input (we refer to them as strings in the descriptions) and return Unicode objects or integers as appropriate.
es: Las siguientes API son capaces de manejar objetos Unicode y cadenas de caracteres en la entrada (nos referimos a ellos como cadenas de caracteres en las descripciones) y retorna objetos Unicode o enteros según corresponda.

source: They all return ``NULL`` or ``-1`` if an exception occurs.
es: Todos retornan ``NULL`` o ``-1`` si ocurre una excepción.

source: Concat two strings giving a new Unicode string.
es: Une dos cadenas de caracteres que dan una nueva cadena de caracteres Unicode.

source: Split a string giving a list of Unicode strings. If *sep* is ``NULL``, splitting will be done at all whitespace substrings. Otherwise, splits occur at the given separator. At most *maxsplit* splits will be done. If negative, no limit is set. Separators are not included in the resulting list.
es: Divide una cadena de caracteres dando una lista de cadenas de caracteres Unicode. Si *sep* es ``NULL``, la división se realizará en todas las subcadenas de espacios en blanco. De lo contrario, las divisiones ocurren en el separador dado. A lo sumo se realizarán *maxsplit* divisiones. Si es negativo, no se establece ningún límite. Los separadores no están incluidos en la lista resultante.

source: Split a Unicode string at line breaks, returning a list of Unicode strings. CRLF is considered to be one line break. If *keepend* is ``0``, the Line break characters are not included in the resulting strings.
es: Divide una cadena de caracteres Unicode en los saltos de línea, retornando una lista de cadenas de caracteres Unicode. CRLF se considera un salto de línea. Si *keepend* es ``0``, los caracteres de salto de línea no se incluyen en las cadenas de caracteres resultantes.

source: Translate a string by applying a character mapping table to it and return the resulting Unicode object.
es: Traduce una cadena de caracteres aplicando una tabla de mapeo de caracteres y retorne el objeto Unicode resultante.

source: The mapping table must map Unicode ordinal integers to Unicode ordinal integers or ``None`` (causing deletion of the character).
es: La tabla de mapeo debe mapear enteros ordinales Unicode a enteros ordinales Unicode o ``None`` (causando la eliminación del carácter).

source: Mapping tables need only provide the :meth:`__getitem__` interface; dictionaries and sequences work well. Unmapped character ordinals (ones which cause a :exc:`LookupError`) are left untouched and are copied as-is.
es: Las tablas de mapeo solo necesitan proporcionar la interfaz :meth:`__getitem__`; Los diccionarios y las secuencias funcionan bien. Los ordinales de caracteres no asignados (los que causan un :exc:`LookupError`) se dejan intactos y se copian tal cual.

source: *errors* has the usual meaning for codecs. It may be ``NULL`` which indicates to use the default error handling.
es: *errors* tiene el significado habitual para los códecs. Puede ser ``NULL``, lo que indica que debe usar el manejo de errores predeterminado.

source: Join a sequence of strings using the given *separator* and return the resulting Unicode string.
es: Une una secuencia de cadenas de caracteres usando el *separator* dado y retorna la cadena de caracteres Unicode resultante.

source: Return ``1`` if *substr* matches ``str[start:end]`` at the given tail end (*direction* == ``-1`` means to do a prefix match, *direction* == ``1`` a suffix match), ``0`` otherwise. Return ``-1`` if an error occurred.
es: Retorna ``1`` si *substr* coincide con ``str[start:end]`` en el final de cola dado (*direction* == ``-1`` significa hacer una coincidencia de prefijo, *direction* == ``1`` una coincidencia de sufijo), ``0`` de lo contrario. Devuelva ``-1`` si ocurrió un error.

source: Return the first position of *substr* in ``str[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
es: Retorna la primera posición de *substr* en ``str[start:end]`` usando la *direction* dada (*direction* == ``1`` significa hacer una búsqueda hacia adelante, *direction* == ``-1`` una búsqueda hacia atrás). El valor de retorno es el índice de la primera coincidencia; un valor de ``-1`` indica que no se encontró ninguna coincidencia, y ``-2`` indica que se produjo un error y se ha establecido una excepción.

source: Return the first position of the character *ch* in ``str[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
es: Retorna la primera posición del carácter *ch* en ``str[inicio:fin]`` usando la *direction* dada (*direction* == ``1`` significa hacer una búsqueda hacia adelante, *direction* == ``-1`` una búsqueda hacia atrás). El valor de retorno es el índice de la primera coincidencia; un valor de ``-1`` indica que no se encontró ninguna coincidencia, y ``-2`` indica que se produjo un error y se ha establecido una excepción.

source: *start* and *end* are now adjusted to behave like ``str[start:end]``.
es: *start* y *end* ahora están ajustados para comportarse como ``str[start:end]``.

source: Return the number of non-overlapping occurrences of *substr* in ``str[start:end]``. Return ``-1`` if an error occurred.
es: Retorna el número de ocurrencias no superpuestas de *substr* en ``str[start:end]``. Retorna ``-1`` si ocurrió un error.

source: Replace at most *maxcount* occurrences of *substr* in *str* with *replstr* and return the resulting Unicode object. *maxcount* == ``-1`` means replace all occurrences.
es: Reemplaza como máximo *maxcount* ocurrencias de *substr* en *str* con *replstr* y retorna el objeto Unicode resultante. *maxcount* == ``-1`` significa reemplazar todas las ocurrencias.

source: Compare two strings and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively.
es: Compara dos cadenas de caracteres y retorna ``-1``, ``0``, ``1`` para menor que, igual y mayor que, respectivamente.

source: This function returns ``-1`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
es: Esta función retorna ``-1`` en caso de falla, por lo que se debe llamar a :c:func:`PyErr_Occurred` para verificar si hay errores.

source: Compare a Unicode object, *uni*, with *string* and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively. It is best to pass only ASCII-encoded strings, but the function interprets the input string as ISO-8859-1 if it contains non-ASCII characters.
es: Compare un objeto Unicode, *uni*, con *string* y retorna ``-1``, ``0``, ``1`` para menor que, igual y mayor que, respectivamente. Es mejor pasar solo cadenas de caracteres codificadas en ASCII, pero la función interpreta la cadena de entrada como ISO-8859-1 si contiene caracteres no ASCII.

source: This function does not raise exceptions.
es: Esta función no genera excepciones.

source: Rich compare two Unicode strings and return one of the following:
es: Comparación enriquecida de dos cadenas de caracteres Unicode y retorna uno de los siguientes:

source: ``NULL`` in case an exception was raised
es: ``NULL`` en caso de que se produzca una excepción

source: :const:`Py_True` or :const:`Py_False` for successful comparisons
es: :const:`Py_True` o :const:`Py_False` para comparaciones exitosas

source: :const:`Py_NotImplemented` in case the type combination is unknown
es: :const:`Py_NotImplemented` en caso que se desconozca la combinación de tipos.

source: Possible values for *op* are :const:`Py_GT`, :const:`Py_GE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_LT`, and :const:`Py_LE`.
es: Los posibles valores para *op* son :const:`Py_GT`, :const:`Py_GE`, :const:`Py_EQ`, :const:`Py_NE`, :const:`Py_LT`, y :const:`Py_LE`.

source: Return a new string object from *format* and *args*; this is analogous to ``format % args``.
es: Retorna un nuevo objeto de cadena de caracteres desde *format* y *args*; esto es análogo al ``format % args``.

source: Check whether *element* is contained in *container* and return true or false accordingly.
es: Comprueba si *element* está contenido en *container* y retorna verdadero o falso en consecuencia.

source: *element* has to coerce to a one element Unicode string. ``-1`` is returned if there was an error.
es: *element* tiene que convertir a una cadena de caracteres Unicode. Se retorna ``-1`` si hubo un error.
