Repository: python/python-docs-es
Catalog: c-api/unicode.po
Languages: es

source: wchar_t Support
es: Soporte wchar_t

source: :c:type:`wchar_t` support for platforms which support it:
es: soporte :c:type:`wchar_t` para plataformas que lo soportan:

source: Create a Unicode object from the :c:type:`wchar_t` buffer *w* of the given *size*. Passing ``-1`` as the *size* indicates that the function must itself compute the length, using wcslen. Return ``NULL`` on failure.
es: Crea un objeto Unicode a partir del búfer :c:type:`wchar_t` *w* del tamaño *size* dado. Pasar ``-1`` como *size* indica que la función debe calcular la longitud, usando ``wcslen``. Retorna ``NULL`` en caso de falla.

source: Copy the Unicode object contents into the :c:type:`wchar_t` buffer *w*. At most *size* :c:type:`wchar_t` characters are copied (excluding a possibly trailing null termination character). Return the number of :c:type:`wchar_t` characters copied or ``-1`` in case of an error. Note that the resulting :c:type:`wchar_t*` string may or may not be null-terminated. It is the responsibility of the caller to make sure that the :c:type:`wchar_t*` string is null-terminated in case this is required by the application. Also, note that the :c:type:`wchar_t*` string might contain null characters, which would cause the string to be truncated when used with most C functions.
es: Copia el contenido del objeto Unicode en el búfer :c:type:`wchar_t` *w*. A lo sumo *size* se copian los caracteres :c:type:`wchar_t` (excluyendo un posible carácter de terminación nulo final). Devuelve el número de caracteres :c:type:`wchar_t` copiados o ``-1`` en caso de error. Tenga en cuenta que la cadena resultante :c:type:`wchar_t*` puede o no tener terminación nula. Es responsabilidad de la persona que llama asegurarse de que la cadena :c:type:`wchar_t*` tenga una terminación nula en caso de que la aplicación lo requiera. Además, tenga en cuenta que la cadena :c:type:`wchar_t*` podría contener caracteres nulos, lo que provocaría que la cadena se truncara cuando se usara con la mayoría de las funciones de C.

source: Convert the Unicode object to a wide character string. The output string always ends with a null character. If *size* is not ``NULL``, write the number of wide characters (excluding the trailing null termination character) into *\*size*. Note that the resulting :c:type:`wchar_t` string might contain null characters, which would cause the string to be truncated when used with most C functions. If *size* is ``NULL`` and the :c:type:`wchar_t*` string contains null characters a :exc:`ValueError` is raised.
es: Convierte el objeto Unicode en una cadena de caracteres ancha. La cadena de salida siempre termina con un carácter nulo. Si *size* no es ``NULL``, escribe el número de caracteres anchos (excluyendo el carácter de terminación nulo final) en *\*size*. Tenga en cuenta que la cadena resultante :c:type:`wchar_t` podría contener caracteres nulos, lo que provocaría que la cadena se truncara cuando se usara con la mayoría de las funciones de C. Si *size* es ``NULL`` y la cadena :c:type:`wchar_t*` contiene caracteres nulos un :exc:`ValueError` aparece.

source: Returns a buffer allocated by :c:func:`PyMem_Alloc` (use :c:func:`PyMem_Free` to free it) on success. On error, returns ``NULL`` and *\*size* is undefined. Raises a :exc:`MemoryError` if memory allocation is failed.
es: Retorna un búfer asignado por :c:func:`PyMem_Alloc` (utilice :c:func:`PyMem_Free` para liberarlo) en caso de éxito. En caso de error, retorna ``NULL`` y *\*size* no está definido. Provoca un :exc:`MemoryError` si falla la asignación de memoria.

source: Raises a :exc:`ValueError` if *size* is ``NULL`` and the :c:type:`wchar_t*` string contains null characters.
es: Provoca un :exc:`ValueError` si *size* es ``NULL`` y la cadena :c:type:`wchar_t*` contiene caracteres nulos.

source: Built-in Codecs
es: Códecs incorporados

source: Python provides a set of built-in codecs which are written in C for speed. All of these codecs are directly usable via the following functions.
es: Python proporciona un conjunto de códecs integrados que están escritos en C para mayor velocidad. Todos estos códecs se pueden usar directamente a través de las siguientes funciones.

source: Many of the following APIs take two arguments encoding and errors, and they have the same semantics as the ones of the built-in :func:`str` string object constructor.
es: Muchas de las siguientes API toman dos argumentos de *encoding* y *errors*, y tienen la misma semántica que las del constructor de objetos de cadena incorporado :func:`str`.

source: Setting encoding to ``NULL`` causes the default encoding to be used which is ASCII. The file system calls should use :c:func:`PyUnicode_FSConverter` for encoding file names. This uses the variable :c:data:`Py_FileSystemDefaultEncoding` internally. This variable should be treated as read-only: on some systems, it will be a pointer to a static string, on others, it will change at run-time (such as when the application invokes setlocale).
es: Establecer la codificación en ``NULL`` hace que se use la codificación predeterminada, que es ASCII. Las llamadas al sistema de archivos deben usar :c:func:`PyUnicode_FSConverter` para codificar nombres de archivos. Esto utiliza la variable :c:data:`Py_FileSystemDefaultEncoding` internamente. Esta variable debe tratarse como de solo lectura: en algunos sistemas, será un puntero a una cadena de caracteres estática, en otros, cambiará en tiempo de ejecución (como cuando la aplicación invoca *setlocale*).

source: Error handling is set by errors which may also be set to ``NULL`` meaning to use the default handling defined for the codec. Default error handling for all built-in codecs is "strict" (:exc:`ValueError` is raised).
es: El manejo de errores se establece mediante *errors* que también pueden establecerse en ``NULL``, lo que significa usar el manejo predeterminado definido para el códec. El manejo de errores predeterminado para todos los códecs integrados es "estricto" (se lanza :exc:`ValueError`).

source: The codecs all use a similar interface. Only deviation from the following generic ones are documented for simplicity.
es: Todos los códecs usan una interfaz similar. Solo la desviación de las siguientes genéricas se documenta por simplicidad.

source: Generic Codecs
es: Códecs genéricos

source: These are the generic codec APIs:
es: Estas son las APIs de códecs genéricos:

source: Create a Unicode object by decoding *size* bytes of the encoded string *s*. *encoding* and *errors* have the same meaning as the parameters of the same name in the :func:`str` built-in function. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada *s*. *encoding* y *errors* tienen el mismo significado que los parámetros del mismo nombre en la función incorporada :func:`str`. El códec que se utilizará se busca utilizando el registro de códec Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Encode a Unicode object and return the result as Python bytes object. *encoding* and *errors* have the same meaning as the parameters of the same name in the Unicode :meth:`~str.encode` method. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode y retorna el resultado como un objeto de bytes de Python. *encoding* y *errors* tienen el mismo significado que los parámetros del mismo nombre en el método Unicode :meth:`~str.encode`. El códec que se utilizará se busca utilizando el registro de códec Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Encode the :c:type:`Py_UNICODE` buffer *s* of the given *size* and return a Python bytes object. *encoding* and *errors* have the same meaning as the parameters of the same name in the Unicode :meth:`~str.encode` method. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` *s* del tamaño *size* dado y retorna un objeto de bytes de Python. *encoding* y *errors* tienen el mismo significado que los parámetros del mismo nombre en el método Unicode :meth:`~str.encode`. El códec que se utilizará se busca utilizando el registro de códec Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsEncodedString`.

source: UTF-8 Codecs
es: Códecs UTF-8

source: These are the UTF-8 codec APIs:
es: Estas son las APIs del códec UTF-8:

source: Create a Unicode object by decoding *size* bytes of the UTF-8 encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada UTF-8 *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF8`. If *consumed* is not ``NULL``, trailing incomplete UTF-8 byte sequences will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es: Si *consumed* es ``NULL``, se comporta como :c:func:`PyUnicode_DecodeUTF8`. Si *consumed* no es ``NULL``, las secuencias de bytes UTF-8 incompletas no se tratarán como un error. Esos bytes no serán decodificados y la cantidad de bytes que han sido decodificados se almacenará en *consumed*.

source: Encode a Unicode object using UTF-8 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando UTF-8 y retorna el resultado como un objeto de bytes de Python. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Return a pointer to the UTF-8 encoding of the Unicode object, and store the size of the encoded representation (in bytes) in *size*. The *size* argument can be ``NULL``; in this case no size will be stored. The returned buffer always has an extra null byte appended (not included in *size*), regardless of whether there are any other null code points.
es: Retorna un puntero a la codificación UTF-8 del objeto Unicode y almacena el tamaño de la representación codificada (en bytes) en *size*. El argumento *size* puede ser ``NULL``; en este caso no se almacenará el tamaño. El búfer retornado siempre tiene un byte nulo adicional agregado (no incluido en *size*), independientemente de si hay otros puntos de código nulo.

source: In the case of an error, ``NULL`` is returned with an exception set and no *size* is stored.
es: En caso de error, se retorna ``NULL`` con un conjunto de excepciones y no se almacena *size*.

source: This caches the UTF-8 representation of the string in the Unicode object, and subsequent calls will return a pointer to the same buffer. The caller is not responsible for deallocating the buffer.
es: Esto almacena en caché la representación UTF-8 de la cadena en el objeto Unicode, y las llamadas posteriores devolverán un puntero al mismo búfer. La persona que llama no es responsable de desasignar el búfer.

source: The return type is now ``const char *`` rather of ``char *``.
es: El tipo de retorno ahora es ``const char *`` en lugar de ``char *``.

source: As :c:func:`PyUnicode_AsUTF8AndSize`, but does not store the size.
es: Como :c:func:`PyUnicode_AsUTF8AndSize`, pero no almacena el tamaño.

source: Encode the :c:type:`Py_UNICODE` buffer *s* of the given *size* using UTF-8 and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` *s* del tamaño *size* dado usando UTF-8 y retorna un objeto de bytes de Python. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsUTF8String`, :c:func:`PyUnicode_AsUTF8AndSize` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsUTF8String`, :c:func:`PyUnicode_AsUTF8AndSize` o :c:func:`PyUnicode_AsEncodedString`.

source: UTF-32 Codecs
es: Códecs UTF-32

source: These are the UTF-32 codec APIs:
es: Estas son las APIs de códecs para UTF-32:

source: Decode *size* bytes from a UTF-32 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
es: Decodifica *size* bytes de una cadena de búfer codificada UTF-32 y retorna el objeto Unicode correspondiente. *errors* (si no es ``NULL``) define el manejo de errores. Su valor predeterminado es "estricto".

source: If *byteorder* is non-``NULL``, the decoder starts decoding using the given byte order::
es: Si *byteorder* no es ``NULL``, el decodificador comienza a decodificar utilizando el orden de bytes dado::

source: If ``*byteorder`` is zero, and the first four bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output.
es: Si ``*byteorder`` es cero, y los primeros cuatro bytes de los datos de entrada son una marca de orden de bytes (BOM), el decodificador cambia a este orden de bytes y la BOM no se copia en la cadena de caracteres Unicode resultante. Si ``*byteorder`` es ``-1`` o ``1``, cualquier marca de orden de bytes se copia en la salida.

source: After completion, *\*byteorder* is set to the current byte order at the end of input data.
es: Una vez completado, *\*byteorder* se establece en el orden de bytes actual al final de los datos de entrada.

source: If *byteorder* is ``NULL``, the codec starts in native order mode.
es: Si *byteorder* es ``NULL``, el códec se inicia en modo de orden nativo.

source: Return ``NULL`` if an exception was raised by the codec.
es: Retorna ``NULL`` si el códec provocó una excepción.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF32`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` will not treat trailing incomplete UTF-32 byte sequences (such as a number of bytes not divisible by four) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es: Si *consumed* es ``NULL``, se comporta como :c:func:`PyUnicode_DecodeUTF32`. Si *consumed* no es ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` no tratará las secuencias de bytes UTF-32 incompletas finales (como un número de bytes no divisible por cuatro) como un error. Esos bytes no serán decodificados y la cantidad de bytes que han sido decodificados se almacenará en *consumed*.

source: Return a Python byte string using the UTF-32 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Retorna una cadena de bytes de Python usando la codificación UTF-32 en orden de bytes nativo. La cadena siempre comienza con una marca BOM. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Return a Python bytes object holding the UTF-32 encoded value of the Unicode data in *s*. Output is written according to the following byte order::
es: Retorna un objeto de bytes de Python que contiene el valor codificado UTF-32 de los datos Unicode en *s*. La salida se escribe de acuerdo con el siguiente orden de bytes:

source: If byteorder is ``0``, the output string will always start with the Unicode BOM mark (U+FEFF). In the other two modes, no BOM mark is prepended.
es: Si *byteorder* es ``0``, la cadena de caracteres de salida siempre comenzará con la marca Unicode BOM (U+FEFF). En los otros dos modos, no se antepone ninguna marca BOM.

source: If ``Py_UNICODE_WIDE`` is not defined, surrogate pairs will be output as a single code point.
es: Si ``Py_UNICODE_WIDE`` no está definido, los pares sustitutos se mostrarán como un único punto de código.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsUTF32String` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsUTF32String`. o :c:func:`PyUnicode_AsEncodedString`.

source: UTF-16 Codecs
es: Códecs UTF-16

source: These are the UTF-16 codec APIs:
es: Estas son las APIs de códecs para UTF-16:

source: Decode *size* bytes from a UTF-16 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
es: Decodifica *size* bytes de una cadena de caracteres de búfer codificada UTF-16 y retorna el objeto Unicode correspondiente. *errors* (si no es ``NULL``) define el manejo de errores. Su valor predeterminado es "estricto".

source: If ``*byteorder`` is zero, and the first two bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output (where it will result in either a ``\ufeff`` or a ``\ufffe`` character).
es: Si ``*byteorder`` es cero, y los primeros dos bytes de los datos de entrada son una marca de orden de bytes (BOM), el decodificador cambia a este orden de bytes y la BOM no se copia en la cadena de caracteres Unicode resultante. Si ``*byteorder`` es ``-1`` o ``1``, cualquier marca de orden de bytes se copia en la salida (donde dará como resultado un ``\ufeff`` o un carácter ``\ufffe``).

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF16`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` will not treat trailing incomplete UTF-16 byte sequences (such as an odd number of bytes or a split surrogate pair) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es: Si *consumed* es ``NULL``, se comporta como :c:func:`PyUnicode_DecodeUTF16`. Si *consumed* no es ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` no tratará las secuencias de bytes UTF-16 incompletas finales (como un número impar de bytes o un par sustituto dividido) como un error. Esos bytes no serán decodificados y la cantidad de bytes que han sido decodificados se almacenará en *consumed*.

source: Return a Python byte string using the UTF-16 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Retorna una cadena de bytes de Python usando la codificación UTF-16 en orden de bytes nativo. La cadena siempre comienza con una marca BOM. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Return a Python bytes object holding the UTF-16 encoded value of the Unicode data in *s*. Output is written according to the following byte order::
es: Retorna un objeto de bytes de Python que contiene el valor codificado UTF-16 de los datos Unicode en *s*. La salida se escribe de acuerdo con el siguiente orden de bytes:

source: If ``Py_UNICODE_WIDE`` is defined, a single :c:type:`Py_UNICODE` value may get represented as a surrogate pair. If it is not defined, each :c:type:`Py_UNICODE` values is interpreted as a UCS-2 character.
es: Si se define ``Py_UNICODE_WIDE``, un solo valor de :c:type:`Py_UNICODE` puede representarse como un par sustituto. Si no está definido, cada uno de los valores :c:type:`Py_UNICODE` se interpreta como un carácter UCS-2.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsUTF16String` or :c:func:`PyUnicode_AsEncodedString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsUTF16String`. o :c:func:`PyUnicode_AsEncodedString`.

source: UTF-7 Codecs
es: Códecs UTF-7

source: These are the UTF-7 codec APIs:
es: Estas son las APIs del códec UTF-7:

source: Create a Unicode object by decoding *size* bytes of the UTF-7 encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena de caracteres codificada UTF-7 *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF7`. If *consumed* is not ``NULL``, trailing incomplete UTF-7 base-64 sections will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es: Si *consumed* es ``NULL``, se comporta como :c:func:`PyUnicode_DecodeUTF7`. Si *consumed* no es ``NULL``, las secciones UTF-7 base-64 incompletas no se tratarán como un error. Esos bytes no serán decodificados y la cantidad de bytes que han sido decodificados se almacenará en *consumed*.

source: Encode the :c:type:`Py_UNICODE` buffer of the given size using UTF-7 and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño dado usando UTF-7 y retorna un objeto de bytes de Python. Retorna ``NULL`` si el códec provocó una excepción.

source: If *base64SetO* is nonzero, "Set O" (punctuation that has no otherwise special meaning) will be encoded in base-64. If *base64WhiteSpace* is nonzero, whitespace will be encoded in base-64. Both are set to zero for the Python "utf-7" codec.
es: Si *base64SetO* no es cero, "Set O" (puntuación que no tiene un significado especial) se codificará en base-64. Si *base64WhiteSpace* no es cero, el espacio en blanco se codificará en base-64. Ambos se establecen en cero para el códec Python "utf-7".

source: Unicode-Escape Codecs
es: Códecs Unicode escapado

source: These are the "Unicode Escape" codec APIs:
es: Estas son las APIs de códecs para Unicode escapado:

source: Create a Unicode object by decoding *size* bytes of the Unicode-Escape encoded string *s*. Return ``NULL`` if an exception was raised by the codec.
es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada Unicode escapada (*Unicode-Escape*) *s*. Retorna ``NULL`` si el códec provocó una excepción.

source: Encode a Unicode object using Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es: Codifica un objeto Unicode usando Unicode escapado (*Unicode-Escape*) y retorna el resultado como un objeto de bytes. El manejo de errores es "estricto". Retorna ``NULL`` si el códec provocó una excepción.

source: Encode the :c:type:`Py_UNICODE` buffer of the given *size* using Unicode-Escape and return a bytes object. Return ``NULL`` if an exception was raised by the codec.
es: Codifica el búfer :c:type:`Py_UNICODE` del tamaño *size* dado utilizando Unicode escapado y retorna un objeto de bytes. Retorna ``NULL`` si el códec provocó una excepción.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsUnicodeEscapeString`.
es: Parte del viejo estilo de la API :c:type:`Py_UNICODE`; por favor migrar para usar :c:func:`PyUnicode_AsUnicodeEscapeString`.

source: Raw-Unicode-Escape Codecs
es: Códecs para Unicode escapado en bruto

source: These are the "Raw Unicode Escape" codec APIs:
es: Estas son las API del códec Unicode escapado en bruto (*Raw Unicode Escape*):
