Repository: python/python-docs-es
Catalog: c-api/unicode.po
Languages: es

source: Intern the argument *\*string* in place. The argument must be the address of a pointer variable pointing to a Python Unicode string object. If there is an existing interned string that is the same as *\*string*, it sets *\*string* to it (decrementing the reference count of the old string object and incrementing the reference count of the interned string object), otherwise it leaves *\*string* alone and interns it (incrementing its reference count). (Clarification: even though there is a lot of talk about reference counts, think of this function as reference-count-neutral; you own the object after the call if and only if you owned it before the call.)
es: Interna el argumento *\*string* en su lugar. El argumento debe ser la dirección de una variable de puntero que apunta a un objeto Unicode de cadena de caracteres Python. Si hay una cadena de caracteres interna existente que es igual a *\*string*, establece *\*string* (disminuyendo el recuento de referencias del objeto de cadena de caracteres anterior e incrementando el recuento de referencias del objeto de cadena de caracteres interna), de lo contrario deja solo *\*string* y lo interna (incrementando su recuento de referencias). (Aclaración: a pesar de que se habla mucho sobre el recuento de referencias, piense en esta función como neutral de recuento de referencia; usted es el propietario del objeto después de la llamada si y solo si lo tenía antes de la llamada).

source: A combination of :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace`, returning either a new Unicode string object that has been interned, or a new ("owned") reference to an earlier interned string object with the same value.
es: Una combinación de :c:func:`PyUnicode_FromString` y :c:func:`PyUnicode_InternInPlace`, que retorna un nuevo objeto de cadena de caracteres Unicode que ha sido creado internamente o una nueva referencia("propia") a un objeto de cadena de caracteres interno anterior con el mismo valor
