Repository: python/python-docs-es
Catalog: c-api/veryhigh.po
Languages: es

source: This function changes the flags of the current evaluation frame, and returns true on success, false on failure.
es: Esta función cambia los flags del marco de evaluación actual, y retorna verdad (*true*) en caso de éxito, falso (*false*) en caso de fallo.

source: The start symbol from the Python grammar for isolated expressions; for use with :c:func:`Py_CompileString`.
es: El símbolo de inicio de la gramática de Python para expresiones aisladas; para usar con :c:func:`Py_CompileString`.

source: The start symbol from the Python grammar for sequences of statements as read from a file or other source; for use with :c:func:`Py_CompileString`. This is the symbol to use when compiling arbitrarily long Python source code.
es: El símbolo de inicio de la gramática de Python para secuencias de declaración leídos desde un archivo u otra fuente; para usar con :c:func:`Py_CompileString`. Este es el símbolo usado cuando se compile un código fuente en Python arbitrariamente largo.

source: The start symbol from the Python grammar for a single statement; for use with :c:func:`Py_CompileString`. This is the symbol used for the interactive interpreter loop.
es: El símbolo de inicio de la gramática de Python para una declaración única; para usar con :c:func:`Py_CompileString`. Este es el símbolo usado para el bucle interactivo del intérprete.

source: This is the structure used to hold compiler flags. In cases where code is only being compiled, it is passed as ``int flags``, and in cases where code is being executed, it is passed as ``PyCompilerFlags *flags``. In this case, ``from __future__ import`` can modify *flags*.
es: Esta es la estructura usada para contener los flags del compilador. En casos donde el código es sólo compilado, es pasado como ``int flags``, y en casos donde el código es ejecutado, es pasado como ``PyCompilerFlags *flags``. En este caso, ``from __future__ import`` puede modificar los *flags*.

source: Whenever ``PyCompilerFlags *flags`` is ``NULL``, :attr:`cf_flags` is treated as equal to ``0``, and any modification due to ``from __future__ import`` is discarded.
es: Siempre y cuando ``PyCompilerFlags *flags`` es ``NULL``, :attr:`cf_flags` es tratado como igual a ``0``, y cualquier modificación debido a ``from __future__ import`` es descartada.

source: Compiler flags.
es: Flags del compilador.

source: *cf_feature_version* is the minor Python version. It should be initialized to ``PY_MINOR_VERSION``.
es: *cf_feature_version* es la versión menor de Python. Debe ser inicializado a ``PY_MINOR_VERSION``.

source: The field is ignored by default, it is used if and only if ``PyCF_ONLY_AST`` flag is set in *cf_flags*.
es: El campo es ignorado por defecto, es usado si y solo si el flag ``PyCF_ONLY_AST`` está configurado en *cf_flags*.

source: Added *cf_feature_version* field.
es: Agregado el campo *cf_feature_version*.

source: This bit can be set in *flags* to cause division operator ``/`` to be interpreted as "true division" according to :pep:`238`.
es: Este bit puede ser configurado en *flags* para causar que un operador de división ``/`` sea interpretado como una "división real" de acuerdo a :pep:`238`.
