Repository: python/python-docs-es
Catalog: c-api/veryhigh.po
Languages: es

source: The Very High Level Layer
es: La capa de muy alto nivel

source: The functions in this chapter will let you execute Python source code given in a file or a buffer, but they will not let you interact in a more detailed way with the interpreter.
es: Las funciones en este capítulo te permitirán ejecutar código fuente de Python desde un archivo o un búfer, pero no te permitirán interactuar de una manera detallada con el intérprete.

source: Several of these functions accept a start symbol from the grammar as a parameter. The available start symbols are :const:`Py_eval_input`, :const:`Py_file_input`, and :const:`Py_single_input`. These are described following the functions which accept them as parameters.
es: Varias de estas funciones aceptan un símbolo de inicio de la gramática como parámetro. Los símbolos de inicio disponibles son :const:`Py_eval_input`, :const:`Py_file_input`, y :const:`Py_single_input`. Estos se describen siguiendo las funciones que los aceptan como parámetros.

source: Note also that several of these functions take :c:type:`FILE\*` parameters. One particular issue which needs to be handled carefully is that the :c:type:`FILE` structure for different C libraries can be different and incompatible. Under Windows (at least), it is possible for dynamically linked extensions to actually use different libraries, so care should be taken that :c:type:`FILE\*` parameters are only passed to these functions if it is certain that they were created by the same library that the Python runtime is using.
es: Tenga en cuenta también que varias de estas funciones toman parámetros :c:type:`FILE\*`. Una cuestión particular que debe manejarse con cuidado es que la estructura :c:type:`FILE` para diferentes bibliotecas en C puede ser diferente e incompatible. En Windows (al menos), es posible que las extensiones vinculadas dinámicamente utilicen diferentes bibliotecas, por lo que se debe tener cuidado de que los parámetros :c:type:`FILE\*` solo se pasen a estas funciones si es seguro que estaban creado por la misma biblioteca que está utilizando el tiempo de ejecución de Python.

source: The main program for the standard interpreter. This is made available for programs which embed Python. The *argc* and *argv* parameters should be prepared exactly as those which are passed to a C program's :c:func:`main` function (converted to wchar_t according to the user's locale). It is important to note that the argument list may be modified (but the contents of the strings pointed to by the argument list are not). The return value will be ``0`` if the interpreter exits normally (i.e., without an exception), ``1`` if the interpreter exits due to an exception, or ``2`` if the parameter list does not represent a valid Python command line.
es: El programa principal para el intérprete estándar. Está disponible para programas que incorporan Python. Los parámetros *argc* y *argv* deben prepararse exactamente como los que se pasan a la función :c:func:`main` de un programa en C (convertido a wchar_t de acuerdo con la configuración regional del usuario). Es importante tener en cuenta que la lista de argumentos puede ser modificada (pero el contenido de las cadenas de caracteres señaladas por la lista de argumentos no lo es). El valor de retorno será ``0`` si el intérprete acaba normalmente (es decir, sin excepción), ``1`` si el intérprete acaba debido a una excepción, o ``2`` si la lista de parámetros no representa una línea de comando Python válida.

source: Note that if an otherwise unhandled :exc:`SystemExit` is raised, this function will not return ``1``, but exit the process, as long as ``Py_InspectFlag`` is not set.
es: Tenga en cuenta que si se lanza un :exc:`SystemExit` no manejado, esta función no devolverá ``1``, pero saldrá del proceso, siempre que ``Py_InspectFlag`` no esté configurado.

source: Similar to :c:func:`Py_Main` but *argv* is an array of bytes strings.
es: Similar a :c:func:`Py_Main` pero *argv* es un arreglo de cadenas de caracteres de bytes.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_AnyFileExFlags` más abajo, dejando *closeit* establecido a ``0`` y *flags* establecido a ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving the *closeit* argument set to ``0``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_AnyFileExFlags` más abajo, dejando *closeit* establecido a ``0``.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving the *flags* argument set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_AnyFileExFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: If *fp* refers to a file associated with an interactive device (console or terminal input or Unix pseudo-terminal), return the value of :c:func:`PyRun_InteractiveLoop`, otherwise return the result of :c:func:`PyRun_SimpleFile`. *filename* is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`). If *filename* is ``NULL``, this function uses ``"???"`` as the filename.
es: Si *fp* se refiere a un archivo asociado con un dispositivo interactivo (entrada de consola o terminal o pseudo-terminal Unix), devuelve el valor de :c:func:`PyRun_InteractiveLoop`, de lo contrario devuelve el resultado de :c:func:`PyRun_SimpleFile`. *filename* se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`). Si *filename* es ``NULL``, esta función usa ``"???"`` como nombre de archivo.

source: This is a simplified interface to :c:func:`PyRun_SimpleStringFlags` below, leaving the :c:type:`PyCompilerFlags`\* argument set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_SimpleStringFlags` más abajo, dejando el argumento :c:type:`PyCompilerFlags`\* establecido a ``NULL``.

source: Executes the Python source code from *command* in the :mod:`__main__` module according to the *flags* argument. If :mod:`__main__` does not already exist, it is created. Returns ``0`` on success or ``-1`` if an exception was raised. If there was an error, there is no way to get the exception information. For the meaning of *flags*, see below.
es: Ejecuta el código fuente de Python desde *command* en el módulo :mod:`__main__` de acuerdo con el argumento *flags*. Si :mod:`__main__` aún no existe, se crea. Retorna ``0`` en caso de éxito o ``-1`` si se produjo una excepción. Si hubo un error, no hay forma de obtener la información de excepción. Para el significado de *flags*, ver abajo.

source: Note that if an otherwise unhandled :exc:`SystemExit` is raised, this function will not return ``-1``, but exit the process, as long as ``Py_InspectFlag`` is not set.
es: Tenga en cuenta que si no se maneja de otro modo :exc:`SystemExit`, esta función no devolverá ``-1``, pero saldrá del proceso, siempre que ``Py_InspectFlag`` no esté configurado.

source: This is a simplified interface to :c:func:`PyRun_SimpleFileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_SimpleStringFlags` más abajo, dejando *closeit* establecido a ``0`` y *flags* establecido a ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_SimpleFileExFlags` below, leaving *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_SimpleStringFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: Similar to :c:func:`PyRun_SimpleStringFlags`, but the Python source code is read from *fp* instead of an in-memory string. *filename* should be the name of the file, it is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`). If *closeit* is true, the file is closed before PyRun_SimpleFileExFlags returns.
es: Similar a :c:func:`PyRun_SimpleStringFlags`, pero el código fuente de Python se lee desde *fp* en lugar de una cadena de caracteres en memoria. *filename* debe ser el nombre del archivo, se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`). Si *closeit* es verdadero, el archivo se cierra antes de que PyRun_SimpleFileExFlags retorne.

source: On Windows, *fp* should be opened as binary mode (e.g. ``fopen(filename, "rb")``. Otherwise, Python may not handle script file with LF line ending correctly.
es: En Windows, *fp* debe abrirse en modo binario (por ejemplo, ``fopen(filename, "rb")``. De lo contrario, Python puede no manejar correctamente el archivo de script con la terminación de línea LF.

source: This is a simplified interface to :c:func:`PyRun_InteractiveOneFlags` below, leaving *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_InteractiveOneFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: Read and execute a single statement from a file associated with an interactive device according to the *flags* argument. The user will be prompted using ``sys.ps1`` and ``sys.ps2``. *filename* is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`).
es: Lee y ejecuta declaraciones de un archivo asociado con un dispositivo interactivo de acuerdo al argumento *flags*. Se le solicitará al usuario usando ``sys.ps1`` y ``sys.ps2``. *filename* se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`).

source: Returns ``0`` when the input was executed successfully, ``-1`` if there was an exception, or an error code from the :file:`errcode.h` include file distributed as part of Python if there was a parse error. (Note that :file:`errcode.h` is not included by :file:`Python.h`, so must be included specifically if needed.)
es: Retorna ``0`` cuando la entrada se ejecuta con éxito, ``-1`` si hubo una excepción, o un código de error del archivo :file:`errcode.h` distribuido como parte de Python si hubo un error de análisis gramatical. (Tenga en cuenta que :file:`errcode.h` no está incluido en :file:`Python.h`, por lo que debe incluirse específicamente si es necesario).

source: This is a simplified interface to :c:func:`PyRun_InteractiveLoopFlags` below, leaving *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_InteractiveLoopFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: Read and execute statements from a file associated with an interactive device until EOF is reached. The user will be prompted using ``sys.ps1`` and ``sys.ps2``. *filename* is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`). Returns ``0`` at EOF or a negative number upon failure.
es: Lee y ejecuta declaraciones de un archivo asociado con un dispositivo interactivo hasta llegar al EOF. Se le solicitará al usuario usando ``sys.ps1`` y ``sys.ps2``. *filename* se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`). Retorna ``0`` en EOF o un número negativo en caso de falla.

source: Can be set to point to a function with the prototype ``int func(void)``. The function will be called when Python's interpreter prompt is about to become idle and wait for user input from the terminal. The return value is ignored. Overriding this hook can be used to integrate the interpreter's prompt with other event loops, as done in the :file:`Modules/_tkinter.c` in the Python source code.
es: Se puede configurar para que apunte a una función con el prototipo ``int func(void)``. Se llamará a la función cuando el indicador del intérprete de Python esté a punto de estar inactivo y espere la entrada del usuario desde el terminal. El valor de retorno es ignorado. Sobrescribiendo este enlace se puede utilizar para integrar la solicitud del intérprete con otros bucles de eventos, como se hace en :file:`Modules/_tkinter.c` en el código fuente de Python.

source: Can be set to point to a function with the prototype ``char *func(FILE *stdin, FILE *stdout, char *prompt)``, overriding the default function used to read a single line of input at the interpreter's prompt. The function is expected to output the string *prompt* if it's not ``NULL``, and then read a line of input from the provided standard input file, returning the resulting string. For example, The :mod:`readline` module sets this hook to provide line-editing and tab-completion features.
es: Se puede configurar para que apunte a una función con el prototipo ``char *func (FILE *stdin, FILE *stdout, char *prompt)``, sobrescribiendo la función predeterminada utilizada para leer una sola línea de entrada desde el intérprete. Se espera que la función genere la cadena de caracteres *prompt* si no es ``NULL``, y luego lea una línea de entrada del archivo de entrada estándar proporcionado, retornando la cadena de caracteres resultante. Por ejemplo, el módulo :mod:`readline` establece este enlace para proporcionar funciones de edición de línea y finalización de tabulación.

source: The result must be a string allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, or ``NULL`` if an error occurred.
es: El resultado debe ser una cadena de caracteres alocado por :c:func:`PyMem_RawMalloc` o :c:func:`PyMem_RawRealloc`, o ``NULL`` si ocurre un error.

source: The result must be allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, instead of being allocated by :c:func:`PyMem_Malloc` or :c:func:`PyMem_Realloc`.
es: El resultado debe ser alocado por :c:func:`PyMem_RawMalloc` o :c:func:`PyMem_RawRealloc`, en vez de ser alocado por :c:func:`PyMem_Malloc` o :c:func:`PyMem_Realloc`.

source: This is a simplified interface to :c:func:`PyParser_SimpleParseStringFlagsFilename` below, leaving *filename* set to ``NULL`` and *flags* set to ``0``.
es: Esta es una interfaz simplificada para :c:func:`PyParser_SimpleParseStringFlagsFilename` más abajo, dejando *filename* establecido a ``NULL`` y *flags* establecido a ``0``.

source: This is a simplified interface to :c:func:`PyParser_SimpleParseStringFlagsFilename` below, leaving *filename* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyParser_SimpleParseStringFlagsFilename` más abajo, dejando *filename* establecido a ``NULL``.

source: Parse Python source code from *str* using the start token *start* according to the *flags* argument. The result can be used to create a code object which can be evaluated efficiently. This is useful if a code fragment must be evaluated many times. *filename* is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`).
es: Analiza gramaticalmente el código fuente de Python desde *str* usando el token de inicio *start* de acuerdo con el argumento *flags*. El resultado se puede usar para crear un objeto de código que se puede evaluar de manera eficiente. Esto es útil si un fragmento de código debe evaluarse muchas veces. *filename* se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`).

source: This is a simplified interface to :c:func:`PyParser_SimpleParseFileFlags` below, leaving *flags* set to ``0``.
es: Esta es una interfaz simplificada para :c:func:`PyParser_SimpleParseFileFlags` más abajo, dejando *flags* establecido a ``0``.

source: Similar to :c:func:`PyParser_SimpleParseStringFlagsFilename`, but the Python source code is read from *fp* instead of an in-memory string.
es: Similar a :c:func:`PyParser_SimpleParseStringFlagsFilename`, pero el código fuente de Python se lee desde *fp* en lugar de una cadena de caracteres en memoria.

source: This is a simplified interface to :c:func:`PyRun_StringFlags` below, leaving *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_StringFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: Execute Python source code from *str* in the context specified by the objects *globals* and *locals* with the compiler flags specified by *flags*. *globals* must be a dictionary; *locals* can be any object that implements the mapping protocol. The parameter *start* specifies the start token that should be used to parse the source code.
es: Ejecuta el código fuente de Python desde *str* en el contexto especificado por los objetos *globals* y *locals* con los indicadores del compilador especificados por *flags*. *globals* debe ser un diccionario; *locals* puede ser cualquier objeto que implemente el protocolo de mapeo. El parámetro *start* especifica el token de inicio que se debe usar para analizar el código fuente.

source: Returns the result of executing the code as a Python object, or ``NULL`` if an exception was raised.
es: Devuelve el resultado de ejecutar el código como un objeto Python, o ``NULL``' si se produjo una excepción.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_FileExFlags` más abajo, dejando *closeit* establecido a ``0`` y *flags* establecido a ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_FileExFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *closeit* set to ``0``.
es: Esta es una interfaz simplificada para :c:func:`PyRun_FileExFlags` más abajo, dejando *closeit* establecido a ``0``.

source: Similar to :c:func:`PyRun_StringFlags`, but the Python source code is read from *fp* instead of an in-memory string. *filename* should be the name of the file, it is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`). If *closeit* is true, the file is closed before :c:func:`PyRun_FileExFlags` returns.
es: Similar a :c:func:`PyRun_StringFlags`, pero el código fuente de Python se lee desde *fp* en lugar de una cadena de caracteres en memoria. *filename* debe ser el nombre del archivo, se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`). Si *closeit* es verdadero, el archivo se cierra antes que :c:func:`PyRun_FileExFlags` retorne.

source: This is a simplified interface to :c:func:`Py_CompileStringFlags` below, leaving *flags* set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`Py_CompileStringFlags` más abajo, dejando *flags* establecido a ``NULL``.

source: This is a simplified interface to :c:func:`Py_CompileStringExFlags` below, with *optimize* set to ``-1``.
es: Esta es una interfaz simplificada para :c:func:`Py_CompileStringExFlags` más abajo, con *optimize* establecido a ``-1``.

source: Parse and compile the Python source code in *str*, returning the resulting code object. The start token is given by *start*; this can be used to constrain the code which can be compiled and should be :const:`Py_eval_input`, :const:`Py_file_input`, or :const:`Py_single_input`. The filename specified by *filename* is used to construct the code object and may appear in tracebacks or :exc:`SyntaxError` exception messages. This returns ``NULL`` if the code cannot be parsed or compiled.
es: Analiza gramaticalmente y compila el código fuente de Python en *str*, devolviendo el objeto de código resultante. El token de inicio viene dado por *start*; esto se puede usar para restringir el código que se puede compilar y debe ser :const:`Py_eval_input`, :const:`Py_file_input`, o :const:`Py_single_input`. El nombre de archivo especificado por *filename* se usa para construir el objeto de código y puede aparecer en *tracebacks* o mensajes de excepción :exc:`SyntaxError`. Esto devuelve ``NULL``' si el código no se puede analizar gramaticalmente o compilar.

source: The integer *optimize* specifies the optimization level of the compiler; a value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
es: El número entero *optimize* especifica el nivel de optimización del compilador; un valor de ``-1`` selecciona el nivel de optimización del intérprete como se indica en las opciones :option:`-O`. Los niveles explícitos son ``0`` (sin optimización; ``__debug__`` es verdadero), ``1`` (los *asserts* se eliminan, ``__debug__`` es falso) o ``2`` (los docstrings también se eliminan) )

source: Like :c:func:`Py_CompileStringObject`, but *filename* is a byte string decoded from the filesystem encoding (:func:`os.fsdecode`).
es: Como :c:func:`Py_CompileStringObject`, pero *filename* es una cadena de caracteres de byte decodificado desde la codificación del sistema de archivos (:func:`os.fsdecode`).

source: This is a simplified interface to :c:func:`PyEval_EvalCodeEx`, with just the code object, and global and local variables. The other arguments are set to ``NULL``.
es: Esta es una interfaz simplificada para :c:func:`PyEval_EvalCodeEx`, con solo el objeto de código y las variables globales y locales. Los otros argumentos están establecidos en ``NULL``.

source: Evaluate a precompiled code object, given a particular environment for its evaluation. This environment consists of a dictionary of global variables, a mapping object of local variables, arrays of arguments, keywords and defaults, a dictionary of default values for :ref:`keyword-only <keyword-only_parameter>` arguments and a closure tuple of cells.
es: Evaluar un objeto de código precompilado, dado un entorno particular para su evaluación. Este entorno consta de un diccionario de variables globales, un objeto de mapeo de variables locales, arreglos de argumentos, palabras clave y valores predeterminados, un diccionario de valores predeterminados para argumentos :ref:`keyword-only <keyword-only_parameter>` y una tupla de cierre de células.

source: The C structure of the objects used to describe frame objects. The fields of this type are subject to change at any time.
es: La estructura en C de los objetos utilizados para describir objetos del marco. Los campos de este tipo están sujetos a cambios en cualquier momento.

source: Evaluate an execution frame. This is a simplified interface to :c:func:`PyEval_EvalFrameEx`, for backward compatibility.
es: Evaluar un marco de ejecución. Esta es una interfaz simplificada para :c:func:`PyEval_EvalFrameEx`, para compatibilidad con versiones anteriores.

source: This is the main, unvarnished function of Python interpretation. The code object associated with the execution frame *f* is executed, interpreting bytecode and executing calls as needed. The additional *throwflag* parameter can mostly be ignored - if true, then it causes an exception to immediately be thrown; this is used for the :meth:`~generator.throw` methods of generator objects.
es: Esta es la función principal sin barnizar de la interpretación de Python. El objeto de código asociado con el marco de ejecución del marco *f* se ejecuta, interpretando el código de bytes y ejecutando llamadas según sea necesario. El parámetro adicional *throwflag* se puede ignorar por lo general; si es verdadero, entonces se genera una excepción de inmediato; esto se usa para los métodos :meth:`~generator.throw` de objetos generadores.

source: This function now includes a debug assertion to help ensure that it does not silently discard an active exception.
es: Esta función ahora incluye una afirmación de depuración para ayudar a garantizar que no descarte silenciosamente una excepción activa.
