Repository: python/python-docs-es
Catalog: installing/index.po
Languages: es_es

source: Installing Python Modules
es_es: Instalando módulos de Python

source: Email
es_es: Correo electrónico

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
es_es: Como un proyecto popular de desarrollo de código abierto, Python tiene una comunidad activa de soporte de contribuyentes y usuarios que también hacen que su software esté disponible para que otros desarrolladores de Python lo usen bajo términos de licencia de código abierto.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
es_es: Esto permite a los usuarios de Python compartir y colaborar de manera efectiva, beneficiándose de las soluciones que otros ya han creado para problemas comunes (¡y a veces incluso raros!), además de contribuir potencialmente con sus propias soluciones al grupo común.

source: This guide covers the installation part of the process. For a guide to creating and sharing your own Python projects, refer to the :ref:`distribution guide <distributing-index>`.
es_es: Esta guía cubre la parte de instalación del proceso. Para obtener una guía para crear y compartir sus propios proyectos de Python, consulta la :ref:`guía de distribución <distributing-index>`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
es_es: Para los usuarios corporativos y otros usuarios institucionales, se debe tener en cuenta que muchas organizaciones tienen sus propias políticas sobre el uso y la contribución al software de código abierto. Se deben tener en cuenta dichas políticas al utilizar las herramientas de distribución e instalación proporcionadas con Python.

source: Key terms
es_es: Palabras clave

source: ``pip`` is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers.
es_es: ``pip`` es el programa de instalación preferido. Desde Python 3.4 viene incluido por defecto con los instaladores binarios de Python.

source: A *virtual environment* is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.
es_es: Un *entorno virtual* es un entorno de Python parcialmente aislado que permite instalar paquetes para que los use una aplicación en particular, en lugar de instalarlos en todo el sistema.

source: ``venv`` is the standard tool for creating virtual environments, and has been part of Python since Python 3.3. Starting with Python 3.4, it defaults to installing ``pip`` into all created virtual environments.
es_es: ``venv`` es la herramienta estándar para crear entornos virtuales, y ha sido parte de Python desde Python 3.3. A partir de Python 3.4, instala ``pip`` en todos los entornos virtuales que se crean.

source: ``virtualenv`` is a third party alternative (and predecessor) to ``venv``. It allows virtual environments to be used on versions of Python prior to 3.4, which either don't provide ``venv`` at all, or aren't able to automatically install ``pip`` into created environments.
es_es: ``virtualenv`` es una alternativa de terceros (y predecesora) a ``venv``. Permite usar entornos virtuales en versiones de Python anteriores a la 3.4, ya que, o no incluyen ``venv`` en absoluto o no pueden instalar automáticamente ``pip`` en los entornos recién creados.

source: The `Python Packaging Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users.
es_es: El `Índice de paquetes de Python <https://pypi.org>`__ es un repositorio público de paquetes bajo licencias de código abierto disponibles para otros usuarios de Python.

source: the `Python Packaging Authority <https://www.pypa.io/>`__ is the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation, and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
es_es: la `Python Packaging Authority <https://www.pypa.io/>`__ es el grupo de desarrolladores y autores de documentación responsables del mantenimiento y evolución de las herramientas estándar de empaquetado y de los estándares de metadatos y formatos de archivo. Mantienen una variedad de herramientas, documentación y rastreadores de problemas en `GitHub <https://github.com/pypa>`__ y `Bitbucket <https://bitbucket.org/pypa/>`__.

source: ``distutils`` is the original build and distribution system first added to the Python standard library in 1998. While direct use of ``distutils`` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
es_es: ``distutils`` es el sistema original de compilación y distribución que se agregó por primera vez a la biblioteca estándar de Python en 1998. Si bien el uso directo de ``distutils`` se está eliminando gradualmente, sentó las bases para la infraestructura actual de empaquetado y distribución, y no solo sigue siendo parte de la biblioteca estándar, sino que su nombre sigue vivo de otras maneras (como el nombre de la lista de correo utilizada para coordinar el desarrollo de estándares de empaquetado de Python).

source: The use of ``venv`` is now recommended for creating virtual environments.
es_es: Ahora se recomienda el uso de ``venv`` para crear entornos virtuales.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
es_es: `Guía de usuario de empaquetado de Python: Crear y usar entornos virtuales <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: Basic usage
es_es: Uso básico

source: The standard packaging tools are all designed to be used from the command line.
es_es: Las herramientas estándar de empaquetado están diseñadas para que se usen desde la línea de comandos.

source: The following command will install the latest version of a module and its dependencies from the Python Packaging Index::
es_es: El siguiente comando instalará la última versión de un módulo y sus dependencias desde el índice de paquetes de Python::

source: For POSIX users (including Mac OS X and Linux users), the examples in this guide assume the use of a :term:`virtual environment`.
es_es: Para usuarios POSIX (incluyendo los usuarios de MacOS y Linux), los ejemplos en esta guía asumen que se está usando un :term:`virtual environment`.

source: For Windows users, the examples in this guide assume that the option to adjust the system PATH environment variable was selected when installing Python.
es_es: Para los usuarios de Windows, los ejemplos en esta guía asumen que se seleccionó la opción de ajustar la variable de entorno PATH del sistema al instalar Python.

source: It's also possible to specify an exact or minimum version directly on the command line. When using comparator operators such as ``>``, ``<`` or some other special character which get interpreted by shell, the package name and the version should be enclosed within double quotes::
es_es: Es posible especificar una versión exacta o mínima directamente en la linea de comandos. Cuando se use un operando comparador como ``>``, ``<`` o cualquier otro carácter especial que puede ser interpretado por el intérprete de comandos, el nombre del paquete y la versión deben ir entre comillas dobles::

source: Normally, if a suitable module is already installed, attempting to install it again will have no effect. Upgrading existing modules must be requested explicitly::
es_es: Normalmente, si ya hay instalado un módulo adecuado, intentar instalarlo otra vez no tendrá efecto alguno. Actualizar módulos existentes requiere que se solicite explícitamente::

source: More information and resources regarding ``pip`` and its capabilities can be found in the `Python Packaging User Guide <https://packaging.python.org>`__.
es_es: Se puede encontrar más información y recursos acerca de ``pip`` y sus capacidades en la `Guía de usuario de empaquetado de Python <https://packaging.python.org>`__.

source: Creation of virtual environments is done through the :mod:`venv` module. Installing packages into an active virtual environment uses the commands shown above.
es_es: La creación de entornos virtuales se realiza a través de el módulo :mod:`venv`. Instalar paquetes en un entorno virtual activo usa los comandos mostrados arriba.

source: `Python Packaging User Guide: Installing Python Distribution Packages <https://packaging.python.org/installing/>`__
es_es: `Guía de usuario de empaquetado de Python: Instalando paquetes de distribución de Python <https://packaging.python.org/installing/>`__

source: How do I ...?
es_es: ¿Cómo...

source: These are quick answers or links for some common tasks.
es_es: Respuestas rápidas o enlaces para algunas tareas comunes.

source: ... install ``pip`` in versions of Python prior to Python 3.4?
es_es: ... instalo ``pip`` en versiones de Python anteriores a Python 3.4?

source: Python only started bundling ``pip`` with Python 3.4. For earlier versions, ``pip`` needs to be "bootstrapped" as described in the Python Packaging User Guide.
es_es: Se empezó a incluir ``pip`` en Python con la versión de Python 3.4. Para versiones anteriores, ``pip`` tiene que ser instalado tal y como se describe en la Guía de usuario de empaquetado de Python.

source: `Python Packaging User Guide: Requirements for Installing Packages <https://packaging.python.org/installing/#requirements-for-installing-packages>`__
es_es: `Guía de usuario de empaquetado de Python: Requisitos para instalar paquetes <https://packaging.python.org/installing/#requirements-for-installing-packages>`__

source: ... install packages just for the current user?
es_es: ... instalo paquetes solamente para el usuario actual?

source: Passing the ``--user`` option to ``python -m pip install`` will install a package just for the current user, rather than for all users of the system.
es_es: Pasando la opción ``--user`` a ``python -m pip install`` instalará el paquete únicamente para el usuario actual, en lugar de hacerlo para todos los usuarios del sistema.

source: ... install scientific Python packages?
es_es: ... instalo paquetes científicos de Python?

source: A number of scientific Python packages have complex binary dependencies, and aren't currently easy to install using ``pip`` directly. At this point in time, it will often be easier for users to install these packages by `other means <https://packaging.python.org/science/>`__ rather than attempting to install them with ``pip``.
es_es: Varios paquetes científicos de Python tienen dependencias binarias complejas y no se pueden instalar fácilmente usando ``pip`` directamente. En este momento, a menudo será más fácil para los usuarios instalar estos paquetes `por otros medios <https://packaging.python.org/science/>`__ en lugar de intentar instalarlos usando ``pip``.

source: `Python Packaging User Guide: Installing Scientific Packages <https://packaging.python.org/science/>`__
es_es: `Guía de usuario de empaquetado de Python: Instalando paquetes científicos <https://packaging.python.org/science/>`__

source: ... work with multiple versions of Python installed in parallel?
es_es: ... trabajo con múltiples versiones de Python instaladas en paralelo?

source: On Linux, Mac OS X, and other POSIX systems, use the versioned Python commands in combination with the ``-m`` switch to run the appropriate copy of ``pip``::
es_es: En Linux, Mac OS X y otros sistemas POSIX, usa los comandos versionados de Python en combinación con la opción `` -m`` para ejecutar la copia apropiada de ``pip`` ::

source: Appropriately versioned ``pip`` commands may also be available.
es_es: Los comandos `` pip '' adecuadamente versionados también pueden estar disponibles.

source: On Windows, use the ``py`` Python launcher in combination with the ``-m`` switch::
es_es: En Windows, use el lanzador de Python `` py`` en combinación con el interruptor `` -m`` ::

source: Common installation issues
es_es: Problemas de instalación comunes

source: Installing into the system Python on Linux
es_es: Instalando en el Python del sistema bajo Linux

source: On Linux systems, a Python installation will typically be included as part of the distribution. Installing into this Python installation requires root access to the system, and may interfere with the operation of the system package manager and other components of the system if a component is unexpectedly upgraded using ``pip``.
es_es: En sistemas Linux, una instalación de Python se incluye como parte de la distribución. Instalar en esta instalación de Python requiere permisos de administrador de sistema y si algún componente se actualiza usando ``pip`` esto puede interferir con en uso del gestor de paquetes del sistema u otros componentes.

source: On such systems, it is often better to use a virtual environment or a per-user installation when installing packages with ``pip``.
es_es: En estos sistemas, es generalmente mejor usar un entorno virtual o una instalación por usuario cuando se instalen paquetes con ``pip``.

source: Pip not installed
es_es: Pip no está instalado

source: It is possible that ``pip`` does not get installed by default. One potential fix is::
es_es: Es posible que ``pip`` no se instale por defecto. Una posible solución es::

source: There are also additional resources for `installing pip. <https://packaging.python.org/tutorials/installing-packages/#install-pip-setuptools-and-wheel>`__
es_es: Hay recursos adicionales para `instalar pip. <https://packaging.python.org/tutorials/installing-packages/#install-pip-setuptools-and-wheel>`__

source: Installing binary extensions
es_es: Instalando extensiones binarias

source: Python has typically relied heavily on source based distribution, with end users being expected to compile extension modules from source as part of the installation process.
es_es: Python generalmente se ha basado en gran medida en la distribución basada en el código fuente, y se espera que los usuarios finales compilen módulos de extensión desde la fuente como parte del proceso de instalación.

source: With the introduction of support for the binary ``wheel`` format, and the ability to publish wheels for at least Windows and Mac OS X through the Python Packaging Index, this problem is expected to diminish over time, as users are more regularly able to install pre-built extensions rather than needing to build them themselves.
es_es: Con la introducción del soporte para el formato binario ``wheel``, y la posibilidad de publicar paquetes en formato ``wheel`` por lo menos para Windows y Mac OS X a través del Índice de paquetes de Python, se espera que este problema se atenúe con el tiempo, ya que los usuarios pueden, con mayor regularidad, instalar extensiones precompiladas en lugar de tener que compilarlas.

source: Some of the solutions for installing `scientific software <https://packaging.python.org/science/>`__ that are not yet available as pre-built ``wheel`` files may also help with obtaining other binary extensions without needing to build them locally.
es_es: Algunas de las soluciones para instalar `software científico <https://packaging.python.org/science/>`__ aún no disponible como archivo ``wheel`` precompilado pueden ser de ayuda para obtener otras extensiones binarias sin tener que compilarlas localmente.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/extensions/>`__
es_es: `Guía de usuario de empaquetado de Python: Extensiones binarias <https://packaging.python.org/extensions/>`__
